         TITLE 'IEDOPTN, FIND A SPECIFIED OPTION FIELD                 *00001000
                        '                                               00002000
IEDOPTN  CSECT ,                                                   0001 00003000
@PROLOG  STM   @02,@12,28(@13)                                     0001 00004000
         BALR  @12,0                                               0001 00005000
@PSTART  DS    0H                                                  0001 00006000
         USING @PSTART,@12                                         0001 00007000
*                                                                  0075 00008000
IEDOPTN  IEDHJN START,HJN                                               00009000
*/*                                                                  */ 00010000
*                                                                  0076 00011000
*                                   /* INITIALIZATION                */ 00012000
*   RAVT=TCXAVT;                    /* ADDRESS OF TCAM AVT           */ 00013000
         L     @11,CVTPTR                                          0076 00014000
         L     @11,TCXPTR(,@11)                                    0076 00015000
         L     RAVT,TCXAVT(,@11)                                   0076 00016000
*   RTRM=RPARM;                     /* ADDRESS OF TTE                */ 00017000
         LR    RTRM,RPARM                                          0077 00018000
*   RF=NOTFOUND;                    /* SET BAD RETURN CODE           */ 00019000
         LA    RF,255                                              0078 00020000
*   ROPSWTCH=OFF;                   /* SET OPTION SWITCH OFF         */ 00021000
         SLR   ROPSWTCH,ROPSWTCH                                   0079 00022000
*   IF TRMOPTFN=ON THEN             /* OPTION FIELDS USED            */ 00023000
         TM    TRMOPTFN(IEDQTPTR),B'00000010'                      0080 00024000
         BNO   @RF00080                                            0080 00025000
*     DO;                                                          0081 00026000
*       RCOUNT=0;                   /* SET COUNTER TO ZERO           */ 00027000
         SLR   RCOUNT,RCOUNT                                       0082 00028000
*       RTBLPTR=OPTCHPTR;           /* POINTER TO OPTION           0083 00029000
*                                      CHARACTERISTICS TABLE         */ 00030000
         L     @11,AVTOPTPT(,RAVT)                                 0083 00031000
         L     RTBLPTR,OPTCHPTR(,@11)                              0083 00032000
*       DO WHILE ROPSWTCH=OFF&OPTCHLEN<NOTFOUND;/* NOT END OF TABLE     00033000
*                                      AND MATCH NOT FOUND...        */ 00034000
         B     @DE00084                                            0084 00035000
@DL00084 DS    0H                                                  0085 00036000
*         RCOUNT=RCOUNT+1;          /* ADD ONE TO COUNTER            */ 00037000
         LA    @11,1                                               0085 00038000
         ALR   RCOUNT,@11                                          0085 00039000
*         IF RZERO->PARMNAME=RTBLPTR->OPTCHNAM THEN/* OPTION NAME  0086 00040000
*                                      FOUND                         */ 00041000
         LR    @10,RZERO                                           0086 00042000
         CLC   PARMNAME(8,@10),OPTCHNAM(RTBLPTR)                   0086 00043000
         BNE   @RF00086                                            0086 00044000
*           DO;                                                    0087 00045000
*             ROPSWTCH=ON;          /* SET SWITCH ON                 */ 00046000
         LA    ROPSWTCH,1                                          0088 00047000
*             IF RCOUNT<=TRMOPNO&CUROPTN(RCOUNT)^=NOTFOUND THEN/*  0089 00048000
*                                      OPTION SPECIFIED FOR THIS   0089 00049000
*                                      TERMINAL AND THE OPTION DATA     00050000
*                                      IS VALID                      */ 00051000
         SLR   @10,@10                                             0089 00052000
         IC    @10,TRMOPNO(,IEDQTPTR)                              0089 00053000
         CR    RCOUNT,@10                                          0089 00054000
         BH    @RF00089                                            0089 00055000
         LA    @10,20                                              0089 00056000
         ALR   @10,IEDQTPTR                                        0089 00057000
         LR    @07,@10                                             0089 00058000
         ALR   @07,RCOUNT                                          0089 00059000
         BCTR  @07,0                                               0089 00060000
         CLI   CUROPTN(@07),X'FF'                                  0089 00061000
         BE    @RF00089                                            0089 00062000
*               DO;                                                0090 00063000
*                 RZERO=RTBLPTR->OPTCHLEN+1;/* OPTION DATA LENGTH    */ 00064000
         SLR   RZERO,RZERO                                         0091 00065000
         IC    RZERO,OPTCHLEN(,RTBLPTR)                            0091 00066000
         ALR   @11,RZERO                                           0091 00067000
         LR    RZERO,@11                                           0091 00068000
*                 RPARM=AVTOPTPT+TRMOPTBL+CUROPTN(RCOUNT);/* ADDRESS    00069000
*                                      OF OPTION DATA FIELD          */ 00070000
         LH    RPARM,TRMOPTBL(,IEDQTPTR)                           0092 00071000
         N     RPARM,@CF01497                                      0092 00072000
         AL    RPARM,AVTOPTPT(,RAVT)                               0092 00073000
         BCTR  @10,0                                               0092 00074000
         SLR   @11,@11                                             0092 00075000
         IC    @11,CUROPTN(RCOUNT,@10)                             0092 00076000
         ALR   RPARM,@11                                           0092 00077000
*                 RF=0;             /* SET GOOD RETURN CODE          */ 00078000
         SLR   RF,RF                                               0093 00079000
*               END;                                               0094 00080000
*           END;                                                   0095 00081000
*         ELSE                                                     0096 00082000
*           RTBLPTR=RTBLPTR+LENGTH(OPTCHENT);/* BUMP TO NEXT ENTRY   */ 00083000
         B     @RC00086                                            0096 00084000
@RF00086 AL    RTBLPTR,@CF01491                                    0096 00085000
*       END;                                                       0097 00086000
@RC00086 DS    0H                                                  0097 00087000
@DE00084 LTR   ROPSWTCH,ROPSWTCH                                   0097 00088000
         BNZ   @DC00084                                            0097 00089000
         CLI   OPTCHLEN(RTBLPTR),X'FF'                             0097 00090000
         BL    @DL00084                                            0097 00091000
@DC00084 DS    0H                                                  0098 00092000
*     END;                                                         0098 00093000
*   END IEDOPTN                                                    0099 00094000
*                                                                  0099 00095000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00096000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00097000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00098000
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */ 00099000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00100000
*                                                                  0099 00101000
*       ;                                                          0099 00102000
@EL00001 DS    0H                                                  0099 00103000
@EF00001 DS    0H                                                  0099 00104000
@ER00001 LM    @02,@12,28(@13)                                     0099 00105000
         BR    @14                                                 0099 00106000
@DATA    DS    0H                                                       00107000
         DS    0F                                                       00108000
         DS    0F                                                       00109000
@CF01491 DC    F'10'                                                    00110000
@CF01497 DC    XL4'0000FFFF'                                            00111000
         DS    0D                                                       00112000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00113000
@01      EQU   01                                                       00114000
@02      EQU   02                                                       00115000
@03      EQU   03                                                       00116000
@04      EQU   04                                                       00117000
@05      EQU   05                                                       00118000
@06      EQU   06                                                       00119000
@07      EQU   07                                                       00120000
@08      EQU   08                                                       00121000
@09      EQU   09                                                       00122000
@10      EQU   10                                                       00123000
@11      EQU   11                                                       00124000
@12      EQU   12                                                       00125000
@13      EQU   13                                                       00126000
@14      EQU   14                                                       00127000
@15      EQU   15                                                       00128000
IEDQAPTR EQU   @09                                                      00129000
IEDQTPTR EQU   @08                                                      00130000
RAVT     EQU   @09                                                      00131000
RZERO    EQU   @00                                                      00132000
RPARM    EQU   @01                                                      00133000
RCOUNT   EQU   @02                                                      00134000
RTBLPTR  EQU   @03                                                      00135000
ROPSWTCH EQU   @04                                                      00136000
RWORK    EQU   @05                                                      00137000
RTRM     EQU   @08                                                      00138000
RBASE    EQU   @12                                                      00139000
RSAVE    EQU   @13                                                      00140000
RE       EQU   @14                                                      00141000
RF       EQU   @15                                                      00142000
CVTPTR   EQU   16                                                       00143000
IEDQAVTD EQU   0                                                        00144000
AVTSAVEX EQU   IEDQAVTD+288                                             00145000
@NM00003 EQU   IEDQAVTD+388                                             00146000
AVTCKFLG EQU   @NM00003                                                 00147000
AVTBASE  EQU   IEDQAVTD+412                                             00148000
AVTPKF   EQU   AVTBASE                                                  00149000
AVTOSECB EQU   IEDQAVTD+492                                             00150000
AVTECB1  EQU   AVTOSECB                                                 00151000
AVTOPTPT EQU   IEDQAVTD+500                                             00152000
AVTHG02  EQU   IEDQAVTD+528                                             00153000
AVTDISP  EQU   IEDQAVTD+552                                             00154000
AVTHD    EQU   IEDQAVTD+556                                             00155000
AVTSCOPT EQU   AVTHD                                                    00156000
AVTSAVTP EQU   IEDQAVTD+612                                             00157000
AVTSAVTF EQU   AVTSAVTP                                                 00158000
AVTCKPEL EQU   IEDQAVTD+652                                             00159000
AVTCKRMV EQU   AVTCKPEL                                                 00160000
AVTCKELF EQU   IEDQAVTD+680                                             00161000
AVTCKBYT EQU   IEDQAVTD+691                                             00162000
AVTHG01  EQU   IEDQAVTD+692                                             00163000
AVTCKLNK EQU   IEDQAVTD+696                                             00164000
AVTCRELE EQU   IEDQAVTD+708                                             00165000
AVTCCELE EQU   AVTCRELE                                                 00166000
AVTCLRHI EQU   IEDQAVTD+716                                             00167000
AVTADBUF EQU   IEDQAVTD+720                                             00168000
AVTSYSER EQU   IEDQAVTD+728                                             00169000
AVTCKPQB EQU   IEDQAVTD+804                                             00170000
AVTCKPTB EQU   AVTCKPQB                                                 00171000
AVTCKPEC EQU   AVTCKPQB+4                                               00172000
AVTCKPCC EQU   AVTCKPEC                                                 00173000
AVTOPCQB EQU   IEDQAVTD+816                                             00174000
AVTOPCOB EQU   AVTOPCQB                                                 00175000
AVTOPCEC EQU   AVTOPCQB+4                                               00176000
AVTOPCCC EQU   AVTOPCEC                                                 00177000
AVTOLTQB EQU   IEDQAVTD+828                                             00178000
AVTCWFL1 EQU   IEDQAVTD+924                                             00179000
AVTCWFL2 EQU   IEDQAVTD+925                                             00180000
AVTSUBT  EQU   IEDQAVTD+948                                             00181000
AVTIOTR  EQU   IEDQAVTD+949                                             00182000
AVTBIT1  EQU   IEDQAVTD+1050                                            00183000
AVTBIT2  EQU   IEDQAVTD+1051                                            00184000
AVTBIT3  EQU   IEDQAVTD+1052                                            00185000
AVTBIT4  EQU   IEDQAVTD+1136                                            00186000
@NM00085 EQU   IEDQAVTD+1232                                            00187000
IEDNSVTD EQU   0                                                        00188000
SAVTDIAG EQU   IEDNSVTD                                                 00189000
SAVTDIAF EQU   SAVTDIAG                                                 00190000
SAVTLUSQ EQU   IEDNSVTD+88                                              00191000
SAVTTCPU EQU   IEDNSVTD+238                                             00192000
SAVTZELM EQU   IEDNSVTD+270                                             00193000
SAVTRDRV EQU   IEDNSVTD+284                                             00194000
SAVTCKQB EQU   IEDNSVTD+300                                             00195000
SAVTCKTB EQU   SAVTCKQB                                                 00196000
SAVTCKEC EQU   SAVTCKQB+4                                               00197000
SAVTCKCC EQU   SAVTCKEC                                                 00198000
CVTMAP   EQU   0                                                        00199000
CVTDAR   EQU   CVTMAP+72                                                00200000
CVTFLGS1 EQU   CVTDAR                                                   00201000
CVTDCB   EQU   CVTMAP+116                                               00202000
CVTIERLC EQU   CVTMAP+144                                               00203000
CVTOPTA  EQU   CVTMAP+182                                               00204000
CVTOPTB  EQU   CVTMAP+183                                               00205000
CVTGTF   EQU   CVTMAP+236                                               00206000
CVTGTFST EQU   CVTGTF                                                   00207000
CVTGTFS  EQU   CVTGTFST                                                 00208000
CVTSTATE EQU   CVTGTFST                                                 00209000
CVTTMODE EQU   CVTGTFST                                                 00210000
CVTFORM  EQU   CVTGTFST                                                 00211000
CVTAQAVT EQU   CVTMAP+240                                               00212000
CVTTCMFG EQU   CVTAQAVT                                                 00213000
CVTVOLM2 EQU   CVTMAP+244                                               00214000
CVTTATA  EQU   CVTVOLM2                                                 00215000
CVTTSKS  EQU   CVTTATA                                                  00216000
CVTVOLF2 EQU   CVTTSKS                                                  00217000
CVTTAT   EQU   CVTTATA+1                                                00218000
CVTATER  EQU   CVTMAP+248                                               00219000
CVTEXT1  EQU   CVTMAP+252                                               00220000
CVTPURG  EQU   CVTMAP+260                                               00221000
CVTQMSG  EQU   CVTMAP+268                                               00222000
CVTDMSR  EQU   CVTMAP+272                                               00223000
CVTRSV37 EQU   CVTDMSR                                                  00224000
CVTDMSRF EQU   CVTRSV37                                                 00225000
CVTERPV  EQU   CVTMAP+316                                               00226000
CVTINTLA EQU   CVTMAP+320                                               00227000
CVTAPF   EQU   CVTMAP+324                                               00228000
CVTEXT2  EQU   CVTMAP+328                                               00229000
CVTHJES  EQU   CVTMAP+332                                               00230000
CVTPGSIA EQU   CVTMAP+348                                               00231000
CVTA1F1  EQU   CVTMAP+356                                               00232000
CVTSYSK  EQU   CVTMAP+357                                               00233000
CVTVOLM1 EQU   CVTMAP+380                                               00234000
CVTVOLF1 EQU   CVTVOLM1                                                 00235000
CVTATMCT EQU   CVTMAP+388                                               00236000
CVTXTNT1 EQU   0                                                        00237000
CVTXTNT2 EQU   0                                                        00238000
CVTDSSV  EQU   CVTXTNT2                                                 00239000
CVTFLGBT EQU   CVTXTNT2+5                                               00240000
CVTQID   EQU   CVTXTNT2+24                                              00241000
CVTSHS   EQU   CVTXTNT2+40                                              00242000
CVTRV400 EQU   CVTXTNT2+52                                              00243000
CVTRV409 EQU   CVTXTNT2+53                                              00244000
CVTATCVT EQU   CVTXTNT2+64                                              00245000
CVTRV429 EQU   CVTXTNT2+84                                              00246000
CVTRV438 EQU   CVTXTNT2+85                                              00247000
CVTRV457 EQU   CVTXTNT2+112                                             00248000
CVTRV466 EQU   CVTXTNT2+113                                             00249000
CVTFIX   EQU   0                                                        00250000
CVTRELNO EQU   CVTFIX+252                                               00251000
IEDQTCXD EQU   0                                                        00252000
TCXAVT   EQU   IEDQTCXD                                                 00253000
TCXATTEN EQU   IEDQTCXD+4                                               00254000
TCXFLAG1 EQU   IEDQTCXD+34                                              00255000
TCXBUFA  EQU   IEDQTCXD+80                                              00256000
TCXDSAVE EQU   IEDQTCXD+104                                             00257000
TCXQE8   EQU   IEDQTCXD+216                                             00258000
IEDQTRM  EQU   0                                                        00259000
TRMSTATE EQU   IEDQTRM                                                  00260000
TRMLOG   EQU   TRMSTATE                                                 00261000
TRMOPTFN EQU   TRMSTATE                                                 00262000
TRMINSEQ EQU   IEDQTRM+4                                                00263000
TLISTCNT EQU   TRMINSEQ                                                 00264000
TRMOUTSQ EQU   IEDQTRM+6                                                00265000
TLISTEN  EQU   TRMOUTSQ                                                 00266000
TRMDSORG EQU   TLISTEN                                                  00267000
TRMALTD  EQU   IEDQTRM+8                                                00268000
TRMDEVFL EQU   IEDQTRM+10                                               00269000
TRMSTAT  EQU   IEDQTRM+12                                               00270000
TRMOPNO  EQU   IEDQTRM+17                                               00271000
TRMOPTBL EQU   IEDQTRM+18                                               00272000
IEDNTRM  EQU   0                                                        00273000
TRMBYTE4 EQU   IEDNTRM                                                  00274000
TRMBYTE3 EQU   IEDNTRM+1                                                00275000
TRMBYTE2 EQU   IEDNTRM+2                                                00276000
TRMINPG  EQU   TRMBYTE2                                                 00277000
TRMBYTE1 EQU   IEDNTRM+3                                                00278000
TRMSCPRQ EQU   TRMBYTE1                                                 00279000
TRMBYTE0 EQU   IEDNTRM+6                                                00280000
TRMSIBPT EQU   IEDNTRM+7                                                00281000
PARMNAME EQU   0                                                        00282000
OPTNTAB  EQU   0                                                        00283000
OPTCHPTR EQU   OPTNTAB+4                                                00284000
OPTCHAR  EQU   0                                                        00285000
OPTCHENT EQU   OPTCHAR                                                  00286000
OPTCHLEN EQU   OPTCHENT                                                 00287000
OPTCHNAM EQU   OPTCHENT+2                                               00288000
CUROPTN  EQU   0                                                        00289000
CVTS01   EQU   CVTPGSIA                                                 00290000
CVTLPDIA EQU   CVTS01+12                                                00291000
CVTDIRST EQU   CVTLPDIA                                                 00292000
CVTSLIDA EQU   CVTS01+24                                                00293000
CVTCTLFG EQU   CVTS01+50                                                00294000
CVTRV210 EQU   CVTS01+424                                               00295000
CVTRV219 EQU   CVTS01+425                                               00296000
CVTRV228 EQU   CVTS01+426                                               00297000
CVTRV237 EQU   CVTS01+427                                               00298000
CVTMFRTR EQU   CVTS01+452                                               00299000
CVTRV262 EQU   CVTS01+468                                               00300000
CVTRV271 EQU   CVTS01+469                                               00301000
CVTRV280 EQU   CVTS01+470                                               00302000
CVTRV289 EQU   CVTS01+471                                               00303000
CVTGSDA  EQU   CVTS01+600                                               00304000
TCXPTR   EQU   CVTAQAVT                                                 00305000
TRMOPT   EQU   IEDQTRM+20                                               00306000
TRMPRE1  EQU   TRMBYTE4                                                 00307000
TRMNCP1  EQU   TRMBYTE4                                                 00308000
TRMPRE   EQU   TRMBYTE3                                                 00309000
TRMNCP   EQU   TRMBYTE3                                                 00310000
TRMPU    EQU   TRMBYTE3                                                 00311000
TRMLU    EQU   TRMBYTE3                                                 00312000
TRMLINK  EQU   TRMBYTE3                                                 00313000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00314000
@NM00114 EQU   TRMLINK                                                  00315000
TRMLSTAT EQU   TRMLINK                                                  00316000
TRMLINT  EQU   TRMLINK                                                  00317000
TRMEPMOD EQU   TRMLINK                                                  00318000
TRMLULOG EQU   TRMLU                                                    00319000
TRMINERR EQU   TRMLU                                                    00320000
TRMLUREQ EQU   TRMLU                                                    00321000
TRMSESRQ EQU   TRMLU                                                    00322000
TRMTDIFF EQU   TRMLU                                                    00323000
TRMLUTM  EQU   TRMLU                                                    00324000
TRMLUIT  EQU   TRMLU                                                    00325000
TRMAUTO  EQU   TRMLU                                                    00326000
TRMPCONT EQU   TRMPU                                                    00327000
@NM00113 EQU   TRMPU                                                    00328000
TRMNCONT EQU   TRMNCP                                                   00329000
TRMQUCKN EQU   TRMNCP                                                   00330000
TRMSLOWN EQU   TRMNCP                                                   00331000
TRMSYGEN EQU   TRMNCP                                                   00332000
TRMNCPCL EQU   TRMNCP                                                   00333000
TRMIPLDM EQU   TRMNCP                                                   00334000
TRMINOUT EQU   TRMPRE                                                   00335000
TRMRDOUT EQU   TRMPRE                                                   00336000
TRMNLOUT EQU   TRMPRE                                                   00337000
TRMWROUT EQU   TRMPRE                                                   00338000
TRMASNXI EQU   TRMPRE                                                   00339000
TRMSTMM  EQU   TRMPRE                                                   00340000
TRMCMODE EQU   TRMPRE                                                   00341000
TRMSTPND EQU   TRMPRE                                                   00342000
@NM00112 EQU   TRMNCP1                                                  00343000
TRMINOP  EQU   TRMNCP1                                                  00344000
TRMLYNCH EQU   TRMPRE1                                                  00345000
TRMSPOUT EQU   TRMPRE1                                                  00346000
TRMERLCK EQU   TRMPRE1                                                  00347000
TRMQNPL  EQU   TRMPRE1                                                  00348000
TRMSPACT EQU   TRMPRE1                                                  00349000
TRMOCNI  EQU   TRMPRE1                                                  00350000
TRMSESSN EQU   TRMPRE1                                                  00351000
TRMCONT  EQU   TRMPRE1                                                  00352000
CVTRV628 EQU   CVTS01+728                                               00353000
CVTRV627 EQU   CVTS01+724                                               00354000
CVTRV626 EQU   CVTS01+720                                               00355000
CVTRV625 EQU   CVTS01+716                                               00356000
CVTRV624 EQU   CVTS01+712                                               00357000
CVTRV623 EQU   CVTS01+708                                               00358000
CVTRV622 EQU   CVTS01+704                                               00359000
CVTRV621 EQU   CVTS01+700                                               00360000
CVTRV620 EQU   CVTS01+696                                               00361000
CVTRV619 EQU   CVTS01+692                                               00362000
CVTRV618 EQU   CVTS01+688                                               00363000
CVTRV617 EQU   CVTS01+684                                               00364000
CVTRV616 EQU   CVTS01+680                                               00365000
CVTRV615 EQU   CVTS01+676                                               00366000
CVTRV614 EQU   CVTS01+672                                               00367000
CVTRV613 EQU   CVTS01+668                                               00368000
CVTTCASP EQU   CVTS01+664                                               00369000
CVT0PT03 EQU   CVTS01+660                                               00370000
CVT0PT0E EQU   CVTS01+656                                               00371000
CVTIRM   EQU   CVTS01+652                                               00372000
CVTCGK   EQU   CVTS01+648                                               00373000
CVTRV607 EQU   CVTS01+644                                               00374000
CVTRV606 EQU   CVTS01+640                                               00375000
CVTRV605 EQU   CVTS01+636                                               00376000
CVTRV604 EQU   CVTS01+632                                               00377000
CVTEFF02 EQU   CVTS01+628                                               00378000
CVTCBBR  EQU   CVTS01+624                                               00379000
CVTSSCR  EQU   CVTS01+620                                               00380000
CVTEVENT EQU   CVTS01+616                                               00381000
CVTCRCA  EQU   CVTS01+612                                               00382000
CVTTPIO  EQU   CVTS01+608                                               00383000
CVTADV   EQU   CVTS01+604                                               00384000
CVTGSDAB EQU   CVTGSDA                                                  00385000
CVTQV3   EQU   CVTS01+596                                               00386000
CVTQV2   EQU   CVTS01+592                                               00387000
CVTQV1   EQU   CVTS01+588                                               00388000
CVTRPT   EQU   CVTS01+584                                               00389000
CVTSSRB  EQU   CVTS01+580                                               00390000
CVTCSDRL EQU   CVTS01+576                                               00391000
CVTEXP1  EQU   CVTS01+572                                               00392000
CVTRMPMT EQU   CVTS01+568                                               00393000
CVTRMPTT EQU   CVTS01+564                                               00394000
CVTVPSA  EQU   CVTS01+560                                               00395000
CVTVSTOP EQU   CVTS01+556                                               00396000
CVTGTFR8 EQU   CVTS01+552                                               00397000
CVTQUIT  EQU   CVTS01+548                                               00398000
CVTVACR  EQU   CVTS01+544                                               00399000
CVTWTCB  EQU   CVTS01+540                                               00400000
CVTSTPRS EQU   CVTS01+536                                               00401000
CVT0PT02 EQU   CVTS01+532                                               00402000
CVTDARCM EQU   CVTS01+528                                               00403000
CVTIRECM EQU   CVTS01+524                                               00404000
CVTJRECM EQU   CVTS01+520                                               00405000
CVTVEMS0 EQU   CVTS01+516                                               00406000
CVTSPFRR EQU   CVTS01+512                                               00407000
CVTRLSTG EQU   CVTS01+508                                               00408000
CVT0TC0A EQU   CVTS01+504                                               00409000
CVTGMBR  EQU   CVTS01+500                                               00410000
CVTLFRM  EQU   CVTS01+496                                               00411000
CVTRMBR  EQU   CVTS01+492                                               00412000
CVTVIOP  EQU   CVTS01+488                                               00413000
CVTRV307 EQU   CVTS01+486                                               00414000
CVTRV306 EQU   CVTS01+484                                               00415000
CVTRV305 EQU   CVTS01+482                                               00416000
CVTRV304 EQU   CVTS01+480                                               00417000
CVTRV303 EQU   CVTS01+478                                               00418000
CVTRV302 EQU   CVTS01+476                                               00419000
CVTTRCA  EQU   CVTS01+472                                               00420000
CVTRV297 EQU   CVTRV289                                                 00421000
CVTRV296 EQU   CVTRV289                                                 00422000
CVTRV295 EQU   CVTRV289                                                 00423000
CVTRV294 EQU   CVTRV289                                                 00424000
CVTRV293 EQU   CVTRV289                                                 00425000
CVTRV292 EQU   CVTRV289                                                 00426000
CVTRV291 EQU   CVTRV289                                                 00427000
CVTRV290 EQU   CVTRV289                                                 00428000
CVTRV288 EQU   CVTRV280                                                 00429000
CVTRV287 EQU   CVTRV280                                                 00430000
CVTRV286 EQU   CVTRV280                                                 00431000
CVTRV285 EQU   CVTRV280                                                 00432000
CVTRV284 EQU   CVTRV280                                                 00433000
CVTRV283 EQU   CVTRV280                                                 00434000
CVTRV282 EQU   CVTRV280                                                 00435000
CVTRV281 EQU   CVTRV280                                                 00436000
CVTRV279 EQU   CVTRV271                                                 00437000
CVTRV278 EQU   CVTRV271                                                 00438000
CVTRV277 EQU   CVTRV271                                                 00439000
CVTRV276 EQU   CVTRV271                                                 00440000
CVTRV275 EQU   CVTRV271                                                 00441000
CVTRV274 EQU   CVTRV271                                                 00442000
CVTRV273 EQU   CVTRV271                                                 00443000
CVTRV272 EQU   CVTRV271                                                 00444000
CVTRV270 EQU   CVTRV262                                                 00445000
CVTRV269 EQU   CVTRV262                                                 00446000
CVTRV268 EQU   CVTRV262                                                 00447000
CVTRV267 EQU   CVTRV262                                                 00448000
CVTRV266 EQU   CVTRV262                                                 00449000
CVTRV265 EQU   CVTRV262                                                 00450000
CVTRV264 EQU   CVTRV262                                                 00451000
CVTRV263 EQU   CVTRV262                                                 00452000
CVTVFP   EQU   CVTS01+464                                               00453000
CVTVSI   EQU   CVTS01+460                                               00454000
CVTVPSIB EQU   CVTS01+456                                               00455000
CVTMFACT EQU   CVTMFRTR                                                 00456000
CVTMFCTL EQU   CVTS01+448                                               00457000
CVTPVBP  EQU   CVTS01+444                                               00458000
CVTPWI   EQU   CVTS01+440                                               00459000
CVTRV254 EQU   CVTS01+438                                               00460000
CVTRV253 EQU   CVTS01+436                                               00461000
CVTRV252 EQU   CVTS01+434                                               00462000
CVTRV251 EQU   CVTS01+433                                               00463000
CVTRV250 EQU   CVTS01+432                                               00464000
CVTRV249 EQU   CVTS01+431                                               00465000
CVTRV248 EQU   CVTS01+430                                               00466000
CVTRV247 EQU   CVTS01+429                                               00467000
CVTRV246 EQU   CVTS01+428                                               00468000
CVTRV245 EQU   CVTRV237                                                 00469000
CVTRV244 EQU   CVTRV237                                                 00470000
CVTRV243 EQU   CVTRV237                                                 00471000
CVTRV242 EQU   CVTRV237                                                 00472000
CVTRV241 EQU   CVTRV237                                                 00473000
CVTRV240 EQU   CVTRV237                                                 00474000
CVTRV239 EQU   CVTRV237                                                 00475000
CVTRV238 EQU   CVTRV237                                                 00476000
CVTRV236 EQU   CVTRV228                                                 00477000
CVTRV235 EQU   CVTRV228                                                 00478000
CVTRV234 EQU   CVTRV228                                                 00479000
CVTRV233 EQU   CVTRV228                                                 00480000
CVTRV232 EQU   CVTRV228                                                 00481000
CVTRV231 EQU   CVTRV228                                                 00482000
CVTRV230 EQU   CVTRV228                                                 00483000
CVTRV229 EQU   CVTRV228                                                 00484000
CVTRV227 EQU   CVTRV219                                                 00485000
CVTRV226 EQU   CVTRV219                                                 00486000
CVTRV225 EQU   CVTRV219                                                 00487000
CVTRV224 EQU   CVTRV219                                                 00488000
CVTRV223 EQU   CVTRV219                                                 00489000
CVTRV222 EQU   CVTRV219                                                 00490000
CVTRV221 EQU   CVTRV219                                                 00491000
CVTRV220 EQU   CVTRV219                                                 00492000
CVTRV218 EQU   CVTRV210                                                 00493000
CVTRV217 EQU   CVTRV210                                                 00494000
CVTRV216 EQU   CVTRV210                                                 00495000
CVTRV215 EQU   CVTRV210                                                 00496000
CVTRV214 EQU   CVTRV210                                                 00497000
CVTRV213 EQU   CVTRV210                                                 00498000
CVTRV212 EQU   CVTRV210                                                 00499000
CVTRV211 EQU   CVTRV210                                                 00500000
CVTLCCAT EQU   CVTS01+420                                               00501000
CVTPCCAT EQU   CVTS01+416                                               00502000
CVTIPCRP EQU   CVTS01+412                                               00503000
CVTIPCRI EQU   CVTS01+408                                               00504000
CVTIPCDS EQU   CVTS01+404                                               00505000
CVTAIDVT EQU   CVTS01+400                                               00506000
CVTSSAP  EQU   CVTS01+396                                               00507000
CVTEHCIR EQU   CVTS01+392                                               00508000
CVTEHDEF EQU   CVTS01+388                                               00509000
CVTDAIR  EQU   CVTS01+384                                               00510000
CVTPERFM EQU   CVTS01+380                                               00511000
CVT044R2 EQU   CVTS01+376                                               00512000
CVTFETCH EQU   CVTS01+372                                               00513000
CVTRSTWD EQU   CVTS01+368                                               00514000
CVTSPOST EQU   CVTS01+364                                               00515000
CVTIOBP  EQU   CVTS01+360                                               00516000
CVTASMVT EQU   CVTS01+356                                               00517000
CVTRECRQ EQU   CVTS01+352                                               00518000
CVTWSAC  EQU   CVTS01+348                                               00519000
CVTRV149 EQU   CVTS01+344                                               00520000
CVTWSAL  EQU   CVTS01+340                                               00521000
CVTSPSA  EQU   CVTS01+336                                               00522000
CVTGLMN  EQU   CVTS01+332                                               00523000
CVTVEAC0 EQU   CVTS01+328                                               00524000
CVT062R1 EQU   CVTS01+324                                               00525000
CVTRPOST EQU   CVTS01+320                                               00526000
CVTDQIQE EQU   CVTS01+316                                               00527000
CVTCSD   EQU   CVTS01+312                                               00528000
CVTLKRMA EQU   CVTS01+308                                               00529000
CVTRSPIE EQU   CVTS01+304                                               00530000
CVTRENQ  EQU   CVTS01+300                                               00531000
CVTLQCB  EQU   CVTS01+296                                               00532000
CVTFQCB  EQU   CVTS01+292                                               00533000
CVTQCS01 EQU   CVTS01+288                                               00534000
CVTAPFT  EQU   CVTS01+284                                               00535000
CVTPARRL EQU   CVTS01+280                                               00536000
CVTVWAIT EQU   CVTS01+276                                               00537000
CVTGSPL  EQU   CVTS01+272                                               00538000
CVTLSMQ  EQU   CVTS01+268                                               00539000
CVTGSMQ  EQU   CVTS01+264                                               00540000
CVTEXPRO EQU   CVTS01+260                                               00541000
CVTOPCTP EQU   CVTS01+256                                               00542000
CVTSIC   EQU   CVTS01+252                                               00543000
CVTTPIOS EQU   CVTS01+248                                               00544000
CVTRTMS  EQU   CVTS01+244                                               00545000
CVTSDBF  EQU   CVTS01+240                                               00546000
CVTSCBP  EQU   CVTS01+236                                               00547000
CVTSDMP  EQU   CVTS01+232                                               00548000
CVTSV60  EQU   CVTS01+228                                               00549000
CVTRTMCT EQU   CVTS01+224                                               00550000
CVTASCBL EQU   CVTS01+220                                               00551000
CVTASCBH EQU   CVTS01+216                                               00552000
CVTGDA   EQU   CVTS01+212                                               00553000
CVTASVT  EQU   CVTS01+208                                               00554000
CVTVVMDI EQU   CVTS01+204                                               00555000
CVTAQTOP EQU   CVTS01+200                                               00556000
CVTIOSCS EQU   CVTS01+196                                               00557000
CVTSDRM  EQU   CVTS01+192                                               00558000
CVTOPTE  EQU   CVTS01+188                                               00559000
CVTSTXU  EQU   CVTS01+184                                               00560000
CVTQUIS  EQU   CVTS01+180                                               00561000
CVTPARS  EQU   CVTS01+176                                               00562000
CVTS1EE  EQU   CVTS01+172                                               00563000
CVTFRAS  EQU   CVTS01+168                                               00564000
CVTQSAS  EQU   CVTS01+164                                               00565000
CVTCRAS  EQU   CVTS01+160                                               00566000
CVTCRMN  EQU   CVTS01+156                                               00567000
CVTDELCP EQU   CVTS01+152                                               00568000
CVTFRECL EQU   CVTS01+148                                               00569000
CVTGETCL EQU   CVTS01+144                                               00570000
CVTBLDCP EQU   CVTS01+140                                               00571000
CVTAUTHL EQU   CVTS01+136                                               00572000
CVTSCAN  EQU   CVTS01+132                                               00573000
CVTRV144 EQU   CVTS01+130                                               00574000
CVTMAXMP EQU   CVTS01+128                                               00575000
CVTSTCK  EQU   CVTS01+124                                               00576000
CVTRV139 EQU   CVTS01+123                                               00577000
CVTDSSAC EQU   CVTS01+122                                               00578000
CVTRV513 EQU   CVTS01+121                                               00579000
CVTIOSPL EQU   CVTS01+120                                               00580000
CVTPTGT  EQU   CVTS01+116                                               00581000
CVTCSPIE EQU   CVTS01+112                                               00582000
CVTSMFEX EQU   CVTS01+108                                               00583000
CVTOLT0A EQU   CVTS01+104                                               00584000
CVTSRBRT EQU   CVTS01+100                                               00585000
CVTPUTL  EQU   CVTS01+96                                                00586000
CVTASCRL EQU   CVTS01+92                                                00587000
CVTASCRF EQU   CVTS01+88                                                00588000
CVTRV326 EQU   CVTS01+84                                                00589000
CVTRV325 EQU   CVTS01+80                                                00590000
CVTRV324 EQU   CVTS01+76                                                00591000
CVT0VL01 EQU   CVTS01+72                                                00592000
CVTSHRVM EQU   CVTS01+68                                                00593000
CVTRV332 EQU   CVTS01+64                                                00594000
CVTTAS   EQU   CVTS01+60                                                00595000
CVTRSCN  EQU   CVTS01+56                                                00596000
CVTTRAC2 EQU   CVTS01+54                                                00597000
CVTTRACE EQU   CVTS01+52                                                00598000
CVTAPG   EQU   CVTS01+51                                                00599000
CVTSDTRC EQU   CVTCTLFG                                                 00600000
CVTGTRCE EQU   CVTCTLFG                                                 00601000
CVTNOMP  EQU   CVTCTLFG                                                 00602000
CVTRSV79 EQU   CVTCTLFG                                                 00603000
CVTDSTAT EQU   CVTCTLFG                                                 00604000
CVTRSV78 EQU   CVTCTLFG                                                 00605000
CVTRV333 EQU   CVTCTLFG                                                 00606000
CVTRV323 EQU   CVTCTLFG                                                 00607000
CVTSPVLK EQU   CVTS01+49                                                00608000
CVTRSV77 EQU   CVTS01+48                                                00609000
CVTRV331 EQU   CVTS01+44                                                00610000
CVTRV330 EQU   CVTS01+40                                                00611000
CVTRV329 EQU   CVTS01+36                                                00612000
CVTRV328 EQU   CVTS01+32                                                00613000
CVTRV322 EQU   CVTS01+28                                                00614000
CVTSLID  EQU   CVTSLIDA+1                                               00615000
CVTSYLK  EQU   CVTSLIDA                                                 00616000
CVTRV321 EQU   CVTS01+20                                                00617000
CVTRV320 EQU   CVTS01+16                                                00618000
CVTLPDIR EQU   CVTLPDIA+1                                               00619000
CVTRSV69 EQU   CVTDIRST                                                 00620000
CVTRSV68 EQU   CVTDIRST                                                 00621000
CVTRSV67 EQU   CVTDIRST                                                 00622000
CVTRSV66 EQU   CVTDIRST                                                 00623000
CVTRSV65 EQU   CVTDIRST                                                 00624000
CVTRSV64 EQU   CVTDIRST                                                 00625000
CVTRSV63 EQU   CVTDIRST                                                 00626000
CVTDICOM EQU   CVTDIRST                                                 00627000
CVTPVTP  EQU   CVTS01+8                                                 00628000
CVTLPDSR EQU   CVTS01+4                                                 00629000
CVTGETL  EQU   CVTS01                                                   00630000
OPTCHTYP EQU   OPTCHENT+1                                               00631000
@NM00115 EQU   OPTNTAB                                                  00632000
TRMSUBST EQU   IEDNTRM+12                                               00633000
TRMTYPE  EQU   IEDNTRM+11                                               00634000
TRMRLMCT EQU   IEDNTRM+10                                               00635000
TRMCOHTG EQU   TRMSIBPT+1                                               00636000
TRMGPCNT EQU   TRMSIBPT                                                 00637000
TRMBUFRD EQU   TRMBYTE0                                                 00638000
TRMSNA   EQU   TRMBYTE0                                                 00639000
TRMGP    EQU   TRMBYTE0                                                 00640000
TRMDIAL  EQU   TRMBYTE0                                                 00641000
@NM00111 EQU   TRMBYTE0                                                 00642000
TRMOUTPT EQU   TRMBYTE0                                                 00643000
TRMINPUT EQU   TRMBYTE0                                                 00644000
TRMUDEF  EQU   TRMBYTE0                                                 00645000
TRMCOHRT EQU   IEDNTRM+4                                                00646000
TRMSTOTE EQU   TRMBYTE1                                                 00647000
TRMCKPRN EQU   TRMBYTE1                                                 00648000
TRMTSATN EQU   TRMBYTE1                                                 00649000
TRMTRACE EQU   TRMBYTE1                                                 00650000
TRMSWBCK EQU   TRMBYTE1                                                 00651000
TRMAUTOC EQU   TRMBYTE1                                                 00652000
TRMINPTP EQU   TRMBYTE1                                                 00653000
TRMWTNEG EQU   TRMSCPRQ                                                 00654000
TRMWRBRK EQU   TRMBYTE2                                                 00655000
TRMNOSND EQU   TRMBYTE2                                                 00656000
TRMPREP  EQU   TRMBYTE2                                                 00657000
TRMGPACT EQU   TRMBYTE2                                                 00658000
TRMANDL  EQU   TRMBYTE2                                                 00659000
TRMCLOSN EQU   TRMINPG                                                  00660000
TRMREMB  EQU   TRMBYTE2                                                 00661000
TRMRSACT EQU   TRMBYTE2                                                 00662000
TRMCHCIN EQU   IEDQTRM+16                                               00663000
TRMSENSE EQU   TRMSTAT+3                                                00664000
TRMTEMPR EQU   TRMSTAT+2                                                00665000
TRMSIO   EQU   TRMSTAT                                                  00666000
@NM00110 EQU   TRMDEVFL+1                                               00667000
TRMTPIN  EQU   TRMDEVFL+1                                               00668000
TRMNCPI  EQU   TRMDEVFL+1                                               00669000
TRMRNTRM EQU   TRMDEVFL+1                                               00670000
@NM00109 EQU   TRMDEVFL+1                                               00671000
TRMLMD   EQU   TRMDEVFL+1                                               00672000
TRMCONC  EQU   TRMDEVFL+1                                               00673000
TRMTSOB  EQU   TRMDEVFL                                                 00674000
TRMBFDY  EQU   TRMDEVFL                                                 00675000
TRMTBLK  EQU   TRMDEVFL                                                 00676000
TRMSBLK  EQU   TRMDEVFL                                                 00677000
TRMBLKS  EQU   TRMDEVFL                                                 00678000
TRMADDC  EQU   TRMDEVFL                                                 00679000
TRMDDIG  EQU   TRMDEVFL                                                 00680000
TRMBUFS  EQU   TRMDEVFL                                                 00681000
TRMPRILK EQU   TRMALTD                                                  00682000
TRMLGB   EQU   TRMDSORG                                                 00683000
TRMUTERM EQU   TLISTCNT                                                 00684000
TRMDESTQ EQU   IEDQTRM+1                                                00685000
TRMSCNYN EQU   TRMSTATE                                                 00686000
TRMHELDN EQU   TRMSTATE                                                 00687000
TRMACPTN EQU   TRMSTATE                                                 00688000
TRMPREF  EQU   TRMSTATE                                                 00689000
TRMPROC  EQU   TRMLOG                                                   00690000
TRMLIST  EQU   TRMLOG                                                   00691000
TRMLINE  EQU   TRMSTATE                                                 00692000
TCXEND   EQU   IEDQTCXD+224                                             00693000
TCXNCPIO EQU   IEDQTCXD+220                                             00694000
TCXACTE8 EQU   TCXQE8                                                   00695000
TCXABEPL EQU   IEDQTCXD+212                                             00696000
TCXSRBS  EQU   IEDQTCXD+208                                             00697000
TCXSIOSB EQU   IEDQTCXD+204                                             00698000
TCXESAVE EQU   IEDQTCXD+132                                             00699000
TCXERPPM EQU   IEDQTCXD+128                                             00700000
TCXERPSV EQU   IEDQTCXD+116                                             00701000
TCXSATTN EQU   IEDQTCXD+112                                             00702000
@NM00108 EQU   TCXDSAVE+4                                               00703000
@NM00107 EQU   TCXDSAVE                                                 00704000
TCXPLCB  EQU   IEDQTCXD+100                                             00705000
TCXBITS  EQU   IEDQTCXD+98                                              00706000
TCXSCBSZ EQU   IEDQTCXD+97                                              00707000
TCXBIT1  EQU   IEDQTCXD+96                                              00708000
TCXCOMPT EQU   IEDQTCXD+92                                              00709000
TCXAVAIL EQU   IEDQTCXD+88                                              00710000
TCXBUFL  EQU   IEDQTCXD+84                                              00711000
TCXTOTE  EQU   TCXBUFA                                                  00712000
TCXCKPM  EQU   IEDQTCXD+79                                              00713000
TCXNCKPR EQU   IEDQTCXD+78                                              00714000
TCXSZAIB EQU   IEDQTCXD+76                                              00715000
TCXAIBC  EQU   IEDQTCXD+72                                              00716000
TCXPEBC  EQU   IEDQTCXD+68                                              00717000
TCXPEWAC EQU   IEDQTCXD+64                                              00718000
TCXQRQ   EQU   IEDQTCXD+60                                              00719000
TCXOCQ   EQU   IEDQTCXD+56                                              00720000
TCXPNTQ  EQU   IEDQTCXD+52                                              00721000
TCXPUTQ  EQU   IEDQTCXD+48                                              00722000
TCXGETQ  EQU   IEDQTCXD+44                                              00723000
TCXTSI   EQU   IEDQTCXD+40                                              00724000
TCXRPT   EQU   IEDQTCXD+36                                              00725000
TCXCC3TS EQU   IEDQTCXD+35                                              00726000
TCXAPDMP EQU   TCXFLAG1                                                 00727000
TCXAPPL  EQU   TCXFLAG1                                                 00728000
TCXRTM   EQU   TCXFLAG1                                                 00729000
TCXMCPCD EQU   TCXFLAG1                                                 00730000
TCXAUTH  EQU   TCXFLAG1                                                 00731000
TCXASID  EQU   IEDQTCXD+32                                              00732000
TCXASCB  EQU   IEDQTCXD+28                                              00733000
TCXREADY EQU   IEDQTCXD+24                                              00734000
TCXPASWD EQU   IEDQTCXD+16                                              00735000
TCXDISP  EQU   IEDQTCXD+12                                              00736000
TCXTCB   EQU   IEDQTCXD+8                                               00737000
TCXATTLN EQU   TCXATTEN                                                 00738000
CVTLEVL  EQU   CVTRELNO+2                                               00739000
CVTNUMB  EQU   CVTRELNO                                                 00740000
CVTMDL   EQU   CVTFIX+250                                               00741000
@NM00106 EQU   CVTFIX+248                                               00742000
@NM00105 EQU   CVTFIX                                                   00743000
CVTRV482 EQU   CVTXTNT2+128                                             00744000
CVTRV481 EQU   CVTXTNT2+124                                             00745000
CVTRV480 EQU   CVTXTNT2+120                                             00746000
CVTRV479 EQU   CVTXTNT2+118                                             00747000
CVTRV478 EQU   CVTXTNT2+117                                             00748000
CVTRV477 EQU   CVTXTNT2+116                                             00749000
CVTRV476 EQU   CVTXTNT2+115                                             00750000
CVTRV475 EQU   CVTXTNT2+114                                             00751000
CVTRV474 EQU   CVTRV466                                                 00752000
CVTRV473 EQU   CVTRV466                                                 00753000
CVTRV472 EQU   CVTRV466                                                 00754000
CVTRV471 EQU   CVTRV466                                                 00755000
CVTRV470 EQU   CVTRV466                                                 00756000
CVTRV469 EQU   CVTRV466                                                 00757000
CVTRV468 EQU   CVTRV466                                                 00758000
CVTRV467 EQU   CVTRV466                                                 00759000
CVTRV465 EQU   CVTRV457                                                 00760000
CVTRV464 EQU   CVTRV457                                                 00761000
CVTRV463 EQU   CVTRV457                                                 00762000
CVTRV462 EQU   CVTRV457                                                 00763000
CVTRV461 EQU   CVTRV457                                                 00764000
CVTRV460 EQU   CVTRV457                                                 00765000
CVTRV459 EQU   CVTRV457                                                 00766000
CVTRV458 EQU   CVTRV457                                                 00767000
CVTRV456 EQU   CVTXTNT2+108                                             00768000
CVTRV455 EQU   CVTXTNT2+104                                             00769000
CVTRV454 EQU   CVTXTNT2+100                                             00770000
CVTRV453 EQU   CVTXTNT2+96                                              00771000
CVTRV452 EQU   CVTXTNT2+94                                              00772000
CVTRV451 EQU   CVTXTNT2+92                                              00773000
CVTRV450 EQU   CVTXTNT2+90                                              00774000
CVTRV449 EQU   CVTXTNT2+88                                              00775000
CVTRV448 EQU   CVTXTNT2+87                                              00776000
CVTRV447 EQU   CVTXTNT2+86                                              00777000
CVTRV446 EQU   CVTRV438                                                 00778000
CVTRV445 EQU   CVTRV438                                                 00779000
CVTRV444 EQU   CVTRV438                                                 00780000
CVTRV443 EQU   CVTRV438                                                 00781000
CVTRV442 EQU   CVTRV438                                                 00782000
CVTRV441 EQU   CVTRV438                                                 00783000
CVTRV440 EQU   CVTRV438                                                 00784000
CVTRV439 EQU   CVTRV438                                                 00785000
CVTRV437 EQU   CVTRV429                                                 00786000
CVTRV436 EQU   CVTRV429                                                 00787000
CVTRV435 EQU   CVTRV429                                                 00788000
CVTRV434 EQU   CVTRV429                                                 00789000
CVTRV433 EQU   CVTRV429                                                 00790000
CVTRV432 EQU   CVTRV429                                                 00791000
CVTRV431 EQU   CVTRV429                                                 00792000
CVTRV430 EQU   CVTRV429                                                 00793000
CVTRV428 EQU   CVTXTNT2+80                                              00794000
CVTRV427 EQU   CVTXTNT2+76                                              00795000
CVTRV426 EQU   CVTXTNT2+72                                              00796000
CVTRV425 EQU   CVTXTNT2+68                                              00797000
CVTATACT EQU   CVTATCVT                                                 00798000
CVTRV423 EQU   CVTXTNT2+62                                              00799000
CVTRV422 EQU   CVTXTNT2+60                                              00800000
CVTRV421 EQU   CVTXTNT2+58                                              00801000
CVTRV420 EQU   CVTXTNT2+56                                              00802000
CVTRV419 EQU   CVTXTNT2+55                                              00803000
CVTRV418 EQU   CVTXTNT2+54                                              00804000
CVTRV417 EQU   CVTRV409                                                 00805000
CVTRV416 EQU   CVTRV409                                                 00806000
CVTRV415 EQU   CVTRV409                                                 00807000
CVTRV414 EQU   CVTRV409                                                 00808000
CVTRV413 EQU   CVTRV409                                                 00809000
CVTRV412 EQU   CVTRV409                                                 00810000
CVTRV411 EQU   CVTRV409                                                 00811000
CVTRV410 EQU   CVTRV409                                                 00812000
CVTRV408 EQU   CVTRV400                                                 00813000
CVTRV407 EQU   CVTRV400                                                 00814000
CVTRV406 EQU   CVTRV400                                                 00815000
CVTRV405 EQU   CVTRV400                                                 00816000
CVTRV404 EQU   CVTRV400                                                 00817000
CVTRV403 EQU   CVTRV400                                                 00818000
CVTRV402 EQU   CVTRV400                                                 00819000
CVTRV401 EQU   CVTRV400                                                 00820000
CVTICB   EQU   CVTXTNT2+48                                              00821000
CVTSKTA  EQU   CVTXTNT2+44                                              00822000
CVTSHSB  EQU   CVTSHS                                                   00823000
CVTRSV98 EQU   CVTXTNT2+36                                              00824000
CVTRSV97 EQU   CVTXTNT2+34                                              00825000
CVTRSV96 EQU   CVTXTNT2+32                                              00826000
CVTOLTEP EQU   CVTXTNT2+28                                              00827000
CVTQIDA  EQU   CVTQID+1                                                 00828000
CVTRSV95 EQU   CVTQID                                                   00829000
CVTRSV94 EQU   CVTXTNT2+20                                              00830000
CVTRSV93 EQU   CVTXTNT2+16                                              00831000
CVTRSV92 EQU   CVTXTNT2+12                                              00832000
CVTDEBVR EQU   CVTXTNT2+8                                               00833000
CVTRSV91 EQU   CVTXTNT2+6                                               00834000
CVTRSV9H EQU   CVTFLGBT                                                 00835000
CVTRSV9G EQU   CVTFLGBT                                                 00836000
CVTRSV9F EQU   CVTFLGBT                                                 00837000
CVTRSV9E EQU   CVTFLGBT                                                 00838000
CVTRSV9D EQU   CVTFLGBT                                                 00839000
CVTRSV9C EQU   CVTFLGBT                                                 00840000
CVTVME   EQU   CVTFLGBT                                                 00841000
CVTNPE   EQU   CVTFLGBT                                                 00842000
CVTNUCLS EQU   CVTXTNT2+4                                               00843000
CVTDSSVA EQU   CVTDSSV+1                                                00844000
CVTRSV89 EQU   CVTDSSV                                                  00845000
CVTRSV88 EQU   CVTXTNT1+8                                               00846000
CVTRSV87 EQU   CVTXTNT1+4                                               00847000
CVTFACHN EQU   CVTXTNT1                                                 00848000
CVTRV488 EQU   CVTMAP+412                                               00849000
CVTRV487 EQU   CVTMAP+408                                               00850000
CVTRV486 EQU   CVTMAP+404                                               00851000
CVTRV485 EQU   CVTMAP+400                                               00852000
CVTACTAP EQU   CVTMAP+396                                               00853000
CVTAUTH  EQU   CVTMAP+392                                               00854000
CVTATMCA EQU   CVTATMCT+1                                               00855000
CVTATMST EQU   CVTATMCT                                                 00856000
CVTRSV61 EQU   CVTMAP+384                                               00857000
CVTVOLT1 EQU   CVTVOLM1+1                                               00858000
CVTVOLI1 EQU   CVTVOLF1                                                 00859000
CVTSTOA  EQU   CVTMAP+376                                               00860000
CVTRSV58 EQU   CVTMAP+374                                               00861000
CVTRSV57 EQU   CVTMAP+372                                               00862000
CVTDDCE  EQU   CVTMAP+368                                               00863000
CVTPNWFR EQU   CVTMAP+364                                               00864000
CVTSMF   EQU   CVTMAP+360                                               00865000
CVTSULK  EQU   CVTMAP+358                                               00866000
CVTSLKO  EQU   CVTSYSK                                                  00867000
CVTSLKP  EQU   CVTSYSK                                                  00868000
CVTSLKQ  EQU   CVTSYSK                                                  00869000
CVTSLKR  EQU   CVTSYSK                                                  00870000
CVTRSV56 EQU   CVTSYSK                                                  00871000
CVTRSV55 EQU   CVTSYSK                                                  00872000
CVTRSV54 EQU   CVTSYSK                                                  00873000
CVTRSV53 EQU   CVTSYSK                                                  00874000
CVTRSV52 EQU   CVTA1F1                                                  00875000
CVTRSV51 EQU   CVTA1F1                                                  00876000
CVTRSV50 EQU   CVTA1F1                                                  00877000
CVTRSV49 EQU   CVTA1F1                                                  00878000
CVTRSV48 EQU   CVTA1F1                                                  00879000
CVTRSV47 EQU   CVTA1F1                                                  00880000
CVTSRSW  EQU   CVTA1F1                                                  00881000
CVTPFSW  EQU   CVTA1F1                                                  00882000
CVTPCVT  EQU   CVTMAP+352                                               00883000
CVTRSV46 EQU   CVTMAP+344                                               00884000
CVTRSV45 EQU   CVTMAP+340                                               00885000
CVTRSV44 EQU   CVTMAP+338                                               00886000
CVTRSV43 EQU   CVTMAP+336                                               00887000
CVTHJESA EQU   CVTHJES+1                                                00888000
CVTRSV42 EQU   CVTHJES                                                  00889000
CVTEXT2A EQU   CVTEXT2+1                                                00890000
CVTRSV41 EQU   CVTEXT2                                                  00891000
CVTAPFA  EQU   CVTAPF+1                                                 00892000
CVTRSV40 EQU   CVTAPF                                                   00893000
CVTRV518 EQU   CVTINTLA                                                 00894000
CVTRV517 EQU   CVTERPV                                                  00895000
CVTEORM  EQU   CVTMAP+312                                               00896000
CVTMCHPR EQU   CVTMAP+308                                               00897000
CVTTZ    EQU   CVTMAP+304                                               00898000
CVTJEPS  EQU   CVTMAP+300                                               00899000
CVTJESCT EQU   CVTMAP+296                                               00900000
CVTMODE  EQU   CVTMAP+292                                               00901000
CVTPTRV  EQU   CVTMAP+288                                               00902000
CVTREAL  EQU   CVTMAP+284                                               00903000
CVTRSV39 EQU   CVTMAP+280                                               00904000
CVTRSV38 EQU   CVTMAP+276                                               00905000
CVTDMSRA EQU   CVTDMSR+1                                                00906000
CVTRV634 EQU   CVTDMSRF                                                 00907000
CVTRV633 EQU   CVTDMSRF                                                 00908000
CVTRV632 EQU   CVTDMSRF                                                 00909000
CVTRV631 EQU   CVTDMSRF                                                 00910000
CVTRV630 EQU   CVTDMSRF                                                 00911000
CVTRV629 EQU   CVTDMSRF                                                 00912000
CVTUDUMP EQU   CVTDMSRF                                                 00913000
CVTSDUMP EQU   CVTDMSRF                                                 00914000
CVTQMSGA EQU   CVTQMSG+1                                                00915000
CVTRSV36 EQU   CVTQMSG                                                  00916000
CVTAMFF  EQU   CVTMAP+264                                               00917000
CVTPURGA EQU   CVTPURG+1                                                00918000
CVTRSV35 EQU   CVTPURG                                                  00919000
CVTCBSP  EQU   CVTMAP+256                                               00920000
CVTATERA EQU   CVTATER+1                                                00921000
CVTSYST  EQU   CVTATER                                                  00922000
CVTVOLT2 EQU   CVTTAT                                                   00923000
CVTVOLI2 EQU   CVTVOLF2                                                 00924000
CVTAQAVB EQU   CVTAQAVT+1                                               00925000
CVTRSV34 EQU   CVTTCMFG                                                 00926000
CVTRSV33 EQU   CVTTCMFG                                                 00927000
CVTRSV32 EQU   CVTTCMFG                                                 00928000
CVTRSV31 EQU   CVTTCMFG                                                 00929000
CVTRSV30 EQU   CVTTCMFG                                                 00930000
CVTRSV29 EQU   CVTTCMFG                                                 00931000
CVTRSV28 EQU   CVTTCMFG                                                 00932000
CVTTCRDY EQU   CVTTCMFG                                                 00933000
CVTGTFA  EQU   CVTGTF+1                                                 00934000
CVTRSV27 EQU   CVTGTFST                                                 00935000
CVTRNIO  EQU   CVTGTFST                                                 00936000
CVTUSR   EQU   CVTGTFST                                                 00937000
CVTRV318 EQU   CVTFORM                                                  00938000
CVTRV317 EQU   CVTTMODE                                                 00939000
CVTRV316 EQU   CVTSTATE                                                 00940000
CVTRV315 EQU   CVTGTFS                                                  00941000
CVTGTFAV EQU   CVTGTFS                                                  00942000
CVT0SCR1 EQU   CVTMAP+232                                               00943000
CVTRV515 EQU   CVTMAP+228                                               00944000
CVTRMS   EQU   CVTMAP+224                                               00945000
CVTPATCH EQU   CVTMAP+220                                               00946000
CVTTSCE  EQU   CVTMAP+216                                               00947000
CVTLNKSC EQU   CVTMAP+214                                               00948000
CVTQABST EQU   CVTMAP+212                                               00949000
CVTMDLDS EQU   CVTMAP+208                                               00950000
CVTUSER  EQU   CVTMAP+204                                               00951000
CVTABEND EQU   CVTMAP+200                                               00952000
CVTSMCA  EQU   CVTMAP+196                                               00953000
CVTRSV18 EQU   CVTMAP+192                                               00954000
CVTQLPAQ EQU   CVTMAP+188                                               00955000
CVTQCDSR EQU   CVTMAP+184                                               00956000
CVTRSV17 EQU   CVTOPTB                                                  00957000
CVTRSV16 EQU   CVTOPTB                                                  00958000
CVTFP    EQU   CVTOPTB                                                  00959000
CVTAPTHR EQU   CVTOPTB                                                  00960000
CVTNLOG  EQU   CVTOPTB                                                  00961000
CVTTOD   EQU   CVTOPTB                                                  00962000
CVTCTIMS EQU   CVTOPTB                                                  00963000
CVTPROT  EQU   CVTOPTB                                                  00964000
CVTXPFP  EQU   CVTOPTA                                                  00965000
CVTASCII EQU   CVTOPTA                                                  00966000
CVTRSV13 EQU   CVTOPTA                                                  00967000
CVTRSV12 EQU   CVTOPTA                                                  00968000
CVTNIP   EQU   CVTOPTA                                                  00969000
CVTDDR   EQU   CVTOPTA                                                  00970000
CVTAPR   EQU   CVTOPTA                                                  00971000
CVTCCH   EQU   CVTOPTA                                                  00972000
CVTSNCTR EQU   CVTMAP+180                                               00973000
CVTQMWR  EQU   CVTMAP+176                                               00974000
CVTQOCR  EQU   CVTMAP+172                                               00975000
CVT1EF00 EQU   CVTMAP+168                                               00976000
CVTMZ00  EQU   CVTMAP+164                                               00977000
CVTHEAD  EQU   CVTMAP+160                                               00978000
CVTRSV11 EQU   CVTMAP+156                                               00979000
CVT0PT01 EQU   CVTMAP+152                                               00980000
CVTMSER  EQU   CVTMAP+148                                               00981000
CVTRV516 EQU   CVTIERLC                                                 00982000
CVTILCH  EQU   CVTMAP+140                                               00983000
CVT0DS   EQU   CVTMAP+136                                               00984000
CVTFBOSV EQU   CVTMAP+132                                               00985000
CVTNUCB  EQU   CVTMAP+128                                               00986000
CVTIXAVL EQU   CVTMAP+124                                               00987000
CVTIOQET EQU   CVTMAP+120                                               00988000
CVTDCBA  EQU   CVTMAP+117                                               00989000
CVTMVS2  EQU   CVTDCB                                                   00990000
CVT6DAT  EQU   CVTDCB                                                   00991000
CVT4MPS  EQU   CVTDCB                                                   00992000
CVTRSV09 EQU   CVTDCB                                                   00993000
CVT4MS1  EQU   CVTDCB                                                   00994000
CVT2SPS  EQU   CVTDCB                                                   00995000
CVT1SSS  EQU   CVTDCB                                                   00996000
CVTRSV08 EQU   CVTDCB                                                   00997000
CVTSTB   EQU   CVTMAP+112                                               00998000
CVTQTD00 EQU   CVTMAP+108                                               00999000
CVTQTE00 EQU   CVTMAP+104                                               01000000
CVTCUCB  EQU   CVTMAP+100                                               01001000
CVTSJQ   EQU   CVTMAP+96                                                01002000
CVTPBLDL EQU   CVTMAP+92                                                01003000
CVTTPC   EQU   CVTMAP+88                                                01004000
CVTSVDCB EQU   CVTMAP+84                                                01005000
CVTBRET  EQU   CVTMAP+82                                                01006000
CVTEXIT  EQU   CVTMAP+80                                                01007000
CVT0FN00 EQU   CVTMAP+76                                                01008000
CVTDARA  EQU   CVTDAR+1                                                 01009000
CVTRSV07 EQU   CVTFLGS1                                                 01010000
CVTRSV06 EQU   CVTFLGS1                                                 01011000
CVTRSV05 EQU   CVTFLGS1                                                 01012000
CVTRSV04 EQU   CVTFLGS1                                                 01013000
CVTRSV03 EQU   CVTFLGS1                                                 01014000
CVTRSV02 EQU   CVTFLGS1                                                 01015000
CVTRSV01 EQU   CVTFLGS1                                                 01016000
CVTDMPLK EQU   CVTFLGS1                                                 01017000
CVTXITP  EQU   CVTMAP+68                                                01018000
CVTZDTAB EQU   CVTMAP+64                                                01019000
CVTMSLT  EQU   CVTMAP+60                                                01020000
CVTDATE  EQU   CVTMAP+56                                                01021000
CVTBTERM EQU   CVTMAP+52                                                01022000
CVTSYSAD EQU   CVTMAP+48                                                01023000
CVTXTLER EQU   CVTMAP+44                                                01024000
CVTILK2  EQU   CVTMAP+40                                                01025000
CVTILK1  EQU   CVTMAP+36                                                01026000
CVTPRLTV EQU   CVTMAP+32                                                01027000
CVTPCNVT EQU   CVTMAP+28                                                01028000
CVT0VL00 EQU   CVTMAP+24                                                01029000
CVTXAPG  EQU   CVTMAP+20                                                01030000
CVTBUF   EQU   CVTMAP+16                                                01031000
CVTJOB   EQU   CVTMAP+12                                                01032000
CVTLINK  EQU   CVTMAP+8                                                 01033000
CVT0EF00 EQU   CVTMAP+4                                                 01034000
CVTTCBP  EQU   CVTMAP                                                   01035000
CVT      EQU   CVTMAP                                                   01036000
SAVTBITN EQU   IEDNSVTD+312                                             01037000
@NM00104 EQU   SAVTCKQB+8                                               01038000
@NM00103 EQU   SAVTCKEC+1                                               01039000
@NM00102 EQU   SAVTCKCC                                                 01040000
SAVTCKPO EQU   SAVTCKCC                                                 01041000
SAVTCKWA EQU   SAVTCKCC                                                 01042000
SAVTCKCH EQU   SAVTCKTB+1                                               01043000
SAVTCKVT EQU   SAVTCKTB                                                 01044000
@NM00101 EQU   IEDNSVTD+297                                             01045000
SAVTRDFG EQU   SAVTRDRV+12                                              01046000
@NM00100 EQU   SAVTRDRV+5                                               01047000
SAVTRDPY EQU   SAVTRDRV+4                                               01048000
SAVTRDQB EQU   SAVTRDRV+1                                               01049000
SAVTRDKY EQU   SAVTRDRV                                                 01050000
SAVTNID  EQU   IEDNSVTD+280                                             01051000
SAVTDVAS EQU   IEDNSVTD+276                                             01052000
SAVTPLSZ EQU   IEDNSVTD+274                                             01053000
@NM00099 EQU   IEDNSVTD+273                                             01054000
SAVTSUBL EQU   IEDNSVTD+272                                             01055000
@NM00098 EQU   SAVTZELM+1                                               01056000
SAVTSUBM EQU   SAVTZELM                                                 01057000
SAVTMHDX EQU   IEDNSVTD+268                                             01058000
SAVTNAT1 EQU   IEDNSVTD+266                                             01059000
SAVTSH20 EQU   IEDNSVTD+264                                             01060000
SAVTLCBS EQU   IEDNSVTD+260                                             01061000
SAVTRNMP EQU   IEDNSVTD+256                                             01062000
SAVTTNTX EQU   IEDNSVTD+252                                             01063000
SAVTNAX  EQU   IEDNSVTD+248                                             01064000
SAVTSUBV EQU   IEDNSVTD+247                                             01065000
SAVTSUBA EQU   IEDNSVTD+246                                             01066000
SAVTSIBC EQU   IEDNSVTD+244                                             01067000
SAVTBSM  EQU   IEDNSVTD+240                                             01068000
SAVTSCPT EQU   SAVTTCPU                                                 01069000
SAVTRQTG EQU   IEDNSVTD+236                                             01070000
SAVTRQCH EQU   IEDNSVTD+232                                             01071000
SAVTMAND EQU   IEDNSVTD+228                                             01072000
SAVTSPLN EQU   IEDNSVTD+224                                             01073000
SAVTNADL EQU   IEDNSVTD+222                                             01074000
SAVTNATL EQU   IEDNSVTD+220                                             01075000
SAVTMHTB EQU   IEDNSVTD+216                                             01076000
SAVTSSMH EQU   IEDNSVTD+212                                             01077000
SAVTQRS  EQU   IEDNSVTD+208                                             01078000
SAVTRQIN EQU   IEDNSVTD+204                                             01079000
SAVTDFCO EQU   IEDNSVTD+200                                             01080000
SAVTSAO  EQU   IEDNSVTD+196                                             01081000
SAVTSARI EQU   IEDNSVTD+192                                             01082000
SAVTSAC  EQU   IEDNSVTD+188                                             01083000
SAVTSAI  EQU   IEDNSVTD+184                                             01084000
SAVTCSCI EQU   IEDNSVTD+180                                             01085000
SAVTSSRP EQU   IEDNSVTD+176                                             01086000
SAVTSSRQ EQU   IEDNSVTD+172                                             01087000
SAVTSCLU EQU   IEDNSVTD+168                                             01088000
SAVTXTRQ EQU   IEDNSVTD+164                                             01089000
SAVTMVBF EQU   IEDNSVTD+160                                             01090000
@NM00097 EQU   IEDNSVTD+148                                             01091000
SAVTIPCQ EQU   IEDNSVTD+144                                             01092000
@NM00096 EQU   IEDNSVTD+136                                             01093000
SAVTXFMI EQU   IEDNSVTD+132                                             01094000
@NM00095 EQU   IEDNSVTD+124                                             01095000
SAVTXFMO EQU   IEDNSVTD+120                                             01096000
@NM00094 EQU   IEDNSVTD+116                                             01097000
SAVTSSSR EQU   IEDNSVTD+112                                             01098000
SAVTSCPQ EQU   IEDNSVTD+108                                             01099000
SAVTSLCB EQU   IEDNSVTD+104                                             01100000
SAVTLUSR EQU   IEDNSVTD+100                                             01101000
@NM00093 EQU   SAVTLUSQ+8                                               01102000
SAVTLUSP EQU   SAVTLUSQ+4                                               01103000
SAVTLUSB EQU   SAVTLUSQ                                                 01104000
@NM00092 EQU   IEDNSVTD+84                                              01105000
SAVTSAT  EQU   IEDNSVTD+80                                              01106000
SAVTNAT  EQU   IEDNSVTD+76                                              01107000
SAVTCLUP EQU   IEDNSVTD+72                                              01108000
SAVTPIUT EQU   IEDNSVTD+68                                              01109000
SAVTRNTA EQU   IEDNSVTD+64                                              01110000
SAVTDNIR EQU   IEDNSVTD+60                                              01111000
SAVTCNIR EQU   IEDNSVTD+56                                              01112000
SAVTFLDH EQU   IEDNSVTD+52                                              01113000
SAVTSRTN EQU   IEDNSVTD+48                                              01114000
SAVTSREQ EQU   IEDNSVTD+44                                              01115000
SAVTFAIL EQU   IEDNSVTD+42                                              01116000
SAVTSUSE EQU   IEDNSVTD+40                                              01117000
SAVTSIB  EQU   IEDNSVTD+36                                              01118000
SAVTPRTN EQU   IEDNSVTD+32                                              01119000
@NM00091 EQU   IEDNSVTD+28                                              01120000
SAVTWH20 EQU   IEDNSVTD+26                                              01121000
SAVTPWT  EQU   IEDNSVTD+24                                              01122000
SAVTPRTQ EQU   IEDNSVTD+20                                              01123000
SAVTPREQ EQU   IEDNSVTD+16                                              01124000
SAVTPH20 EQU   IEDNSVTD+14                                              01125000
SAVTPUSE EQU   IEDNSVTD+12                                              01126000
SAVTPLCB EQU   IEDNSVTD+8                                               01127000
SAVTPOOL EQU   IEDNSVTD+4                                               01128000
SAVTPRMT EQU   SAVTDIAF                                                 01129000
SAVTVIRT EQU   SAVTDIAF                                                 01130000
AVTCPBNO EQU   IEDQAVTD+1244                                            01131000
AVTHRESS EQU   IEDQAVTD+1243                                            01132000
@NM00090 EQU   IEDQAVTD+1242                                            01133000
@NM00089 EQU   IEDQAVTD+1241                                            01134000
@NM00088 EQU   IEDQAVTD+1240                                            01135000
@NM00087 EQU   IEDQAVTD+1237                                            01136000
@NM00086 EQU   IEDQAVTD+1236                                            01137000
AVTHRESE EQU   @NM00085                                                 01138000
AVTRADDR EQU   IEDQAVTD+1228                                            01139000
AVTNADDR EQU   IEDQAVTD+1224                                            01140000
AVTHRESN EQU   IEDQAVTD+1220                                            01141000
AVTVOLRN EQU   IEDQAVTD+1216                                            01142000
AVTTOTNN EQU   IEDQAVTD+1212                                            01143000
AVTTRCYN EQU   IEDQAVTD+1208                                            01144000
AVTRCTRN EQU   IEDQAVTD+1204                                            01145000
AVTNOVON EQU   IEDQAVTD+1200                                            01146000
AVTADEBN EQU   IEDQAVTD+1196                                            01147000
AVTVOLRR EQU   IEDQAVTD+1192                                            01148000
AVTTOTNR EQU   IEDQAVTD+1188                                            01149000
AVTTRCYR EQU   IEDQAVTD+1184                                            01150000
AVTRCTRR EQU   IEDQAVTD+1180                                            01151000
AVTNOVOR EQU   IEDQAVTD+1176                                            01152000
AVTADEBR EQU   IEDQAVTD+1172                                            01153000
AVTLODPT EQU   IEDQAVTD+1168                                            01154000
AVTIOBN  EQU   IEDQAVTD+1164                                            01155000
AVTIOBR  EQU   IEDQAVTD+1160                                            01156000
AVTCPBPT EQU   IEDQAVTD+1156                                            01157000
AVTFCPB  EQU   IEDQAVTD+1152                                            01158000
@NM00084 EQU   IEDQAVTD+1148                                            01159000
AVTINCPQ EQU   IEDQAVTD+1144                                            01160000
@NM00083 EQU   IEDQAVTD+1140                                            01161000
@NM00082 EQU   IEDQAVTD+1137                                            01162000
@NM00081 EQU   AVTBIT4                                                  01163000
@NM00080 EQU   AVTBIT4                                                  01164000
@NM00079 EQU   AVTBIT4                                                  01165000
@NM00078 EQU   AVTBIT4                                                  01166000
@NM00077 EQU   AVTBIT4                                                  01167000
@NM00076 EQU   AVTBIT4                                                  01168000
@NM00075 EQU   AVTBIT4                                                  01169000
AVTRUFTN EQU   AVTBIT4                                                  01170000
@NM00074 EQU   IEDQAVTD+1132                                            01171000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01172000
@NM00073 EQU   IEDQAVTD+1124                                            01173000
AVTDKENQ EQU   IEDQAVTD+1120                                            01174000
@NM00072 EQU   IEDQAVTD+1116                                            01175000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01176000
AVTCOPY  EQU   IEDQAVTD+1108                                            01177000
AVTIA    EQU   IEDQAVTD+1104                                            01178000
AVTFL    EQU   IEDQAVTD+1100                                            01179000
@NM00071 EQU   IEDQAVTD+1096                                            01180000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01181000
AVTTOTNC EQU   IEDQAVTD+1088                                            01182000
AVTCMAX  EQU   IEDQAVTD+1084                                            01183000
AVTCMIN  EQU   IEDQAVTD+1080                                            01184000
AVTHM02  EQU   IEDQAVTD+1076                                            01185000
AVTOPCIN EQU   IEDQAVTD+1074                                            01186000
AVTDCTLN EQU   IEDQAVTD+1072                                            01187000
AVTOPMSK EQU   IEDQAVTD+1068                                            01188000
AVTDDFT  EQU   IEDQAVTD+1064                                            01189000
AVTSTEAL EQU   IEDQAVTD+1060                                            01190000
AVTOPTN  EQU   IEDQAVTD+1056                                            01191000
AVTDSKCT EQU   IEDQAVTD+1054                                            01192000
AVTCKRST EQU   IEDQAVTD+1053                                            01193000
AVTSTAN  EQU   AVTBIT3                                                  01194000
AVTSTACN EQU   AVTBIT3                                                  01195000
AVTSTAIN EQU   AVTBIT3                                                  01196000
AVTSTAYN EQU   AVTBIT3                                                  01197000
AVTOLTBN EQU   AVTBIT3                                                  01198000
AVTTSAB  EQU   AVTBIT3                                                  01199000
AVTRFULN EQU   AVTBIT3                                                  01200000
AVTRECVN EQU   AVTBIT3                                                  01201000
@NM00070 EQU   AVTBIT2                                                  01202000
@NM00069 EQU   AVTBIT2                                                  01203000
AVTOPEIN EQU   AVTBIT2                                                  01204000
AVTSTRTN EQU   AVTBIT2                                                  01205000
AVTTOPOL EQU   AVTBIT2                                                  01206000
AVTCOPYN EQU   AVTBIT2                                                  01207000
AVTREUSN EQU   AVTBIT2                                                  01208000
AVTEXTSC EQU   AVTBIT2                                                  01209000
AVTDISKN EQU   AVTBIT1                                                  01210000
AVTQUCKN EQU   AVTBIT1                                                  01211000
AVTCLOSN EQU   AVTBIT1                                                  01212000
AVTREADN EQU   AVTBIT1                                                  01213000
AVTDLAYN EQU   AVTBIT1                                                  01214000
AVTAQTAN EQU   AVTBIT1                                                  01215000
AVTTSON  EQU   AVTBIT1                                                  01216000
AVTAPLKN EQU   AVTBIT1                                                  01217000
AVTDUMBR EQU   IEDQAVTD+1048                                            01218000
AVTDLQX  EQU   IEDQAVTD+1046                                            01219000
AVTINTLV EQU   IEDQAVTD+1044                                            01220000
AVTSMCNT EQU   IEDQAVTD+1042                                            01221000
AVTAVFCT EQU   IEDQAVTD+1040                                            01222000
AVTOPCON EQU   IEDQAVTD+1038                                            01223000
AVTOPCNT EQU   IEDQAVTD+1036                                            01224000
AVTLNCNT EQU   IEDQAVTD+1034                                            01225000
AVTKEYLE EQU   IEDQAVTD+1032                                            01226000
AVTHA16  EQU   IEDQAVTD+1030                                            01227000
AVTHA7   EQU   IEDQAVTD+1028                                            01228000
AVTHA4   EQU   IEDQAVTD+1026                                            01229000
AVTHA3   EQU   IEDQAVTD+1024                                            01230000
AVTHA2   EQU   IEDQAVTD+1022                                            01231000
AVTGETMS EQU   IEDQAVTD+1021                                            01232000
@NM00068 EQU   IEDQAVTD+1020                                            01233000
AVTGETMD EQU   IEDQAVTD+1016                                            01234000
AVTGETMN EQU   IEDQAVTD+1012                                            01235000
AVTCWTOT EQU   IEDQAVTD+1008                                            01236000
AVTCWINT EQU   IEDQAVTD+956                                             01237000
AVTDTRAP EQU   IEDQAVTD+952                                             01238000
@NM00067 EQU   IEDQAVTD+950                                             01239000
@NM00066 EQU   AVTIOTR                                                  01240000
AVTIOTRH EQU   AVTIOTR                                                  01241000
AVTIOTRE EQU   AVTIOTR                                                  01242000
@NM00065 EQU   AVTSUBT                                                  01243000
AVTSUBPT EQU   AVTSUBT                                                  01244000
AVTSUBON EQU   AVTSUBT                                                  01245000
AVTAFE30 EQU   IEDQAVTD+944                                             01246000
AVTAFE20 EQU   IEDQAVTD+940                                             01247000
AVTAFE10 EQU   IEDQAVTD+936                                             01248000
AVTCWEC2 EQU   IEDQAVTD+932                                             01249000
AVTCWPM2 EQU   IEDQAVTD+928                                             01250000
AVTCWTS2 EQU   IEDQAVTD+927                                             01251000
AVTCWTS1 EQU   IEDQAVTD+926                                             01252000
AVTCWCLD EQU   AVTCWFL2                                                 01253000
AVTCWRAP EQU   AVTCWFL2                                                 01254000
@NM00064 EQU   AVTCWFL2                                                 01255000
@NM00063 EQU   AVTCWFL2                                                 01256000
@NM00062 EQU   AVTCWFL2                                                 01257000
@NM00061 EQU   AVTCWFL2                                                 01258000
@NM00060 EQU   AVTCWFL2                                                 01259000
AVTCWACT EQU   AVTCWFL2                                                 01260000
@NM00059 EQU   AVTCWFL1                                                 01261000
@NM00058 EQU   AVTCWFL1                                                 01262000
@NM00057 EQU   AVTCWFL1                                                 01263000
@NM00056 EQU   AVTCWFL1                                                 01264000
@NM00055 EQU   AVTCWFL1                                                 01265000
@NM00054 EQU   AVTCWFL1                                                 01266000
@NM00053 EQU   AVTCWFL1                                                 01267000
AVTCOMWN EQU   AVTCWFL1                                                 01268000
AVTCWEC1 EQU   IEDQAVTD+920                                             01269000
AVTCWPM1 EQU   IEDQAVTD+916                                             01270000
AVTCAREA EQU   IEDQAVTD+912                                             01271000
AVTFZERO EQU   IEDQAVTD+908                                             01272000
AVTCADDR EQU   IEDQAVTD+904                                             01273000
AVTCOREC EQU   IEDQAVTD+900                                             01274000
@NM00052 EQU   IEDQAVTD+892                                             01275000
AVTCPBCB EQU   IEDQAVTD+888                                             01276000
@NM00051 EQU   IEDQAVTD+880                                             01277000
AVTDSIOB EQU   IEDQAVTD+876                                             01278000
@NM00050 EQU   IEDQAVTD+868                                             01279000
AVTCPRMB EQU   IEDQAVTD+864                                             01280000
@NM00049 EQU   IEDQAVTD+856                                             01281000
AVTCLOSB EQU   IEDQAVTD+852                                             01282000
@NM00048 EQU   IEDQAVTD+844                                             01283000
AVTACTIB EQU   IEDQAVTD+840                                             01284000
@NM00047 EQU   IEDQAVTD+836                                             01285000
AVTOLTEB EQU   IEDQAVTD+832                                             01286000
AVTOLTCH EQU   AVTOLTQB+1                                               01287000
AVTOLTVT EQU   AVTOLTQB                                                 01288000
@NM00046 EQU   AVTOPCQB+8                                               01289000
@NM00045 EQU   AVTOPCEC+1                                               01290000
@NM00044 EQU   AVTOPCCC                                                 01291000
AVTOPCPO EQU   AVTOPCCC                                                 01292000
AVTOPCWA EQU   AVTOPCCC                                                 01293000
AVTOPCCH EQU   AVTOPCOB+1                                               01294000
AVTOPCVT EQU   AVTOPCOB                                                 01295000
@NM00043 EQU   AVTCKPQB+9                                               01296000
AVTCKPTS EQU   AVTCKPQB+8                                               01297000
@NM00042 EQU   AVTCKPEC+1                                               01298000
@NM00041 EQU   AVTCKPCC                                                 01299000
AVTCKPPO EQU   AVTCKPCC                                                 01300000
AVTCKPWA EQU   AVTCKPCC                                                 01301000
AVTCKPCH EQU   AVTCKPTB+1                                               01302000
AVTCKPVT EQU   AVTCKPTB                                                 01303000
@NM00040 EQU   IEDQAVTD+796                                             01304000
AVTBFRTB EQU   IEDQAVTD+792                                             01305000
@NM00039 EQU   IEDQAVTD+784                                             01306000
AVTBFREB EQU   IEDQAVTD+780                                             01307000
AVTTIMQ  EQU   IEDQAVTD+776                                             01308000
@NM00038 EQU   IEDQAVTD+772                                             01309000
AVTIMQPS EQU   IEDQAVTD+768                                             01310000
AVTINOUT EQU   IEDQAVTD+766                                             01311000
AVTREFTM EQU   IEDQAVTD+764                                             01312000
@NM00037 EQU   IEDQAVTD+752                                             01313000
AVTDELYB EQU   IEDQAVTD+748                                             01314000
AVTOCQPT EQU   IEDQAVTD+744                                             01315000
AVTTSOPT EQU   IEDQAVTD+740                                             01316000
AVTSUPPT EQU   IEDQAVTD+736                                             01317000
AVTCBQCB EQU   IEDQAVTD+732                                             01318000
AVTMSGS  EQU   IEDQAVTD+729                                             01319000
@NM00036 EQU   AVTSYSER                                                 01320000
@NM00035 EQU   AVTSYSER                                                 01321000
@NM00034 EQU   AVTSYSER                                                 01322000
@NM00033 EQU   AVTSYSER                                                 01323000
@NM00032 EQU   AVTSYSER                                                 01324000
@NM00031 EQU   AVTSYSER                                                 01325000
AVTCMAXN EQU   AVTSYSER                                                 01326000
AVTCMINN EQU   AVTSYSER                                                 01327000
AVT2260L EQU   IEDQAVTD+724                                             01328000
AVTABEPL EQU   AVTADBUF                                                 01329000
AVTHFF   EQU   AVTCLRHI+2                                               01330000
@NM00030 EQU   AVTCLRHI                                                 01331000
AVTCCLNK EQU   AVTCRELE+5                                               01332000
AVTCCPRI EQU   AVTCRELE+4                                               01333000
AVTCCQCB EQU   AVTCCELE+1                                               01334000
AVTCCKEY EQU   AVTCCELE                                                 01335000
AVTDELAD EQU   IEDQAVTD+704                                             01336000
AVTDELEM EQU   IEDQAVTD+700                                             01337000
AVTBSX   EQU   AVTCKLNK                                                 01338000
AVTOPETR EQU   AVTHG01                                                  01339000
@NM00029 EQU   AVTCKBYT                                                 01340000
AVTCKONQ EQU   AVTCKBYT                                                 01341000
@NM00028 EQU   AVTCKBYT                                                 01342000
@NM00027 EQU   AVTCKBYT                                                 01343000
@NM00026 EQU   AVTCKBYT                                                 01344000
@NM00025 EQU   AVTCKBYT                                                 01345000
@NM00024 EQU   AVTCKBYT                                                 01346000
@NM00023 EQU   AVTCKBYT                                                 01347000
AVTOPERT EQU   IEDQAVTD+690                                             01348000
AVTOPXCL EQU   IEDQAVTD+688                                             01349000
AVTOPERL EQU   IEDQAVTD+687                                             01350000
@NM00022 EQU   IEDQAVTD+686                                             01351000
AVTCKTIM EQU   IEDQAVTD+684                                             01352000
AVTCKELV EQU   IEDQAVTD+682                                             01353000
AVTCPRCD EQU   IEDQAVTD+681                                             01354000
AVTWARMN EQU   AVTCKELF                                                 01355000
AVTCRTLN EQU   AVTCKELF                                                 01356000
AVTCPIPN EQU   AVTCKELF                                                 01357000
AVTCCLCN EQU   AVTCKELF                                                 01358000
AVTCINCN EQU   AVTCKELF                                                 01359000
@NM00021 EQU   AVTCKELF                                                 01360000
AVTCMCPN EQU   AVTCKELF                                                 01361000
AVTNQBCK EQU   AVTCKELF                                                 01362000
AVTCKQAD EQU   IEDQAVTD+677                                             01363000
AVTSCBSZ EQU   IEDQAVTD+676                                             01364000
@NM00020 EQU   IEDQAVTD+672                                             01365000
AVTCKELE EQU   IEDQAVTD+668                                             01366000
@NM00019 EQU   AVTCKPEL+8                                               01367000
AVTCKRLK EQU   AVTCKPEL+5                                               01368000
AVTCKRPR EQU   AVTCKPEL+4                                               01369000
AVTCKRMQ EQU   AVTCKRMV+1                                               01370000
AVTCKRKY EQU   AVTCKRMV                                                 01371000
AVTHK    EQU   IEDQAVTD+648                                             01372000
AVTHI    EQU   IEDQAVTD+644                                             01373000
AVTIOT   EQU   IEDQAVTD+640                                             01374000
AVTNX    EQU   IEDQAVTD+636                                             01375000
AVTTONE  EQU   IEDQAVTD+632                                             01376000
AVTA3TL  EQU   IEDQAVTD+628                                             01377000
AVTDMECB EQU   IEDQAVTD+624                                             01378000
AVTABEND EQU   IEDQAVTD+618                                             01379000
AVTPLCBN EQU   IEDQAVTD+616                                             01380000
@NM00018 EQU   AVTSAVTP+1                                               01381000
@NM00017 EQU   AVTSAVTF                                                 01382000
AVTSNA   EQU   AVTSAVTF                                                 01383000
AVTONSNA EQU   AVTSAVTF                                                 01384000
AVTVTMCP EQU   AVTSAVTF                                                 01385000
@NM00016 EQU   IEDQAVTD+608                                             01386000
AVTCMBSS EQU   IEDQAVTD+604                                             01387000
AVTRCV   EQU   IEDQAVTD+600                                             01388000
AVTSEND  EQU   IEDQAVTD+596                                             01389000
AVTCSCH  EQU   IEDQAVTD+592                                             01390000
AVTQ1    EQU   IEDQAVTD+588                                             01391000
AVTE7    EQU   IEDQAVTD+584                                             01392000
AVTHB    EQU   IEDQAVTD+580                                             01393000
AVTR1    EQU   IEDQAVTD+576                                             01394000
AVTBZ    EQU   IEDQAVTD+572                                             01395000
AVTEZ    EQU   IEDQAVTD+568                                             01396000
AVTEC    EQU   IEDQAVTD+564                                             01397000
AVTEW    EQU   IEDQAVTD+560                                             01398000
AVTNDIAL EQU   AVTSCOPT                                                 01399000
AVTN2741 EQU   AVTSCOPT                                                 01400000
AVTCONCO EQU   AVTSCOPT                                                 01401000
AVTCONC  EQU   AVTSCOPT                                                 01402000
AVTCMBUF EQU   AVTSCOPT                                                 01403000
AVTAPDMP EQU   AVTSCOPT                                                 01404000
@NM00015 EQU   AVTSCOPT                                                 01405000
AVTHA    EQU   AVTDISP                                                  01406000
AVTEA    EQU   IEDQAVTD+548                                             01407000
AVTAX    EQU   IEDQAVTD+544                                             01408000
AVTA3    EQU   IEDQAVTD+540                                             01409000
AVTGD    EQU   IEDQAVTD+536                                             01410000
AVTAL    EQU   IEDQAVTD+532                                             01411000
AVTOLTST EQU   AVTHG02                                                  01412000
AVTE8    EQU   IEDQAVTD+524                                             01413000
AVTUI    EQU   IEDQAVTD+520                                             01414000
AVTCOMPT EQU   IEDQAVTD+516                                             01415000
AVTCRSRF EQU   IEDQAVTD+512                                             01416000
@NM00014 EQU   IEDQAVTD+508                                             01417000
AVTKA02  EQU   IEDQAVTD+504                                             01418000
AVTPCBPT EQU   IEDQAVTD+496                                             01419000
@NM00013 EQU   AVTECB1                                                  01420000
AVTCOMP  EQU   AVTECB1                                                  01421000
@NM00012 EQU   AVTECB1                                                  01422000
AVTOPECA EQU   IEDQAVTD+488                                             01423000
AVTOLECA EQU   IEDQAVTD+484                                             01424000
AVTCKECA EQU   IEDQAVTD+480                                             01425000
AVTCWECA EQU   IEDQAVTD+476                                             01426000
AVTCWTCB EQU   IEDQAVTD+472                                             01427000
AVTOLTCB EQU   IEDQAVTD+468                                             01428000
AVTOCTCB EQU   IEDQAVTD+464                                             01429000
AVTCKTCB EQU   IEDQAVTD+460                                             01430000
AVTAS    EQU   IEDQAVTD+456                                             01431000
AVTNOLBF EQU   IEDQAVTD+454                                             01432000
AVTNCKPR EQU   IEDQAVTD+453                                             01433000
AVTCIB   EQU   IEDQAVTD+452                                             01434000
AVTSPLPT EQU   IEDQAVTD+448                                             01435000
AVTMVBFR EQU   IEDQAVTD+444                                             01436000
AVTSBTA  EQU   IEDQAVTD+440                                             01437000
AVTRARTN EQU   IEDQAVTD+436                                             01438000
AVTBSCAN EQU   IEDQAVTD+432                                             01439000
AVTRDYA  EQU   IEDQAVTD+428                                             01440000
AVTRNMPT EQU   IEDQAVTD+424                                             01441000
AVTDISTR EQU   IEDQAVTD+420                                             01442000
AVTPARM3 EQU   IEDQAVTD+416                                             01443000
@NM00011 EQU   AVTPKF                                                   01444000
@NM00010 EQU   AVTPKF                                                   01445000
@NM00009 EQU   AVTPKF                                                   01446000
AVTFTCHF EQU   AVTPKF                                                   01447000
@NM00008 EQU   AVTPKF                                                   01448000
@NM00007 EQU   AVTPKF                                                   01449000
@NM00006 EQU   AVTPKF                                                   01450000
@NM00005 EQU   AVTPKF                                                   01451000
AVTPARM  EQU   IEDQAVTD+408                                             01452000
AVTEXS2A EQU   IEDQAVTD+402                                             01453000
AVTEXA2S EQU   IEDQAVTD+396                                             01454000
AVTOCGET EQU   IEDQAVTD+392                                             01455000
AVTCKAVT EQU   @NM00003+1                                               01456000
@NM00004 EQU   AVTCKFLG                                                 01457000
AVTCKHLT EQU   AVTCKFLG                                                 01458000
AVTCKREQ EQU   AVTCKFLG                                                 01459000
AVTCKENV EQU   AVTCKFLG                                                 01460000
AVTCKNAC EQU   AVTCKFLG                                                 01461000
AVTCKTAC EQU   AVTCKFLG                                                 01462000
@NM00002 EQU   IEDQAVTD+384                                             01463000
AVTREADD EQU   IEDQAVTD+380                                             01464000
AVTREADY EQU   IEDQAVTD+376                                             01465000
AVTRACE  EQU   IEDQAVTD+372                                             01466000
AVTTCB   EQU   IEDQAVTD+368                                             01467000
AVTPASWD EQU   IEDQAVTD+360                                             01468000
AVTCTLCH EQU   IEDQAVTD+352                                             01469000
AVTDOUBL EQU   IEDQAVTD+344                                             01470000
AVTDOUBX EQU   IEDQAVTD+336                                             01471000
AVTDPARM EQU   IEDQAVTD+332                                             01472000
AVTCSTCS EQU   IEDQAVTD+328                                             01473000
AVTDLQ   EQU   AVTSAVEX+32                                              01474000
@NM00001 EQU   AVTSAVEX                                                 01475000
AVTSAVE4 EQU   IEDQAVTD+216                                             01476000
AVTSAVE3 EQU   IEDQAVTD+144                                             01477000
AVTSAVE2 EQU   IEDQAVTD+72                                              01478000
AVTSAVE1 EQU   IEDQAVTD                                                 01479000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01480000
@RF00089 EQU   @RC00086                                                 01481000
@RF00080 EQU   @EL00001                                                 01482000
@ENDDATA EQU   *                                                        01483000
         END   IEDOPTN,(C'PLS2004',0701,77157)                          01484000
