         TITLE 'IEDQWA1 - TOTE INPUT DATA HANDLER                      *00001000
                        '                                               00002000
IEDQWA1  CSECT ,                                                01S0001 00003000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00004000
         BALR  @12,0                                            01S0001 00005000
@PSTART  LA    @05,4095(,@12)                                   01S0001 00006000
         USING @PSTART,@12                                      01S0001 00007000
         USING @PSTART+4095,@05                                 01S0001 00008000
         ST    @13,@SA00001+4                                   01S0001 00009000
         LA    @14,@SA00001                                     01S0001 00010000
         ST    @14,8(,@13)                                      01S0001 00011000
         LR    @13,@14                                          01S0001 00012000
IEDQWA1  IEDHJN AFTERHJN,HJN                                            00013000
*   BACK13=BACKSAVE;                /* SAVE BACKWARD POINTER TO 02S0512 00014000
*                                      CALLER'S SAVE AREA - SEVERAL     00015000
*                                      ROUTINES CALLED BY IEDQWA1       00016000
*                                      DESTROY THIS IN SAVEAREA 02S0512 00017000
*                                                            @YM07336*/ 00018000
         L     @14,BACKSAVE(,RSAVE)                             02S0512 00019000
         ST    @14,BACK13                                       02S0512 00020000
*   RRESPL=RPARM;                   /* TOTE RESPL BASE               */ 00021000
         LR    RRESPL,RPARM                                     02S0513 00022000
*   FLAGS=''B;                      /* INIT MODULE CONTROL FLAGS     */ 00023000
         MVI   FLAGS,X'00'                                      02S0514 00024000
*   RTNCODE=''B;                    /* INIT MODULE RETURN CODE AS       00025000
*                                      GOOD RETURN                   */ 00026000
         SLR   @14,@14                                          02S0515 00027000
         STC   @14,RTNCODE                                      02S0515 00028000
*                                                               02S0516 00029000
*   /*****************************************************************/ 00030000
*   /*                                                               */ 00031000
*   /* PROCESS: THIS SEGMENT PERFORMS THE MODULE FUNCTION            */ 00032000
*   /*                                                               */ 00033000
*   /*****************************************************************/ 00034000
*                                                               02S0516 00035000
*   GEN REFS(PSALITA,FLC);                                      02S0516 00036000
*                                                          /*@G36XRUV*/ 00037000
*                                          /*                  @G36XRUV 00038000
         MODESET MODE=SUP              SET TO SUPERVISOR MODE  @G36XRUV 00039000
         MODESET EXTKEY=SUPR           SET TO KEY ZERO         @G36XRUV 00040000
SETATSK  DS    0H                                              @G36XRUV 00041000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,       @G36XRUVC00042000
               RELATED=ATTACHED-TASKS-IGG019RO(SETATSK)        @G36XRUV 00043000
*   RPREFIX=AVTOLTCH;               /* POINT TO FIRST ELMT OF TOTE      00044000
*                                      QCB                   @YM07728*/ 00045000
         L     RPREFIX,AVTOLTCH-1(,RAVT)                        02S0517 00046000
         LA    RPREFIX,0(,RPREFIX)                              02S0517 00047000
*   AVTOLTCH=RPREFIX->PRFLINK;      /* DEQUEUE FIRST ELEMENT @YM07728*/ 00048000
         MVC   AVTOLTCH(3,RAVT),PRFLINK(RPREFIX)                02S0518 00049000
*   GEN REFS(PSALITA,FLC);                                      02S0519 00050000
*                                   /*                       @G36XRUV*/ 00051000
*                                   /*                         @G36XRUV 00052000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                  @G36XRUVC00053000
               RELATED=ATTACHED-TASKS-IEDQWA1(SETATSK)         @G36XRUV 00054000
         MODESET EXTKEY=TCAM      SET TO TCAM'S KEY            @G36XRUV 00055000
         MODESET MODE=PROB        SET TO PROBLEM MODE          @G36XRUV 00056000
*   IF PRFPRI^=PRITOTCL&PRFPRI^=PRIONLT THEN/* IF THIS IS MH INPUT   */ 00057000
         CLI   PRFPRI(RPREFIX),X'E8'                            02S0520 00058000
         BE    @RF00520                                         02S0520 00059000
         CLI   PRFPRI(RPREFIX),X'DC'                            02S0520 00060000
         BE    @RF00520                                         02S0520 00061000
*     DO;                           /* PROCESS MH INPUT TO SET PRFKEY*/ 00062000
*                                                               03S0522 00063000
*       /*************************************************************/ 00064000
*       /*                                                           */ 00065000
*       /* PROCESS.MHPROC: THIS SEGMENT PROCESSES A BUFFER WHICH HAS */ 00066000
*       /* GONE THROUGH MESSAGE HANDLER PROCESSING PRIOR TO BEING    */ 00067000
*       /* POSTED TO TOTE. THE POSSIBLE CONTENTS OF THIS BUFFER      */ 00068000
*       /* INCLUDE SNA TEST REQUEST MESSAGES AND SNA TOTE INPUT      */ 00069000
*       /* (CECOM REPLIES AND TEST DATA) FROM THE INBOUND SIDE OF THE*/ 00070000
*       /* SSCP AND TOTE MH'S RESPECTIVELY, AND THE ERRORMSG ELEMENT */ 00071000
*       /* GENERATED BY THE ERRORMSG EXIT IN THE TOTE MH. RPREFIX    */ 00072000
*       /* POINTS TO THE BUFFER, PRFSCAN CONTAINS THE OFFSET TO THE  */ 00073000
*       /* BEGINNING OF DATA                                         */ 00074000
*       /*                                                           */ 00075000
*       /*************************************************************/ 00076000
*                                                               03S0522 00077000
*       RPARM=PRFSCAN;              /* OBTAIN PRFSCAN        @YM07765*/ 00078000
         LH    RPARM,PRFSCAN(,RPREFIX)                          03S0522 00079000
*       SRL(RPARM,8);               /* SHIFT SCAN TO LOW ORDER BYTE     00080000
*                                                            @YM07765*/ 00081000
         SRL   RPARM,8                                          03S0523 00082000
*       PRFSCAN=RPARM;              /* STORE BACK IN PRFSCAN @YM07765*/ 00083000
         STH   RPARM,PRFSCAN(,RPREFIX)                          03S0524 00084000
*       IF PRFERMGN=ON THEN         /* IF THIS IS ERROR MESSAGE 03S0525 00085000
*                                      ELEMENT                       */ 00086000
         TM    PRFERMGN(RPREFIX),B'01000000'                    03S0525 00087000
         BNO   @RF00525                                         03S0525 00088000
*         IF ERRTEST=ON THEN        /* IF RESOURCE IS SNA TEST DEVICE*/ 00089000
         LA    @14,PRFSUNIT(,RPREFIX)                           03S0526 00090000
         LH    @10,PRFSCAN(,RPREFIX)                            03S0526 00091000
         ALR   @14,@10                                          03S0526 00092000
         TM    ERRTEST(@14),B'01000000'                         03S0526 00093000
         BNO   @RF00526                                         03S0526 00094000
*           PRFKEY=PRFSNAT;         /* SET SNA TEST DATA INDICATOR   */ 00095000
         MVI   PRFKEY(RPREFIX),X'28'                            03S0527 00096000
*         ELSE                      /* ELEMENT FOR CTL TERM OR ALT      00097000
*                                      PRTR                          */ 00098000
*           IF ERRSNA=ON&ERRRQREJ=ON&/* IF SNA DEVICE, REQUEST REJECT*/ 00099000
*               (ERRSNS=SNSIVREQ|ERRSNS=SNSNRSCE|ERRSNS=SNSRCXMT) THEN  00100000
         B     @RC00526                                         03S0528 00101000
@RF00526 LA    @14,PRFSUNIT(,RPREFIX)                           03S0528 00102000
         AH    @14,PRFSCAN(,RPREFIX)                            03S0528 00103000
         TM    ERRSNA(@14),B'10000000'                          03S0528 00104000
         BNO   @RF00528                                         03S0528 00105000
         TM    ERRRQREJ(@14),B'00000100'                        03S0528 00106000
         BNO   @RF00528                                         03S0528 00107000
         CLI   ERRSNS(@14),X'02'                                03S0528 00108000
         BE    @RT00528                                         03S0528 00109000
         CLI   ERRSNS(@14),X'12'                                03S0528 00110000
         BE    @RT00528                                         03S0528 00111000
         CLI   ERRSNS(@14),X'1B'                                03S0528 00112000
         BNE   @RF00528                                         03S0528 00113000
@RT00528 DS    0H                                               03S0529 00114000
*                                   /* IF TEMPORARY ERROR    @YM09016*/ 00115000
*             DO;                   /* NO ACTION NECESSARY - RETURN     00116000
*                                      BUF                           */ 00117000
*               PRFKEY=''B;         /* CLEAR                         */ 00118000
         MVI   PRFKEY(RPREFIX),X'00'                            03S0530 00119000
*               CALL RTNBUF;                                    03S0531 00120000
         BAL   @14,RTNBUF                                       03S0531 00121000
*             END;                  /* END OF TEMPORARY PROBLEM      */ 00122000
*           ELSE                    /* SEVERE ERROR ON OUTPUT TO        00123000
*                                      CT/AP                         */ 00124000
*             DO;                   /* SET PRFKEY AND PRINT MESSAGE  */ 00125000
         B     @RC00528                                         03S0533 00126000
@RF00528 DS    0H                                               03S0534 00127000
*               PRFKEY=PRFDEVFL;    /* SET DEVICE FAILURE INDICATOR  */ 00128000
         MVI   PRFKEY(RPREFIX),X'F0'                            03S0534 00129000
*               CALL DEVFLMSG;      /* PRINT MESSAGE                 */ 00130000
         BAL   @14,DEVFLMSG                                     03S0535 00131000
*             END;                  /* END OF SEVERE CT/AP PROBLEM      00132000
*                                      HDLG                          */ 00133000
*       ELSE                        /* INBOUND DATA FROM SNA DEVICE  */ 00134000
*         DO;                       /* MAY BE CECOM REPLY OR TEST       00135000
*                                      DATA                          */ 00136000
         B     @RC00525                                         03S0537 00137000
@RF00525 DS    0H                                               03S0538 00138000
*           RPARM=PRFSRCE;          /* OBTAIN TTCIN OF RESOURCE AND  */ 00139000
         LH    RPARM,PRFSRCE(,RPREFIX)                          03S0538 00140000
*           CALL IEDQTNT;           /* GET TTE ADDR                  */ 00141000
         L     @15,AVTRNMPT(,RAVT)                              03S0539 00142000
         BALR  @14,@15                                          03S0539 00143000
*           RTRM=RPARM;             /* TTE BASE                      */ 00144000
         LR    RTRM,RPARM                                       03S0540 00145000
*           IF TRMTDIFF=ON&PRFDEST^=SAVTSCPT THEN/* IF TEST DATA        00146000
*                                                            @YM08575*/ 00147000
         LR    @14,RTRM                                         03S0541 00148000
         AL    @14,@CF03300                                     03S0541 00149000
         TM    TRMTDIFF-1(@14),B'00010000'                      03S0541 00150000
         BNO   @RF00541                                         03S0541 00151000
         L     @14,AVTSAVTP(,RAVT)                              03S0541 00152000
         LH    @14,SAVTSCPT(,@14)                               03S0541 00153000
         N     @14,@CF03301                                     03S0541 00154000
         CH    @14,PRFDEST(,RPREFIX)                            03S0541 00155000
         BE    @RF00541                                         03S0541 00156000
*             DO;                                               03S0542 00157000
*               PRFKEY=PRFSNAT;     /* INDICATOR                     */ 00158000
         MVI   PRFKEY(RPREFIX),X'28'                            03S0543 00159000
*               IF(PRFSIZE-PRFSCAN)=1&RUBYTE1='00'X THEN/* FORMAT FOR   00160000
*                                      NULL RU                       */ 00161000
         LH    @14,PRFSCAN(,RPREFIX)                            03S0544 00162000
         LH    @10,PRFSIZE(,RPREFIX)                            03S0544 00163000
         SLR   @10,@14                                          03S0544 00164000
         C     @10,@CF00063                                     03S0544 00165000
         BNE   @RF00544                                         03S0544 00166000
         LA    @10,PRFSUNIT(,RPREFIX)                           03S0544 00167000
         ALR   @10,@14                                          03S0544 00168000
         CLI   RUBYTE1(@10),X'00'                               03S0544 00169000
         BNE   @RF00544                                         03S0544 00170000
*                 PRFSIZE=PRFSCAN;  /* SET AS NULL RU FOR RECEIVE MOD*/ 00171000
         STH   @14,PRFSIZE(,RPREFIX)                            03S0545 00172000
*               ELSE                                            03S0546 00173000
*                 ;                                             03S0546 00174000
@RF00544 DS    0H                                               03S0547 00175000
*             END;                                              03S0547 00176000
*           ELSE                    /* MUST BE CECOM REPLY           */ 00177000
*             IF PRFNHDRN=OFF THEN  /* IF THIS IS A HEADER BUFFER    */ 00178000
         B     @RC00541                                         03S0548 00179000
@RF00541 TM    PRFNHDRN(RPREFIX),B'00000001'                    03S0548 00180000
         BNZ   @RF00548                                         03S0548 00181000
*               PRFKEY=PRFSNACE;    /* SET INDICATOR FOR CE REPLY FOR   00182000
*                                      SNA RESOURCE (NO PLCB)        */ 00183000
         MVI   PRFKEY(RPREFIX),X'1C'                            03S0549 00184000
*             ELSE                  /* TEXT BUFFER, ALL CE MSGS ARE  */ 00185000
*               DO;                 /* RESTICTED TO 1 BUFFER, IGNORE */ 00186000
         B     @RC00548                                         03S0550 00187000
@RF00548 DS    0H                                               03S0551 00188000
*                 PRFKEY=''B;       /* CLEAR FOR CALL TO RTNBUF      */ 00189000
         MVI   PRFKEY(RPREFIX),X'00'                            03S0551 00190000
*                 CALL RTNBUF;      /* RETURN BUFFER TO TCAM         */ 00191000
         BAL   @14,RTNBUF                                       03S0552 00192000
*               END;                /* END OF TEXT BUFFER HANDLING   */ 00193000
*         END;                      /* END OF INBOUND SNA DATA  03S0554 00194000
*                                      HANDLING                      */ 00195000
*     END;                          /* END OF MH INPUT PROCESSING    */ 00196000
*   ELSE                            /* NOT INPUT FROM SSCP OR TOTE MH*/ 00197000
*     IF PRFKEY=PRFSRTMH THEN       /* IF FROM STARTMH MODULE        */ 00198000
         B     @RC00520                                         02S0556 00199000
@RF00520 CLI   PRFKEY(RPREFIX),X'04'                            02S0556 00200000
         BNE   @RF00556                                         02S0556 00201000
*       DO;                         /* SET PRFKEY AND SET LCB        */ 00202000
*                                                               03S0558 00203000
*         /***********************************************************/ 00204000
*         /*                                                         */ 00205000
*         /* PROCESS.STARTMH: THIS SEGMENT PROCESSES BUFFERS POSTED  */ 00206000
*         /* TO TOTE FROM THE STARTMH MODULE (IEDQAA). THESE BUFFERS */ 00207000
*         /* CONTAIN CEINPUT FROM START-STOP AND BI-SYNCH TERMINALS. */ 00208000
*         /* ONLY THE FIRST BUFFER OF THE MESSAGE IS ASSUMED TO HAVE */ 00209000
*         /* VALID INPUT, ALL OTHERS ARE RETURNED TO TCAM. PRFKEY IS */ 00210000
*         /* SET IN THE VALID BUFFERS.                               */ 00211000
*         /*                                                         */ 00212000
*         /***********************************************************/ 00213000
*                                                               03S0558 00214000
*         RFY                                                   03S0558 00215000
*           IEDQLCB BASED(PRFLCB);  /* BASE LCB ON BUF PREFIX FIELD  */ 00216000
*         IF PRFNHDRN=OFF THEN      /* IF THIS IS A HEADER BUFFER    */ 00217000
         TM    PRFNHDRN(RPREFIX),B'00000001'                    03S0559 00218000
         BNZ   @RF00559                                         03S0559 00219000
*           DO;                     /* THIS IS A VALID BUFFER        */ 00220000
*             IF PRFNLSTN=OFF THEN  /* IF LAST BUF IN MSG            */ 00221000
         TM    PRFNLSTN(RPREFIX),B'00000010'                    03S0561 00222000
         BNZ   @RF00561                                         03S0561 00223000
*               DO;                 /* TREAT AS HEADER LAST          */ 00224000
*                 IF LCBSYNC=OFF THEN/* IF START STOP DEVICE         */ 00225000
         L     @14,PRFLCB-1(,RPREFIX)                           03S0563 00226000
         TM    LCBSYNC(@14),B'00000100'                         03S0563 00227000
         BNZ   @RF00563                                         03S0563 00228000
*                   PRFKEY=PRFSS;   /* SET PRFKEY                    */ 00229000
         MVI   PRFKEY(RPREFIX),X'08'                            03S0564 00230000
*                 ELSE                                          03S0565 00231000
*                   ;               /* PRFKEY ALREADY SET FOR BSC    */ 00232000
@RF00563 DS    0H                                               03S0566 00233000
*                 LCBOLT=OFF;       /* RESET OLT BIT FOR NEXT I/O    */ 00234000
         L     @14,PRFLCB-1(,RPREFIX)                           03S0566 00235000
         NI    LCBOLT(@14),B'11111110'                          03S0566 00236000
*               END;                /* END OF HEADER LAST PROCESSING */ 00237000
*             ELSE                  /* HEADER,NOT LAST               */ 00238000
*               PRFKEY=PRFMULT;     /* SET MULTIPLE BUFFERED INPUT   */ 00239000
         B     @RC00561                                         03S0568 00240000
@RF00561 MVI   PRFKEY(RPREFIX),X'14'                            03S0568 00241000
*             LCBTSTSW=AVTEFF;      /* RESET                         */ 00242000
@RC00561 L     @14,PRFLCB-1(,RPREFIX)                           03S0569 00243000
         LA    @14,0(,@14)                                      03S0569 00244000
         MVI   LCBTSTSW(@14),X'FF'                              03S0569 00245000
*             LCBNEGRP=ON;          /* NEG RESP POLL                 */ 00246000
         OI    LCBNEGRP(@14),B'00001000'                        03S0570 00247000
*           END;                    /* END HEADER BUFFER HANDLING    */ 00248000
*         ELSE                      /* NOT HEADER BUFFER             */ 00249000
*           IF PRFNLSTN=ON THEN     /* IF NOT LAST BUFFER            */ 00250000
         B     @RC00559                                         03S0572 00251000
@RF00559 TM    PRFNLSTN(RPREFIX),B'00000010'                    03S0572 00252000
         BNO   @RF00572                                         03S0572 00253000
*             DO;                   /* RETURN BUFFER BUT NOT LCB     */ 00254000
*               PRFKEY=''B;         /* CLEAR TO INDICATE NO LCB      */ 00255000
         MVI   PRFKEY(RPREFIX),X'00'                            03S0574 00256000
*               CALL RTNBUF;        /* RETURN BUFFER                 */ 00257000
         BAL   @14,RTNBUF                                       03S0575 00258000
*             END;                  /* END ^FIRST,^LAST BUF HANDLING */ 00259000
*           ELSE                    /* LAST BUFFER IN MESSAGE        */ 00260000
*             DO;                   /* RETURN BUFFER AND LCB TO TCAM */ 00261000
         B     @RC00572                                         03S0577 00262000
@RF00572 DS    0H                                               03S0578 00263000
*               LCBOLT=OFF;         /* RESET OLT INDICATOR           */ 00264000
         L     @14,PRFLCB-1(,RPREFIX)                           03S0578 00265000
         NI    LCBOLT(@14),B'11111110'                          03S0578 00266000
*               CALL RTNBUF;        /* RETURN BUFFER AND LCB         */ 00267000
         BAL   @14,RTNBUF                                       03S0579 00268000
*             END;                  /* END OF LAST BUF HANDLING      */ 00269000
*         RFY                                                   03S0581 00270000
*           IEDQLCB BASED;          /* SET AS ON ENTRY TO SEGMENT    */ 00271000
@RC00572 DS    0H                                               03S0581 00272000
@RC00559 DS    0H                                               03S0582 00273000
*       END;                        /* END OF STARTMH PROCESSING     */ 00274000
*     ELSE                                                      02S0583 00275000
*       ;                           /* PRFKEY ALREADY SET CORRECTLY  */ 00276000
@RF00556 DS    0H                                               02S0584 00277000
*   IF BUFRTFLG=ON THEN                                         02S0584 00278000
@RC00520 TM    BUFRTFLG,B'00001000'                             02S0584 00279000
         BO    @RT00584                                         02S0584 00280000
*     ;                             /* IF BUFFER RETURNED - NO MORE     00281000
*                                      PROCESSING                    */ 00282000
*   ELSE                                                        02S0586 00283000
*     IF PRFKEY<PRFCEIN THEN        /* IF THIS IS CE INPUT           */ 00284000
         CLI   PRFKEY(RPREFIX),X'20'                            02S0586 00285000
         BNL   @RF00586                                         02S0586 00286000
*       DO;                                                     02S0587 00287000
*                                                               03S0588 00288000
*         /***********************************************************/ 00289000
*         /*                                                         */ 00290000
*         /* PROCESS.CEINPUT: THIS SEGMENT PROCESSES SINGLE BUFFERS  */ 00291000
*         /* WITH CE INPUT. IF THE INPUT IS TO BE PASSED TO OTHER    */ 00292000
*         /* TOTE MODULES, PRFSCAN IS UPDATED TO POINT PAST OLT      */ 00293000
*         /* HEADER.                                                 */ 00294000
*         /*                                                         */ 00295000
*         /***********************************************************/ 00296000
*                                                               03S0588 00297000
*         IF PRFKEY=PRFSS|PRFKEY=PRFBSC|PRFKEY=PRFMULT THEN/* IF        00298000
*                                      PRE-SNA                       */ 00299000
         CLI   PRFKEY(RPREFIX),X'08'                            03S0588 00300000
         BE    @RT00588                                         03S0588 00301000
         CLI   PRFKEY(RPREFIX),X'04'                            03S0588 00302000
         BE    @RT00588                                         03S0588 00303000
         CLI   PRFKEY(RPREFIX),X'14'                            03S0588 00304000
         BNE   @RF00588                                         03S0588 00305000
@RT00588 DS    0H                                               03S0589 00306000
*           DO;                     /* RESET ERROR LOCK IF 3705 TERM */ 00307000
*             RPARM=PRFSRCE;        /* TTCIN OF RESOURCE             */ 00308000
         LH    RPARM,PRFSRCE(,RPREFIX)                          03S0590 00309000
*             CALL IEDQTNT;         /* CONVERT TO TTE ADDR           */ 00310000
         L     @15,AVTRNMPT(,RAVT)                              03S0591 00311000
         BALR  @14,@15                                          03S0591 00312000
*             RTRM=RPARM;           /* TTE BASE                      */ 00313000
         LR    RTRM,RPARM                                       03S0592 00314000
*             IF TRMPREF=ON THEN    /* IF 3705 RESOURCE              */ 00315000
         TM    TRMPREF(RTRM),B'00010000'                        03S0593 00316000
         BNO   @RF00593                                         03S0593 00317000
*               TRMERLCK=ON;        /* SET ERROR LOCK IN TTE         */ 00318000
         LR    @14,RTRM                                         03S0594 00319000
         AL    @14,@CF03304                                     03S0594 00320000
         OI    TRMERLCK(@14),B'00000100'                        03S0594 00321000
*             ELSE                                              03S0595 00322000
*               ;                   /* NO ERROR LOCK FOR 270X        */ 00323000
@RF00593 DS    0H                                               03S0596 00324000
*           END;                    /* END OF ERROR LOCK PROCESSING  */ 00325000
*         ELSE                                                  03S0597 00326000
*           ;                                                   03S0597 00327000
@RF00588 DS    0H                                               03S0598 00328000
*                                                               04S0598 00329000
*         /***********************************************************/ 00330000
*         /*                                                         */ 00331000
*         /* PROCESS.CEINPUT.XLATE: THIS SEGMENT TRANSLATES DATA INTO*/ 00332000
*         /* EBCDIC. THE XLATEFLG SET INDICATES THAT THE DATA IS IN  */ 00333000
*         /* EBCDIC.                                                 */ 00334000
*         /*                                                         */ 00335000
*         /***********************************************************/ 00336000
*                                                               04S0598 00337000
*         RFY                                                   04S0598 00338000
*           IEDQLCB BASED(PRFLCB);  /* BASE LCB ON PTR IN BUF PREFIX */ 00339000
*         RFY                                                   04S0599 00340000
*           IHADCB BASED(LCBDCBPT); /* BASE DCB ON PTR IN LCB        */ 00341000
*         IF PRFKEY^=PRFSNACE&PRFKEY^=PRFSYS&PRFKEY^=PRFOPCTL THEN/*    00342000
*                                      IF NOT ALREADY EBCDIC         */ 00343000
         CLI   PRFKEY(RPREFIX),X'1C'                            04S0600 00344000
         BE    @RF00600                                         04S0600 00345000
         CLI   PRFKEY(RPREFIX),X'0C'                            04S0600 00346000
         BE    @RF00600                                         04S0600 00347000
         CLI   PRFKEY(RPREFIX),X'10'                            04S0600 00348000
         BE    @RF00600                                         04S0600 00349000
*           DO;                                                 04S0601 00350000
*             TABLPTR=DCBTRANS;     /* POINTER TO TRANS TABLE        */ 00351000
         L     @14,PRFLCB-1(,RPREFIX)                           04S0602 00352000
         L     @14,LCBDCBPT(,@14)                               04S0602 00353000
         L     TABLPTR,DCBTRANS+31(,@14)                        04S0602 00354000
         LA    TABLPTR,0(,TABLPTR)                              04S0602 00355000
*             IF XLATEWD1^=0 THEN   /* IF NOT ALREADY EBCDIC         */ 00356000
         L     @14,XLATEWD1(,TABLPTR)                           04S0603 00357000
         LTR   @14,@14                                          04S0603 00358000
         BZ    @RF00603                                         04S0603 00359000
*               DO;                                             04S0604 00360000
*                 DATAPTR=ADDR(PRFSUNIT)+PRFSCAN;/* POINT TO FIRST      00361000
*                                      DATA BYTE                     */ 00362000
         LA    @14,PRFSUNIT(,RPREFIX)                           04S0605 00363000
         AH    @14,PRFSCAN(,RPREFIX)                            04S0605 00364000
         ST    @14,DATAPTR                                      04S0605 00365000
*                 IF XLATETYP=TABPTS THEN/* IF THIS IS A TABLE OF       00366000
*                                      PTRS                          */ 00367000
         CLI   XLATETYP(TABLPTR),X'80'                          04S0606 00368000
         BNE   @RF00606                                         04S0606 00369000
*                   DO;                                         04S0607 00370000
*                     RFY                                       04S0608 00371000
*                       XTABLE BASED(XTABPT);/* BASE ON POINTER IN      00372000
*                                      TABLE                         */ 00373000
*                     IEDPLMV=''B;  /* SET UP PARAMETER LIST FOR MOVE*/ 00374000
         LA    @07,PARMLSP                                      04S0609 00375000
         XC    IEDPLMV(24,@07),IEDPLMV(@07)                     04S0609 00376000
*                     PLMVSU=RPREFIX;/* BUFFER ADDR                  */ 00377000
         ST    RPREFIX,PLMVSU(,@07)                             04S0610 00378000
*                     PLMVSD=DATAPTR;/* SOURCE DATA                  */ 00379000
         ST    @14,PLMVSD(,@07)                                 04S0611 00380000
*                     PLMVTU=ADDR(WORKAREA);/* TARGET                */ 00381000
         LA    @14,WORKAREA                                     04S0612 00382000
         ST    @14,PLMVTU(,@07)                                 04S0612 00383000
*                     PLMVTD=PLMVTU;/* TARGET                        */ 00384000
         ST    @14,PLMVTD(,@07)                                 04S0613 00385000
*                     PLMVLNTH=5;   /* MOVE 5 BYTES, MAX HDR LENGTH  */ 00386000
         MVC   PLMVLNTH(2,@07),@CH00033                         04S0614 00387000
*                     PLMVTCTG=ON;  /* SET TARGET CONTIGUOUS FLAG    */ 00388000
         OI    PLMVTCTG(@07),B'00100000'                        04S0615 00389000
*                     RPARM=ADDR(PARMLSP);/* ADDR OF PARM LIST       */ 00390000
         LR    RPARM,@07                                        04S0616 00391000
*                     CALL IEDMVBFR;/* MOVE DATA INTO WORKAREA       */ 00392000
         L     @15,AVTMVBFR(,RAVT)                              04S0617 00393000
         BALR  @14,@15                                          04S0617 00394000
*                     DO LOOPCTR=XLATECT TO 1 BY-1 WHILE(XLATEFLG=OFF); 00395000
         L     @14,XLATECT-1(,TABLPTR)                          04S0618 00396000
         LA    @14,0(,@14)                                      04S0618 00397000
         STH   @14,LOOPCTR                                      04S0618 00398000
         B     @DE00618                                         04S0618 00399000
@DL00618 TM    XLATEFLG,B'00010000'                             04S0618 00400000
         BNZ   @DC00618                                         04S0618 00401000
*                                   /* SET TO LOOP THRU TABLE        */ 00402000
*                       WRKAREA1(1:5)=WORKAREA(1:5);/* COPY MAX OLT     00403000
*                                      HEADER LEN            @YM07756*/ 00404000
         MVC   WRKAREA1(5),WORKAREA                             04S0619 00405000
*                       TR(WRKAREA1(1:5),XTABLE);/* TRANSLATE   04S0620 00406000
*                                                            @YM07756*/ 00407000
         L     @14,XTABPT(,TABLPTR)                             04S0620 00408000
         TR    WRKAREA1(5),XTABLE(@14)                          04S0620 00409000
*                       IF WRKAREA1(1:LENGTH(HDRSS))=HDRSS|/* IF        00410000
*                                      START-STOP HEADER             */ 00411000
*                           WRKAREA1(1:LENGTH(HDRBSC))=HDRBSC|/* IF     00412000
*                                      EP BSC HEADER         @YM07756*/ 00413000
*                           WRKAREA1(1:LENGTH(PERSLASH))=PERSLASH THEN  00414000
         CLC   WRKAREA1(5),@CC03076                             04S0621 00415000
         BE    @RT00621                                         04S0621 00416000
         CLC   WRKAREA1(3),HDRBSC                               04S0621 00417000
         BE    @RT00621                                         04S0621 00418000
         CLC   WRKAREA1(2),PERSLASH                             04S0621 00419000
         BNE   @RF00621                                         04S0621 00420000
@RT00621 DS    0H                                               04S0622 00421000
*                                   /* IF NCP BSC HEADER - NO SOH       00422000
*                                      CHARACTER             @YM07756*/ 00423000
*                         DO;       /* VALID XLATE TABLE FOUND       */ 00424000
*                           TABLPTR=XTABPT;/* SET POINTER TO XLATE      00425000
*                                      TABLE                         */ 00426000
         L     TABLPTR,XTABPT(,TABLPTR)                         04S0623 00427000
*                           XLATEFLG=ON;/* SET TRANSLATE FLAG        */ 00428000
         OI    XLATEFLG,B'00010000'                             04S0624 00429000
*                         END;                                  04S0625 00430000
*                       ELSE        /* NOT SUCCESSFUL TRANSLATE      */ 00431000
*                         TABLPTR=TABLPTR+LENGTH(XLATEWD1);/* POINT     00432000
*                                      TO NEXT XLATE TABLE           */ 00433000
         B     @RC00621                                         04S0626 00434000
@RF00621 AL    TABLPTR,@CF00256                                 04S0626 00435000
*                     END;                                      04S0627 00436000
@RC00621 SLR   @14,@14                                          04S0627 00437000
         BCTR  @14,0                                            04S0627 00438000
         AH    @14,LOOPCTR                                      04S0627 00439000
         STH   @14,LOOPCTR                                      04S0627 00440000
@DE00618 LTR   @14,@14                                          04S0627 00441000
         BP    @DL00618                                         04S0627 00442000
@DC00618 DS    0H                                               04S0628 00443000
*                     RFY                                       04S0628 00444000
*                       XTABLE BASED(TABLPTR);/* BASE FOR TRANS TABLE*/ 00445000
*                   END;                                        04S0629 00446000
*                 ELSE                                          04S0630 00447000
*                   DO;                                         04S0630 00448000
         B     @RC00606                                         04S0630 00449000
@RF00606 DS    0H                                               04S0631 00450000
*                     TABLPTR=TABLPTR+LENGTH(XLATEWD1);/* SET TO        00451000
*                                      START OF TABLE                */ 00452000
         AL    TABLPTR,@CF00256                                 04S0631 00453000
*                     XLATEFLG=ON;  /* SET TRANSLATE FLAG ON         */ 00454000
         OI    XLATEFLG,B'00010000'                             04S0632 00455000
*                   END;                                        04S0633 00456000
*                 IF XLATEFLG=ON THEN/* IF TRANSLATED                */ 00457000
@RC00606 TM    XLATEFLG,B'00010000'                             04S0634 00458000
         BNO   @RF00634                                         04S0634 00459000
*                   DO;                                         04S0635 00460000
*                     MSGPTR=RPREFIX;/* SAVE ADDR OF BUFFER          */ 00461000
         LR    MSGPTR,RPREFIX                                   04S0636 00462000
*                     TRANSLEN=AVTKEYLE-PRFSCAN;/* LENGTH OF TRANS      00463000
*                                      FOR 1ST UNIT                  */ 00464000
         LH    @14,AVTKEYLE(,RAVT)                              04S0637 00465000
         SH    @14,PRFSCAN(,RPREFIX)                            04S0637 00466000
         STH   @14,TRANSLEN                                     04S0637 00467000
*                     DO LOOPCTR=PRFNBUNT TO 1 BY-1;/* TRANSLATE ALL    00468000
*                                      UNITS IN BUFFER               */ 00469000
         SLR   @14,@14                                          04S0638 00470000
         IC    @14,PRFNBUNT(,RPREFIX)                           04S0638 00471000
         STH   @14,LOOPCTR                                      04S0638 00472000
         B     @DE00638                                         04S0638 00473000
@DL00638 DS    0H                                               04S0639 00474000
*                       TR(DATASTNG(1:TRANSLEN),XTABLE);/* TRANS UNIT*/ 00475000
         L     @07,DATAPTR                                      04S0639 00476000
         LH    @14,TRANSLEN                                     04S0639 00477000
         BCTR  @14,0                                            04S0639 00478000
         EX    @14,@SB03308                                     04S0639 00479000
*                       RPREFIX=PRFTIC;/* POINT TO NEXT UNIT         */ 00480000
         L     RPREFIX,PRFTIC(,RPREFIX)                         04S0640 00481000
*                       DATAPTR=ADDR(PRFSUNIT);/* START OF DATA      */ 00482000
         LA    @14,PRFSUNIT(,RPREFIX)                           04S0641 00483000
         ST    @14,DATAPTR                                      04S0641 00484000
*                       TRANSLEN=AVTKEYLE;/* LENGTH TO TRANSLATE     */ 00485000
         LH    @14,AVTKEYLE(,RAVT)                              04S0642 00486000
         STH   @14,TRANSLEN                                     04S0642 00487000
*                     END;                                      04S0643 00488000
         LH    @07,LOOPCTR                                      04S0643 00489000
         BCTR  @07,0                                            04S0643 00490000
         LR    @14,@07                                          04S0643 00491000
         STH   @14,LOOPCTR                                      04S0643 00492000
@DE00638 LTR   @14,@14                                          04S0643 00493000
         BP    @DL00638                                         04S0643 00494000
*                     RPREFIX=MSGPTR;/* SET PREFIX BASE BACK TO BEGIN*/ 00495000
         LR    RPREFIX,MSGPTR                                   04S0644 00496000
*                   END;                                        04S0645 00497000
*                 ELSE                                          04S0646 00498000
*                   DO;             /* CAN'T XLATE - PUT ON TRM Q FOR   00499000
*                                      LATER REJECTION               */ 00500000
         B     @RC00634                                         04S0646 00501000
@RF00634 DS    0H                                               04S0647 00502000
*                     RELMT=RPREFIX;/* COPY BUFFER ADDR              */ 00503000
         LR    RELMT,RPREFIX                                    04S0647 00504000
*                     PRFQCBA=ADDR(RESTRMQ);/* SET QCB ADDR          */ 00505000
         LA    @14,RESTRMQ(,RRESPL)                             04S0648 00506000
         STCM  @14,7,PRFQCBA(RPREFIX)                           04S0648 00507000
*                     RFY                                       04S0649 00508000
*                       REG03 RSTD; /* RETURN REG                    */ 00509000
*                     RBRNCH=RESADDND;/* ADDR OF ROUTINE     @YM07334*/ 00510000
         L     RBRNCH,RESADDND(,RRESPL)                         04S0650 00511000
*                     RFY                                       04S0651 00512000
*                       REG10 RSTD; /* RETURN REG            @YM07334*/ 00513000
*                     GEN SETS(REG10,RELMT,RPARM);              04S0652 00514000
*                                   /*CALL QUEUE HANDLER @YM07334*/     00515000
         BALR  REG10,RBRNCH           PLACE ON QUEUE                    00516000
*                     RFY                                       04S0653 00517000
*                       REG10 UNRSTD;/*                      @YM07334*/ 00518000
*                     RFY                                       04S0654 00519000
*                       REG03 UNRSTD;                           04S0654 00520000
*                     RPARM=RRESPL; /* ADDR OF RESIDENT PARM LIST    */ 00521000
         LR    RPARM,RRESPL                                     04S0655 00522000
*                     GEN;                                      04S0656 00523000
*                                   /*LINK TO RESOURCE MANAGER*/        00524000
        LINK  EP=IEDQWB                                                 00525000
*                     RTNCODE=REG15;/* SET RETURN CODE               */ 00526000
         STC   REG15,RTNCODE                                    04S0657 00527000
*                   END;                                        04S0658 00528000
*               END;                                            04S0659 00529000
*             ELSE                                              04S0660 00530000
*               XLATEFLG=ON;        /* SET TRANSLATE FLAG            */ 00531000
         B     @RC00603                                         04S0660 00532000
@RF00603 OI    XLATEFLG,B'00010000'                             04S0660 00533000
*           END;                                                04S0661 00534000
*         ELSE                                                  04S0662 00535000
*           XLATEFLG=ON;            /* SET TRANSLATE FLAG            */ 00536000
         B     @RC00600                                         04S0662 00537000
@RF00600 OI    XLATEFLG,B'00010000'                             04S0662 00538000
*         RFY                                                   04S0663 00539000
*           IEDQLCB BASED;          /* RESTORE AS AT START OF SEGMENT*/ 00540000
@RC00600 DS    0H                                               04S0664 00541000
*         RFY                                                   04S0664 00542000
*           IHADCB BASED;           /* RESTORE AS AT START OF SEGMENT*/ 00543000
*                                   /* INSURE EBCDIC DATA            */ 00544000
*         IF XLATEFLG=ON THEN       /* IF XLATE GOOD OR NOT NEEDED   */ 00545000
         TM    XLATEFLG,B'00010000'                             03S0665 00546000
         BNO   @RF00665                                         03S0665 00547000
*           DO;                                                 03S0666 00548000
*                                                               04S0667 00549000
*             /*******************************************************/ 00550000
*             /*                                                     */ 00551000
*             /* PROCESS.CEINPUT.MOVEMSG: THIS SEGMENT MOVES EITHER  */ 00552000
*             /* THE COMPLETE MESSAGE OR 40 BYTES, WHICH WHICHEVER IS*/ 00553000
*             /* LESS, INTO THE WORKAREA FOR EASIER HANDLING. THE 40 */ 00554000
*             /* BYTES IN AN ARBITRARY VALUE THAT SHOULD EASILY HOLD */ 00555000
*             /* ALL DATA OF INTEREST TO THIS ROUTINE.               */ 00556000
*             /*                                                     */ 00557000
*             /*******************************************************/ 00558000
*                                                               04S0667 00559000
*             WORKAREA=BLANK;       /* BLANK WORKAREA                */ 00560000
         MVI   WORKAREA+1,C' '                                  04S0667 00561000
         MVC   WORKAREA+2(38),WORKAREA+1                        04S0667 00562000
         MVI   WORKAREA,C' '                                    04S0667 00563000
*             IEDPLMV=''B;          /* INIT IEDMVBFR PARM LIST       */ 00564000
         LA    @14,PARMLSP                                      04S0668 00565000
         XC    IEDPLMV(24,@14),IEDPLMV(@14)                     04S0668 00566000
*             PLMVSU=RPREFIX;       /* SOURCE UNIT                   */ 00567000
         ST    RPREFIX,PLMVSU(,@14)                             04S0669 00568000
*             PLMVSD=ADDR(PRFSUNIT)+PRFSCAN;/* SOURCE DATA           */ 00569000
         LA    @10,PRFSUNIT(,RPREFIX)                           04S0670 00570000
         LH    @07,PRFSCAN(,RPREFIX)                            04S0670 00571000
         ALR   @10,@07                                          04S0670 00572000
         ST    @10,PLMVSD(,@14)                                 04S0670 00573000
*             PLMVTU=ADDR(WORKAREA);/* TARGET UNIT                   */ 00574000
         LA    @10,WORKAREA                                     04S0671 00575000
         ST    @10,PLMVTU(,@14)                                 04S0671 00576000
*             PLMVTD=PLMVTU;        /* TARGET DATA                   */ 00577000
         ST    @10,PLMVTD(,@14)                                 04S0672 00578000
*             PLMVTCTG=ON;          /* TARGET CONTIGUOUS FLAG        */ 00579000
         OI    PLMVTCTG(@14),B'00100000'                        04S0673 00580000
*             IF PRFSIZE>(PRFSCAN+40) THEN/* IF MESSAGE SIZE > 40       00581000
*                                                            @YM07414*/ 00582000
         LA    @10,40                                           04S0674 00583000
         ALR   @07,@10                                          04S0674 00584000
         CH    @07,PRFSIZE(,RPREFIX)                            04S0674 00585000
         BNL   @RF00674                                         04S0674 00586000
*               PLMVLNTH=40;        /* LENGTH OF MOVE                */ 00587000
         STH   @10,PLMVLNTH(,@14)                               04S0675 00588000
*             ELSE                                              04S0676 00589000
*               PLMVLNTH=PRFSIZE-PRFSCAN;/* LENGTH OF MOVE = MSG SIZE   00590000
*                                                            @YM07414*/ 00591000
         B     @RC00674                                         04S0676 00592000
@RF00674 LA    @14,PARMLSP                                      04S0676 00593000
         LH    @10,PRFSIZE(,RPREFIX)                            04S0676 00594000
         SH    @10,PRFSCAN(,RPREFIX)                            04S0676 00595000
         STH   @10,PLMVLNTH(,@14)                               04S0676 00596000
*             RPARM=ADDR(PARMLSP);  /* ADDRESS OF PARM LIST          */ 00597000
@RC00674 LA    RPARM,PARMLSP                                    04S0677 00598000
*             CALL IEDMVBFR;        /* MOVE INTO WORKAREA            */ 00599000
         L     @15,AVTMVBFR(,RAVT)                              04S0678 00600000
         BALR  @14,@15                                          04S0678 00601000
*                                   /* MOVE MESSAGE TO WORKAREA FOR     00602000
*                                      EASY HANDLING.SET DATAPTR TO     00603000
*                                      START OF WORKAREA             */ 00604000
*                                                               04S0679 00605000
*             /*******************************************************/ 00606000
*             /*                                                     */ 00607000
*             /* PROCESS.CEINPUT.HDRPASS: THIS SEGMENT BYPASSES THE  */ 00608000
*             /* OLT HEADER AND UPDATES DATAPTR AND PRFSCAN.         */ 00609000
*             /*                                                     */ 00610000
*             /*******************************************************/ 00611000
*                                                               04S0679 00612000
*             DATAPTR=ADDR(WORKAREA);/* INIT DATAPTR                 */ 00613000
         LA    @14,WORKAREA                                     04S0679 00614000
         ST    @14,DATAPTR                                      04S0679 00615000
*             IF DATASTNG(1:LENGTH(HDRSS))=HDRSS THEN/* IF START-STOP   00616000
*                                      HEADER                        */ 00617000
         CLC   DATASTNG(5,@14),@CC03076                         04S0680 00618000
         BNE   @RF00680                                         04S0680 00619000
*               DATAPTR=DATAPTR+LENGTH(HDRSS);/* MOVE PAST HEADER    */ 00620000
         AL    @14,@CF00033                                     04S0681 00621000
         ST    @14,DATAPTR                                      04S0681 00622000
*             ELSE                                              04S0682 00623000
*               IF DATASTNG(1:LENGTH(HDRFOLT))=HDRFOLT THEN/* IF SYS    00624000
*                                      CONSOLE OR OP CTL TERM        */ 00625000
         B     @RC00680                                         04S0682 00626000
@RF00680 L     @14,DATAPTR                                      04S0682 00627000
         CLC   DATASTNG(4,@14),@CC03082                         04S0682 00628000
         BNE   @RF00682                                         04S0682 00629000
*                 DATAPTR=DATAPTR+LENGTH(HDRFOLT);/* MOVE PAST HEADER*/ 00630000
         AL    @14,@CF00256                                     04S0683 00631000
         ST    @14,DATAPTR                                      04S0683 00632000
*               ELSE                                            04S0684 00633000
*                 IF DATASTNG(1:LENGTH(HDRBSC))=HDRBSC THEN/* IF EP     00634000
*                                      BSC HEADER            @YM07756*/ 00635000
         B     @RC00682                                         04S0684 00636000
@RF00682 L     @14,DATAPTR                                      04S0684 00637000
         CLC   DATASTNG(3,@14),HDRBSC                           04S0684 00638000
         BNE   @RF00684                                         04S0684 00639000
*                   DATAPTR=DATAPTR+LENGTH(HDRBSC);/* MOVE PAST 04S0685 00640000
*                                      HEADER                        */ 00641000
         AL    @14,@CF00076                                     04S0685 00642000
         ST    @14,DATAPTR                                      04S0685 00643000
*                 ELSE                                          04S0686 00644000
*                   IF DATASTNG(1:LENGTH(PERSLASH))=PERSLASH THEN/*     00645000
*                                      IF NCP BSC HEADER - NO SOH       00646000
*                                      CHARACTER             @YM07756*/ 00647000
         B     @RC00684                                         04S0686 00648000
@RF00684 L     @14,DATAPTR                                      04S0686 00649000
         CLC   DATASTNG(2,@14),PERSLASH                         04S0686 00650000
         BNE   @RF00686                                         04S0686 00651000
*                     DATAPTR=DATAPTR+LENGTH(PERSLASH);/* MOVE PAST     00652000
*                                      HEADER                        */ 00653000
         AL    @14,@CF00067                                     04S0687 00654000
         ST    @14,DATAPTR                                      04S0687 00655000
*             IF DATABYTE=STXCHAR THEN/* IF STX BSC CHAR             */ 00656000
@RF00686 DS    0H                                               04S0688 00657000
@RC00684 DS    0H                                               04S0688 00658000
@RC00682 DS    0H                                               04S0688 00659000
@RC00680 L     @14,DATAPTR                                      04S0688 00660000
         CLC   DATABYTE(1,@14),STXCHAR                          04S0688 00661000
         BNE   @RF00688                                         04S0688 00662000
*               DO;                                             04S0689 00663000
*                 DATAPTR=DATAPTR+1;/* UPDATE                        */ 00664000
         AL    @14,@CF00063                                     04S0690 00665000
         ST    @14,DATAPTR                                      04S0690 00666000
*                 RPARM=PRFSRCE;    /* TTCIN OF TERM                 */ 00667000
         LH    RPARM,PRFSRCE(,RPREFIX)                          04S0691 00668000
*                 CALL IEDQTNT;     /* CONVERT TO TTE ADDR           */ 00669000
         L     @15,AVTRNMPT(,RAVT)                              04S0692 00670000
         BALR  @14,@15                                          04S0692 00671000
*                 RTRM=RPARM;       /* TTE BASE                      */ 00672000
         LR    RTRM,RPARM                                       04S0693 00673000
*                 IF(AVTCSTCS+((TRMCHCIN-1)*LENGTH(IEDDCT)))->DCT3270=  00674000
*                     ON&TRMPREF=ON THEN/* IF NCP 3270               */ 00675000
         SLR   @14,@14                                          04S0694 00676000
         IC    @14,TRMCHCIN(,RTRM)                              04S0694 00677000
         BCTR  @14,0                                            04S0694 00678000
         MH    @14,@CH00061                                     04S0694 00679000
         AL    @14,AVTCSTCS(,RAVT)                              04S0694 00680000
         TM    DCT3270(@14),B'00000100'                         04S0694 00681000
         BNO   @RF00694                                         04S0694 00682000
         TM    TRMPREF(RTRM),B'00010000'                        04S0694 00683000
         BNO   @RF00694                                         04S0694 00684000
*                   DATAPTR=DATAPTR+1;/* BYPASS ADDRESS CHARACTER    */ 00685000
         LA    @14,1                                            04S0695 00686000
         AL    @14,DATAPTR                                      04S0695 00687000
         ST    @14,DATAPTR                                      04S0695 00688000
*                 ELSE                                          04S0696 00689000
*                   ;                                           04S0696 00690000
@RF00694 DS    0H                                               04S0697 00691000
*               END;                                            04S0697 00692000
*             ELSE                                              04S0698 00693000
*               ;                                               04S0698 00694000
@RF00688 DS    0H                                               04S0699 00695000
*             PRFSCAN=PRFSCAN+(DATAPTR-ADDR(WORKAREA));/* UPDATE PAST   00696000
*                                      HEADER                        */ 00697000
         L     @14,DATAPTR                                      04S0699 00698000
         LA    @10,WORKAREA                                     04S0699 00699000
         LCR   @10,@10                                          04S0699 00700000
         ALR   @10,@14                                          04S0699 00701000
         AH    @10,PRFSCAN(,RPREFIX)                            04S0699 00702000
         STH   @10,PRFSCAN(,RPREFIX)                            04S0699 00703000
*                                   /* UPDATE DATAPTR AND PRFSCAN TO    00704000
*                                      POINT PAST OLT HEADER         */ 00705000
*                                                               04S0700 00706000
*             /*******************************************************/ 00707000
*             /*                                                     */ 00708000
*             /* PROCESS.CEINPUT.CANCLREQ: THIS SEGMENT CHECKS TO SEE*/ 00709000
*             /* IF THE INPUT IS A CANCEL REQUEST. IF SO, IT SETS    */ 00710000
*             /* CANCLFLG AND SETS THE CANCEL FLAGS IN THE OLTCB. ON */ 00711000
*             /* ENTRY DATAPTR POINTS INTO WORKAREA AT THE FIRST BYTE*/ 00712000
*             /* OF DATA PAST THE OLT HEADER.                        */ 00713000
*             /*                                                     */ 00714000
*             /*******************************************************/ 00715000
*                                                               04S0700 00716000
*             RFY                                               04S0700 00717000
*               DATABYTE BASED(REG01);/* BASE ON WORK REG    @YM07358*/ 00718000
*             TR(WORKAREA(1:40),LOWTOUP);/* TRANS FROM LOWER TO UPPER   00719000
*                                      CASE                          */ 00720000
         TR    WORKAREA(40),LOWTOUP                             04S0701 00721000
*             IF DATASTNG(1:LENGTH(CANCLMSG))=CANCLMSG THEN/* IF THIS   00722000
*                                      IS A CANCEL REQUEST           */ 00723000
         CLC   DATASTNG(7,@14),CANCLMSG                         04S0702 00724000
         BNE   @RF00702                                         04S0702 00725000
*               DO;                                             04S0703 00726000
*                 CANCLFLG=ON;      /* SET CANCEL FLAG               */ 00727000
         OI    CANCLFLG,B'00100000'                             04S0704 00728000
*                 CTSRTADR=ADDR(CANLDATA);/* START OF CONTROL TERM      00729000
*                                      FIELD                 @YM07358*/ 00730000
         LA    CTSRTADR,CANLDATA(,@14)                          04S0705 00731000
*                 DO REG01=CTSRTADR TO ADDR(CANLLAST) WHILE(DATABYTE^=  00732000
*                       SLASH);     /* LOCATE SLASH          @YM07358*/ 00733000
         LR    REG01,CTSRTADR                                   04S0706 00734000
         B     @DE00706                                         04S0706 00735000
@DL00706 CLI   DATABYTE(REG01),C'/'                             04S0706 00736000
         BE    @DC00706                                         04S0706 00737000
*                 END;                                          04S0707 00738000
*                                                               04S0707 00739000
         AL    REG01,@CF00063                                   04S0707 00740000
@DE00706 L     @14,DATAPTR                                      04S0707 00741000
         LA    @14,CANLLAST(,@14)                               04S0707 00742000
         CR    REG01,@14                                        04S0707 00743000
         BNH   @DL00706                                         04S0707 00744000
@DC00706 DS    0H                                               04S0708 00745000
*/*NOTE:                            ASSUME SLASH LOCATED             */ 00746000
*                                                               04S0708 00747000
*                 CTNAMLEN=REG01-CTSRTADR+1;/* CALC LENGTH OF CONTROL   00748000
*                                      TERM NAME INCLUDING SLASH        00749000
*                                                            @YM07358*/ 00750000
         LR    CTNAMLEN,REG01                                   04S0708 00751000
         SLR   CTNAMLEN,CTSRTADR                                04S0708 00752000
         AL    CTNAMLEN,@CF00063                                04S0708 00753000
*                 OLTCBPTR=RESOBFWD;/* SET OLTCB BASE FROM OLTCB QCB */ 00754000
         L     OLTCBPTR,RESOBFWD(,RRESPL)                       04S0709 00755000
*                 DO WHILE TOTELKEY^=QENDKEY;/* SEARCH OLTCB QUEUE   */ 00756000
         B     @DE00710                                         04S0710 00757000
@DL00710 DS    0H                                               04S0711 00758000
*                   IF TOTCTNAM(1:CTNAMLEN)=CANLDATA(1:CTNAMLEN) THEN   00759000
         LR    @14,CTNAMLEN                                     04S0711 00760000
         BCTR  @14,0                                            04S0711 00761000
         L     @10,DATAPTR                                      04S0711 00762000
         EX    @14,@SC03310                                     04S0711 00763000
         BNE   @RF00711                                         04S0711 00764000
*                                   /* IF MATCH              @YM07358*/ 00765000
*                     IF TOTCONFG=ON THEN                       04S0712 00766000
         TM    TOTCONFG(OLTCBPTR),B'01000000'                   04S0712 00767000
         BO    @RT00712                                         04S0712 00768000
*                       ;           /* IF CONFIG RUN , DON'T CANCEL  */ 00769000
*                     ELSE                                      04S0714 00770000
*                       DO;                                     04S0714 00771000
*                         TOTCANCL=ON;/* SET CANCEL FLAG             */ 00772000
*                         TOTWACAN=ON;/* SET CANCEL PENDING          */ 00773000
         OI    TOTCANCL(OLTCBPTR),B'00100100'                   04S0716 00774000
*                       END;                                    04S0717 00775000
*                   ELSE                                        04S0718 00776000
*                     ;             /* NO MATCH              @YM07639*/ 00777000
@RF00711 DS    0H                                               04S0719 00778000
*                   OLTCBPTR=TOTELLNK;/* POINT TO NEXT OLTCB         */ 00779000
@RC00711 L     @14,TOTELLNK-1(,OLTCBPTR)                        04S0719 00780000
         LA    @14,0(,@14)                                      04S0719 00781000
         LR    OLTCBPTR,@14                                     04S0719 00782000
*                 END;                                          04S0720 00783000
@DE00710 CLI   TOTELKEY(OLTCBPTR),X'00'                         04S0720 00784000
         BNE   @DL00710                                         04S0720 00785000
*                 CALL RTNBUF;      /* RETURN BUFFER TO TCAM         */ 00786000
         BAL   @14,RTNBUF                                       04S0721 00787000
*               END;                                            04S0722 00788000
*             ELSE                                              04S0723 00789000
*               ;                   /* NOT CANCEL REQUEST            */ 00790000
@RF00702 DS    0H                                               04S0724 00791000
*             RFY                                               04S0724 00792000
*               DATABYTE BASED(DATAPTR);/* RESTORE AS AT START OF       00793000
*                                      SEGMENT               @YM07358*/ 00794000
*                                   /* CHECK IF CANCEL REQUEST AND IF   00795000
*                                      SO, PROCESS                   */ 00796000
*             IF CANCLFLG=OFF THEN  /* IF NOT CANCEL REQUEST,   03S0725 00797000
*                                      CONTINUE                      */ 00798000
         TM    CANCLFLG,B'00100000'                             03S0725 00799000
         BNZ   @RF00725                                         03S0725 00800000
*               DO;                                             03S0726 00801000
*                                                               04S0727 00802000
*                 /***************************************************/ 00803000
*                 /*                                                 */ 00804000
*                 /* PROCESS.CEINPUT.CEREPLY: THIS SEGMENT CHECKS TO */ 00805000
*                 /* SEE IF THE INPUT IS A REPLY TO A CECOM. IF SO,  */ 00806000
*                 /* IT PLACES THE BUFFER ON THE CECOM REPLY QUEUE,  */ 00807000
*                 /* TOTOLTMQ.                                       */ 00808000
*                 /*                                                 */ 00809000
*                 /***************************************************/ 00810000
*                                                               04S0727 00811000
*                 OLTCBPTR=RESOBFWD;                            04S0727 00812000
         L     OLTCBPTR,RESOBFWD(,RRESPL)                       04S0727 00813000
*                 DO WHILE(TOTELKEY^=QENDKEY&REPLYFLG=OFF);/* LOOP      00814000
*                                      WHILE NOT AT END OF QUEUE AND    00815000
*                                      NOT FOUND REPLY               */ 00816000
         B     @DE00728                                         04S0728 00817000
@DL00728 DS    0H                                               04S0729 00818000
*                   IF TOTOLTID=WRKOLTID THEN/* IF MATCH ON ID       */ 00819000
         L     @14,DATAPTR                                      04S0729 00820000
         CLC   TOTOLTID(2,OLTCBPTR),WRKOLTID(@14)               04S0729 00821000
         BNE   @RF00729                                         04S0729 00822000
*                     DO;                                       04S0730 00823000
*                       REPLYFLG=ON;/* SET FLAG                      */ 00824000
         OI    REPLYFLG,B'01000000'                             04S0731 00825000
*                       IF TOTREPEX=ON THEN/* IF REPLY EXPECTED      */ 00826000
         TM    TOTREPEX(OLTCBPTR),B'00000010'                   04S0732 00827000
         BNO   @RF00732                                         04S0732 00828000
*                         DO;       /* ADD REPLY TO QUEUE            */ 00829000
*                           TOTREPEX=OFF;/* RESET            @YM08137*/ 00830000
         NI    TOTREPEX(OLTCBPTR),B'11111101'                   04S0734 00831000
*                           RPARM=ADDR(TOTOLTMQ);/* QUEUE ADDR       */ 00832000
         LA    RPARM,TOTOLTMQ(,OLTCBPTR)                        04S0735 00833000
*                           PRFQCBA=RPARM;/* ADDR OF QCB             */ 00834000
         STCM  RPARM,7,PRFQCBA(RPREFIX)                         04S0736 00835000
*                           RELMT=RPREFIX;/* BUFFER IS ELEMENT TO       00836000
*                                      QUEUE                         */ 00837000
         LR    RELMT,RPREFIX                                    04S0737 00838000
*                           RFY                                 04S0738 00839000
*                             REG03 RSTD;                       04S0738 00840000
*                           RBRNCH=RESADDAF;/* ADDR OF ROUTINE  04S0739 00841000
*                                                            @YM07334*/ 00842000
         L     RBRNCH,RESADDAF(,RRESPL)                         04S0739 00843000
*                           RFY                                 04S0740 00844000
*                             REG10 RSTD;/* RETURN REG       @YM07334*/ 00845000
*                           GEN SETS(REG10,RELMT,RPARM);        04S0741 00846000
*                                   /*CALL QUEUE HANDLER @YM07334*/     00847000
         BALR  REG10,RBRNCH           ADD TO FRONT OF QUEUE             00848000
*                           RFY                                 04S0742 00849000
*                             REG10 UNRSTD;/*                @YM07334*/ 00850000
*                           RFY                                 04S0743 00851000
*                             REG03 UNRSTD;                     04S0743 00852000
*                           GEN REFS(TOTOTECB,OLTCBPTR);        04S0744 00853000
*                                   /*POST ECB*/                        00854000
        POST TOTOTECB(OLTCBPTR)                                         00855000
*                         END;                                  04S0745 00856000
*                       ELSE                                    04S0746 00857000
*                         CALL RTNBUF;/* RETURN BUFFER               */ 00858000
         B     @RC00732                                         04S0746 00859000
@RF00732 BAL   @14,RTNBUF                                       04S0746 00860000
*                     END;                                      04S0747 00861000
*                   ELSE                                        04S0748 00862000
*                     OLTCBPTR=TOTELLNK;/* GET NEXT OLTCB            */ 00863000
         B     @RC00729                                         04S0748 00864000
@RF00729 L     @14,TOTELLNK-1(,OLTCBPTR)                        04S0748 00865000
         LA    @14,0(,@14)                                      04S0748 00866000
         LR    OLTCBPTR,@14                                     04S0748 00867000
*                 END;                                          04S0749 00868000
@RC00729 DS    0H                                               04S0749 00869000
@DE00728 CLI   TOTELKEY(OLTCBPTR),X'00'                         04S0749 00870000
         BE    @DC00728                                         04S0749 00871000
         TM    REPLYFLG,B'01000000'                             04S0749 00872000
         BZ    @DL00728                                         04S0749 00873000
@DC00728 DS    0H                                               04S0750 00874000
*                                   /* CHECK IF REPLY TO CECOM AND IF   00875000
*                                      SO, PLACE ON REPLY QUEUE OF      00876000
*                                      OLTCB                         */ 00877000
*                 IF REPLYFLG=OFF THEN/* IF NOT A CECOM REPLY        */ 00878000
         TM    REPLYFLG,B'01000000'                             03S0750 00879000
         BNZ   @RF00750                                         03S0750 00880000
*                   DO;                                         03S0751 00881000
*                     OLTCBPTR=RESOBFWD;/* SET OLTCB BASE WITH ADDR     00882000
*                                      OF Q                          */ 00883000
         L     OLTCBPTR,RESOBFWD(,RRESPL)                       03S0752 00884000
*                     IF TOTELKEY=QENDKEY|RESBKTOT>=MINICORE THEN/*     00885000
*                                      IF ENOUGH CORE TO START TEST     00886000
*                                                            @ZM47904*/ 00887000
         CLI   TOTELKEY(OLTCBPTR),X'00'                         03S0753 00888000
         BE    @RT00753                                         03S0753 00889000
         LH    @14,RESBKTOT(,RRESPL)                            03S0753 00890000
         C     @14,@CF03106                                     03S0753 00891000
         BL    @RF00753                                         03S0753 00892000
@RT00753 DS    0H                                               03S0754 00893000
*                       DO;                                     03S0754 00894000
*                         PRFQCBA=ADDR(RESTRMQ);/* ADDR OF TRM QUEUE */ 00895000
         LA    @14,RESTRMQ(,RRESPL)                             03S0755 00896000
         STCM  @14,7,PRFQCBA(RPREFIX)                           03S0755 00897000
*                         RELMT=RPREFIX;/* PLACE BUFFER ADDR IN REG2 */ 00898000
         LR    RELMT,RPREFIX                                    03S0756 00899000
*                         RFY                                   03S0757 00900000
*                           REG03 RSTD;                         03S0757 00901000
*                         RBRNCH=RESADDND;/* ADDR OF ROUTINE @YM07334*/ 00902000
         L     RBRNCH,RESADDND(,RRESPL)                         03S0758 00903000
*                         RFY                                   03S0759 00904000
*                           REG10 RSTD;/* RETURN REG         @YM07334*/ 00905000
*                         GEN SETS(REG10,RELMT,RPARM);          03S0760 00906000
*                                   /*CALL QUEUE HANDLER @YM07334*/     00907000
         BALR  REG10,RBRNCH           ADD ELEMENT TO END OF QUEUE       00908000
*                         RFY                                   03S0761 00909000
*                           REG10 UNRSTD;/*                  @YM07334*/ 00910000
*                         RFY                                   03S0762 00911000
*                           REG03 UNRSTD;                       03S0762 00912000
*                         RPARM=RRESPL;/* ADDR OF RESIDENT PARM LIST */ 00913000
         LR    RPARM,RRESPL                                     03S0763 00914000
*                         GEN;                                  03S0764 00915000
*                                   /*LINK TO RESOURCE MANAGER*/        00916000
        LINK  EP=IEDQWB                                                 00917000
*                         RTNCODE=REG15;/* SET RETURN CODE           */ 00918000
         STC   REG15,RTNCODE                                    03S0765 00919000
*                       END;                                    03S0766 00920000
*                     ELSE                                      03S0767 00921000
*                       DO;                                     03S0767 00922000
         B     @RC00753                                         03S0767 00923000
@RF00753 DS    0H                                               03S0768 00924000
*                         CALL REQMSG;/* SEND MSG OT REQUESTING TERM */ 00925000
         BAL   @14,REQMSG                                       03S0768 00926000
*                       END;                                    03S0769 00927000
*                   END;                                        03S0770 00928000
*                 ELSE                                          03S0771 00929000
*                   ;                                           03S0771 00930000
@RF00750 DS    0H                                               03S0772 00931000
*               END;                                            03S0772 00932000
*             ELSE                                              03S0773 00933000
*               ;                                               03S0773 00934000
@RF00725 DS    0H                                               03S0774 00935000
*           END;                                                03S0774 00936000
*         ELSE                                                  03S0775 00937000
*           ;                                                   03S0775 00938000
@RF00665 DS    0H                                               03S0776 00939000
*       END;                                                    02S0776 00940000
*     ELSE                                                      02S0777 00941000
*       IF PRFKEY<PRFTEST THEN      /* IF THIS IS TEST INPUT         */ 00942000
         B     @RC00586                                         02S0777 00943000
@RF00586 CLI   PRFKEY(RPREFIX),X'30'                            02S0777 00944000
         BNL   @RF00777                                         02S0777 00945000
*         DO;                                                   02S0778 00946000
*                                                               03S0779 00947000
*           /*********************************************************/ 00948000
*           /*                                                       */ 00949000
*           /* PROCESS.TESTDATA: THIS SEGMENT PROCESSES TEST DATA. IT*/ 00950000
*           /* SCANS THE OLTCB QUEUE TO MATCH THE INCOMING DATA WITH */ 00951000
*           /* THE TEST.                                             */ 00952000
*           /*                                                       */ 00953000
*           /*********************************************************/ 00954000
*                                                               03S0779 00955000
*           IF PRFKEY=PRFEXTRP THEN /* IF EXEC TEST FME RESP         */ 00956000
         CLI   PRFKEY(RPREFIX),X'24'                            03S0779 00957000
         BNE   @RF00779                                         03S0779 00958000
*             DO;                                               03S0780 00959000
*               PRFSCAN=LOCISIZE&PRFSCAN;/* ISOLATE # OF IDLES IN       00960000
*                                      PRFSCAN                       */ 00961000
         LH    @14,PRFSCAN(,RPREFIX)                            03S0781 00962000
         LH    @10,LOCISIZE                                     03S0781 00963000
         N     @10,@CF03301                                     03S0781 00964000
         NR    @14,@10                                          03S0781 00965000
         STH   @14,PRFSCAN(,RPREFIX)                            03S0781 00966000
*               PRFSCAN=PRFSCAN+AVTHDRSZ;/* SET UP PRFSCAN CORRECTLY */ 00967000
         AL    @14,@CF00452                                     03S0782 00968000
         STH   @14,PRFSCAN(,RPREFIX)                            03S0782 00969000
*               TESTCOMP=PRF1SQID;  /* COMPARE IS DONE ON SEG #      */ 00970000
         LR    @14,RPREFIX                                      03S0783 00971000
         AL    @14,@CF03314                                     03S0783 00972000
         LH    @14,PRF1SQID-4(,@14)                             03S0783 00973000
         N     @14,@CF03301                                     03S0783 00974000
         STH   @14,TESTCOMP                                     03S0783 00975000
*             END;                                              03S0784 00976000
*           ELSE                                                03S0785 00977000
*             DO;                                               03S0785 00978000
         B     @RC00779                                         03S0785 00979000
@RF00779 DS    0H                                               03S0786 00980000
*               IF PRFKEY=PRFRTD THEN/* IF RECORD TEST DATA RU       */ 00981000
         CLI   PRFKEY(RPREFIX),X'20'                            03S0786 00982000
         BNE   @RF00786                                         03S0786 00983000
*                 DO;                                           03S0787 00984000
*                   PRFSCAN=LOCISIZE&PRFSCAN;/* ISOLATE # OF IDLES IN   00985000
*                                      PRFSCAN                       */ 00986000
         LH    @14,PRFSCAN(,RPREFIX)                            03S0788 00987000
         LH    @10,LOCISIZE                                     03S0788 00988000
         N     @10,@CF03301                                     03S0788 00989000
         NR    @14,@10                                          03S0788 00990000
         STH   @14,PRFSCAN(,RPREFIX)                            03S0788 00991000
*                   PRFSCAN=PRFSCAN+AVTHDRSZ;/* SET UP PRFSCAN  03S0789 00992000
*                                      CORRECTLY                     */ 00993000
         AL    @14,@CF00452                                     03S0789 00994000
         STH   @14,PRFSCAN(,RPREFIX)                            03S0789 00995000
*                   IEDPLMV=''B;    /* INIT PARM LIST                */ 00996000
         LA    @10,PARMLSP                                      03S0790 00997000
         XC    IEDPLMV(24,@10),IEDPLMV(@10)                     03S0790 00998000
*                   PLMVSU=RPREFIX; /* SOURCE UNIT                   */ 00999000
         ST    RPREFIX,PLMVSU(,@10)                             03S0791 01000000
*                   PLMVSD=ADDR(PRFSUNIT)+PRFSCAN;/* SOURCE DATA     */ 01001000
         LA    @07,PRFSUNIT(,RPREFIX)                           03S0792 01002000
         ALR   @07,@14                                          03S0792 01003000
         ST    @07,PLMVSD(,@10)                                 03S0792 01004000
*                   PLMVTU=ADDR(WORKAREA);/* TARGET                  */ 01005000
         LA    @14,WORKAREA                                     03S0793 01006000
         ST    @14,PLMVTU(,@10)                                 03S0793 01007000
*                   PLMVTD=PLMVTU;  /* TARGET                        */ 01008000
         ST    @14,PLMVTD(,@10)                                 03S0794 01009000
*                   PLMVLNTH=LENGTH(IEDXRTDD);/* LENGTH OF RECORD       01010000
*                                      TEST DATA RU                  */ 01011000
         MVC   PLMVLNTH(2,@10),@CH01479                         03S0795 01012000
*                   PLMVTCTG=ON;    /* SET TARGET CONTIGUOUS FLAG    */ 01013000
         OI    PLMVTCTG(@10),B'00100000'                        03S0796 01014000
*                   RPARM=ADDR(PARMLSP);/* ADDR OF PARM LIST         */ 01015000
         LR    RPARM,@10                                        03S0797 01016000
*                   CALL IEDMVBFR;  /* MOVE TO WORKAREA              */ 01017000
         L     @15,AVTMVBFR(,RAVT)                              03S0798 01018000
         BALR  @14,@15                                          03S0798 01019000
*                   RPARM=XRTDADDR; /* NETWORK ADDR FROM RU          */ 01020000
         LA    @14,WORKAREA                                     03S0799 01021000
         SLR   RPARM,RPARM                                      03S0799 01022000
         ICM   RPARM,3,XRTDADDR(@14)                            03S0799 01023000
*                   CALL IEDIAP03;  /* CONVERT TO TTCIN              */ 01024000
         L     @10,AVTSAVTP(,RAVT)                              03S0800 01025000
         L     @15,SAVTNAX(,@10)                                03S0800 01026000
         BALR  @14,@15                                          03S0800 01027000
*                   TESTCOMP=REG15; /* COMPARE FOR TEST MATCH        */ 01028000
         STH   REG15,TESTCOMP                                   03S0801 01029000
*                 END;                                          03S0802 01030000
*               ELSE                /* SNA TEST FLOW                 */ 01031000
*                 IF PRFERMGN=ON THEN/* IF ERRORMSG ELMT THEN        */ 01032000
         B     @RC00786                                         03S0803 01033000
@RF00786 TM    PRFERMGN(RPREFIX),B'01000000'                    03S0803 01034000
         BNO   @RF00803                                         03S0803 01035000
*                   DO;             /* FME RESPONSE                  */ 01036000
*                     TESTCOMP=ERRTTCIN;/* COMPARE FOR TEST MATCH    */ 01037000
         LA    @14,PRFSUNIT(,RPREFIX)                           03S0805 01038000
         LH    @10,PRFSCAN(,RPREFIX)                            03S0805 01039000
         ALR   @14,@10                                          03S0805 01040000
         MVC   TESTCOMP(2),ERRTTCIN(@14)                        03S0805 01041000
*                     PRFSCAN=PRFSCAN+LENGTH(ERRTYPE);/* MOVE PAST      01042000
*                                      TYPE FIELD                    */ 01043000
         AL    @10,@CF00063                                     03S0806 01044000
         STH   @10,PRFSCAN(,RPREFIX)                            03S0806 01045000
*                   END;            /* END OF SNA FME PROCESSING     */ 01046000
*                 ELSE              /* BUFFER HAS SNA REQUEST RU     */ 01047000
*                   TESTCOMP=PRFSRCE;/* FM DATA RU - TTCIN IN PREFIX */ 01048000
         B     @RC00803                                         03S0808 01049000
@RF00803 LH    @14,PRFSRCE(,RPREFIX)                            03S0808 01050000
         STH   @14,TESTCOMP                                     03S0808 01051000
*               TTYPEFLG=ON;        /* SET FLAG TO TTCIN IN TESTCOMP */ 01052000
@RC00803 DS    0H                                               03S0809 01053000
@RC00786 OI    TTYPEFLG,B'10000000'                             03S0809 01054000
*             END;                                              03S0810 01055000
*           OLTCBPTR=RESOBFWD;      /* POINT TO FIRST OLTCB ON QUEUE */ 01056000
@RC00779 L     OLTCBPTR,RESOBFWD(,RRESPL)                       03S0811 01057000
*           DO WHILE(TOTELKEY^=QENDKEY&FNDTFLG=OFF);/* SCAN UNTIL END   01058000
*                                      OF QUEUE OR MATCH FOUND FOR      01059000
*                                      TESTCOMP                      */ 01060000
         B     @DE00812                                         03S0812 01061000
@DL00812 DS    0H                                               03S0813 01062000
*             IF(TTYPEFLG=ON&(TOTPROFF=TESTCOMP|TOTPCOFF=TESTCOMP))|(   01063000
*                 TTYPEFLG=OFF&TOTPRSEQ=TESTCOMP) THEN/* IF FOR 03S0813 01064000
*                                      PRIMARY DEVICE        @YM08534*/ 01065000
         TM    TTYPEFLG,B'10000000'                             03S0813 01066000
         BNO   @GL00017                                         03S0813 01067000
         CLC   TOTPROFF(2,OLTCBPTR),TESTCOMP                    03S0813 01068000
         BE    @RT00813                                         03S0813 01069000
         CLC   TOTPCOFF(2,OLTCBPTR),TESTCOMP                    03S0813 01070000
         BE    @RT00813                                         03S0813 01071000
@GL00017 TM    TTYPEFLG,B'10000000'                             03S0813 01072000
         BNZ   @RF00813                                         03S0813 01073000
         CLC   TOTPRSEQ(2,OLTCBPTR),TESTCOMP                    03S0813 01074000
         BNE   @RF00813                                         03S0813 01075000
@RT00813 DS    0H                                               03S0814 01076000
*               DO;                                             03S0814 01077000
*                 PRFQCBA=ADDR(TOTPRBUF);/* SET TO POST TO PRIMARY      01078000
*                                      DEVICE QCB                    */ 01079000
         LA    @14,TOTPRBUF(,OLTCBPTR)                          03S0815 01080000
         STCM  @14,7,PRFQCBA(RPREFIX)                           03S0815 01081000
*                 RELMT=RPREFIX;    /* ADDR OF POSTED ELEMENT        */ 01082000
         LR    RELMT,RPREFIX                                    03S0816 01083000
*                 RFY                                           03S0817 01084000
*                   REG03 RSTD;                                 03S0817 01085000
*                 RFY                                           03S0818 01086000
*                   REG10 RSTD;     /*                       @G36XRUV*/ 01087000
*                 REG10=RESADDND;   /* ADDR OF ROUTINE       @G36XRUV*/ 01088000
         L     REG10,RESADDND(,RRESPL)                          03S0819 01089000
*                 GEN SETS(REG10,RELMT,RPARM) REFS(PSALITA,FLC);        01090000
*                                                  /*    @G36XRUV*/     01091000
         MODESET MODE=SUP             SET SUPERVISOR STATE     @G36XRUV 01092000
         MODESET EXTKEY=SUPR          SET KEY ZERO             @G36XRUV 01093000
SETTSTBF DS    0H                     PRIMARY (SECONDARY BELOW)@G36XRUV 01094000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,       @G36XRUVC01095000
               RELATED=ATTACHED-TASKS-IEDQWS-IEDQW33(SETTSTBF) @G36XRUV 01096000
         LR    RBRNCH,REG10           COPY ENTRY POINT         @G36XRUV 01097000
         BALR  REG10,RBRNCH           PLACE ON QUEUE           @G36XRUV 01098000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                  @G36XRUVC01099000
               RELATED=ATTACHED-TASKS-IEDQWA1(SETTSTBF)        @G36XRUV 01100000
         MODESET EXTKEY=TCAM          TCAM'S KEY               @G36XRUV 01101000
         MODESET MODE=PROB            PROBLEM MODE             @G36XRUV 01102000
*                 RFY                                           03S0821 01103000
*                   REG10 UNRSTD;   /*                       @YM07334*/ 01104000
*                 RFY                                           03S0822 01105000
*                   REG03 UNRSTD;                               03S0822 01106000
*                 GEN REFS(TOTPRECB,OLTCBPTR);                  03S0823 01107000
         POST  TOTPRECB(OLTCBPTR)   POST OLT                            01108000
*                 FNDTFLG=ON;       /* FOUND TEST DEVICE MATCH       */ 01109000
         OI    FNDTFLG,B'00000010'                              03S0824 01110000
*               END;                                            03S0825 01111000
*             ELSE                                              03S0826 01112000
*               IF(TTYPEFLG=ON&(TOTSCOFF=TESTCOMP|TOTNCOFF=TESTCOMP))|( 01113000
*                   TTYPEFLG=OFF&TOTSCSEQ=TESTCOMP) THEN/* IF FOR       01114000
*                                      SECONDARY DEV         @YM08534*/ 01115000
         B     @RC00813                                         03S0826 01116000
@RF00813 TM    TTYPEFLG,B'10000000'                             03S0826 01117000
         BNO   @GL00021                                         03S0826 01118000
         CLC   TOTSCOFF(2,OLTCBPTR),TESTCOMP                    03S0826 01119000
         BE    @RT00826                                         03S0826 01120000
         CLC   TOTNCOFF(2,OLTCBPTR),TESTCOMP                    03S0826 01121000
         BE    @RT00826                                         03S0826 01122000
@GL00021 TM    TTYPEFLG,B'10000000'                             03S0826 01123000
         BNZ   @RF00826                                         03S0826 01124000
         CLC   TOTSCSEQ(2,OLTCBPTR),TESTCOMP                    03S0826 01125000
         BNE   @RF00826                                         03S0826 01126000
@RT00826 DS    0H                                               03S0827 01127000
*                 DO;                                           03S0827 01128000
*                   PRFQCBA=ADDR(TOTSCBUF);/* SET TO POST TO    03S0828 01129000
*                                      SECONDARY DEVICE QCB          */ 01130000
         LA    @14,TOTSCBUF(,OLTCBPTR)                          03S0828 01131000
         STCM  @14,7,PRFQCBA(RPREFIX)                           03S0828 01132000
*                   RELMT=RPREFIX;  /* ADDR OF POSTED ELEMENT        */ 01133000
         LR    RELMT,RPREFIX                                    03S0829 01134000
*                   RFY                                         03S0830 01135000
*                     REG03 RSTD;                               03S0830 01136000
*                   RFY                                         03S0831 01137000
*                     REG10 RSTD;   /*                       @G36XRUV*/ 01138000
*                   REG10=RESADDND; /* ADDR OF ROUTINE       @G36XRUV*/ 01139000
         L     REG10,RESADDND(,RRESPL)                          03S0832 01140000
*                   GEN SETS(REG10,RELMT,RPARM) REFS(PSALITA,FLC);      01141000
*                                                  /*    @G36XRUV*/     01142000
         MODESET MODE=SUP             SET SUPERVISOR STATE     @G36XRUV 01143000
         MODESET EXTKEY=SUPR          SET KEY ZERO             @G36XRUV 01144000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,       @G36XRUVC01145000
               RELATED=ATTACHED-TASKS-IEDQWS-IEDQW33(SETTSTBF) @G36XRUV 01146000
         LR    RBRNCH,REG10           COPY ENTRY POINT         @G36XRUV 01147000
         BALR  REG10,RBRNCH           PLACE ON QUEUE           @G36XRUV 01148000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                  @G36XRUVC01149000
               RELATED=ATTACHED-TASKS-IEDQWA1(SETTSTBF)        @G36XRUV 01150000
         MODESET EXTKEY=TCAM          TCAM'S KEY               @G36XRUV 01151000
         MODESET MODE=PROB            PROBLEM MODE             @G36XRUV 01152000
*                   RFY                                         03S0834 01153000
*                     REG10 UNRSTD; /*                       @YM07334*/ 01154000
*                   RFY                                         03S0835 01155000
*                     REG03 UNRSTD;                             03S0835 01156000
*                   GEN REFS(TOTSCECB,OLTCBPTR);                03S0836 01157000
         POST  TOTSCECB(OLTCBPTR)   POST OLT                            01158000
*                   FNDTFLG=ON;     /* FOUND TEST DEVICE MATCH       */ 01159000
         OI    FNDTFLG,B'00000010'                              03S0837 01160000
*                 END;                                          03S0838 01161000
*               ELSE                /* NOT FOR THIS OLTCB            */ 01162000
*                 OLTCBPTR=TOTELLNK;/* GET NEXT OLTCB                */ 01163000
         B     @RC00826                                         03S0839 01164000
@RF00826 L     @14,TOTELLNK-1(,OLTCBPTR)                        03S0839 01165000
         LA    @14,0(,@14)                                      03S0839 01166000
         LR    OLTCBPTR,@14                                     03S0839 01167000
*           END;                                                03S0840 01168000
@RC00826 DS    0H                                               03S0840 01169000
@RC00813 DS    0H                                               03S0840 01170000
@DE00812 CLI   TOTELKEY(OLTCBPTR),X'00'                         03S0840 01171000
         BE    @DC00812                                         03S0840 01172000
         TM    FNDTFLG,B'00000010'                              03S0840 01173000
         BZ    @DL00812                                         03S0840 01174000
@DC00812 DS    0H                                               03S0841 01175000
*           IF FNDTFLG=OFF THEN     /* IF TEST DEVICE MATCH NOT FOUND*/ 01176000
         TM    FNDTFLG,B'00000010'                              03S0841 01177000
         BNZ   @RF00841                                         03S0841 01178000
*             DO;                                               03S0842 01179000
*               GEN;                                            03S0843 01180000
         WTO   'IED258I ERROR RESPONSE TO OLTT I/O - RESOURCE ID NOT UNC01181000
               DER TEST.'                                               01182000
*               CALL RTNBUF;        /* RETURN BUFFER TO TCAM         */ 01183000
         BAL   @14,RTNBUF                                       03S0844 01184000
*             END;                                              03S0845 01185000
*           ELSE                                                03S0846 01186000
*             ;                                                 03S0846 01187000
@RF00841 DS    0H                                               03S0847 01188000
*         END;                                                  02S0847 01189000
*       ELSE                                                    02S0848 01190000
*         DO;                       /* INITIATE CLEANUP              */ 01191000
         B     @RC00777                                         02S0848 01192000
@RF00777 DS    0H                                               02S0849 01193000
*                                                               03S0849 01194000
*           /*********************************************************/ 01195000
*           /*                                                       */ 01196000
*           /* PROCESS.CLEANUP: THIS SEGMENT PROCESSES REQUESTS FOR  */ 01197000
*           /* ABNORMAL CLEANUP. RPREFIX POINTS TO AN ELEMENT WHICH  */ 01198000
*           /* MAY BE OF TWO TYPES: 1) AN ERRORMSG ELEMENT POSTED TO */ 01199000
*           /* TOTE FROM THE TOTE MH WHEN AN I/O ERROR IS DETECTED.  */ 01200000
*           /* 2) AN OPERATOR CONTROL SYNCHRONIZATION ELEMENT        */ 01201000
*           /* INDICATING THAT A RESOURCE SUPERIOR TO ONE IN OLT MODE*/ 01202000
*           /* IS BEING DEACTIVATED DUE TO AN OPERATOR COMMAND OR    */ 01203000
*           /* NETWORK MALFUNCTION.                                  */ 01204000
*           /*                                                       */ 01205000
*           /*********************************************************/ 01206000
*                                                               03S0849 01207000
*           RFY                                                 03S0849 01208000
*             RELMT UNRSTD;                                     03S0849 01209000
*           RFY                                                 03S0850 01210000
*             RTRM UNRSTD;                                      03S0850 01211000
*           IF PRFKEY=PRFOPCLN THEN /* IF A OP CTL ELEMENT           */ 01212000
         CLI   PRFKEY(RPREFIX),X'FE'                            03S0851 01213000
         BNE   @RF00851                                         03S0851 01214000
*             TESTCTR=''B;          /* INIT TEST COUNTER             */ 01215000
         SLR   @14,@14                                          03S0852 01216000
         STH   @14,TESTCTR(,RPREFIX)                            03S0852 01217000
*           OLTCBPTR=RESOBFWD;      /* POINT TO FIRST OLTCB          */ 01218000
@RF00851 L     OLTCBPTR,RESOBFWD(,RRESPL)                       03S0853 01219000
*           DO WHILE(TOTELKEY^=QENDKEY&CLNUPFLG=OFF);/* LOOP THRU       01220000
*                                      OLTCB Q UNTIL AFFECTED TEST      01221000
*                                      FOUND                 @XM05671*/ 01222000
         B     @DE00854                                         03S0854 01223000
@DL00854 DS    0H                                               03S0855 01224000
*             IF(PRFKEY=PRFOPCLN&   /* IF OP CTL ELMT AND            */ 01225000
*                 (OPTTCIN=TOTCROFF|/* CONTROL TERM                  */ 01226000
*                 OPTTCIN=TOTAROFF| /* ALTERNATE PRINTER             */ 01227000
*                 OPTTCIN=TOTPROFF| /* PRIMARY DEVICE                */ 01228000
*                 OPTTCIN=TOTSROFF))|/* OR SECONDARY DEVICE MATCH    */ 01229000
*                 (PRFKEY=PRFDEVFL& /* OR IF ERRORMSG ELEMENT AND    */ 01230000
*                 (ERRTTCIN=TOTCTOFF|/* CONTROL TERM                 */ 01231000
*                 ERRTTCIN=TOTAPOFF)) THEN/* OR ALTERNATE PRINTER       01232000
*                                      MATCH                         */ 01233000
         CLI   PRFKEY(RPREFIX),X'FE'                            03S0855 01234000
         BNE   @GL00026                                         03S0855 01235000
         CLC   OPTTCIN(2,RPREFIX),TOTCROFF(OLTCBPTR)            03S0855 01236000
         BE    @RT00855                                         03S0855 01237000
         CLC   OPTTCIN(2,RPREFIX),TOTAROFF(OLTCBPTR)            03S0855 01238000
         BE    @RT00855                                         03S0855 01239000
         CLC   OPTTCIN(2,RPREFIX),TOTPROFF(OLTCBPTR)            03S0855 01240000
         BE    @RT00855                                         03S0855 01241000
         CLC   OPTTCIN(2,RPREFIX),TOTSROFF(OLTCBPTR)            03S0855 01242000
         BE    @RT00855                                         03S0855 01243000
@GL00026 CLI   PRFKEY(RPREFIX),X'F0'                            03S0855 01244000
         BNE   @RF00855                                         03S0855 01245000
         LA    @14,PRFSUNIT(,RPREFIX)                           03S0855 01246000
         AH    @14,PRFSCAN(,RPREFIX)                            03S0855 01247000
         CLC   ERRTTCIN(2,@14),TOTCTOFF(OLTCBPTR)               03S0855 01248000
         BE    @RT00855                                         03S0855 01249000
         CLC   ERRTTCIN(2,@14),TOTAPOFF(OLTCBPTR)               03S0855 01250000
         BNE   @RF00855                                         03S0855 01251000
@RT00855 DS    0H                                               03S0856 01252000
*               IF TOTCLNST=ON THEN /* IF CLEANUP STARTED            */ 01253000
         TM    TOTCLNST(OLTCBPTR),B'00000010'                   03S0856 01254000
         BNO   @RF00856                                         03S0856 01255000
*                 IF PRFKEY=PRFOPCLN THEN/* IF OP CTL ELMT           */ 01256000
         CLI   PRFKEY(RPREFIX),X'FE'                            03S0857 01257000
         BNE   @RF00857                                         03S0857 01258000
*                   IF TOTCLNED=OFF THEN/* IF CLEANUP NOT ENDED      */ 01259000
         TM    TOTCLNED(OLTCBPTR),B'00000001'                   03S0858 01260000
         BNZ   @RF00858                                         03S0858 01261000
*                     DO;                                       03S0859 01262000
*                       TESTCTR=TESTCTR+1;/* INCREMENT COUNTER       */ 01263000
         LA    @14,1                                            03S0860 01264000
         AH    @14,TESTCTR(,RPREFIX)                            03S0860 01265000
         STH   @14,TESTCTR(,RPREFIX)                            03S0860 01266000
*                       REQQCBA=ADDR(TOTOPCLN);/* QCB IS OP CTL CLN     01267000
*                                      UP Q                  @XM05671*/ 01268000
         LA    @14,TOTOPCLN(,OLTCBPTR)                          03S0861 01269000
         STCM  @14,7,REQQCBA(RPREFIX)                           03S0861 01270000
*                       RBRNCH=RESADDND;/* ADDR OF Q ADDR ROUTINE       01271000
*                                                            @XM05671*/ 01272000
         L     RBRNCH,RESADDND(,RRESPL)                         03S0862 01273000
*                       RFY                                     03S0863 01274000
*                         RELMT RSTD;/*                      @XM05671*/ 01275000
*                       RFY                                     03S0864 01276000
*                         REG03 RSTD;/*                      @XM05671*/ 01277000
*                       RFY                                     03S0865 01278000
*                         REG10 RSTD;/*                      @XM05671*/ 01279000
*                       RELMT=RPREFIX;/* COPY ADDR OF ELEMENT   03S0866 01280000
*                                                            @XM05671*/ 01281000
         LR    RELMT,RPREFIX                                    03S0866 01282000
*                       GEN SETS(REG03,REG10,RELMT);            03S0867 01283000
*                                   /*                       @XM05671*/ 01284000
         BALR  REG10,RBRNCH                                    @XM05671 01285000
*                       RFY                                     03S0868 01286000
*                         RELMT UNRSTD;/*                    @XM05671*/ 01287000
*                       RFY                                     03S0869 01288000
*                         REG03 UNRSTD;/*                    @XM05671*/ 01289000
*                       RFY                                     03S0870 01290000
*                         REG10 UNRSTD;/*                    @XM05671*/ 01291000
*                       CLNUPFLG=ON;/* SET TO GET OUT OF LOOP   03S0871 01292000
*                                                            @XM05671*/ 01293000
         OI    CLNUPFLG,B'00000100'                             03S0871 01294000
*                     END;                                      03S0872 01295000
*                   ELSE                                        03S0873 01296000
*                     ;             /* IF ENDED, DO NOTHING          */ 01297000
@RF00858 DS    0H                                               03S0874 01298000
*                 ELSE                                          03S0874 01299000
*                   ;               /* IF ERRORMSG ELMT, DO NOTHING  */ 01300000
@RF00857 DS    0H                                               03S0875 01301000
*               ELSE                /* CLEANUP NOT STARTED           */ 01302000
*                 DO;               /* INITIATE CLEANUP              */ 01303000
         B     @RC00856                                         03S0875 01304000
@RF00856 DS    0H                                               03S0876 01305000
*                   IF PRFKEY=PRFDEVFL THEN                     03S0876 01306000
         CLI   PRFKEY(RPREFIX),X'F0'                            03S0876 01307000
         BE    @RT00876                                         03S0876 01308000
*                     ;             /* IF ERRORMSG ELEMENT   @XM05671*/ 01309000
*                   ELSE            /* OP CTL ELEMENT                */ 01310000
*                     DO;           /* SET ELMT FOR IEDQWE2  @YM08564*/ 01311000
*                       TESTCTR=TESTCTR+1;/* 'NO. OF TESTS AFFECTED'    01312000
*                                      COUNTER               @YM08564*/ 01313000
         LA    @14,1                                            03S0879 01314000
         AH    @14,TESTCTR(,RPREFIX)                            03S0879 01315000
         STH   @14,TESTCTR(,RPREFIX)                            03S0879 01316000
*                       REQQCBA=ADDR(TOTOPCLN);/* QCB IS OP CTL CLN     01317000
*                                      UP Q                  @XM05671*/ 01318000
         LA    @14,TOTOPCLN(,OLTCBPTR)                          03S0880 01319000
         STCM  @14,7,REQQCBA(RPREFIX)                           03S0880 01320000
*                       RBRNCH=RESADDND;/* ADDR OF Q ADDR ROUTINE       01321000
*                                                            @XM05671*/ 01322000
         L     RBRNCH,RESADDND(,RRESPL)                         03S0881 01323000
*                       RFY                                     03S0882 01324000
*                         RELMT RSTD;/*                      @XM05671*/ 01325000
*                       RFY                                     03S0883 01326000
*                         REG03 RSTD;/*                      @XM05671*/ 01327000
*                       RFY                                     03S0884 01328000
*                         REG10 RSTD;/*                      @XM05671*/ 01329000
*                       RELMT=RPREFIX;/* COPY ADDR OF ELEMENT   03S0885 01330000
*                                                            @XM05671*/ 01331000
         LR    RELMT,RPREFIX                                    03S0885 01332000
*                       GEN SETS(REG03,REG10,RELMT);            03S0886 01333000
*                                   /*                       @XM05671*/ 01334000
         BALR  REG10,RBRNCH                                    @XM05671 01335000
*                       RFY                                     03S0887 01336000
*                         RELMT UNRSTD;/*                    @XM05671*/ 01337000
*                       RFY                                     03S0888 01338000
*                         REG03 UNRSTD;/*                    @XM05671*/ 01339000
*                       RFY                                     03S0889 01340000
*                         REG10 UNRSTD;/*                    @XM05671*/ 01341000
*                       CLNUPFLG=ON;/* SET TO GET OUT OF LOOP   03S0890 01342000
*                                                            @XM05671*/ 01343000
         OI    CLNUPFLG,B'00000100'                             03S0890 01344000
*                     END;          /*                       @YM08564*/ 01345000
*                   TOTCLNST=ON;    /* SET CLEANUP STARTED FLAG      */ 01346000
@RT00876 L     @14,TOTCLNST(,OLTCBPTR)                          03S0892 01347000
@GL00033 LR    @10,@14                                          03S0892 01348000
         O     @10,@CF03317                                     03S0892 01349000
         CS    @14,@10,TOTCLNST(OLTCBPTR)                       03S0892 01350000
         BNE   @GL00033                                         03S0892 01351000
*                   TOTOLTED=ON;    /* OLT ENDED FLAG                */ 01352000
         OI    TOTOLTED(OLTCBPTR),B'00000100'                   03S0893 01353000
*                   TOTREPEX=OFF;   /* RESET "REPLY EXPECTED"   03S0894 01354000
*                                                            @YM09016*/ 01355000
         NI    TOTREPEX(OLTCBPTR),B'11111101'                   03S0894 01356000
*                   TOTCMPCD(2:3)=ERRCODE;/* SET COMPLETION CODE     */ 01357000
         MVC   TOTCMPCD+1(2,OLTCBPTR),ERRCODE                   03S0895 01358000
*                   DTCHOLT=TOTTCBAD;/* MOVE TCB ADDR IN COMMON AREA */ 01359000
         L     @14,TOTTCBAD(,OLTCBPTR)                          03S0896 01360000
         ST    @14,DTCHOLT                                      03S0896 01361000
*                   IF TOTOTACT=ON THEN/* IF ON-LINE TESTING ACTIVE  */ 01362000
         TM    TOTOTACT(OLTCBPTR),B'00000010'                   03S0897 01363000
         BNO   @RF00897                                         03S0897 01364000
*                     GEN REFS(DTCHOLT);                        03S0898 01365000
*                                   /*DETACH OLT SUBTASK*/              01366000
         DETACH DTCHOLT,STAE=YES                                        01367000
*                   ELSE                                        03S0899 01368000
*                     GEN REFS(DTCHOLT,TOTOTECB);               03S0899 01369000
         B     @RC00897                                         03S0899 01370000
@RF00897 DS    0H                                               03S0899 01371000
*                                   /*POST REPLY ECB AND DETACH*/       01372000
         POST  TOTOTECB(OLTCBPTR)                                       01373000
         DETACH DTCHOLT                                                 01374000
*                 END;              /* END OF CLEANUP INITIATION     */ 01375000
@RC00897 DS    0H                                               03S0901 01376000
*             OLTCBPTR=TOTELLNK;    /* POINT TO NEXT OLTCB   @YM08564*/ 01377000
@RC00856 DS    0H                                               03S0901 01378000
@RF00855 L     @14,TOTELLNK-1(,OLTCBPTR)                        03S0901 01379000
         LA    @14,0(,@14)                                      03S0901 01380000
         LR    OLTCBPTR,@14                                     03S0901 01381000
*           END;                    /* END OF OLTCB LOOP             */ 01382000
@DE00854 CLI   TOTELKEY(OLTCBPTR),X'00'                         03S0902 01383000
         BE    @DC00854                                         03S0902 01384000
         TM    CLNUPFLG,B'00000100'                             03S0902 01385000
         BZ    @DL00854                                         03S0902 01386000
@DC00854 DS    0H                                               03S0903 01387000
*           IF PRFKEY=PRFDEVFL THEN /* IF ERRORMSG ELMT              */ 01388000
         CLI   PRFKEY(RPREFIX),X'F0'                            03S0903 01389000
         BNE   @RF00903                                         03S0903 01390000
*             CALL RTNBUF;          /* RETURN BUFFER                 */ 01391000
         BAL   @14,RTNBUF                                       03S0904 01392000
*           ELSE                    /* OP CTL ELMT                   */ 01393000
*             IF TESTCTR=0 THEN     /* IF ALL OLT'S ENDED            */ 01394000
         B     @RC00903                                         03S0905 01395000
@RF00903 LH    @14,TESTCTR(,RPREFIX)                            03S0905 01396000
         LTR   @14,@14                                          03S0905 01397000
         BNZ   @RF00905                                         03S0905 01398000
*               DO;                 /* POST ELEMENT BACK TO OP CTL   */ 01399000
*                 REQQCBA=REQRQCBA; /* RETURN QCB                    */ 01400000
         MVC   REQQCBA(3,RPREFIX),REQRQCBA(RPREFIX)             03S0907 01401000
*                 REQPRI=REQRPRI;   /* RETURN PRIORITY               */ 01402000
         MVC   REQPRI(1,RPREFIX),REQRPRI(RPREFIX)               03S0908 01403000
*                 REQLINK=''B;      /* CLEAR LINK FIELD FOR POSTWAIT */ 01404000
         SLR   @14,@14                                          03S0909 01405000
         STCM  @14,7,REQLINK(RPREFIX)                           03S0909 01406000
*                 REQRPRI=TICCODE;  /* TIC COMMAND CODE      @YM08564*/ 01407000
         MVI   REQRPRI(RPREFIX),X'08'                           03S0910 01408000
*                 REQRQCBA=INVALTIC;/* INVALID TIC ADDRESS   @YM08564*/ 01409000
         MVC   REQRQCBA(3,RPREFIX),INVALTIC                     03S0911 01410000
*                 RPARM=RPREFIX;    /* POINT TO ELEMENT              */ 01411000
         LR    RPARM,RPREFIX                                    03S0912 01412000
*                 RZERO=ADDR(WA1WRKSP);/* WORKAREA FOR POSTWAIT 03S0913 01413000
*                                      ROUTINE                       */ 01414000
         LA    RZERO,WA1WRKSP                                   03S0913 01415000
*                 CALL POSTWAIT;    /* POST REQ ELMT BACK TO OP CTL  */ 01416000
         L     @15,RESPLRVT(,RRESPL)                            03S0914 01417000
         BALR  @14,@15                                          03S0914 01418000
*               END;                                            03S0915 01419000
*             ELSE                                              03S0916 01420000
*               ;                   /* COUNTER NOT ZERO, DON'T POST  */ 01421000
@RF00905 DS    0H                                               03S0917 01422000
*           RFY                                                 03S0917 01423000
*             RELMT RSTD;                                       03S0917 01424000
@RC00903 DS    0H                                               03S0918 01425000
*           RFY                                                 03S0918 01426000
*             RTRM RSTD;                                        03S0918 01427000
*         END;                                                  02S0919 01428000
*                                                               02S0920 01429000
*   /*****************************************************************/ 01430000
*   /*                                                               */ 01431000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE TERMINATION OF THE MODULE*/ 01432000
*   /* AND GENERATES THE EXIT LINKAGE TO RETURN TO THE CALLING       */ 01433000
*   /* MODULE, IEDQWA, THE TOTE RESIDENT MODULE. REGISTER 15 IS SET  */ 01434000
*   /* WITH THE RETURN CODE FOR THE PROCESSING OF THE ELEMENT        */ 01435000
*   /* DEQUEUED.                                                     */ 01436000
*   /*                                                               */ 01437000
*   /*****************************************************************/ 01438000
*                                                               02S0920 01439000
*   REG15=RTNCODE;                  /* SET THE RETURN CODE           */ 01440000
@RC00777 DS    0H                                               02S0920 01441000
@RC00586 DS    0H                                               02S0920 01442000
@RT00584 SLR   REG15,REG15                                      02S0920 01443000
         IC    REG15,RTNCODE                                    02S0920 01444000
*   RSAVE=BACK13;                   /* POINT TO CALLER'S SAVE AREA      01445000
*                                                            @YM07336*/ 01446000
         L     RSAVE,BACK13                                     02S0921 01447000
*   GEN;                                                        02S0922 01448000
*                                   /*GENERATE EXIT LINKAGE*/           01449000
         L     14,12(13)                RESTORE RETURN REG              01450000
         LM    0,12,20(13)              RESTORE REGS                    01451000
         BR    14                       RETURN                          01452000
*                                                               02S0923 01453000
*   /*****************************************************************/ 01454000
*   /*                                                               */ 01455000
*   /* RTNBUF: THIS SEGMENT CONTAINS THE GERERAL USE ROUTINE TO      */ 01456000
*   /* RETURN A BUFFER TO TCAM.                                      */ 01457000
*   /*                                                               */ 01458000
*   /*****************************************************************/ 01459000
*                                                               02S0923 01460000
*RTNBUF:                                                        02S0923 01461000
*   PROC OPTIONS(RETREG,SAVE(14));                              02S0923 01462000
RTNBUF   ST    @14,@SA00002                                     02S0923 01463000
*   RFY                                                         02S0924 01464000
*     IEDQLCB BASED(RPARM);                                     02S0924 01465000
*   IF PRFKEY=PRFSS|PRFKEY=PRFBSC THEN/* IF THERE IS STILL AN LCB    */ 01466000
         CLI   PRFKEY(RPREFIX),X'08'                            02S0925 01467000
         BE    @RT00925                                         02S0925 01468000
         CLI   PRFKEY(RPREFIX),X'04'                            02S0925 01469000
         BNE   @RF00925                                         02S0925 01470000
@RT00925 DS    0H                                               02S0926 01471000
*     DO;                           /* POST LCB TO BUFFER DISPOSITION*/ 01472000
*       RPARM=PRFLCB;               /* PICK UP LCB ADDR FROM BUFFER  */ 01473000
         L     RPARM,PRFLCB-1(,RPREFIX)                         02S0927 01474000
         LA    RPARM,0(,RPARM)                                  02S0927 01475000
*       LCBLSPCI=RPREFIX;           /* BUFFER ADDR                   */ 01476000
         STCM  RPREFIX,7,LCBLSPCI(RPARM)                        02S0928 01477000
*       IF LCBRSKEY=ANRKEY THEN     /* IF ANR                        */ 01478000
         CLI   LCBRSKEY(RPARM),X'1E'                            02S0929 01479000
         BNE   @RF00929                                         02S0929 01480000
*         LCBTSTSW=ANRSW;           /* SET SWITCH                    */ 01481000
         MVI   LCBTSTSW(RPARM),X'F0'                            02S0930 01482000
*       ELSE                                                    02S0931 01483000
*         ;                                                     02S0931 01484000
@RF00929 DS    0H                                               02S0932 01485000
*       SCBDESTQ=ADDR(AVTBFRTB);    /* SET SCB WITH ADDR OF BUFF RTN */ 01486000
         L     @14,LCBSCBA-1(,RPARM)                            02S0932 01487000
         LA    @14,0(,@14)                                      02S0932 01488000
         LA    @10,AVTBFRTB(,RAVT)                              02S0932 01489000
         STCM  @10,7,SCBDESTQ(@14)                              02S0932 01490000
*       SCBMACR=ADDR(AVTINOUT);     /* DUMMY IN-OUT PARM LIST        */ 01491000
         LA    @10,AVTINOUT(,RAVT)                              02S0933 01492000
         STCM  @10,7,SCBMACR(@14)                               02S0933 01493000
*       LCBPRI=PRILCB;              /* SET LCB POST PRIORITY         */ 01494000
         MVI   LCBPRI(RPARM),X'E7'                              02S0934 01495000
*       LCBQCBA=AVTMSGS->BDADDR;    /* ADDR OF BUFFER DISP           */ 01496000
         L     @14,AVTMSGS-1(,RAVT)                             02S0935 01497000
         MVC   LCBQCBA(3,RPARM),BDADDR+1(@14)                   02S0935 01498000
*       RZERO=ADDR(WORKAREA);       /* WORKAREA USED BY POSTWAIT     */ 01499000
         LA    RZERO,WORKAREA                                   02S0936 01500000
*       LCBLINK=''B;                /* INDICATES TO POSTWAIT THAT       01501000
*                                      THIS IS A SINGLE ELEMENT POST */ 01502000
         SLR   @14,@14                                          02S0937 01503000
         STCM  @14,7,LCBLINK(RPARM)                             02S0937 01504000
*       CALL POSTWAIT;              /* POST LCB TO BUFFER DISP       */ 01505000
         L     @15,RESPLRVT(,RRESPL)                            02S0938 01506000
         BALR  @14,@15                                          02S0938 01507000
*     END;                                                      02S0939 01508000
*   ELSE                                                        02S0940 01509000
*     DO;                                                       02S0940 01510000
         B     @RC00925                                         02S0940 01511000
@RF00925 DS    0H                                               02S0941 01512000
*       RPARM=RPREFIX;              /* ADDR OF BUFFER                */ 01513000
         LR    RPARM,RPREFIX                                    02S0941 01514000
*       PRFLINK=''B;                                            02S0942 01515000
         SLR   @14,@14                                          02S0942 01516000
         STCM  @14,7,PRFLINK(RPREFIX)                           02S0942 01517000
*       RZERO=ADDR(WORKAREA);       /* WORKAREA USED BY FREEBUF      */ 01518000
         LA    RZERO,WORKAREA                                   02S0943 01519000
*       CALL FREEBUF;               /* POST BUFFER TO BUFFER RETURN  */ 01520000
         L     @15,RESFBUF(,RRESPL)                             02S0944 01521000
         BALR  @14,@15                                          02S0944 01522000
*     END;                                                      02S0945 01523000
*   BUFRTFLG=ON;                    /* SET BUFFER RETURN FLAG   02S0946 01524000
*                                      INDICATING NO FURTHER    02S0946 01525000
*                                      PROCESSING                    */ 01526000
@RC00925 OI    BUFRTFLG,B'00001000'                             02S0946 01527000
*   RFY                                                         02S0947 01528000
*     IEDQLCB BASED;                                            02S0947 01529000
*   END RTNBUF;                                                 02S0948 01530000
@EL00002 DS    0H                                               02S0948 01531000
@EF00002 DS    0H                                               02S0948 01532000
@ER00002 L     @14,@SA00002                                     02S0948 01533000
         BR    @14                                              02S0948 01534000
*                                                               02S0949 01535000
*   /*****************************************************************/ 01536000
*   /*                                                               */ 01537000
*   /* HEXCONV: THIS GENERAL PURPOSE ROUTINE CONVERTS A STRING OF    */ 01538000
*   /* HEXIDECIMAL DIGITS TO THEIR EBCDIC REPRESENTATION .           */ 01539000
*   /*                                                               */ 01540000
*   /*****************************************************************/ 01541000
*                                                               02S0949 01542000
*/* PARAMETERS:                                                      */ 01543000
*/* - CONVNUM = THE NUMBER OF HEXIDECIMAL DIGITS                     */ 01544000
*/* - CONVSRC = THE ADDRESS OF THE START OF THE HEXIDECIMAL DIGITS   */ 01545000
*/* - CONVTRG = THE ADDRESS OF LOCATION TO WHICH THE CONVERTED EBCDIC*/ 01546000
*/*             REPRESENTATIONS ARE TO BE PLACED                     */ 01547000
*/* RESTRICTIONS:                                                    */ 01548000
*/* - THE HEXIDECIMAL DIGITS MUST START ON A BYTE BOUNDRY            */ 01549000
*                                                               02S0949 01550000
*HEXCONV:                                                       02S0949 01551000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0949 01552000
HEXCONV  DS    0H                                               02S0950 01553000
*   RFY                                                         02S0950 01554000
*     RRET RSTD;                                                02S0950 01555000
*   HEXSAV14=RRET;                  /* SAVE RETURN ADDRESS           */ 01556000
         ST    RRET,HEXSAV14                                    02S0951 01557000
*   RFY                                                         02S0952 01558000
*     RRET UNRSTD;                                              02S0952 01559000
*   DO I=1 TO CONVNUM BY 2;                                     02S0953 01560000
         LA    I,1                                              02S0953 01561000
         B     @DE00953                                         02S0953 01562000
@DL00953 DS    0H                                               02S0954 01563000
*     CONVIDX=CONVSRC->BYTENUM;     /* GET FIRST TWO DIGITS          */ 01564000
         L     @14,CONVSRC                                      02S0954 01565000
         SLR   @07,@07                                          02S0954 01566000
         IC    @07,BYTENUM(,@14)                                02S0954 01567000
         STH   @07,CONVIDX                                      02S0954 01568000
*     SRL(CONVIDX,4);               /* ISOLATE FIRST DIGIT           */ 01569000
         LR    @14,@07                                          02S0955 01570000
         SRL   @14,4                                            02S0955 01571000
         STH   @14,CONVIDX                                      02S0955 01572000
*     CONVTRG->DATABYTE=HEXTCHAR(CONVIDX+1);/* MOVE CONVERTED VALUE  */ 01573000
         LH    @14,CONVIDX                                      02S0956 01574000
         N     @14,@CF03301                                     02S0956 01575000
         LA    @07,HEXTCHAR(@14)                                02S0956 01576000
         MVC   DATABYTE(1,CONVTRG),0(@07)                       02S0956 01577000
*     CONVTRG=CONVTRG+1;            /* BUMP TARGET PTR TO NEXT BYTE  */ 01578000
         AL    CONVTRG,@CF00063                                 02S0957 01579000
*     IF I<=CONVNUM-1 THEN          /* IF END NOT IN MIDDLE OF SRC      01580000
*                                      BYTE                          */ 01581000
         LH    @14,CONVNUM                                      02S0958 01582000
         BCTR  @14,0                                            02S0958 01583000
         CR    I,@14                                            02S0958 01584000
         BH    @RF00958                                         02S0958 01585000
*       DO;                         /* CONVERT NEXT DIGIT IN BYTE    */ 01586000
*         CONVIDX=CONVSRC->BYTENUM; /* GET CONTENTS OF BYTE          */ 01587000
         L     @14,CONVSRC                                      02S0960 01588000
         SLR   @07,@07                                          02S0960 01589000
         IC    @07,BYTENUM(,@14)                                02S0960 01590000
         STH   @07,CONVIDX                                      02S0960 01591000
*         CONVIDX=CONVIDX&HIMASK;   /* ISOLATE SECOND DIGIT          */ 01592000
         SLR   @14,@14                                          02S0961 01593000
         ICM   @14,3,HIMASK                                     02S0961 01594000
         NR    @07,@14                                          02S0961 01595000
         STH   @07,CONVIDX                                      02S0961 01596000
*         CONVTRG->DATABYTE=HEXTCHAR(CONVIDX+1);/* PLACE IN TARGET      01597000
*                                      LOCATION                      */ 01598000
         LA    @14,HEXTCHAR(@07)                                02S0962 01599000
         MVC   DATABYTE(1,CONVTRG),0(@14)                       02S0962 01600000
*       END;                                                    02S0963 01601000
*     ELSE                                                      02S0964 01602000
*       ;                           /* END IN MIDDLE OF SOURCE BYTE  */ 01603000
@RF00958 DS    0H                                               02S0965 01604000
*     CONVSRC=CONVSRC+1;            /* POINT TO NEXT SOURCE BYTE     */ 01605000
         LA    @14,1                                            02S0965 01606000
         L     @07,CONVSRC                                      02S0965 01607000
         ALR   @07,@14                                          02S0965 01608000
         ST    @07,CONVSRC                                      02S0965 01609000
*     CONVTRG=CONVTRG+1;            /* POINT TO NEXT TARGET BYTE     */ 01610000
         ALR   CONVTRG,@14                                      02S0966 01611000
*   END;                            /* END OF CONVERSION LOOP        */ 01612000
         AL    I,@CF00067                                       02S0967 01613000
@DE00953 CH    I,CONVNUM                                        02S0967 01614000
         BNH   @DL00953                                         02S0967 01615000
*   RFY                                                         02S0968 01616000
*     RRET RSTD;                                                02S0968 01617000
*   RRET=HEXSAV14;                  /* RESTORE RETURN REG            */ 01618000
         L     RRET,HEXSAV14                                    02S0969 01619000
*   RFY                                                         02S0970 01620000
*     RRET UNRSTD;                                              02S0970 01621000
*   END HEXCONV;                                                02S0971 01622000
@EL00003 DS    0H                                               02S0971 01623000
@EF00003 DS    0H                                               02S0971 01624000
@ER00003 BR    @14                                              02S0971 01625000
*                                                               02S0972 01626000
*   /*****************************************************************/ 01627000
*   /*                                                               */ 01628000
*   /* REQMSG: THIS SUBROUTINE CONTAINS THE CODE TO RETURN THE TOTE  */ 01629000
*   /* BUSY MESSAGE TO THE REQUESTING TERMINAL.                      */ 01630000
*   /*                                                               */ 01631000
*   /*****************************************************************/ 01632000
*                                                               02S0972 01633000
*REQMSG:                                                        02S0972 01634000
*   PROC;                                                       02S0972 01635000
REQMSG   STM   @14,@12,@SA00004                                 02S0972 01636000
*   RFY                                                         02S0973 01637000
*     IEDQQCB BASED(TRMDESTQ);                                  02S0973 01638000
*   RFY                                                         02S0974 01639000
*     IEDQLCB BASED(PRFLCB);                                    02S0974 01640000
*   RFY                                                         02S0975 01641000
*     IEDQSCB BASED(LCBSCBA);                                   02S0975 01642000
*   IF PRFKEY^=PRFSYS THEN          /* IF REQUEST NOT FROM SYS  02S0976 01643000
*                                      CONSOLE                       */ 01644000
         CLI   PRFKEY(RPREFIX),X'0C'                            02S0976 01645000
         BE    @RF00976                                         02S0976 01646000
*     DO;                                                       02S0977 01647000
*       RPARM=PRFSRCE;              /* USE SOURCE TTCIN              */ 01648000
         LH    RPARM,PRFSRCE(,RPREFIX)                          02S0978 01649000
*       CALL IEDQTNT;               /* TO CALCULATE TTE ADDRESS      */ 01650000
         L     @15,AVTRNMPT(,RAVT)                              02S0979 01651000
         BALR  @14,@15                                          02S0979 01652000
*       RTRM=RPARM;                 /* TTE BASE                      */ 01653000
         LR    RTRM,RPARM                                       02S0980 01654000
*       RDCT=AVTCSTCS+(TRMCHCIN-1)*LENGTH(IEDDCT);/* ENTRY IN DCT    */ 01655000
         SLR   RDCT,RDCT                                        02S0981 01656000
         IC    RDCT,TRMCHCIN(,RTRM)                             02S0981 01657000
         BCTR  RDCT,0                                           02S0981 01658000
         MH    RDCT,@CH00061                                    02S0981 01659000
         AL    RDCT,AVTCSTCS(,RAVT)                             02S0981 01660000
*     END;                                                      02S0982 01661000
*   ELSE                                                        02S0983 01662000
*     ;                                                         02S0983 01663000
@RF00976 DS    0H                                               02S0984 01664000
*   IF PRFKEY=PRFSYS|               /* IF REQUEST FROM SYS CONSOLE   */ 01665000
*       TRMCONC=ON|                 /* REQ FROM TERM ON CONCENTRATOR */ 01666000
*       (AVTTSON=ON&AVTAQTAN=OFF)|  /* TSO ONLY SYSTEM               */ 01667000
*       (QCBTSSES=ON)|              /* TERM IN TSO SESSION           */ 01668000
*       (QCBREUS=OFF&QCBNREUS=OFF&QCBCORE=OFF)/* NO QUEUES           */ 01669000
*     THEN                          /* CAN'T SEND TO REQUEST TERM    */ 01670000
         CLI   PRFKEY(RPREFIX),X'0C'                            02S0984 01671000
         BE    @RT00984                                         02S0984 01672000
         TM    TRMCONC(RTRM),B'10000000'                        02S0984 01673000
         BO    @RT00984                                         02S0984 01674000
         TM    AVTTSON(RAVT),B'01000000'                        02S0984 01675000
         BNO   @GL00037                                         02S0984 01676000
         TM    AVTAQTAN(RAVT),B'00100000'                       02S0984 01677000
         BZ    @RT00984                                         02S0984 01678000
@GL00037 L     @14,TRMDESTQ-1(,RTRM)                            02S0984 01679000
         LA    @14,0(,@14)                                      02S0984 01680000
         TM    QCBTSSES(@14),B'10000000'                        02S0984 01681000
         BO    @RT00984                                         02S0984 01682000
         TM    QCBREUS(@14),B'01110000'                         02S0984 01683000
         BNZ   @RF00984                                         02S0984 01684000
@RT00984 DS    0H                                               02S0985 01685000
*     DO;                           /* SEND MSG TO SYS CONSOLE       */ 01686000
*       RPARM=ADDR(IED149I);        /* ADDR OF WTO PARM LIST         */ 01687000
         LA    RPARM,IED149I                                    02S0986 01688000
*       SVC(35);                    /* WTO                           */ 01689000
         SVC   35                                               02S0987 01690000
*     END;                                                      02S0988 01691000
*   ELSE                                                        02S0989 01692000
*     DO;                           /* SEND MESSAGE TO REQUEST TERM  */ 01693000
         B     @RC00984                                         02S0989 01694000
@RF00984 DS    0H                                               02S0990 01695000
*                                                               03S0990 01696000
*       /*************************************************************/ 01697000
*       /*                                                           */ 01698000
*       /* REQMSG.REQMSGMV:THIS SEGMENT MOVES THE TOTE BUSY MESSAGE  */ 01699000
*       /* INTO THE BUFFER AND INSERTS ALL NECESSARY LINE CONTROL.   */ 01700000
*       /*                                                           */ 01701000
*       /*************************************************************/ 01702000
*                                                               03S0990 01703000
*       IF TRMPREF=ON THEN          /* IF THIS IS AN NCP DEVICE      */ 01704000
         TM    TRMPREF(RTRM),B'00010000'                        03S0990 01705000
         BNO   @RF00990                                         03S0990 01706000
*         IF TRMSNA=ON&DCTL3270=ON THEN/* IF THIS IS A SNA 3270      */ 01707000
         LR    @14,RTRM                                         03S0991 01708000
         AL    @14,@CF03320                                     03S0991 01709000
         TM    TRMSNA-6(@14),B'00000010'                        03S0991 01710000
         BNO   @RF00991                                         03S0991 01711000
         TM    DCTL3270(RDCT),B'01000000'                       03S0991 01712000
         BNO   @RF00991                                         03S0991 01713000
*           DO;                                                 03S0992 01714000
*             MSGPTR=ADDR(WORKAREA);/* INIT POINTER FOR MSG MOVE     */ 01715000
         LA    MSGPTR,WORKAREA                                  03S0993 01716000
*             MSGAREA(1:LENGTH(S3270))=S3270;/* INSERT WRITE ERASE   */ 01717000
         MVC   MSGAREA(2,MSGPTR),S3270                          03S0994 01718000
*             MSGPTR=MSGPTR+LENGTH(S3270);/* UPDATE POINTER          */ 01719000
         AL    MSGPTR,@CF00067                                  03S0995 01720000
*             MSGAREA(1:LENGTH(MSG149I))=MSG149I;/* MOVE IN TOTE BUSY   01721000
*                                      MESSAGE                       */ 01722000
         MVC   MSGAREA(17,MSGPTR),MSG149I                       03S0996 01723000
*             RMSGLEN=S3270L;       /* LENGTH OF MESSAGE             */ 01724000
         LH    RMSGLEN,S3270L                                   03S0997 01725000
*           END;                    /* END OF SNA 3270 PROCESSING    */ 01726000
*         ELSE                                                  03S0999 01727000
*           DO;                     /* NCP, NON 3270 SNA             */ 01728000
         B     @RC00991                                         03S0999 01729000
@RF00991 DS    0H                                               03S1000 01730000
*             MSGPTR=ADDR(WORKAREA);/* INIT POINTER FOR MOVE         */ 01731000
         LA    MSGPTR,WORKAREA                                  03S1000 01732000
*             MSGAREA(1:LENGTH(MSG149I))=MSG149I;/* MOVE IN TOTE BUSY   01733000
*                                      MSG                           */ 01734000
         MVC   MSGAREA(17,MSGPTR),MSG149I                       03S1001 01735000
*             MSGPTR=MSGPTR+LENGTH(MSG149I);/* UPDATE POINTER        */ 01736000
         AL    MSGPTR,@CF03210                                  03S1002 01737000
*             IF DCT3270=ON THEN    /* IF 3270 DEVICE                */ 01738000
         TM    DCT3270(RDCT),B'00000100'                        03S1003 01739000
         BNO   @RF01003                                         03S1003 01740000
*               MSGAREA(1:1)='';    /* ADD BLANK                     */ 01741000
         MVI   MSGAREA(MSGPTR),C' '                             03S1004 01742000
*             ELSE                                              03S1005 01743000
*               MSGAREA(1:LENGTH(NLCHAR))=NLCHAR;/* NEW LINE    03S1005 01744000
*                                      CHARACTER                     */ 01745000
         B     @RC01003                                         03S1005 01746000
@RF01003 MVC   MSGAREA(1,MSGPTR),NLCHAR                         03S1005 01747000
*             RMSGLEN=NCPL;         /* MSG LENGTH                    */ 01748000
@RC01003 LH    RMSGLEN,NCPL                                     03S1006 01749000
*           END;                    /* END OF NCP PROCESSING         */ 01750000
*       ELSE                        /* EP DEVICE                     */ 01751000
*         IF LCBSYNC=ON|DCTNOIDL=ON THEN/* BSC OR 2260               */ 01752000
         B     @RC00990                                         03S1008 01753000
@RF00990 L     @14,PRFLCB-1(,RPREFIX)                           03S1008 01754000
         TM    LCBSYNC(@14),B'00000100'                         03S1008 01755000
         BO    @RT01008                                         03S1008 01756000
         TM    DCTNOIDL(RDCT),B'00000010'                       03S1008 01757000
         BNO   @RF01008                                         03S1008 01758000
@RT01008 DS    0H                                               03S1009 01759000
*           DO;                                                 03S1009 01760000
*             MSGPTR=ADDR(WORKAREA);/* INIT POINTER                  */ 01761000
         LA    MSGPTR,WORKAREA                                  03S1010 01762000
*             MSGAREA(1:LENGTH(STXCH))=STXCHAR;/* INSERT STX         */ 01763000
         MVC   MSGAREA(1,MSGPTR),STXCHAR                        03S1011 01764000
*             MSGPTR=MSGPTR+LENGTH(STXCH);/* UPDATE POINTER          */ 01765000
         AL    MSGPTR,@CF00063                                  03S1012 01766000
*             MSGAREA(1:LENGTH(MSG149I))=MSG149I;/* MOVE IN MESSAGE  */ 01767000
         MVC   MSGAREA(17,MSGPTR),MSG149I                       03S1013 01768000
*             MSGPTR=MSGPTR+LENGTH(IED149I);/* UPDATE POINTER        */ 01769000
         AL    MSGPTR,@CF03293                                  03S1014 01770000
*             MSGAREA(1:LENGTH(ENDSYNC))=ENDSYNC;/* ADD BSC CHARS AT    01771000
*                                      END                           */ 01772000
         MVC   MSGAREA(3,MSGPTR),ENDSYNC                        03S1015 01773000
*             RMSGLEN=EPBSCL;       /* LENGTH OF MESSAGE             */ 01774000
         LH    RMSGLEN,EPBSCL                                   03S1016 01775000
*           END;                                                03S1017 01776000
*         ELSE                                                  03S1018 01777000
*           DO;                     /* START STOP TERMINAL           */ 01778000
         B     @RC01008                                         03S1018 01779000
@RF01008 DS    0H                                               03S1019 01780000
*             MSGPTR=ADDR(WORKAREA);/* MESSAGE IN WORKAREA           */ 01781000
         LA    MSGPTR,WORKAREA                                  03S1019 01782000
*             MSGAREA(1:LENGTH(MSG149I))=MSG149I;/* MOVE IN MSG      */ 01783000
         MVC   MSGAREA(17,MSGPTR),MSG149I                       03S1020 01784000
*             MSGPTR=MSGPTR+LENGTH(MSG149I);/* UPDATE POINTER        */ 01785000
         AL    MSGPTR,@CF03210                                  03S1021 01786000
*             MSGAREA(1:LENGTH(ENDSS))=ENDSS;/* MOVE IN SS CHARS AT     01787000
*                                      END                           */ 01788000
         MVC   MSGAREA(2,MSGPTR),ENDSS                          03S1022 01789000
*             RMSGLEN=EPSSL;        /* LENGTH OF EP START STOP MSG   */ 01790000
         LH    RMSGLEN,EPSSL                                    03S1023 01791000
*           END;                                                03S1024 01792000
*       IEDPLMV=''B;                /* CLEAR IEDMVBFR PARM LIST      */ 01793000
@RC01008 DS    0H                                               03S1025 01794000
@RC00990 LA    @14,PARMLSP                                      03S1025 01795000
         XC    IEDPLMV(24,@14),IEDPLMV(@14)                     03S1025 01796000
*       IF RMSGLEN>(PRFNBUNT*AVTKEYLE-AVTHDRSZ) THEN/* IF MSG TOO BIG   01797000
*                                      FOR BUF                       */ 01798000
         SLR   @10,@10                                          03S1026 01799000
         IC    @10,PRFNBUNT(,RPREFIX)                           03S1026 01800000
         MH    @10,AVTKEYLE(,RAVT)                              03S1026 01801000
         SL    @10,@CF00452                                     03S1026 01802000
         CR    RMSGLEN,@10                                      03S1026 01803000
         BNH   @RF01026                                         03S1026 01804000
*         PLMVLNTH=PRFNBUNT*AVTKEYLE-AVTHDRSZ;/* TRUNCATE MSG        */ 01805000
         STH   @10,PLMVLNTH(,@14)                               03S1027 01806000
*       ELSE                                                    03S1028 01807000
*         PLMVLNTH=RMSGLEN;         /* PLACE LEN OF MSG IN PARM LIST */ 01808000
         B     @RC01026                                         03S1028 01809000
@RF01026 LA    @14,PARMLSP                                      03S1028 01810000
         STH   RMSGLEN,PLMVLNTH(,@14)                           03S1028 01811000
*       PRFSIZE=PLMVLNTH+AVTHDRSZ;  /* SET SIZE IN PREFIX            */ 01812000
@RC01026 LA    @14,PARMLSP                                      03S1029 01813000
         LA    @10,30                                           03S1029 01814000
         LH    @07,PLMVLNTH(,@14)                               03S1029 01815000
         N     @07,@CF03301                                     03S1029 01816000
         ALR   @10,@07                                          03S1029 01817000
         STH   @10,PRFSIZE(,RPREFIX)                            03S1029 01818000
*       PLMVTU=RPREFIX;             /* TARGET UNIT                   */ 01819000
         ST    RPREFIX,PLMVTU(,@14)                             03S1030 01820000
*       PLMVTD=ADDR(PRFSHDR);       /* TARGET DATA                   */ 01821000
         LA    @10,PRFSHDR(,RPREFIX)                            03S1031 01822000
         ST    @10,PLMVTD(,@14)                                 03S1031 01823000
*       PLMVSU=ADDR(WORKAREA);      /* SOURCE UNIT                   */ 01824000
         LA    @10,WORKAREA                                     03S1032 01825000
         ST    @10,PLMVSU(,@14)                                 03S1032 01826000
*       PLMVSD=PLMVSU;              /* SOURCE DATA                   */ 01827000
         ST    @10,PLMVSD(,@14)                                 03S1033 01828000
*       PLMVSCTG=ON;                /* SOURCE CONTIGUOUS FLAG        */ 01829000
         OI    PLMVSCTG(@14),B'01000000'                        03S1034 01830000
*       RPARM=ADDR(PARMLSP);        /* POINT TO PARM LIST            */ 01831000
         LR    RPARM,@14                                        03S1035 01832000
*       CALL IEDMVBFR;              /* MOVE MESSAGE TO BUFFER        */ 01833000
         L     @15,AVTMVBFR(,RAVT)                              03S1036 01834000
         BALR  @14,@15                                          03S1036 01835000
*                                                               03S1037 01836000
*       /*************************************************************/ 01837000
*       /*                                                           */ 01838000
*       /* REQMSG.REQDEST: THIS SEGMENT SENDS THE MESSAGE TO THE     */ 01839000
*       /* REQUESTING TERMINAL.                                      */ 01840000
*       /*                                                           */ 01841000
*       /*************************************************************/ 01842000
*                                                               03S1037 01843000
*       RFY                                                     03S1037 01844000
*         IEDTTCD BASED(ADDR(WA1WRKSP));/* BASE TTC DSECT            */ 01845000
*       PRFDEST=PRFSRCE;            /* SET DESTINATION IN BUFFER     */ 01846000
         LH    @14,PRFSRCE(,RPREFIX)                            03S1038 01847000
         STH   @14,PRFDEST(,RPREFIX)                            03S1038 01848000
*       PRFLINK=''B;                /* CLEAR LINK FIELD              */ 01849000
         SLR   @14,@14                                          03S1039 01850000
         STCM  @14,7,PRFLINK(RPREFIX)                           03S1039 01851000
*       PRFSTAT1=''B;               /* CLEAR STATUS FLAGS            */ 01852000
         MVI   PRFSTAT1(RPREFIX),X'00'                          03S1040 01853000
*       PRFSCAN=''B;                /* CLEAR SCAN POINTER            */ 01854000
         STH   @14,PRFSCAN(,RPREFIX)                            03S1041 01855000
*       PRFSRCE=''B;                /* CLEAR SOURCE                  */ 01856000
         STH   @14,PRFSRCE(,RPREFIX)                            03S1042 01857000
*       IF PRFKEY=PRFSS|PRFKEY=PRFBSC|PRFKEY=PRFMULT THEN/* IF  03S1043 01858000
*                                      LCB/SCB PRESENT               */ 01859000
         CLI   PRFKEY(RPREFIX),X'08'                            03S1043 01860000
         BE    @RT01043                                         03S1043 01861000
         CLI   PRFKEY(RPREFIX),X'04'                            03S1043 01862000
         BE    @RT01043                                         03S1043 01863000
         CLI   PRFKEY(RPREFIX),X'14'                            03S1043 01864000
         BNE   @RF01043                                         03S1043 01865000
@RT01043 DS    0H                                               03S1044 01866000
*         DO;                                                   03S1044 01867000
*           SCBDESTQ=TRMDESTQ;      /* DESTINATION QUEUE             */ 01868000
         L     @14,PRFLCB-1(,RPREFIX)                           03S1045 01869000
         LA    @14,0(,@14)                                      03S1045 01870000
         L     @10,LCBSCBA-1(,@14)                              03S1045 01871000
         MVC   SCBDESTQ(3,@10),TRMDESTQ(RTRM)                   03S1045 01872000
*           IF PRFKEY^=PRFMULT THEN /* IF NOT MULTIPLE BUFFER INPUT  */ 01873000
         CLI   PRFKEY(RPREFIX),X'14'                            03S1046 01874000
         BE    @RF01046                                         03S1046 01875000
*             DO;                   /* POST BUFFER TO BUFFER DISP    */ 01876000
*               PRFPRI=PRIDSPLB;    /* SET PRIORITY                  */ 01877000
         MVI   PRFPRI(RPREFIX),X'DF'                            03S1048 01878000
*               PRFQCBA=AVTMSGS->BDADDR;/* QCB ADDR BUFFER DISP      */ 01879000
         L     @10,AVTMSGS-1(,RAVT)                             03S1049 01880000
         MVC   PRFQCBA(3,RPREFIX),BDADDR+1(@10)                 03S1049 01881000
*               IF LCBRSKEY=ANRKEY THEN/* IF LOCAL 3270              */ 01882000
         CLI   LCBRSKEY(@14),X'1E'                              03S1050 01883000
         BNE   @RF01050                                         03S1050 01884000
*                 LCBTSTSW=ANRSW;   /* SET KEY                       */ 01885000
         MVI   LCBTSTSW(@14),X'F0'                              03S1051 01886000
*               ELSE                                            03S1052 01887000
*                 ;                                             03S1052 01888000
@RF01050 DS    0H                                               03S1053 01889000
*               SCBMACR=ADDR(AVTINOUT);/* DUMMY IN/OUT END           */ 01890000
         L     @14,PRFLCB-1(,RPREFIX)                           03S1053 01891000
         L     @14,LCBSCBA-1(,@14)                              03S1053 01892000
         LA    @10,AVTINOUT(,RAVT)                              03S1053 01893000
         STCM  @10,7,SCBMACR(@14)                               03S1053 01894000
*             END;                  /* END NOT MULT BUF              */ 01895000
*           ELSE                    /* MULTIPLE BUFFERED INPUT       */ 01896000
*             DO;                   /* POST BUFFER TO DEST QUEUE     */ 01897000
         B     @RC01046                                         03S1055 01898000
@RF01046 DS    0H                                               03S1056 01899000
*               PRFQCBA=TRMDESTQ;   /* QCB ADDR                      */ 01900000
         MVC   PRFQCBA(3,RPREFIX),TRMDESTQ(RTRM)                03S1056 01901000
*               PRFPRI=PRIDESTQ;    /* PRIORITY FOR DEST Q POST      */ 01902000
         MVI   PRFPRI(RPREFIX),X'E4'                            03S1057 01903000
*             END;                                              03S1058 01904000
*           RZERO=ADDR(WA1WRKSP);   /* WORKAREA USED BY POSTWAIT RTN */ 01905000
@RC01046 LA    RZERO,WA1WRKSP                                   03S1059 01906000
*           RPARM=RPREFIX;          /* ADDR OF BUFFER TO BE POSTED   */ 01907000
         LR    RPARM,RPREFIX                                    03S1060 01908000
*         END;                                                  03S1061 01909000
*       ELSE                        /* NO LCB/SCB AVAILABLE          */ 01910000
*         IF PRFKEY=PRFOPCTL THEN   /* IF OP CTL TERM REQUEST        */ 01911000
         B     @RC01043                                         03S1062 01912000
@RF01043 CLI   PRFKEY(RPREFIX),X'10'                            03S1062 01913000
         BNE   @RF01062                                         03S1062 01914000
*           DO;                     /* CREATE DUMMY LCB SCB          */ 01915000
*             PRFLCB=ADDR(WA1WRKSP)-(ADDR(LCBRCQCB)-ADDR(IEDQLCB));/*   01916000
*                                      ADDR OF DUMMY LCB             */ 01917000
         LA    @14,WA1WRKSP                                     03S1064 01918000
         LR    @10,@14                                          03S1064 01919000
         SL    @10,@CF00799                                     03S1064 01920000
         STCM  @10,7,PRFLCB(RPREFIX)                            03S1064 01921000
*             LCBSCBA=ADDR(TTCSCB); /* ADDR OF DUMMY SCB             */ 01922000
         LA    @07,40                                           03S1065 01923000
         ALR   @07,@14                                          03S1065 01924000
         LA    @03,TTCSCB(,@07)                                 03S1065 01925000
         STCM  @03,7,LCBSCBA(@10)                               03S1065 01926000
*             SCBSTATE=''B;         /* CLEAR SCB STATE FIELD         */ 01927000
         MVI   SCBSTATE(@03),X'00'                              03S1066 01928000
*             SCBDESTQ=TRMDESTQ;    /* DESTINATION Q                 */ 01929000
         MVC   SCBDESTQ(3,@03),TRMDESTQ(RTRM)                   03S1067 01930000
*             PRFPRI=PRIDESTQ;      /* PRIORITY FOR DEST Q POST      */ 01931000
         MVI   PRFPRI(RPREFIX),X'E4'                            03S1068 01932000
*             PRFQCBA=TRMDESTQ;     /* DEST Q                        */ 01933000
         MVC   PRFQCBA(3,RPREFIX),TRMDESTQ(RTRM)                03S1069 01934000
*             PRFLINK=ADDR(SYNCELMT);/* POINT TO SYNCHRONIZATION        01935000
*                                      ELEMENT TO SERIALIZE USE OF      01936000
*                                      DUMMY LCB                     */ 01937000
         LA    @10,SYNCELMT                                     03S1070 01938000
         STCM  @10,7,PRFLINK(RPREFIX)                           03S1070 01939000
*             SYNCQCB=ADDR(TTCQCB); /* QCB BUILT IN WORKAREA BY 03S1071 01940000
*                                      POSTWAIT                      */ 01941000
         ST    @07,SYNCQCB                                      03S1071 01942000
*             SYNCLINK=''B;         /* CLEAR LINK FIELD FOR POSTWAIT */ 01943000
         SLR   @10,@10                                          03S1072 01944000
         STCM  @10,7,SYNCLINK                                   03S1072 01945000
*             SYNCPRI=PRILNSCL;     /* PRIORITY LESS THAN PRIDESTQ      01946000
*                                                            @OX21052*/ 01947000
         MVI   SYNCPRI,X'E3'                                    03S1073 01948000
*             RZERO=ADDR(WA1WRKSP); /* WORKAREA FOR POSTWAIT         */ 01949000
         LR    RZERO,@14                                        03S1074 01950000
*             RPARM=RPREFIX;        /* POST BUFFER                   */ 01951000
         LR    RPARM,RPREFIX                                    03S1075 01952000
*             RPARM=RPARM|WAITKEY;  /* SET WAIT KEY IN HI ORDER BYTE */ 01953000
         O     RPARM,WAITKEY                                    03S1076 01954000
*           END;                    /* END OF OP CTL REQ TERM POST   */ 01955000
*         ELSE                      /* SNA TERMINAL                  */ 01956000
*           DO;                                                 03S1078 01957000
         B     @RC01062                                         03S1078 01958000
@RF01062 DS    0H                                               03S1079 01959000
*             PRFSRCE=SAVTSCPT;     /* SET TTCIN OF SSCP TERMINAL       01960000
*                                      ENTRY                         */ 01961000
         L     @14,AVTSAVTP(,RAVT)                              03S1079 01962000
         LH    @10,SAVTSCPT(,@14)                               03S1079 01963000
         N     @10,@CF03301                                     03S1079 01964000
         STH   @10,PRFSRCE(,RPREFIX)                            03S1079 01965000
*             PRFQCBA=ADDR(SAVTSCPQ);/* SSCP QCB                     */ 01966000
         LA    @14,SAVTSCPQ(,@14)                               03S1080 01967000
         STCM  @14,7,PRFQCBA(RPREFIX)                           03S1080 01968000
*             PRFPRI=PRIDESTQ;      /* DEST Q PRIORITY POST          */ 01969000
         MVI   PRFPRI(RPREFIX),X'E4'                            03S1081 01970000
*             IEDPF1=''B;           /* CLEAR NEG PREFIX              */ 01971000
         LR    @14,RPREFIX                                      03S1082 01972000
         SL    @14,@CF00047                                     03S1082 01973000
         XC    IEDPF1(8,@14),IEDPF1(@14)                        03S1082 01974000
*             PRF1RH=SSCPRH;        /* SET RH                        */ 01975000
         MVC   PRF1RH(3,@14),@CB03072                           03S1083 01976000
*             PRF1FIDI=ON;          /* FID 1 INDICATOR               */ 01977000
         OI    PRF1FIDI(@14),B'10000000'                        03S1084 01978000
*             PRF1FORM=PRF1PTRI;    /* SEQ NUMBER POINTER FLAG       */ 01979000
         NI    PRF1FORM(@14),B'11011111'                        03S1085 01980000
         OI    PRF1FORM(@14),B'00010000'                        03S1085 01981000
*             PRF1SEQP=ADDR(DATAPTR);/* DUMMY AREA FOR SEQ NUMBER    */ 01982000
         LA    @10,DATAPTR                                      03S1086 01983000
         ST    @10,PRF1SEQP(,@14)                               03S1086 01984000
*             RZERO=ADDR(WA1WRKSP); /* WORKAREA FOR POSTWAIT         */ 01985000
         LA    RZERO,WA1WRKSP                                   03S1087 01986000
*             RPARM=RPREFIX;        /* ADDR OF BUFFER                */ 01987000
         LR    RPARM,RPREFIX                                    03S1088 01988000
*           END;                    /* END SNA TERM PROCESSING       */ 01989000
*       CALL POSTWAIT;              /* POST BUFFER                   */ 01990000
@RC01062 DS    0H                                               03S1090 01991000
@RC01043 L     @15,RESPLRVT(,RRESPL)                            03S1090 01992000
         BALR  @14,@15                                          03S1090 01993000
*     END;                                                      02S1091 01994000
*   END REQMSG;                                                 02S1092 01995000
@EL00004 DS    0H                                               02S1092 01996000
@EF00004 DS    0H                                               02S1092 01997000
@ER00004 LM    @14,@12,@SA00004                                 02S1092 01998000
         BR    @14                                              02S1092 01999000
*                                                               02S1093 02000000
*   /*****************************************************************/ 02001000
*   /*                                                               */ 02002000
*   /* PROCESS.MHPROC.DEVFLMSG: THIS SEGMENT DOES THE PROCESSING     */ 02003000
*   /* NEEDED TO SEND MESSAGE IED244I, 'ERROR XXXXXXXXXX DETECTED    */ 02004000
*   /* ATTEMPTING/DURING I/O TO TERMINAL TERM NAME'                  */ 02005000
*   /*                                                               */ 02006000
*   /*****************************************************************/ 02007000
*                                                               02S1093 02008000
*DEVFLMSG:                                                      02S1093 02009000
*   PROC;                                                       02S1093 02010000
DEVFLMSG STM   @14,@12,@SA00005                                 02S1093 02011000
*   RFY                                                         02S1094 02012000
*     RZERO UNRSTD;                                             02S1094 02013000
*   RFY                                                         02S1095 02014000
*     RPARM UNRSTD;                                             02S1095 02015000
*   RFY                                                         02S1096 02016000
*     RELMT UNRSTD;                                             02S1096 02017000
*   RFY                                                         02S1097 02018000
*     RTRM UNRSTD;                                              02S1097 02019000
*   RFY                                                         02S1098 02020000
*     OLTCBPTR UNRSTD;                                          02S1098 02021000
*   RTNT=AVTRNMPT;                  /* TNT ADDRESS                   */ 02022000
         L     RTNT,AVTRNMPT(,RAVT)                             02S1099 02023000
*   ENTLEN=TNTENLEN+LENGTH(TNTTRMAD);/* LENGTH OF ENTRY              */ 02024000
         SLR   @14,@14                                          02S1100 02025000
         IC    @14,TNTENLEN(,RTNT)                              02S1100 02026000
         LA    @08,3                                            02S1100 02027000
         ALR   @08,@14                                          02S1100 02028000
         STH   @08,ENTLEN                                       02S1100 02029000
*   RFY                                                         02S1101 02030000
*     REG09 RSTD;                                               02S1101 02031000
*   REG09=ERRTTCIN-1;               /* ADJUST TTCIN                  */ 02032000
         LA    @07,PRFSUNIT(,RPREFIX)                           02S1102 02033000
         AH    @07,PRFSCAN(,RPREFIX)                            02S1102 02034000
         SLR   REG09,REG09                                      02S1102 02035000
         ICM   REG09,3,ERRTTCIN(@07)                            02S1102 02036000
         BCTR  REG09,0                                          02S1102 02037000
*   ENTLEN=REG09*ENTLEN;            /* DISPLACEMENT TO ENTRY         */ 02038000
         LR    @01,@08                                          02S1103 02039000
         MR    @00,REG09                                        02S1103 02040000
         STH   @01,ENTLEN                                       02S1103 02041000
*   RFY                                                         02S1104 02042000
*     REG09 UNRSTD;                                             02S1104 02043000
*   PTNTENT=ADDR(TNTFIRST)+ENTLEN;  /* ADDRESS OF TNT ENTRY          */ 02044000
         LA    PTNTENT,82                                       02S1105 02045000
         ALR   PTNTENT,RTNT                                     02S1105 02046000
         ALR   PTNTENT,@01                                      02S1105 02047000
*   NAM244I=''B;                    /* CLEAR TERM NAME FIELD IN PARM    02048000
*                                      LIST                          */ 02049000
         XC    NAM244I(8),NAM244I                               02S1106 02050000
*   NAM244I(1:TNTENLEN)=ENTNAME(1:TNTENLEN);/* MOVE IN TERM NAME     */ 02051000
         BCTR  @14,0                                            02S1107 02052000
         EX    @14,@SM03322                                     02S1107 02053000
*   CONVNUM=LENGTH(RCD244I);        /* LENGTH OF HEX DIGITS IN ERROR    02054000
*                                      RECORD                        */ 02055000
         MVC   CONVNUM(2),@CH01753                              02S1108 02056000
*   CONVSRC=ADDR(ERRRCRD);          /* ERROR RECORD IN ERRORMSG ELMT */ 02057000
         LA    @14,ERRRCRD(,@07)                                02S1109 02058000
         ST    @14,CONVSRC                                      02S1109 02059000
*   CONVTRG=ADDR(RCD244I);          /* ERROR RECORD IN PARM LIST     */ 02060000
         LA    CONVTRG,RCD244I                                  02S1110 02061000
*   CALL HEXCONV;                   /* CONVERT HEX TO EBCDIC HEX AND    02062000
*                                      MOVE                          */ 02063000
         BAL   @14,HEXCONV                                      02S1111 02064000
*   RFY                                                         02S1112 02065000
*     RPARM RSTD;                                               02S1112 02066000
*   RPARM=ADDR(IED244I);            /* POINT TO PARM LIST FOR WTO    */ 02067000
         LA    RPARM,IED244I                                    02S1113 02068000
*   SVC(35);                        /* ISSUE WTO                     */ 02069000
         SVC   35                                               02S1114 02070000
*   RFY                                                         02S1115 02071000
*     RZERO RSTD;                                               02S1115 02072000
*   RFY                                                         02S1116 02073000
*     RELMT RSTD;                                               02S1116 02074000
*   RFY                                                         02S1117 02075000
*     RTRM RSTD;                                                02S1117 02076000
*   RFY                                                         02S1118 02077000
*     OLTCBPTR RSTD;                                            02S1118 02078000
*   END DEVFLMSG;                                               02S1119 02079000
@EL00005 DS    0H                                               02S1119 02080000
@EF00005 DS    0H                                               02S1119 02081000
@ER00005 LM    @14,@12,@SA00005                                 02S1119 02082000
         BR    @14                                              02S1119 02083000
@PB00005 DS    0H                                               02S1119 02084000
*   END IEDQWA1                                                 01S1120 02085000
*                                                               01S1120 02086000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02087000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 02088000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 02089000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 02090000
*/*%INCLUDE SYSLIB  (TDCTD   )                                       */ 02091000
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */ 02092000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 02093000
*/*%INCLUDE SYSLIB  (OLTCB   )                                       */ 02094000
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */ 02095000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 02096000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 02097000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02098000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 02099000
*/*%INCLUDE SYSLIB  (TREQD   )                                       */ 02100000
*/*%INCLUDE SYSLIB  (RESPL   )                                       */ 02101000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 02102000
*/*%INCLUDE SYSLIB  (TSCBD   )                                       */ 02103000
*/*%INCLUDE SYSLIB  (TSNSD   )                                       */ 02104000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 02105000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 02106000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 02107000
*/*%INCLUDE SYSLIB  (TTTCD   )                                       */ 02108000
*/*%INCLUDE SYSLIB  (TXRTDD  )                                       */ 02109000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 02110000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 02111000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 02112000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 02113000
*/*%INCLUDE SYSUT5  (MHPROC  )                                       */ 02114000
*/*%INCLUDE SYSUT5  (STARTMH )                                       */ 02115000
*/*%INCLUDE SYSUT5  (CEINPUT )                                       */ 02116000
*/*%INCLUDE SYSUT5  (XLATE   )                                       */ 02117000
*/*%INCLUDE SYSUT5  (MOVEMSG )                                       */ 02118000
*/*%INCLUDE SYSUT5  (HDRPASS )                                       */ 02119000
*/*%INCLUDE SYSUT5  (CANCLREQ)                                       */ 02120000
*/*%INCLUDE SYSUT5  (CEREPLY )                                       */ 02121000
*/*%INCLUDE SYSUT5  (TESTDATA)                                       */ 02122000
*/*%INCLUDE SYSUT5  (CLEANUP )                                       */ 02123000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 02124000
*/*%INCLUDE SYSUT5  (RTNBUF  )                                       */ 02125000
*/*%INCLUDE SYSUT5  (HEXCONV )                                       */ 02126000
*/*%INCLUDE SYSUT5  (REQMSG  )                                       */ 02127000
*/*%INCLUDE SYSUT5  (REQMSGMV)                                       */ 02128000
*/*%INCLUDE SYSUT5  (REQDEST )                                       */ 02129000
*/*%INCLUDE SYSUT5  (DEVFLMSG)                                       */ 02130000
*                                                               01S1120 02131000
*       ;                                                       01S1120 02132000
@DATA    DS    0H                                                       02133000
@CH00061 DC    H'6'                                                     02134000
@CH01479 DC    H'9'                                                     02135000
@CH01753 DC    H'10'                                                    02136000
@SB03308 TR    DATASTNG(0,@07),XTABLE(TABLPTR)                          02137000
@SC03310 CLC   TOTCTNAM(0,OLTCBPTR),CANLDATA(@10)                       02138000
@SM03322 MVC   NAM244I(0),ENTNAME(PTNTENT)                              02139000
         DS    0F                                                       02140000
@SA00001 DS    18F                                                      02141000
@SA00002 DS    1F                                                       02142000
@SA00005 DS    15F                                                      02143000
@SA00004 DS    15F                                                      02144000
         DS    0F                                                       02145000
@CF00063 DC    F'1'                                                     02146000
@CF00067 DC    F'2'                                                     02147000
@CF00076 DC    F'3'                                                     02148000
@CF00256 DC    F'4'                                                     02149000
@CF00033 DC    F'5'                                                     02150000
@CH00033 EQU   @CF00033+2                                               02151000
@CF00047 DC    F'8'                                                     02152000
@CF03106 DC    F'11'                                                    02153000
@CF03210 DC    F'17'                                                    02154000
@CF03293 DC    F'25'                                                    02155000
@CF00799 DC    F'56'                                                    02156000
@CF03304 DC    F'-14'                                                   02157000
@CF03300 DC    F'-13'                                                   02158000
@CF03320 DC    F'-8'                                                    02159000
@CF03314 DC    F'-4'                                                    02160000
@CF03301 DC    XL4'0000FFFF'                                            02161000
@CF00452 DC    XL4'1E'                                                  02162000
@CF03317 DC    BL4'00000010000000000000000000000000'                    02163000
         DS    0D                                                       02164000
DATAPTR  DS    A                                                        02165000
BACK13   DS    A                                                        02166000
DTCHOLT  DS    A                                                        02167000
CONVSRC  DS    A                                                        02168000
HEXSAV14 DS    A                                                        02169000
LOOPCTR  DS    H                                                        02170000
TRANSLEN DS    H                                                        02171000
CONVNUM  DS    H                                                        02172000
CONVIDX  DS    H                                                        02173000
EPSSL    DC    AL2(17+2)                                                02174000
EPBSCL   DC    AL2(1+17+3)                                              02175000
NCPL     DC    AL2(17+1)                                                02176000
S3270L   DC    AL2(2+17)                                                02177000
RTNCODE  DS    FL1                                                      02178000
@CC03076 DC    C'99999'                                                 02179000
@CC03082 DC    C'OLT='                                                  02180000
@CB03072 DC    X'038000'                                                02181000
         DS    CL3                                                      02182000
PARMLSP  DS    CL24                                                     02183000
WA1WRKSP DS    CL80                                                     02184000
PATCH    DC    XL100'0'                                                 02185000
FLAGS    DS    BL1                                                      02186000
         ORG   FLAGS                                                    02187000
TTYPEFLG DS    BL1                                                      02188000
REPLYFLG EQU   FLAGS+0                                                  02189000
CANCLFLG EQU   FLAGS+0                                                  02190000
XLATEFLG EQU   FLAGS+0                                                  02191000
BUFRTFLG EQU   FLAGS+0                                                  02192000
CLNUPFLG EQU   FLAGS+0                                                  02193000
FNDTFLG  EQU   FLAGS+0                                                  02194000
         ORG   FLAGS+1                                                  02195000
         DS    CL3                                                      02196000
WAITKEY  DC    X'E0000000'                                              02197000
HDRBSC   DS    CL3                                                      02198000
         ORG   HDRBSC                                                   02199000
SOHCHAR  DC    X'01'                                                    02200000
PERSLASH DC    CL2'%/'                                                  02201000
         ORG   HDRBSC+3                                                 02202000
ENDSYNC  DS    CL3                                                      02203000
         ORG   ENDSYNC                                                  02204000
SYCHCHAR DC    X'150337'                                                02205000
         ORG   ENDSYNC+3                                                02206000
ENDSS    DS    CL2                                                      02207000
         ORG   ENDSS                                                    02208000
SSCHAR   DC    X'1537'                                                  02209000
         ORG   ENDSS+2                                                  02210000
S3270    DS    CL2                                                      02211000
         ORG   S3270                                                    02212000
S3270CH  DC    X'F5C2'                                                  02213000
         ORG   S3270+2                                                  02214000
LOCISIZE DC    X'00FF'                                                  02215000
INVALTIC DC    X'000002'                                                02216000
STXCH    DS    CL1                                                      02217000
         ORG   STXCH                                                    02218000
STXCHAR  DC    X'02'                                                    02219000
         ORG   STXCH+1                                                  02220000
CANCLMSG DC    CL7'CANCEL/'                                             02221000
NLCHAR   DS    CL1                                                      02222000
         ORG   NLCHAR                                                   02223000
NEWLINE  DC    X'15'                                                    02224000
         ORG   NLCHAR+1                                                 02225000
HIMASK   DC    X'000F'                                                  02226000
ERRCODE  DC    X'0420'                                                  02227000
IED149I  DS    CL25                                                     02228000
         ORG   IED149I                                                  02229000
LEN149I  DC    AL2(21)                                                  02230000
MCS149I  DC    X'8000'                                                  02231000
MSG149I  DC    CL17'IED149I TOTE BUSY'                                  02232000
RTE149I  DC    X'0200'                                                  02233000
DSC149I  DC    X'0040'                                                  02234000
         ORG   IED149I+25                                               02235000
         DS    CL3                                                      02236000
IED244I  DS    CL75                                                     02237000
         ORG   IED244I                                                  02238000
LEN244I  DC    AL2(71)                                                  02239000
MCS244I  DC    X'8000'                                                  02240000
MSG244I  DS    CL67                                                     02241000
         ORG   MSG244I                                                  02242000
@NM00302 DC    CL14'IED244I ERROR '                                     02243000
RCD244I  DS    CL10                                                     02244000
@NM00303 DC    CL21' OCCURRED DURING I/O '                              02245000
@NM00304 DC    CL14'WITH TERMINAL '                                     02246000
NAM244I  DS    CL8                                                      02247000
         ORG   IED244I+71                                               02248000
RTE244I  DC    X'0200'                                                  02249000
DSC244I  DC    X'0040'                                                  02250000
         ORG   IED244I+75                                               02251000
HEXTCHAR DC    CL1'0'                                                   02252000
         DC    CL1'1'                                                   02253000
         DC    CL1'2'                                                   02254000
         DC    CL1'3'                                                   02255000
         DC    CL1'4'                                                   02256000
         DC    CL1'5'                                                   02257000
         DC    CL1'6'                                                   02258000
         DC    CL1'7'                                                   02259000
         DC    CL1'8'                                                   02260000
         DC    CL1'9'                                                   02261000
         DC    CL1'A'                                                   02262000
         DC    CL1'B'                                                   02263000
         DC    CL1'C'                                                   02264000
         DC    CL1'D'                                                   02265000
         DC    CL1'E'                                                   02266000
         DC    CL1'F'                                                   02267000
IEDQWA1  CSECT                                                          02268000
LOWTOUP  DS    0H                                                       02269000
         DC    X'000102030405060708090A0B0C0D0E0F'                      02270000
         DC    X'101112131415161718191A1B1C1D1E1F'                      02271000
         DC    X'202122232425262728292A2B2C2D2E2F'                      02272000
         DC    X'303132333435363738393A3B3C3D3E3F'                      02273000
         DC    X'404142434445464748494A4B4C4D4E4F'                      02274000
         DC    X'505152535455565758595A5B5C5D5E5F'                      02275000
         DC    X'606162636465666768696A6B6C6D6E6F'                      02276000
         DC    X'707172737475767778797A7B7C7D7E7F'                      02277000
         DC    X'80C1C2C3C4C5C6C7C8C98A8B8C8D8E8F'                      02278000
         DC    X'90D1D2D3D4D5D6D7D8D99A9B9C9D9E9F'                      02279000
         DC    X'A0A1E2E3E4E5E6E7E8E9AAABACADAEAF'                      02280000
         DC    X'B0B1B2B3B4B5B6B7B8B9BABBBCBDBEBF'                      02281000
         DC    X'C0C1C2C3C4C5C6C7C8C9CACBCCCDCECF'                      02282000
         DC    X'D0D1D2D3D4D5D6D7D8D9DADBDCDDDEDF'                      02283000
         DC    X'E0E1E2E3E4E5E6E7E8E9EAEBECEDEEEF'                      02284000
         DC    X'F0F1F2F3F4F5F6F7F8F9FAFBFCFDFEFF'                      02285000
IEDQWA1  CSECT                                                          02286000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02287000
@01      EQU   01                                                       02288000
@02      EQU   02                                                       02289000
@03      EQU   03                                                       02290000
@04      EQU   04                                                       02291000
@05      EQU   05                                                       02292000
@06      EQU   06                                                       02293000
@07      EQU   07                                                       02294000
@08      EQU   08                                                       02295000
@09      EQU   09                                                       02296000
@10      EQU   10                                                       02297000
@11      EQU   11                                                       02298000
@12      EQU   12                                                       02299000
@13      EQU   13                                                       02300000
@14      EQU   14                                                       02301000
@15      EQU   15                                                       02302000
I        EQU   @03                                                      02303000
CTNAMLEN EQU   @03                                                      02304000
CONVTRG  EQU   @10                                                      02305000
CTSRTADR EQU   @10                                                      02306000
TABLPTR  EQU   @10                                                      02307000
PTNTENT  EQU   @03                                                      02308000
MSGPTR   EQU   @03                                                      02309000
LCBXPTR  EQU   @05                                                      02310000
OLTCBPTR EQU   @09                                                      02311000
RAVT     EQU   @04                                                      02312000
RDCT     EQU   @09                                                      02313000
RPREFIX  EQU   @06                                                      02314000
RRESPL   EQU   @11                                                      02315000
RTNT     EQU   @15                                                      02316000
RTRM     EQU   @08                                                      02317000
RZERO    EQU   @00                                                      02318000
REG01    EQU   @01                                                      02319000
RPARM    EQU   @01                                                      02320000
RELMT    EQU   @02                                                      02321000
REG03    EQU   @03                                                      02322000
REG05    EQU   @05                                                      02323000
REG09    EQU   @09                                                      02324000
REG10    EQU   @10                                                      02325000
RSAVE    EQU   @13                                                      02326000
RRET     EQU   @14                                                      02327000
REG15    EQU   @15                                                      02328000
RBRNCH   EQU   @15                                                      02329000
RMSGLEN  EQU   @15                                                      02330000
REG00    EQU   @00                                                      02331000
REG02    EQU   @02                                                      02332000
REG04    EQU   @04                                                      02333000
REG06    EQU   @06                                                      02334000
REG07    EQU   @07                                                      02335000
REG08    EQU   @08                                                      02336000
REG11    EQU   @11                                                      02337000
REG12    EQU   @12                                                      02338000
REG13    EQU   @13                                                      02339000
REG14    EQU   @14                                                      02340000
PSA      EQU   0                                                        02341000
FLCRNPSW EQU   PSA                                                      02342000
FLCROPSW EQU   PSA+8                                                    02343000
FLCICCW2 EQU   PSA+16                                                   02344000
PSAEEPSW EQU   PSA+132                                                  02345000
PSAESPSW EQU   PSA+136                                                  02346000
FLCSVILC EQU   PSAESPSW+1                                               02347000
PSAEPPSW EQU   PSA+140                                                  02348000
FLCPIILC EQU   PSAEPPSW+1                                               02349000
FLCPICOD EQU   PSAEPPSW+2                                               02350000
PSAPICOD EQU   FLCPICOD+1                                               02351000
FLCTEA   EQU   PSAEPPSW+4                                               02352000
FLCPER   EQU   PSA+152                                                  02353000
FLCMCLA  EQU   PSA+168                                                  02354000
FLCIOEL  EQU   FLCMCLA+4                                                02355000
FLCIOA   EQU   FLCMCLA+16                                               02356000
FLCFSA   EQU   FLCMCLA+80                                               02357000
PSASUPER EQU   PSA+552                                                  02358000
PSASUP1  EQU   PSASUPER                                                 02359000
PSASUP2  EQU   PSASUPER+1                                               02360000
PSASUP3  EQU   PSASUPER+2                                               02361000
PSASUP4  EQU   PSASUPER+3                                               02362000
PSACLHT  EQU   PSA+640                                                  02363000
PSALKSA  EQU   PSA+696                                                  02364000
PSAHLHI  EQU   PSA+760                                                  02365000
PSALITA  EQU   PSA+764                                                  02366000
PSADSSFL EQU   PSA+836                                                  02367000
PSADSSF1 EQU   PSADSSFL                                                 02368000
PSADSSF3 EQU   PSADSSFL+2                                               02369000
PSADSSF4 EQU   PSADSSFL+3                                               02370000
PSARSVT  EQU   PSA+896                                                  02371000
IEDQAVTD EQU   0                                                        02372000
AVTSAVEX EQU   IEDQAVTD+288                                             02373000
AVTCSTCS EQU   IEDQAVTD+328                                             02374000
AVTREADD EQU   IEDQAVTD+380                                             02375000
AVTBUFSW EQU   IEDQAVTD+384                                             02376000
@NM00004 EQU   IEDQAVTD+388                                             02377000
AVTCKFLG EQU   @NM00004                                                 02378000
AVTBASE  EQU   IEDQAVTD+412                                             02379000
AVTPKF   EQU   AVTBASE                                                  02380000
AVTRNMPT EQU   IEDQAVTD+424                                             02381000
AVTMVBFR EQU   IEDQAVTD+444                                             02382000
AVTOSECB EQU   IEDQAVTD+492                                             02383000
AVTECB1  EQU   AVTOSECB                                                 02384000
AVTHG02  EQU   IEDQAVTD+528                                             02385000
AVTDISP  EQU   IEDQAVTD+552                                             02386000
AVTHD    EQU   IEDQAVTD+556                                             02387000
AVTSCOPT EQU   AVTHD                                                    02388000
AVTSAVTP EQU   IEDQAVTD+612                                             02389000
AVTSAVTF EQU   AVTSAVTP                                                 02390000
AVTCKPEL EQU   IEDQAVTD+652                                             02391000
AVTCKRMV EQU   AVTCKPEL                                                 02392000
AVTCKELF EQU   IEDQAVTD+680                                             02393000
AVTCKBYT EQU   IEDQAVTD+691                                             02394000
AVTHG01  EQU   IEDQAVTD+692                                             02395000
AVTCKLNK EQU   IEDQAVTD+696                                             02396000
AVTCRELE EQU   IEDQAVTD+708                                             02397000
AVTCCELE EQU   AVTCRELE                                                 02398000
AVTCLRHI EQU   IEDQAVTD+716                                             02399000
AVTADBUF EQU   IEDQAVTD+720                                             02400000
AVTSYSER EQU   IEDQAVTD+728                                             02401000
AVTMSGS  EQU   IEDQAVTD+729                                             02402000
AVTINOUT EQU   IEDQAVTD+766                                             02403000
AVTBFRFG EQU   IEDQAVTD+784                                             02404000
AVTBFRTB EQU   IEDQAVTD+792                                             02405000
AVTCKPQB EQU   IEDQAVTD+804                                             02406000
AVTCKPTB EQU   AVTCKPQB                                                 02407000
AVTCKPEC EQU   AVTCKPQB+4                                               02408000
AVTCKPCC EQU   AVTCKPEC                                                 02409000
AVTOPCQB EQU   IEDQAVTD+816                                             02410000
AVTOPCOB EQU   AVTOPCQB                                                 02411000
AVTOPCEC EQU   AVTOPCQB+4                                               02412000
AVTOPCCC EQU   AVTOPCEC                                                 02413000
AVTOLTQB EQU   IEDQAVTD+828                                             02414000
AVTOLTCH EQU   AVTOLTQB+1                                               02415000
AVTCWFL1 EQU   IEDQAVTD+924                                             02416000
AVTCWFL2 EQU   IEDQAVTD+925                                             02417000
AVTSUBT  EQU   IEDQAVTD+948                                             02418000
AVTIOTR  EQU   IEDQAVTD+949                                             02419000
AVTKEYLE EQU   IEDQAVTD+1032                                            02420000
AVTBIT1  EQU   IEDQAVTD+1050                                            02421000
AVTTSON  EQU   AVTBIT1                                                  02422000
AVTAQTAN EQU   AVTBIT1                                                  02423000
AVTBIT2  EQU   IEDQAVTD+1051                                            02424000
AVTBIT3  EQU   IEDQAVTD+1052                                            02425000
AVTDDFT  EQU   IEDQAVTD+1064                                            02426000
AVTBIT4  EQU   IEDQAVTD+1136                                            02427000
@NM00086 EQU   IEDQAVTD+1232                                            02428000
IEDQAPTR EQU   0                                                        02429000
IEDNSVTD EQU   0                                                        02430000
SAVTDIAG EQU   IEDNSVTD                                                 02431000
SAVTDIAF EQU   SAVTDIAG                                                 02432000
SAVTLUSQ EQU   IEDNSVTD+88                                              02433000
SAVTSCPQ EQU   IEDNSVTD+108                                             02434000
SAVTTCPU EQU   IEDNSVTD+238                                             02435000
SAVTSCPT EQU   SAVTTCPU                                                 02436000
SAVTNAX  EQU   IEDNSVTD+248                                             02437000
SAVTZELM EQU   IEDNSVTD+270                                             02438000
SAVTRDRV EQU   IEDNSVTD+284                                             02439000
SAVTCKQB EQU   IEDNSVTD+300                                             02440000
SAVTCKTB EQU   SAVTCKQB                                                 02441000
SAVTCKEC EQU   SAVTCKQB+4                                               02442000
SAVTCKCC EQU   SAVTCKEC                                                 02443000
IHADCB   EQU   0                                                        02444000
DCBPTR   EQU   0                                                        02445000
IHADCS16 EQU   0                                                        02446000
DCBMHA   EQU   IHADCS16                                                 02447000
DCBBUFOU EQU   DCBMHA                                                   02448000
DCBBUFIN EQU   DCBBUFOU                                                 02449000
DCBPCI   EQU   IHADCS16+5                                               02450000
DCBDSORG EQU   IHADCS16+6                                               02451000
DCBDSRG1 EQU   DCBDSORG                                                 02452000
DCBDSRG2 EQU   DCBDSORG+1                                               02453000
IHADCS17 EQU   0                                                        02454000
DCBCLPS  EQU   IHADCS17                                                 02455000
DCBIOBAD EQU   IHADCS17+8                                               02456000
IHADCS18 EQU   0                                                        02457000
DCBTRANA EQU   IHADCS18                                                 02458000
DCBTRANS EQU   DCBTRANA+1                                               02459000
IHADCS19 EQU   0                                                        02460000
DCBLCBAD EQU   IHADCS19                                                 02461000
DCBCPRI  EQU   DCBLCBAD                                                 02462000
DCBEXLST EQU   IHADCS19+4                                               02463000
IHADCS24 EQU   0                                                        02464000
DCBOFLGS EQU   IHADCS24+8                                               02465000
DCBOFLWR EQU   DCBOFLGS                                                 02466000
DCBIFLG  EQU   IHADCS24+9                                               02467000
DCBIBPCT EQU   DCBIFLG                                                  02468000
DCBMACR  EQU   IHADCS24+10                                              02469000
DCBMACR1 EQU   DCBMACR                                                  02470000
DCBMRFE  EQU   DCBMACR1                                                 02471000
DCBMRGET EQU   DCBMRFE                                                  02472000
DCBMRAPG EQU   DCBMACR1                                                 02473000
DCBMRRD  EQU   DCBMRAPG                                                 02474000
DCBMRCI  EQU   DCBMACR1                                                 02475000
DCBMRMVG EQU   DCBMRCI                                                  02476000
DCBMRLCG EQU   DCBMACR1                                                 02477000
DCBMRABC EQU   DCBMACR1                                                 02478000
DCBMRPT1 EQU   DCBMRABC                                                 02479000
DCBMRSBG EQU   DCBMRPT1                                                 02480000
DCBMRCRL EQU   DCBMACR1                                                 02481000
DCBMRCHK EQU   DCBMRCRL                                                 02482000
DCBMRRDX EQU   DCBMRCHK                                                 02483000
DCBMRDMG EQU   DCBMACR1                                                 02484000
DCBMACR2 EQU   DCBMACR+1                                                02485000
DCBMRPUT EQU   DCBMACR2                                                 02486000
DCBMRWRT EQU   DCBMACR2                                                 02487000
DCBMRMVP EQU   DCBMACR2                                                 02488000
DCBMR5WD EQU   DCBMACR2                                                 02489000
DCBMRLDM EQU   DCBMR5WD                                                 02490000
DCBMRLCP EQU   DCBMRLDM                                                 02491000
DCBMR4WD EQU   DCBMACR2                                                 02492000
DCBMRPT2 EQU   DCBMR4WD                                                 02493000
DCBMRTMD EQU   DCBMRPT2                                                 02494000
DCBMR3WD EQU   DCBMACR2                                                 02495000
DCBMRCTL EQU   DCBMR3WD                                                 02496000
DCBMRSTK EQU   DCBMRCTL                                                 02497000
DCBMR1WD EQU   DCBMACR2                                                 02498000
DCBMRSWA EQU   DCBMR1WD                                                 02499000
DCBMRDMD EQU   DCBMRSWA                                                 02500000
IHADCS25 EQU   0                                                        02501000
DCBMACRF EQU   IHADCS25+2                                               02502000
DCBMACF1 EQU   DCBMACRF                                                 02503000
DCBMFFE  EQU   DCBMACF1                                                 02504000
DCBMFGET EQU   DCBMFFE                                                  02505000
DCBMFAPG EQU   DCBMACF1                                                 02506000
DCBMFRD  EQU   DCBMFAPG                                                 02507000
DCBMFCI  EQU   DCBMACF1                                                 02508000
DCBMFMVG EQU   DCBMFCI                                                  02509000
DCBMFLCG EQU   DCBMACF1                                                 02510000
DCBMFABC EQU   DCBMACF1                                                 02511000
DCBMFPT1 EQU   DCBMFABC                                                 02512000
DCBMFSBG EQU   DCBMFPT1                                                 02513000
DCBMFCRL EQU   DCBMACF1                                                 02514000
DCBMFCHK EQU   DCBMFCRL                                                 02515000
DCBMFDMG EQU   DCBMACF1                                                 02516000
DCBMACF2 EQU   DCBMACRF+1                                               02517000
DCBMFPUT EQU   DCBMACF2                                                 02518000
DCBMFWRT EQU   DCBMACF2                                                 02519000
DCBMFMVP EQU   DCBMACF2                                                 02520000
DCBMF5WD EQU   DCBMACF2                                                 02521000
DCBMFLDM EQU   DCBMF5WD                                                 02522000
DCBMFLCP EQU   DCBMFLDM                                                 02523000
DCBMF4WD EQU   DCBMACF2                                                 02524000
DCBMFPT2 EQU   DCBMF4WD                                                 02525000
DCBMFTMD EQU   DCBMFPT2                                                 02526000
DCBMF3WD EQU   DCBMACF2                                                 02527000
DCBMFCTL EQU   DCBMF3WD                                                 02528000
DCBMFSTK EQU   DCBMFCTL                                                 02529000
DCBMF1WD EQU   DCBMACF2                                                 02530000
DCBMFSWA EQU   DCBMF1WD                                                 02531000
DCBMFDMD EQU   DCBMFSWA                                                 02532000
DCBDEBAD EQU   IHADCS25+4                                               02533000
DCBIFLGS EQU   DCBDEBAD                                                 02534000
DCBIFPCT EQU   DCBIFLGS                                                 02535000
IHADCS43 EQU   0                                                        02536000
DCBSCTAB EQU   IHADCS43                                                 02537000
IHADCS2A EQU   0                                                        02538000
DCBRESER EQU   IHADCS2A                                                 02539000
DCBINVLI EQU   IHADCS2A+4                                               02540000
DCBINVCI EQU   DCBINVLI                                                 02541000
IEDDCT   EQU   0                                                        02542000
DCTBYTE1 EQU   IEDDCT+1                                                 02543000
DCT3270  EQU   DCTBYTE1                                                 02544000
DCTBYTE2 EQU   IEDDCT+2                                                 02545000
DCTBYTE3 EQU   IEDDCT+3                                                 02546000
DCTNOIDL EQU   DCTBYTE3                                                 02547000
DCTBYTE4 EQU   IEDDCT+4                                                 02548000
DCTBYTE5 EQU   IEDDCT+5                                                 02549000
DCTL3270 EQU   DCTBYTE5                                                 02550000
IEDQLCB  EQU   0                                                        02551000
LCBRCB   EQU   IEDQLCB                                                  02552000
LCBQCBA  EQU   LCBRCB+1                                                 02553000
LCBPRI   EQU   LCBRCB+4                                                 02554000
LCBLINK  EQU   LCBRCB+5                                                 02555000
LCBRSKEY EQU   IEDQLCB+8                                                02556000
LCBTSOB  EQU   IEDQLCB+19                                               02557000
LCBCHAIN EQU   IEDQLCB+20                                               02558000
LCBSCRNN EQU   LCBCHAIN                                                 02559000
LCBTETEN EQU   LCBCHAIN                                                 02560000
LCBINSRC EQU   IEDQLCB+21                                               02561000
LCBLKMDE EQU   LCBINSRC+2                                               02562000
LCBNTXT  EQU   IEDQLCB+24                                               02563000
LCBSTAT4 EQU   LCBNTXT                                                  02564000
LCBPHASE EQU   LCBSTAT4                                                 02565000
LCBSCBDA EQU   IEDQLCB+25                                               02566000
LCBMHA   EQU   IEDQLCB+29                                               02567000
LCBFLAG1 EQU   IEDQLCB+32                                               02568000
LCBIOBSN EQU   IEDQLCB+33                                               02569000
LCBSNS   EQU   LCBIOBSN+1                                               02570000
LCBSENS0 EQU   LCBSNS                                                   02571000
LCBLOSDT EQU   LCBSENS0                                                 02572000
LCBTMOUT EQU   LCBSENS0                                                 02573000
LCBFLAG3 EQU   LCBIOBSN+7                                               02574000
LCBCSW   EQU   LCBIOBSN+8                                               02575000
LCBCSWST EQU   LCBCSW+3                                                 02576000
LCBCSWUS EQU   LCBCSWST                                                 02577000
LCBCSWCS EQU   LCBCSWST+1                                               02578000
LCBSIOCC EQU   LCBIOBSN+15                                              02579000
LCBDCBPT EQU   IEDQLCB+52                                               02580000
LCBRCQCB EQU   IEDQLCB+56                                               02581000
LCBRESTR EQU   LCBRCQCB                                                 02582000
LCBTHSQ  EQU   IEDQLCB+60                                               02583000
LCBINCAM EQU   LCBTHSQ                                                  02584000
LCBERRCT EQU   IEDQLCB+62                                               02585000
LCBLSPCI EQU   IEDQLCB+65                                               02586000
LCBRCBFR EQU   LCBLSPCI                                                 02587000
LCBSTATE EQU   IEDQLCB+70                                               02588000
LCBSTAT1 EQU   LCBSTATE                                                 02589000
LCBSTAT2 EQU   LCBSTATE+1                                               02590000
LCBBEOTN EQU   LCBSTAT2                                                 02591000
LCBNEGRP EQU   LCBSTAT2                                                 02592000
LCBSYNC  EQU   LCBSTAT2                                                 02593000
LCBDIAL  EQU   LCBSTAT2                                                 02594000
LCBTSTSW EQU   IEDQLCB+72                                               02595000
LCBERB   EQU   IEDQLCB+76                                               02596000
LCBERBST EQU   IEDQLCB+84                                               02597000
LCBDLNKN EQU   LCBERBST                                                 02598000
LCBERBCT EQU   IEDQLCB+88                                               02599000
LCBRBCT2 EQU   LCBERBCT+1                                               02600000
LCBMSGFM EQU   IEDQLCB+92                                               02601000
LCBOLT   EQU   LCBMSGFM                                                 02602000
LCBSCBA  EQU   IEDQLCB+93                                               02603000
LCBOBRCH EQU   IEDQLCB+96                                               02604000
LCBINVPT EQU   LCBOBRCH+1                                               02605000
LCBBFRW  EQU   LCBINVPT                                                 02606000
LCBTPCD  EQU   IEDQLCB+100                                              02607000
LCBSTAT5 EQU   LCBTPCD                                                  02608000
LCBSTAT6 EQU   LCBTPCD+4                                                02609000
LCBRSPSV EQU   LCBTPCD+8                                                02610000
LCBSAVSN EQU   IEDQLCB+112                                              02611000
LCBERCCW EQU   IEDQLCB+120                                              02612000
LCBCPA   EQU   IEDQLCB+144                                              02613000
LCBCCW5  EQU   LCBCPA+32                                                02614000
LCBATTEL EQU   LCBCCW5                                                  02615000
LCBQEBPL EQU   LCBATTEL                                                 02616000
IEDQLPTR EQU   0                                                        02617000
IEDQLCBX EQU   0                                                        02618000
LCBXCON  EQU   IEDQLCBX                                                 02619000
LCBXFLAG EQU   LCBXCON                                                  02620000
LCBXDCT  EQU   LCBXCON+1                                                02621000
LCBXRADR EQU   LCBXCON+4                                                02622000
TOTOLTCB EQU   0                                                        02623000
TOTOBPTR EQU   TOTOLTCB                                                 02624000
TOTELKEY EQU   TOTOBPTR                                                 02625000
TOTELLNK EQU   TOTOBPTR+5                                               02626000
$SCTTBLE EQU   TOTOLTCB+8                                               02627000
$TESTOPT EQU   $SCTTBLE+2                                               02628000
$ERROPT  EQU   $SCTTBLE+3                                               02629000
$PDEVFLG EQU   $SCTTBLE+10                                              02630000
$CDSFLGS EQU   $SCTTBLE+11                                              02631000
$EXECFLG EQU   $SCTTBLE+33                                              02632000
$OLTFLGS EQU   $SCTTBLE+36                                              02633000
$TOTFLG1 EQU   $SCTTBLE+38                                              02634000
TOTSAVE5 EQU   TOTOLTCB+416                                             02635000
TOTSRENT EQU   TOTOLTCB+584                                             02636000
TOTSROFF EQU   TOTSRENT                                                 02637000
TOTCTENT EQU   TOTOLTCB+592                                             02638000
TOTCTOFF EQU   TOTCTENT+2                                               02639000
TOTCROFF EQU   TOTCTENT+4                                               02640000
TOTCTFLG EQU   TOTCTENT+22                                              02641000
TOTCTNAM EQU   TOTCTENT+31                                              02642000
TOTCTDFL EQU   TOTOLTCB+632                                             02643000
TOTCUTST EQU   TOTOLTCB+636                                             02644000
TOTCUFLG EQU   TOTCUTST                                                 02645000
TOTPLIST EQU   TOTOLTCB+672                                             02646000
TOTOECBA EQU   TOTPLIST+12                                              02647000
TOTOFLG  EQU   TOTOECBA                                                 02648000
TOTOPCLN EQU   TOTOLTCB+736                                             02649000
TOTAPENT EQU   TOTOLTCB+744                                             02650000
TOTAPOFF EQU   TOTAPENT+2                                               02651000
TOTAROFF EQU   TOTAPENT+4                                               02652000
TOTAPFLG EQU   TOTAPENT+22                                              02653000
TOTAPDFL EQU   TOTOLTCB+775                                             02654000
TOTOLTMQ EQU   TOTOLTCB+808                                             02655000
TOTOTECB EQU   TOTOLTCB+812                                             02656000
TOTTCBAD EQU   TOTOLTCB+820                                             02657000
TOTCMPCD EQU   TOTOLTCB+824                                             02658000
TOTOLTPL EQU   TOTOLTCB+828                                             02659000
TOTWTORP EQU   TOTOLTCB+840                                             02660000
TOTWTOPL EQU   TOTOLTCB+848                                             02661000
TOTOLTID EQU   TOTOLTCB+1016                                            02662000
TOTPLNKQ EQU   TOTOLTCB+1020                                            02663000
TOTFLG01 EQU   TOTOLTCB+1192                                            02664000
TOTCONFG EQU   TOTFLG01                                                 02665000
TOTCLNST EQU   TOTFLG01                                                 02666000
TOTCLNED EQU   TOTFLG01                                                 02667000
TOTFLG02 EQU   TOTOLTCB+1193                                            02668000
TOTFLG03 EQU   TOTOLTCB+1194                                            02669000
TOTREPEX EQU   TOTFLG03                                                 02670000
TOTFLG04 EQU   TOTOLTCB+1195                                            02671000
TOTFLG05 EQU   TOTOLTCB+1196                                            02672000
TOTFLG06 EQU   TOTOLTCB+1197                                            02673000
TOTWACAN EQU   TOTFLG06                                                 02674000
TOTCANCL EQU   TOTFLG06                                                 02675000
TOTOTACT EQU   TOTFLG06                                                 02676000
TOTFLG07 EQU   TOTOLTCB+1198                                            02677000
TOTFLG08 EQU   TOTOLTCB+1199                                            02678000
TOTFLG09 EQU   TOTOLTCB+1200                                            02679000
TOTFLG10 EQU   TOTOLTCB+1201                                            02680000
TOTOLTED EQU   TOTFLG10                                                 02681000
TOTPRECB EQU   TOTOLTCB+1324                                            02682000
TOTPRIBK EQU   TOTPRECB                                                 02683000
TOTPRENT EQU   TOTOLTCB+1328                                            02684000
TOTPCOFF EQU   TOTPRENT+2                                               02685000
TOTPROFF EQU   TOTPRENT+4                                               02686000
TOTPRFLG EQU   TOTPRENT+22                                              02687000
TOTPRBUF EQU   TOTPRENT+32                                              02688000
TOTPRSN  EQU   TOTOLTCB+1372                                            02689000
TOTPRSEQ EQU   TOTPRSN+2                                                02690000
TOTPRDCB EQU   TOTOLTCB+1424                                            02691000
TOTSCECB EQU   TOTOLTCB+1496                                            02692000
TOTSCENT EQU   TOTOLTCB+1500                                            02693000
TOTNCOFF EQU   TOTSCENT+2                                               02694000
TOTSCOFF EQU   TOTSCENT+4                                               02695000
TOTSCFLG EQU   TOTSCENT+22                                              02696000
TOTSCBUF EQU   TOTSCENT+32                                              02697000
TOTSCSN  EQU   TOTOLTCB+1544                                            02698000
TOTSCSEQ EQU   TOTSCSN+2                                                02699000
TOTSCDCB EQU   TOTOLTCB+1596                                            02700000
TOTCROLT EQU   TOTOLTCB+1668                                            02701000
TOTTDTBL EQU   TOTOLTCB+1756                                            02702000
@NM00218 EQU   TOTTDTBL                                                 02703000
IEDPLMV  EQU   0                                                        02704000
PLMVTU   EQU   IEDPLMV                                                  02705000
PLMVTD   EQU   IEDPLMV+4                                                02706000
PLMVSU   EQU   IEDPLMV+8                                                02707000
PLMVSD   EQU   IEDPLMV+12                                               02708000
PLMVLNTH EQU   IEDPLMV+16                                               02709000
PLMVFLG1 EQU   IEDPLMV+18                                               02710000
PLMVSCTG EQU   PLMVFLG1                                                 02711000
PLMVTCTG EQU   PLMVFLG1                                                 02712000
IEDPLMVP EQU   0                                                        02713000
IEDQPRF  EQU   0                                                        02714000
PRFRCB   EQU   IEDQPRF                                                  02715000
PRFKEY   EQU   PRFRCB                                                   02716000
PRFQCBA  EQU   PRFRCB+1                                                 02717000
PRFPRI   EQU   PRFRCB+4                                                 02718000
PRFLINK  EQU   PRFRCB+5                                                 02719000
PRFTIC   EQU   IEDQPRF+8                                                02720000
PRFTICC  EQU   PRFTIC                                                   02721000
PRFNBUNT EQU   IEDQPRF+12                                               02722000
PRFSUNIT EQU   PRFNBUNT                                                 02723000
PRFPLQCB EQU   PRFSUNIT                                                 02724000
PRFLCB   EQU   IEDQPRF+13                                               02725000
@NM00229 EQU   IEDQPRF+16                                               02726000
PRFSVFFO EQU   @NM00229                                                 02727000
PRFSRCE  EQU   PRFSVFFO                                                 02728000
PRFSIZE  EQU   PRFSVFFO+2                                               02729000
PRFSTAT1 EQU   IEDQPRF+20                                               02730000
PRFERMGN EQU   PRFSTAT1                                                 02731000
PRFEOFN  EQU   PRFSTAT1                                                 02732000
PRFNLSTN EQU   PRFSTAT1                                                 02733000
PRFNHDRN EQU   PRFSTAT1                                                 02734000
PRFCORE  EQU   IEDQPRF+21                                               02735000
PRFXTRA  EQU   PRFCORE                                                  02736000
PRFSCAN  EQU   IEDQPRF+24                                               02737000
PRFTQBCK EQU   IEDQPRF+26                                               02738000
PRFNTXT  EQU   PRFTQBCK                                                 02739000
PRFEOBOF EQU   PRFNTXT                                                  02740000
PRFCHDR  EQU   IEDQPRF+32                                               02741000
PRFHQBCK EQU   IEDQPRF+35                                               02742000
PRFDEST  EQU   IEDQPRF+40                                               02743000
IEDQPPTR EQU   0                                                        02744000
IEDPF1   EQU   0                                                        02745000
PRF1RH   EQU   IEDPF1                                                   02746000
PRF1FLG1 EQU   IEDPF1+3                                                 02747000
PRF1FIDI EQU   PRF1FLG1                                                 02748000
PRF1FORM EQU   PRF1FLG1                                                 02749000
PRF1WD2  EQU   IEDPF1+4                                                 02750000
PRF1SEQP EQU   PRF1WD2                                                  02751000
PRF1SQID EQU   PRF1SEQP                                                 02752000
PRF1TAG1 EQU   PRF1SQID                                                 02753000
IEDPF2   EQU   0                                                        02754000
PRF2FLG2 EQU   IEDPF2                                                   02755000
PRF2WD2  EQU   IEDPF2+4                                                 02756000
IEDQQCB  EQU   0                                                        02757000
QCBDSFLG EQU   IEDQQCB                                                  02758000
QCBCORE  EQU   QCBDSFLG                                                 02759000
QCBDISK  EQU   QCBDSFLG                                                 02760000
QCBNREUS EQU   QCBDISK                                                  02761000
QCBREUS  EQU   QCBDISK                                                  02762000
QCBELCHN EQU   IEDQQCB+1                                                02763000
QCBEOLDT EQU   IEDQQCB+16                                               02764000
QCBBYTE1 EQU   QCBEOLDT+1                                               02765000
QCBLKRLN EQU   IEDQQCB+18                                               02766000
QCBRETCT EQU   QCBLKRLN                                                 02767000
QCBSTAT  EQU   IEDQQCB+19                                               02768000
QCBINSRC EQU   IEDQQCB+21                                               02769000
@NM00263 EQU   QCBINSRC                                                 02770000
QCBTSOF2 EQU   @NM00263+1                                               02771000
QCBTSOF1 EQU   @NM00263+2                                               02772000
QCBINTVL EQU   IEDQQCB+24                                               02773000
QCBPREN  EQU   IEDQQCB+28                                               02774000
QCBLKRRN EQU   QCBPREN+1                                                02775000
QCBDCBAD EQU   IEDQQCB+33                                               02776000
QCBFLAG  EQU   IEDQQCB+36                                               02777000
QCBTSSES EQU   QCBFLAG                                                  02778000
IEDQQPTR EQU   0                                                        02779000
IEDQPQCB EQU   0                                                        02780000
QCBFHDLZ EQU   IEDQPQCB+3                                               02781000
QCBPFEFO EQU   QCBFHDLZ+1                                               02782000
QCBFHDTZ EQU   IEDQPQCB+6                                               02783000
QCBINTLF EQU   IEDQPQCB+12                                              02784000
IEDNQCB  EQU   0                                                        02785000
QCBSTAT1 EQU   IEDNQCB+4                                                02786000
QCBPLCBA EQU   IEDNQCB+5                                                02787000
IEDREQD  EQU   0                                                        02788000
REQQCBA  EQU   IEDREQD+1                                                02789000
REQPRI   EQU   IEDREQD+4                                                02790000
REQLINK  EQU   IEDREQD+5                                                02791000
REQRPRI  EQU   IEDREQD+8                                                02792000
REQRQCBA EQU   IEDREQD+9                                                02793000
REQROUTE EQU   IEDREQD+12                                               02794000
REQRCDS  EQU   IEDREQD+14                                               02795000
REQDATA  EQU   IEDREQD+16                                               02796000
IEDRESPL EQU   0                                                        02797000
RESOBQCB EQU   IEDRESPL+12                                              02798000
RESOBFWD EQU   RESOBQCB                                                 02799000
RESBKTOT EQU   IEDRESPL+24                                              02800000
RESFLAGS EQU   IEDRESPL+49                                              02801000
RESTRMQ  EQU   IEDRESPL+52                                              02802000
RESQHBL  EQU   IEDRESPL+60                                              02803000
RESREMFR EQU   RESQHBL                                                  02804000
RESREMEL EQU   RESQHBL+4                                                02805000
RESADDND EQU   RESQHBL+8                                                02806000
RESADDAF EQU   RESQHBL+12                                               02807000
RESPLRVT EQU   IEDRESPL+76                                              02808000
RESABUF  EQU   IEDRESPL+80                                              02809000
RESFBUF  EQU   IEDRESPL+84                                              02810000
RESPLADR EQU   IEDRESPL+96                                              02811000
RESPLAC  EQU   RESPLADR+44                                              02812000
RESPL42  EQU   RESPLADR+56                                              02813000
IEDRH    EQU   0                                                        02814000
TRHBYTE0 EQU   IEDRH                                                    02815000
TRHBYTE1 EQU   IEDRH+1                                                  02816000
TRHBYTE2 EQU   IEDRH+2                                                  02817000
IEDQSCB  EQU   0                                                        02818000
SCBSTATE EQU   IEDQSCB                                                  02819000
SCBSEQIN EQU   SCBSTATE                                                 02820000
SCBDESTQ EQU   IEDQSCB+1                                                02821000
SCBRCVCT EQU   IEDQSCB+4                                                02822000
SCBMBHEN EQU   IEDQSCB+5                                                02823000
SCBMACR  EQU   SCBMBHEN                                                 02824000
SCBBKFCT EQU   IEDQSCB+9                                                02825000
SCBEOBSZ EQU   SCBBKFCT+1                                               02826000
SCBSALEV EQU   IEDQSCB+12                                               02827000
SCBQTYPE EQU   SCBSALEV                                                 02828000
SCBERRST EQU   IEDQSCB+16                                               02829000
SCBERR1  EQU   SCBERRST                                                 02830000
SCBHDRRN EQU   SCBERR1                                                  02831000
SCBORIGN EQU   SCBERR1                                                  02832000
SCBNOTRM EQU   SCBERR1                                                  02833000
SCBSEQHN EQU   SCBERR1                                                  02834000
SCBSEQLN EQU   SCBERR1                                                  02835000
SCBCUTFN EQU   SCBERR1                                                  02836000
SCBERR2  EQU   SCBERRST+1                                               02837000
SCBABRTN EQU   SCBERR2                                                  02838000
SCBERR3  EQU   SCBERRST+2                                               02839000
SCBLOSTN EQU   SCBERR3                                                  02840000
SCBTMIDN EQU   SCBERR3                                                  02841000
SCBFORMN EQU   SCBERR3                                                  02842000
SCBATTN  EQU   SCBERR3                                                  02843000
SCBXCEPN EQU   SCBERR3                                                  02844000
SCBERR4  EQU   SCBERRST+3                                               02845000
SCBTXTTN EQU   SCBERR4                                                  02846000
SCBCTLUN EQU   SCBERR4                                                  02847000
SCBCHANN EQU   SCBERR4                                                  02848000
SCBDLPTR EQU   IEDQSCB+22                                               02849000
SCBEOBAC EQU   SCBDLPTR                                                 02850000
SCBCTBAC EQU   SCBEOBAC                                                 02851000
SCBBSCFM EQU   IEDQSCB+24                                               02852000
SCBDATEN EQU   SCBBSCFM                                                 02853000
SCBITBSZ EQU   IEDQSCB+40                                               02854000
SCBCTBSV EQU   SCBITBSZ                                                 02855000
SCBDNSEG EQU   IEDQSCB+41                                               02856000
SCBCLSEG EQU   IEDQSCB+45                                               02857000
SCBITBAC EQU   IEDQSCB+48                                               02858000
SCBCTBFL EQU   SCBITBAC                                                 02859000
SCBBLKCT EQU   SCBCTBFL                                                 02860000
SCBDCSEG EQU   IEDQSCB+49                                               02861000
SCBSTAT1 EQU   IEDQSCB+60                                               02862000
SCBCORE  EQU   IEDQSCB+61                                               02863000
SCBSCAN  EQU   IEDQSCB+64                                               02864000
SCBNTXT  EQU   IEDQSCB+66                                               02865000
SCBCHDR  EQU   IEDQSCB+72                                               02866000
SCBCCSEG EQU   IEDQSCB+75                                               02867000
SCBEND   EQU   IEDQSCB+84                                               02868000
IEDQSPTR EQU   0                                                        02869000
IEDSNSD  EQU   0                                                        02870000
SNSSYSTM EQU   IEDSNSD                                                  02871000
SNSUSER  EQU   IEDSNSD+2                                                02872000
SNSPTR   EQU   0                                                        02873000
IEDTH    EQU   0                                                        02874000
TTHBYTE0 EQU   IEDTH                                                    02875000
TTHSNF   EQU   IEDTH+6                                                  02876000
TTHTAG   EQU   TTHSNF                                                   02877000
TTHTAG1  EQU   TTHTAG                                                   02878000
IEDQTNTD EQU   0                                                        02879000
IEDQTCDE EQU   IEDQTNTD                                                 02880000
TNTENLEN EQU   IEDQTNTD+40                                              02881000
IEDQTDCE EQU   IEDQTNTD+46                                              02882000
IEDQNPTR EQU   0                                                        02883000
TNTFIRST EQU   0                                                        02884000
IEDTNTA  EQU   0                                                        02885000
TNTTRMAD EQU   IEDTNTA                                                  02886000
IEDQTRM  EQU   0                                                        02887000
TRMSTATE EQU   IEDQTRM                                                  02888000
TRMLOG   EQU   TRMSTATE                                                 02889000
TRMPREF  EQU   TRMSTATE                                                 02890000
TRMDESTQ EQU   IEDQTRM+1                                                02891000
TRMINSEQ EQU   IEDQTRM+4                                                02892000
TLISTCNT EQU   TRMINSEQ                                                 02893000
TRMOUTSQ EQU   IEDQTRM+6                                                02894000
TLISTEN  EQU   TRMOUTSQ                                                 02895000
TRMDSORG EQU   TLISTEN                                                  02896000
TRMALTD  EQU   IEDQTRM+8                                                02897000
TRMDEVFL EQU   IEDQTRM+10                                               02898000
TRMCONC  EQU   TRMDEVFL+1                                               02899000
TRMSTAT  EQU   IEDQTRM+12                                               02900000
TRMCHCIN EQU   IEDQTRM+16                                               02901000
IEDQTPTR EQU   0                                                        02902000
IEDNTRM  EQU   0                                                        02903000
TRMBYTE4 EQU   IEDNTRM                                                  02904000
TRMBYTE3 EQU   IEDNTRM+1                                                02905000
TRMBYTE2 EQU   IEDNTRM+2                                                02906000
TRMINPG  EQU   TRMBYTE2                                                 02907000
TRMBYTE1 EQU   IEDNTRM+3                                                02908000
TRMSCPRQ EQU   TRMBYTE1                                                 02909000
TRMBYTE0 EQU   IEDNTRM+6                                                02910000
TRMSNA   EQU   TRMBYTE0                                                 02911000
TRMSIBPT EQU   IEDNTRM+7                                                02912000
IEDTTCD  EQU   0                                                        02913000
IEDTTCP  EQU   0                                                        02914000
IEDTTCPL EQU   0                                                        02915000
TTCSVCPL EQU   IEDTTCPL                                                 02916000
TTCSVCW1 EQU   TTCSVCPL                                                 02917000
TTCSVCW2 EQU   TTCSVCPL+4                                               02918000
IEDTTCFD EQU   0                                                        02919000
IEDTTCQB EQU   0                                                        02920000
TTCQCB   EQU   IEDTTCQB                                                 02921000
TTCSCB   EQU   IEDTTCQB+12                                              02922000
IEDXRTDD EQU   0                                                        02923000
XRTDCODE EQU   IEDXRTDD                                                 02924000
XRTDADDR EQU   IEDXRTDD+3                                               02925000
XRTDPBDU EQU   IEDXRTDD+5                                               02926000
XRTDEND  EQU   IEDXRTDD+9                                               02927000
IEDXRTDP EQU   0                                                        02928000
FREEBUF  EQU   0                                                        02929000
IEDIAP03 EQU   0                                                        02930000
IEDQTNT  EQU   0                                                        02931000
IEDMVBFR EQU   0                                                        02932000
POSTWAIT EQU   0                                                        02933000
XLATE    EQU   0                                                        02934000
XLATEWD1 EQU   XLATE                                                    02935000
XLATETYP EQU   XLATEWD1                                                 02936000
XLATECT  EQU   XLATEWD1+1                                               02937000
XTABPT   EQU   XLATE+4                                                  02938000
XTABLE   EQU   0                                                        02939000
DATABYTE EQU   0                                                        02940000
DATASTNG EQU   0                                                        02941000
REGSAVE  EQU   0                                                        02942000
BACKSAVE EQU   REGSAVE+4                                                02943000
BDADDR   EQU   0                                                        02944000
ERRELMT  EQU   0                                                        02945000
ERRTYPE  EQU   ERRELMT                                                  02946000
ERRTTCIN EQU   ERRELMT+1                                                02947000
ERRFLAGS EQU   ERRELMT+3                                                02948000
ERRSNA   EQU   ERRFLAGS                                                 02949000
ERRTEST  EQU   ERRFLAGS                                                 02950000
ERRDATA  EQU   ERRELMT+4                                                02951000
RUBYTE1  EQU   0                                                        02952000
ENTNAME  EQU   0                                                        02953000
MSGAREA  EQU   0                                                        02954000
BYTENUM  EQU   0                                                        02955000
ALLOCBUF EQU   0                                                        02956000
IEDQTL   EQU   0                                                        02957000
QADDAFX  EQU   0                                                        02958000
QADDNDX  EQU   0                                                        02959000
QCBLDCB  EQU   0                                                        02960000
QREMELX  EQU   0                                                        02961000
QREMFRX  EQU   0                                                        02962000
TNTCODE  EQU   0                                                        02963000
TNTDCODE EQU   0                                                        02964000
LCBRSPIN EQU   LCBIOBSN                                                 02965000
LCBLUSNS EQU   LCBRSPIN+5                                               02966000
LCBSCPRS EQU   LCBRSPIN+9                                               02967000
LCBCSWU1 EQU   LCBSCPRS+2                                               02968000
LCBRSPFG EQU   LCBRSPIN+15                                              02969000
LCBCOREQ EQU   LCBTPCD                                                  02970000
@NM00152 EQU   LCBCPA+40                                                02971000
LCBQNX   EQU   LCBERCCW                                                 02972000
LCBQNXMN EQU   LCBQNX                                                   02973000
LCBCANCL EQU   LCBSAVSN                                                 02974000
LCBCANFG EQU   LCBCANCL                                                 02975000
PRFSHDR  EQU   IEDQPRF+42                                               02976000
FLC      EQU   PSA                                                      02977000
PSARSVTE EQU   PSARSVT                                                  02978000
REQLDATA EQU   REQDATA                                                  02979000
REQSDATA EQU   REQDATA                                                  02980000
TRMPRE1  EQU   TRMBYTE4                                                 02981000
TRMERLCK EQU   TRMPRE1                                                  02982000
TRMNCP1  EQU   TRMBYTE4                                                 02983000
TRMPRE   EQU   TRMBYTE3                                                 02984000
TRMNCP   EQU   TRMBYTE3                                                 02985000
TRMPU    EQU   TRMBYTE3                                                 02986000
TRMLU    EQU   TRMBYTE3                                                 02987000
TRMTDIFF EQU   TRMLU                                                    02988000
TRMLINK  EQU   TRMBYTE3                                                 02989000
WORKAREA EQU   WA1WRKSP                                                 02990000
ENTLEN   EQU   CONVIDX                                                  02991000
TESTCOMP EQU   TRANSLEN                                                 02992000
WRKAREA1 EQU   WA1WRKSP+43                                              02993000
CANLDATA EQU   DATASTNG+7                                               02994000
CANLNAM  EQU   CANLDATA                                                 02995000
CANLLAST EQU   CANLNAM+7                                                02996000
WRKOLTID EQU   DATASTNG                                                 02997000
SYNCELMT EQU   PARMLSP                                                  02998000
SYNCQCB  EQU   SYNCELMT                                                 02999000
SYNCPRI  EQU   SYNCELMT+4                                               03000000
SYNCLINK EQU   SYNCELMT+5                                               03001000
ERRRCRD  EQU   ERRDATA                                                  03002000
ERRBYTES EQU   ERRRCRD                                                  03003000
ERRBYTE2 EQU   ERRBYTES+1                                               03004000
ERRRQREJ EQU   ERRBYTE2                                                 03005000
ERRSNS   EQU   ERRRCRD+4                                                03006000
ERRSNAT  EQU   ERRDATA                                                  03007000
ERRSENSE EQU   ERRSNAT+3                                                03008000
OPCLNDAT EQU   REQDATA                                                  03009000
OPTTCIN  EQU   OPCLNDAT                                                 03010000
TESTCTR  EQU   OPCLNDAT+8                                               03011000
HDRLEN   EQU   TRANSLEN                                                 03012000
HLDTOTPT EQU   TABLPTR                                                  03013000
SCBRGSAV EQU   SCBEND                                                   03014000
TRMOPT   EQU   IEDQTRM+20                                               03015000
XRTDTEXT EQU   XRTDEND                                                  03016000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03017000
@NM00301 EQU   OPCLNDAT+2                                               03018000
ERRUSER  EQU   ERRSENSE+2                                               03019000
ERRMIN   EQU   ERRSENSE+1                                               03020000
ERRMAJ   EQU   ERRSENSE                                                 03021000
ERRRH    EQU   ERRSNAT                                                  03022000
ERRBYTE4 EQU   ERRBYTES+3                                               03023000
ERRBYTE3 EQU   ERRBYTES+2                                               03024000
@NM00300 EQU   ERRBYTE2                                                 03025000
@NM00299 EQU   ERRBYTE2                                                 03026000
ERRBYTE1 EQU   ERRBYTES                                                 03027000
CANLEND  EQU   CANLDATA+8                                               03028000
CANLFST7 EQU   CANLNAM                                                  03029000
@NM00293 EQU   TRMLINK                                                  03030000
TRMLSTAT EQU   TRMLINK                                                  03031000
TRMLINT  EQU   TRMLINK                                                  03032000
TRMEPMOD EQU   TRMLINK                                                  03033000
TRMLULOG EQU   TRMLU                                                    03034000
TRMINERR EQU   TRMLU                                                    03035000
TRMLUREQ EQU   TRMLU                                                    03036000
TRMSESRQ EQU   TRMLU                                                    03037000
TRMLUTM  EQU   TRMLU                                                    03038000
TRMLUIT  EQU   TRMLU                                                    03039000
TRMAUTO  EQU   TRMLU                                                    03040000
TRMPCONT EQU   TRMPU                                                    03041000
@NM00292 EQU   TRMPU                                                    03042000
TRMNCONT EQU   TRMNCP                                                   03043000
TRMQUCKN EQU   TRMNCP                                                   03044000
TRMSLOWN EQU   TRMNCP                                                   03045000
TRMSYGEN EQU   TRMNCP                                                   03046000
TRMNCPCL EQU   TRMNCP                                                   03047000
TRMIPLDM EQU   TRMNCP                                                   03048000
TRMINOUT EQU   TRMPRE                                                   03049000
TRMRDOUT EQU   TRMPRE                                                   03050000
TRMNLOUT EQU   TRMPRE                                                   03051000
TRMWROUT EQU   TRMPRE                                                   03052000
TRMASNXI EQU   TRMPRE                                                   03053000
TRMSTMM  EQU   TRMPRE                                                   03054000
TRMCMODE EQU   TRMPRE                                                   03055000
TRMSTPND EQU   TRMPRE                                                   03056000
@NM00291 EQU   TRMNCP1                                                  03057000
TRMINOP  EQU   TRMNCP1                                                  03058000
TRMLYNCH EQU   TRMPRE1                                                  03059000
TRMSPOUT EQU   TRMPRE1                                                  03060000
TRMQNPL  EQU   TRMPRE1                                                  03061000
TRMSPACT EQU   TRMPRE1                                                  03062000
TRMOCNI  EQU   TRMPRE1                                                  03063000
TRMSESSN EQU   TRMPRE1                                                  03064000
TRMCONT  EQU   TRMPRE1                                                  03065000
REQSTNT  EQU   REQSDATA+4                                               03066000
REQSTTE  EQU   REQSDATA                                                 03067000
REQLTNT  EQU   REQLDATA                                                 03068000
PSARSAV  EQU   PSARSVTE+60                                              03069000
PSARSTK  EQU   PSARSVTE+56                                              03070000
PSAESAV3 EQU   PSARSVTE+52                                              03071000
PSAESTK3 EQU   PSARSVTE+48                                              03072000
PSAESAV2 EQU   PSARSVTE+44                                              03073000
PSAESTK2 EQU   PSARSVTE+40                                              03074000
PSAESAV1 EQU   PSARSVTE+36                                              03075000
PSAESTK1 EQU   PSARSVTE+32                                              03076000
PSAPSAV  EQU   PSARSVTE+28                                              03077000
PSAPSTK  EQU   PSARSVTE+24                                              03078000
PSAMSAV  EQU   PSARSVTE+20                                              03079000
PSAMSTK  EQU   PSARSVTE+16                                              03080000
PSASSAV  EQU   PSARSVTE+12                                              03081000
PSASSTK  EQU   PSARSVTE+8                                               03082000
PSANSTK  EQU   PSARSVTE+4                                               03083000
PSACSTK  EQU   PSARSVTE                                                 03084000
@NM00160 EQU   LCBCANCL+3                                               03085000
LCBCANTH EQU   LCBCANCL+1                                               03086000
@NM00159 EQU   LCBCANFG                                                 03087000
LCBCANCD EQU   LCBCANFG                                                 03088000
@NM00158 EQU   LCBCANFG                                                 03089000
LCBCANEB EQU   LCBCANFG                                                 03090000
LCBCANXT EQU   LCBCANFG                                                 03091000
LCBUNADD EQU   LCBQNX+21                                                03092000
LCBUASZE EQU   LCBQNX+20                                                03093000
LCBDSTEA EQU   LCBQNX+16                                                03094000
@NM00157 EQU   LCBQNX+8                                                 03095000
LCBIOSBS EQU   LCBQNX+5                                                 03096000
@NM00156 EQU   LCBQNX+4                                                 03097000
LCBSTSAV EQU   LCBQNX+1                                                 03098000
@NM00155 EQU   LCBQNXMN                                                 03099000
LCBNX509 EQU   LCBQNXMN                                                 03100000
LCBNX162 EQU   LCBQNXMN                                                 03101000
LCBNX142 EQU   LCBQNXMN                                                 03102000
LCBNX064 EQU   LCBQNXMN                                                 03103000
@NM00154 EQU   @NM00152+4                                               03104000
LCBNCPPT EQU   @NM00152+1                                               03105000
@NM00153 EQU   @NM00152                                                 03106000
LCBWRSCH EQU   LCBCOREQ+8                                               03107000
LCBCQLNK EQU   LCBCOREQ+4                                               03108000
LCBCQELE EQU   LCBCOREQ                                                 03109000
LCBPAKCH EQU   LCBRSPIN+16                                              03110000
@NM00151 EQU   LCBRSPFG                                                 03111000
LCBRSRH  EQU   LCBRSPFG                                                 03112000
LCBEXPI  EQU   LCBRSPFG                                                 03113000
@NM00150 EQU   LCBRSPIN+12                                              03114000
LCBUSUE1 EQU   LCBCSWU1                                                 03115000
@NM00149 EQU   LCBCSWU1                                                 03116000
@NM00148 EQU   LCBSCPRS+1                                               03117000
LCBDFCMD EQU   LCBSCPRS                                                 03118000
LCBUSER  EQU   LCBLUSNS+2                                               03119000
LCBSMIN  EQU   LCBLUSNS+1                                               03120000
LCBSMAJ  EQU   LCBLUSNS                                                 03121000
LCBRHSV  EQU   LCBRSPIN+2                                               03122000
LCBSNS0  EQU   LCBRSPIN+1                                               03123000
@NM00147 EQU   LCBRSPIN                                                 03124000
@NM00298 EQU   REGSAVE+8                                                03125000
@NM00297 EQU   REGSAVE                                                  03126000
XRTDEXTR EQU   XRTDPBDU+3                                               03127000
XRTDSYSR EQU   XRTDPBDU+2                                               03128000
XRTDMODF EQU   XRTDPBDU+1                                               03129000
XRTDCMD0 EQU   XRTDPBDU                                                 03130000
XRTDREQ  EQU   XRTDCODE+2                                               03131000
XRTDMAIN EQU   XRTDCODE+1                                               03132000
XRTDNETS EQU   XRTDCODE                                                 03133000
TTCQSTCB EQU   TTCQCB+8                                                 03134000
TTCQBECB EQU   TTCQCB+4                                                 03135000
TTCQBELC EQU   TTCQCB+1                                                 03136000
TTCQBFLG EQU   TTCQCB                                                   03137000
@NM00296 EQU   IEDTTCFD                                                 03138000
@NM00295 EQU   IEDTTCPL+8                                               03139000
TTCLAST  EQU   TTCSVCW2                                                 03140000
TTCFIRST EQU   TTCSVCW1+1                                               03141000
TTCPCODE EQU   TTCSVCW1                                                 03142000
@NM00294 EQU   IEDTTCD                                                  03143000
TRMSUBST EQU   IEDNTRM+12                                               03144000
TRMTYPE  EQU   IEDNTRM+11                                               03145000
TRMRLMCT EQU   IEDNTRM+10                                               03146000
TRMCOHTG EQU   TRMSIBPT+1                                               03147000
TRMGPCNT EQU   TRMSIBPT                                                 03148000
TRMBUFRD EQU   TRMBYTE0                                                 03149000
TRMGP    EQU   TRMBYTE0                                                 03150000
TRMDIAL  EQU   TRMBYTE0                                                 03151000
@NM00290 EQU   TRMBYTE0                                                 03152000
TRMOUTPT EQU   TRMBYTE0                                                 03153000
TRMINPUT EQU   TRMBYTE0                                                 03154000
TRMUDEF  EQU   TRMBYTE0                                                 03155000
TRMCOHRT EQU   IEDNTRM+4                                                03156000
TRMSTOTE EQU   TRMBYTE1                                                 03157000
TRMCKPRN EQU   TRMBYTE1                                                 03158000
TRMTSATN EQU   TRMBYTE1                                                 03159000
TRMTRACE EQU   TRMBYTE1                                                 03160000
TRMSWBCK EQU   TRMBYTE1                                                 03161000
TRMAUTOC EQU   TRMBYTE1                                                 03162000
TRMINPTP EQU   TRMBYTE1                                                 03163000
TRMWTNEG EQU   TRMSCPRQ                                                 03164000
TRMWRBRK EQU   TRMBYTE2                                                 03165000
TRMNOSND EQU   TRMBYTE2                                                 03166000
TRMPREP  EQU   TRMBYTE2                                                 03167000
TRMGPACT EQU   TRMBYTE2                                                 03168000
TRMANDL  EQU   TRMBYTE2                                                 03169000
TRMCLOSN EQU   TRMINPG                                                  03170000
TRMREMB  EQU   TRMBYTE2                                                 03171000
TRMRSACT EQU   TRMBYTE2                                                 03172000
TRMOPTBL EQU   IEDQTRM+18                                               03173000
TRMOPNO  EQU   IEDQTRM+17                                               03174000
TRMSENSE EQU   TRMSTAT+3                                                03175000
TRMTEMPR EQU   TRMSTAT+2                                                03176000
TRMSIO   EQU   TRMSTAT                                                  03177000
@NM00289 EQU   TRMDEVFL+1                                               03178000
TRMTPIN  EQU   TRMDEVFL+1                                               03179000
TRMNCPI  EQU   TRMDEVFL+1                                               03180000
TRMRNTRM EQU   TRMDEVFL+1                                               03181000
@NM00288 EQU   TRMDEVFL+1                                               03182000
TRMLMD   EQU   TRMDEVFL+1                                               03183000
TRMTSOB  EQU   TRMDEVFL                                                 03184000
TRMBFDY  EQU   TRMDEVFL                                                 03185000
TRMTBLK  EQU   TRMDEVFL                                                 03186000
TRMSBLK  EQU   TRMDEVFL                                                 03187000
TRMBLKS  EQU   TRMDEVFL                                                 03188000
TRMADDC  EQU   TRMDEVFL                                                 03189000
TRMDDIG  EQU   TRMDEVFL                                                 03190000
TRMBUFS  EQU   TRMDEVFL                                                 03191000
TRMPRILK EQU   TRMALTD                                                  03192000
TRMLGB   EQU   TRMDSORG                                                 03193000
TRMUTERM EQU   TLISTCNT                                                 03194000
TRMSCNYN EQU   TRMSTATE                                                 03195000
TRMOPTFN EQU   TRMSTATE                                                 03196000
TRMHELDN EQU   TRMSTATE                                                 03197000
TRMACPTN EQU   TRMSTATE                                                 03198000
TRMPROC  EQU   TRMLOG                                                   03199000
TRMLIST  EQU   TRMLOG                                                   03200000
TRMLINE  EQU   TRMSTATE                                                 03201000
TNTLEN   EQU   IEDQTNTD+44                                              03202000
TNTMIDEN EQU   IEDQTNTD+41                                              03203000
TNTSRCHX EQU   IEDQTNTD+38                                              03204000
TTHDCF   EQU   IEDTH+8                                                  03205000
TTHTAG2  EQU   TTHTAG+1                                                 03206000
@NM00287 EQU   TTHTAG1                                                  03207000
TTHTAGS  EQU   TTHTAG1                                                  03208000
TTHOAF   EQU   IEDTH+4                                                  03209000
TTHDAF   EQU   IEDTH+2                                                  03210000
TTHBYTE1 EQU   IEDTH+1                                                  03211000
TTHEFI   EQU   TTHBYTE0                                                 03212000
@NM00286 EQU   TTHBYTE0                                                 03213000
TTHEBIU  EQU   TTHBYTE0                                                 03214000
TTHBBIU  EQU   TTHBYTE0                                                 03215000
TTHFTYPE EQU   TTHBYTE0                                                 03216000
SNSUSR2  EQU   SNSUSER+1                                                03217000
SNSUSR1  EQU   SNSUSER                                                  03218000
SNSMIN   EQU   SNSSYSTM+1                                               03219000
SNSMAJ   EQU   SNSSYSTM                                                 03220000
SCBTRANS EQU   IEDQSCB+81                                               03221000
SCBUNTCT EQU   IEDQSCB+80                                               03222000
SCBEOB   EQU   IEDQSCB+78                                               03223000
SCBNXCPB EQU   SCBCCSEG                                                 03224000
SCBNHDR  EQU   SCBCHDR                                                  03225000
SCBCRCD  EQU   IEDQSCB+69                                               03226000
SCBTQBCK EQU   SCBNTXT                                                  03227000
SCBOSEQ  EQU   SCBSCAN                                                  03228000
SCBXTRA  EQU   SCBCORE                                                  03229000
SCBNOPST EQU   SCBSTAT1                                                 03230000
SCBNIDLE EQU   SCBSTAT1                                                 03231000
SCBCEND  EQU   SCBSTAT1                                                 03232000
SCBCBGN  EQU   SCBSTAT1                                                 03233000
SCBSIZE  EQU   IEDQSCB+58                                               03234000
SCBSRCE  EQU   IEDQSCB+56                                               03235000
SCBDEOB  EQU   IEDQSCB+52                                               03236000
SCBFEFO  EQU   SCBDCSEG                                                 03237000
SCBCTBND EQU   SCBBLKCT                                                 03238000
SCBSCHDR EQU   SCBCLSEG                                                 03239000
SCBHBFNO EQU   IEDQSCB+44                                               03240000
SCBSCSEG EQU   SCBDNSEG                                                 03241000
SCBBCTR  EQU   SCBCTBSV                                                 03242000
SCBCCHDR EQU   IEDQSCB+37                                               03243000
SCBDESTL EQU   IEDQSCB+36                                               03244000
SCBDCHDR EQU   IEDQSCB+33                                               03245000
SCBCPBNO EQU   IEDQSCB+32                                               03246000
SCBMBSSA EQU   IEDQSCB+25                                               03247000
SCBMLMTN EQU   SCBBSCFM                                                 03248000
SCBNOEOT EQU   SCBBSCFM                                                 03249000
@NM00285 EQU   SCBBSCFM                                                 03250000
SCBNPDTR EQU   SCBDATEN                                                 03251000
SCBCNTEN EQU   SCBBSCFM                                                 03252000
SCBRCVTX EQU   SCBBSCFM                                                 03253000
SCBNONTR EQU   SCBBSCFM                                                 03254000
SCBTRNSP EQU   SCBBSCFM                                                 03255000
SCBENDCR EQU   SCBCTBAC+1                                               03256000
SCBCRLEN EQU   SCBCTBAC                                                 03257000
SCBMRFSD EQU   IEDQSCB+20                                               03258000
SCBUNDFN EQU   SCBERR4                                                  03259000
SCBSTERN EQU   SCBCHANN                                                 03260000
SCBCPMEN EQU   SCBCTLUN                                                 03261000
@NM00284 EQU   SCBERR4                                                  03262000
SCBTRMLN EQU   SCBERR4                                                  03263000
SCBCONNN EQU   SCBERR4                                                  03264000
SCBAPERR EQU   SCBTXTTN                                                 03265000
SCBSLCTN EQU   SCBERR4                                                  03266000
SCBPERRN EQU   SCBXCEPN                                                 03267000
SCBTHRSN EQU   SCBATTN                                                  03268000
SCBFIERN EQU   SCBFORMN                                                 03269000
SCBUSERN EQU   SCBERR3                                                  03270000
SCBSATTN EQU   SCBERR3                                                  03271000
SCBTMINN EQU   SCBERR3                                                  03272000
SCBXPD   EQU   SCBTMIDN                                                 03273000
SCBXPI   EQU   SCBLOSTN                                                 03274000
SCBSOHE  EQU   SCBERR2                                                  03275000
SCBFRWDN EQU   SCBERR2                                                  03276000
SCBRRJN  EQU   SCBABRTN                                                 03277000
SCBOLTR  EQU   SCBERR2                                                  03278000
SCBALN   EQU   SCBERR2                                                  03279000
SCBCODER EQU   SCBERR2                                                  03280000
SCBCRMAX EQU   SCBERR2                                                  03281000
SCBCRMIN EQU   SCBERR2                                                  03282000
SCBRVISL EQU   SCBCUTFN                                                 03283000
SCBNOBFN EQU   SCBERR1                                                  03284000
@NM00283 EQU   SCBERR1                                                  03285000
SCBNOVAC EQU   SCBSEQLN                                                 03286000
SCBNOTSO EQU   SCBSEQHN                                                 03287000
SCBRVITX EQU   SCBNOTRM                                                 03288000
SCBHANG  EQU   SCBORIGN                                                 03289000
SCBNOLOG EQU   SCBHDRRN                                                 03290000
SCBMRFPL EQU   IEDQSCB+13                                               03291000
SCBBFMM  EQU   SCBQTYPE                                                 03292000
SCBBBFTM EQU   SCBQTYPE                                                 03293000
SCBNOFF  EQU   SCBQTYPE                                                 03294000
SCBCONC  EQU   SCBQTYPE                                                 03295000
SCBNREUS EQU   SCBQTYPE                                                 03296000
SCBREUS  EQU   SCBQTYPE                                                 03297000
SCBCOREQ EQU   SCBQTYPE                                                 03298000
SCBNORCL EQU   SCBQTYPE                                                 03299000
SCBCTBSZ EQU   SCBEOBSZ                                                 03300000
@NM00282 EQU   SCBBKFCT                                                 03301000
SCBPRI   EQU   IEDQSCB+8                                                03302000
SCBSNDCT EQU   SCBRCVCT                                                 03303000
SCBCODE  EQU   SCBSTATE                                                 03304000
SCBPRER  EQU   SCBSTATE                                                 03305000
SCBCKPT  EQU   SCBSTATE                                                 03306000
SCBMSGLN EQU   SCBSTATE                                                 03307000
SCBERSDS EQU   SCBSTATE                                                 03308000
SCBLCK1N EQU   SCBSTATE                                                 03309000
SCBMGFMN EQU   SCBSEQIN                                                 03310000
SCBTRANP EQU   SCBSTATE                                                 03311000
@NM00281 EQU   TRHBYTE2                                                 03312000
@NM00280 EQU   TRHBYTE2                                                 03313000
@NM00279 EQU   TRHBYTE2                                                 03314000
TRHCSI   EQU   TRHBYTE2                                                 03315000
@NM00278 EQU   TRHBYTE2                                                 03316000
TRHCDI   EQU   TRHBYTE2                                                 03317000
TRHEB    EQU   TRHBYTE2                                                 03318000
TRHBB    EQU   TRHBYTE2                                                 03319000
TRHPI    EQU   TRHBYTE1                                                 03320000
@NM00277 EQU   TRHBYTE1                                                 03321000
@NM00276 EQU   TRHBYTE1                                                 03322000
@NM00275 EQU   TRHBYTE1                                                 03323000
TRHER    EQU   TRHBYTE1                                                 03324000
TRHDR2   EQU   TRHBYTE1                                                 03325000
@NM00274 EQU   TRHBYTE1                                                 03326000
TRHDR1   EQU   TRHBYTE1                                                 03327000
TRHEC    EQU   TRHBYTE0                                                 03328000
TRHBC    EQU   TRHBYTE0                                                 03329000
TRHSDI   EQU   TRHBYTE0                                                 03330000
TRHFI    EQU   TRHBYTE0                                                 03331000
@NM00273 EQU   TRHBYTE0                                                 03332000
TRHRUCAT EQU   TRHBYTE0                                                 03333000
TRHTYPE  EQU   TRHBYTE0                                                 03334000
RESAPDCB EQU   IEDRESPL+180                                             03335000
RESTLIB  EQU   IEDRESPL+176                                             03336000
RESPL33  EQU   RESPLADR+76                                              03337000
RESPL25  EQU   RESPLADR+72                                              03338000
RESPLM2  EQU   RESPLADR+68                                              03339000
RESPL47  EQU   RESPLADR+64                                              03340000
RESPL44  EQU   RESPLADR+60                                              03341000
RESPL43  EQU   RESPL42                                                  03342000
RESPL16  EQU   RESPLADR+52                                              03343000
RESPL41  EQU   RESPLADR+48                                              03344000
RESPL21  EQU   RESPLAC                                                  03345000
RESPL36  EQU   RESPLADR+40                                              03346000
RESPL28  EQU   RESPLADR+36                                              03347000
RESPL37  EQU   RESPLADR+32                                              03348000
RESPLP2  EQU   RESPLADR+28                                              03349000
RESPLP1  EQU   RESPLADR+24                                              03350000
RESPL39  EQU   RESPLADR+20                                              03351000
RESPLAA  EQU   RESPLADR+16                                              03352000
RESPL35  EQU   RESPLADR+12                                              03353000
RESPLAJ  EQU   RESPLADR+8                                               03354000
RESPLAB  EQU   RESPLADR+4                                               03355000
RESPLWO  EQU   RESPLADR                                                 03356000
RESTOTMH EQU   IEDRESPL+92                                              03357000
RESMHNAT EQU   IEDRESPL+90                                              03358000
RESMHSRC EQU   IEDRESPL+88                                              03359000
RESTNTPT EQU   IEDRESPL+57                                              03360000
@NM00272 EQU   IEDRESPL+56                                              03361000
@NM00271 EQU   IEDRESPL+50                                              03362000
@NM00270 EQU   RESFLAGS                                                 03363000
RESFIRST EQU   RESFLAGS                                                 03364000
RESINIT  EQU   RESFLAGS                                                 03365000
RESWBFNC EQU   IEDRESPL+48                                              03366000
RESSMGRA EQU   IEDRESPL+44                                              03367000
RESSTAEA EQU   IEDRESPL+40                                              03368000
RESETXRA EQU   IEDRESPL+36                                              03369000
RESDMTTE EQU   IEDRESPL+33                                              03370000
RESTNTCT EQU   IEDRESPL+32                                              03371000
RESEFQCB EQU   IEDRESPL+28                                              03372000
RESBKAVL EQU   IEDRESPL+26                                              03373000
RESTTLST EQU   IEDRESPL+20                                              03374000
RESOBBKW EQU   RESOBQCB+4                                               03375000
RESTECB1 EQU   IEDRESPL+8                                               03376000
@NM00269 EQU   IEDRESPL+5                                               03377000
@NM00268 EQU   IEDRESPL+4                                               03378000
RESTECBS EQU   IEDRESPL                                                 03379000
REQRCD2  EQU   REQRCDS+1                                                03380000
REQRCD1  EQU   REQRCDS                                                  03381000
REQSWTCH EQU   REQROUTE+1                                               03382000
REQFLAG  EQU   REQROUTE                                                 03383000
REQTYPE  EQU   IEDREQD                                                  03384000
QCBTTCIN EQU   QCBPLCBA+1                                               03385000
@NM00267 EQU   QCBPLCBA                                                 03386000
@NM00266 EQU   QCBSTAT1                                                 03387000
QCBFLUSH EQU   QCBSTAT1                                                 03388000
QCBNDXRQ EQU   QCBSTAT1                                                 03389000
QCBESIG  EQU   QCBSTAT1                                                 03390000
QCBRCVRQ EQU   QCBSTAT1                                                 03391000
QCBSNDRQ EQU   QCBSTAT1                                                 03392000
QCBWAITC EQU   QCBSTAT1                                                 03393000
QCBPLCBN EQU   QCBSTAT1                                                 03394000
QCBCHAIN EQU   IEDNQCB                                                  03395000
QCBPQBCK EQU   IEDQPQCB+25                                              03396000
QCBPRIPQ EQU   IEDQPQCB+24                                              03397000
QCBCFHDR EQU   IEDQPQCB+21                                              03398000
QCBLFEFO EQU   IEDQPQCB+18                                              03399000
QCBFFEFO EQU   IEDQPQCB+15                                              03400000
QCBPREVF EQU   QCBINTLF                                                 03401000
QCBINTFF EQU   IEDQPQCB+9                                               03402000
QCBDATSQ EQU   QCBFHDTZ+1                                               03403000
@NM00265 EQU   QCBFHDTZ                                                 03404000
@NM00264 EQU   QCBPFEFO                                                 03405000
QCBDATFL EQU   QCBFHDLZ                                                 03406000
QCBDNHDR EQU   IEDQPQCB                                                 03407000
QCBQBACK EQU   IEDQQCB+37                                               03408000
QCBCKPT  EQU   QCBFLAG                                                  03409000
QCBPROC  EQU   QCBFLAG                                                  03410000
QCBSDFFO EQU   QCBFLAG                                                  03411000
QCBTERMQ EQU   QCBFLAG                                                  03412000
QCBRSRV  EQU   QCBFLAG                                                  03413000
QCBREAD  EQU   QCBFLAG                                                  03414000
QCBNOBRK EQU   QCBFLAG                                                  03415000
QCBLGBAD EQU   QCBDCBAD                                                 03416000
QCBRELLN EQU   IEDQQCB+32                                               03417000
QCBTJID  EQU   QCBLKRRN+1                                               03418000
QCBCARCT EQU   QCBLKRRN                                                 03419000
QCBPRLVL EQU   QCBPREN                                                  03420000
QCBMSGCT EQU   IEDQQCB+26                                               03421000
QCBEXTO  EQU   QCBINTVL                                                 03422000
QCBDISC  EQU   QCBTSOF1                                                 03423000
QCBDELAY EQU   QCBTSOF1                                                 03424000
QCBPARTO EQU   QCBTSOF1                                                 03425000
QCBSATRD EQU   QCBTSOF1                                                 03426000
QCBNOBUF EQU   QCBTSOF1                                                 03427000
QCBTPUT  EQU   QCBTSOF1                                                 03428000
QCBTGET  EQU   QCBTSOF1                                                 03429000
QCBWRBRK EQU   QCBTSOF1                                                 03430000
QCBSATLC EQU   QCBTSOF2                                                 03431000
QCBSATTI EQU   QCBTSOF2                                                 03432000
QCBSATCH EQU   QCBTSOF2                                                 03433000
QCBSIMRD EQU   QCBTSOF2                                                 03434000
QCBDSSMI EQU   QCBTSOF2                                                 03435000
QCBPOSTO EQU   QCBTSOF2                                                 03436000
QCBBUFQ  EQU   QCBTSOF2                                                 03437000
QCBINHBN EQU   QCBTSOF2                                                 03438000
QCBSATCT EQU   @NM00263                                                 03439000
QCBSCBOF EQU   IEDQQCB+20                                               03440000
QCBTIME  EQU   QCBSTAT                                                  03441000
QCBCLOCK EQU   QCBSTAT                                                  03442000
QCBSCHDL EQU   QCBSTAT                                                  03443000
QCBSMODE EQU   QCBSTAT                                                  03444000
QCBSEND  EQU   QCBSTAT                                                  03445000
QCBBUFRD EQU   QCBSTAT                                                  03446000
QCBTRMHO EQU   QCBSTAT                                                  03447000
QCBEOM   EQU   QCBSTAT                                                  03448000
QCBHUCT  EQU   QCBRETCT                                                 03449000
QCBIEND  EQU   QCBRETCT                                                 03450000
QCBEND   EQU   QCBRETCT                                                 03451000
QCBNL    EQU   QCBRETCT                                                 03452000
QCBLOGCT EQU   QCBRETCT                                                 03453000
@NM00262 EQU   QCBBYTE1                                                 03454000
QCBRITRM EQU   QCBBYTE1                                                 03455000
@NM00261 EQU   QCBEOLDT                                                 03456000
QCBSLINK EQU   IEDQQCB+13                                               03457000
QCBSTPRI EQU   IEDQQCB+12                                               03458000
QCBSTCHN EQU   IEDQQCB+9                                                03459000
QCBSTVTO EQU   IEDQQCB+8                                                03460000
QCBLINK  EQU   IEDQQCB+5                                                03461000
QCBPRI   EQU   IEDQQCB+4                                                03462000
QCBCNTEN EQU   QCBELCHN+2                                               03463000
@NM00260 EQU   QCBELCHN+2                                               03464000
@NM00259 EQU   QCBELCHN                                                 03465000
QCBHELD  EQU   QCBDSFLG                                                 03466000
QCBFQCB  EQU   QCBDSFLG                                                 03467000
QCBDRQQ  EQU   QCBDSFLG                                                 03468000
QCBALTMH EQU   QCBDSFLG                                                 03469000
QCBTSQ   EQU   QCBDSFLG                                                 03470000
PRF2SEQP EQU   PRF2WD2                                                  03471000
@NM00234 EQU   IEDPF2+1                                                 03472000
@NM00233 EQU   PRF2FLG2                                                 03473000
PRF2TERM EQU   PRF2FLG2                                                 03474000
PRF2SMI  EQU   PRF2FLG2                                                 03475000
PRF2FORM EQU   PRF2FLG2                                                 03476000
PRF2TNTI EQU   PRF2FLG2                                                 03477000
PRF1RULN EQU   PRF1SEQP+2                                               03478000
PRF1TAG2 EQU   PRF1SQID+1                                               03479000
@NM00232 EQU   PRF1TAG1                                                 03480000
PRF1TAGS EQU   PRF1TAG1                                                 03481000
@NM00231 EQU   PRF1FLG1                                                 03482000
PRF1LOGD EQU   PRF1FLG1                                                 03483000
PRF1USS  EQU   PRF1FLG1                                                 03484000
PRF1EXPI EQU   PRF1FLG1                                                 03485000
PRFISEQ  EQU   IEDQPRF+38                                               03486000
PRFSTXT  EQU   PRFHQBCK                                                 03487000
PRFNHDR  EQU   PRFCHDR                                                  03488000
PRFCRCD  EQU   IEDQPRF+29                                               03489000
PRFSVSEQ EQU   PRFNTXT+1                                                03490000
PRFSVPRI EQU   PRFEOBOF                                                 03491000
PRFISIZE EQU   PRFSCAN+1                                                03492000
@NM00230 EQU   PRFSCAN                                                  03493000
PRFEOB   EQU   PRFXTRA+1                                                03494000
PRFSTSO  EQU   PRFXTRA                                                  03495000
PRFLOCK  EQU   PRFEOFN                                                  03496000
PRFDUPLN EQU   PRFSTAT1                                                 03497000
PRFTSMSG EQU   PRFSTAT1                                                 03498000
PRFITCPN EQU   PRFSTAT1                                                 03499000
PRFCNCLN EQU   PRFSTAT1                                                 03500000
PRFSVFLG EQU   @NM00229+3                                               03501000
PRFPIUO  EQU   PRFPLQCB                                                 03502000
PRFTI0   EQU   PRFTIC+1                                                 03503000
@NM00228 EQU   PRFTICC                                                  03504000
@NM00227 EQU   PRFTICC                                                  03505000
@NM00226 EQU   PRFTICC                                                  03506000
PRFTICON EQU   PRFTICC                                                  03507000
@NM00225 EQU   PRFTICC                                                  03508000
@NM00224 EQU   PRFTICC                                                  03509000
PRFBFMM  EQU   PRFTICC                                                  03510000
PRFEOMSG EQU   PRFTICC                                                  03511000
PRFCOUNT EQU   PRFLINK+1                                                03512000
@NM00223 EQU   PRFLINK                                                  03513000
PRFFLAGS EQU   PRFPRI                                                   03514000
PRFIOADR EQU   PRFQCBA                                                  03515000
PRFOPCDE EQU   PRFKEY                                                   03516000
PLMVUNCA EQU   IEDPLMV+20                                               03517000
PLMVFLG2 EQU   IEDPLMV+19                                               03518000
@NM00222 EQU   PLMVFLG1                                                 03519000
PLMVUNCF EQU   PLMVFLG1                                                 03520000
TOTOBEND EQU   TOTOLTCB+2108                                            03521000
TOTSERV  EQU   TOTOLTCB+2104                                            03522000
@NM00221 EQU   TOTOLTCB+2052                                            03523000
TOTWOWRK EQU   TOTOLTCB+1912                                            03524000
TOTWAWRK EQU   TOTOLTCB+1832                                            03525000
TOTOLTEN EQU   TOTOLTCB+1828                                            03526000
TOTAPNAM EQU   TOTOLTCB+1820                                            03527000
TOTGRABP EQU   TOTOLTCB+1816                                            03528000
TOTWAITI EQU   TOTOLTCB+1808                                            03529000
@NM00220 EQU   TOTOLTCB+1806                                            03530000
TOTTLCNT EQU   TOTOLTCB+1804                                            03531000
TOTECBPT EQU   TOTOLTCB+1800                                            03532000
TOTWECBA EQU   TOTOLTCB+1796                                            03533000
TOTTDEND EQU   TOTOLTCB+1796                                            03534000
@NM00219 EQU   TOTTDTBL+1                                               03535000
TOTTSWPM EQU   @NM00218                                                 03536000
TOTTDIAC EQU   @NM00218                                                 03537000
TOTTDTHD EQU   @NM00218                                                 03538000
TOTTDLST EQU   @NM00218                                                 03539000
TOTTDORN EQU   @NM00218                                                 03540000
TOTTDGRB EQU   @NM00218                                                 03541000
TOTTDLIN EQU   @NM00218                                                 03542000
TOTTDTRM EQU   @NM00218                                                 03543000
@NM00217 EQU   TOTOLTCB+1718                                            03544000
TOTCONND EQU   TOTOLTCB+1718                                            03545000
TOTCONAP EQU   TOTOLTCB+1717                                            03546000
TOTCONCT EQU   TOTOLTCB+1716                                            03547000
TOTCONTB EQU   TOTOLTCB+1706                                            03548000
TOTOLTTE EQU   TOTOLTCB+1706                                            03549000
TOTOLTTB EQU   TOTOLTCB+1676                                            03550000
TOTTRMND EQU   TOTCROLT                                                 03551000
TOTSCDEB EQU   TOTSCDCB+44                                              03552000
@NM00216 EQU   TOTSCDCB                                                 03553000
TOTSCIOB EQU   TOTOLTCB+1552                                            03554000
TOTSTECB EQU   TOTOLTCB+1548                                            03555000
@NM00215 EQU   TOTSCSN                                                  03556000
@NM00214 EQU   TOTOLTCB+1543                                            03557000
TOTSFLGS EQU   TOTOLTCB+1542                                            03558000
TOTSDTCT EQU   TOTOLTCB+1540                                            03559000
TOTSDTBF EQU   TOTOLTCB+1536                                            03560000
TOTSCCCW EQU   TOTSCENT+28                                              03561000
TOTSCQCB EQU   TOTSCENT+24                                              03562000
@NM00213 EQU   TOTSCENT+23                                              03563000
@NM00212 EQU   TOTSCFLG                                                 03564000
TOTSEXNM EQU   TOTSCFLG                                                 03565000
TOTSCFME EQU   TOTSCFLG                                                 03566000
TOTSCEX  EQU   TOTSCFLG                                                 03567000
TOTSUNRD EQU   TOTSCFLG                                                 03568000
TOTSPRSC EQU   TOTSCFLG                                                 03569000
TOTSCLU  EQU   TOTSCFLG                                                 03570000
TOTSCTAS EQU   TOTSCFLG                                                 03571000
TOTSCLEN EQU   TOTSCENT+20                                              03572000
TOTSRTNT EQU   TOTSCENT+16                                              03573000
TOTSDTNT EQU   TOTSCENT+12                                              03574000
TOTSCLCB EQU   TOTSCENT+9                                               03575000
TOTSCRLN EQU   TOTSCENT+8                                               03576000
TOTSRSID EQU   TOTSCENT+6                                               03577000
TOTSCUCB EQU   TOTSCENT                                                 03578000
TOTSCIBK EQU   TOTSCECB                                                 03579000
TOTPRDEB EQU   TOTPRDCB+44                                              03580000
@NM00211 EQU   TOTPRDCB                                                 03581000
TOTPRIOB EQU   TOTOLTCB+1380                                            03582000
TOTPTECB EQU   TOTOLTCB+1376                                            03583000
@NM00210 EQU   TOTPRSN                                                  03584000
@NM00209 EQU   TOTOLTCB+1371                                            03585000
TOTPFLGS EQU   TOTOLTCB+1370                                            03586000
TOTPDTCT EQU   TOTOLTCB+1368                                            03587000
TOTPDTBF EQU   TOTOLTCB+1364                                            03588000
TOTPRCCW EQU   TOTPRENT+28                                              03589000
TOTPRQCB EQU   TOTPRENT+24                                              03590000
@NM00208 EQU   TOTPRENT+23                                              03591000
@NM00207 EQU   TOTPRFLG                                                 03592000
TOTPEXNM EQU   TOTPRFLG                                                 03593000
TOTPRFME EQU   TOTPRFLG                                                 03594000
TOTPREX  EQU   TOTPRFLG                                                 03595000
TOTPUNRD EQU   TOTPRFLG                                                 03596000
TOTPPRSC EQU   TOTPRFLG                                                 03597000
TOTPRLU  EQU   TOTPRFLG                                                 03598000
TOTPRTAS EQU   TOTPRFLG                                                 03599000
TOTPRLEN EQU   TOTPRENT+20                                              03600000
TOTTNTPR EQU   TOTPRENT+16                                              03601000
TOTPDTNT EQU   TOTPRENT+12                                              03602000
TOTPRLCB EQU   TOTPRENT+9                                               03603000
TOTPRRLN EQU   TOTPRENT+8                                               03604000
TOTPRSID EQU   TOTPRENT+6                                               03605000
TOTPRUCB EQU   TOTPRENT                                                 03606000
TOTTRMBF EQU   TOTPRIBK                                                 03607000
TOTPASS  EQU   TOTOLTCB+1260                                            03608000
TOTEXT   EQU   TOTOLTCB+1204                                            03609000
@NM00206 EQU   TOTOLTCB+1203                                            03610000
TOTTTBEL EQU   TOTOLTCB+1202                                            03611000
TOTOLTRS EQU   TOTFLG10                                                 03612000
TOTOLTWT EQU   TOTFLG10                                                 03613000
TOTTNTRQ EQU   TOTFLG10                                                 03614000
@NM00205 EQU   TOTFLG10                                                 03615000
@NM00204 EQU   TOTFLG10                                                 03616000
@NM00203 EQU   TOTFLG10                                                 03617000
TOTTERMS EQU   TOTFLG10                                                 03618000
TOTMACFT EQU   TOTFLG09                                                 03619000
TOTPRECT EQU   TOTFLG09                                                 03620000
TOTLNCON EQU   TOTFLG09                                                 03621000
TOTNOBRK EQU   TOTFLG09                                                 03622000
TOTAPTRM EQU   TOTFLG09                                                 03623000
TOTCTCON EQU   TOTFLG09                                                 03624000
TOTAPOUT EQU   TOTFLG09                                                 03625000
TOTAPCON EQU   TOTFLG09                                                 03626000
@NM00202 EQU   TOTFLG08                                                 03627000
TOTFMCTL EQU   TOTFLG08                                                 03628000
TOTMSSRC EQU   TOTFLG07                                                 03629000
TOTMSPRT EQU   TOTFLG07                                                 03630000
TOTMSREP EQU   TOTFLG07                                                 03631000
TOTMSCEC EQU   TOTFLG07                                                 03632000
@NM00201 EQU   TOTFLG07                                                 03633000
@NM00200 EQU   TOTFLG07                                                 03634000
TOTSECEX EQU   TOTFLG07                                                 03635000
TOTPRIEX EQU   TOTFLG07                                                 03636000
TOTNPERR EQU   TOTFLG06                                                 03637000
TOTABEND EQU   TOTFLG06                                                 03638000
TOTNCMFG EQU   TOTFLG06                                                 03639000
TOTCBOPN EQU   TOTFLG06                                                 03640000
TOTOTERM EQU   TOTFLG06                                                 03641000
TOTNDMSG EQU   TOTFLG05                                                 03642000
TOTEXIOF EQU   TOTFLG05                                                 03643000
TOTTMOUT EQU   TOTFLG05                                                 03644000
TOTSRCON EQU   TOTFLG05                                                 03645000
TOTSRCE  EQU   TOTFLG05                                                 03646000
TOTREPLY EQU   TOTFLG05                                                 03647000
TOTCECOM EQU   TOTFLG05                                                 03648000
TOTPRINT EQU   TOTFLG05                                                 03649000
TOTTTSWT EQU   TOTFLG04                                                 03650000
@NM00199 EQU   TOTFLG04                                                 03651000
@NM00198 EQU   TOTFLG04                                                 03652000
TOTSCCTF EQU   TOTFLG04                                                 03653000
TOTPRCTF EQU   TOTFLG04                                                 03654000
TOTCLOSE EQU   TOTFLG04                                                 03655000
TOTDTCHD EQU   TOTFLG04                                                 03656000
TOTNUMDV EQU   TOTFLG04                                                 03657000
@NM00197 EQU   TOTFLG03                                                 03658000
TOTTSINC EQU   TOTFLG03                                                 03659000
TOTIMNCP EQU   TOTFLG03                                                 03660000
TOTOPTER EQU   TOTFLG03                                                 03661000
TOTTSTER EQU   TOTFLG03                                                 03662000
TOTTDFER EQU   TOTFLG03                                                 03663000
TOTAPOER EQU   TOTFLG03                                                 03664000
TOTDEVRN EQU   TOTFLG02                                                 03665000
TOTCONCU EQU   TOTFLG02                                                 03666000
TOTCONMD EQU   TOTFLG02                                                 03667000
TOTCHKSZ EQU   TOTFLG02                                                 03668000
TOTOLTRQ EQU   TOTFLG02                                                 03669000
TOTDEV0X EQU   TOTFLG02                                                 03670000
TOTTSST  EQU   TOTFLG02                                                 03671000
TOTTTSPE EQU   TOTFLG02                                                 03672000
TOTPRMPT EQU   TOTFLG01                                                 03673000
TOTAPTST EQU   TOTFLG01                                                 03674000
TOTEXIT  EQU   TOTFLG01                                                 03675000
TOTIPLCU EQU   TOTFLG01                                                 03676000
TOTFINAL EQU   TOTFLG01                                                 03677000
TOTRESPL EQU   TOTOLTCB+1188                                            03678000
TOTSTAE  EQU   TOTOLTCB+1184                                            03679000
TOTAVTPT EQU   TOTOLTCB+1180                                            03680000
@NM00196 EQU   TOTOLTCB+1160                                            03681000
TOTWKEND EQU   TOTOLTCB+1160                                            03682000
TOTWKSPC EQU   TOTOLTCB+1032                                            03683000
@NM00195 EQU   TOTOLTCB+1028                                            03684000
TOTPLBKW EQU   TOTPLNKQ+4                                               03685000
TOTPLFWD EQU   TOTPLNKQ                                                 03686000
@NM00194 EQU   TOTOLTCB+1019                                            03687000
TOTRTCOD EQU   TOTOLTCB+1018                                            03688000
TOTINBUF EQU   TOTWTOPL+88                                              03689000
TOTOTBUF EQU   TOTWTOPL+4                                               03690000
@NM00193 EQU   TOTWTOPL+2                                               03691000
TOTOTCNT EQU   TOTWTOPL+1                                               03692000
@NM00192 EQU   TOTWTOPL                                                 03693000
TOTINECB EQU   TOTWTORP+4                                               03694000
TOTINADR EQU   TOTWTORP+1                                               03695000
TOTINCNT EQU   TOTWTORP                                                 03696000
TOT#TBLE EQU   TOTOLTPL+8                                               03697000
@NM00191 EQU   TOTOLTPL                                                 03698000
TOTRESSV EQU   TOTOLTCB+816                                             03699000
TOTPARML EQU   TOTOLTCB+804                                             03700000
TOTPDECB EQU   TOTOLTCB+784                                             03701000
TOTAPDCB EQU   TOTOLTCB+780                                             03702000
@NM00190 EQU   TOTOLTCB+776                                             03703000
@NM00189 EQU   TOTAPDFL                                                 03704000
TOTAPIAC EQU   TOTAPDFL                                                 03705000
TOTAPHD  EQU   TOTAPDFL                                                 03706000
TOTAPLST EQU   TOTAPDFL                                                 03707000
TOTAPGP  EQU   TOTAPDFL                                                 03708000
@NM00188 EQU   TOTAPDFL                                                 03709000
TOTAPLIN EQU   TOTAPDFL                                                 03710000
TOTAPTER EQU   TOTAPDFL                                                 03711000
TOTAPRNL EQU   TOTAPENT+23                                              03712000
TOTAPEND EQU   TOTAPENT+23                                              03713000
TOTAPSWD EQU   TOTAPFLG                                                 03714000
@NM00187 EQU   TOTAPFLG                                                 03715000
TOTAPORN EQU   TOTAPFLG                                                 03716000
TOTAPASN EQU   TOTAPFLG                                                 03717000
TOTAPTLN EQU   TOTAPENT+20                                              03718000
TOTARTNT EQU   TOTAPENT+16                                              03719000
TOTAPTNT EQU   TOTAPENT+12                                              03720000
TOTAPLCB EQU   TOTAPENT+9                                               03721000
TOTAPRLN EQU   TOTAPENT+8                                               03722000
TOTARSID EQU   TOTAPENT+6                                               03723000
TOTAPUCB EQU   TOTAPENT                                                 03724000
TOTUSCOR EQU   TOTOLTCB+740                                             03725000
@NM00186 EQU   TOTOLTCB+698                                             03726000
TOTOALTT EQU   TOTOLTCB+696                                             03727000
TOTOLADR EQU   TOTPLIST+16                                              03728000
@NM00185 EQU   TOTOECBA+1                                               03729000
@NM00184 EQU   TOTOFLG                                                  03730000
TOTOATTC EQU   TOTOFLG                                                  03731000
TOTORTCD EQU   TOTPLIST+11                                              03732000
TOTORLN  EQU   TOTPLIST+10                                              03733000
TOTOELNG EQU   TOTPLIST+9                                               03734000
TOTOVBCD EQU   TOTPLIST+8                                               03735000
TOTOLINK EQU   TOTPLIST+5                                               03736000
TOTOPRI  EQU   TOTPLIST+4                                               03737000
TOTOQCBA EQU   TOTPLIST+1                                               03738000
TOTOKEY  EQU   TOTPLIST                                                 03739000
TOTWOOPC EQU   TOTOLTCB+648                                             03740000
TOTCURS4 EQU   TOTCUTST+11                                              03741000
TOTCURS3 EQU   TOTCUTST+10                                              03742000
TOTCURS2 EQU   TOTCUTST+9                                               03743000
TOTCURS1 EQU   TOTCUTST+8                                               03744000
TOTCUSAV EQU   TOTCUTST+4                                               03745000
TOTCUCUU EQU   TOTCUTST+2                                               03746000
TOTCU#AD EQU   TOTCUTST+1                                               03747000
@NM00183 EQU   TOTCUFLG                                                 03748000
TOTCUCUP EQU   TOTCUFLG                                                 03749000
TOTCUDON EQU   TOTCUFLG                                                 03750000
@NM00182 EQU   TOTOLTCB+633                                             03751000
@NM00181 EQU   TOTCTDFL                                                 03752000
TOTCTIAC EQU   TOTCTDFL                                                 03753000
TOTCTHD  EQU   TOTCTDFL                                                 03754000
TOTCTLST EQU   TOTCTDFL                                                 03755000
TOTCTGP  EQU   TOTCTDFL                                                 03756000
@NM00180 EQU   TOTCTDFL                                                 03757000
TOTCTLIN EQU   TOTCTDFL                                                 03758000
TOTCTTRM EQU   TOTCTDFL                                                 03759000
TOTCTRNL EQU   TOTCTENT+23                                              03760000
TOTCTEND EQU   TOTCTENT+23                                              03761000
TOTCTSWD EQU   TOTCTFLG                                                 03762000
@NM00179 EQU   TOTCTFLG                                                 03763000
TOTCTORN EQU   TOTCTFLG                                                 03764000
TOTCTASN EQU   TOTCTFLG                                                 03765000
TOTCTTLN EQU   TOTCTENT+20                                              03766000
TOTCRTNT EQU   TOTCTENT+16                                              03767000
TOTCTTNT EQU   TOTCTENT+12                                              03768000
TOTCTLCB EQU   TOTCTENT+9                                               03769000
TOTCTRLN EQU   TOTCTENT+8                                               03770000
TOTCRSID EQU   TOTCTENT+6                                               03771000
TOTCTUCB EQU   TOTCTENT                                                 03772000
TOTSRLCB EQU   TOTSRENT+4                                               03773000
@NM00178 EQU   TOTSRENT+2                                               03774000
TOTMMSPC EQU   TOTOLTCB+580                                             03775000
TOTBKRQD EQU   TOTOLTCB+578                                             03776000
TOTBKASN EQU   TOTOLTCB+576                                             03777000
TOTSVEND EQU   TOTOLTCB+576                                             03778000
TOTWOSV4 EQU   TOTOLTCB+572                                             03779000
TOTWOSV3 EQU   TOTOLTCB+568                                             03780000
TOTWOSV2 EQU   TOTOLTCB+564                                             03781000
TOTWOSV1 EQU   TOTOLTCB+560                                             03782000
TOTSAVE6 EQU   TOTOLTCB+488                                             03783000
@NM00177 EQU   TOTSAVE5+68                                              03784000
TOTOLTEP EQU   TOTSAVE5+64                                              03785000
@NM00176 EQU   TOTSAVE5+48                                              03786000
TOTOLTPT EQU   TOTSAVE5+44                                              03787000
@NM00175 EQU   TOTSAVE5                                                 03788000
TOTSAVE4 EQU   TOTOLTCB+344                                             03789000
TOTSAVE3 EQU   TOTOLTCB+272                                             03790000
TOTSAVE2 EQU   TOTOLTCB+200                                             03791000
TOTSAVE1 EQU   TOTOLTCB+128                                             03792000
TOTSMGRT EQU   TOTOLTCB+124                                             03793000
@NM00174 EQU   $SCTTBLE+92                                              03794000
$EXT     EQU   $SCTTBLE+88                                              03795000
$PASS    EQU   $SCTTBLE+84                                              03796000
$TABLE   EQU   $SCTTBLE+80                                              03797000
$MSGIDAC EQU   $SCTTBLE+78                                              03798000
@NM00173 EQU   $SCTTBLE+72                                              03799000
@NM00172 EQU   $SCTTBLE+71                                              03800000
$RETMASK EQU   $SCTTBLE+70                                              03801000
$R249255 EQU   $SCTTBLE+69                                              03802000
$R241248 EQU   $SCTTBLE+68                                              03803000
$R233240 EQU   $SCTTBLE+67                                              03804000
$R225232 EQU   $SCTTBLE+66                                              03805000
$R217224 EQU   $SCTTBLE+65                                              03806000
$R209216 EQU   $SCTTBLE+64                                              03807000
$R201208 EQU   $SCTTBLE+63                                              03808000
$R193200 EQU   $SCTTBLE+62                                              03809000
$R185192 EQU   $SCTTBLE+61                                              03810000
$R177184 EQU   $SCTTBLE+60                                              03811000
$R169176 EQU   $SCTTBLE+59                                              03812000
$R161168 EQU   $SCTTBLE+58                                              03813000
$R153160 EQU   $SCTTBLE+57                                              03814000
$R145152 EQU   $SCTTBLE+56                                              03815000
$R137144 EQU   $SCTTBLE+55                                              03816000
$R129136 EQU   $SCTTBLE+54                                              03817000
$R121128 EQU   $SCTTBLE+53                                              03818000
$R113120 EQU   $SCTTBLE+52                                              03819000
$R105112 EQU   $SCTTBLE+51                                              03820000
$R097104 EQU   $SCTTBLE+50                                              03821000
$R089096 EQU   $SCTTBLE+49                                              03822000
$R081088 EQU   $SCTTBLE+48                                              03823000
$R073080 EQU   $SCTTBLE+47                                              03824000
$R065072 EQU   $SCTTBLE+46                                              03825000
$R057064 EQU   $SCTTBLE+45                                              03826000
$R049056 EQU   $SCTTBLE+44                                              03827000
$R041048 EQU   $SCTTBLE+43                                              03828000
$R033040 EQU   $SCTTBLE+42                                              03829000
$R025032 EQU   $SCTTBLE+41                                              03830000
$R017024 EQU   $SCTTBLE+40                                              03831000
$TOTFLG2 EQU   $SCTTBLE+39                                              03832000
@NM00171 EQU   $TOTFLG1                                                 03833000
$CTEQTT  EQU   $TOTFLG1                                                 03834000
$TERMSEC EQU   $TOTFLG1                                                 03835000
$TDATBLK EQU   $TOTFLG1                                                 03836000
$LINESHR EQU   $TOTFLG1                                                 03837000
@NM00170 EQU   $SCTTBLE+37                                              03838000
@NM00169 EQU   $OLTFLGS                                                 03839000
$LASTSEC EQU   $OLTFLGS                                                 03840000
$TRACE   EQU   $OLTFLGS                                                 03841000
$RETCODE EQU   $OLTFLGS                                                 03842000
$CONTCB  EQU   $OLTFLGS                                                 03843000
$RETAIN  EQU   $OLTFLGS                                                 03844000
$CLEANRT EQU   $OLTFLGS                                                 03845000
$MANINTV EQU   $OLTFLGS                                                 03846000
$OLTSIZE EQU   $SCTTBLE+34                                              03847000
$QSCTMOD EQU   $EXECFLG                                                 03848000
$CTRLMOD EQU   $EXECFLG                                                 03849000
$CLEANUP EQU   $EXECFLG                                                 03850000
$LSTPDEV EQU   $EXECFLG                                                 03851000
$ERRCNT  EQU   $EXECFLG                                                 03852000
$RTNSLCT EQU   $EXECFLG                                                 03853000
$MULTDEV EQU   $EXECFLG                                                 03854000
$CECCMIN EQU   $EXECFLG                                                 03855000
$RMSKCNT EQU   $SCTTBLE+32                                              03856000
$CDS8T19 EQU   $SCTTBLE+20                                              03857000
$PDEVDSC EQU   $SCTTBLE+16                                              03858000
$PDEVADR EQU   $SCTTBLE+12                                              03859000
$COMMCN  EQU   $CDSFLGS                                                 03860000
$CUSTSYM EQU   $CDSFLGS                                                 03861000
$TWOCHSW EQU   $CDSFLGS                                                 03862000
$SYMNAME EQU   $CDSFLGS                                                 03863000
$EXTINTC EQU   $CDSFLGS                                                 03864000
$CEVOL   EQU   $CDSFLGS                                                 03865000
$SHARED  EQU   $CDSFLGS                                                 03866000
$FPM     EQU   $CDSFLGS                                                 03867000
$LASTSUB EQU   $PDEVFLG                                                 03868000
$PATHDEF EQU   $PDEVFLG                                                 03869000
$TERMNDX EQU   $PDEVFLG                                                 03870000
@NM00168 EQU   $PDEVFLG                                                 03871000
$LASTDEV EQU   $PDEVFLG                                                 03872000
$TSSSYS1 EQU   $PDEVFLG                                                 03873000
$EXFILPT EQU   $PDEVFLG                                                 03874000
$FPMOLD  EQU   $PDEVFLG                                                 03875000
$TSSSYM  EQU   $SCTTBLE+8                                               03876000
$SPARE1  EQU   $SCTTBLE+7                                               03877000
$DRIVER  EQU   $SCTTBLE+6                                               03878000
$RT0916  EQU   $SCTTBLE+5                                               03879000
$RT0108  EQU   $SCTTBLE+4                                               03880000
$LOOPTST EQU   $ERROPT                                                  03881000
$LOOPERR EQU   $ERROPT                                                  03882000
$NERRPRT EQU   $ERROPT                                                  03883000
$NOCNTRL EQU   $ERROPT                                                  03884000
$ALTPRNT EQU   $ERROPT                                                  03885000
$CATERR  EQU   $ERROPT                                                  03886000
$ASTERIK EQU   $ERROPT                                                  03887000
$TESTERR EQU   $ERROPT                                                  03888000
$FSTCOMM EQU   $TESTOPT                                                 03889000
$INDEFLP EQU   $TESTOPT                                                 03890000
$NOPRT   EQU   $TESTOPT                                                 03891000
@NM00167 EQU   $TESTOPT                                                 03892000
$ERRLPCT EQU   $SCTTBLE                                                 03893000
@NM00166 EQU   TOTOBPTR+4                                               03894000
TOTELQCB EQU   TOTOBPTR+1                                               03895000
LCBERADR EQU   LCBXRADR+1                                               03896000
LCBPCIRC EQU   LCBXRADR                                                 03897000
LCBDCT3  EQU   LCBXDCT+2                                                03898000
LCBDCT2  EQU   LCBXDCT+1                                                03899000
LCBDCT1  EQU   LCBXDCT                                                  03900000
@NM00165 EQU   LCBXFLAG                                                 03901000
LCBERPND EQU   LCBXFLAG                                                 03902000
LCBSRCPF EQU   LCBXFLAG                                                 03903000
LCBGPCTV EQU   LCBXFLAG                                                 03904000
@NM00164 EQU   LCBXFLAG                                                 03905000
@NM00163 EQU   LCBXFLAG                                                 03906000
@NM00162 EQU   LCBXFLAG                                                 03907000
@NM00161 EQU   LCBXFLAG                                                 03908000
LCBCCW10 EQU   LCBCPA+72                                                03909000
LCBCCW9  EQU   LCBCPA+64                                                03910000
LCBCCW8  EQU   LCBCPA+56                                                03911000
LCBCCW7  EQU   LCBCPA+48                                                03912000
LCBCCW6  EQU   LCBCPA+40                                                03913000
LCBCP    EQU   LCBQEBPL+4                                               03914000
LCBIOSB  EQU   LCBQEBPL+1                                               03915000
LCBSIO   EQU   LCBQEBPL                                                 03916000
LCBCCW4  EQU   LCBCPA+24                                                03917000
LCBCCW3  EQU   LCBCPA+16                                                03918000
LCBCCW2  EQU   LCBCPA+8                                                 03919000
LCBCCW1  EQU   LCBCPA                                                   03920000
@NM00146 EQU   LCBERCCW+16                                              03921000
LCBATL05 EQU   LCBERCCW+8                                               03922000
@NM00145 EQU   LCBERCCW                                                 03923000
LCBCSWSV EQU   LCBSAVSN+1                                               03924000
LCBSNSV  EQU   LCBSAVSN                                                 03925000
LCBBFSNS EQU   LCBRSPSV                                                 03926000
LCBWAITC EQU   LCBTPCD+5                                                03927000
LCBINPAK EQU   LCBSTAT6                                                 03928000
LCBMHBID EQU   LCBSTAT6                                                 03929000
LCBRTRRO EQU   LCBSTAT6                                                 03930000
LCBHDRPD EQU   LCBSTAT6                                                 03931000
LCBCHN   EQU   LCBSTAT6                                                 03932000
LCBBFRSV EQU   LCBTPCD+1                                                03933000
@NM00144 EQU   LCBSTAT5                                                 03934000
LCBLUS   EQU   LCBSTAT5                                                 03935000
LCBLUNIT EQU   LCBSTAT5                                                 03936000
LCBPERM  EQU   LCBSTAT5                                                 03937000
LCBNXCMD EQU   LCBBFRW                                                  03938000
LCBERMSK EQU   LCBOBRCH                                                 03939000
LCBEOT   EQU   LCBMSGFM                                                 03940000
LCBENQ   EQU   LCBMSGFM                                                 03941000
LCBTTD   EQU   LCBMSGFM                                                 03942000
LCBRSTRT EQU   LCBMSGFM                                                 03943000
LCBVSTRT EQU   LCBMSGFM                                                 03944000
LCBACKI  EQU   LCBMSGFM                                                 03945000
LCBNAK   EQU   LCBMSGFM                                                 03946000
LCBTTCIN EQU   IEDQLCB+90                                               03947000
@NM00143 EQU   LCBRBCT2                                                 03948000
LCBDCNT  EQU   LCBRBCT2                                                 03949000
LCBRBCT1 EQU   LCBERBCT                                                 03950000
LCBERBCH EQU   IEDQLCB+85                                               03951000
LCBCOMPL EQU   LCBDLNKN                                                 03952000
LCBPRCPG EQU   LCBERBST                                                 03953000
LCBERROR EQU   LCBERBST                                                 03954000
LCBLOGDV EQU   LCBERBST                                                 03955000
LCBINQ   EQU   LCBERBST                                                 03956000
LCBRDERR EQU   LCBERBST                                                 03957000
LCBEOMSG EQU   LCBERBST                                                 03958000
LCBMSG   EQU   LCBERBST                                                 03959000
LCBERBLK EQU   IEDQLCB+81                                               03960000
LCBERBPY EQU   IEDQLCB+80                                               03961000
LCBERBQB EQU   LCBERB+1                                                 03962000
LCBERBKY EQU   LCBERB                                                   03963000
LCBRECAD EQU   IEDQLCB+73                                               03964000
@NM00142 EQU   LCBTSTSW                                                 03965000
@NM00141 EQU   LCBTSTSW                                                 03966000
@NM00140 EQU   LCBTSTSW                                                 03967000
@NM00139 EQU   LCBTSTSW                                                 03968000
@NM00138 EQU   LCBTSTSW                                                 03969000
@NM00137 EQU   LCBTSTSW                                                 03970000
@NM00136 EQU   LCBTSTSW                                                 03971000
LCBCONCT EQU   LCBTSTSW                                                 03972000
LCBRESP  EQU   LCBSTAT2                                                 03973000
LCBBFRAV EQU   LCBDIAL                                                  03974000
LCBATTN  EQU   LCBSYNC                                                  03975000
LCBSNDPR EQU   LCBSTAT2                                                 03976000
LCBCONNN EQU   LCBBEOTN                                                 03977000
LCBMSGNN EQU   LCBSTAT2                                                 03978000
LCBTRACE EQU   LCBSTAT2                                                 03979000
LCBSENDN EQU   LCBSTAT1                                                 03980000
LCBRECVN EQU   LCBSTAT1                                                 03981000
LCBFREEN EQU   LCBSTAT1                                                 03982000
LCBCONT  EQU   LCBSTAT1                                                 03983000
LCBINITN EQU   LCBSTAT1                                                 03984000
LCBOCNI  EQU   LCBSTAT1                                                 03985000
LCBOCWTN EQU   LCBSTAT1                                                 03986000
LCBRCLLN EQU   LCBSTAT1                                                 03987000
LCBRECOF EQU   IEDQLCB+68                                               03988000
LCBRDBFR EQU   LCBRCBFR                                                 03989000
LCBUCBX  EQU   IEDQLCB+64                                               03990000
LCBTTBIN EQU   LCBERRCT                                                 03991000
@NM00135 EQU   LCBINCAM                                                 03992000
LCBGETMN EQU   LCBINCAM                                                 03993000
@NM00134 EQU   LCBRESTR+1                                               03994000
LCBCMDSV EQU   LCBRESTR                                                 03995000
LCBPCILK EQU   LCBDCBPT                                                 03996000
LCBSTART EQU   LCBIOBSN+16                                              03997000
LCBAP4OL EQU   LCBSIOCC                                                 03998000
LCBAP3OL EQU   LCBSIOCC                                                 03999000
LCBAP2OL EQU   LCBSIOCC                                                 04000000
LCBAP1OL EQU   LCBSIOCC                                                 04001000
LCBSIOC2 EQU   LCBSIOCC                                                 04002000
LCBSIOC1 EQU   LCBSIOCC                                                 04003000
@NM00133 EQU   LCBSIOCC                                                 04004000
LCBCSWRC EQU   LCBCSW+5                                                 04005000
LCBCSCHC EQU   LCBCSWCS                                                 04006000
LCBCSICC EQU   LCBCSWCS                                                 04007000
LCBCSCCC EQU   LCBCSWCS                                                 04008000
LCBCSCDC EQU   LCBCSWCS                                                 04009000
LCBCSPTC EQU   LCBCSWCS                                                 04010000
LCBCSPGC EQU   LCBCSWCS                                                 04011000
LCBCSIL  EQU   LCBCSWCS                                                 04012000
LCBCSPCI EQU   LCBCSWCS                                                 04013000
LCBUSUE  EQU   LCBCSWUS                                                 04014000
LCBUSUC  EQU   LCBCSWUS                                                 04015000
LCBUSDE  EQU   LCBCSWUS                                                 04016000
LCBUSCE  EQU   LCBCSWUS                                                 04017000
LCBUSBSY EQU   LCBCSWUS                                                 04018000
LCBUSCUE EQU   LCBCSWUS                                                 04019000
LCBUSSM  EQU   LCBCSWUS                                                 04020000
LCBUSAT  EQU   LCBCSWUS                                                 04021000
LCBCSWCA EQU   LCBCSW                                                   04022000
LCBOBR   EQU   LCBFLAG3                                                 04023000
LCBOBRRD EQU   LCBFLAG3                                                 04024000
LCBIOMSG EQU   LCBFLAG3                                                 04025000
LCBSOHC  EQU   LCBFLAG3                                                 04026000
LCBRLAD  EQU   LCBFLAG3                                                 04027000
LCBSOHR  EQU   LCBFLAG3                                                 04028000
@NM00132 EQU   LCBFLAG3                                                 04029000
LCBECBPT EQU   LCBIOBSN+4                                               04030000
LCBECBCC EQU   LCBIOBSN+3                                               04031000
LCBSENS1 EQU   LCBSNS+1                                                 04032000
LCBABORT EQU   LCBTMOUT                                                 04033000
LCBNOTIN EQU   LCBLOSDT                                                 04034000
LCBOVRUN EQU   LCBSENS0                                                 04035000
LCBDATCK EQU   LCBSENS0                                                 04036000
LCBEQUCK EQU   LCBSENS0                                                 04037000
LCBBUSCK EQU   LCBSENS0                                                 04038000
LCBINTRQ EQU   LCBSENS0                                                 04039000
LCBCMDRJ EQU   LCBSENS0                                                 04040000
LCBFLAG2 EQU   LCBIOBSN                                                 04041000
@NM00131 EQU   LCBFLAG1                                                 04042000
LCBUNREL EQU   LCBFLAG1                                                 04043000
LCBEXCPN EQU   LCBFLAG1                                                 04044000
@NM00130 EQU   LCBFLAG1                                                 04045000
LCBERPIN EQU   LCBFLAG1                                                 04046000
@NM00129 EQU   LCBFLAG1                                                 04047000
LCBFSBFR EQU   LCBMHA                                                   04048000
LCBISZE  EQU   IEDQLCB+28                                               04049000
LCBLNENT EQU   LCBSCBDA+1                                               04050000
@NM00128 EQU   LCBSCBDA                                                 04051000
LCBCPGMH EQU   LCBSTAT4                                                 04052000
LCBREAL  EQU   LCBPHASE                                                 04053000
@NM00127 EQU   LCBSTAT4                                                 04054000
LCBACTRQ EQU   LCBSTAT4                                                 04055000
LCBIPLRQ EQU   LCBSTAT4                                                 04056000
LCBDACRQ EQU   LCBSTAT4                                                 04057000
LCBDMPRQ EQU   LCBSTAT4                                                 04058000
@NM00126 EQU   LCBLKMDE                                                 04059000
LCBLOCKI EQU   LCBLKMDE                                                 04060000
LCBLOCKR EQU   LCBLKMDE                                                 04061000
LCBHMFLG EQU   LCBLKMDE                                                 04062000
LCBBDFLG EQU   LCBLKMDE                                                 04063000
@NM00125 EQU   LCBINSRC                                                 04064000
LCBABRTN EQU   LCBCHAIN                                                 04065000
LCBCTLMD EQU   LCBTETEN                                                 04066000
LCBBFRSZ EQU   LCBCHAIN                                                 04067000
LCBUREQN EQU   LCBCHAIN                                                 04068000
LCBNORTY EQU   LCBCHAIN                                                 04069000
LCBERMSG EQU   LCBCHAIN                                                 04070000
LCBEXCP  EQU   LCBCHAIN                                                 04071000
LCBINVRQ EQU   LCBSCRNN                                                 04072000
LCB2741N EQU   LCBTSOB                                                  04073000
LCBINHBN EQU   LCBTSOB                                                  04074000
LCBCIRCD EQU   LCBTSOB                                                  04075000
LCBPREP  EQU   LCBTSOB                                                  04076000
LCBSOPL  EQU   LCBTSOB                                                  04077000
LCBSATRD EQU   LCBTSOB                                                  04078000
LCBTSBUF EQU   LCBTSOB                                                  04079000
LCBWRBRK EQU   LCBTSOB                                                  04080000
LCBTDL   EQU   IEDQLCB+18                                               04081000
LCBEOLTD EQU   IEDQLCB+16                                               04082000
LCBRSLNK EQU   IEDQLCB+13                                               04083000
LCBRSPRI EQU   IEDQLCB+12                                               04084000
LCBSTCBA EQU   IEDQLCB+9                                                04085000
LCBKEY   EQU   LCBRCB                                                   04086000
@NM00124 EQU   DCTBYTE5                                                 04087000
DCTSCS   EQU   DCTBYTE5                                                 04088000
DCTTSPRF EQU   DCTBYTE4                                                 04089000
DCTFMPRF EQU   DCTBYTE4                                                 04090000
DCT2760  EQU   DCTBYTE3                                                 04091000
DCTCONTN EQU   DCTBYTE3                                                 04092000
DCTBUFF  EQU   DCTBYTE3                                                 04093000
DCTCHECK EQU   DCTBYTE3                                                 04094000
DCTENCTL EQU   DCTBYTE3                                                 04095000
DCTWTTA  EQU   DCTBYTE3                                                 04096000
DCT1050  EQU   DCTBYTE3                                                 04097000
DCTAUDIO EQU   DCTBYTE2                                                 04098000
DCTLOCAL EQU   DCTBYTE2                                                 04099000
DCTCONT  EQU   DCTBYTE2                                                 04100000
DCTXMIT  EQU   DCTBYTE2                                                 04101000
DCTSTCTL EQU   DCTBYTE2                                                 04102000
DCTTWX   EQU   DCTBYTE2                                                 04103000
DCTBRDST EQU   DCTBYTE2                                                 04104000
DCTBISYN EQU   DCTBYTE2                                                 04105000
DCTUMASK EQU   DCTBYTE1                                                 04106000
DCTSADEV EQU   DCTBYTE1                                                 04107000
DCT2741  EQU   DCTBYTE1                                                 04108000
DCT5041  EQU   DCTBYTE1                                                 04109000
DCTATTEN EQU   DCTBYTE1                                                 04110000
DCTBREAK EQU   DCTBYTE1                                                 04111000
DCTINHIB EQU   DCTBYTE1                                                 04112000
DCTBYTE0 EQU   IEDDCT                                                   04113000
DCBINVLA EQU   DCBINVLI+1                                               04114000
@NM00123 EQU   DCBINVCI                                                 04115000
DCBINVB2 EQU   DCBINVCI                                                 04116000
@NM00122 EQU   DCBINVCI                                                 04117000
DCBINVB1 EQU   DCBINVCI                                                 04118000
@NM00121 EQU   DCBINVCI                                                 04119000
@NM00120 EQU   DCBRESER+2                                               04120000
DCBRESB2 EQU   DCBRESER+1                                               04121000
DCBRESB1 EQU   DCBRESER                                                 04122000
DCBBUFSI EQU   IHADCS43+6                                               04123000
DCBUNTCT EQU   IHADCS43+5                                               04124000
DCBILCT  EQU   IHADCS43+4                                               04125000
DCBSCTAD EQU   DCBSCTAB+1                                               04126000
@NM00119 EQU   DCBSCTAB                                                 04127000
DCBDEBA  EQU   DCBDEBAD+1                                               04128000
@NM00118 EQU   DCBIFLGS                                                 04129000
DCBIFIOE EQU   DCBIFLGS                                                 04130000
DCBCH12  EQU   DCBIFPCT                                                 04131000
DCBCH9   EQU   DCBIFPCT                                                 04132000
DCBIFEC  EQU   DCBIFLGS                                                 04133000
DCBMFSTI EQU   DCBMFDMD                                                 04134000
DCBMFAWR EQU   DCBMFSTK                                                 04135000
DCBMFUIP EQU   DCBMFTMD                                                 04136000
DCBMFIDW EQU   DCBMFLCP                                                 04137000
DCBMFWRK EQU   DCBMFMVP                                                 04138000
DCBMFRDQ EQU   DCBMFWRT                                                 04139000
DCBMFGTQ EQU   DCBMFPUT                                                 04140000
DCBMFSTL EQU   DCBMACF2                                                 04141000
DCBMFCK  EQU   DCBMFDMG                                                 04142000
DCBMFRDX EQU   DCBMFCHK                                                 04143000
DCBMFDBF EQU   DCBMFSBG                                                 04144000
DCBMFRDI EQU   DCBMFLCG                                                 04145000
DCBMFRDK EQU   DCBMFMVG                                                 04146000
DCBMFWRQ EQU   DCBMFRD                                                  04147000
DCBMFPTQ EQU   DCBMFGET                                                 04148000
DCBMFECP EQU   DCBMACF1                                                 04149000
DCBTIOT  EQU   IHADCS25                                                 04150000
DCBMRSTI EQU   DCBMRDMD                                                 04151000
DCBMRAWR EQU   DCBMRSTK                                                 04152000
DCBMRUIP EQU   DCBMRTMD                                                 04153000
DCBMRIDW EQU   DCBMRLCP                                                 04154000
DCBMRWRK EQU   DCBMRMVP                                                 04155000
DCBMRRDQ EQU   DCBMRWRT                                                 04156000
DCBMRGTQ EQU   DCBMRPUT                                                 04157000
DCBMRSTL EQU   DCBMACR2                                                 04158000
DCBMRCK  EQU   DCBMRDMG                                                 04159000
DCBPGFXA EQU   DCBMRRDX                                                 04160000
DCBMRDBF EQU   DCBMRSBG                                                 04161000
DCBMRRDI EQU   DCBMRLCG                                                 04162000
DCBMRRDK EQU   DCBMRMVG                                                 04163000
DCBMRWRQ EQU   DCBMRRD                                                  04164000
DCBMRPTQ EQU   DCBMRGET                                                 04165000
DCBMRECP EQU   DCBMACR1                                                 04166000
@NM00117 EQU   DCBIFLG                                                  04167000
DCBIBIOE EQU   DCBIFLG                                                  04168000
DCBICH12 EQU   DCBIBPCT                                                 04169000
DCBICH9  EQU   DCBIBPCT                                                 04170000
DCBIBEC  EQU   DCBIFLG                                                  04171000
DCBOFIOF EQU   DCBOFLGS                                                 04172000
DCBOFUEX EQU   DCBOFLGS                                                 04173000
DCBOFTM  EQU   DCBOFLGS                                                 04174000
DCBOFPPC EQU   DCBOFLGS                                                 04175000
DCBOFOPN EQU   DCBOFLGS                                                 04176000
DCBOFEOV EQU   DCBOFLGS                                                 04177000
DCBOFLRB EQU   DCBOFLGS                                                 04178000
DCBOFIOD EQU   DCBOFLWR                                                 04179000
DCBDDNAM EQU   IHADCS24                                                 04180000
DCBEXLSA EQU   DCBEXLST+1                                               04181000
DCBEIOBX EQU   DCBEXLST                                                 04182000
DCBLCBA  EQU   DCBLCBAD+1                                               04183000
DCBCPS   EQU   DCBCPRI                                                  04184000
DCBCPE   EQU   DCBCPRI                                                  04185000
DCBCPR   EQU   DCBCPRI                                                  04186000
@NM00116 EQU   DCBCPRI                                                  04187000
@NM00115 EQU   DCBTRANA                                                 04188000
DCBIOBAA EQU   DCBIOBAD+1                                               04189000
DCBDEVTP EQU   DCBIOBAD                                                 04190000
@NM00114 EQU   IHADCS17+7                                               04191000
@NM00113 EQU   IHADCS17+6                                               04192000
@NM00112 EQU   IHADCS17+5                                               04193000
DCBINTVL EQU   IHADCS17+4                                               04194000
DCBCLPSA EQU   DCBCLPS+1                                                04195000
DCBBUFRQ EQU   DCBCLPS                                                  04196000
DCBBUFMA EQU   IHADCS16+8                                               04197000
@NM00111 EQU   DCBDSRG2                                                 04198000
DCBDSGTR EQU   DCBDSRG2                                                 04199000
DCBACBM  EQU   DCBDSRG2                                                 04200000
@NM00110 EQU   DCBDSRG2                                                 04201000
DCBDSGTQ EQU   DCBDSRG2                                                 04202000
DCBDSGTX EQU   DCBDSRG2                                                 04203000
DCBDSGGS EQU   DCBDSRG2                                                 04204000
DCBDSGU  EQU   DCBDSRG1                                                 04205000
DCBDSGPO EQU   DCBDSRG1                                                 04206000
@NM00109 EQU   DCBDSRG1                                                 04207000
@NM00108 EQU   DCBDSRG1                                                 04208000
DCBDSGCX EQU   DCBDSRG1                                                 04209000
DCBDSGDA EQU   DCBDSRG1                                                 04210000
DCBDSGPS EQU   DCBDSRG1                                                 04211000
DCBDSGIS EQU   DCBDSRG1                                                 04212000
DCBPCIR2 EQU   DCBPCI                                                   04213000
DCBPCIR1 EQU   DCBPCI                                                   04214000
DCBPCIN2 EQU   DCBPCI                                                   04215000
DCBPCIN1 EQU   DCBPCI                                                   04216000
DCBPCIA2 EQU   DCBPCI                                                   04217000
DCBPCIA1 EQU   DCBPCI                                                   04218000
DCBPCIX2 EQU   DCBPCI                                                   04219000
DCBPCIX1 EQU   DCBPCI                                                   04220000
@NM00107 EQU   IHADCS16+4                                               04221000
DCBMH    EQU   DCBMHA+1                                                 04222000
DCBBFOUT EQU   DCBBUFIN                                                 04223000
DCBBFIN  EQU   DCBBUFIN                                                 04224000
@NM00106 EQU   IHADCB                                                   04225000
SAVTLLCB EQU   IEDNSVTD+316                                             04226000
SAVTBITN EQU   IEDNSVTD+312                                             04227000
@NM00105 EQU   SAVTCKQB+8                                               04228000
@NM00104 EQU   SAVTCKEC+1                                               04229000
@NM00103 EQU   SAVTCKCC                                                 04230000
SAVTCKPO EQU   SAVTCKCC                                                 04231000
SAVTCKWA EQU   SAVTCKCC                                                 04232000
SAVTCKCH EQU   SAVTCKTB+1                                               04233000
SAVTCKVT EQU   SAVTCKTB                                                 04234000
@NM00102 EQU   IEDNSVTD+297                                             04235000
SAVTRDFG EQU   SAVTRDRV+12                                              04236000
@NM00101 EQU   SAVTRDRV+5                                               04237000
SAVTRDPY EQU   SAVTRDRV+4                                               04238000
SAVTRDQB EQU   SAVTRDRV+1                                               04239000
SAVTRDKY EQU   SAVTRDRV                                                 04240000
SAVTNID  EQU   IEDNSVTD+280                                             04241000
SAVTDVAS EQU   IEDNSVTD+276                                             04242000
SAVTPLSZ EQU   IEDNSVTD+274                                             04243000
@NM00100 EQU   IEDNSVTD+273                                             04244000
SAVTSUBL EQU   IEDNSVTD+272                                             04245000
@NM00099 EQU   SAVTZELM+1                                               04246000
SAVTSUBM EQU   SAVTZELM                                                 04247000
SAVTMHDX EQU   IEDNSVTD+268                                             04248000
SAVTNAT1 EQU   IEDNSVTD+266                                             04249000
SAVTSH20 EQU   IEDNSVTD+264                                             04250000
SAVTLCBS EQU   IEDNSVTD+260                                             04251000
SAVTRNMP EQU   IEDNSVTD+256                                             04252000
SAVTTNTX EQU   IEDNSVTD+252                                             04253000
SAVTSUBV EQU   IEDNSVTD+247                                             04254000
SAVTSUBA EQU   IEDNSVTD+246                                             04255000
SAVTSIBC EQU   IEDNSVTD+244                                             04256000
SAVTBSM  EQU   IEDNSVTD+240                                             04257000
SAVTRQTG EQU   IEDNSVTD+236                                             04258000
SAVTRQCH EQU   IEDNSVTD+232                                             04259000
SAVTMAND EQU   IEDNSVTD+228                                             04260000
SAVTSPLN EQU   IEDNSVTD+224                                             04261000
SAVTNADL EQU   IEDNSVTD+222                                             04262000
SAVTNATL EQU   IEDNSVTD+220                                             04263000
SAVTMHTB EQU   IEDNSVTD+216                                             04264000
SAVTSSMH EQU   IEDNSVTD+212                                             04265000
SAVTQRS  EQU   IEDNSVTD+208                                             04266000
SAVTRQIN EQU   IEDNSVTD+204                                             04267000
SAVTDFCO EQU   IEDNSVTD+200                                             04268000
SAVTSAO  EQU   IEDNSVTD+196                                             04269000
SAVTSARI EQU   IEDNSVTD+192                                             04270000
SAVTSAC  EQU   IEDNSVTD+188                                             04271000
SAVTSAI  EQU   IEDNSVTD+184                                             04272000
SAVTCSCI EQU   IEDNSVTD+180                                             04273000
SAVTSSRP EQU   IEDNSVTD+176                                             04274000
SAVTSSRQ EQU   IEDNSVTD+172                                             04275000
SAVTSCLU EQU   IEDNSVTD+168                                             04276000
SAVTXTRQ EQU   IEDNSVTD+164                                             04277000
SAVTMVBF EQU   IEDNSVTD+160                                             04278000
@NM00098 EQU   IEDNSVTD+148                                             04279000
SAVTIPCQ EQU   IEDNSVTD+144                                             04280000
@NM00097 EQU   IEDNSVTD+136                                             04281000
SAVTXFMI EQU   IEDNSVTD+132                                             04282000
@NM00096 EQU   IEDNSVTD+124                                             04283000
SAVTXFMO EQU   IEDNSVTD+120                                             04284000
@NM00095 EQU   IEDNSVTD+116                                             04285000
SAVTSSSR EQU   IEDNSVTD+112                                             04286000
SAVTSLCB EQU   IEDNSVTD+104                                             04287000
SAVTLUSR EQU   IEDNSVTD+100                                             04288000
@NM00094 EQU   SAVTLUSQ+8                                               04289000
SAVTLUSP EQU   SAVTLUSQ+4                                               04290000
SAVTLUSB EQU   SAVTLUSQ                                                 04291000
@NM00093 EQU   IEDNSVTD+84                                              04292000
SAVTSAT  EQU   IEDNSVTD+80                                              04293000
SAVTNAT  EQU   IEDNSVTD+76                                              04294000
SAVTCLUP EQU   IEDNSVTD+72                                              04295000
SAVTPIUT EQU   IEDNSVTD+68                                              04296000
SAVTRNTA EQU   IEDNSVTD+64                                              04297000
SAVTDNIR EQU   IEDNSVTD+60                                              04298000
SAVTCNIR EQU   IEDNSVTD+56                                              04299000
SAVTFLDH EQU   IEDNSVTD+52                                              04300000
SAVTSRTN EQU   IEDNSVTD+48                                              04301000
SAVTSREQ EQU   IEDNSVTD+44                                              04302000
SAVTFAIL EQU   IEDNSVTD+42                                              04303000
SAVTSUSE EQU   IEDNSVTD+40                                              04304000
SAVTSIB  EQU   IEDNSVTD+36                                              04305000
SAVTPRTN EQU   IEDNSVTD+32                                              04306000
@NM00092 EQU   IEDNSVTD+28                                              04307000
SAVTWH20 EQU   IEDNSVTD+26                                              04308000
SAVTPWT  EQU   IEDNSVTD+24                                              04309000
SAVTPRTQ EQU   IEDNSVTD+20                                              04310000
SAVTPREQ EQU   IEDNSVTD+16                                              04311000
SAVTPH20 EQU   IEDNSVTD+14                                              04312000
SAVTPUSE EQU   IEDNSVTD+12                                              04313000
SAVTPLCB EQU   IEDNSVTD+8                                               04314000
SAVTPOOL EQU   IEDNSVTD+4                                               04315000
SAVTPRMT EQU   SAVTDIAF                                                 04316000
SAVTVIRT EQU   SAVTDIAF                                                 04317000
AVTCPBNO EQU   IEDQAVTD+1244                                            04318000
AVTHRESS EQU   IEDQAVTD+1243                                            04319000
@NM00091 EQU   IEDQAVTD+1242                                            04320000
@NM00090 EQU   IEDQAVTD+1241                                            04321000
@NM00089 EQU   IEDQAVTD+1240                                            04322000
@NM00088 EQU   IEDQAVTD+1237                                            04323000
@NM00087 EQU   IEDQAVTD+1236                                            04324000
AVTHRESE EQU   @NM00086                                                 04325000
AVTRADDR EQU   IEDQAVTD+1228                                            04326000
AVTNADDR EQU   IEDQAVTD+1224                                            04327000
AVTHRESN EQU   IEDQAVTD+1220                                            04328000
AVTVOLRN EQU   IEDQAVTD+1216                                            04329000
AVTTOTNN EQU   IEDQAVTD+1212                                            04330000
AVTTRCYN EQU   IEDQAVTD+1208                                            04331000
AVTRCTRN EQU   IEDQAVTD+1204                                            04332000
AVTNOVON EQU   IEDQAVTD+1200                                            04333000
AVTADEBN EQU   IEDQAVTD+1196                                            04334000
AVTVOLRR EQU   IEDQAVTD+1192                                            04335000
AVTTOTNR EQU   IEDQAVTD+1188                                            04336000
AVTTRCYR EQU   IEDQAVTD+1184                                            04337000
AVTRCTRR EQU   IEDQAVTD+1180                                            04338000
AVTNOVOR EQU   IEDQAVTD+1176                                            04339000
AVTADEBR EQU   IEDQAVTD+1172                                            04340000
AVTLODPT EQU   IEDQAVTD+1168                                            04341000
AVTIOBN  EQU   IEDQAVTD+1164                                            04342000
AVTIOBR  EQU   IEDQAVTD+1160                                            04343000
AVTCPBPT EQU   IEDQAVTD+1156                                            04344000
AVTFCPB  EQU   IEDQAVTD+1152                                            04345000
@NM00085 EQU   IEDQAVTD+1148                                            04346000
AVTINCPQ EQU   IEDQAVTD+1144                                            04347000
@NM00084 EQU   IEDQAVTD+1140                                            04348000
@NM00083 EQU   IEDQAVTD+1137                                            04349000
@NM00082 EQU   AVTBIT4                                                  04350000
@NM00081 EQU   AVTBIT4                                                  04351000
@NM00080 EQU   AVTBIT4                                                  04352000
@NM00079 EQU   AVTBIT4                                                  04353000
@NM00078 EQU   AVTBIT4                                                  04354000
@NM00077 EQU   AVTBIT4                                                  04355000
@NM00076 EQU   AVTBIT4                                                  04356000
AVTRUFTN EQU   AVTBIT4                                                  04357000
@NM00075 EQU   IEDQAVTD+1132                                            04358000
AVTNOBFQ EQU   IEDQAVTD+1128                                            04359000
@NM00074 EQU   IEDQAVTD+1124                                            04360000
AVTDKENQ EQU   IEDQAVTD+1120                                            04361000
@NM00073 EQU   IEDQAVTD+1116                                            04362000
AVTDKAPQ EQU   IEDQAVTD+1112                                            04363000
AVTCOPY  EQU   IEDQAVTD+1108                                            04364000
AVTIA    EQU   IEDQAVTD+1104                                            04365000
AVTFL    EQU   IEDQAVTD+1100                                            04366000
@NM00072 EQU   IEDQAVTD+1096                                            04367000
AVTNCPBQ EQU   IEDQAVTD+1092                                            04368000
AVTTOTNC EQU   IEDQAVTD+1088                                            04369000
AVTCMAX  EQU   IEDQAVTD+1084                                            04370000
AVTCMIN  EQU   IEDQAVTD+1080                                            04371000
AVTHM02  EQU   IEDQAVTD+1076                                            04372000
AVTOPCIN EQU   IEDQAVTD+1074                                            04373000
AVTDCTLN EQU   IEDQAVTD+1072                                            04374000
AVTOPMSK EQU   IEDQAVTD+1068                                            04375000
AVTSTEAL EQU   IEDQAVTD+1060                                            04376000
AVTOPTN  EQU   IEDQAVTD+1056                                            04377000
AVTDSKCT EQU   IEDQAVTD+1054                                            04378000
AVTCKRST EQU   IEDQAVTD+1053                                            04379000
AVTSTAN  EQU   AVTBIT3                                                  04380000
AVTSTACN EQU   AVTBIT3                                                  04381000
AVTSTAIN EQU   AVTBIT3                                                  04382000
AVTSTAYN EQU   AVTBIT3                                                  04383000
AVTOLTBN EQU   AVTBIT3                                                  04384000
AVTTSAB  EQU   AVTBIT3                                                  04385000
AVTRFULN EQU   AVTBIT3                                                  04386000
AVTRECVN EQU   AVTBIT3                                                  04387000
@NM00071 EQU   AVTBIT2                                                  04388000
@NM00070 EQU   AVTBIT2                                                  04389000
AVTOPEIN EQU   AVTBIT2                                                  04390000
AVTSTRTN EQU   AVTBIT2                                                  04391000
AVTTOPOL EQU   AVTBIT2                                                  04392000
AVTCOPYN EQU   AVTBIT2                                                  04393000
AVTREUSN EQU   AVTBIT2                                                  04394000
AVTEXTSC EQU   AVTBIT2                                                  04395000
AVTDISKN EQU   AVTBIT1                                                  04396000
AVTQUCKN EQU   AVTBIT1                                                  04397000
AVTCLOSN EQU   AVTBIT1                                                  04398000
AVTREADN EQU   AVTBIT1                                                  04399000
AVTDLAYN EQU   AVTBIT1                                                  04400000
AVTAPLKN EQU   AVTBIT1                                                  04401000
AVTDUMBR EQU   IEDQAVTD+1048                                            04402000
AVTDLQX  EQU   IEDQAVTD+1046                                            04403000
AVTINTLV EQU   IEDQAVTD+1044                                            04404000
AVTSMCNT EQU   IEDQAVTD+1042                                            04405000
AVTAVFCT EQU   IEDQAVTD+1040                                            04406000
AVTOPCON EQU   IEDQAVTD+1038                                            04407000
AVTOPCNT EQU   IEDQAVTD+1036                                            04408000
AVTLNCNT EQU   IEDQAVTD+1034                                            04409000
AVTHA16  EQU   IEDQAVTD+1030                                            04410000
AVTHA7   EQU   IEDQAVTD+1028                                            04411000
AVTHA4   EQU   IEDQAVTD+1026                                            04412000
AVTHA3   EQU   IEDQAVTD+1024                                            04413000
AVTHA2   EQU   IEDQAVTD+1022                                            04414000
AVTGETMS EQU   IEDQAVTD+1021                                            04415000
@NM00069 EQU   IEDQAVTD+1020                                            04416000
AVTGETMD EQU   IEDQAVTD+1016                                            04417000
AVTGETMN EQU   IEDQAVTD+1012                                            04418000
AVTCWTOT EQU   IEDQAVTD+1008                                            04419000
AVTCWINT EQU   IEDQAVTD+956                                             04420000
AVTDTRAP EQU   IEDQAVTD+952                                             04421000
@NM00068 EQU   IEDQAVTD+950                                             04422000
@NM00067 EQU   AVTIOTR                                                  04423000
AVTIOTRH EQU   AVTIOTR                                                  04424000
AVTIOTRE EQU   AVTIOTR                                                  04425000
@NM00066 EQU   AVTSUBT                                                  04426000
AVTSUBPT EQU   AVTSUBT                                                  04427000
AVTSUBON EQU   AVTSUBT                                                  04428000
AVTAFE30 EQU   IEDQAVTD+944                                             04429000
AVTAFE20 EQU   IEDQAVTD+940                                             04430000
AVTAFE10 EQU   IEDQAVTD+936                                             04431000
AVTCWEC2 EQU   IEDQAVTD+932                                             04432000
AVTCWPM2 EQU   IEDQAVTD+928                                             04433000
AVTCWTS2 EQU   IEDQAVTD+927                                             04434000
AVTCWTS1 EQU   IEDQAVTD+926                                             04435000
AVTCWCLD EQU   AVTCWFL2                                                 04436000
AVTCWRAP EQU   AVTCWFL2                                                 04437000
@NM00065 EQU   AVTCWFL2                                                 04438000
@NM00064 EQU   AVTCWFL2                                                 04439000
@NM00063 EQU   AVTCWFL2                                                 04440000
@NM00062 EQU   AVTCWFL2                                                 04441000
@NM00061 EQU   AVTCWFL2                                                 04442000
AVTCWACT EQU   AVTCWFL2                                                 04443000
@NM00060 EQU   AVTCWFL1                                                 04444000
@NM00059 EQU   AVTCWFL1                                                 04445000
@NM00058 EQU   AVTCWFL1                                                 04446000
@NM00057 EQU   AVTCWFL1                                                 04447000
@NM00056 EQU   AVTCWFL1                                                 04448000
@NM00055 EQU   AVTCWFL1                                                 04449000
@NM00054 EQU   AVTCWFL1                                                 04450000
AVTCOMWN EQU   AVTCWFL1                                                 04451000
AVTCWEC1 EQU   IEDQAVTD+920                                             04452000
AVTCWPM1 EQU   IEDQAVTD+916                                             04453000
AVTCAREA EQU   IEDQAVTD+912                                             04454000
AVTFZERO EQU   IEDQAVTD+908                                             04455000
AVTCADDR EQU   IEDQAVTD+904                                             04456000
AVTCOREC EQU   IEDQAVTD+900                                             04457000
@NM00053 EQU   IEDQAVTD+892                                             04458000
AVTCPBCB EQU   IEDQAVTD+888                                             04459000
@NM00052 EQU   IEDQAVTD+880                                             04460000
AVTDSIOB EQU   IEDQAVTD+876                                             04461000
@NM00051 EQU   IEDQAVTD+868                                             04462000
AVTCPRMB EQU   IEDQAVTD+864                                             04463000
@NM00050 EQU   IEDQAVTD+856                                             04464000
AVTCLOSB EQU   IEDQAVTD+852                                             04465000
@NM00049 EQU   IEDQAVTD+844                                             04466000
AVTACTIB EQU   IEDQAVTD+840                                             04467000
@NM00048 EQU   IEDQAVTD+836                                             04468000
AVTOLTEB EQU   IEDQAVTD+832                                             04469000
AVTOLTVT EQU   AVTOLTQB                                                 04470000
@NM00047 EQU   AVTOPCQB+8                                               04471000
@NM00046 EQU   AVTOPCEC+1                                               04472000
@NM00045 EQU   AVTOPCCC                                                 04473000
AVTOPCPO EQU   AVTOPCCC                                                 04474000
AVTOPCWA EQU   AVTOPCCC                                                 04475000
AVTOPCCH EQU   AVTOPCOB+1                                               04476000
AVTOPCVT EQU   AVTOPCOB                                                 04477000
@NM00044 EQU   AVTCKPQB+9                                               04478000
AVTCKPTS EQU   AVTCKPQB+8                                               04479000
@NM00043 EQU   AVTCKPEC+1                                               04480000
@NM00042 EQU   AVTCKPCC                                                 04481000
AVTCKPPO EQU   AVTCKPCC                                                 04482000
AVTCKPWA EQU   AVTCKPCC                                                 04483000
AVTCKPCH EQU   AVTCKPTB+1                                               04484000
AVTCKPVT EQU   AVTCKPTB                                                 04485000
@NM00041 EQU   IEDQAVTD+796                                             04486000
@NM00040 EQU   IEDQAVTD+788                                             04487000
AVTSELCH EQU   IEDQAVTD+785                                             04488000
AVTBFRTN EQU   AVTBFRFG                                                 04489000
AVTBFREB EQU   IEDQAVTD+780                                             04490000
AVTTIMQ  EQU   IEDQAVTD+776                                             04491000
@NM00039 EQU   IEDQAVTD+772                                             04492000
AVTIMQPS EQU   IEDQAVTD+768                                             04493000
AVTREFTM EQU   IEDQAVTD+764                                             04494000
@NM00038 EQU   IEDQAVTD+752                                             04495000
AVTDELYB EQU   IEDQAVTD+748                                             04496000
AVTOCQPT EQU   IEDQAVTD+744                                             04497000
AVTTSOPT EQU   IEDQAVTD+740                                             04498000
AVTSUPPT EQU   IEDQAVTD+736                                             04499000
AVTCBQCB EQU   IEDQAVTD+732                                             04500000
@NM00037 EQU   AVTSYSER                                                 04501000
@NM00036 EQU   AVTSYSER                                                 04502000
@NM00035 EQU   AVTSYSER                                                 04503000
@NM00034 EQU   AVTSYSER                                                 04504000
@NM00033 EQU   AVTSYSER                                                 04505000
@NM00032 EQU   AVTSYSER                                                 04506000
AVTCMAXN EQU   AVTSYSER                                                 04507000
AVTCMINN EQU   AVTSYSER                                                 04508000
AVT2260L EQU   IEDQAVTD+724                                             04509000
AVTABEPL EQU   AVTADBUF                                                 04510000
AVTHFF   EQU   AVTCLRHI+2                                               04511000
@NM00031 EQU   AVTCLRHI                                                 04512000
AVTCCLNK EQU   AVTCRELE+5                                               04513000
AVTCCPRI EQU   AVTCRELE+4                                               04514000
AVTCCQCB EQU   AVTCCELE+1                                               04515000
AVTCCKEY EQU   AVTCCELE                                                 04516000
AVTDELAD EQU   IEDQAVTD+704                                             04517000
AVTDELEM EQU   IEDQAVTD+700                                             04518000
AVTBSX   EQU   AVTCKLNK                                                 04519000
AVTOPETR EQU   AVTHG01                                                  04520000
@NM00030 EQU   AVTCKBYT                                                 04521000
AVTCKONQ EQU   AVTCKBYT                                                 04522000
@NM00029 EQU   AVTCKBYT                                                 04523000
@NM00028 EQU   AVTCKBYT                                                 04524000
@NM00027 EQU   AVTCKBYT                                                 04525000
@NM00026 EQU   AVTCKBYT                                                 04526000
@NM00025 EQU   AVTCKBYT                                                 04527000
@NM00024 EQU   AVTCKBYT                                                 04528000
AVTOPERT EQU   IEDQAVTD+690                                             04529000
AVTOPXCL EQU   IEDQAVTD+688                                             04530000
AVTOPERL EQU   IEDQAVTD+687                                             04531000
@NM00023 EQU   IEDQAVTD+686                                             04532000
AVTCKTIM EQU   IEDQAVTD+684                                             04533000
AVTCKELV EQU   IEDQAVTD+682                                             04534000
AVTCPRCD EQU   IEDQAVTD+681                                             04535000
AVTWARMN EQU   AVTCKELF                                                 04536000
AVTCRTLN EQU   AVTCKELF                                                 04537000
AVTCPIPN EQU   AVTCKELF                                                 04538000
AVTCCLCN EQU   AVTCKELF                                                 04539000
AVTCINCN EQU   AVTCKELF                                                 04540000
@NM00022 EQU   AVTCKELF                                                 04541000
AVTCMCPN EQU   AVTCKELF                                                 04542000
AVTNQBCK EQU   AVTCKELF                                                 04543000
AVTCKQAD EQU   IEDQAVTD+677                                             04544000
AVTSCBSZ EQU   IEDQAVTD+676                                             04545000
@NM00021 EQU   IEDQAVTD+672                                             04546000
AVTCKELE EQU   IEDQAVTD+668                                             04547000
@NM00020 EQU   AVTCKPEL+8                                               04548000
AVTCKRLK EQU   AVTCKPEL+5                                               04549000
AVTCKRPR EQU   AVTCKPEL+4                                               04550000
AVTCKRMQ EQU   AVTCKRMV+1                                               04551000
AVTCKRKY EQU   AVTCKRMV                                                 04552000
AVTHK    EQU   IEDQAVTD+648                                             04553000
AVTHI    EQU   IEDQAVTD+644                                             04554000
AVTIOT   EQU   IEDQAVTD+640                                             04555000
AVTNX    EQU   IEDQAVTD+636                                             04556000
AVTTONE  EQU   IEDQAVTD+632                                             04557000
AVTA3TL  EQU   IEDQAVTD+628                                             04558000
AVTDMECB EQU   IEDQAVTD+624                                             04559000
AVTABEND EQU   IEDQAVTD+618                                             04560000
AVTPLCBN EQU   IEDQAVTD+616                                             04561000
@NM00019 EQU   AVTSAVTP+1                                               04562000
@NM00018 EQU   AVTSAVTF                                                 04563000
AVTSNA   EQU   AVTSAVTF                                                 04564000
AVTONSNA EQU   AVTSAVTF                                                 04565000
AVTVTMCP EQU   AVTSAVTF                                                 04566000
@NM00017 EQU   IEDQAVTD+608                                             04567000
AVTCMBSS EQU   IEDQAVTD+604                                             04568000
AVTRCV   EQU   IEDQAVTD+600                                             04569000
AVTSEND  EQU   IEDQAVTD+596                                             04570000
AVTCSCH  EQU   IEDQAVTD+592                                             04571000
AVTQ1    EQU   IEDQAVTD+588                                             04572000
AVTE7    EQU   IEDQAVTD+584                                             04573000
AVTHB    EQU   IEDQAVTD+580                                             04574000
AVTR1    EQU   IEDQAVTD+576                                             04575000
AVTBZ    EQU   IEDQAVTD+572                                             04576000
AVTEZ    EQU   IEDQAVTD+568                                             04577000
AVTEC    EQU   IEDQAVTD+564                                             04578000
AVTEW    EQU   IEDQAVTD+560                                             04579000
AVTNDIAL EQU   AVTSCOPT                                                 04580000
AVTN2741 EQU   AVTSCOPT                                                 04581000
AVTCONCO EQU   AVTSCOPT                                                 04582000
AVTCONC  EQU   AVTSCOPT                                                 04583000
AVTCMBUF EQU   AVTSCOPT                                                 04584000
AVTAPDMP EQU   AVTSCOPT                                                 04585000
@NM00016 EQU   AVTSCOPT                                                 04586000
AVTHA    EQU   AVTDISP                                                  04587000
AVTEA    EQU   IEDQAVTD+548                                             04588000
AVTAX    EQU   IEDQAVTD+544                                             04589000
AVTA3    EQU   IEDQAVTD+540                                             04590000
AVTGD    EQU   IEDQAVTD+536                                             04591000
AVTAL    EQU   IEDQAVTD+532                                             04592000
AVTOLTST EQU   AVTHG02                                                  04593000
AVTE8    EQU   IEDQAVTD+524                                             04594000
AVTUI    EQU   IEDQAVTD+520                                             04595000
AVTCOMPT EQU   IEDQAVTD+516                                             04596000
AVTCRSRF EQU   IEDQAVTD+512                                             04597000
@NM00015 EQU   IEDQAVTD+508                                             04598000
AVTKA02  EQU   IEDQAVTD+504                                             04599000
AVTOPTPT EQU   IEDQAVTD+500                                             04600000
AVTPCBPT EQU   IEDQAVTD+496                                             04601000
@NM00014 EQU   AVTECB1                                                  04602000
AVTCOMP  EQU   AVTECB1                                                  04603000
@NM00013 EQU   AVTECB1                                                  04604000
AVTOPECA EQU   IEDQAVTD+488                                             04605000
AVTOLECA EQU   IEDQAVTD+484                                             04606000
AVTCKECA EQU   IEDQAVTD+480                                             04607000
AVTCWECA EQU   IEDQAVTD+476                                             04608000
AVTCWTCB EQU   IEDQAVTD+472                                             04609000
AVTOLTCB EQU   IEDQAVTD+468                                             04610000
AVTOCTCB EQU   IEDQAVTD+464                                             04611000
AVTCKTCB EQU   IEDQAVTD+460                                             04612000
AVTAS    EQU   IEDQAVTD+456                                             04613000
AVTNOLBF EQU   IEDQAVTD+454                                             04614000
AVTNCKPR EQU   IEDQAVTD+453                                             04615000
AVTCIB   EQU   IEDQAVTD+452                                             04616000
AVTSPLPT EQU   IEDQAVTD+448                                             04617000
AVTSBTA  EQU   IEDQAVTD+440                                             04618000
AVTRARTN EQU   IEDQAVTD+436                                             04619000
AVTBSCAN EQU   IEDQAVTD+432                                             04620000
AVTRDYA  EQU   IEDQAVTD+428                                             04621000
AVTDISTR EQU   IEDQAVTD+420                                             04622000
AVTPARM3 EQU   IEDQAVTD+416                                             04623000
@NM00012 EQU   AVTPKF                                                   04624000
@NM00011 EQU   AVTPKF                                                   04625000
@NM00010 EQU   AVTPKF                                                   04626000
AVTFTCHF EQU   AVTPKF                                                   04627000
@NM00009 EQU   AVTPKF                                                   04628000
@NM00008 EQU   AVTPKF                                                   04629000
@NM00007 EQU   AVTPKF                                                   04630000
@NM00006 EQU   AVTPKF                                                   04631000
AVTPARM  EQU   IEDQAVTD+408                                             04632000
AVTEXS2A EQU   IEDQAVTD+402                                             04633000
AVTEXA2S EQU   IEDQAVTD+396                                             04634000
AVTOCGET EQU   IEDQAVTD+392                                             04635000
AVTCKAVT EQU   @NM00004+1                                               04636000
@NM00005 EQU   AVTCKFLG                                                 04637000
AVTCKHLT EQU   AVTCKFLG                                                 04638000
AVTCKREQ EQU   AVTCKFLG                                                 04639000
AVTCKENV EQU   AVTCKFLG                                                 04640000
AVTCKNAC EQU   AVTCKFLG                                                 04641000
AVTCKTAC EQU   AVTCKFLG                                                 04642000
AVTBUENT EQU   IEDQAVTD+386                                             04643000
@NM00003 EQU   IEDQAVTD+385                                             04644000
AVTFULLT EQU   AVTBUFSW                                                 04645000
AVTUNCON EQU   AVTBUFSW                                                 04646000
@NM00002 EQU   AVTBUFSW                                                 04647000
AVTBUFTR EQU   AVTREADD                                                 04648000
AVTREADY EQU   IEDQAVTD+376                                             04649000
AVTRACE  EQU   IEDQAVTD+372                                             04650000
AVTTCB   EQU   IEDQAVTD+368                                             04651000
AVTPASWD EQU   IEDQAVTD+360                                             04652000
AVTCTLCH EQU   IEDQAVTD+352                                             04653000
AVTDOUBL EQU   IEDQAVTD+344                                             04654000
AVTDOUBX EQU   IEDQAVTD+336                                             04655000
AVTDPARM EQU   IEDQAVTD+332                                             04656000
AVTDLQ   EQU   AVTSAVEX+32                                              04657000
@NM00001 EQU   AVTSAVEX                                                 04658000
AVTSAVE4 EQU   IEDQAVTD+216                                             04659000
AVTSAVE3 EQU   IEDQAVTD+144                                             04660000
AVTSAVE2 EQU   IEDQAVTD+72                                              04661000
AVTSAVE1 EQU   IEDQAVTD                                                 04662000
@NM00258 EQU   PSA+3668                                                 04663000
PSASTAK  EQU   PSA+3072                                                 04664000
@NM00257 EQU   PSA+1040                                                 04665000
PSAUSEND EQU   PSA+1040                                                 04666000
PSAWTCOD EQU   PSA+1036                                                 04667000
PSAATCVT EQU   PSA+1032                                                 04668000
PSAPCPSW EQU   PSA+1024                                                 04669000
PSAPIR2  EQU   PSA+1020                                                 04670000
PSARV059 EQU   PSA+1018                                                 04671000
PSASVC13 EQU   PSA+1016                                                 04672000
PSALSFCC EQU   PSA+1012                                                 04673000
PSASFACC EQU   PSA+1008                                                 04674000
PSASTOP  EQU   PSA+992                                                  04675000
PSASTART EQU   PSA+976                                                  04676000
PSARSPSW EQU   PSA+968                                                  04677000
PSASRPSW EQU   PSA+960                                                  04678000
PSARV045 EQU   PSA+892                                                  04679000
PSARV044 EQU   PSA+888                                                  04680000
PSARV043 EQU   PSA+884                                                  04681000
PSARV042 EQU   PSA+880                                                  04682000
PSARV041 EQU   PSA+876                                                  04683000
PSARV040 EQU   PSA+872                                                  04684000
PSARV025 EQU   PSA+868                                                  04685000
PSADSSED EQU   PSA+868                                                  04686000
PSADSSPR EQU   PSA+864                                                  04687000
PSADSSFW EQU   PSA+860                                                  04688000
PSADSS14 EQU   PSA+856                                                  04689000
PSADSSPP EQU   PSA+848                                                  04690000
PSADSSRP EQU   PSA+840                                                  04691000
PSADSS05 EQU   PSADSSF4                                                 04692000
PSADSS10 EQU   PSADSSF4                                                 04693000
PSADSSVE EQU   PSADSSF4                                                 04694000
PSADSSDE EQU   PSADSSF4                                                 04695000
PSADSSC0 EQU   PSADSSF4                                                 04696000
PSADSSIE EQU   PSADSSF4                                                 04697000
PSADSS12 EQU   PSADSSF4                                                 04698000
PSADSSRC EQU   PSADSSF4                                                 04699000
PSARV057 EQU   PSADSSF3                                                 04700000
PSARV056 EQU   PSADSSF3                                                 04701000
PSARV055 EQU   PSADSSF3                                                 04702000
PSADSSMC EQU   PSADSSF3                                                 04703000
PSADSSRW EQU   PSADSSF3                                                 04704000
PSADSSNM EQU   PSADSSF3                                                 04705000
PSADSSES EQU   PSADSSF3                                                 04706000
PSADSSGP EQU   PSADSSF3                                                 04707000
PSADSSF2 EQU   PSADSSFL+1                                               04708000
PSADSSPI EQU   PSADSSF1                                                 04709000
PSADSSOI EQU   PSADSSF1                                                 04710000
PSADSSSP EQU   PSADSSF1                                                 04711000
PSADSSTP EQU   PSADSSF1                                                 04712000
PSADSSDW EQU   PSADSSF1                                                 04713000
PSADSSDD EQU   PSADSSF1                                                 04714000
PSADSSDM EQU   PSADSSF1                                                 04715000
PSADSSMV EQU   PSADSSF1                                                 04716000
PSADSSTS EQU   PSA+816                                                  04717000
PSADSSWK EQU   PSA+812                                                  04718000
PSADSSR3 EQU   PSA+808                                                  04719000
PSADSSR2 EQU   PSA+804                                                  04720000
PSADSSRS EQU   PSA+800                                                  04721000
PSASTOR  EQU   PSA+796                                                  04722000
PSACPUSA EQU   PSA+794                                                  04723000
PSAVSTAP EQU   PSA+792                                                  04724000
PSAWKVAP EQU   PSA+788                                                  04725000
PSAWKRAP EQU   PSA+784                                                  04726000
PSAMCHIC EQU   PSA+783                                                  04727000
PSARV061 EQU   PSA+782                                                  04728000
PSASYMSK EQU   PSA+781                                                  04729000
PSAMCHFL EQU   PSA+780                                                  04730000
PSACR0   EQU   PSA+776                                                  04731000
PSAPSWSV EQU   PSA+768                                                  04732000
PSACLHS  EQU   PSAHLHI                                                  04733000
PSALKR15 EQU   PSALKSA+60                                               04734000
PSALKR14 EQU   PSALKSA+56                                               04735000
PSALKR13 EQU   PSALKSA+52                                               04736000
PSALKR12 EQU   PSALKSA+48                                               04737000
PSALKR11 EQU   PSALKSA+44                                               04738000
PSALKR10 EQU   PSALKSA+40                                               04739000
PSALKR9  EQU   PSALKSA+36                                               04740000
PSALKR8  EQU   PSALKSA+32                                               04741000
PSALKR7  EQU   PSALKSA+28                                               04742000
PSALKR6  EQU   PSALKSA+24                                               04743000
PSALKR5  EQU   PSALKSA+20                                               04744000
PSALKR4  EQU   PSALKSA+16                                               04745000
PSALKR3  EQU   PSALKSA+12                                               04746000
PSALKR2  EQU   PSALKSA+8                                                04747000
PSALKR1  EQU   PSALKSA+4                                                04748000
PSALKR0  EQU   PSALKSA                                                  04749000
PSARV023 EQU   PSACLHT+52                                               04750000
PSALOCAL EQU   PSACLHT+48                                               04751000
PSACMSL  EQU   PSACLHT+44                                               04752000
PSAOPTL  EQU   PSACLHT+40                                               04753000
PSATPACL EQU   PSACLHT+36                                               04754000
PSATPDNL EQU   PSACLHT+32                                               04755000
PSATPNCL EQU   PSACLHT+28                                               04756000
PSAIOSLL EQU   PSACLHT+24                                               04757000
PSAIOSUL EQU   PSACLHT+20                                               04758000
PSAIOSCL EQU   PSACLHT+16                                               04759000
PSAIOSSL EQU   PSACLHT+12                                               04760000
PSASALCL EQU   PSACLHT+8                                                04761000
PSAASML  EQU   PSACLHT+4                                                04762000
PSADISPL EQU   PSACLHT                                                  04763000
PSASRSA  EQU   PSA+636                                                  04764000
PSARV050 EQU   PSA+634                                                  04765000
PSADSSGO EQU   PSA+633                                                  04766000
PSARECUR EQU   PSA+632                                                  04767000
PSAHLHIS EQU   PSA+628                                                  04768000
PSAIPCSA EQU   PSA+624                                                  04769000
@NM00256 EQU   PSA+621                                                  04770000
PSAIPCDM EQU   PSA+620                                                  04771000
PSAIPCD  EQU   PSA+616                                                  04772000
@NM00255 EQU   PSA+613                                                  04773000
PSAIPCRM EQU   PSA+612                                                  04774000
PSAIPCR  EQU   PSA+608                                                  04775000
PSAMCHEX EQU   PSA+600                                                  04776000
PSAMPSW  EQU   PSA+592                                                  04777000
PSAEXPS2 EQU   PSA+584                                                  04778000
PSAEXPS1 EQU   PSA+576                                                  04779000
PSAPIREG EQU   PSA+572                                                  04780000
PSARSREG EQU   PSA+568                                                  04781000
PSAGPREG EQU   PSA+556                                                  04782000
PSARV022 EQU   PSASUP4                                                  04783000
PSARV021 EQU   PSASUP4                                                  04784000
PSARV020 EQU   PSASUP4                                                  04785000
PSARV019 EQU   PSASUP4                                                  04786000
PSARV018 EQU   PSASUP4                                                  04787000
PSARV017 EQU   PSASUP4                                                  04788000
PSARV016 EQU   PSASUP4                                                  04789000
PSARV015 EQU   PSASUP4                                                  04790000
PSARV014 EQU   PSASUP3                                                  04791000
PSARV013 EQU   PSASUP3                                                  04792000
PSARV012 EQU   PSASUP3                                                  04793000
PSARV011 EQU   PSASUP3                                                  04794000
PSASPR   EQU   PSASUP3                                                  04795000
PSAPSREG EQU   PSASUP3                                                  04796000
PSAPI2   EQU   PSASUP3                                                  04797000
PSAIOSUP EQU   PSASUP3                                                  04798000
PSALCR   EQU   PSASUP2                                                  04799000
PSARTM   EQU   PSASUP2                                                  04800000
PSAACR   EQU   PSASUP2                                                  04801000
PSAIPCE2 EQU   PSASUP2                                                  04802000
PSAIPCES EQU   PSASUP2                                                  04803000
PSAIPCEC EQU   PSASUP2                                                  04804000
PSAGTF   EQU   PSASUP2                                                  04805000
PSAIPCRI EQU   PSASUP2                                                  04806000
PSAIPCRP EQU   PSASUP1                                                  04807000
PSAIPCDR EQU   PSASUP1                                                  04808000
PSADISP  EQU   PSASUP1                                                  04809000
PSALOCK  EQU   PSASUP1                                                  04810000
PSAPI    EQU   PSASUP1                                                  04811000
PSAEXT   EQU   PSASUP1                                                  04812000
PSASVC   EQU   PSASUP1                                                  04813000
PSAIO    EQU   PSASUP1                                                  04814000
PSAAOLD  EQU   PSA+548                                                  04815000
PSAANEW  EQU   PSA+544                                                  04816000
PSATOLD  EQU   PSA+540                                                  04817000
PSATNEW  EQU   PSA+536                                                  04818000
PSALCCAR EQU   PSA+532                                                  04819000
PSALCCAV EQU   PSA+528                                                  04820000
PSAPCCAR EQU   PSA+524                                                  04821000
PSAPCCAV EQU   PSA+520                                                  04822000
PSACPULA EQU   PSA+518                                                  04823000
PSACPUPA EQU   PSA+516                                                  04824000
PSAPSA   EQU   PSA+512                                                  04825000
FLCHDEND EQU   PSA+512                                                  04826000
FLCCRSAV EQU   FLCMCLA+280                                              04827000
FLCGRSAV EQU   FLCMCLA+216                                              04828000
FLCFPSAV EQU   FLCMCLA+184                                              04829000
FLCFLA   EQU   FLCMCLA+88                                               04830000
FLCRGNCD EQU   FLCMCLA+84                                               04831000
FLCFSAA  EQU   FLCFSA+1                                                 04832000
@NM00254 EQU   FLCFSA                                                   04833000
@NM00253 EQU   FLCMCLA+72                                               04834000
FLCMCIC  EQU   FLCMCLA+64                                               04835000
@NM00252 EQU   FLCMCLA+20                                               04836000
FLCIOAA  EQU   FLCIOA+1                                                 04837000
@NM00251 EQU   FLCIOA                                                   04838000
@NM00250 EQU   FLCMCLA+15                                               04839000
@NM00249 EQU   FLCMCLA+14                                               04840000
@NM00248 EQU   FLCMCLA+12                                               04841000
FLCLCL   EQU   FLCMCLA+8                                                04842000
FLCIOELA EQU   FLCIOEL+1                                                04843000
@NM00247 EQU   FLCIOEL                                                  04844000
FLCCHNID EQU   FLCMCLA                                                  04845000
@NM00246 EQU   PSA+160                                                  04846000
FLCMTRCD EQU   PSA+157                                                  04847000
@NM00245 EQU   PSA+156                                                  04848000
FLCPERA  EQU   FLCPER+1                                                 04849000
@NM00244 EQU   FLCPER                                                   04850000
@NM00243 EQU   PSA+151                                                  04851000
FLCPERCD EQU   PSA+150                                                  04852000
FLCMCNUM EQU   PSA+149                                                  04853000
@NM00242 EQU   PSA+148                                                  04854000
FLCTEAA  EQU   FLCTEA+1                                                 04855000
@NM00241 EQU   FLCTEA                                                   04856000
PSAPIPC  EQU   PSAPICOD                                                 04857000
PSAPIMC  EQU   PSAPICOD                                                 04858000
PSAPIPER EQU   PSAPICOD                                                 04859000
PSARV049 EQU   FLCPICOD                                                 04860000
FLCPILCB EQU   FLCPIILC                                                 04861000
@NM00240 EQU   FLCPIILC                                                 04862000
@NM00239 EQU   PSAEPPSW                                                 04863000
FLCSVCN  EQU   PSAESPSW+2                                               04864000
FLCSILCB EQU   FLCSVILC                                                 04865000
@NM00238 EQU   FLCSVILC                                                 04866000
@NM00237 EQU   PSAESPSW                                                 04867000
FLCEICOD EQU   PSAEEPSW+2                                               04868000
PSASPAD  EQU   PSAEEPSW                                                 04869000
@NM00236 EQU   PSA+128                                                  04870000
FLCINPSW EQU   PSA+120                                                  04871000
FLCMNPSW EQU   PSA+112                                                  04872000
FLCPNPSW EQU   PSA+104                                                  04873000
FLCSNPSW EQU   PSA+96                                                   04874000
FLCENPSW EQU   PSA+88                                                   04875000
FLCTRACE EQU   PSA+84                                                   04876000
FLCTIMER EQU   PSA+80                                                   04877000
FLCCVT2  EQU   PSA+76                                                   04878000
FLCCAW   EQU   PSA+72                                                   04879000
FLCCSW   EQU   PSA+64                                                   04880000
FLCIOPSW EQU   PSA+56                                                   04881000
FLCMOPSW EQU   PSA+48                                                   04882000
FLCPOPSW EQU   PSA+40                                                   04883000
FLCSOPSW EQU   PSA+32                                                   04884000
FLCEOPSW EQU   PSA+24                                                   04885000
@NM00235 EQU   FLCICCW2+4                                               04886000
FLCCVT   EQU   FLCICCW2                                                 04887000
FLCICCW1 EQU   FLCROPSW                                                 04888000
FLCIPPSW EQU   FLCRNPSW                                                 04889000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04890000
@RC00525 EQU   @RC00520                                                 04891000
@RC00548 EQU   @RC00520                                                 04892000
@RC00541 EQU   @RC00520                                                 04893000
@RC00603 EQU   @RC00600                                                 04894000
@RT00712 EQU   @RC00711                                                 04895000
@RC00732 EQU   @RC00729                                                 04896000
@RC00665 EQU   @RC00586                                                 04897000
@RC00991 EQU   @RC00990                                                 04898000
@RC00984 EQU   @EL00004                                                 04899000
@PB00004 EQU   @PB00005                                                 04900000
@RC00528 EQU   @RC00525                                                 04901000
@RC00526 EQU   @RC00525                                                 04902000
@RC00634 EQU   @RC00603                                                 04903000
@RC00725 EQU   @RC00665                                                 04904000
@PB00003 EQU   @PB00004                                                 04905000
@RC00750 EQU   @RC00725                                                 04906000
@PB00002 EQU   @PB00003                                                 04907000
@RC00753 EQU   @RC00750                                                 04908000
@ENDDATA EQU   *                                                        04909000
         END   IEDQWA1,(C'PLS2209',0701,78089)                          04910000
