         TITLE 'IEDQW25, SEND SERVICE MODULE                           *00001000
                        '                                               00002000
IEDQW25  CSECT ,                                                01S0001 00003000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00004000
         BALR  @12,0                                            01S0001 00005000
@PSTART  DS    0H                                               01S0001 00006000
         USING @PSTART,@12                                      01S0001 00007000
*                                   /*                                  00008000
IEDQW25 IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO       00009000
*   RAVT=TOTAVTPT;                  /* SET THE AVT BASE              */ 00010000
         L     RAVT,TOTAVTPT(,ROLTCB)                           02S0291 00011000
*   ROLTWK=ADDR(TOTSERV);           /* SET THE BASE REGISTER TO BE      00012000
*                                      USED FOR ADDRESSING AUTOMATIC    00013000
*                                      DATA                          */ 00014000
         LA    ROLTWK,TOTSERV(,ROLTCB)                          02S0292 00015000
*   GEN REFS(ROLTWK) NOSETS;                                    02S0293 00016000
*                                   /*                                  00017000
      USING @DATD,ROLTWK              INFORM THE ASSEMBLER OF THE       00018000
*                                     BASE REGISTER TO BE USED FOR      00019000
*                                     ADDRESSING AUTOMATIC DATA*/       00020000
*   TOTSAVE1(5:8)=RSAVE;            /* SAVE CALLER SAVE AREA IN 02S0294 00021000
*                                      IEDQW25 SAVE AREA             */ 00022000
         STCM  RSAVE,15,TOTSAVE1+4(ROLTCB)                      02S0294 00023000
*   RSAVE=ADDR(TOTSAVE1);           /* SET IEDQW25 SAVE AREA ADDRESS */ 00024000
         LA    RSAVE,TOTSAVE1(,ROLTCB)                          02S0295 00025000
*                                                               02S0296 00026000
*   /*****************************************************************/ 00027000
*   /*                                                               */ 00028000
*   /* PROCESS: THIS SEGMENT DOES THE PROCESSING THAT IS NECESSARY TO*/ 00029000
*   /* PERFORM THE FUNCTION OF THE MODULE.                           */ 00030000
*   /*                                                               */ 00031000
*   /*****************************************************************/ 00032000
*                                                               02S0296 00033000
*                                                               03S0296 00034000
*   /*****************************************************************/ 00035000
*   /*                                                               */ 00036000
*   /* PROCESS.INITIAL: THIS SEGMENT DOES THE INITIAL PROCESSING.    */ 00037000
*   /*                                                               */ 00038000
*   /*****************************************************************/ 00039000
*                                                               03S0296 00040000
*   DO;                                                         03S0296 00041000
*     ERRSW=OFF;                    /* INITIALIZE THE ERROR SWITCH TO   00042000
*                                      ZERO                          */ 00043000
         NI    ERRSW,B'01111111'                                03S0297 00044000
*   END;                                                        03S0298 00045000
*                                                               03S0299 00046000
*   /*****************************************************************/ 00047000
*   /*                                                               */ 00048000
*   /* PROCESS.PRIRSEC: THIS SEGMENT DOES THE PRIMARY OR SECONDARY   */ 00049000
*   /* DEVICE CHECKING                                               */ 00050000
*   /*                                                               */ 00051000
*   /*****************************************************************/ 00052000
*                                                               03S0299 00053000
*   RFY                                                         03S0299 00054000
*     RPARM RSTD;                   /* RESTRICT REGISTER 1           */ 00055000
*   RFY                                                         03S0300 00056000
*     RWORK RSTD;                   /* RESTRICT REGISTER 0           */ 00057000
*   BASRPAR=RPARM;                  /* SAVE SEND PARM ADDRESS        */ 00058000
         ST    RPARM,BASRPAR(,ROLTCB)                           03S0301 00059000
*   RTECB=SENDTCB;                  /* SET UP POINTER TO THE TECB       00060000
*                                      FIELD                         */ 00061000
         L     @11,SENDTCB(,RSEND)                              03S0302 00062000
         LR    RTECB,@11                                        03S0302 00063000
*   IF SENDTCB=ZERO|TECBSNCT=BZERO|TECBSNOC=BZERO THEN          03S0303 00064000
         LTR   @11,@11                                          03S0303 00065000
         BZ    @RT00303                                         03S0303 00066000
         CLI   TECBSNCT(RTECB),X'00'                            03S0303 00067000
         BE    @RT00303                                         03S0303 00068000
         CLI   TECBSNOC(RTECB),X'00'                            03S0303 00069000
         BNE   @RF00303                                         03S0303 00070000
@RT00303 DS    0H                                               03S0304 00071000
*     DO;                           /* IS TECB OMITTED OF SENSE 03S0304 00072000
*                                      COUNTS ZERO           @YM08477*/ 00073000
*       RLTCB=ADDR(SENSDFLT);       /* SET UP SENSE DEFAULT ADDRESS     00074000
*                                      IN TECB SENSE ADDRESS REGISTER   00075000
*                                                            @YM08477*/ 00076000
         LA    RLTCB,@CB02392                                   03S0305 00077000
*     END;                                                      03S0306 00078000
*   ELSE                                                        03S0307 00079000
*     DO;                                                       03S0307 00080000
         B     @RC00303                                         03S0307 00081000
@RF00303 DS    0H                                               03S0308 00082000
*       IF TECBSNOC<TECBSNCT THEN                               03S0308 00083000
         CLC   TECBSNOC(1,RTECB),TECBSNCT(RTECB)                03S0308 00084000
         BNL   @RF00308                                         03S0308 00085000
*         DO;                       /* IS NUMBER OF SENSE OCCURRED      00086000
*                                      LOWER                         */ 00087000
*           RLTCB=ADDR(TECBFD01)+(TECBSNOC*TECBSNLN)+(TECBFDCT*TECBFDLN 00088000
*               );                  /* SET UP POINTER TO THE TECB       00089000
*                                      SENSE FIELD           @YM08477*/ 00090000
         LA    @11,TECBFD01(,RTECB)                             03S0310 00091000
         LH    @09,TECBSNLN(,RTECB)                             03S0310 00092000
         N     @09,@CF02514                                     03S0310 00093000
         SLR   @07,@07                                          03S0310 00094000
         IC    @07,TECBSNOC(,RTECB)                             03S0310 00095000
         MR    @08,@07                                          03S0310 00096000
         ALR   @11,@09                                          03S0310 00097000
         SLR   @09,@09                                          03S0310 00098000
         IC    @09,TECBFDLN(,RTECB)                             03S0310 00099000
         SLR   @07,@07                                          03S0310 00100000
         IC    @07,TECBFDCT(,RTECB)                             03S0310 00101000
         MR    @08,@07                                          03S0310 00102000
         ALR   @11,@09                                          03S0310 00103000
         LR    RLTCB,@11                                        03S0310 00104000
*         END;                                                  03S0311 00105000
*       ELSE                                                    03S0312 00106000
*         RLTCB=ADDR(TECBFD01)+(TECBSNCT*TECBSNLN)+(TECBFDCT*TECBFDLN); 00107000
         B     @RC00308                                         03S0312 00108000
@RF00308 LA    @11,TECBFD01(,RTECB)                             03S0312 00109000
         LH    @09,TECBSNLN(,RTECB)                             03S0312 00110000
         N     @09,@CF02514                                     03S0312 00111000
         SLR   @07,@07                                          03S0312 00112000
         IC    @07,TECBSNCT(,RTECB)                             03S0312 00113000
         MR    @08,@07                                          03S0312 00114000
         ALR   @11,@09                                          03S0312 00115000
         SLR   @09,@09                                          03S0312 00116000
         IC    @09,TECBFDLN(,RTECB)                             03S0312 00117000
         SLR   @07,@07                                          03S0312 00118000
         IC    @07,TECBFDCT(,RTECB)                             03S0312 00119000
         MR    @08,@07                                          03S0312 00120000
         ALR   @11,@09                                          03S0312 00121000
         LR    RLTCB,@11                                        03S0312 00122000
*                                   /* SET UP POINTER TO THE TECB       00123000
*                                      SENSE FIELD           @YM08477*/ 00124000
*     END;                                                      03S0313 00125000
@RC00308 DS    0H                                               03S0314 00126000
*   BASRTEC=RLTCB;                  /* SAVE TECB SENSE FIELD POINTER    00127000
*                                                            @YM08477*/ 00128000
@RC00303 ST    RLTCB,BASRTEC(,ROLTCB)                           03S0314 00129000
*   IF SENDCDS=ZERO THEN                                        03S0315 00130000
         L     @11,SENDCDS(,RSEND)                              03S0315 00131000
         LTR   @11,@11                                          03S0315 00132000
         BNZ   @RF00315                                         03S0315 00133000
*     DO;                           /* CHECK THE CONFIGURATION BYTE     00134000
*                                      FOR ZERO                      */ 00135000
*       RIOB=ADDR(TOTPRIBK);        /* SET UP IOBLOCK BASE POINTER      00136000
*                                      FOR PRIMARY DEVICE ENTRY      */ 00137000
         LA    @11,TOTPRIBK(,ROLTCB)                            03S0317 00138000
         LR    RIOB,@11                                         03S0317 00139000
*       BASRIOB=ADDR(TOTPRIBK);     /* SAVE THE IOBLOCK BASE POINTER    00140000
*                                      FOR THE PRIMARY DEVICE ENTRY  */ 00141000
         ST    @11,BASRIOB(,ROLTCB)                             03S0318 00142000
*       OLTPRSC=ON;                 /* SET TEST DEVICE BIT ON FOR       00143000
*                                      PRIMARY DEVICE                */ 00144000
         OI    OLTPRSC(RIOB),B'00100000'                        03S0319 00145000
*     END;                                                      03S0320 00146000
*   ELSE                                                        03S0321 00147000
*     DO;                                                       03S0321 00148000
         B     @RC00315                                         03S0321 00149000
@RF00315 DS    0H                                               03S0322 00150000
*       RFY                                                     03S0322 00151000
*         RCDS RSTD;                /* RESTRICT REGISTER 8           */ 00152000
*       RCDS=SENDCDS;               /* SETUP CDS ADDRESS             */ 00153000
         L     RCDS,SENDCDS(,RSEND)                             03S0323 00154000
*       IF TOTTNTPR->TESTDSN(1:TOTTTBEL)=LCDSSMNM(1:TOTTTBEL) THEN      00155000
         L     @11,TOTTNTPR(,ROLTCB)                            03S0324 00156000
         SLR   @09,@09                                          03S0324 00157000
         IC    @09,TOTTTBEL(,ROLTCB)                            03S0324 00158000
         BCTR  @09,0                                            03S0324 00159000
         EX    @09,@SC02516                                     03S0324 00160000
         BNE   @RF00324                                         03S0324 00161000
*         DO;                       /* IS PRIMARY TNT ENTRY EQUAL TO    00162000
*                                      CDS SYMBOLIC NAME             */ 00163000
*           RIOB=ADDR(TOTPRIBK);    /* SET UP IOBLOCK BASE POINTER      00164000
*                                      FOR PRIMARY DEVICE ENTRY      */ 00165000
         LA    @11,TOTPRIBK(,ROLTCB)                            03S0326 00166000
         LR    RIOB,@11                                         03S0326 00167000
*           BASRIOB=ADDR(TOTPRIBK); /* SAVE THE IOBLOCK BASE POINTER    00168000
*                                      FOR THE PRIMARY DEVICE ENTRY  */ 00169000
         ST    @11,BASRIOB(,ROLTCB)                             03S0327 00170000
*           OLTPRSC=ON;             /* SET TEST DEVICE BIT ON FOR       00171000
*                                      PRIMARY DEVICE                */ 00172000
         OI    OLTPRSC(RIOB),B'00100000'                        03S0328 00173000
*         END;                                                  03S0329 00174000
*       ELSE                                                    03S0330 00175000
*         IF TOTSRTNT->TESTDSN(1:TOTTTBEL)=LCDSSMNM(1:TOTTTBEL) THEN    00176000
         B     @RC00324                                         03S0330 00177000
@RF00324 L     @11,TOTSRTNT(,ROLTCB)                            03S0330 00178000
         SLR   @09,@09                                          03S0330 00179000
         IC    @09,TOTTTBEL(,ROLTCB)                            03S0330 00180000
         BCTR  @09,0                                            03S0330 00181000
         EX    @09,@SC02516                                     03S0330 00182000
         BNE   @RF00330                                         03S0330 00183000
*           DO;                     /* IS SECONDARY TNT ENTRY EQUAL     00184000
*                                      TO CDS SYMBOLIC NAME          */ 00185000
*             RIOB=ADDR(TOTSCIBK);  /* SET UP THE BASE POINTER FOR      00186000
*                                      THE SECONDARY DEVICE ENTRY    */ 00187000
         LA    @11,TOTSCIBK(,ROLTCB)                            03S0332 00188000
         LR    RIOB,@11                                         03S0332 00189000
*             BASRIOB=ADDR(TOTSCIBK);/* SAVE THE BASE POINTER FOR THE   00190000
*                                      SECONDARY DEVICE ENTRY        */ 00191000
         ST    @11,BASRIOB(,ROLTCB)                             03S0333 00192000
*             OLTPRSC=OFF;          /* SET TEST DEVICE BIT ON FOR       00193000
*                                      SECONDARY DEVICE              */ 00194000
         NI    OLTPRSC(RIOB),B'11011111'                        03S0334 00195000
*           END;                                                03S0335 00196000
*         ELSE                                                  03S0336 00197000
*           DO;                                                 03S0336 00198000
         B     @RC00330                                         03S0336 00199000
@RF00330 DS    0H                                               03S0337 00200000
*             RETCDE=DEVNPRSC;      /* SET RETURN CODE OF 08 IN 03S0337 00201000
*                                      REGISTER 15 INDICATING DEVICE    00202000
*                                      NOT PRIMARY OR SECONDARY      */ 00203000
         LA    RETCDE,8                                         03S0337 00204000
*             CALL ERREXIT;         /* CALL THE ERROR EXIT SUBROUTINE*/ 00205000
         BAL   @14,ERREXIT                                      03S0338 00206000
*           END;                                                03S0339 00207000
*     END;                                                      03S0340 00208000
@RC00330 DS    0H                                               03S0340 00209000
@RC00324 DS    0H                                               03S0341 00210000
*   IF ERRSW=ON THEN                                            03S0341 00211000
@RC00315 TM    ERRSW,B'10000000'                                03S0341 00212000
         BNO   @RF00341                                         03S0341 00213000
*     DO;                           /* TEST ERROR SWITCH TO GET TO      00214000
*                                      EXIT                          */ 00215000
*     END;                                                      03S0343 00216000
*   ELSE                                                        03S0344 00217000
*     DO;                                                       03S0344 00218000
         B     @RC00341                                         03S0344 00219000
@RF00341 DS    0H                                               03S0345 00220000
*       RIOB=BASRIOB;               /* SET UP IOBLOCK BASE POINTER   */ 00221000
         L     RIOB,BASRIOB(,ROLTCB)                            03S0345 00222000
*       RPARM=OLTTCOFF;             /* GET COUNTERFEIT TNT OFFSET       00223000
*                                      (TTCIN)                       */ 00224000
         LH    RPARM,OLTTCOFF(,RIOB)                            03S0346 00225000
         N     RPARM,@CF02514                                   03S0346 00226000
*       CALL IEDQTNT;               /* FIND TTE ADDRESS              */ 00227000
         L     @15,AVTRNMPT(,RAVT)                              03S0347 00228000
         BALR  @14,@15                                          03S0347 00229000
*       RTRM=RTRM-LENGTH(IEDNTRM);  /* ADJUST TTE BASE               */ 00230000
         SL    RTRM,@CF02134                                    03S0348 00231000
*       BASRTRM=RTRM;               /* SAVE TTE ADDRESS              */ 00232000
         ST    RTRM,BASRTRM(,ROLTCB)                            03S0349 00233000
*       IF TRMPREF=ON&TRMTYPE=TRMLUNT THEN                      03S0350 00234000
         TM    TRMPREF(RTRM),B'00010000'                        03S0350 00235000
         BNO   @RF00350                                         03S0350 00236000
         CLI   TRMTYPE(RTRM),X'30'                              03S0350 00237000
         BNE   @RF00350                                         03S0350 00238000
*         DO;                       /* IS THIS A 3705 LU RESOURCE    */ 00239000
*           RDCT=AVTCSTCS+(TRMCHCIN-1)*AVTDCTLN;/* DCT ENTRY ADDRESS */ 00240000
         SLR   @07,@07                                          03S0352 00241000
         IC    @07,TRMCHCIN(,RTRM)                              03S0352 00242000
         BCTR  @07,0                                            03S0352 00243000
         MH    @07,AVTDCTLN(,RAVT)                              03S0352 00244000
         AL    @07,AVTCSTCS(,RAVT)                              03S0352 00245000
         LR    RDCT,@07                                         03S0352 00246000
*           RSEND=BASRPAR;          /* SET UP THE SEND PARAMETER LIST   00247000
*                                      POINTER                       */ 00248000
         L     RSEND,BASRPAR(,ROLTCB)                           03S0353 00249000
*           IF SENDTCB^=ZERO THEN                               03S0354 00250000
         L     @11,SENDTCB(,RSEND)                              03S0354 00251000
         LTR   @11,@11                                          03S0354 00252000
         BZ    @RF00354                                         03S0354 00253000
*             DO;                   /* TECB ADDRESS ZERO     @YM08477*/ 00254000
*               RTECB=SENDTCB;      /* SET UP THE TECB BASE POINTER  */ 00255000
         LR    RTECB,@11                                        03S0356 00256000
*               IF LCDSFBTE=ASCII THEN                          03S0357 00257000
         CLI   LCDSFBTE(RCDS),X'80'                             03S0357 00258000
         BNE   @RF00357                                         03S0357 00259000
*                 LTCBALT=ON;       /* TURN ON THE ASCII BIT IN THE     00260000
*                                      TECB                          */ 00261000
         OI    LTCBALT(RLTCB),B'00001000'                       03S0358 00262000
*               ELSE                                            03S0359 00263000
*                 LTCBALT=OFF;      /* TURN OFF THE ASCII BIT IN THE    00264000
*                                      TECB                          */ 00265000
         B     @RC00357                                         03S0359 00266000
@RF00357 NI    LTCBALT(RLTCB),B'11110111'                       03S0359 00267000
*             END;                  /*                       @YM08477*/ 00268000
*         END;                                                  03S0361 00269000
*       ELSE                                                    03S0362 00270000
*         DO;                                                   03S0362 00271000
         B     @RC00350                                         03S0362 00272000
@RF00350 DS    0H                                               03S0363 00273000
*           RETCDE=RC0C;            /* SET RETURN CODE OF 0C-TEST       00274000
*                                      DEVICE IS NOT A 3770 OR 3270     00275000
*                                      TERMINAL                      */ 00276000
         LA    RETCDE,12                                        03S0363 00277000
*           CALL ERREXIT;           /* CALL ERROR EXIT SUBROUTINE    */ 00278000
         BAL   @14,ERREXIT                                      03S0364 00279000
*         END;                                                  03S0365 00280000
*     END;                                                      03S0366 00281000
@RC00350 DS    0H                                               03S0367 00282000
*   RFY                                                         03S0367 00283000
*     RCDS UNRSTD;                                              03S0367 00284000
@RC00341 DS    0H                                               03S0368 00285000
*   RFY                                                         03S0368 00286000
*     RPARM UNRSTD;                                             03S0368 00287000
*   RFY                                                         03S0369 00288000
*     RWORK UNRSTD;                                             03S0369 00289000
*   RFY                                                         02S0370 00290000
*     RPARM RSTD;                                               02S0370 00291000
*   IF ERRSW=ON THEN                                            02S0371 00292000
         TM    ERRSW,B'10000000'                                02S0371 00293000
         BNO   @RF00371                                         02S0371 00294000
*     DO;                           /* IS ERROR EXIT SWITCH OFF 02S0372 00295000
*                                                            @YM08534*/ 00296000
*     END;                          /*                       @YM08534*/ 00297000
*   ELSE                            /*                       @YM08534*/ 00298000
*     DO;                                                       02S0374 00299000
         B     @RC00371                                         02S0374 00300000
@RF00371 DS    0H                                               02S0375 00301000
*       RSEND=BASRPAR;              /* SETUP SEND PARM ADDRESS       */ 00302000
         L     RSEND,BASRPAR(,ROLTCB)                           02S0375 00303000
*       IF SENDSTPE=OFF THEN                                    02S0376 00304000
         TM    SENDSTPE(RSEND),B'00000010'                      02S0376 00305000
         BNZ   @RF00376                                         02S0376 00306000
*         DO;                       /* IS THIS A SEND REQUEST        */ 00307000
*                                                               03S0378 00308000
*           /*********************************************************/ 00309000
*           /*                                                       */ 00310000
*           /* PROCESS.SENDREQ: THIS PROCESS BUILDS THE BUFFER AND   */ 00311000
*           /* POST IT TO THE DESTINATION QCB WHEN A SEND REQUEST IS */ 00312000
*           /* ISSUED BY THE OLT.                                    */ 00313000
*           /*                                                       */ 00314000
*           /*********************************************************/ 00315000
*                                                               03S0378 00316000
*           RFY                                                 03S0378 00317000
*             RSEND RSTD;                                       03S0378 00318000
*           RFY                                                 03S0379 00319000
*             RWORK RSTD;                                       03S0379 00320000
*           RRESPL=TOTRESPL;        /* SET UP THE ADDRESS OF THE        00321000
*                                      RESPL                         */ 00322000
         L     RRESPL,TOTRESPL(,ROLTCB)                         03S0380 00323000
*           RWORK=ADDR(TOTWAWRK);   /* SAVE RETURN ADDRESS           */ 00324000
         LA    RWORK,TOTWAWRK(,ROLTCB)                          03S0381 00325000
*           RPARM=((SENDRLN+AVTHDRSZ+LRHLEN)/AVTKEYLE)+ONE;/*   03S0382 00326000
*                                      CALCULATE THE NUMBER OF UNITS    00327000
*                                      REQUIRED              @YM09025*/ 00328000
         LA    @11,33                                           03S0382 00329000
         LH    @07,SENDRLN(,RSEND)                              03S0382 00330000
         N     @07,@CF02514                                     03S0382 00331000
         ALR   @11,@07                                          03S0382 00332000
         LR    @08,@11                                          03S0382 00333000
         SRDA  @08,32                                           03S0382 00334000
         LH    @11,AVTKEYLE(,RAVT)                              03S0382 00335000
         DR    @08,@11                                          03S0382 00336000
         AL    @09,@CF00063                                     03S0382 00337000
         LR    RPARM,@09                                        03S0382 00338000
*           RSAVE=ADDR(TOTSAVE6);   /* SET UP IEDQWA SAVE AREA       */ 00339000
         LA    RSAVE,TOTSAVE6(,ROLTCB)                          03S0383 00340000
*           CALL ALLOCBUF;          /* CALL IEDQWA TO REQUEST A 03S0384 00341000
*                                      BUFFER                        */ 00342000
         L     @15,RESABUF(,RRESPL)                             03S0384 00343000
         BALR  @14,@15                                          03S0384 00344000
*           RSAVE=ADDR(TOTSAVE1);   /* SET UP IEDQW25 SAVE AREA      */ 00345000
         LA    RSAVE,TOTSAVE1(,ROLTCB)                          03S0385 00346000
*           RFY                                                 03S0386 00347000
*             RPRF RSTD;                                        03S0386 00348000
*           RPRF=RPARM;             /* GET ADDRESS OF BUFFER RETURNED   00349000
*                                      BY TCAM                       */ 00350000
         LR    RPRF,RPARM                                       03S0387 00351000
*           BASRPRF=RPRF;           /* SAVE ADDRESS OF BUFFER   03S0388 00352000
*                                      RETURNED BY TCAM              */ 00353000
         ST    RPRF,BASRPRF(,ROLTCB)                            03S0388 00354000
*           RLCB=ADDR(TOTWKSPC)-(ADDR(LCBRCQCB)-ADDR(IEDQLCB));/* MAP   00355000
*                                      LCB STRUCTURE ON THE WORKSPACE   00356000
*                                      IN THE OLTCB                  */ 00357000
         LA    @11,TOTWKSPC(,ROLTCB)                            03S0389 00358000
         LR    @09,@11                                          03S0389 00359000
         SL    @09,@CF01514                                     03S0389 00360000
         LR    RLCB,@09                                         03S0389 00361000
*           BASRLCB=RLCB;           /* SAVE ADDRESS OF THE LCB  03S0390 00362000
*                                                            @YM08477*/ 00363000
         ST    RLCB,BASRLCB(,ROLTCB)                            03S0390 00364000
*           RTTCP=ADDR(TOTWKSPC);   /* SET UP TOTE/TCAM BASE POINTER    00365000
*                                                            @YM08477*/ 00366000
         LR    RTTCP,@11                                        03S0391 00367000
*           RTRM=BASRTRM;           /* GET POINTER FROM BASE POINTER    00368000
*                                      SAVE AREA                     */ 00369000
         L     RTRM,BASRTRM(,ROLTCB)                            03S0392 00370000
*           RSCB=ADDR(TTCSCB);      /* GET ADDRESS BASE FOR SCB FOUND   00371000
*                                      IN THE WORKAREA               */ 00372000
         LA    @09,40                                           03S0393 00373000
         LR    RSCB,RTTCP                                       03S0393 00374000
         ALR   RSCB,@09                                         03S0393 00375000
         LA    @07,TTCSCB(,RSCB)                                03S0393 00376000
         LR    RSCB,@07                                         03S0393 00377000
*           RFY                                                 03S0394 00378000
*             IEDQLCB BASED(RRETURN);/*                      @YM08477*/ 00379000
*           RRETURN=BASRLCB;        /* SET UP THE LCB ADDRESS   03S0395 00380000
*                                                            @YM08477*/ 00381000
         L     @05,BASRLCB(,ROLTCB)                             03S0395 00382000
         LR    RRETURN,@05                                      03S0395 00383000
*           LCBSCBA=ADDR(TTCSCB);   /* GET SCB ADDRESS               */ 00384000
         STCM  @07,7,LCBSCBA(RRETURN)                           03S0396 00385000
*           SCBSTATE=BZERO;         /* CLEAR STATUS BYTE             */ 00386000
         MVI   SCBSTATE(RSCB),X'00'                             03S0397 00387000
*           SCBDESTQ=TRMDESTQ;      /* POST MSG TO DUMMY QCB         */ 00388000
         MVC   SCBDESTQ(3,RSCB),TRMDESTQ(RTRM)                  03S0398 00389000
*           PRFLCB=RRETURN;         /* SET LCB ADDRESS TO DUMMY LCB     00390000
*                                      IN WORKAREA                   */ 00391000
         STCM  RRETURN,7,PRFLCB(RPRF)                           03S0399 00392000
*           RFY                                                 03S0400 00393000
*             IEDQLCB BASED(RLCB);  /*                       @YM08477*/ 00394000
*           RSEND=BASRPAR;          /* GET BASE POINTER FOR SEND PARM   00395000
*                                      LIST                          */ 00396000
         L     RSEND,BASRPAR(,ROLTCB)                           03S0401 00397000
*           RIOB=BASRIOB;           /* GET BASE POINTER FOR THE TEST    00398000
*                                      ENTRY                         */ 00399000
         L     RIOB,BASRIOB(,ROLTCB)                            03S0402 00400000
*           PRFDEST=OLTTCOFF;       /* CONTERFEIT TTCIN OF THE  03S0403 00401000
*                                      RESOURCE LU                   */ 00402000
         LH    @07,OLTTCOFF(,RIOB)                              03S0403 00403000
         N     @07,@CF02514                                     03S0403 00404000
         STH   @07,PRFDEST(,RPRF)                               03S0403 00405000
*           PRFSIZE=SENDRLN+AVTHDRSZ+LRHLEN;/* SIZE OF DATA IN THE      00406000
*                                      BUFFER EQUAL THE MESSAGE SIZE    00407000
*                                      PLUS PREFIX SIZE PLUS RH      */ 00408000
         LA    @07,33                                           03S0404 00409000
         LH    @05,SENDRLN(,RSEND)                              03S0404 00410000
         N     @05,@CF02514                                     03S0404 00411000
         ALR   @07,@05                                          03S0404 00412000
         STH   @07,PRFSIZE(,RPRF)                               03S0404 00413000
*           RRESPL=TOTRESPL;        /* PUT THE ADDRESS OF THE RESPL     00414000
*                                      IN ITS BASE REGISTER          */ 00415000
         L     RRESPL,TOTRESPL(,ROLTCB)                         03S0405 00416000
*           PRFSRCE=0;                                          03S0406 00417000
         SLR   @05,@05                                          03S0406 00418000
         STH   @05,PRFSRCE(,RPRF)                               03S0406 00419000
*           RFY                                                 03S0407 00420000
*             RPRF UNRSTD;                                      03S0407 00421000
*           BASNBUNT(4:4)=((SENDRLN+AVTHDRSZ+LRHLEN)/AVTKEYLE)+ONE;/*   00422000
*                                      SET UNIT COUNT                */ 00423000
         LR    @08,@07                                          03S0408 00424000
         SRDA  @08,32                                           03S0408 00425000
         LH    @07,AVTKEYLE(,RAVT)                              03S0408 00426000
         DR    @08,@07                                          03S0408 00427000
         AL    @09,@CF00063                                     03S0408 00428000
         STC   @09,BASNBUNT+3(,ROLTCB)                          03S0408 00429000
*           RFY                                                 03S0409 00430000
*             RPRF RSTD;                                        03S0409 00431000
*           RPRF=BASRPRF;           /* RESTORE THE ADDRESS OF THE       00432000
*                                      BUFFER                        */ 00433000
         L     @07,BASRPRF(,ROLTCB)                             03S0410 00434000
         LR    RPRF,@07                                         03S0410 00435000
*           PRFNBUNT=BASNBUNT(4:4); /* SET UNIT COUNT                */ 00436000
         STC   @09,PRFNBUNT(,RPRF)                              03S0411 00437000
*           PRFSTAT1=PRFSTAT1&&PRFSTAT1;/* CLEAR STATUS BYTE         */ 00438000
         XC    PRFSTAT1(1,RPRF),PRFSTAT1(RPRF)                  03S0412 00439000
*           PRFSCAN=PRFSCAN&&PRFSCAN;/* CLEAR SCAN POINTER           */ 00440000
         LH    @09,PRFSCAN(,RPRF)                               03S0413 00441000
         LR    @07,@09                                          03S0413 00442000
         XR    @07,@09                                          03S0413 00443000
         STH   @07,PRFSCAN(,RPRF)                               03S0413 00444000
*           RTTCP=ADDR(TOTWKSPC);   /* SET UP TOTE/TCAM BASE POINTER */ 00445000
         LR    RTTCP,@11                                        03S0414 00446000
*           RSCB=ADDR(TTCSCB);      /* GET ADDRESS OF THE SCB        */ 00447000
         LA    @11,40                                           03S0415 00448000
         ALR   @11,RTTCP                                        03S0415 00449000
         LA    RSCB,TTCSCB(,@11)                                03S0415 00450000
*           PRFQCBA=SCBDESTQ;       /* SET ADDRESS OF QCB TH WHICH      00451000
*                                      BUFFER IS TO BE POSTED        */ 00452000
         MVC   PRFQCBA(3,RPRF),SCBDESTQ(RSCB)                   03S0416 00453000
*           PRFPRI=PRIDESTQ;        /* SET PRIORITY FOR POST TO 03S0417 00454000
*                                      DESTINATION QCB               */ 00455000
         MVI   PRFPRI(RPRF),X'E4'                               03S0417 00456000
*           RTRH=ADDR(PRFSHDR);     /* GET THE ADDRESS OF THE RH        00457000
*                                      BUFFER POSITION               */ 00458000
         LA    RTRH,PRFSHDR(,RPRF)                              03S0418 00459000
*           IF SENDSTPE=ON THEN                                 03S0419 00460000
         TM    SENDSTPE(RSEND),B'00000010'                      03S0419 00461000
         BNO   @RF00419                                         03S0419 00462000
*             TRHTYPE=ON;           /* SET IF RESPONSE OR REQUEST       00463000
*                                      FROM OLT SEND                 */ 00464000
         OI    TRHTYPE(RTRH),B'10000000'                        03S0420 00465000
*           ELSE                                                03S0421 00466000
*             TRHTYPE=OFF;                                      03S0421 00467000
         B     @RC00419                                         03S0421 00468000
@RF00419 NI    TRHTYPE(RTRH),B'01111111'                        03S0421 00469000
*           RLTCB=BASRTEC;          /* PUT THE TECB ADDRESS IN ITS      00470000
*                                      BASE REGISTER         @YM08477*/ 00471000
@RC00419 L     RLTCB,BASRTEC(,ROLTCB)                           03S0422 00472000
*           IF LTCBFIR=ON|LTCBONLY=ON THEN                      03S0423 00473000
         TM    LTCBFIR(RLTCB),B'10010000'                       03S0423 00474000
         BZ    @RF00423                                         03S0423 00475000
*             TRHBC=ON;             /* BEGIN CHAINING                */ 00476000
         OI    TRHBC(RTRH),B'00000010'                          03S0424 00477000
*           ELSE                                                03S0425 00478000
*             TRHBC=OFF;                                        03S0425 00479000
         B     @RC00423                                         03S0425 00480000
@RF00423 NI    TRHBC(RTRH),B'11111101'                          03S0425 00481000
*           IF LTCBLAST=ON|LTCBONLY=ON THEN                     03S0426 00482000
@RC00423 TM    LTCBLAST(RLTCB),B'00110000'                      03S0426 00483000
         BZ    @RF00426                                         03S0426 00484000
*             TRHEC=ON;             /* END CHAINING                  */ 00485000
         OI    TRHEC(RTRH),B'00000001'                          03S0427 00486000
*           ELSE                                                03S0428 00487000
*             TRHEC=OFF;                                        03S0428 00488000
         B     @RC00426                                         03S0428 00489000
@RF00426 NI    TRHEC(RTRH),B'11111110'                          03S0428 00490000
*           TRHDR1=ON;              /* DEFENDENT RESPONSE IS ALWAYS     00491000
*                                      ON FOR A SEND REQUEST FROM THE   00492000
*                                      OLT                           */ 00493000
@RC00426 DS    0H                                               03S0430 00494000
*           TRHDR2=OFF;             /* ALWAYS OFF FOR TCAM           */ 00495000
         OI    TRHDR1(RTRH),B'10000000'                         03S0430 00496000
         NI    TRHDR2(RTRH),B'11011111'                         03S0430 00497000
*           IF SENDREX=ON THEN                                  03S0431 00498000
         TM    SENDREX(RSEND),B'00010000'                       03S0431 00499000
         BNO   @RF00431                                         03S0431 00500000
*             TRHER=ON;             /* EXCEPTION RESPONSE            */ 00501000
         OI    TRHER(RTRH),B'00010000'                          03S0432 00502000
*           ELSE                                                03S0433 00503000
*             TRHER=OFF;                                        03S0433 00504000
         B     @RC00431                                         03S0433 00505000
@RF00431 NI    TRHER(RTRH),B'11101111'                          03S0433 00506000
*           IF $CTEQTT=OFF&TOTAPTST=OFF THEN/* CT/AP EQU TEST DEVICE    00507000
*                                                            @YM08097*/ 00508000
@RC00431 TM    $CTEQTT(ROLTCB),B'00010000'                      03S0434 00509000
         BNZ   @RF00434                                         03S0434 00510000
         TM    TOTAPTST(ROLTCB),B'00001000'                     03S0434 00511000
         BNZ   @RF00434                                         03S0434 00512000
*             DO;                   /*                       @YM08097*/ 00513000
*               IF SENDBBKT=ON THEN                             03S0436 00514000
         TM    SENDBBKT(RSEND),B'10000000'                      03S0436 00515000
         BNO   @RF00436                                         03S0436 00516000
*                 TRHBB=ON;         /* BEGIN BRACKETS                */ 00517000
         OI    TRHBB(RTRH),B'10000000'                          03S0437 00518000
*               ELSE                                            03S0438 00519000
*                 TRHBB=OFF;                                    03S0438 00520000
         B     @RC00436                                         03S0438 00521000
@RF00436 NI    TRHBB(RTRH),B'01111111'                          03S0438 00522000
*               IF SENDEBKT=ON THEN                             03S0439 00523000
@RC00436 TM    SENDEBKT(RSEND),B'01000000'                      03S0439 00524000
         BNO   @RF00439                                         03S0439 00525000
*                 TRHEB=ON;         /* END BRACKETS                  */ 00526000
         OI    TRHEB(RTRH),B'01000000'                          03S0440 00527000
*               ELSE                                            03S0441 00528000
*                 TRHEB=OFF;                                    03S0441 00529000
         B     @RC00439                                         03S0441 00530000
@RF00439 NI    TRHEB(RTRH),B'10111111'                          03S0441 00531000
*             END;                  /*                       @YM08097*/ 00532000
*           ELSE                                                03S0443 00533000
*             ;                                                 03S0443 00534000
@RF00434 DS    0H                                               03S0444 00535000
*           IF SENDCREQ=OFF|SENDCCMD=OFF THEN                   03S0444 00536000
@RC00434 TM    SENDCREQ(RSEND),B'11000000'                      03S0444 00537000
         BO    @RF00444                                         03S0444 00538000
*             TRHCDI=ON;            /* CHANGE DIRECTION REQUEST      */ 00539000
         OI    TRHCDI(RTRH),B'00100000'                         03S0445 00540000
*           ELSE                                                03S0446 00541000
*             TRHCDI=OFF;                                       03S0446 00542000
         B     @RC00444                                         03S0446 00543000
@RF00444 NI    TRHCDI(RTRH),B'11011111'                         03S0446 00544000
*           IF SENDCDSL=ON THEN                                 03S0447 00545000
@RC00444 TM    SENDCDSL(RSEND),B'00000100'                      03S0447 00546000
         BNO   @RF00447                                         03S0447 00547000
*             TRHCSI=ON;            /* CODE SELECTION INDICATOR      */ 00548000
         OI    TRHCSI(RTRH),B'00001000'                         03S0448 00549000
*           ELSE                                                03S0449 00550000
*             TRHCSI=OFF;                                       03S0449 00551000
         B     @RC00447                                         03S0449 00552000
@RF00447 NI    TRHCSI(RTRH),B'11110111'                         03S0449 00553000
*           RIOB=BASRIOB;           /* GET POINTER FROM BASE POINTER    00554000
*                                      SAVE AREA                     */ 00555000
@RC00447 L     RIOB,BASRIOB(,ROLTCB)                            03S0450 00556000
*           IF SENDRFME=ON THEN                                 03S0451 00557000
         TM    SENDRFME(RSEND),B'00100000'                      03S0451 00558000
         BNO   @RF00451                                         03S0451 00559000
*             OLTFME=ON;            /* SAVE ACTUAL RESPONSE FROM SEND   00560000
*                                      REQUEST FOR SECONDARY DEVICE  */ 00561000
         OI    OLTFME(RIOB),B'00000100'                         03S0452 00562000
*           ELSE                                                03S0453 00563000
*             OLTFME=OFF;                                       03S0453 00564000
         B     @RC00451                                         03S0453 00565000
@RF00451 NI    OLTFME(RIOB),B'11111011'                         03S0453 00566000
*           IF SENDREX=ON THEN                                  03S0454 00567000
@RC00451 TM    SENDREX(RSEND),B'00010000'                       03S0454 00568000
         BNO   @RF00454                                         03S0454 00569000
*             OLTEX=ON;             /* SAVE ACTUAL RESPONSE FROM SEND   00570000
*                                      REQUEST FOR SECONDARY DEVICE  */ 00571000
         OI    OLTEX(RIOB),B'00001000'                          03S0455 00572000
*           ELSE                                                03S0456 00573000
*             OLTEX=OFF;                                        03S0456 00574000
         B     @RC00454                                         03S0456 00575000
@RF00454 NI    OLTEX(RIOB),B'11110111'                          03S0456 00576000
*           RPLMVP=ADDR(TOTWOWRK);  /* ADDRESSIBILITY TO THE MOVE       00577000
*                                      PARAMETER LIST                */ 00578000
@RC00454 LA    RPLMVP,TOTWOWRK(,ROLTCB)                         03S0457 00579000
*           RSAVE=ADDR(TOTSAVE6);   /* SET UP THE POINTER TO THE        00580000
*                                      IEDMVBFR SAVE AREA            */ 00581000
         LA    RSAVE,TOTSAVE6(,ROLTCB)                          03S0458 00582000
*           PLMVTU=RPRF;            /* ADDRESS OF TCAM BUFFER THAT      00583000
*                                      WILL CONTAIN THE MESSAGE      */ 00584000
         ST    RPRF,PLMVTU(,RPLMVP)                             03S0459 00585000
*           PLMVLNTH=SENDRLN;       /* LENGTH OF DATA TO BE MOVED       00586000
*                                                            @YM09025*/ 00587000
         LH    @11,SENDRLN(,RSEND)                              03S0460 00588000
         N     @11,@CF02514                                     03S0460 00589000
         STH   @11,PLMVLNTH(,RPLMVP)                            03S0460 00590000
*           PLMVTD=ADDR(PRFSHDR)+LRHLEN;/* LOCATION IN THE BUFFER       00591000
*                                      WHERE THE DATA IS TO BE MOVED */ 00592000
         LA    @11,PRFSHDR(,RPRF)                               03S0461 00593000
         AL    @11,@CF00076                                     03S0461 00594000
         ST    @11,PLMVTD(,RPLMVP)                              03S0461 00595000
*           PLMVSU=SENDARA;         /* SOURCE UNIT ADDRESS           */ 00596000
         L     @11,SENDARA(,RSEND)                              03S0462 00597000
         ST    @11,PLMVSU(,RPLMVP)                              03S0462 00598000
*           PLMVSD=SENDARA;         /* SOURCE DATA ADDRESS           */ 00599000
         ST    @11,PLMVSD(,RPLMVP)                              03S0463 00600000
*           PLMVFLG1=BZERO;         /* CLEAR FLAGS                   */ 00601000
         MVI   PLMVFLG1(RPLMVP),X'00'                           03S0464 00602000
*           PLMVSCTG=ON;            /* INDICATE THAT THE MESSAGE IS     00603000
*                                      IN A CONTIGUOUS AREA          */ 00604000
         OI    PLMVSCTG(RPLMVP),B'01000000'                     03S0465 00605000
*           PLMVFLG2=BZERO;         /* CLEAR FLAG BYTE TWO   @YM08477*/ 00606000
         MVI   PLMVFLG2(RPLMVP),X'00'                           03S0466 00607000
*           RPARM=RPLMVP;           /* REGISTER ONE POINTS TO MOVE      00608000
*                                      PARM LIST             @YM08477*/ 00609000
         LR    RPARM,RPLMVP                                     03S0467 00610000
*           CALL IEDMVBFR;          /* GO PUT MESSAGE INTO TCAM 03S0468 00611000
*                                      BUFFER                        */ 00612000
         L     @11,AVTSAVTP(,RAVT)                              03S0468 00613000
         L     @15,SAVTMVBF(,@11)                               03S0468 00614000
         BALR  @14,@15                                          03S0468 00615000
*           RSAVE=ADDR(TOTSAVE1);   /* SET UP POINTER TO THE IEDQW25    00616000
*                                      SAVE AREA                     */ 00617000
         LA    RSAVE,TOTSAVE1(,ROLTCB)                          03S0469 00618000
*           RWORK=ADDR(TOTWAWRK);   /* GET ADDRESS OF WORK AREA TO BE   00619000
*                                      USED BY POST/WAIT ROUTINE     */ 00620000
         LA    RWORK,TOTWAWRK(,ROLTCB)                          03S0470 00621000
*           RPRF=BASRPRF;           /* SET REGISTER 1 TO BUFFER TO BE   00622000
*                                      POSTED                        */ 00623000
         L     RPRF,BASRPRF(,ROLTCB)                            03S0471 00624000
*           GEN(ICM RPARM,8,REQKEY);/* SET ELEMENT KEY IN REGISTER      00625000
*                                      ZERO                          */ 00626000
         ICM RPARM,8,REQKEY                                             00627000
*           PRFLINK=ADDR(TOTWOWRK); /* CHAIN WAITING ELEMENT TO THE     00628000
*                                      BUFFER                        */ 00629000
         LA    @11,TOTWOWRK(,ROLTCB)                            03S0473 00630000
         STCM  @11,7,PRFLINK(RPRF)                              03S0473 00631000
*           RTTCP=ADDR(TOTWAWRK);   /* SET ADDRESS BASE FOR TCAM/TOTE   00632000
*                                      STRUCTURE                     */ 00633000
         LA    RTTCP,TOTWAWRK(,ROLTCB)                          03S0474 00634000
*           REQQCB=ADDR(TTCQCB);    /* SET QCB TO THE QCB USED BY       00635000
*                                      IEDQWA                        */ 00636000
         LA    @11,40                                           03S0475 00637000
         ALR   @11,RTTCP                                        03S0475 00638000
         ST    @11,REQQCB(,ROLTCB)                              03S0475 00639000
*           REQLINK=ZERO;           /* CLEAR LINK FIELD INDICATING      00640000
*                                      LAST ELEMENT                  */ 00641000
         SLR   @11,@11                                          03S0476 00642000
         STCM  @11,7,REQLINK(ROLTCB)                            03S0476 00643000
*           REQPRI=PRILNSCL;        /* SET PRIORITY TO ONE LEVEL        00644000
*                                      LOWER THAN QCB POST TO   03S0477 00645000
*                                      DESTINATION QCB       @OX21052*/ 00646000
         MVI   REQPRI(ROLTCB),X'E3'                             03S0477 00647000
*           RTRM=BASRTRM;           /* GET THE TTE POINTER           */ 00648000
         L     RTRM,BASRTRM(,ROLTCB)                            03S0478 00649000
*           TRMTDIFF=ON;            /* TEST DEVICE ID FOR TOTE       */ 00650000
         LA    @07,TRMTDIFF(,RTRM)                              03S0479 00651000
         LR    @05,@07                                          03S0479 00652000
         LA    @11,3                                            03S0479 00653000
         NR    @05,@11                                          03S0479 00654000
         LCR   @05,@05                                          03S0479 00655000
         ALR   @07,@05                                          03S0479 00656000
         L     @11,0(,@07)                                      03S0479 00657000
@GL00005 LR    @09,@11                                          03S0479 00658000
         O     @09,@CB02532+3(@05)                              03S0479 00659000
         CS    @11,@09,0(@07)                                   03S0479 00660000
         BNE   @GL00005                                         03S0479 00661000
*           RPARM=RPRF;             /* NOW PUT DESTINATION QCB IN       00662000
*                                      REGISTER ONE                  */ 00663000
         LR    RPARM,RPRF                                       03S0480 00664000
*           RRESPL=TOTRESPL;        /* SET UP THE ADDRESS OF THE        00665000
*                                      RESPL                         */ 00666000
         L     RRESPL,TOTRESPL(,ROLTCB)                         03S0481 00667000
*           CALL POSTWAIT;          /* CALL IEDQWA TO POST OUTPUT       00668000
*                                      BUFFER AND REQUEST ELEMENT TO    00669000
*                                      TCAM                          */ 00670000
         L     @15,RESPLRVT(,RRESPL)                            03S0482 00671000
         BALR  @14,@15                                          03S0482 00672000
*           RETCDE=RCGOOD;          /* GOOD RETURN CODE 00           */ 00673000
         SLR   RETCDE,RETCDE                                    03S0483 00674000
*           TOTRTCOD=RETCDE;        /* SAVE RETURN CODE IN OLTCB     */ 00675000
         STC   RETCDE,TOTRTCOD(,ROLTCB)                         03S0484 00676000
*           RFY                                                 03S0485 00677000
*             RPARM UNRSTD;         /* UNRESTRICT REGISTER 1         */ 00678000
*           RFY                                                 03S0486 00679000
*             RWORK UNRSTD;         /* UNRESTRICT REGISTER 10        */ 00680000
*         END;                                                  02S0487 00681000
*       ELSE                                                    02S0488 00682000
*         DO;                       /* NO,IT IS A SEND RESPONSE      */ 00683000
         B     @RC00376                                         02S0488 00684000
@RF00376 DS    0H                                               02S0489 00685000
*                                                               03S0489 00686000
*           /*********************************************************/ 00687000
*           /*                                                       */ 00688000
*           /* PROCESS.SENDREC: THIS PROCESS BUILDS A PIU AND POST IT*/ 00689000
*           /* TO THE DFOUT MODULE WHEN A SEND RESPONSE IS ISSUED BY */ 00690000
*           /* THE OLT.                                              */ 00691000
*           /*                                                       */ 00692000
*           /*********************************************************/ 00693000
*                                                               03S0489 00694000
*           RFY                                                 03S0489 00695000
*             RPARM RSTD;           /* RESTRICT REGISTER 1           */ 00696000
*           RFY                                                 03S0490 00697000
*             RWORK RSTD;           /* RESTRICT REGISTER 10          */ 00698000
*           RWORK=ADDR(TOTWAWRK);   /* SAVE RETURN ADDRESS           */ 00699000
         LA    RWORK,TOTWAWRK(,ROLTCB)                          03S0491 00700000
*           RPARM=ONE;              /* THE NUMBER OF UNITS REQUIRED     00701000
*                                      IS 1                  @YM08477*/ 00702000
         LA    RPARM,1                                          03S0492 00703000
*           RSAVE=ADDR(TOTSAVE6);   /* SET UP THE POINTER TO THE        00704000
*                                      IEDQWA SAVE AREA              */ 00705000
         LA    RSAVE,TOTSAVE6(,ROLTCB)                          03S0493 00706000
*           RRESPL=TOTRESPL;        /* SET UP THE ADDRESS THE RESPL  */ 00707000
         L     RRESPL,TOTRESPL(,ROLTCB)                         03S0494 00708000
*           CALL ALLOCBUF;          /* CALL IEDQWA TO REQUEST A 03S0495 00709000
*                                      BUFFER                        */ 00710000
         L     @15,RESABUF(,RRESPL)                             03S0495 00711000
         BALR  @14,@15                                          03S0495 00712000
*           RSAVE=ADDR(TOTSAVE1);   /* SET UP THE POINTER TO THE        00713000
*                                      IEDQW25 SAVE AREA             */ 00714000
         LA    RSAVE,TOTSAVE1(,ROLTCB)                          03S0496 00715000
*           RPRF=RPARM;             /* SET UP THE BUFFER ADDRESS     */ 00716000
         LR    RPRF,RPARM                                       03S0497 00717000
*           BASRPRF=RPRF;           /* SAVE THE BUFFER ADDRESS       */ 00718000
         ST    RPRF,BASRPRF(,ROLTCB)                            03S0498 00719000
*           RPIU=ADDR(PRFSUNIT);    /* SET PIU POINTER TO THE START     00720000
*                                      OF THE PIU MESSAGE            */ 00721000
         LA    RPIU,PRFSUNIT(,RPRF)                             03S0499 00722000
*           BASRPIU=RPIU;           /* SAVE THE PIU POINTER          */ 00723000
         ST    RPIU,BASRPIU(,ROLTCB)                            03S0500 00724000
*           RTTH=ADDR(PIUTH);       /* SET TH POINTER TO THE START OF   00725000
*                                      THE TH INFORMATION            */ 00726000
         LR    RTTH,RPIU                                        03S0501 00727000
*           PRF2TNTI=ON;            /* TTCIN OFFSETS EXIST IN PIU    */ 00728000
*           PRF2FORM=ON;            /* 2ND WORD IN THIS PREFIX       */ 00729000
         LR    @11,RPRF                                         03S0503 00730000
         SL    @11,@CF00047                                     03S0503 00731000
         OI    PRF2TNTI(@11),B'11000000'                        03S0503 00732000
*           PRF2SEQP=ADDR(TTHSNF);  /* POINTER TO SEQUENCE NUMBER       00733000
*                                      AREA                          */ 00734000
         LA    @09,TTHSNF(,RTTH)                                03S0504 00735000
         ST    @09,PRF2SEQP(,@11)                               03S0504 00736000
*           PRFPIUO=ONE;            /* OFFSET TO PIU                 */ 00737000
         MVI   PRFPIUO(RPRF),X'01'                              03S0505 00738000
*           PRFQCBA=SAVTDFCO;       /* SET ADDRESS OF QCB TO WHICH      00739000
*                                      THE BUFFER IS TO BE POSTED    */ 00740000
         L     @11,AVTSAVTP(,RAVT)                              03S0506 00741000
         MVC   PRFQCBA(3,RPRF),SAVTDFCO+1(@11)                  03S0506 00742000
*           TTHFTYPE=TTHFID1;       /* FID 1                         */ 00743000
         NI    TTHFTYPE(RTTH),B'00011111'                       03S0507 00744000
         OI    TTHFTYPE(RTTH),B'00010000'                       03S0507 00745000
*           TTHBBIU=ON;             /* BEGIN SEQMENT                 */ 00746000
*           TTHEBIU=ON;             /* END SEQMENT                   */ 00747000
         OI    TTHBBIU(RTTH),B'00001100'                        03S0509 00748000
*           RIOB=BASRIOB;           /* GET POINTER FROM BASE POINTER    00749000
*                                      SAVE AREA                     */ 00750000
         L     RIOB,BASRIOB(,ROLTCB)                            03S0510 00751000
*           IF OLTEN=ON THEN                                    03S0511 00752000
         TM    OLTEN(RIOB),B'00000010'                          03S0511 00753000
         BNO   @RF00511                                         03S0511 00754000
*             TTHEFI=ON;            /* EXPEDITED/NORMAL INDICATOR    */ 00755000
         OI    TTHEFI(RTTH),B'00000001'                         03S0512 00756000
*           ELSE                                                03S0513 00757000
*             TTHEFI=OFF;                                       03S0513 00758000
         B     @RC00511                                         03S0513 00759000
@RF00511 NI    TTHEFI(RTTH),B'11111110'                         03S0513 00760000
*           TTHBYTE1=BZERO;         /* CLEAR TH BYTE ONE             */ 00761000
@RC00511 MVI   TTHBYTE1(RTTH),X'00'                             03S0514 00762000
*           TTHDAF=OLTTCOFF;        /* TTCIN OF LU                   */ 00763000
         MVC   TTHDAF(2,RTTH),OLTTCOFF(RIOB)                    03S0515 00764000
*           RFY                                                 03S0516 00765000
*             IEDRESPL BASED(RPARM);/*                       @YM08477*/ 00766000
*           RPARM=TOTRESPL;         /* SET UP ADDRESS OF RESPL  03S0517 00767000
*                                                            @YM08477*/ 00768000
         L     RPARM,TOTRESPL(,ROLTCB)                          03S0517 00769000
*           TTHOAF=RESMHSRC;        /* TTCIN OF THE TOTEMH           */ 00770000
         MVC   TTHOAF(2,RTTH),RESMHSRC(RPARM)                   03S0518 00771000
*           RFY                                                 03S0519 00772000
*             IEDRESPL BASED(RRESPL);/*                      @YM08477*/ 00773000
*           IF OLTPRSC=ON THEN                                  03S0520 00774000
         TM    OLTPRSC(RIOB),B'00100000'                        03S0520 00775000
         BNO   @RF00520                                         03S0520 00776000
*             TTHSNF=TOTPRSEQ;                                  03S0521 00777000
         MVC   TTHSNF(2,RTTH),TOTPRSEQ(ROLTCB)                  03S0521 00778000
*           ELSE                                                03S0522 00779000
*             TTHSNF=TOTSCSEQ;      /* SEQUENCE NUMBER               */ 00780000
         B     @RC00520                                         03S0522 00781000
@RF00520 MVC   TTHSNF(2,RTTH),TOTSCSEQ(ROLTCB)                  03S0522 00782000
*           RSEND=BASRPAR;          /* GET THE POINTER TO THE SEND      00783000
*                                      PARM LIST                     */ 00784000
@RC00520 L     RSEND,BASRPAR(,ROLTCB)                           03S0523 00785000
*           RPIU=BASRPIU;           /* SET UP THE BUFFER ADDRESS        00786000
*                                                            @YM08477*/ 00787000
         L     RPIU,BASRPIU(,ROLTCB)                            03S0524 00788000
*           RTRH=ADDR(PIURH);       /* GET THE ADDRESS OF THE RH        00789000
*                                      BUFFER POSITION               */ 00790000
         LA    RTRH,PIURH(,RPIU)                                03S0525 00791000
*           IEDRH=IEDRH&&IEDRH;     /* CLEAR THE RH                  */ 00792000
         XC    IEDRH(3,RTRH),IEDRH(RTRH)                        03S0526 00793000
*           IF SENDSTPE=ON THEN                                 03S0527 00794000
         TM    SENDSTPE(RSEND),B'00000010'                      03S0527 00795000
         BNO   @RF00527                                         03S0527 00796000
*             TRHTYPE=ON;           /* SET IF RESPONSE OR REQUEST       00797000
*                                      FROM OLT SEND                 */ 00798000
         OI    TRHTYPE(RTRH),B'10000000'                        03S0528 00799000
*           ELSE                                                03S0529 00800000
*             TRHTYPE=OFF;                                      03S0529 00801000
         B     @RC00527                                         03S0529 00802000
@RF00527 NI    TRHTYPE(RTRH),B'01111111'                        03S0529 00803000
*           IF SENDREX=ON THEN                                  03S0530 00804000
@RC00527 TM    SENDREX(RSEND),B'00010000'                       03S0530 00805000
         BNO   @RF00530                                         03S0530 00806000
*             TRHSDI=ON;            /* SET IF SENSE DATA INDICATED      00807000
*                                      FROM OLT SEND                 */ 00808000
         OI    TRHSDI(RTRH),B'00000100'                         03S0531 00809000
*           ELSE                                                03S0532 00810000
*             TRHSDI=OFF;                                       03S0532 00811000
         B     @RC00530                                         03S0532 00812000
@RF00530 NI    TRHSDI(RTRH),B'11111011'                         03S0532 00813000
*           TRHBC=ON;               /* BEGIN CHAINING                */ 00814000
@RC00530 DS    0H                                               03S0534 00815000
*           TRHEC=ON;               /* END CHAINING                  */ 00816000
         OI    TRHBC(RTRH),B'00000011'                          03S0534 00817000
*           TRHDR1=ON;              /* DEFENDENT RESPONSE IS ALWAYS     00818000
*                                      ON FOR A SEND REQUEST FROM THE   00819000
*                                      OLT                           */ 00820000
*           TRHDR2=OFF;             /* ALWAYS OFF FOR TCAM           */ 00821000
         OI    TRHDR1(RTRH),B'10000000'                         03S0536 00822000
         NI    TRHDR2(RTRH),B'11011111'                         03S0536 00823000
*           IF SENDREX=ON THEN                                  03S0537 00824000
         TM    SENDREX(RSEND),B'00010000'                       03S0537 00825000
         BNO   @RF00537                                         03S0537 00826000
*             TRHER=ON;             /* EXCEPTION RESPONSE            */ 00827000
         OI    TRHER(RTRH),B'00010000'                          03S0538 00828000
*           ELSE                                                03S0539 00829000
*             TRHER=OFF;                                        03S0539 00830000
         B     @RC00537                                         03S0539 00831000
@RF00537 NI    TRHER(RTRH),B'11101111'                          03S0539 00832000
*           RIOB=BASRIOB;           /* GET THE POINTER FROM THE BASE    00833000
*                                      POINTER SAVE AREA             */ 00834000
@RC00537 L     RIOB,BASRIOB(,ROLTCB)                            03S0540 00835000
*           IF SENDRFME=ON THEN                                 03S0541 00836000
         TM    SENDRFME(RSEND),B'00100000'                      03S0541 00837000
         BNO   @RF00541                                         03S0541 00838000
*             OLTFME=ON;            /* SAVE ACTUAL RESPONSE FROM SEND   00839000
*                                      REQUEST FOR SECONDARY DEVICE  */ 00840000
         OI    OLTFME(RIOB),B'00000100'                         03S0542 00841000
*           ELSE                                                03S0543 00842000
*             OLTFME=OFF;                                       03S0543 00843000
         B     @RC00541                                         03S0543 00844000
@RF00541 NI    OLTFME(RIOB),B'11111011'                         03S0543 00845000
*           IF SENDREX=ON THEN                                  03S0544 00846000
@RC00541 TM    SENDREX(RSEND),B'00010000'                       03S0544 00847000
         BNO   @RF00544                                         03S0544 00848000
*             OLTEX=ON;             /* SAVE ACTUAL RESPONSE FROM SEND   00849000
*                                      REQUEST FOR SECONDARY DEVICE  */ 00850000
         OI    OLTEX(RIOB),B'00001000'                          03S0545 00851000
*           ELSE                                                03S0546 00852000
*             OLTEX=OFF;                                        03S0546 00853000
         B     @RC00544                                         03S0546 00854000
@RF00544 NI    OLTEX(RIOB),B'11110111'                          03S0546 00855000
*           RPIU=BASRPIU;           /* GET THE POINTER TO THE PIU    */ 00856000
@RC00544 L     RPIU,BASRPIU(,ROLTCB)                            03S0547 00857000
*           RTTH=ADDR(PIUTH);       /* ALSO GET THE POINTER TO THE TH*/ 00858000
         LR    RTTH,RPIU                                        03S0548 00859000
*           IF SENDREX=ON THEN                                  03S0549 00860000
         TM    SENDREX(RSEND),B'00010000'                       03S0549 00861000
         BNO   @RF00549                                         03S0549 00862000
*             DO;                   /* IS THIS A NEGATIVE RESPONSE   */ 00863000
*               RPIU=ADDR(PIURU);   /* POINT PIU TO RU FIELD         */ 00864000
         LA    @11,PIURU(,RPIU)                                 03S0551 00865000
         LR    RPIU,@11                                         03S0551 00866000
*               RFY                                             03S0552 00867000
*                 LTECB BASED(RPARM);                           03S0552 00868000
*               RPARM=BASRTEC;      /* SET UP TECB SENSE ADDRESS        00869000
*                                                            @YM08477*/ 00870000
         L     RPARM,BASRTEC(,ROLTCB)                           03S0553 00871000
*               IEDPIU=LTCBSENS;    /* SET THE FOUR BYTES OF SENSE      00872000
*                                      INFORMATION IN THE RU         */ 00873000
         MVI   IEDPIU+4(RPIU),C' '                              03S0554 00874000
         MVC   IEDPIU+5(8,RPIU),IEDPIU+4(RPIU)                  03S0554 00875000
         MVC   IEDPIU(4,RPIU),LTCBSENS(RPARM)                   03S0554 00876000
*               RFY                                             03S0555 00877000
*                 LTECB BASED(RLTCB);                           03S0555 00878000
*               TTHDCF=LRHLEN+LSENLEN;/* SET DATA COUNT OF SEVEN IN     00879000
*                                      TH DATA COUNT DATA            */ 00880000
         MVC   TTHDCF(2,RTTH),@CH00583                          03S0556 00881000
*             END;                                              03S0557 00882000
*           ELSE                                                03S0558 00883000
*             TTHDCF=LRHLEN;        /* SET DATA COUNT OF THREE IN TH    00884000
*                                      DATA COUNT DATA               */ 00885000
         B     @RC00549                                         03S0558 00886000
@RF00549 MVC   TTHDCF(2,RTTH),@CH00076                          03S0558 00887000
*           RWORK=ADDR(TOTWAWRK);   /* GET ADDRESS OF WORK AREA TO BE   00888000
*                                      USED BY POST/WAIT ROUTINE     */ 00889000
@RC00549 LA    RWORK,TOTWAWRK(,ROLTCB)                          03S0559 00890000
*           RRESPL=TOTRESPL;        /* SET UP THE ADDRESS OF THE        00891000
*                                      RESPL                         */ 00892000
         L     RRESPL,TOTRESPL(,ROLTCB)                         03S0560 00893000
*           RPARM=RPRF;             /* SET REGISTER 1 TO BUFFER TO BE   00894000
*                                      POSTED                        */ 00895000
         LR    RPARM,RPRF                                       03S0561 00896000
*           CALL POSTWAIT;          /* CALL IEDQWA TO POST OUTPUT       00897000
*                                      BUFFER AND REQUEST ELEMENT TO    00898000
*                                      TCAM                          */ 00899000
         L     @15,RESPLRVT(,RRESPL)                            03S0562 00900000
         BALR  @14,@15                                          03S0562 00901000
*           RETCDE=RCGOOD;          /* GOOD RETURN CODE 00           */ 00902000
         SLR   RETCDE,RETCDE                                    03S0563 00903000
*           TOTRTCOD=RETCDE;        /* SAVE RETURN CODE IN OLTCB     */ 00904000
         STC   RETCDE,TOTRTCOD(,ROLTCB)                         03S0564 00905000
*           RFY                                                 03S0565 00906000
*             RPARM UNRSTD;         /* UNRESTRICT REGISTER 1         */ 00907000
*           RFY                                                 03S0566 00908000
*             RPRF UNRSTD;          /* UNRESTRICT REGISTER 8         */ 00909000
*           RFY                                                 03S0567 00910000
*             RWORK UNRSTD;         /* UNRESTRICT REGISTER 10        */ 00911000
*         END;                                                  02S0568 00912000
*     END;                                                      02S0569 00913000
@RC00376 DS    0H                                               02S0570 00914000
*                                                               03S0570 00915000
*   /*****************************************************************/ 00916000
*   /*                                                               */ 00917000
*   /* PROCESS.EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE    */ 00918000
*   /* THAT WAS ALTERED BY THE MODULE PROCEDURE STATEMENT.           */ 00919000
*   /*                                                               */ 00920000
*   /*****************************************************************/ 00921000
*                                                               03S0570 00922000
*   RFY                                                         03S0570 00923000
*     RWORK RSTD;                                               03S0570 00924000
@RC00371 DS    0H                                               03S0571 00925000
*   IF $TRACE=ON|$RETMASK^=BZERO THEN                           03S0571 00926000
         TM    $TRACE(ROLTCB),B'00000100'                       03S0571 00927000
         BO    @RT00571                                         03S0571 00928000
         CLI   $RETMASK(ROLTCB),X'00'                           03S0571 00929000
         BE    @RF00571                                         03S0571 00930000
@RT00571 DS    0H                                               03S0572 00931000
*     DO;                           /* WAS TRACE FUNCTION SPECIFIED     00932000
*                                      OR A BAD RETURN CODE          */ 00933000
*       GEN REFS(RSAVE,RBRNCH,RRETURN,TOTRESPL,RESPLM2,ROLTCB,RBASE)    00934000
*           NOSETS;                                             03S0573 00935000
        L RSAVE,4(RSAVE)        RESTORE R13                             00936000
        L RRETURN,12(RSAVE)      RESTORE R14                            00937000
        USING TOTOLTCB,ROLTCB                                           00938000
        L RBRNCH,TOTRESPL      GET RESPL ADDRESS                        00939000
        DROP ROLTCB                                                     00940000
        USING IEDRESPL,RBRNCH    SET RESPL ADDRESSABILITY               00941000
        L RBRNCH,RESPLM2       GET TRACE ROUTINE ADDRESS                00942000
        LM ROLTCB,RBASE,28(RSAVE) RESTORE REGISTERS                     00943000
        BR RBRNCH              EXIT TO IEDQWM2                          00944000
        DROP RBRNCH                                                     00945000
*     END;                                                      03S0574 00946000
*   ELSE                                                        03S0575 00947000
*     DO;                                                       03S0575 00948000
         B     @RC00571                                         03S0575 00949000
@RF00571 DS    0H                                               03S0576 00950000
*       GEN REFS(RSAVE,RBRNCH,RRETURN,RWORK,RBASE,TOTRTCOD) NOSETS;     00951000
        L RSAVE,4(RSAVE)        RESTORE R13                             00952000
        L RRETURN,12(RSAVE)     RESTORE R14                             00953000
        LM RWORK,RBASE,20(RSAVE) RESTORE REGISTERS                      00954000
        SLR RETCDE,RETCDE        CLEAR RETURN CODE REGISTER             00955000
        IC  RETCDE,TOTRTCOD(,ROLTCB) GET RETURN CODE FROM OLTCB         00956000
        BR RRETURN              RETURN TO IEDQWA                        00957000
*     END;                                                      03S0577 00958000
*   RFY                                                         03S0578 00959000
*     RWORK UNRSTD;                                             03S0578 00960000
*   RFY                                                         02S0579 00961000
*     RPARM UNRSTD;                                             02S0579 00962000
*                                                               02S0580 00963000
*   /*****************************************************************/ 00964000
*   /*                                                               */ 00965000
*   /* ERREXIT: THIS ROUTINE SETS UP THE ERROR MODULE ID AND SETS THE*/ 00966000
*   /* ERROR EXIT SWITCH                                             */ 00967000
*   /*                                                               */ 00968000
*   /*****************************************************************/ 00969000
*                                                               02S0580 00970000
*ERREXIT:                                                       02S0580 00971000
*   PROC OPTIONS(RETREG,NOSAVE,NOSAVEAREA);                     02S0580 00972000
@EL00001 DS    0H                                               02S0580 00973000
@EF00001 DS    0H                                               02S0580 00974000
@ER00001 LM    @14,@12,12(@13)                                  02S0580 00975000
         BR    @14                                              02S0580 00976000
ERREXIT  DS    0H                                               02S0581 00977000
*   BASRRET=RRETURN;                /* SAVE RETURN REGISTER          */ 00978000
         ST    RRETURN,BASRRET(,ROLTCB)                         02S0581 00979000
*   ERRSW=ON;                       /* SET ERROR SWITCH TO ONE       */ 00980000
         OI    ERRSW,B'10000000'                                02S0582 00981000
*   TOTRTCOD=RETCDE;                /* PUT RETURN CODE INTO OLTCB    */ 00982000
         STC   RETCDE,TOTRTCOD(,ROLTCB)                         02S0583 00983000
*   RRETURN=BASRRET;                /* SET UP RETURN REGISTER TO        00984000
*                                      RETURN                        */ 00985000
         L     @11,BASRRET(,ROLTCB)                             02S0584 00986000
         LR    RRETURN,@11                                      02S0584 00987000
*   END ERREXIT;                                                02S0585 00988000
@EL00002 DS    0H                                               02S0585 00989000
@EF00002 DS    0H                                               02S0585 00990000
@ER00002 BR    @14                                              02S0585 00991000
*   END IEDQW25                                                 01S0586 00992000
*                                                               01S0586 00993000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00994000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00995000
*/*%INCLUDE SYSLIB  (TBINDD  )                                       */ 00996000
*/*%INCLUDE SYSLIB  (TBNDD   )                                       */ 00997000
*/*%INCLUDE SYSLIB  (TDCTD   )                                       */ 00998000
*/*%INCLUDE SYSLIB  (IOBLOCKS)                                       */ 00999000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 01000000
*/*%INCLUDE SYSLIB  (OLTCB   )                                       */ 01001000
*/*%INCLUDE SYSLIB  (TPIUD   )                                       */ 01002000
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */ 01003000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 01004000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01005000
*/*%INCLUDE SYSLIB  (RESPL   )                                       */ 01006000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 01007000
*/*%INCLUDE SYSLIB  (TSCBD   )                                       */ 01008000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 01009000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01010000
*/*%INCLUDE SYSLIB  (TTTCD   )                                       */ 01011000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 01012000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 01013000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 01014000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 01015000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 01016000
*/*%INCLUDE SYSUT5  (PRIRSEC )                                       */ 01017000
*/*%INCLUDE SYSUT5  (SENDREQ )                                       */ 01018000
*/*%INCLUDE SYSUT5  (SENDREC )                                       */ 01019000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 01020000
*/*%INCLUDE SYSUT5  (ERREXIT )                                       */ 01021000
*                                                               01S0586 01022000
*       ;                                                       01S0586 01023000
@DATA    DS    0H                                                       01024000
@CH00583 DC    H'7'                                                     01025000
@SC02516 CLC   TESTDSN(0,@11),LCDSSMNM(RCDS)                            01026000
@DATD    DSECT                                                          01027000
         DS    0F                                                       01028000
IEDQW25  CSECT                                                          01029000
         DS    0F                                                       01030000
@CF00063 DC    F'1'                                                     01031000
@CF00076 DC    F'3'                                                     01032000
@CH00076 EQU   @CF00076+2                                               01033000
@CF00047 DC    F'8'                                                     01034000
@CF02134 DC    F'14'                                                    01035000
@CF01514 DC    F'56'                                                    01036000
@CF02514 DC    XL4'0000FFFF'                                            01037000
@DATD    DSECT                                                          01038000
         DS    0D                                                       01039000
ERRSW    DS    BL1                                                      01040000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01041000
@ENDDATD EQU   *                                                        01042000
IEDQW25  CSECT                                                          01043000
         NOPR  ((@ENDDATD-@DATD)/561*16)                                01044000
         DS    0F                                                       01045000
@SIZDATD DC    AL1(0)                                                   01046000
         DC    AL3(@ENDDATD-@DATD)                                      01047000
         DS    0D                                                       01048000
@CB02392 DC    X'00000000000000000010800000'                            01049000
@CB02532 DC    B'000000000000000000000000000100000000000000000000000000C01050000
               00'                                                      01051000
PATCH    DC    XL50'0'                                                  01052000
REQKEY   DC    X'E0'                                                    01053000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01054000
@01      EQU   01                                                       01055000
@02      EQU   02                                                       01056000
@03      EQU   03                                                       01057000
@04      EQU   04                                                       01058000
@05      EQU   05                                                       01059000
@06      EQU   06                                                       01060000
@07      EQU   07                                                       01061000
@08      EQU   08                                                       01062000
@09      EQU   09                                                       01063000
@10      EQU   10                                                       01064000
@11      EQU   11                                                       01065000
@12      EQU   12                                                       01066000
@13      EQU   13                                                       01067000
@14      EQU   14                                                       01068000
@15      EQU   15                                                       01069000
RBIN     EQU   @03                                                      01070000
RBND     EQU   @03                                                      01071000
LCBXPTR  EQU   @05                                                      01072000
RTRM     EQU   @01                                                      01073000
RAVT     EQU   @04                                                      01074000
RLCB     EQU   @06                                                      01075000
RSCB     EQU   @03                                                      01076000
RTTCP    EQU   @06                                                      01077000
RDCT     EQU   @06                                                      01078000
RPLMVP   EQU   @06                                                      01079000
RPRF     EQU   @08                                                      01080000
RRESPL   EQU   @06                                                      01081000
RIOB     EQU   @03                                                      01082000
RPIU     EQU   @03                                                      01083000
RTTH     EQU   @06                                                      01084000
RTRH     EQU   @06                                                      01085000
ROLTCB   EQU   @02                                                      01086000
RWORK    EQU   @00                                                      01087000
RPARM    EQU   @01                                                      01088000
RSEND    EQU   @01                                                      01089000
RTECB    EQU   @03                                                      01090000
RLTCB    EQU   @03                                                      01091000
RSAVT    EQU   @06                                                      01092000
RCDS     EQU   @08                                                      01093000
ROLTWK   EQU   @10                                                      01094000
RBASE    EQU   @12                                                      01095000
RSAVE    EQU   @13                                                      01096000
RRETURN  EQU   @14                                                      01097000
RBRNCH   EQU   @15                                                      01098000
RETCDE   EQU   @15                                                      01099000
IEDQAVTD EQU   0                                                        01100000
AVTSAVEX EQU   IEDQAVTD+288                                             01101000
AVTCSTCS EQU   IEDQAVTD+328                                             01102000
AVTREADD EQU   IEDQAVTD+380                                             01103000
AVTBUFSW EQU   IEDQAVTD+384                                             01104000
@NM00004 EQU   IEDQAVTD+388                                             01105000
AVTCKFLG EQU   @NM00004                                                 01106000
AVTBASE  EQU   IEDQAVTD+412                                             01107000
AVTPKF   EQU   AVTBASE                                                  01108000
AVTRNMPT EQU   IEDQAVTD+424                                             01109000
AVTOSECB EQU   IEDQAVTD+492                                             01110000
AVTECB1  EQU   AVTOSECB                                                 01111000
AVTHG02  EQU   IEDQAVTD+528                                             01112000
AVTDISP  EQU   IEDQAVTD+552                                             01113000
AVTHD    EQU   IEDQAVTD+556                                             01114000
AVTSCOPT EQU   AVTHD                                                    01115000
AVTSAVTP EQU   IEDQAVTD+612                                             01116000
AVTSAVTF EQU   AVTSAVTP                                                 01117000
AVTCKPEL EQU   IEDQAVTD+652                                             01118000
AVTCKRMV EQU   AVTCKPEL                                                 01119000
AVTCKELF EQU   IEDQAVTD+680                                             01120000
AVTCKBYT EQU   IEDQAVTD+691                                             01121000
AVTHG01  EQU   IEDQAVTD+692                                             01122000
AVTCKLNK EQU   IEDQAVTD+696                                             01123000
AVTCRELE EQU   IEDQAVTD+708                                             01124000
AVTCCELE EQU   AVTCRELE                                                 01125000
AVTCLRHI EQU   IEDQAVTD+716                                             01126000
AVTADBUF EQU   IEDQAVTD+720                                             01127000
AVTSYSER EQU   IEDQAVTD+728                                             01128000
AVTBFRFG EQU   IEDQAVTD+784                                             01129000
AVTCKPQB EQU   IEDQAVTD+804                                             01130000
AVTCKPTB EQU   AVTCKPQB                                                 01131000
AVTCKPEC EQU   AVTCKPQB+4                                               01132000
AVTCKPCC EQU   AVTCKPEC                                                 01133000
AVTOPCQB EQU   IEDQAVTD+816                                             01134000
AVTOPCOB EQU   AVTOPCQB                                                 01135000
AVTOPCEC EQU   AVTOPCQB+4                                               01136000
AVTOPCCC EQU   AVTOPCEC                                                 01137000
AVTOLTQB EQU   IEDQAVTD+828                                             01138000
AVTCWFL1 EQU   IEDQAVTD+924                                             01139000
AVTCWFL2 EQU   IEDQAVTD+925                                             01140000
AVTSUBT  EQU   IEDQAVTD+948                                             01141000
AVTIOTR  EQU   IEDQAVTD+949                                             01142000
AVTKEYLE EQU   IEDQAVTD+1032                                            01143000
AVTBIT1  EQU   IEDQAVTD+1050                                            01144000
AVTBIT2  EQU   IEDQAVTD+1051                                            01145000
AVTBIT3  EQU   IEDQAVTD+1052                                            01146000
AVTDCTLN EQU   IEDQAVTD+1072                                            01147000
AVTBIT4  EQU   IEDQAVTD+1136                                            01148000
@NM00086 EQU   IEDQAVTD+1232                                            01149000
IEDQAPTR EQU   0                                                        01150000
IEDNSVTD EQU   0                                                        01151000
SAVTDIAG EQU   IEDNSVTD                                                 01152000
SAVTDIAF EQU   SAVTDIAG                                                 01153000
SAVTLUSQ EQU   IEDNSVTD+88                                              01154000
SAVTMVBF EQU   IEDNSVTD+160                                             01155000
SAVTDFCO EQU   IEDNSVTD+200                                             01156000
SAVTTCPU EQU   IEDNSVTD+238                                             01157000
SAVTZELM EQU   IEDNSVTD+270                                             01158000
SAVTRDRV EQU   IEDNSVTD+284                                             01159000
SAVTCKQB EQU   IEDNSVTD+300                                             01160000
SAVTCKTB EQU   SAVTCKQB                                                 01161000
SAVTCKEC EQU   SAVTCKQB+4                                               01162000
SAVTCKCC EQU   SAVTCKEC                                                 01163000
IEDBIN   EQU   0                                                        01164000
BINBUD   EQU   0                                                        01165000
BINBLD   EQU   0                                                        01166000
IEDBNDD  EQU   0                                                        01167000
BNDPRIM  EQU   IEDBNDD+4                                                01168000
BNDSECD  EQU   IEDBNDD+5                                                01169000
BNDCOMM1 EQU   IEDBNDD+6                                                01170000
BNDCOMM2 EQU   IEDBNDD+7                                                01171000
BNDSMSRU EQU   IEDBNDD+10                                               01172000
BNDPMSRU EQU   IEDBNDD+11                                               01173000
BNDLUPFL EQU   IEDBNDD+14                                               01174000
BNDPSCH  EQU   IEDBNDD+15                                               01175000
IEDDCT   EQU   0                                                        01176000
DCTBYTE1 EQU   IEDDCT+1                                                 01177000
DCTBYTE2 EQU   IEDDCT+2                                                 01178000
DCTBYTE3 EQU   IEDDCT+3                                                 01179000
DCTBYTE4 EQU   IEDDCT+4                                                 01180000
DCTBYTE5 EQU   IEDDCT+5                                                 01181000
IOBLOCKS EQU   0                                                        01182000
OLTTCOFF EQU   IOBLOCKS+6                                               01183000
OLTFLAG1 EQU   IOBLOCKS+26                                              01184000
OLTPRSC  EQU   OLTFLAG1                                                 01185000
OLTEX    EQU   OLTFLAG1                                                 01186000
OLTFME   EQU   OLTFLAG1                                                 01187000
OLTEN    EQU   OLTFLAG1                                                 01188000
OLTFLAG2 EQU   IOBLOCKS+46                                              01189000
OLTSN    EQU   IOBLOCKS+48                                              01190000
IOB      EQU   IOBLOCKS+56                                              01191000
IOBECBAD EQU   IOB+4                                                    01192000
IOBCSW   EQU   IOB+8                                                    01193000
IOBCCWAD EQU   IOB+16                                                   01194000
IOBFLG4  EQU   IOB+36                                                   01195000
DCB      EQU   IOBLOCKS+100                                             01196000
OLTDEBA  EQU   DCB+44                                                   01197000
IEDQLCB  EQU   0                                                        01198000
LCBRCB   EQU   IEDQLCB                                                  01199000
LCBTSOB  EQU   IEDQLCB+19                                               01200000
LCBCHAIN EQU   IEDQLCB+20                                               01201000
LCBSCRNN EQU   LCBCHAIN                                                 01202000
LCBTETEN EQU   LCBCHAIN                                                 01203000
LCBINSRC EQU   IEDQLCB+21                                               01204000
LCBLKMDE EQU   LCBINSRC+2                                               01205000
LCBNTXT  EQU   IEDQLCB+24                                               01206000
LCBSTAT4 EQU   LCBNTXT                                                  01207000
LCBPHASE EQU   LCBSTAT4                                                 01208000
LCBSCBDA EQU   IEDQLCB+25                                               01209000
LCBMHA   EQU   IEDQLCB+29                                               01210000
LCBFLAG1 EQU   IEDQLCB+32                                               01211000
LCBIOBSN EQU   IEDQLCB+33                                               01212000
LCBSNS   EQU   LCBIOBSN+1                                               01213000
LCBSENS0 EQU   LCBSNS                                                   01214000
LCBLOSDT EQU   LCBSENS0                                                 01215000
LCBTMOUT EQU   LCBSENS0                                                 01216000
LCBFLAG3 EQU   LCBIOBSN+7                                               01217000
LCBCSW   EQU   LCBIOBSN+8                                               01218000
LCBCSWST EQU   LCBCSW+3                                                 01219000
LCBCSWUS EQU   LCBCSWST                                                 01220000
LCBCSWCS EQU   LCBCSWST+1                                               01221000
LCBSIOCC EQU   LCBIOBSN+15                                              01222000
LCBDCBPT EQU   IEDQLCB+52                                               01223000
LCBRCQCB EQU   IEDQLCB+56                                               01224000
LCBRESTR EQU   LCBRCQCB                                                 01225000
LCBTHSQ  EQU   IEDQLCB+60                                               01226000
LCBINCAM EQU   LCBTHSQ                                                  01227000
LCBERRCT EQU   IEDQLCB+62                                               01228000
LCBLSPCI EQU   IEDQLCB+65                                               01229000
LCBRCBFR EQU   LCBLSPCI                                                 01230000
LCBSTATE EQU   IEDQLCB+70                                               01231000
LCBSTAT1 EQU   LCBSTATE                                                 01232000
LCBSTAT2 EQU   LCBSTATE+1                                               01233000
LCBBEOTN EQU   LCBSTAT2                                                 01234000
LCBSYNC  EQU   LCBSTAT2                                                 01235000
LCBDIAL  EQU   LCBSTAT2                                                 01236000
LCBTSTSW EQU   IEDQLCB+72                                               01237000
LCBERB   EQU   IEDQLCB+76                                               01238000
LCBERBST EQU   IEDQLCB+84                                               01239000
LCBDLNKN EQU   LCBERBST                                                 01240000
LCBERBCT EQU   IEDQLCB+88                                               01241000
LCBRBCT2 EQU   LCBERBCT+1                                               01242000
LCBMSGFM EQU   IEDQLCB+92                                               01243000
LCBSCBA  EQU   IEDQLCB+93                                               01244000
LCBOBRCH EQU   IEDQLCB+96                                               01245000
LCBINVPT EQU   LCBOBRCH+1                                               01246000
LCBBFRW  EQU   LCBINVPT                                                 01247000
LCBTPCD  EQU   IEDQLCB+100                                              01248000
LCBSTAT5 EQU   LCBTPCD                                                  01249000
LCBSTAT6 EQU   LCBTPCD+4                                                01250000
LCBRSPSV EQU   LCBTPCD+8                                                01251000
LCBSAVSN EQU   IEDQLCB+112                                              01252000
LCBERCCW EQU   IEDQLCB+120                                              01253000
LCBCPA   EQU   IEDQLCB+144                                              01254000
LCBCCW5  EQU   LCBCPA+32                                                01255000
LCBATTEL EQU   LCBCCW5                                                  01256000
LCBQEBPL EQU   LCBATTEL                                                 01257000
IEDQLPTR EQU   0                                                        01258000
IEDQLCBX EQU   0                                                        01259000
LCBXCON  EQU   IEDQLCBX                                                 01260000
LCBXFLAG EQU   LCBXCON                                                  01261000
LCBXDCT  EQU   LCBXCON+1                                                01262000
LCBXRADR EQU   LCBXCON+4                                                01263000
TOTOLTCB EQU   0                                                        01264000
$SCTTBLE EQU   TOTOLTCB                                                 01265000
$TESTOPT EQU   $SCTTBLE+2                                               01266000
$ERROPT  EQU   $SCTTBLE+3                                               01267000
$PDEVFLG EQU   $SCTTBLE+10                                              01268000
$CDSFLGS EQU   $SCTTBLE+11                                              01269000
$EXECFLG EQU   $SCTTBLE+33                                              01270000
$OLTFLGS EQU   $SCTTBLE+36                                              01271000
$TRACE   EQU   $OLTFLGS                                                 01272000
$TOTFLG1 EQU   $SCTTBLE+38                                              01273000
$CTEQTT  EQU   $TOTFLG1                                                 01274000
$RETMASK EQU   $SCTTBLE+70                                              01275000
TOTSAVE1 EQU   TOTOLTCB+120                                             01276000
TOTSAVE2 EQU   TOTOLTCB+192                                             01277000
TOTSAVE5 EQU   TOTOLTCB+408                                             01278000
TOTSAVE6 EQU   TOTOLTCB+480                                             01279000
TOTSRENT EQU   TOTOLTCB+576                                             01280000
TOTCTENT EQU   TOTOLTCB+584                                             01281000
TOTCTFLG EQU   TOTCTENT+22                                              01282000
TOTCTDFL EQU   TOTOLTCB+624                                             01283000
TOTCUTST EQU   TOTOLTCB+628                                             01284000
TOTCUFLG EQU   TOTCUTST                                                 01285000
TOTPLIST EQU   TOTOLTCB+664                                             01286000
TOTOECBA EQU   TOTPLIST+12                                              01287000
TOTOFLG  EQU   TOTOECBA                                                 01288000
TOTAPENT EQU   TOTOLTCB+736                                             01289000
TOTAPFLG EQU   TOTAPENT+22                                              01290000
TOTAPDFL EQU   TOTOLTCB+767                                             01291000
TOTOLTPL EQU   TOTOLTCB+820                                             01292000
TOTWTORP EQU   TOTOLTCB+832                                             01293000
TOTWTOPL EQU   TOTOLTCB+840                                             01294000
TOTRTCOD EQU   TOTOLTCB+1010                                            01295000
TOTPLNKQ EQU   TOTOLTCB+1012                                            01296000
TOTWKSPC EQU   TOTOLTCB+1024                                            01297000
TOTAVTPT EQU   TOTOLTCB+1172                                            01298000
TOTRESPL EQU   TOTOLTCB+1180                                            01299000
TOTFLG01 EQU   TOTOLTCB+1184                                            01300000
TOTAPTST EQU   TOTFLG01                                                 01301000
TOTFLG02 EQU   TOTOLTCB+1185                                            01302000
TOTFLG03 EQU   TOTOLTCB+1186                                            01303000
TOTFLG04 EQU   TOTOLTCB+1187                                            01304000
TOTFLG05 EQU   TOTOLTCB+1188                                            01305000
TOTFLG06 EQU   TOTOLTCB+1189                                            01306000
TOTFLG07 EQU   TOTOLTCB+1190                                            01307000
TOTFLG08 EQU   TOTOLTCB+1191                                            01308000
TOTFLG09 EQU   TOTOLTCB+1192                                            01309000
TOTFLG10 EQU   TOTOLTCB+1193                                            01310000
TOTTTBEL EQU   TOTOLTCB+1194                                            01311000
TOTPRECB EQU   TOTOLTCB+1316                                            01312000
TOTPRIBK EQU   TOTPRECB                                                 01313000
TOTPRENT EQU   TOTOLTCB+1320                                            01314000
TOTTNTPR EQU   TOTPRENT+16                                              01315000
TOTPRFLG EQU   TOTPRENT+22                                              01316000
TOTPRSN  EQU   TOTOLTCB+1364                                            01317000
TOTPRSEQ EQU   TOTPRSN+2                                                01318000
TOTPRDCB EQU   TOTOLTCB+1416                                            01319000
TOTSCECB EQU   TOTOLTCB+1488                                            01320000
TOTSCIBK EQU   TOTSCECB                                                 01321000
TOTSCENT EQU   TOTOLTCB+1492                                            01322000
TOTSRTNT EQU   TOTSCENT+16                                              01323000
TOTSCFLG EQU   TOTSCENT+22                                              01324000
TOTSCSN  EQU   TOTOLTCB+1536                                            01325000
TOTSCSEQ EQU   TOTSCSN+2                                                01326000
TOTSCDCB EQU   TOTOLTCB+1588                                            01327000
TOTCROLT EQU   TOTOLTCB+1660                                            01328000
TOTTDTBL EQU   TOTOLTCB+1748                                            01329000
@NM00227 EQU   TOTTDTBL                                                 01330000
TOTWAWRK EQU   TOTOLTCB+1824                                            01331000
TOTWOWRK EQU   TOTOLTCB+1904                                            01332000
TOTSERV  EQU   TOTOLTCB+2096                                            01333000
OLTCBPTR EQU   0                                                        01334000
IEDPIU   EQU   0                                                        01335000
PIUTH    EQU   IEDPIU                                                   01336000
PIURH    EQU   IEDPIU+10                                                01337000
PIURU    EQU   IEDPIU+13                                                01338000
IEDPLMV  EQU   0                                                        01339000
PLMVTU   EQU   IEDPLMV                                                  01340000
PLMVTD   EQU   IEDPLMV+4                                                01341000
PLMVSU   EQU   IEDPLMV+8                                                01342000
PLMVSD   EQU   IEDPLMV+12                                               01343000
PLMVLNTH EQU   IEDPLMV+16                                               01344000
PLMVFLG1 EQU   IEDPLMV+18                                               01345000
PLMVSCTG EQU   PLMVFLG1                                                 01346000
PLMVFLG2 EQU   IEDPLMV+19                                               01347000
IEDPLMVP EQU   0                                                        01348000
IEDQPRF  EQU   0                                                        01349000
PRFRCB   EQU   IEDQPRF                                                  01350000
PRFKEY   EQU   PRFRCB                                                   01351000
PRFQCBA  EQU   PRFRCB+1                                                 01352000
PRFPRI   EQU   PRFRCB+4                                                 01353000
PRFLINK  EQU   PRFRCB+5                                                 01354000
PRFTIC   EQU   IEDQPRF+8                                                01355000
PRFTICC  EQU   PRFTIC                                                   01356000
PRFNBUNT EQU   IEDQPRF+12                                               01357000
PRFSUNIT EQU   PRFNBUNT                                                 01358000
PRFPLQCB EQU   PRFSUNIT                                                 01359000
PRFPIUO  EQU   PRFPLQCB                                                 01360000
PRFLCB   EQU   IEDQPRF+13                                               01361000
@NM00238 EQU   IEDQPRF+16                                               01362000
PRFSVFFO EQU   @NM00238                                                 01363000
PRFSRCE  EQU   PRFSVFFO                                                 01364000
PRFSIZE  EQU   PRFSVFFO+2                                               01365000
PRFSTAT1 EQU   IEDQPRF+20                                               01366000
PRFEOFN  EQU   PRFSTAT1                                                 01367000
PRFCORE  EQU   IEDQPRF+21                                               01368000
PRFXTRA  EQU   PRFCORE                                                  01369000
PRFSCAN  EQU   IEDQPRF+24                                               01370000
PRFTQBCK EQU   IEDQPRF+26                                               01371000
PRFNTXT  EQU   PRFTQBCK                                                 01372000
PRFEOBOF EQU   PRFNTXT                                                  01373000
PRFCHDR  EQU   IEDQPRF+32                                               01374000
PRFHQBCK EQU   IEDQPRF+35                                               01375000
PRFDEST  EQU   IEDQPRF+40                                               01376000
IEDQPPTR EQU   0                                                        01377000
IEDPF1   EQU   0                                                        01378000
PRF1FLG1 EQU   IEDPF1+3                                                 01379000
PRF1WD2  EQU   IEDPF1+4                                                 01380000
PRF1SEQP EQU   PRF1WD2                                                  01381000
PRF1SQID EQU   PRF1SEQP                                                 01382000
PRF1TAG1 EQU   PRF1SQID                                                 01383000
IEDPF2   EQU   0                                                        01384000
PRF2FLG2 EQU   IEDPF2                                                   01385000
PRF2TNTI EQU   PRF2FLG2                                                 01386000
PRF2FORM EQU   PRF2FLG2                                                 01387000
PRF2WD2  EQU   IEDPF2+4                                                 01388000
PRF2SEQP EQU   PRF2WD2                                                  01389000
IEDRESPL EQU   0                                                        01390000
RESOBQCB EQU   IEDRESPL+12                                              01391000
RESFLAGS EQU   IEDRESPL+49                                              01392000
RESQHBL  EQU   IEDRESPL+60                                              01393000
RESPLRVT EQU   IEDRESPL+76                                              01394000
RESABUF  EQU   IEDRESPL+80                                              01395000
RESMHSRC EQU   IEDRESPL+88                                              01396000
RESPLADR EQU   IEDRESPL+96                                              01397000
RESPLAC  EQU   RESPLADR+44                                              01398000
RESPL42  EQU   RESPLADR+56                                              01399000
RESPLM2  EQU   RESPLADR+68                                              01400000
IEDRH    EQU   0                                                        01401000
TRHBYTE0 EQU   IEDRH                                                    01402000
TRHTYPE  EQU   TRHBYTE0                                                 01403000
TRHSDI   EQU   TRHBYTE0                                                 01404000
TRHBC    EQU   TRHBYTE0                                                 01405000
TRHEC    EQU   TRHBYTE0                                                 01406000
TRHBYTE1 EQU   IEDRH+1                                                  01407000
TRHDR1   EQU   TRHBYTE1                                                 01408000
TRHDR2   EQU   TRHBYTE1                                                 01409000
TRHER    EQU   TRHBYTE1                                                 01410000
TRHBYTE2 EQU   IEDRH+2                                                  01411000
TRHBB    EQU   TRHBYTE2                                                 01412000
TRHEB    EQU   TRHBYTE2                                                 01413000
TRHCDI   EQU   TRHBYTE2                                                 01414000
TRHCSI   EQU   TRHBYTE2                                                 01415000
IEDQSCB  EQU   0                                                        01416000
SCBSTATE EQU   IEDQSCB                                                  01417000
SCBSEQIN EQU   SCBSTATE                                                 01418000
SCBDESTQ EQU   IEDQSCB+1                                                01419000
SCBRCVCT EQU   IEDQSCB+4                                                01420000
SCBMBHEN EQU   IEDQSCB+5                                                01421000
SCBBKFCT EQU   IEDQSCB+9                                                01422000
SCBEOBSZ EQU   SCBBKFCT+1                                               01423000
SCBSALEV EQU   IEDQSCB+12                                               01424000
SCBQTYPE EQU   SCBSALEV                                                 01425000
SCBERRST EQU   IEDQSCB+16                                               01426000
SCBERR1  EQU   SCBERRST                                                 01427000
SCBHDRRN EQU   SCBERR1                                                  01428000
SCBORIGN EQU   SCBERR1                                                  01429000
SCBNOTRM EQU   SCBERR1                                                  01430000
SCBSEQHN EQU   SCBERR1                                                  01431000
SCBSEQLN EQU   SCBERR1                                                  01432000
SCBCUTFN EQU   SCBERR1                                                  01433000
SCBERR2  EQU   SCBERRST+1                                               01434000
SCBABRTN EQU   SCBERR2                                                  01435000
SCBERR3  EQU   SCBERRST+2                                               01436000
SCBLOSTN EQU   SCBERR3                                                  01437000
SCBTMIDN EQU   SCBERR3                                                  01438000
SCBFORMN EQU   SCBERR3                                                  01439000
SCBATTN  EQU   SCBERR3                                                  01440000
SCBXCEPN EQU   SCBERR3                                                  01441000
SCBERR4  EQU   SCBERRST+3                                               01442000
SCBTXTTN EQU   SCBERR4                                                  01443000
SCBCTLUN EQU   SCBERR4                                                  01444000
SCBCHANN EQU   SCBERR4                                                  01445000
SCBDLPTR EQU   IEDQSCB+22                                               01446000
SCBEOBAC EQU   SCBDLPTR                                                 01447000
SCBCTBAC EQU   SCBEOBAC                                                 01448000
SCBBSCFM EQU   IEDQSCB+24                                               01449000
SCBDATEN EQU   SCBBSCFM                                                 01450000
SCBITBSZ EQU   IEDQSCB+40                                               01451000
SCBCTBSV EQU   SCBITBSZ                                                 01452000
SCBDNSEG EQU   IEDQSCB+41                                               01453000
SCBCLSEG EQU   IEDQSCB+45                                               01454000
SCBITBAC EQU   IEDQSCB+48                                               01455000
SCBCTBFL EQU   SCBITBAC                                                 01456000
SCBBLKCT EQU   SCBCTBFL                                                 01457000
SCBDCSEG EQU   IEDQSCB+49                                               01458000
SCBSTAT1 EQU   IEDQSCB+60                                               01459000
SCBCORE  EQU   IEDQSCB+61                                               01460000
SCBSCAN  EQU   IEDQSCB+64                                               01461000
SCBNTXT  EQU   IEDQSCB+66                                               01462000
SCBCHDR  EQU   IEDQSCB+72                                               01463000
SCBCCSEG EQU   IEDQSCB+75                                               01464000
SCBEND   EQU   IEDQSCB+84                                               01465000
IEDQSPTR EQU   0                                                        01466000
IEDTH    EQU   0                                                        01467000
TTHBYTE0 EQU   IEDTH                                                    01468000
TTHFTYPE EQU   TTHBYTE0                                                 01469000
TTHBBIU  EQU   TTHBYTE0                                                 01470000
TTHEBIU  EQU   TTHBYTE0                                                 01471000
TTHEFI   EQU   TTHBYTE0                                                 01472000
TTHBYTE1 EQU   IEDTH+1                                                  01473000
TTHDAF   EQU   IEDTH+2                                                  01474000
TTHOAF   EQU   IEDTH+4                                                  01475000
TTHSNF   EQU   IEDTH+6                                                  01476000
TTHTAG   EQU   TTHSNF                                                   01477000
TTHTAG1  EQU   TTHTAG                                                   01478000
TTHDCF   EQU   IEDTH+8                                                  01479000
IEDTRM   EQU   0                                                        01480000
IEDNTRM  EQU   IEDTRM                                                   01481000
TRMBYTE4 EQU   IEDNTRM                                                  01482000
TRMBYTE3 EQU   IEDNTRM+1                                                01483000
TRMBYTE2 EQU   IEDNTRM+2                                                01484000
TRMINPG  EQU   TRMBYTE2                                                 01485000
TRMBYTE1 EQU   IEDNTRM+3                                                01486000
TRMSCPRQ EQU   TRMBYTE1                                                 01487000
TRMBYTE0 EQU   IEDNTRM+6                                                01488000
TRMSIBPT EQU   IEDNTRM+7                                                01489000
TRMTYPE  EQU   IEDNTRM+11                                               01490000
IEDQTRM  EQU   IEDTRM+14                                                01491000
TRMSTATE EQU   IEDQTRM                                                  01492000
TRMLOG   EQU   TRMSTATE                                                 01493000
TRMPREF  EQU   TRMSTATE                                                 01494000
TRMDESTQ EQU   IEDQTRM+1                                                01495000
TRMINSEQ EQU   IEDQTRM+4                                                01496000
TLISTCNT EQU   TRMINSEQ                                                 01497000
TRMOUTSQ EQU   IEDQTRM+6                                                01498000
TLISTEN  EQU   TRMOUTSQ                                                 01499000
TRMDSORG EQU   TLISTEN                                                  01500000
TRMALTD  EQU   IEDQTRM+8                                                01501000
TRMDEVFL EQU   IEDQTRM+10                                               01502000
TRMSTAT  EQU   IEDQTRM+12                                               01503000
TRMCHCIN EQU   IEDQTRM+16                                               01504000
IEDTTCD  EQU   0                                                        01505000
IEDTTCP  EQU   0                                                        01506000
IEDTTCPL EQU   0                                                        01507000
TTCSVCPL EQU   IEDTTCPL                                                 01508000
TTCSVCW1 EQU   TTCSVCPL                                                 01509000
TTCSVCW2 EQU   TTCSVCPL+4                                               01510000
IEDTTCFD EQU   0                                                        01511000
IEDTTCQB EQU   0                                                        01512000
TTCQCB   EQU   IEDTTCQB                                                 01513000
TTCSCB   EQU   IEDTTCQB+12                                              01514000
IEDQTNT  EQU   0                                                        01515000
IEDMVBFR EQU   0                                                        01516000
ALLOCBUF EQU   0                                                        01517000
POSTWAIT EQU   0                                                        01518000
SENDMAP  EQU   0                                                        01519000
SENDTCB  EQU   SENDMAP+4                                                01520000
SENDCDS  EQU   SENDMAP+8                                                01521000
SENDARA  EQU   SENDMAP+12                                               01522000
SENDRLN  EQU   SENDMAP+16                                               01523000
SENDFLG  EQU   SENDMAP+18                                               01524000
SENDBBKT EQU   SENDFLG                                                  01525000
SENDEBKT EQU   SENDFLG                                                  01526000
SENDRFME EQU   SENDFLG                                                  01527000
SENDREX  EQU   SENDFLG                                                  01528000
SENDCDSL EQU   SENDFLG                                                  01529000
SENDSTPE EQU   SENDFLG                                                  01530000
SENDCCMD EQU   SENDFLG+1                                                01531000
SENDCREQ EQU   SENDFLG+1                                                01532000
TESTDSN  EQU   0                                                        01533000
TTECB    EQU   0                                                        01534000
TECBFDCT EQU   TTECB                                                    01535000
TECBFDLN EQU   TTECB+1                                                  01536000
TECBSNLN EQU   TTECB+2                                                  01537000
TECBSNCT EQU   TTECB+5                                                  01538000
TECBSNOC EQU   TTECB+6                                                  01539000
TECBFD01 EQU   TTECB+8                                                  01540000
LTECB    EQU   0                                                        01541000
LTCBSENS EQU   LTECB+3                                                  01542000
LTCBRESP EQU   LTECB+7                                                  01543000
LTCBRTPE EQU   LTECB+10                                                 01544000
LTCBBRCH EQU   LTECB+11                                                 01545000
LTCBALT  EQU   LTCBBRCH                                                 01546000
LTCBCHN  EQU   LTECB+12                                                 01547000
LTCBFIR  EQU   LTCBCHN                                                  01548000
LTCBLAST EQU   LTCBCHN                                                  01549000
LTCBONLY EQU   LTCBCHN                                                  01550000
LCDS     EQU   0                                                        01551000
LCDSFBTE EQU   LCDS+5                                                   01552000
LCDSSMNM EQU   LCDS+12                                                  01553000
SENDBNDA EQU   0                                                        01554000
LCBRSPIN EQU   LCBIOBSN                                                 01555000
LCBLUSNS EQU   LCBRSPIN+5                                               01556000
LCBSCPRS EQU   LCBRSPIN+9                                               01557000
LCBCSWU1 EQU   LCBSCPRS+2                                               01558000
LCBRSPFG EQU   LCBRSPIN+15                                              01559000
LCBCOREQ EQU   LCBTPCD                                                  01560000
@NM00162 EQU   LCBCPA+40                                                01561000
LCBQNX   EQU   LCBERCCW                                                 01562000
LCBQNXMN EQU   LCBQNX                                                   01563000
LCBCANCL EQU   LCBSAVSN                                                 01564000
LCBCANFG EQU   LCBCANCL                                                 01565000
PRFSHDR  EQU   IEDQPRF+42                                               01566000
TRMPRE1  EQU   TRMBYTE4                                                 01567000
TRMNCP1  EQU   TRMBYTE4                                                 01568000
TRMPRE   EQU   TRMBYTE3                                                 01569000
TRMNCP   EQU   TRMBYTE3                                                 01570000
TRMPU    EQU   TRMBYTE3                                                 01571000
TRMLU    EQU   TRMBYTE3                                                 01572000
TRMTDIFF EQU   TRMLU                                                    01573000
TRMLINK  EQU   TRMBYTE3                                                 01574000
REQELEM  EQU   TOTWOWRK                                                 01575000
REQQCB   EQU   REQELEM                                                  01576000
@NM00285 EQU   REQELEM+4                                                01577000
REQPRI   EQU   @NM00285                                                 01578000
REQLINK  EQU   @NM00285+1                                               01579000
BASSAVE  EQU   TOTSAVE2                                                 01580000
BASNBUNT EQU   BASSAVE                                                  01581000
BASRPAR  EQU   BASSAVE+4                                                01582000
BASRIOB  EQU   BASSAVE+8                                                01583000
BASRTRM  EQU   BASSAVE+12                                               01584000
BASRPRF  EQU   BASSAVE+20                                               01585000
BASRPIU  EQU   BASSAVE+24                                               01586000
BASRRET  EQU   BASSAVE+28                                               01587000
BASRTEC  EQU   BASSAVE+32                                               01588000
BASRLCB  EQU   BASSAVE+36                                               01589000
SCBRGSAV EQU   SCBEND                                                   01590000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01591000
BASRBIN  EQU   BASSAVE+16                                               01592000
@NM00269 EQU   TRMLINK                                                  01593000
TRMLSTAT EQU   TRMLINK                                                  01594000
TRMLINT  EQU   TRMLINK                                                  01595000
TRMEPMOD EQU   TRMLINK                                                  01596000
TRMLULOG EQU   TRMLU                                                    01597000
TRMINERR EQU   TRMLU                                                    01598000
TRMLUREQ EQU   TRMLU                                                    01599000
TRMSESRQ EQU   TRMLU                                                    01600000
TRMLUTM  EQU   TRMLU                                                    01601000
TRMLUIT  EQU   TRMLU                                                    01602000
TRMAUTO  EQU   TRMLU                                                    01603000
TRMPCONT EQU   TRMPU                                                    01604000
@NM00268 EQU   TRMPU                                                    01605000
TRMNCONT EQU   TRMNCP                                                   01606000
TRMQUCKN EQU   TRMNCP                                                   01607000
TRMSLOWN EQU   TRMNCP                                                   01608000
TRMSYGEN EQU   TRMNCP                                                   01609000
TRMNCPCL EQU   TRMNCP                                                   01610000
TRMIPLDM EQU   TRMNCP                                                   01611000
TRMINOUT EQU   TRMPRE                                                   01612000
TRMRDOUT EQU   TRMPRE                                                   01613000
TRMNLOUT EQU   TRMPRE                                                   01614000
TRMWROUT EQU   TRMPRE                                                   01615000
TRMASNXI EQU   TRMPRE                                                   01616000
TRMSTMM  EQU   TRMPRE                                                   01617000
TRMCMODE EQU   TRMPRE                                                   01618000
TRMSTPND EQU   TRMPRE                                                   01619000
@NM00267 EQU   TRMNCP1                                                  01620000
TRMINOP  EQU   TRMNCP1                                                  01621000
TRMLYNCH EQU   TRMPRE1                                                  01622000
TRMSPOUT EQU   TRMPRE1                                                  01623000
TRMERLCK EQU   TRMPRE1                                                  01624000
TRMQNPL  EQU   TRMPRE1                                                  01625000
TRMSPACT EQU   TRMPRE1                                                  01626000
TRMOCNI  EQU   TRMPRE1                                                  01627000
TRMSESSN EQU   TRMPRE1                                                  01628000
TRMCONT  EQU   TRMPRE1                                                  01629000
@NM00170 EQU   LCBCANCL+3                                               01630000
LCBCANTH EQU   LCBCANCL+1                                               01631000
@NM00169 EQU   LCBCANFG                                                 01632000
LCBCANCD EQU   LCBCANFG                                                 01633000
@NM00168 EQU   LCBCANFG                                                 01634000
LCBCANEB EQU   LCBCANFG                                                 01635000
LCBCANXT EQU   LCBCANFG                                                 01636000
LCBUNADD EQU   LCBQNX+21                                                01637000
LCBUASZE EQU   LCBQNX+20                                                01638000
LCBDSTEA EQU   LCBQNX+16                                                01639000
@NM00167 EQU   LCBQNX+8                                                 01640000
LCBIOSBS EQU   LCBQNX+5                                                 01641000
@NM00166 EQU   LCBQNX+4                                                 01642000
LCBSTSAV EQU   LCBQNX+1                                                 01643000
@NM00165 EQU   LCBQNXMN                                                 01644000
LCBNX509 EQU   LCBQNXMN                                                 01645000
LCBNX162 EQU   LCBQNXMN                                                 01646000
LCBNX142 EQU   LCBQNXMN                                                 01647000
LCBNX064 EQU   LCBQNXMN                                                 01648000
@NM00164 EQU   @NM00162+4                                               01649000
LCBNCPPT EQU   @NM00162+1                                               01650000
@NM00163 EQU   @NM00162                                                 01651000
LCBWRSCH EQU   LCBCOREQ+8                                               01652000
LCBCQLNK EQU   LCBCOREQ+4                                               01653000
LCBCQELE EQU   LCBCOREQ                                                 01654000
LCBPAKCH EQU   LCBRSPIN+16                                              01655000
@NM00161 EQU   LCBRSPFG                                                 01656000
LCBRSRH  EQU   LCBRSPFG                                                 01657000
LCBEXPI  EQU   LCBRSPFG                                                 01658000
@NM00160 EQU   LCBRSPIN+12                                              01659000
LCBUSUE1 EQU   LCBCSWU1                                                 01660000
@NM00159 EQU   LCBCSWU1                                                 01661000
@NM00158 EQU   LCBSCPRS+1                                               01662000
LCBDFCMD EQU   LCBSCPRS                                                 01663000
LCBUSER  EQU   LCBLUSNS+2                                               01664000
LCBSMIN  EQU   LCBLUSNS+1                                               01665000
LCBSMAJ  EQU   LCBLUSNS                                                 01666000
LCBRHSV  EQU   LCBRSPIN+2                                               01667000
LCBSNS0  EQU   LCBRSPIN+1                                               01668000
@NM00157 EQU   LCBRSPIN                                                 01669000
LCDSFLGS EQU   LCDS+9                                                   01670000
LCDSBTEC EQU   LCDS+8                                                   01671000
LCDSSTPE EQU   LCDS+7                                                   01672000
LCDSCLSS EQU   LCDS+6                                                   01673000
LCDSTRMF EQU   LCDS+4                                                   01674000
LCDSUNTA EQU   LCDS                                                     01675000
LTCBSEQN EQU   LTECB+16                                                 01676000
LTCBCTL  EQU   LTECB+13                                                 01677000
@NM00284 EQU   LTCBCHN                                                  01678000
LTCBMID  EQU   LTCBCHN                                                  01679000
@NM00283 EQU   LTCBBRCH                                                 01680000
LTCBREQ  EQU   LTCBBRCH                                                 01681000
LTCBCMD  EQU   LTCBBRCH                                                 01682000
LTCBEB   EQU   LTCBBRCH                                                 01683000
LTCBBB   EQU   LTCBBRCH                                                 01684000
@NM00282 EQU   LTCBRTPE                                                 01685000
LTCBRSP  EQU   LTCBRTPE                                                 01686000
@NM00281 EQU   LTCBRTPE                                                 01687000
LTCBLORR EQU   LTECB+8                                                  01688000
@NM00280 EQU   LTCBRESP                                                 01689000
LTCBFME  EQU   LTCBRESP                                                 01690000
LTCBEX   EQU   LTCBRESP                                                 01691000
@NM00279 EQU   LTCBRESP                                                 01692000
LTCBUSER EQU   LTCBSENS+2                                               01693000
LTCBSSMD EQU   LTCBSENS+1                                               01694000
LTCBSYSS EQU   LTCBSENS                                                 01695000
@NM00278 EQU   LTECB                                                    01696000
TECBEVOC EQU   TTECB+7                                                  01697000
TECBFLGS EQU   TTECB+4                                                  01698000
@NM00277 EQU   SENDFLG+1                                                01699000
SENDFMHR EQU   SENDFLG                                                  01700000
@NM00276 EQU   SENDFLG                                                  01701000
@NM00275 EQU   SENDMAP+2                                                01702000
@NM00274 EQU   SENDMAP+1                                                01703000
@NM00273 EQU   SENDMAP                                                  01704000
TTCQSTCB EQU   TTCQCB+8                                                 01705000
TTCQBECB EQU   TTCQCB+4                                                 01706000
TTCQBELC EQU   TTCQCB+1                                                 01707000
TTCQBFLG EQU   TTCQCB                                                   01708000
@NM00272 EQU   IEDTTCFD                                                 01709000
@NM00271 EQU   IEDTTCPL+8                                               01710000
TTCLAST  EQU   TTCSVCW2                                                 01711000
TTCFIRST EQU   TTCSVCW1+1                                               01712000
TTCPCODE EQU   TTCSVCW1                                                 01713000
@NM00270 EQU   IEDTTCD                                                  01714000
TRMOPT   EQU   IEDTRM+34                                                01715000
TRMOPTBL EQU   IEDQTRM+18                                               01716000
TRMOPNO  EQU   IEDQTRM+17                                               01717000
TRMSENSE EQU   TRMSTAT+3                                                01718000
TRMTEMPR EQU   TRMSTAT+2                                                01719000
TRMSIO   EQU   TRMSTAT                                                  01720000
@NM00266 EQU   TRMDEVFL+1                                               01721000
TRMTPIN  EQU   TRMDEVFL+1                                               01722000
TRMNCPI  EQU   TRMDEVFL+1                                               01723000
TRMRNTRM EQU   TRMDEVFL+1                                               01724000
@NM00265 EQU   TRMDEVFL+1                                               01725000
TRMLMD   EQU   TRMDEVFL+1                                               01726000
TRMCONC  EQU   TRMDEVFL+1                                               01727000
TRMTSOB  EQU   TRMDEVFL                                                 01728000
TRMBFDY  EQU   TRMDEVFL                                                 01729000
TRMTBLK  EQU   TRMDEVFL                                                 01730000
TRMSBLK  EQU   TRMDEVFL                                                 01731000
TRMBLKS  EQU   TRMDEVFL                                                 01732000
TRMADDC  EQU   TRMDEVFL                                                 01733000
TRMDDIG  EQU   TRMDEVFL                                                 01734000
TRMBUFS  EQU   TRMDEVFL                                                 01735000
TRMPRILK EQU   TRMALTD                                                  01736000
TRMLGB   EQU   TRMDSORG                                                 01737000
TRMUTERM EQU   TLISTCNT                                                 01738000
TRMSCNYN EQU   TRMSTATE                                                 01739000
TRMOPTFN EQU   TRMSTATE                                                 01740000
TRMHELDN EQU   TRMSTATE                                                 01741000
TRMACPTN EQU   TRMSTATE                                                 01742000
TRMPROC  EQU   TRMLOG                                                   01743000
TRMLIST  EQU   TRMLOG                                                   01744000
TRMLINE  EQU   TRMSTATE                                                 01745000
TRMSUBST EQU   IEDNTRM+12                                               01746000
TRMRLMCT EQU   IEDNTRM+10                                               01747000
TRMCOHTG EQU   TRMSIBPT+1                                               01748000
TRMGPCNT EQU   TRMSIBPT                                                 01749000
TRMBUFRD EQU   TRMBYTE0                                                 01750000
TRMSNA   EQU   TRMBYTE0                                                 01751000
TRMGP    EQU   TRMBYTE0                                                 01752000
TRMDIAL  EQU   TRMBYTE0                                                 01753000
@NM00264 EQU   TRMBYTE0                                                 01754000
TRMOUTPT EQU   TRMBYTE0                                                 01755000
TRMINPUT EQU   TRMBYTE0                                                 01756000
TRMUDEF  EQU   TRMBYTE0                                                 01757000
TRMCOHRT EQU   IEDNTRM+4                                                01758000
TRMSTOTE EQU   TRMBYTE1                                                 01759000
TRMCKPRN EQU   TRMBYTE1                                                 01760000
TRMTSATN EQU   TRMBYTE1                                                 01761000
TRMTRACE EQU   TRMBYTE1                                                 01762000
TRMSWBCK EQU   TRMBYTE1                                                 01763000
TRMAUTOC EQU   TRMBYTE1                                                 01764000
TRMINPTP EQU   TRMBYTE1                                                 01765000
TRMWTNEG EQU   TRMSCPRQ                                                 01766000
TRMWRBRK EQU   TRMBYTE2                                                 01767000
TRMNOSND EQU   TRMBYTE2                                                 01768000
TRMPREP  EQU   TRMBYTE2                                                 01769000
TRMGPACT EQU   TRMBYTE2                                                 01770000
TRMANDL  EQU   TRMBYTE2                                                 01771000
TRMCLOSN EQU   TRMINPG                                                  01772000
TRMREMB  EQU   TRMBYTE2                                                 01773000
TRMRSACT EQU   TRMBYTE2                                                 01774000
TTHTAG2  EQU   TTHTAG+1                                                 01775000
@NM00263 EQU   TTHTAG1                                                  01776000
TTHTAGS  EQU   TTHTAG1                                                  01777000
@NM00262 EQU   TTHBYTE0                                                 01778000
SCBTRANS EQU   IEDQSCB+81                                               01779000
SCBUNTCT EQU   IEDQSCB+80                                               01780000
SCBEOB   EQU   IEDQSCB+78                                               01781000
SCBNXCPB EQU   SCBCCSEG                                                 01782000
SCBNHDR  EQU   SCBCHDR                                                  01783000
SCBCRCD  EQU   IEDQSCB+69                                               01784000
SCBTQBCK EQU   SCBNTXT                                                  01785000
SCBOSEQ  EQU   SCBSCAN                                                  01786000
SCBXTRA  EQU   SCBCORE                                                  01787000
SCBNOPST EQU   SCBSTAT1                                                 01788000
SCBNIDLE EQU   SCBSTAT1                                                 01789000
SCBCEND  EQU   SCBSTAT1                                                 01790000
SCBCBGN  EQU   SCBSTAT1                                                 01791000
SCBSIZE  EQU   IEDQSCB+58                                               01792000
SCBSRCE  EQU   IEDQSCB+56                                               01793000
SCBDEOB  EQU   IEDQSCB+52                                               01794000
SCBFEFO  EQU   SCBDCSEG                                                 01795000
SCBCTBND EQU   SCBBLKCT                                                 01796000
SCBSCHDR EQU   SCBCLSEG                                                 01797000
SCBHBFNO EQU   IEDQSCB+44                                               01798000
SCBSCSEG EQU   SCBDNSEG                                                 01799000
SCBBCTR  EQU   SCBCTBSV                                                 01800000
SCBCCHDR EQU   IEDQSCB+37                                               01801000
SCBDESTL EQU   IEDQSCB+36                                               01802000
SCBDCHDR EQU   IEDQSCB+33                                               01803000
SCBCPBNO EQU   IEDQSCB+32                                               01804000
SCBMBSSA EQU   IEDQSCB+25                                               01805000
SCBMLMTN EQU   SCBBSCFM                                                 01806000
SCBNOEOT EQU   SCBBSCFM                                                 01807000
@NM00261 EQU   SCBBSCFM                                                 01808000
SCBNPDTR EQU   SCBDATEN                                                 01809000
SCBCNTEN EQU   SCBBSCFM                                                 01810000
SCBRCVTX EQU   SCBBSCFM                                                 01811000
SCBNONTR EQU   SCBBSCFM                                                 01812000
SCBTRNSP EQU   SCBBSCFM                                                 01813000
SCBENDCR EQU   SCBCTBAC+1                                               01814000
SCBCRLEN EQU   SCBCTBAC                                                 01815000
SCBMRFSD EQU   IEDQSCB+20                                               01816000
SCBUNDFN EQU   SCBERR4                                                  01817000
SCBSTERN EQU   SCBCHANN                                                 01818000
SCBCPMEN EQU   SCBCTLUN                                                 01819000
@NM00260 EQU   SCBERR4                                                  01820000
SCBTRMLN EQU   SCBERR4                                                  01821000
SCBCONNN EQU   SCBERR4                                                  01822000
SCBAPERR EQU   SCBTXTTN                                                 01823000
SCBSLCTN EQU   SCBERR4                                                  01824000
SCBPERRN EQU   SCBXCEPN                                                 01825000
SCBTHRSN EQU   SCBATTN                                                  01826000
SCBFIERN EQU   SCBFORMN                                                 01827000
SCBUSERN EQU   SCBERR3                                                  01828000
SCBSATTN EQU   SCBERR3                                                  01829000
SCBTMINN EQU   SCBERR3                                                  01830000
SCBXPD   EQU   SCBTMIDN                                                 01831000
SCBXPI   EQU   SCBLOSTN                                                 01832000
SCBSOHE  EQU   SCBERR2                                                  01833000
SCBFRWDN EQU   SCBERR2                                                  01834000
SCBRRJN  EQU   SCBABRTN                                                 01835000
SCBOLTR  EQU   SCBERR2                                                  01836000
SCBALN   EQU   SCBERR2                                                  01837000
SCBCODER EQU   SCBERR2                                                  01838000
SCBCRMAX EQU   SCBERR2                                                  01839000
SCBCRMIN EQU   SCBERR2                                                  01840000
SCBRVISL EQU   SCBCUTFN                                                 01841000
SCBNOBFN EQU   SCBERR1                                                  01842000
@NM00259 EQU   SCBERR1                                                  01843000
SCBNOVAC EQU   SCBSEQLN                                                 01844000
SCBNOTSO EQU   SCBSEQHN                                                 01845000
SCBRVITX EQU   SCBNOTRM                                                 01846000
SCBHANG  EQU   SCBORIGN                                                 01847000
SCBNOLOG EQU   SCBHDRRN                                                 01848000
SCBMRFPL EQU   IEDQSCB+13                                               01849000
SCBBFMM  EQU   SCBQTYPE                                                 01850000
SCBBBFTM EQU   SCBQTYPE                                                 01851000
SCBNOFF  EQU   SCBQTYPE                                                 01852000
SCBCONC  EQU   SCBQTYPE                                                 01853000
SCBNREUS EQU   SCBQTYPE                                                 01854000
SCBREUS  EQU   SCBQTYPE                                                 01855000
SCBCOREQ EQU   SCBQTYPE                                                 01856000
SCBNORCL EQU   SCBQTYPE                                                 01857000
SCBCTBSZ EQU   SCBEOBSZ                                                 01858000
@NM00258 EQU   SCBBKFCT                                                 01859000
SCBPRI   EQU   IEDQSCB+8                                                01860000
SCBMACR  EQU   SCBMBHEN                                                 01861000
SCBSNDCT EQU   SCBRCVCT                                                 01862000
SCBCODE  EQU   SCBSTATE                                                 01863000
SCBPRER  EQU   SCBSTATE                                                 01864000
SCBCKPT  EQU   SCBSTATE                                                 01865000
SCBMSGLN EQU   SCBSTATE                                                 01866000
SCBERSDS EQU   SCBSTATE                                                 01867000
SCBLCK1N EQU   SCBSTATE                                                 01868000
SCBMGFMN EQU   SCBSEQIN                                                 01869000
SCBTRANP EQU   SCBSTATE                                                 01870000
@NM00257 EQU   TRHBYTE2                                                 01871000
@NM00256 EQU   TRHBYTE2                                                 01872000
@NM00255 EQU   TRHBYTE2                                                 01873000
@NM00254 EQU   TRHBYTE2                                                 01874000
TRHPI    EQU   TRHBYTE1                                                 01875000
@NM00253 EQU   TRHBYTE1                                                 01876000
@NM00252 EQU   TRHBYTE1                                                 01877000
@NM00251 EQU   TRHBYTE1                                                 01878000
@NM00250 EQU   TRHBYTE1                                                 01879000
TRHFI    EQU   TRHBYTE0                                                 01880000
@NM00249 EQU   TRHBYTE0                                                 01881000
TRHRUCAT EQU   TRHBYTE0                                                 01882000
RESAPDCB EQU   IEDRESPL+180                                             01883000
RESTLIB  EQU   IEDRESPL+176                                             01884000
RESPL33  EQU   RESPLADR+76                                              01885000
RESPL25  EQU   RESPLADR+72                                              01886000
RESPL47  EQU   RESPLADR+64                                              01887000
RESPL44  EQU   RESPLADR+60                                              01888000
RESPL43  EQU   RESPL42                                                  01889000
RESPL16  EQU   RESPLADR+52                                              01890000
RESPL41  EQU   RESPLADR+48                                              01891000
RESPL21  EQU   RESPLAC                                                  01892000
RESPL36  EQU   RESPLADR+40                                              01893000
RESPL28  EQU   RESPLADR+36                                              01894000
RESPL37  EQU   RESPLADR+32                                              01895000
RESPLP2  EQU   RESPLADR+28                                              01896000
RESPLP1  EQU   RESPLADR+24                                              01897000
RESPL39  EQU   RESPLADR+20                                              01898000
RESPLAA  EQU   RESPLADR+16                                              01899000
RESPL35  EQU   RESPLADR+12                                              01900000
RESPLAJ  EQU   RESPLADR+8                                               01901000
RESPLAB  EQU   RESPLADR+4                                               01902000
RESPLWO  EQU   RESPLADR                                                 01903000
RESTOTMH EQU   IEDRESPL+92                                              01904000
RESMHNAT EQU   IEDRESPL+90                                              01905000
RESFBUF  EQU   IEDRESPL+84                                              01906000
RESADDAF EQU   RESQHBL+12                                               01907000
RESADDND EQU   RESQHBL+8                                                01908000
RESREMEL EQU   RESQHBL+4                                                01909000
RESREMFR EQU   RESQHBL                                                  01910000
RESTNTPT EQU   IEDRESPL+57                                              01911000
@NM00248 EQU   IEDRESPL+56                                              01912000
RESTRMQ  EQU   IEDRESPL+52                                              01913000
@NM00247 EQU   IEDRESPL+50                                              01914000
@NM00246 EQU   RESFLAGS                                                 01915000
RESFIRST EQU   RESFLAGS                                                 01916000
RESINIT  EQU   RESFLAGS                                                 01917000
RESWBFNC EQU   IEDRESPL+48                                              01918000
RESSMGRA EQU   IEDRESPL+44                                              01919000
RESSTAEA EQU   IEDRESPL+40                                              01920000
RESETXRA EQU   IEDRESPL+36                                              01921000
RESDMTTE EQU   IEDRESPL+33                                              01922000
RESTNTCT EQU   IEDRESPL+32                                              01923000
RESEFQCB EQU   IEDRESPL+28                                              01924000
RESBKAVL EQU   IEDRESPL+26                                              01925000
RESBKTOT EQU   IEDRESPL+24                                              01926000
RESTTLST EQU   IEDRESPL+20                                              01927000
RESOBBKW EQU   RESOBQCB+4                                               01928000
RESOBFWD EQU   RESOBQCB                                                 01929000
RESTECB1 EQU   IEDRESPL+8                                               01930000
@NM00245 EQU   IEDRESPL+5                                               01931000
@NM00244 EQU   IEDRESPL+4                                               01932000
RESTECBS EQU   IEDRESPL                                                 01933000
@NM00243 EQU   IEDPF2+1                                                 01934000
@NM00242 EQU   PRF2FLG2                                                 01935000
PRF2TERM EQU   PRF2FLG2                                                 01936000
PRF2SMI  EQU   PRF2FLG2                                                 01937000
PRF1RULN EQU   PRF1SEQP+2                                               01938000
PRF1TAG2 EQU   PRF1SQID+1                                               01939000
@NM00241 EQU   PRF1TAG1                                                 01940000
PRF1TAGS EQU   PRF1TAG1                                                 01941000
@NM00240 EQU   PRF1FLG1                                                 01942000
PRF1LOGD EQU   PRF1FLG1                                                 01943000
PRF1USS  EQU   PRF1FLG1                                                 01944000
PRF1FORM EQU   PRF1FLG1                                                 01945000
PRF1EXPI EQU   PRF1FLG1                                                 01946000
PRF1FIDI EQU   PRF1FLG1                                                 01947000
PRF1RH   EQU   IEDPF1                                                   01948000
PRFISEQ  EQU   IEDQPRF+38                                               01949000
PRFSTXT  EQU   PRFHQBCK                                                 01950000
PRFNHDR  EQU   PRFCHDR                                                  01951000
PRFCRCD  EQU   IEDQPRF+29                                               01952000
PRFSVSEQ EQU   PRFNTXT+1                                                01953000
PRFSVPRI EQU   PRFEOBOF                                                 01954000
PRFISIZE EQU   PRFSCAN+1                                                01955000
@NM00239 EQU   PRFSCAN                                                  01956000
PRFEOB   EQU   PRFXTRA+1                                                01957000
PRFSTSO  EQU   PRFXTRA                                                  01958000
PRFNHDRN EQU   PRFSTAT1                                                 01959000
PRFNLSTN EQU   PRFSTAT1                                                 01960000
PRFLOCK  EQU   PRFEOFN                                                  01961000
PRFDUPLN EQU   PRFSTAT1                                                 01962000
PRFTSMSG EQU   PRFSTAT1                                                 01963000
PRFITCPN EQU   PRFSTAT1                                                 01964000
PRFERMGN EQU   PRFSTAT1                                                 01965000
PRFCNCLN EQU   PRFSTAT1                                                 01966000
PRFSVFLG EQU   @NM00238+3                                               01967000
PRFTI0   EQU   PRFTIC+1                                                 01968000
@NM00237 EQU   PRFTICC                                                  01969000
@NM00236 EQU   PRFTICC                                                  01970000
@NM00235 EQU   PRFTICC                                                  01971000
PRFTICON EQU   PRFTICC                                                  01972000
@NM00234 EQU   PRFTICC                                                  01973000
@NM00233 EQU   PRFTICC                                                  01974000
PRFBFMM  EQU   PRFTICC                                                  01975000
PRFEOMSG EQU   PRFTICC                                                  01976000
PRFCOUNT EQU   PRFLINK+1                                                01977000
@NM00232 EQU   PRFLINK                                                  01978000
PRFFLAGS EQU   PRFPRI                                                   01979000
PRFIOADR EQU   PRFQCBA                                                  01980000
PRFOPCDE EQU   PRFKEY                                                   01981000
PLMVUNCA EQU   IEDPLMV+20                                               01982000
@NM00231 EQU   PLMVFLG1                                                 01983000
PLMVTCTG EQU   PLMVFLG1                                                 01984000
PLMVUNCF EQU   PLMVFLG1                                                 01985000
TOTOBEND EQU   TOTOLTCB+2100                                            01986000
@NM00230 EQU   TOTOLTCB+2044                                            01987000
TOTOLTEN EQU   TOTOLTCB+1820                                            01988000
TOTAPNAM EQU   TOTOLTCB+1812                                            01989000
TOTGRABP EQU   TOTOLTCB+1808                                            01990000
TOTWAITI EQU   TOTOLTCB+1800                                            01991000
@NM00229 EQU   TOTOLTCB+1798                                            01992000
TOTTLCNT EQU   TOTOLTCB+1796                                            01993000
TOTECBPT EQU   TOTOLTCB+1792                                            01994000
TOTWECBA EQU   TOTOLTCB+1788                                            01995000
TOTTDEND EQU   TOTOLTCB+1788                                            01996000
@NM00228 EQU   TOTTDTBL+1                                               01997000
TOTTSWPM EQU   @NM00227                                                 01998000
TOTTDIAC EQU   @NM00227                                                 01999000
TOTTDTHD EQU   @NM00227                                                 02000000
TOTTDLST EQU   @NM00227                                                 02001000
TOTTDORN EQU   @NM00227                                                 02002000
TOTTDGRB EQU   @NM00227                                                 02003000
TOTTDLIN EQU   @NM00227                                                 02004000
TOTTDTRM EQU   @NM00227                                                 02005000
@NM00226 EQU   TOTOLTCB+1710                                            02006000
TOTCONND EQU   TOTOLTCB+1710                                            02007000
TOTCONAP EQU   TOTOLTCB+1709                                            02008000
TOTCONCT EQU   TOTOLTCB+1708                                            02009000
TOTCONTB EQU   TOTOLTCB+1698                                            02010000
TOTOLTTE EQU   TOTOLTCB+1698                                            02011000
TOTOLTTB EQU   TOTOLTCB+1668                                            02012000
TOTTRMND EQU   TOTCROLT                                                 02013000
TOTSCDEB EQU   TOTSCDCB+44                                              02014000
@NM00225 EQU   TOTSCDCB                                                 02015000
TOTSCIOB EQU   TOTOLTCB+1544                                            02016000
TOTSTECB EQU   TOTOLTCB+1540                                            02017000
@NM00224 EQU   TOTSCSN                                                  02018000
@NM00223 EQU   TOTOLTCB+1535                                            02019000
TOTSFLGS EQU   TOTOLTCB+1534                                            02020000
TOTSDTCT EQU   TOTOLTCB+1532                                            02021000
TOTSDTBF EQU   TOTOLTCB+1528                                            02022000
TOTSCBUF EQU   TOTSCENT+32                                              02023000
TOTSCCCW EQU   TOTSCENT+28                                              02024000
TOTSCQCB EQU   TOTSCENT+24                                              02025000
@NM00222 EQU   TOTSCENT+23                                              02026000
@NM00221 EQU   TOTSCFLG                                                 02027000
TOTSEXNM EQU   TOTSCFLG                                                 02028000
TOTSCFME EQU   TOTSCFLG                                                 02029000
TOTSCEX  EQU   TOTSCFLG                                                 02030000
TOTSUNRD EQU   TOTSCFLG                                                 02031000
TOTSPRSC EQU   TOTSCFLG                                                 02032000
TOTSCLU  EQU   TOTSCFLG                                                 02033000
TOTSCTAS EQU   TOTSCFLG                                                 02034000
TOTSCLEN EQU   TOTSCENT+20                                              02035000
TOTSDTNT EQU   TOTSCENT+12                                              02036000
TOTSCLCB EQU   TOTSCENT+9                                               02037000
TOTSCRLN EQU   TOTSCENT+8                                               02038000
TOTSRSID EQU   TOTSCENT+6                                               02039000
TOTSCOFF EQU   TOTSCENT+4                                               02040000
TOTNCOFF EQU   TOTSCENT+2                                               02041000
TOTSCUCB EQU   TOTSCENT                                                 02042000
TOTPRDEB EQU   TOTPRDCB+44                                              02043000
@NM00220 EQU   TOTPRDCB                                                 02044000
TOTPRIOB EQU   TOTOLTCB+1372                                            02045000
TOTPTECB EQU   TOTOLTCB+1368                                            02046000
@NM00219 EQU   TOTPRSN                                                  02047000
@NM00218 EQU   TOTOLTCB+1363                                            02048000
TOTPFLGS EQU   TOTOLTCB+1362                                            02049000
TOTPDTCT EQU   TOTOLTCB+1360                                            02050000
TOTPDTBF EQU   TOTOLTCB+1356                                            02051000
TOTPRBUF EQU   TOTPRENT+32                                              02052000
TOTPRCCW EQU   TOTPRENT+28                                              02053000
TOTPRQCB EQU   TOTPRENT+24                                              02054000
@NM00217 EQU   TOTPRENT+23                                              02055000
@NM00216 EQU   TOTPRFLG                                                 02056000
TOTPEXNM EQU   TOTPRFLG                                                 02057000
TOTPRFME EQU   TOTPRFLG                                                 02058000
TOTPREX  EQU   TOTPRFLG                                                 02059000
TOTPUNRD EQU   TOTPRFLG                                                 02060000
TOTPPRSC EQU   TOTPRFLG                                                 02061000
TOTPRLU  EQU   TOTPRFLG                                                 02062000
TOTPRTAS EQU   TOTPRFLG                                                 02063000
TOTPRLEN EQU   TOTPRENT+20                                              02064000
TOTPDTNT EQU   TOTPRENT+12                                              02065000
TOTPRLCB EQU   TOTPRENT+9                                               02066000
TOTPRRLN EQU   TOTPRENT+8                                               02067000
TOTPRSID EQU   TOTPRENT+6                                               02068000
TOTPROFF EQU   TOTPRENT+4                                               02069000
TOTPCOFF EQU   TOTPRENT+2                                               02070000
TOTPRUCB EQU   TOTPRENT                                                 02071000
TOTTRMBF EQU   TOTPRIBK                                                 02072000
TOTPASS  EQU   TOTOLTCB+1252                                            02073000
TOTEXT   EQU   TOTOLTCB+1196                                            02074000
@NM00215 EQU   TOTOLTCB+1195                                            02075000
TOTOLTRS EQU   TOTFLG10                                                 02076000
TOTOLTWT EQU   TOTFLG10                                                 02077000
TOTOLTED EQU   TOTFLG10                                                 02078000
TOTTNTRQ EQU   TOTFLG10                                                 02079000
@NM00214 EQU   TOTFLG10                                                 02080000
@NM00213 EQU   TOTFLG10                                                 02081000
@NM00212 EQU   TOTFLG10                                                 02082000
TOTTERMS EQU   TOTFLG10                                                 02083000
TOTMACFT EQU   TOTFLG09                                                 02084000
TOTPRECT EQU   TOTFLG09                                                 02085000
TOTLNCON EQU   TOTFLG09                                                 02086000
TOTNOBRK EQU   TOTFLG09                                                 02087000
TOTAPTRM EQU   TOTFLG09                                                 02088000
TOTCTCON EQU   TOTFLG09                                                 02089000
TOTAPOUT EQU   TOTFLG09                                                 02090000
TOTAPCON EQU   TOTFLG09                                                 02091000
@NM00211 EQU   TOTFLG08                                                 02092000
TOTFMCTL EQU   TOTFLG08                                                 02093000
TOTMSSRC EQU   TOTFLG07                                                 02094000
TOTMSPRT EQU   TOTFLG07                                                 02095000
TOTMSREP EQU   TOTFLG07                                                 02096000
TOTMSCEC EQU   TOTFLG07                                                 02097000
@NM00210 EQU   TOTFLG07                                                 02098000
@NM00209 EQU   TOTFLG07                                                 02099000
TOTSECEX EQU   TOTFLG07                                                 02100000
TOTPRIEX EQU   TOTFLG07                                                 02101000
TOTNPERR EQU   TOTFLG06                                                 02102000
TOTOTACT EQU   TOTFLG06                                                 02103000
TOTCANCL EQU   TOTFLG06                                                 02104000
TOTABEND EQU   TOTFLG06                                                 02105000
TOTNCMFG EQU   TOTFLG06                                                 02106000
TOTWACAN EQU   TOTFLG06                                                 02107000
TOTCBOPN EQU   TOTFLG06                                                 02108000
TOTOTERM EQU   TOTFLG06                                                 02109000
TOTNDMSG EQU   TOTFLG05                                                 02110000
TOTEXIOF EQU   TOTFLG05                                                 02111000
TOTTMOUT EQU   TOTFLG05                                                 02112000
TOTSRCON EQU   TOTFLG05                                                 02113000
TOTSRCE  EQU   TOTFLG05                                                 02114000
TOTREPLY EQU   TOTFLG05                                                 02115000
TOTCECOM EQU   TOTFLG05                                                 02116000
TOTPRINT EQU   TOTFLG05                                                 02117000
TOTTTSWT EQU   TOTFLG04                                                 02118000
@NM00208 EQU   TOTFLG04                                                 02119000
@NM00207 EQU   TOTFLG04                                                 02120000
TOTSCCTF EQU   TOTFLG04                                                 02121000
TOTPRCTF EQU   TOTFLG04                                                 02122000
TOTCLOSE EQU   TOTFLG04                                                 02123000
TOTDTCHD EQU   TOTFLG04                                                 02124000
TOTNUMDV EQU   TOTFLG04                                                 02125000
@NM00206 EQU   TOTFLG03                                                 02126000
TOTREPEX EQU   TOTFLG03                                                 02127000
TOTTSINC EQU   TOTFLG03                                                 02128000
TOTIMNCP EQU   TOTFLG03                                                 02129000
TOTOPTER EQU   TOTFLG03                                                 02130000
TOTTSTER EQU   TOTFLG03                                                 02131000
TOTTDFER EQU   TOTFLG03                                                 02132000
TOTAPOER EQU   TOTFLG03                                                 02133000
TOTDEVRN EQU   TOTFLG02                                                 02134000
TOTCONCU EQU   TOTFLG02                                                 02135000
TOTCONMD EQU   TOTFLG02                                                 02136000
TOTCHKSZ EQU   TOTFLG02                                                 02137000
TOTOLTRQ EQU   TOTFLG02                                                 02138000
TOTDEV0X EQU   TOTFLG02                                                 02139000
TOTTSST  EQU   TOTFLG02                                                 02140000
TOTTTSPE EQU   TOTFLG02                                                 02141000
TOTCLNED EQU   TOTFLG01                                                 02142000
TOTCLNST EQU   TOTFLG01                                                 02143000
TOTPRMPT EQU   TOTFLG01                                                 02144000
TOTEXIT  EQU   TOTFLG01                                                 02145000
TOTIPLCU EQU   TOTFLG01                                                 02146000
TOTCONFG EQU   TOTFLG01                                                 02147000
TOTFINAL EQU   TOTFLG01                                                 02148000
TOTSTAE  EQU   TOTOLTCB+1176                                            02149000
@NM00205 EQU   TOTOLTCB+1152                                            02150000
TOTWKEND EQU   TOTOLTCB+1152                                            02151000
@NM00204 EQU   TOTOLTCB+1020                                            02152000
TOTPLBKW EQU   TOTPLNKQ+4                                               02153000
TOTPLFWD EQU   TOTPLNKQ                                                 02154000
@NM00203 EQU   TOTOLTCB+1011                                            02155000
TOTOLTID EQU   TOTOLTCB+1008                                            02156000
TOTINBUF EQU   TOTWTOPL+88                                              02157000
TOTOTBUF EQU   TOTWTOPL+4                                               02158000
@NM00202 EQU   TOTWTOPL+2                                               02159000
TOTOTCNT EQU   TOTWTOPL+1                                               02160000
@NM00201 EQU   TOTWTOPL                                                 02161000
TOTINECB EQU   TOTWTORP+4                                               02162000
TOTINADR EQU   TOTWTORP+1                                               02163000
TOTINCNT EQU   TOTWTORP                                                 02164000
TOT#TBLE EQU   TOTOLTPL+8                                               02165000
@NM00200 EQU   TOTOLTPL                                                 02166000
TOTCMPCD EQU   TOTOLTCB+816                                             02167000
TOTTCBAD EQU   TOTOLTCB+812                                             02168000
TOTRESSV EQU   TOTOLTCB+808                                             02169000
TOTOTECB EQU   TOTOLTCB+804                                             02170000
TOTOLTMQ EQU   TOTOLTCB+800                                             02171000
TOTPARML EQU   TOTOLTCB+796                                             02172000
TOTPDECB EQU   TOTOLTCB+776                                             02173000
TOTAPDCB EQU   TOTOLTCB+772                                             02174000
@NM00199 EQU   TOTOLTCB+768                                             02175000
@NM00198 EQU   TOTAPDFL                                                 02176000
TOTAPIAC EQU   TOTAPDFL                                                 02177000
TOTAPHD  EQU   TOTAPDFL                                                 02178000
TOTAPLST EQU   TOTAPDFL                                                 02179000
TOTAPGP  EQU   TOTAPDFL                                                 02180000
@NM00197 EQU   TOTAPDFL                                                 02181000
TOTAPLIN EQU   TOTAPDFL                                                 02182000
TOTAPTER EQU   TOTAPDFL                                                 02183000
TOTAPRNL EQU   TOTAPENT+23                                              02184000
TOTAPEND EQU   TOTAPENT+23                                              02185000
TOTAPSWD EQU   TOTAPFLG                                                 02186000
@NM00196 EQU   TOTAPFLG                                                 02187000
TOTAPORN EQU   TOTAPFLG                                                 02188000
TOTAPASN EQU   TOTAPFLG                                                 02189000
TOTAPTLN EQU   TOTAPENT+20                                              02190000
TOTARTNT EQU   TOTAPENT+16                                              02191000
TOTAPTNT EQU   TOTAPENT+12                                              02192000
TOTAPLCB EQU   TOTAPENT+9                                               02193000
TOTAPRLN EQU   TOTAPENT+8                                               02194000
TOTARSID EQU   TOTAPENT+6                                               02195000
TOTAROFF EQU   TOTAPENT+4                                               02196000
TOTAPOFF EQU   TOTAPENT+2                                               02197000
TOTAPUCB EQU   TOTAPENT                                                 02198000
TOTUSCOR EQU   TOTOLTCB+732                                             02199000
TOTOPCLN EQU   TOTOLTCB+728                                             02200000
@NM00195 EQU   TOTOLTCB+690                                             02201000
TOTOALTT EQU   TOTOLTCB+688                                             02202000
TOTOLADR EQU   TOTPLIST+16                                              02203000
@NM00194 EQU   TOTOECBA+1                                               02204000
@NM00193 EQU   TOTOFLG                                                  02205000
TOTOATTC EQU   TOTOFLG                                                  02206000
TOTORTCD EQU   TOTPLIST+11                                              02207000
TOTORLN  EQU   TOTPLIST+10                                              02208000
TOTOELNG EQU   TOTPLIST+9                                               02209000
TOTOVBCD EQU   TOTPLIST+8                                               02210000
TOTOLINK EQU   TOTPLIST+5                                               02211000
TOTOPRI  EQU   TOTPLIST+4                                               02212000
TOTOQCBA EQU   TOTPLIST+1                                               02213000
TOTOKEY  EQU   TOTPLIST                                                 02214000
TOTWOOPC EQU   TOTOLTCB+640                                             02215000
TOTCURS4 EQU   TOTCUTST+11                                              02216000
TOTCURS3 EQU   TOTCUTST+10                                              02217000
TOTCURS2 EQU   TOTCUTST+9                                               02218000
TOTCURS1 EQU   TOTCUTST+8                                               02219000
TOTCUSAV EQU   TOTCUTST+4                                               02220000
TOTCUCUU EQU   TOTCUTST+2                                               02221000
TOTCU#AD EQU   TOTCUTST+1                                               02222000
@NM00192 EQU   TOTCUFLG                                                 02223000
TOTCUCUP EQU   TOTCUFLG                                                 02224000
TOTCUDON EQU   TOTCUFLG                                                 02225000
@NM00191 EQU   TOTOLTCB+625                                             02226000
@NM00190 EQU   TOTCTDFL                                                 02227000
TOTCTIAC EQU   TOTCTDFL                                                 02228000
TOTCTHD  EQU   TOTCTDFL                                                 02229000
TOTCTLST EQU   TOTCTDFL                                                 02230000
TOTCTGP  EQU   TOTCTDFL                                                 02231000
@NM00189 EQU   TOTCTDFL                                                 02232000
TOTCTLIN EQU   TOTCTDFL                                                 02233000
TOTCTTRM EQU   TOTCTDFL                                                 02234000
TOTCTNAM EQU   TOTCTENT+31                                              02235000
TOTCTRNL EQU   TOTCTENT+23                                              02236000
TOTCTEND EQU   TOTCTENT+23                                              02237000
TOTCTSWD EQU   TOTCTFLG                                                 02238000
@NM00188 EQU   TOTCTFLG                                                 02239000
TOTCTORN EQU   TOTCTFLG                                                 02240000
TOTCTASN EQU   TOTCTFLG                                                 02241000
TOTCTTLN EQU   TOTCTENT+20                                              02242000
TOTCRTNT EQU   TOTCTENT+16                                              02243000
TOTCTTNT EQU   TOTCTENT+12                                              02244000
TOTCTLCB EQU   TOTCTENT+9                                               02245000
TOTCTRLN EQU   TOTCTENT+8                                               02246000
TOTCRSID EQU   TOTCTENT+6                                               02247000
TOTCROFF EQU   TOTCTENT+4                                               02248000
TOTCTOFF EQU   TOTCTENT+2                                               02249000
TOTCTUCB EQU   TOTCTENT                                                 02250000
TOTSRLCB EQU   TOTSRENT+4                                               02251000
@NM00187 EQU   TOTSRENT+2                                               02252000
TOTSROFF EQU   TOTSRENT                                                 02253000
TOTMMSPC EQU   TOTOLTCB+572                                             02254000
TOTBKRQD EQU   TOTOLTCB+570                                             02255000
TOTBKASN EQU   TOTOLTCB+568                                             02256000
TOTSVEND EQU   TOTOLTCB+568                                             02257000
TOTWOSV4 EQU   TOTOLTCB+564                                             02258000
TOTWOSV3 EQU   TOTOLTCB+560                                             02259000
TOTWOSV2 EQU   TOTOLTCB+556                                             02260000
TOTWOSV1 EQU   TOTOLTCB+552                                             02261000
@NM00186 EQU   TOTSAVE5+68                                              02262000
TOTOLTEP EQU   TOTSAVE5+64                                              02263000
@NM00185 EQU   TOTSAVE5+48                                              02264000
TOTOLTPT EQU   TOTSAVE5+44                                              02265000
@NM00184 EQU   TOTSAVE5                                                 02266000
TOTSAVE4 EQU   TOTOLTCB+336                                             02267000
TOTSAVE3 EQU   TOTOLTCB+264                                             02268000
TOTSMGRT EQU   TOTOLTCB+116                                             02269000
@NM00183 EQU   $SCTTBLE+92                                              02270000
$EXT     EQU   $SCTTBLE+88                                              02271000
$PASS    EQU   $SCTTBLE+84                                              02272000
$TABLE   EQU   $SCTTBLE+80                                              02273000
$MSGIDAC EQU   $SCTTBLE+78                                              02274000
@NM00182 EQU   $SCTTBLE+72                                              02275000
@NM00181 EQU   $SCTTBLE+71                                              02276000
$R249255 EQU   $SCTTBLE+69                                              02277000
$R241248 EQU   $SCTTBLE+68                                              02278000
$R233240 EQU   $SCTTBLE+67                                              02279000
$R225232 EQU   $SCTTBLE+66                                              02280000
$R217224 EQU   $SCTTBLE+65                                              02281000
$R209216 EQU   $SCTTBLE+64                                              02282000
$R201208 EQU   $SCTTBLE+63                                              02283000
$R193200 EQU   $SCTTBLE+62                                              02284000
$R185192 EQU   $SCTTBLE+61                                              02285000
$R177184 EQU   $SCTTBLE+60                                              02286000
$R169176 EQU   $SCTTBLE+59                                              02287000
$R161168 EQU   $SCTTBLE+58                                              02288000
$R153160 EQU   $SCTTBLE+57                                              02289000
$R145152 EQU   $SCTTBLE+56                                              02290000
$R137144 EQU   $SCTTBLE+55                                              02291000
$R129136 EQU   $SCTTBLE+54                                              02292000
$R121128 EQU   $SCTTBLE+53                                              02293000
$R113120 EQU   $SCTTBLE+52                                              02294000
$R105112 EQU   $SCTTBLE+51                                              02295000
$R097104 EQU   $SCTTBLE+50                                              02296000
$R089096 EQU   $SCTTBLE+49                                              02297000
$R081088 EQU   $SCTTBLE+48                                              02298000
$R073080 EQU   $SCTTBLE+47                                              02299000
$R065072 EQU   $SCTTBLE+46                                              02300000
$R057064 EQU   $SCTTBLE+45                                              02301000
$R049056 EQU   $SCTTBLE+44                                              02302000
$R041048 EQU   $SCTTBLE+43                                              02303000
$R033040 EQU   $SCTTBLE+42                                              02304000
$R025032 EQU   $SCTTBLE+41                                              02305000
$R017024 EQU   $SCTTBLE+40                                              02306000
$TOTFLG2 EQU   $SCTTBLE+39                                              02307000
@NM00180 EQU   $TOTFLG1                                                 02308000
$TERMSEC EQU   $TOTFLG1                                                 02309000
$TDATBLK EQU   $TOTFLG1                                                 02310000
$LINESHR EQU   $TOTFLG1                                                 02311000
@NM00179 EQU   $SCTTBLE+37                                              02312000
@NM00178 EQU   $OLTFLGS                                                 02313000
$LASTSEC EQU   $OLTFLGS                                                 02314000
$RETCODE EQU   $OLTFLGS                                                 02315000
$CONTCB  EQU   $OLTFLGS                                                 02316000
$RETAIN  EQU   $OLTFLGS                                                 02317000
$CLEANRT EQU   $OLTFLGS                                                 02318000
$MANINTV EQU   $OLTFLGS                                                 02319000
$OLTSIZE EQU   $SCTTBLE+34                                              02320000
$QSCTMOD EQU   $EXECFLG                                                 02321000
$CTRLMOD EQU   $EXECFLG                                                 02322000
$CLEANUP EQU   $EXECFLG                                                 02323000
$LSTPDEV EQU   $EXECFLG                                                 02324000
$ERRCNT  EQU   $EXECFLG                                                 02325000
$RTNSLCT EQU   $EXECFLG                                                 02326000
$MULTDEV EQU   $EXECFLG                                                 02327000
$CECCMIN EQU   $EXECFLG                                                 02328000
$RMSKCNT EQU   $SCTTBLE+32                                              02329000
$CDS8T19 EQU   $SCTTBLE+20                                              02330000
$PDEVDSC EQU   $SCTTBLE+16                                              02331000
$PDEVADR EQU   $SCTTBLE+12                                              02332000
$COMMCN  EQU   $CDSFLGS                                                 02333000
$CUSTSYM EQU   $CDSFLGS                                                 02334000
$TWOCHSW EQU   $CDSFLGS                                                 02335000
$SYMNAME EQU   $CDSFLGS                                                 02336000
$EXTINTC EQU   $CDSFLGS                                                 02337000
$CEVOL   EQU   $CDSFLGS                                                 02338000
$SHARED  EQU   $CDSFLGS                                                 02339000
$FPM     EQU   $CDSFLGS                                                 02340000
$LASTSUB EQU   $PDEVFLG                                                 02341000
$PATHDEF EQU   $PDEVFLG                                                 02342000
$TERMNDX EQU   $PDEVFLG                                                 02343000
@NM00177 EQU   $PDEVFLG                                                 02344000
$LASTDEV EQU   $PDEVFLG                                                 02345000
$TSSSYS1 EQU   $PDEVFLG                                                 02346000
$EXFILPT EQU   $PDEVFLG                                                 02347000
$FPMOLD  EQU   $PDEVFLG                                                 02348000
$TSSSYM  EQU   $SCTTBLE+8                                               02349000
$SPARE1  EQU   $SCTTBLE+7                                               02350000
$DRIVER  EQU   $SCTTBLE+6                                               02351000
$RT0916  EQU   $SCTTBLE+5                                               02352000
$RT0108  EQU   $SCTTBLE+4                                               02353000
$LOOPTST EQU   $ERROPT                                                  02354000
$LOOPERR EQU   $ERROPT                                                  02355000
$NERRPRT EQU   $ERROPT                                                  02356000
$NOCNTRL EQU   $ERROPT                                                  02357000
$ALTPRNT EQU   $ERROPT                                                  02358000
$CATERR  EQU   $ERROPT                                                  02359000
$ASTERIK EQU   $ERROPT                                                  02360000
$TESTERR EQU   $ERROPT                                                  02361000
$FSTCOMM EQU   $TESTOPT                                                 02362000
$INDEFLP EQU   $TESTOPT                                                 02363000
$NOPRT   EQU   $TESTOPT                                                 02364000
@NM00176 EQU   $TESTOPT                                                 02365000
$ERRLPCT EQU   $SCTTBLE                                                 02366000
LCBERADR EQU   LCBXRADR+1                                               02367000
LCBPCIRC EQU   LCBXRADR                                                 02368000
LCBDCT3  EQU   LCBXDCT+2                                                02369000
LCBDCT2  EQU   LCBXDCT+1                                                02370000
LCBDCT1  EQU   LCBXDCT                                                  02371000
@NM00175 EQU   LCBXFLAG                                                 02372000
LCBERPND EQU   LCBXFLAG                                                 02373000
LCBSRCPF EQU   LCBXFLAG                                                 02374000
LCBGPCTV EQU   LCBXFLAG                                                 02375000
@NM00174 EQU   LCBXFLAG                                                 02376000
@NM00173 EQU   LCBXFLAG                                                 02377000
@NM00172 EQU   LCBXFLAG                                                 02378000
@NM00171 EQU   LCBXFLAG                                                 02379000
LCBCCW10 EQU   LCBCPA+72                                                02380000
LCBCCW9  EQU   LCBCPA+64                                                02381000
LCBCCW8  EQU   LCBCPA+56                                                02382000
LCBCCW7  EQU   LCBCPA+48                                                02383000
LCBCCW6  EQU   LCBCPA+40                                                02384000
LCBCP    EQU   LCBQEBPL+4                                               02385000
LCBIOSB  EQU   LCBQEBPL+1                                               02386000
LCBSIO   EQU   LCBQEBPL                                                 02387000
LCBCCW4  EQU   LCBCPA+24                                                02388000
LCBCCW3  EQU   LCBCPA+16                                                02389000
LCBCCW2  EQU   LCBCPA+8                                                 02390000
LCBCCW1  EQU   LCBCPA                                                   02391000
@NM00156 EQU   LCBERCCW+16                                              02392000
LCBATL05 EQU   LCBERCCW+8                                               02393000
@NM00155 EQU   LCBERCCW                                                 02394000
LCBCSWSV EQU   LCBSAVSN+1                                               02395000
LCBSNSV  EQU   LCBSAVSN                                                 02396000
LCBBFSNS EQU   LCBRSPSV                                                 02397000
LCBWAITC EQU   LCBTPCD+5                                                02398000
LCBINPAK EQU   LCBSTAT6                                                 02399000
LCBMHBID EQU   LCBSTAT6                                                 02400000
LCBRTRRO EQU   LCBSTAT6                                                 02401000
LCBHDRPD EQU   LCBSTAT6                                                 02402000
LCBCHN   EQU   LCBSTAT6                                                 02403000
LCBBFRSV EQU   LCBTPCD+1                                                02404000
@NM00154 EQU   LCBSTAT5                                                 02405000
LCBLUS   EQU   LCBSTAT5                                                 02406000
LCBLUNIT EQU   LCBSTAT5                                                 02407000
LCBPERM  EQU   LCBSTAT5                                                 02408000
LCBNXCMD EQU   LCBBFRW                                                  02409000
LCBERMSK EQU   LCBOBRCH                                                 02410000
LCBOLT   EQU   LCBMSGFM                                                 02411000
LCBEOT   EQU   LCBMSGFM                                                 02412000
LCBENQ   EQU   LCBMSGFM                                                 02413000
LCBTTD   EQU   LCBMSGFM                                                 02414000
LCBRSTRT EQU   LCBMSGFM                                                 02415000
LCBVSTRT EQU   LCBMSGFM                                                 02416000
LCBACKI  EQU   LCBMSGFM                                                 02417000
LCBNAK   EQU   LCBMSGFM                                                 02418000
LCBTTCIN EQU   IEDQLCB+90                                               02419000
@NM00153 EQU   LCBRBCT2                                                 02420000
LCBDCNT  EQU   LCBRBCT2                                                 02421000
LCBRBCT1 EQU   LCBERBCT                                                 02422000
LCBERBCH EQU   IEDQLCB+85                                               02423000
LCBCOMPL EQU   LCBDLNKN                                                 02424000
LCBPRCPG EQU   LCBERBST                                                 02425000
LCBERROR EQU   LCBERBST                                                 02426000
LCBLOGDV EQU   LCBERBST                                                 02427000
LCBINQ   EQU   LCBERBST                                                 02428000
LCBRDERR EQU   LCBERBST                                                 02429000
LCBEOMSG EQU   LCBERBST                                                 02430000
LCBMSG   EQU   LCBERBST                                                 02431000
LCBERBLK EQU   IEDQLCB+81                                               02432000
LCBERBPY EQU   IEDQLCB+80                                               02433000
LCBERBQB EQU   LCBERB+1                                                 02434000
LCBERBKY EQU   LCBERB                                                   02435000
LCBRECAD EQU   IEDQLCB+73                                               02436000
@NM00152 EQU   LCBTSTSW                                                 02437000
@NM00151 EQU   LCBTSTSW                                                 02438000
@NM00150 EQU   LCBTSTSW                                                 02439000
@NM00149 EQU   LCBTSTSW                                                 02440000
@NM00148 EQU   LCBTSTSW                                                 02441000
@NM00147 EQU   LCBTSTSW                                                 02442000
@NM00146 EQU   LCBTSTSW                                                 02443000
LCBCONCT EQU   LCBTSTSW                                                 02444000
LCBRESP  EQU   LCBSTAT2                                                 02445000
LCBBFRAV EQU   LCBDIAL                                                  02446000
LCBATTN  EQU   LCBSYNC                                                  02447000
LCBNEGRP EQU   LCBSTAT2                                                 02448000
LCBSNDPR EQU   LCBSTAT2                                                 02449000
LCBCONNN EQU   LCBBEOTN                                                 02450000
LCBMSGNN EQU   LCBSTAT2                                                 02451000
LCBTRACE EQU   LCBSTAT2                                                 02452000
LCBSENDN EQU   LCBSTAT1                                                 02453000
LCBRECVN EQU   LCBSTAT1                                                 02454000
LCBFREEN EQU   LCBSTAT1                                                 02455000
LCBCONT  EQU   LCBSTAT1                                                 02456000
LCBINITN EQU   LCBSTAT1                                                 02457000
LCBOCNI  EQU   LCBSTAT1                                                 02458000
LCBOCWTN EQU   LCBSTAT1                                                 02459000
LCBRCLLN EQU   LCBSTAT1                                                 02460000
LCBRECOF EQU   IEDQLCB+68                                               02461000
LCBRDBFR EQU   LCBRCBFR                                                 02462000
LCBUCBX  EQU   IEDQLCB+64                                               02463000
LCBTTBIN EQU   LCBERRCT                                                 02464000
@NM00145 EQU   LCBINCAM                                                 02465000
LCBGETMN EQU   LCBINCAM                                                 02466000
@NM00144 EQU   LCBRESTR+1                                               02467000
LCBCMDSV EQU   LCBRESTR                                                 02468000
LCBPCILK EQU   LCBDCBPT                                                 02469000
LCBSTART EQU   LCBIOBSN+16                                              02470000
LCBAP4OL EQU   LCBSIOCC                                                 02471000
LCBAP3OL EQU   LCBSIOCC                                                 02472000
LCBAP2OL EQU   LCBSIOCC                                                 02473000
LCBAP1OL EQU   LCBSIOCC                                                 02474000
LCBSIOC2 EQU   LCBSIOCC                                                 02475000
LCBSIOC1 EQU   LCBSIOCC                                                 02476000
@NM00143 EQU   LCBSIOCC                                                 02477000
LCBCSWRC EQU   LCBCSW+5                                                 02478000
LCBCSCHC EQU   LCBCSWCS                                                 02479000
LCBCSICC EQU   LCBCSWCS                                                 02480000
LCBCSCCC EQU   LCBCSWCS                                                 02481000
LCBCSCDC EQU   LCBCSWCS                                                 02482000
LCBCSPTC EQU   LCBCSWCS                                                 02483000
LCBCSPGC EQU   LCBCSWCS                                                 02484000
LCBCSIL  EQU   LCBCSWCS                                                 02485000
LCBCSPCI EQU   LCBCSWCS                                                 02486000
LCBUSUE  EQU   LCBCSWUS                                                 02487000
LCBUSUC  EQU   LCBCSWUS                                                 02488000
LCBUSDE  EQU   LCBCSWUS                                                 02489000
LCBUSCE  EQU   LCBCSWUS                                                 02490000
LCBUSBSY EQU   LCBCSWUS                                                 02491000
LCBUSCUE EQU   LCBCSWUS                                                 02492000
LCBUSSM  EQU   LCBCSWUS                                                 02493000
LCBUSAT  EQU   LCBCSWUS                                                 02494000
LCBCSWCA EQU   LCBCSW                                                   02495000
LCBOBR   EQU   LCBFLAG3                                                 02496000
LCBOBRRD EQU   LCBFLAG3                                                 02497000
LCBIOMSG EQU   LCBFLAG3                                                 02498000
LCBSOHC  EQU   LCBFLAG3                                                 02499000
LCBRLAD  EQU   LCBFLAG3                                                 02500000
LCBSOHR  EQU   LCBFLAG3                                                 02501000
@NM00142 EQU   LCBFLAG3                                                 02502000
LCBECBPT EQU   LCBIOBSN+4                                               02503000
LCBECBCC EQU   LCBIOBSN+3                                               02504000
LCBSENS1 EQU   LCBSNS+1                                                 02505000
LCBABORT EQU   LCBTMOUT                                                 02506000
LCBNOTIN EQU   LCBLOSDT                                                 02507000
LCBOVRUN EQU   LCBSENS0                                                 02508000
LCBDATCK EQU   LCBSENS0                                                 02509000
LCBEQUCK EQU   LCBSENS0                                                 02510000
LCBBUSCK EQU   LCBSENS0                                                 02511000
LCBINTRQ EQU   LCBSENS0                                                 02512000
LCBCMDRJ EQU   LCBSENS0                                                 02513000
LCBFLAG2 EQU   LCBIOBSN                                                 02514000
@NM00141 EQU   LCBFLAG1                                                 02515000
LCBUNREL EQU   LCBFLAG1                                                 02516000
LCBEXCPN EQU   LCBFLAG1                                                 02517000
@NM00140 EQU   LCBFLAG1                                                 02518000
LCBERPIN EQU   LCBFLAG1                                                 02519000
@NM00139 EQU   LCBFLAG1                                                 02520000
LCBFSBFR EQU   LCBMHA                                                   02521000
LCBISZE  EQU   IEDQLCB+28                                               02522000
LCBLNENT EQU   LCBSCBDA+1                                               02523000
@NM00138 EQU   LCBSCBDA                                                 02524000
LCBCPGMH EQU   LCBSTAT4                                                 02525000
LCBREAL  EQU   LCBPHASE                                                 02526000
@NM00137 EQU   LCBSTAT4                                                 02527000
LCBACTRQ EQU   LCBSTAT4                                                 02528000
LCBIPLRQ EQU   LCBSTAT4                                                 02529000
LCBDACRQ EQU   LCBSTAT4                                                 02530000
LCBDMPRQ EQU   LCBSTAT4                                                 02531000
@NM00136 EQU   LCBLKMDE                                                 02532000
LCBLOCKI EQU   LCBLKMDE                                                 02533000
LCBLOCKR EQU   LCBLKMDE                                                 02534000
LCBHMFLG EQU   LCBLKMDE                                                 02535000
LCBBDFLG EQU   LCBLKMDE                                                 02536000
@NM00135 EQU   LCBINSRC                                                 02537000
LCBABRTN EQU   LCBCHAIN                                                 02538000
LCBCTLMD EQU   LCBTETEN                                                 02539000
LCBBFRSZ EQU   LCBCHAIN                                                 02540000
LCBUREQN EQU   LCBCHAIN                                                 02541000
LCBNORTY EQU   LCBCHAIN                                                 02542000
LCBERMSG EQU   LCBCHAIN                                                 02543000
LCBEXCP  EQU   LCBCHAIN                                                 02544000
LCBINVRQ EQU   LCBSCRNN                                                 02545000
LCB2741N EQU   LCBTSOB                                                  02546000
LCBINHBN EQU   LCBTSOB                                                  02547000
LCBCIRCD EQU   LCBTSOB                                                  02548000
LCBPREP  EQU   LCBTSOB                                                  02549000
LCBSOPL  EQU   LCBTSOB                                                  02550000
LCBSATRD EQU   LCBTSOB                                                  02551000
LCBTSBUF EQU   LCBTSOB                                                  02552000
LCBWRBRK EQU   LCBTSOB                                                  02553000
LCBTDL   EQU   IEDQLCB+18                                               02554000
LCBEOLTD EQU   IEDQLCB+16                                               02555000
LCBRSLNK EQU   IEDQLCB+13                                               02556000
LCBRSPRI EQU   IEDQLCB+12                                               02557000
LCBSTCBA EQU   IEDQLCB+9                                                02558000
LCBRSKEY EQU   IEDQLCB+8                                                02559000
LCBLINK  EQU   LCBRCB+5                                                 02560000
LCBPRI   EQU   LCBRCB+4                                                 02561000
LCBQCBA  EQU   LCBRCB+1                                                 02562000
LCBKEY   EQU   LCBRCB                                                   02563000
@NM00134 EQU   DCB+70                                                   02564000
DCBXENDA EQU   DCB+68                                                   02565000
DCBCENDA EQU   DCB+66                                                   02566000
DCBSIOA  EQU   DCB+64                                                   02567000
DCBPCIA  EQU   DCB+62                                                   02568000
DCBEOEA  EQU   DCB+60                                                   02569000
@NM00133 EQU   DCB+53                                                   02570000
DCBOPTCD EQU   DCB+52                                                   02571000
@NM00132 EQU   DCB+49                                                   02572000
DCBOFLGS EQU   DCB+48                                                   02573000
DCBDEBAD EQU   OLTDEBA+1                                                02574000
DCBIFLGS EQU   OLTDEBA                                                  02575000
DCBMACFR EQU   DCB+42                                                   02576000
DCBTIOT  EQU   DCB+40                                                   02577000
DCBEXLST EQU   DCB+37                                                   02578000
DCBRECFM EQU   DCB+36                                                   02579000
DCBEODAD EQU   DCB+33                                                   02580000
DCBBGFEK EQU   DCB+32                                                   02581000
DCBIOBAD EQU   DCB+28                                                   02582000
DCBDSORG EQU   DCB+26                                                   02583000
DCBBUFL  EQU   DCB+24                                                   02584000
DCBBUFCB EQU   DCB+21                                                   02585000
DCBBUFNO EQU   DCB+20                                                   02586000
DCBDCDEP EQU   DCB                                                      02587000
IOBCSWS  EQU   IOB+37                                                   02588000
@NM00131 EQU   IOBFLG4                                                  02589000
IOBCSWNV EQU   IOBFLG4                                                  02590000
IOBATNE  EQU   IOBFLG4                                                  02591000
IOBPRI   EQU   IOBFLG4                                                  02592000
IOBSEC   EQU   IOBFLG4                                                  02593000
IOBCSWV  EQU   IOBFLG4                                                  02594000
IOBATTN  EQU   IOBFLG4                                                  02595000
IOBWORK  EQU   IOB+33                                                   02596000
IOBUCBX  EQU   IOB+32                                                   02597000
IOBERRCT EQU   IOB+30                                                   02598000
IOBINCR  EQU   IOB+28                                                   02599000
IOBRSTAD EQU   IOB+25                                                   02600000
IOBREPM  EQU   IOB+24                                                   02601000
IOBDCBAD EQU   IOB+20                                                   02602000
@NM00130 EQU   IOBCCWAD+1                                               02603000
IOBSIOCD EQU   IOBCCWAD                                                 02604000
IOBCSW1  EQU   IOBCSW+1                                                 02605000
IOBFLG3  EQU   IOBCSW                                                   02606000
@NM00129 EQU   IOBECBAD+1                                               02607000
IOBECBCD EQU   IOBECBAD                                                 02608000
IOBSNS   EQU   IOB+2                                                    02609000
IOBFLG2  EQU   IOB+1                                                    02610000
IOBFLG1  EQU   IOB                                                      02611000
TECBADDR EQU   IOBLOCKS+52                                              02612000
OLTSEQ   EQU   OLTSN+2                                                  02613000
@NM00128 EQU   OLTSN                                                    02614000
@NM00127 EQU   IOBLOCKS+47                                              02615000
@NM00126 EQU   OLTFLAG2                                                 02616000
OLTSIOAC EQU   OLTFLAG2                                                 02617000
OLTLV3IO EQU   OLTFLAG2                                                 02618000
OLTMVDAT EQU   OLTFLAG2                                                 02619000
OLTPTIMD EQU   OLTFLAG2                                                 02620000
OLTDTCNT EQU   IOBLOCKS+44                                              02621000
OLTDTBUF EQU   IOBLOCKS+40                                              02622000
OLTBUFA  EQU   IOBLOCKS+36                                              02623000
OLTCCWA  EQU   IOBLOCKS+32                                              02624000
OLTQCBA  EQU   IOBLOCKS+28                                              02625000
@NM00125 EQU   IOBLOCKS+27                                              02626000
@NM00124 EQU   OLTFLAG1                                                 02627000
OLTUNRD  EQU   OLTFLAG1                                                 02628000
@NM00123 EQU   OLTFLAG1                                                 02629000
OLTTNTAS EQU   OLTFLAG1                                                 02630000
OLTTDLN  EQU   IOBLOCKS+24                                              02631000
OLTRLTNT EQU   IOBLOCKS+20                                              02632000
OLTTCTNT EQU   IOBLOCKS+16                                              02633000
OLTLCBA  EQU   IOBLOCKS+13                                              02634000
OLTTCRLN EQU   IOBLOCKS+12                                              02635000
OLTTRSID EQU   IOBLOCKS+10                                              02636000
OLTTNOFF EQU   IOBLOCKS+8                                               02637000
OLTUCBA  EQU   IOBLOCKS+4                                               02638000
ECBOLT   EQU   IOBLOCKS                                                 02639000
@NM00122 EQU   DCTBYTE5                                                 02640000
DCTL3270 EQU   DCTBYTE5                                                 02641000
DCTSCS   EQU   DCTBYTE5                                                 02642000
DCTTSPRF EQU   DCTBYTE4                                                 02643000
DCTFMPRF EQU   DCTBYTE4                                                 02644000
DCT2760  EQU   DCTBYTE3                                                 02645000
DCTNOIDL EQU   DCTBYTE3                                                 02646000
DCTCONTN EQU   DCTBYTE3                                                 02647000
DCTBUFF  EQU   DCTBYTE3                                                 02648000
DCTCHECK EQU   DCTBYTE3                                                 02649000
DCTENCTL EQU   DCTBYTE3                                                 02650000
DCTWTTA  EQU   DCTBYTE3                                                 02651000
DCT1050  EQU   DCTBYTE3                                                 02652000
DCTAUDIO EQU   DCTBYTE2                                                 02653000
DCTLOCAL EQU   DCTBYTE2                                                 02654000
DCTCONT  EQU   DCTBYTE2                                                 02655000
DCTXMIT  EQU   DCTBYTE2                                                 02656000
DCTSTCTL EQU   DCTBYTE2                                                 02657000
DCTTWX   EQU   DCTBYTE2                                                 02658000
DCTBRDST EQU   DCTBYTE2                                                 02659000
DCTBISYN EQU   DCTBYTE2                                                 02660000
DCTUMASK EQU   DCTBYTE1                                                 02661000
DCTSADEV EQU   DCTBYTE1                                                 02662000
DCT3270  EQU   DCTBYTE1                                                 02663000
DCT2741  EQU   DCTBYTE1                                                 02664000
DCT5041  EQU   DCTBYTE1                                                 02665000
DCTATTEN EQU   DCTBYTE1                                                 02666000
DCTBREAK EQU   DCTBYTE1                                                 02667000
DCTINHIB EQU   DCTBYTE1                                                 02668000
DCTBYTE0 EQU   IEDDCT                                                   02669000
BNDUSD   EQU   IEDBNDD+37                                               02670000
BNDUDFL  EQU   IEDBNDD+36                                               02671000
BNDPLUN  EQU   IEDBNDD+28                                               02672000
BNDPLUNL EQU   IEDBNDD+27                                               02673000
BNDCRYP  EQU   IEDBNDD+26                                               02674000
@NM00121 EQU   IEDBNDD+25                                               02675000
BNDSCSZE EQU   BNDPSCH+9                                                02676000
@NM00120 EQU   BNDPSCH                                                  02677000
BNDLUTYP EQU   BNDLUPFL                                                 02678000
BNDPSF   EQU   BNDLUPFL                                                 02679000
@NM00119 EQU   IEDBNDD+13                                               02680000
BNDPSPC  EQU   IEDBNDD+12                                               02681000
@NM00118 EQU   BNDPMSRU                                                 02682000
BNDNMAXP EQU   BNDPMSRU                                                 02683000
@NM00117 EQU   BNDSMSRU                                                 02684000
BNDNMAX  EQU   BNDSMSRU                                                 02685000
BNDSRPC  EQU   IEDBNDD+9                                                02686000
BNDSSPC  EQU   IEDBNDD+8                                                02687000
BNDCRES  EQU   BNDCOMM2                                                 02688000
@NM00116 EQU   BNDCOMM2                                                 02689000
@NM00115 EQU   BNDCOMM2                                                 02690000
@NM00114 EQU   BNDCOMM2                                                 02691000
BNDSPKR  EQU   BNDCOMM2                                                 02692000
BNDRECOV EQU   BNDCOMM2                                                 02693000
BNDFMODE EQU   BNDCOMM2                                                 02694000
@NM00113 EQU   BNDCOMM1                                                 02695000
@NM00112 EQU   BNDCOMM1                                                 02696000
@NM00111 EQU   BNDCOMM1                                                 02697000
BNDALT   EQU   BNDCOMM1                                                 02698000
BNDBTERM EQU   BNDCOMM1                                                 02699000
BNDBRACK EQU   BNDCOMM1                                                 02700000
BNDFMUSE EQU   BNDCOMM1                                                 02701000
@NM00110 EQU   BNDCOMM1                                                 02702000
BNDSEBI  EQU   BNDSECD                                                  02703000
BNDSCMP  EQU   BNDSECD                                                  02704000
@NM00109 EQU   BNDSECD                                                  02705000
@NM00108 EQU   BNDSECD                                                  02706000
BNDSEXC  EQU   BNDSECD                                                  02707000
BNDSDEF  EQU   BNDSECD                                                  02708000
BNDSRQM  EQU   BNDSECD                                                  02709000
BNDSCHN  EQU   BNDSECD                                                  02710000
BNDPEBI  EQU   BNDPRIM                                                  02711000
BNDPCMP  EQU   BNDPRIM                                                  02712000
@NM00107 EQU   BNDPRIM                                                  02713000
@NM00106 EQU   BNDPRIM                                                  02714000
BNDPEXC  EQU   BNDPRIM                                                  02715000
BNDPDEF  EQU   BNDPRIM                                                  02716000
BNDPRQM  EQU   BNDPRIM                                                  02717000
BNDPCHN  EQU   BNDPRIM                                                  02718000
BNDTSPRF EQU   IEDBNDD+3                                                02719000
BNDFMPRF EQU   IEDBNDD+2                                                02720000
BNDFORMT EQU   IEDBNDD+1                                                02721000
BNDRUCDE EQU   IEDBNDD                                                  02722000
BINLDAT  EQU   BINBLD+1                                                 02723000
BINLDATL EQU   BINBLD                                                   02724000
BINUDAT  EQU   BINBUD+1                                                 02725000
BINUDATL EQU   BINBUD                                                   02726000
BINIMAGE EQU   IEDBIN+10                                                02727000
BINLEN   EQU   IEDBIN+8                                                 02728000
BINNAME  EQU   IEDBIN                                                   02729000
SAVTLLCB EQU   IEDNSVTD+316                                             02730000
SAVTBITN EQU   IEDNSVTD+312                                             02731000
@NM00105 EQU   SAVTCKQB+8                                               02732000
@NM00104 EQU   SAVTCKEC+1                                               02733000
@NM00103 EQU   SAVTCKCC                                                 02734000
SAVTCKPO EQU   SAVTCKCC                                                 02735000
SAVTCKWA EQU   SAVTCKCC                                                 02736000
SAVTCKCH EQU   SAVTCKTB+1                                               02737000
SAVTCKVT EQU   SAVTCKTB                                                 02738000
@NM00102 EQU   IEDNSVTD+297                                             02739000
SAVTRDFG EQU   SAVTRDRV+12                                              02740000
@NM00101 EQU   SAVTRDRV+5                                               02741000
SAVTRDPY EQU   SAVTRDRV+4                                               02742000
SAVTRDQB EQU   SAVTRDRV+1                                               02743000
SAVTRDKY EQU   SAVTRDRV                                                 02744000
SAVTNID  EQU   IEDNSVTD+280                                             02745000
SAVTDVAS EQU   IEDNSVTD+276                                             02746000
SAVTPLSZ EQU   IEDNSVTD+274                                             02747000
@NM00100 EQU   IEDNSVTD+273                                             02748000
SAVTSUBL EQU   IEDNSVTD+272                                             02749000
@NM00099 EQU   SAVTZELM+1                                               02750000
SAVTSUBM EQU   SAVTZELM                                                 02751000
SAVTMHDX EQU   IEDNSVTD+268                                             02752000
SAVTNAT1 EQU   IEDNSVTD+266                                             02753000
SAVTSH20 EQU   IEDNSVTD+264                                             02754000
SAVTLCBS EQU   IEDNSVTD+260                                             02755000
SAVTRNMP EQU   IEDNSVTD+256                                             02756000
SAVTTNTX EQU   IEDNSVTD+252                                             02757000
SAVTNAX  EQU   IEDNSVTD+248                                             02758000
SAVTSUBV EQU   IEDNSVTD+247                                             02759000
SAVTSUBA EQU   IEDNSVTD+246                                             02760000
SAVTSIBC EQU   IEDNSVTD+244                                             02761000
SAVTBSM  EQU   IEDNSVTD+240                                             02762000
SAVTSCPT EQU   SAVTTCPU                                                 02763000
SAVTRQTG EQU   IEDNSVTD+236                                             02764000
SAVTRQCH EQU   IEDNSVTD+232                                             02765000
SAVTMAND EQU   IEDNSVTD+228                                             02766000
SAVTSPLN EQU   IEDNSVTD+224                                             02767000
SAVTNADL EQU   IEDNSVTD+222                                             02768000
SAVTNATL EQU   IEDNSVTD+220                                             02769000
SAVTMHTB EQU   IEDNSVTD+216                                             02770000
SAVTSSMH EQU   IEDNSVTD+212                                             02771000
SAVTQRS  EQU   IEDNSVTD+208                                             02772000
SAVTRQIN EQU   IEDNSVTD+204                                             02773000
SAVTSAO  EQU   IEDNSVTD+196                                             02774000
SAVTSARI EQU   IEDNSVTD+192                                             02775000
SAVTSAC  EQU   IEDNSVTD+188                                             02776000
SAVTSAI  EQU   IEDNSVTD+184                                             02777000
SAVTCSCI EQU   IEDNSVTD+180                                             02778000
SAVTSSRP EQU   IEDNSVTD+176                                             02779000
SAVTSSRQ EQU   IEDNSVTD+172                                             02780000
SAVTSCLU EQU   IEDNSVTD+168                                             02781000
SAVTXTRQ EQU   IEDNSVTD+164                                             02782000
@NM00098 EQU   IEDNSVTD+148                                             02783000
SAVTIPCQ EQU   IEDNSVTD+144                                             02784000
@NM00097 EQU   IEDNSVTD+136                                             02785000
SAVTXFMI EQU   IEDNSVTD+132                                             02786000
@NM00096 EQU   IEDNSVTD+124                                             02787000
SAVTXFMO EQU   IEDNSVTD+120                                             02788000
@NM00095 EQU   IEDNSVTD+116                                             02789000
SAVTSSSR EQU   IEDNSVTD+112                                             02790000
SAVTSCPQ EQU   IEDNSVTD+108                                             02791000
SAVTSLCB EQU   IEDNSVTD+104                                             02792000
SAVTLUSR EQU   IEDNSVTD+100                                             02793000
@NM00094 EQU   SAVTLUSQ+8                                               02794000
SAVTLUSP EQU   SAVTLUSQ+4                                               02795000
SAVTLUSB EQU   SAVTLUSQ                                                 02796000
@NM00093 EQU   IEDNSVTD+84                                              02797000
SAVTSAT  EQU   IEDNSVTD+80                                              02798000
SAVTNAT  EQU   IEDNSVTD+76                                              02799000
SAVTCLUP EQU   IEDNSVTD+72                                              02800000
SAVTPIUT EQU   IEDNSVTD+68                                              02801000
SAVTRNTA EQU   IEDNSVTD+64                                              02802000
SAVTDNIR EQU   IEDNSVTD+60                                              02803000
SAVTCNIR EQU   IEDNSVTD+56                                              02804000
SAVTFLDH EQU   IEDNSVTD+52                                              02805000
SAVTSRTN EQU   IEDNSVTD+48                                              02806000
SAVTSREQ EQU   IEDNSVTD+44                                              02807000
SAVTFAIL EQU   IEDNSVTD+42                                              02808000
SAVTSUSE EQU   IEDNSVTD+40                                              02809000
SAVTSIB  EQU   IEDNSVTD+36                                              02810000
SAVTPRTN EQU   IEDNSVTD+32                                              02811000
@NM00092 EQU   IEDNSVTD+28                                              02812000
SAVTWH20 EQU   IEDNSVTD+26                                              02813000
SAVTPWT  EQU   IEDNSVTD+24                                              02814000
SAVTPRTQ EQU   IEDNSVTD+20                                              02815000
SAVTPREQ EQU   IEDNSVTD+16                                              02816000
SAVTPH20 EQU   IEDNSVTD+14                                              02817000
SAVTPUSE EQU   IEDNSVTD+12                                              02818000
SAVTPLCB EQU   IEDNSVTD+8                                               02819000
SAVTPOOL EQU   IEDNSVTD+4                                               02820000
SAVTPRMT EQU   SAVTDIAF                                                 02821000
SAVTVIRT EQU   SAVTDIAF                                                 02822000
AVTCPBNO EQU   IEDQAVTD+1244                                            02823000
AVTHRESS EQU   IEDQAVTD+1243                                            02824000
@NM00091 EQU   IEDQAVTD+1242                                            02825000
@NM00090 EQU   IEDQAVTD+1241                                            02826000
@NM00089 EQU   IEDQAVTD+1240                                            02827000
@NM00088 EQU   IEDQAVTD+1237                                            02828000
@NM00087 EQU   IEDQAVTD+1236                                            02829000
AVTHRESE EQU   @NM00086                                                 02830000
AVTRADDR EQU   IEDQAVTD+1228                                            02831000
AVTNADDR EQU   IEDQAVTD+1224                                            02832000
AVTHRESN EQU   IEDQAVTD+1220                                            02833000
AVTVOLRN EQU   IEDQAVTD+1216                                            02834000
AVTTOTNN EQU   IEDQAVTD+1212                                            02835000
AVTTRCYN EQU   IEDQAVTD+1208                                            02836000
AVTRCTRN EQU   IEDQAVTD+1204                                            02837000
AVTNOVON EQU   IEDQAVTD+1200                                            02838000
AVTADEBN EQU   IEDQAVTD+1196                                            02839000
AVTVOLRR EQU   IEDQAVTD+1192                                            02840000
AVTTOTNR EQU   IEDQAVTD+1188                                            02841000
AVTTRCYR EQU   IEDQAVTD+1184                                            02842000
AVTRCTRR EQU   IEDQAVTD+1180                                            02843000
AVTNOVOR EQU   IEDQAVTD+1176                                            02844000
AVTADEBR EQU   IEDQAVTD+1172                                            02845000
AVTLODPT EQU   IEDQAVTD+1168                                            02846000
AVTIOBN  EQU   IEDQAVTD+1164                                            02847000
AVTIOBR  EQU   IEDQAVTD+1160                                            02848000
AVTCPBPT EQU   IEDQAVTD+1156                                            02849000
AVTFCPB  EQU   IEDQAVTD+1152                                            02850000
@NM00085 EQU   IEDQAVTD+1148                                            02851000
AVTINCPQ EQU   IEDQAVTD+1144                                            02852000
@NM00084 EQU   IEDQAVTD+1140                                            02853000
@NM00083 EQU   IEDQAVTD+1137                                            02854000
@NM00082 EQU   AVTBIT4                                                  02855000
@NM00081 EQU   AVTBIT4                                                  02856000
@NM00080 EQU   AVTBIT4                                                  02857000
@NM00079 EQU   AVTBIT4                                                  02858000
@NM00078 EQU   AVTBIT4                                                  02859000
@NM00077 EQU   AVTBIT4                                                  02860000
@NM00076 EQU   AVTBIT4                                                  02861000
AVTRUFTN EQU   AVTBIT4                                                  02862000
@NM00075 EQU   IEDQAVTD+1132                                            02863000
AVTNOBFQ EQU   IEDQAVTD+1128                                            02864000
@NM00074 EQU   IEDQAVTD+1124                                            02865000
AVTDKENQ EQU   IEDQAVTD+1120                                            02866000
@NM00073 EQU   IEDQAVTD+1116                                            02867000
AVTDKAPQ EQU   IEDQAVTD+1112                                            02868000
AVTCOPY  EQU   IEDQAVTD+1108                                            02869000
AVTIA    EQU   IEDQAVTD+1104                                            02870000
AVTFL    EQU   IEDQAVTD+1100                                            02871000
@NM00072 EQU   IEDQAVTD+1096                                            02872000
AVTNCPBQ EQU   IEDQAVTD+1092                                            02873000
AVTTOTNC EQU   IEDQAVTD+1088                                            02874000
AVTCMAX  EQU   IEDQAVTD+1084                                            02875000
AVTCMIN  EQU   IEDQAVTD+1080                                            02876000
AVTHM02  EQU   IEDQAVTD+1076                                            02877000
AVTOPCIN EQU   IEDQAVTD+1074                                            02878000
AVTOPMSK EQU   IEDQAVTD+1068                                            02879000
AVTDDFT  EQU   IEDQAVTD+1064                                            02880000
AVTSTEAL EQU   IEDQAVTD+1060                                            02881000
AVTOPTN  EQU   IEDQAVTD+1056                                            02882000
AVTDSKCT EQU   IEDQAVTD+1054                                            02883000
AVTCKRST EQU   IEDQAVTD+1053                                            02884000
AVTSTAN  EQU   AVTBIT3                                                  02885000
AVTSTACN EQU   AVTBIT3                                                  02886000
AVTSTAIN EQU   AVTBIT3                                                  02887000
AVTSTAYN EQU   AVTBIT3                                                  02888000
AVTOLTBN EQU   AVTBIT3                                                  02889000
AVTTSAB  EQU   AVTBIT3                                                  02890000
AVTRFULN EQU   AVTBIT3                                                  02891000
AVTRECVN EQU   AVTBIT3                                                  02892000
@NM00071 EQU   AVTBIT2                                                  02893000
@NM00070 EQU   AVTBIT2                                                  02894000
AVTOPEIN EQU   AVTBIT2                                                  02895000
AVTSTRTN EQU   AVTBIT2                                                  02896000
AVTTOPOL EQU   AVTBIT2                                                  02897000
AVTCOPYN EQU   AVTBIT2                                                  02898000
AVTREUSN EQU   AVTBIT2                                                  02899000
AVTEXTSC EQU   AVTBIT2                                                  02900000
AVTDISKN EQU   AVTBIT1                                                  02901000
AVTQUCKN EQU   AVTBIT1                                                  02902000
AVTCLOSN EQU   AVTBIT1                                                  02903000
AVTREADN EQU   AVTBIT1                                                  02904000
AVTDLAYN EQU   AVTBIT1                                                  02905000
AVTAQTAN EQU   AVTBIT1                                                  02906000
AVTTSON  EQU   AVTBIT1                                                  02907000
AVTAPLKN EQU   AVTBIT1                                                  02908000
AVTDUMBR EQU   IEDQAVTD+1048                                            02909000
AVTDLQX  EQU   IEDQAVTD+1046                                            02910000
AVTINTLV EQU   IEDQAVTD+1044                                            02911000
AVTSMCNT EQU   IEDQAVTD+1042                                            02912000
AVTAVFCT EQU   IEDQAVTD+1040                                            02913000
AVTOPCON EQU   IEDQAVTD+1038                                            02914000
AVTOPCNT EQU   IEDQAVTD+1036                                            02915000
AVTLNCNT EQU   IEDQAVTD+1034                                            02916000
AVTHA16  EQU   IEDQAVTD+1030                                            02917000
AVTHA7   EQU   IEDQAVTD+1028                                            02918000
AVTHA4   EQU   IEDQAVTD+1026                                            02919000
AVTHA3   EQU   IEDQAVTD+1024                                            02920000
AVTHA2   EQU   IEDQAVTD+1022                                            02921000
AVTGETMS EQU   IEDQAVTD+1021                                            02922000
@NM00069 EQU   IEDQAVTD+1020                                            02923000
AVTGETMD EQU   IEDQAVTD+1016                                            02924000
AVTGETMN EQU   IEDQAVTD+1012                                            02925000
AVTCWTOT EQU   IEDQAVTD+1008                                            02926000
AVTCWINT EQU   IEDQAVTD+956                                             02927000
AVTDTRAP EQU   IEDQAVTD+952                                             02928000
@NM00068 EQU   IEDQAVTD+950                                             02929000
@NM00067 EQU   AVTIOTR                                                  02930000
AVTIOTRH EQU   AVTIOTR                                                  02931000
AVTIOTRE EQU   AVTIOTR                                                  02932000
@NM00066 EQU   AVTSUBT                                                  02933000
AVTSUBPT EQU   AVTSUBT                                                  02934000
AVTSUBON EQU   AVTSUBT                                                  02935000
AVTAFE30 EQU   IEDQAVTD+944                                             02936000
AVTAFE20 EQU   IEDQAVTD+940                                             02937000
AVTAFE10 EQU   IEDQAVTD+936                                             02938000
AVTCWEC2 EQU   IEDQAVTD+932                                             02939000
AVTCWPM2 EQU   IEDQAVTD+928                                             02940000
AVTCWTS2 EQU   IEDQAVTD+927                                             02941000
AVTCWTS1 EQU   IEDQAVTD+926                                             02942000
AVTCWCLD EQU   AVTCWFL2                                                 02943000
AVTCWRAP EQU   AVTCWFL2                                                 02944000
@NM00065 EQU   AVTCWFL2                                                 02945000
@NM00064 EQU   AVTCWFL2                                                 02946000
@NM00063 EQU   AVTCWFL2                                                 02947000
@NM00062 EQU   AVTCWFL2                                                 02948000
@NM00061 EQU   AVTCWFL2                                                 02949000
AVTCWACT EQU   AVTCWFL2                                                 02950000
@NM00060 EQU   AVTCWFL1                                                 02951000
@NM00059 EQU   AVTCWFL1                                                 02952000
@NM00058 EQU   AVTCWFL1                                                 02953000
@NM00057 EQU   AVTCWFL1                                                 02954000
@NM00056 EQU   AVTCWFL1                                                 02955000
@NM00055 EQU   AVTCWFL1                                                 02956000
@NM00054 EQU   AVTCWFL1                                                 02957000
AVTCOMWN EQU   AVTCWFL1                                                 02958000
AVTCWEC1 EQU   IEDQAVTD+920                                             02959000
AVTCWPM1 EQU   IEDQAVTD+916                                             02960000
AVTCAREA EQU   IEDQAVTD+912                                             02961000
AVTFZERO EQU   IEDQAVTD+908                                             02962000
AVTCADDR EQU   IEDQAVTD+904                                             02963000
AVTCOREC EQU   IEDQAVTD+900                                             02964000
@NM00053 EQU   IEDQAVTD+892                                             02965000
AVTCPBCB EQU   IEDQAVTD+888                                             02966000
@NM00052 EQU   IEDQAVTD+880                                             02967000
AVTDSIOB EQU   IEDQAVTD+876                                             02968000
@NM00051 EQU   IEDQAVTD+868                                             02969000
AVTCPRMB EQU   IEDQAVTD+864                                             02970000
@NM00050 EQU   IEDQAVTD+856                                             02971000
AVTCLOSB EQU   IEDQAVTD+852                                             02972000
@NM00049 EQU   IEDQAVTD+844                                             02973000
AVTACTIB EQU   IEDQAVTD+840                                             02974000
@NM00048 EQU   IEDQAVTD+836                                             02975000
AVTOLTEB EQU   IEDQAVTD+832                                             02976000
AVTOLTCH EQU   AVTOLTQB+1                                               02977000
AVTOLTVT EQU   AVTOLTQB                                                 02978000
@NM00047 EQU   AVTOPCQB+8                                               02979000
@NM00046 EQU   AVTOPCEC+1                                               02980000
@NM00045 EQU   AVTOPCCC                                                 02981000
AVTOPCPO EQU   AVTOPCCC                                                 02982000
AVTOPCWA EQU   AVTOPCCC                                                 02983000
AVTOPCCH EQU   AVTOPCOB+1                                               02984000
AVTOPCVT EQU   AVTOPCOB                                                 02985000
@NM00044 EQU   AVTCKPQB+9                                               02986000
AVTCKPTS EQU   AVTCKPQB+8                                               02987000
@NM00043 EQU   AVTCKPEC+1                                               02988000
@NM00042 EQU   AVTCKPCC                                                 02989000
AVTCKPPO EQU   AVTCKPCC                                                 02990000
AVTCKPWA EQU   AVTCKPCC                                                 02991000
AVTCKPCH EQU   AVTCKPTB+1                                               02992000
AVTCKPVT EQU   AVTCKPTB                                                 02993000
@NM00041 EQU   IEDQAVTD+796                                             02994000
AVTBFRTB EQU   IEDQAVTD+792                                             02995000
@NM00040 EQU   IEDQAVTD+788                                             02996000
AVTSELCH EQU   IEDQAVTD+785                                             02997000
AVTBFRTN EQU   AVTBFRFG                                                 02998000
AVTBFREB EQU   IEDQAVTD+780                                             02999000
AVTTIMQ  EQU   IEDQAVTD+776                                             03000000
@NM00039 EQU   IEDQAVTD+772                                             03001000
AVTIMQPS EQU   IEDQAVTD+768                                             03002000
AVTINOUT EQU   IEDQAVTD+766                                             03003000
AVTREFTM EQU   IEDQAVTD+764                                             03004000
@NM00038 EQU   IEDQAVTD+752                                             03005000
AVTDELYB EQU   IEDQAVTD+748                                             03006000
AVTOCQPT EQU   IEDQAVTD+744                                             03007000
AVTTSOPT EQU   IEDQAVTD+740                                             03008000
AVTSUPPT EQU   IEDQAVTD+736                                             03009000
AVTCBQCB EQU   IEDQAVTD+732                                             03010000
AVTMSGS  EQU   IEDQAVTD+729                                             03011000
@NM00037 EQU   AVTSYSER                                                 03012000
@NM00036 EQU   AVTSYSER                                                 03013000
@NM00035 EQU   AVTSYSER                                                 03014000
@NM00034 EQU   AVTSYSER                                                 03015000
@NM00033 EQU   AVTSYSER                                                 03016000
@NM00032 EQU   AVTSYSER                                                 03017000
AVTCMAXN EQU   AVTSYSER                                                 03018000
AVTCMINN EQU   AVTSYSER                                                 03019000
AVT2260L EQU   IEDQAVTD+724                                             03020000
AVTABEPL EQU   AVTADBUF                                                 03021000
AVTHFF   EQU   AVTCLRHI+2                                               03022000
@NM00031 EQU   AVTCLRHI                                                 03023000
AVTCCLNK EQU   AVTCRELE+5                                               03024000
AVTCCPRI EQU   AVTCRELE+4                                               03025000
AVTCCQCB EQU   AVTCCELE+1                                               03026000
AVTCCKEY EQU   AVTCCELE                                                 03027000
AVTDELAD EQU   IEDQAVTD+704                                             03028000
AVTDELEM EQU   IEDQAVTD+700                                             03029000
AVTBSX   EQU   AVTCKLNK                                                 03030000
AVTOPETR EQU   AVTHG01                                                  03031000
@NM00030 EQU   AVTCKBYT                                                 03032000
AVTCKONQ EQU   AVTCKBYT                                                 03033000
@NM00029 EQU   AVTCKBYT                                                 03034000
@NM00028 EQU   AVTCKBYT                                                 03035000
@NM00027 EQU   AVTCKBYT                                                 03036000
@NM00026 EQU   AVTCKBYT                                                 03037000
@NM00025 EQU   AVTCKBYT                                                 03038000
@NM00024 EQU   AVTCKBYT                                                 03039000
AVTOPERT EQU   IEDQAVTD+690                                             03040000
AVTOPXCL EQU   IEDQAVTD+688                                             03041000
AVTOPERL EQU   IEDQAVTD+687                                             03042000
@NM00023 EQU   IEDQAVTD+686                                             03043000
AVTCKTIM EQU   IEDQAVTD+684                                             03044000
AVTCKELV EQU   IEDQAVTD+682                                             03045000
AVTCPRCD EQU   IEDQAVTD+681                                             03046000
AVTWARMN EQU   AVTCKELF                                                 03047000
AVTCRTLN EQU   AVTCKELF                                                 03048000
AVTCPIPN EQU   AVTCKELF                                                 03049000
AVTCCLCN EQU   AVTCKELF                                                 03050000
AVTCINCN EQU   AVTCKELF                                                 03051000
@NM00022 EQU   AVTCKELF                                                 03052000
AVTCMCPN EQU   AVTCKELF                                                 03053000
AVTNQBCK EQU   AVTCKELF                                                 03054000
AVTCKQAD EQU   IEDQAVTD+677                                             03055000
AVTSCBSZ EQU   IEDQAVTD+676                                             03056000
@NM00021 EQU   IEDQAVTD+672                                             03057000
AVTCKELE EQU   IEDQAVTD+668                                             03058000
@NM00020 EQU   AVTCKPEL+8                                               03059000
AVTCKRLK EQU   AVTCKPEL+5                                               03060000
AVTCKRPR EQU   AVTCKPEL+4                                               03061000
AVTCKRMQ EQU   AVTCKRMV+1                                               03062000
AVTCKRKY EQU   AVTCKRMV                                                 03063000
AVTHK    EQU   IEDQAVTD+648                                             03064000
AVTHI    EQU   IEDQAVTD+644                                             03065000
AVTIOT   EQU   IEDQAVTD+640                                             03066000
AVTNX    EQU   IEDQAVTD+636                                             03067000
AVTTONE  EQU   IEDQAVTD+632                                             03068000
AVTA3TL  EQU   IEDQAVTD+628                                             03069000
AVTDMECB EQU   IEDQAVTD+624                                             03070000
AVTABEND EQU   IEDQAVTD+618                                             03071000
AVTPLCBN EQU   IEDQAVTD+616                                             03072000
@NM00019 EQU   AVTSAVTP+1                                               03073000
@NM00018 EQU   AVTSAVTF                                                 03074000
AVTSNA   EQU   AVTSAVTF                                                 03075000
AVTONSNA EQU   AVTSAVTF                                                 03076000
AVTVTMCP EQU   AVTSAVTF                                                 03077000
@NM00017 EQU   IEDQAVTD+608                                             03078000
AVTCMBSS EQU   IEDQAVTD+604                                             03079000
AVTRCV   EQU   IEDQAVTD+600                                             03080000
AVTSEND  EQU   IEDQAVTD+596                                             03081000
AVTCSCH  EQU   IEDQAVTD+592                                             03082000
AVTQ1    EQU   IEDQAVTD+588                                             03083000
AVTE7    EQU   IEDQAVTD+584                                             03084000
AVTHB    EQU   IEDQAVTD+580                                             03085000
AVTR1    EQU   IEDQAVTD+576                                             03086000
AVTBZ    EQU   IEDQAVTD+572                                             03087000
AVTEZ    EQU   IEDQAVTD+568                                             03088000
AVTEC    EQU   IEDQAVTD+564                                             03089000
AVTEW    EQU   IEDQAVTD+560                                             03090000
AVTNDIAL EQU   AVTSCOPT                                                 03091000
AVTN2741 EQU   AVTSCOPT                                                 03092000
AVTCONCO EQU   AVTSCOPT                                                 03093000
AVTCONC  EQU   AVTSCOPT                                                 03094000
AVTCMBUF EQU   AVTSCOPT                                                 03095000
AVTAPDMP EQU   AVTSCOPT                                                 03096000
@NM00016 EQU   AVTSCOPT                                                 03097000
AVTHA    EQU   AVTDISP                                                  03098000
AVTEA    EQU   IEDQAVTD+548                                             03099000
AVTAX    EQU   IEDQAVTD+544                                             03100000
AVTA3    EQU   IEDQAVTD+540                                             03101000
AVTGD    EQU   IEDQAVTD+536                                             03102000
AVTAL    EQU   IEDQAVTD+532                                             03103000
AVTOLTST EQU   AVTHG02                                                  03104000
AVTE8    EQU   IEDQAVTD+524                                             03105000
AVTUI    EQU   IEDQAVTD+520                                             03106000
AVTCOMPT EQU   IEDQAVTD+516                                             03107000
AVTCRSRF EQU   IEDQAVTD+512                                             03108000
@NM00015 EQU   IEDQAVTD+508                                             03109000
AVTKA02  EQU   IEDQAVTD+504                                             03110000
AVTOPTPT EQU   IEDQAVTD+500                                             03111000
AVTPCBPT EQU   IEDQAVTD+496                                             03112000
@NM00014 EQU   AVTECB1                                                  03113000
AVTCOMP  EQU   AVTECB1                                                  03114000
@NM00013 EQU   AVTECB1                                                  03115000
AVTOPECA EQU   IEDQAVTD+488                                             03116000
AVTOLECA EQU   IEDQAVTD+484                                             03117000
AVTCKECA EQU   IEDQAVTD+480                                             03118000
AVTCWECA EQU   IEDQAVTD+476                                             03119000
AVTCWTCB EQU   IEDQAVTD+472                                             03120000
AVTOLTCB EQU   IEDQAVTD+468                                             03121000
AVTOCTCB EQU   IEDQAVTD+464                                             03122000
AVTCKTCB EQU   IEDQAVTD+460                                             03123000
AVTAS    EQU   IEDQAVTD+456                                             03124000
AVTNOLBF EQU   IEDQAVTD+454                                             03125000
AVTNCKPR EQU   IEDQAVTD+453                                             03126000
AVTCIB   EQU   IEDQAVTD+452                                             03127000
AVTSPLPT EQU   IEDQAVTD+448                                             03128000
AVTMVBFR EQU   IEDQAVTD+444                                             03129000
AVTSBTA  EQU   IEDQAVTD+440                                             03130000
AVTRARTN EQU   IEDQAVTD+436                                             03131000
AVTBSCAN EQU   IEDQAVTD+432                                             03132000
AVTRDYA  EQU   IEDQAVTD+428                                             03133000
AVTDISTR EQU   IEDQAVTD+420                                             03134000
AVTPARM3 EQU   IEDQAVTD+416                                             03135000
@NM00012 EQU   AVTPKF                                                   03136000
@NM00011 EQU   AVTPKF                                                   03137000
@NM00010 EQU   AVTPKF                                                   03138000
AVTFTCHF EQU   AVTPKF                                                   03139000
@NM00009 EQU   AVTPKF                                                   03140000
@NM00008 EQU   AVTPKF                                                   03141000
@NM00007 EQU   AVTPKF                                                   03142000
@NM00006 EQU   AVTPKF                                                   03143000
AVTPARM  EQU   IEDQAVTD+408                                             03144000
AVTEXS2A EQU   IEDQAVTD+402                                             03145000
AVTEXA2S EQU   IEDQAVTD+396                                             03146000
AVTOCGET EQU   IEDQAVTD+392                                             03147000
AVTCKAVT EQU   @NM00004+1                                               03148000
@NM00005 EQU   AVTCKFLG                                                 03149000
AVTCKHLT EQU   AVTCKFLG                                                 03150000
AVTCKREQ EQU   AVTCKFLG                                                 03151000
AVTCKENV EQU   AVTCKFLG                                                 03152000
AVTCKNAC EQU   AVTCKFLG                                                 03153000
AVTCKTAC EQU   AVTCKFLG                                                 03154000
AVTBUENT EQU   IEDQAVTD+386                                             03155000
@NM00003 EQU   IEDQAVTD+385                                             03156000
AVTFULLT EQU   AVTBUFSW                                                 03157000
AVTUNCON EQU   AVTBUFSW                                                 03158000
@NM00002 EQU   AVTBUFSW                                                 03159000
AVTBUFTR EQU   AVTREADD                                                 03160000
AVTREADY EQU   IEDQAVTD+376                                             03161000
AVTRACE  EQU   IEDQAVTD+372                                             03162000
AVTTCB   EQU   IEDQAVTD+368                                             03163000
AVTPASWD EQU   IEDQAVTD+360                                             03164000
AVTCTLCH EQU   IEDQAVTD+352                                             03165000
AVTDOUBL EQU   IEDQAVTD+344                                             03166000
AVTDOUBX EQU   IEDQAVTD+336                                             03167000
AVTDPARM EQU   IEDQAVTD+332                                             03168000
AVTDLQ   EQU   AVTSAVEX+32                                              03169000
@NM00001 EQU   AVTSAVEX                                                 03170000
AVTSAVE4 EQU   IEDQAVTD+216                                             03171000
AVTSAVE3 EQU   IEDQAVTD+144                                             03172000
AVTSAVE2 EQU   IEDQAVTD+72                                              03173000
AVTSAVE1 EQU   IEDQAVTD                                                 03174000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03175000
@RF00354 EQU   @RC00350                                                 03176000
@RC00357 EQU   @RC00350                                                 03177000
@RC00439 EQU   @RC00434                                                 03178000
@PB00002 EQU   @EL00001                                                 03179000
@RC00571 EQU   @PB00002                                                 03180000
@ENDDATA EQU   *                                                        03181000
         END   IEDQW25,(C'PLS2247',0701,78089)                          03182000
