         TITLE 'IEDQWO, TOTE ACCESS MANAGER                            *00001000
                        '                                               00002000
IEDQWO   CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
         USING *,RBASE            SET IEDQWO ADDRESSABILITY             00005000
         STM   RETADR,RBASE,12(RSAVE) SAVE CALLER S REG                 00006000
         LR    RBASE,RENTRY       SET UP BASE REGISTER                  00007000
         LA    RENTRY,TOTSAVE6(OLTCBPTR)  GET IEDQWO SAVE     @Y17XAU6  00008000
*                                          AREA ADDRESS       @Y17XAU6  00009000
         ST    RENTRY,8(RSAVE)    SAVE IT IN CALLER S SAVE AREA         00010000
         ST    RSAVE,4(RENTRY)    SAVE CALLER S IN IEDQWO SAVE AREA     00011000
         LR    RSAVE,RENTRY       SET IEDQWO SAVE AREA POINTER          00012000
IEDQWO   IEDHJN SKIP,HJN             MODULE ID/DATE                     00013000
*                                                               02S0308 00014000
*   /*****************************************************************/ 00015000
*   /*                                                               */ 00016000
*   /* PROCESS: THIS SEGMENT IS THE MAIN LINE PROCEDURE. INPUT - REG */ 00017000
*   /* 2=OLTCB ADDRESS, OUTPUT - MESSAGE WRITTEN TO DEVICE   @Y17XAU6*/ 00018000
*   /*                                                               */ 00019000
*   /*****************************************************************/ 00020000
*                                                               02S0308 00021000
*   DO;                                                         02S0308 00022000
*     TOTEXIT=OFF;                  /* CLEAR CONTROL FLAG    @Y17XAU6*/ 00023000
         L     @09,TOTEXIT(,OLTCBPTR)                           02S0309 00024000
@GL00001 LR    @06,@09                                          02S0309 00025000
         N     @06,@CF02785                                     02S0309 00026000
         CS    @09,@06,TOTEXIT(OLTCBPTR)                        02S0309 00027000
         BNE   @GL00001                                         02S0309 00028000
*     RAVT=TOTAVTPT;                /* SET AVT BASE                  */ 00029000
         L     RAVT,TOTAVTPT(,OLTCBPTR)                         02S0310 00030000
*     IF TOTCECOM=ON THEN           /* IF A CECOM REQUEST, PROCESS IT   00031000
*                                                            @Y17XAU6*/ 00032000
         TM    TOTCECOM(OLTCBPTR),B'01000000'                   02S0311 00033000
         BNO   @RF00311                                         02S0311 00034000
*                                                               03S0312 00035000
*       /*************************************************************/ 00036000
*       /*                                                           */ 00037000
*       /* PROCESS.CECOM: THIS SEGMENT PROCESSES A CECOM REQUEST.THE */ 00038000
*       /* INPUT IS REG 2=OLTCB ADDRESS, REG 4=AVT ADDRESS. THE      */ 00039000
*       /* OUTPUT IS OUTPUT MESSAGE SENT TO CONTROL TERMINAL AND THE */ 00040000
*       /* TOTEXIT FLAG SET                                  @Y17XAU6*/ 00041000
*       /*                                                           */ 00042000
*       /*************************************************************/ 00043000
*                                                               03S0312 00044000
*       DO;                                                     03S0312 00045000
*         IF TOTCTCON=ON            /* CONTROL TERMINAL EQU SYSCON?  */ 00046000
*           THEN                                                03S0313 00047000
         TM    TOTCTCON(OLTCBPTR),B'00100000'                   03S0313 00048000
         BNO   @RF00313                                         03S0313 00049000
*           CALL SYSCON;            /* YES - PROCESS MSG TO SYSCON   */ 00050000
         BAL   @14,SYSCON                                       03S0314 00051000
*         IF TOTEXIT=OFF THEN       /* PROCESSING INCOMPLETE AND        00052000
*                                                            @Y17XAU6*/ 00053000
@RF00313 TM    TOTEXIT(OLTCBPTR),B'00010000'                    03S0315 00054000
         BNZ   @RF00315                                         03S0315 00055000
*           IF TOTCTORN=OFF THEN    /* EP/LOCAL RESOURCE?            */ 00056000
         TM    TOTCTORN(OLTCBPTR),B'01000000'                   03S0316 00057000
         BNZ   @RF00316                                         03S0316 00058000
*             CALL EPLPROC;         /* YES - PROCESS EP/LOCAL REQUEST*/ 00059000
         BAL   @14,EPLPROC                                      03S0317 00060000
*           ELSE                                                03S0318 00061000
*             CALL RNPROC;          /* NO - PROCESS 3705 REQUEST     */ 00062000
         B     @RC00316                                         03S0318 00063000
@RF00316 BAL   @14,RNPROC                                       03S0318 00064000
*       END;                                                    03S0319 00065000
@RC00316 DS    0H                                               03S0319 00066000
@RF00315 DS    0H                                               03S0320 00067000
*     IF TOTEXIT=OFF THEN           /* IF PROCESSING INCOMPLETE 02S0320 00068000
*                                                            @Y17XAU6*/ 00069000
@RF00311 TM    TOTEXIT(OLTCBPTR),B'00010000'                    02S0320 00070000
         BNZ   @RF00320                                         02S0320 00071000
*       IF TOTPRINT=ON THEN         /* AND DPRINT REQUEST, PROCESS IT   00072000
*                                                            @Y17XAU6*/ 00073000
         TM    TOTPRINT(OLTCBPTR),B'10000000'                   02S0321 00074000
         BNO   @RF00321                                         02S0321 00075000
*                                                               03S0322 00076000
*         /***********************************************************/ 00077000
*         /*                                                         */ 00078000
*         /* PROCESS.DPRINT: THIS SEGMENT PROCESSES A DPRINT REQUEST.*/ 00079000
*         /* THE INPUT IS REG 2=OLTCB ADDRESS, REG 4=AVT ADDRESS. THE*/ 00080000
*         /* OUTPUT IS MESSAGE WRITTEN TO ALTERNATE PRINTER AND      */ 00081000
*         /* TOTEXIT FLAG SET                                        */ 00082000
*         /*                                                         */ 00083000
*         /***********************************************************/ 00084000
*                                                               03S0322 00085000
*         DO;                                                   03S0322 00086000
*           IF TOTAPCON=ON|(TOTPRECT=ON&TOTCTCON=ON)/* IF AP EQU        00087000
*                                      SYSCON OR AP EQU CT AND CT EQU   00088000
*                                      SYSCON                @YM07768*/ 00089000
*             THEN                                              03S0323 00090000
         TM    TOTAPCON(OLTCBPTR),B'10000000'                   03S0323 00091000
         BO    @RT00323                                         03S0323 00092000
         TM    TOTPRECT(OLTCBPTR),B'00100010'                   03S0323 00093000
         BNO   @RF00323                                         03S0323 00094000
@RT00323 DS    0H                                               03S0324 00095000
*             CALL SYSCON;          /* YES - PROCESS SYSCON REQUEST  */ 00096000
         BAL   @14,SYSCON                                       03S0324 00097000
*           IF TOTEXIT=OFF THEN                                 03S0325 00098000
@RF00323 TM    TOTEXIT(OLTCBPTR),B'00010000'                    03S0325 00099000
         BNZ   @RF00325                                         03S0325 00100000
*             IF TOTAPOUT=ON THEN   /* PROCESSING INCOMPLETE AND        00101000
*                                      ALTERNATE PRINTER EQU SYSOUT     00102000
*                                                            @Y17XAU6*/ 00103000
         TM    TOTAPOUT(OLTCBPTR),B'01000000'                   03S0326 00104000
         BNO   @RF00326                                         03S0326 00105000
*                                                               04S0327 00106000
*               /*****************************************************/ 00107000
*               /*                                                   */ 00108000
*               /* PROCESS.DPRINT.SYSOUT: THIS SEGMENT PROCESSES A   */ 00109000
*               /* DPRINT REQUEST FOR THE SYSTEM OUTPUT DEVICE. THE  */ 00110000
*               /* INPUT IS REG 2=OLTCB ADDRESS, REG 4=AVT ADDRESS.  */ 00111000
*               /* THE OUTPUT IS MESSAGE SENT TO SYSTEM OUTPUT DEVICE*/ 00112000
*               /* AND TOTEXIT FLAG SET ON                           */ 00113000
*               /*                                                   */ 00114000
*               /*****************************************************/ 00115000
*                                                               04S0327 00116000
*               DO;                                             04S0327 00117000
*                 RFY                                           04S0328 00118000
*                   RDCB RSTD;                                  04S0328 00119000
*                 RFY                                           04S0329 00120000
*                   REG6 RSTD;                                  04S0329 00121000
*                 RDCB=TOTAPDCB;    /* SYSOUT DCB ADDRESS            */ 00122000
         L     RDCB,TOTAPDCB(,OLTCBPTR)                         04S0330 00123000
*                 DCBSYNAD=ADDR(SYNAD);/* SET SYNAD EXIT ADDRESS     */ 00124000
         LA    @11,SYNAD                                        04S0331 00125000
         ST    @11,DCBSYNAD+52(,RDCB)                           04S0331 00126000
*                 IF DCBDEVT=PRINTER THEN/* SYSOUT A PRINTER         */ 00127000
         CLC   DCBDEVT+16(1,RDCB),PRINTER                       04S0332 00128000
         BNE   @RF00332                                         04S0332 00129000
*                   DO;             /* PROCESS PRINTER DEPENDENCIES  */ 00130000
*                     IF TOTFMCTL^=NOFORM&TOTFMCTL=RESTORE THEN/*       00131000
*                                      FORM CONTROL?                 */ 00132000
         TM    TOTFMCTL(OLTCBPTR),B'11110000'                   04S0334 00133000
         BZ    @RF00334                                         04S0334 00134000
         TM    TOTFMCTL(OLTCBPTR),B'01000000'                   04S0334 00135000
         BNO   @RF00334                                         04S0334 00136000
         TM    TOTFMCTL(OLTCBPTR),B'10110000'                   04S0334 00137000
         BNZ   @RF00334                                         04S0334 00138000
*                       GEN(   CNTRL  (RDCB),SK,1);/* SKIP TO CHANNEL   00139000
*                                      ONE                           */ 00140000
            CNTRL  (RDCB),SK,1                                          00141000
*                     IF TOTFMCTL=SPACE1/* CHECK FOR SPACE 1         */ 00142000
*                       THEN                                    04S0336 00143000
@RF00334 TM    TOTFMCTL(OLTCBPTR),B'00010000'                   04S0336 00144000
         BNO   @RF00336                                         04S0336 00145000
         TM    TOTFMCTL(OLTCBPTR),B'11100000'                   04S0336 00146000
         BNZ   @RF00336                                         04S0336 00147000
*                       GEN(   CNTRL  (RDCB),SP,1);/* SPACE 1 LINE   */ 00148000
            CNTRL  (RDCB),SP,1                                          00149000
*                     ELSE                                      04S0338 00150000
*                       IF TOTFMCTL=SPACE2/* CHECK FOR SPACE 2       */ 00151000
*                         THEN                                  04S0338 00152000
         B     @RC00336                                         04S0338 00153000
@RF00336 TM    TOTFMCTL(OLTCBPTR),B'00100000'                   04S0338 00154000
         BNO   @RF00338                                         04S0338 00155000
         TM    TOTFMCTL(OLTCBPTR),B'11010000'                   04S0338 00156000
         BNZ   @RF00338                                         04S0338 00157000
*                         GEN(   CNTRL  (RDCB),SP,2);/* SPACE 2 LINES*/ 00158000
            CNTRL  (RDCB),SP,2                                          00159000
*                       ELSE                                    04S0340 00160000
*                         IF TOTFMCTL=SPACE3/* CHECK FOR SPACE 3     */ 00161000
*                           THEN                                04S0340 00162000
         B     @RC00338                                         04S0340 00163000
@RF00338 TM    TOTFMCTL(OLTCBPTR),B'00110000'                   04S0340 00164000
         BNO   @RF00340                                         04S0340 00165000
         TM    TOTFMCTL(OLTCBPTR),B'11000000'                   04S0340 00166000
         BNZ   @RF00340                                         04S0340 00167000
*                           GEN(   CNTRL  (RDCB),SP,3);/* SPACE 3       00168000
*                                      LINES                         */ 00169000
            CNTRL  (RDCB),SP,3                                          00170000
*                     TOTFMCTL=''B; /* CLEAR FORM CONTROL            */ 00171000
@RF00340 DS    0H                                               04S0342 00172000
@RC00338 DS    0H                                               04S0342 00173000
@RC00336 NI    TOTFMCTL(OLTCBPTR),B'00001111'                   04S0342 00174000
*                     GEN(   PRTOV  (RDCB),12);/* CHECK FOR OVERFLOW */ 00175000
            PRTOV  (RDCB),12                                            00176000
*                   END;                                        04S0344 00177000
*                 REG7=ADDR(TOTOTBUF);/* OUTPUT DATA ADDRESS         */ 00178000
@RF00332 LA    REG7,TOTOTBUF(,OLTCBPTR)                         04S0345 00179000
*                 REG6=ADDR(TOTPDECB);/* SYNAD EXIT ADDRESS  @YM08071*/ 00180000
         LA    REG6,TOTPDECB(,OLTCBPTR)                         04S0346 00181000
*                 TOTPDECB=TOTPDECB&&TOTPDECB;/* CLEAR ECB           */ 00182000
         XC    TOTPDECB(20,OLTCBPTR),TOTPDECB(OLTCBPTR)         04S0347 00183000
*                 GEN(    WRITE (REG6),SF,(RDCB),(REG7),'S',MF=E);/*    00184000
*                                      WRITE DATA                    */ 00185000
             WRITE (REG6),SF,(RDCB),(REG7),'S',MF=E                     00186000
*                 GEN(    CHECK (REG6));/* CHECK FOR ERRORS          */ 00187000
             CHECK (REG6)                                               00188000
*                 TOTEXIT=ON;       /* SET EXIT FLAG                 */ 00189000
         L     @11,TOTEXIT(,OLTCBPTR)                           04S0350 00190000
@GL00004 LR    @09,@11                                          04S0350 00191000
         O     @09,@CF02789                                     04S0350 00192000
         CS    @11,@09,TOTEXIT(OLTCBPTR)                        04S0350 00193000
         BNE   @GL00004                                         04S0350 00194000
*                 RFY                                           04S0351 00195000
*                   RDCB UNRSTD;                                04S0351 00196000
*                 RFY                                           04S0352 00197000
*                   REG6 UNRSTD;                                04S0352 00198000
*               END;                                            04S0353 00199000
*             ELSE                                              03S0354 00200000
*               IF TOTAPORN=OFF THEN/* ALTERNATE PRINTER NOT ON 3705    00201000
*                                                            @Y17XAU6*/ 00202000
         B     @RC00326                                         03S0354 00203000
@RF00326 TM    TOTAPORN(OLTCBPTR),B'01000000'                   03S0354 00204000
         BNZ   @RF00354                                         03S0354 00205000
*                 CALL EPLPROC;     /* YES - PROCESS EP/LOCAL REQUEST*/ 00206000
         BAL   @14,EPLPROC                                      03S0355 00207000
*               ELSE                                            03S0356 00208000
*                 CALL RNPROC;      /* NO - PROCESS 3705 REQUEST     */ 00209000
         B     @RC00354                                         03S0356 00210000
@RF00354 BAL   @14,RNPROC                                       03S0356 00211000
*         END;                                                  03S0357 00212000
*       ELSE                                                    02S0358 00213000
*         IF TOTSRCE=ON THEN        /* SOURCE REQUEST        @Y17XAU6*/ 00214000
         B     @RC00321                                         02S0358 00215000
@RF00321 TM    TOTSRCE(OLTCBPTR),B'00010000'                    02S0358 00216000
         BNO   @RF00358                                         02S0358 00217000
*                                                               03S0359 00218000
*           /*********************************************************/ 00219000
*           /*                                                       */ 00220000
*           /* PROCESS.SOURCE: THIS SEGMENT PROCESSES A SOURCE       */ 00221000
*           /* REQUEST TO SEND ERROR MESSAGE TO THE REQUESTING       */ 00222000
*           /* TERMINAL. THE INPUT IS REG 2=OLTCB ADDRESS, REG 4=AVT */ 00223000
*           /* ADDRESS. THE OUTPUT IS MESSAGE WRITTEN BACK TO SOURCE */ 00224000
*           /* TERMINAL AND TOTEXIT FLAG SET                         */ 00225000
*           /*                                                       */ 00226000
*           /*********************************************************/ 00227000
*                                                               03S0359 00228000
*           DO;                                                 03S0359 00229000
*             RFY                                               03S0360 00230000
*               RPARM RSTD;         /*                       @Y17XAU6*/ 00231000
*             RFY                                               03S0361 00232000
*               RDCT RSTD;          /*                       @ZM47904*/ 00233000
*             RPARM=TOTSROFF;       /* GET SOURCE TTCIN              */ 00234000
         LH    RPARM,TOTSROFF(,OLTCBPTR)                        03S0362 00235000
         N     RPARM,@CF02792                                   03S0362 00236000
*             CALL IEDQTNT;         /* FIND SOURCE TTE ADDRESS       */ 00237000
         L     @15,AVTRNMPT(,RAVT)                              03S0363 00238000
         BALR  @14,@15                                          03S0363 00239000
*             RTRM=RPARM;           /* SET TTE BASE          @Y17XAU6*/ 00240000
         LR    RTRM,RPARM                                       03S0364 00241000
*             RTRM=RTRM-LENGTH(IEDNTRM);/* ADJUST TTE BASE TO INCLUDE   00242000
*                                      NEGATIVE PREFIX       @Y17XAU6*/ 00243000
         SL    RTRM,@CF02435                                    03S0365 00244000
*/* ? IEDDCT REG(RDCT);                                              */ 00245000
*                                                               03S0366 00246000
*             /*******************************************************/ 00247000
*             /*                                                     */ 00248000
*             /* SET UP ADDRESSABILITY TO THE DCT ENTRY              */ 00249000
*             /*                                                     */ 00250000
*             /*******************************************************/ 00251000
*                                                               03S0366 00252000
*             RDCT=AVTCSTCS+(TRMCHCIN-1)*AVTDCTLN;/*         @ZM47904*/ 00253000
         SLR   @11,@11                                          03S0366 00254000
         IC    @11,TRMCHCIN(,RTRM)                              03S0366 00255000
         BCTR  @11,0                                            03S0366 00256000
         MH    @11,AVTDCTLN(,RAVT)                              03S0366 00257000
         AL    @11,AVTCSTCS(,RAVT)                              03S0366 00258000
         LR    RDCT,@11                                         03S0366 00259000
*             IF DCTUMASK=OFF THEN  /* IF SOURCE NOT GEN POLLED 03S0367 00260000
*                                                            @ZM47904*/ 00261000
         TM    DCTUMASK(RDCT),B'00000001'                       03S0367 00262000
         BNZ   @RF00367                                         03S0367 00263000
*               IF TRMPREF=ON THEN  /* PROCESS 3705 RESOURCE @Y17XAU6*/ 00264000
         TM    TRMPREF(RTRM),B'00010000'                        03S0368 00265000
         BNO   @RF00368                                         03S0368 00266000
*                                                               04S0369 00267000
*                 /***************************************************/ 00268000
*                 /*                                                 */ 00269000
*                 /* PROCESS.SOURCE.RNSRC: THIS SEGMENT PROCESSES A  */ 00270000
*                 /* REQUEST FOR AN ERROR MESSAGE TO BE SENT TO A    */ 00271000
*                 /* REMOTE DEVICE ATTACHED TO A 3705. THE INPUT IS  */ 00272000
*                 /* REG 2=OLTCB ADDRESS, REG 4=AVT ADDRESS, REG     */ 00273000
*                 /* 8=SOURCE TERMINAL ENTRY ADDRESS. THE OUTPUT IS  */ 00274000
*                 /* MESSAGE SENT TO REMOTE DEVICE AND TOTEXIT FLAG  */ 00275000
*                 /* SET                                     @Y17XAU6*/ 00276000
*                 /*                                                 */ 00277000
*                 /***************************************************/ 00278000
*                                                               04S0369 00279000
*                 DO;                                           04S0369 00280000
*                   CALL SCBBUILD;  /* SET UP TO REQUEST A BUFFER       00281000
*                                                            @Y17XAU6*/ 00282000
         BAL   @14,SCBBUILD                                     04S0370 00283000
*                   CALL MVMSG;     /* MOVE MSG TO BUFFER            */ 00284000
         BAL   @14,MVMSG                                        04S0371 00285000
*                   CALL INITHDR;   /* SET UP HEADER PREFIX          */ 00286000
         BAL   @14,INITHDR                                      04S0372 00287000
*                   CALL POSTBUF;   /* POSTBUF TO QUEUE              */ 00288000
         BAL   @14,POSTBUF                                      04S0373 00289000
*                   TOTEXIT=ON;     /* SET EXIT FLAG                 */ 00290000
         L     @11,TOTEXIT(,OLTCBPTR)                           04S0374 00291000
@GL00005 LR    @09,@11                                          04S0374 00292000
         O     @09,@CF02789                                     04S0374 00293000
         CS    @11,@09,TOTEXIT(OLTCBPTR)                        04S0374 00294000
         BNE   @GL00005                                         04S0374 00295000
*                 END;                                          04S0375 00296000
*               ELSE                /* PROCESS EP/LOCAL RESOURCE        00297000
*                                                            @Y17XAU6*/ 00298000
*                                                               04S0376 00299000
*                 /***************************************************/ 00300000
*                 /*                                                 */ 00301000
*                 /* PROCESS.SOURCE.EPLSRC: THIS SEGMENT PROCESSES A */ 00302000
*                 /* REQUEST FOR AN ERROR MESSAGE TO BE SENT TO A    */ 00303000
*                 /* LOCAL DEVICE OR AN EP DEVICE. THE INPUT IS REG  */ 00304000
*                 /* 2=OLTCB ADDRESS, REG 4=AVT ADDRESS, REG 8=SOURCE*/ 00305000
*                 /* TERMINAL ENTRY ADDRESS. THE OUTPUT IS MESSAGE   */ 00306000
*                 /* SENT TO SOURCE DEVICE AND TOTEXIT FLAG SET ON   */ 00307000
*                 /*                                         @Y17XAU6*/ 00308000
*                 /*                                                 */ 00309000
*                 /***************************************************/ 00310000
*                                                               04S0376 00311000
*                 DO;                                           04S0376 00312000
         B     @RC00368                                         04S0376 00313000
@RF00368 DS    0H                                               04S0377 00314000
*                   CALL SCBBUILD;  /* SET UP TO REQUEST A BUFFER       00315000
*                                                            @Y17XAU6*/ 00316000
         BAL   @14,SCBBUILD                                     04S0377 00317000
*                   CALL MVMSG;     /* MOVE MSG TO BUFFER            */ 00318000
         BAL   @14,MVMSG                                        04S0378 00319000
*                   CALL INITHDR;   /* SET UP HEADER PREFIX          */ 00320000
         BAL   @14,INITHDR                                      04S0379 00321000
*                   CALL POSTBUF;   /* POST BUFFER TO DEST. QCB      */ 00322000
         BAL   @14,POSTBUF                                      04S0380 00323000
*                   TOTEXIT=ON;     /* SET EXIT FLAG                 */ 00324000
         L     @11,TOTEXIT(,OLTCBPTR)                           04S0381 00325000
@GL00006 LR    @09,@11                                          04S0381 00326000
         O     @09,@CF02789                                     04S0381 00327000
         CS    @11,@09,TOTEXIT(OLTCBPTR)                        04S0381 00328000
         BNE   @GL00006                                         04S0381 00329000
*                 END;                                          04S0382 00330000
*             ELSE                                              03S0383 00331000
*               ;                   /* SOURCE GEN POLLED, HEAD NOT      00332000
*                                      KNOWN                 @ZM47904*/ 00333000
@RF00367 DS    0H                                               03S0384 00334000
*             RFY                                               03S0384 00335000
*               RDCT UNRSTD;        /*                       @ZM47904*/ 00336000
@RC00367 DS    0H                                               03S0385 00337000
*             RFY                                               03S0385 00338000
*               RPARM UNRSTD;       /*                       @Y17XAU6*/ 00339000
*           END;                                                03S0386 00340000
*   END;                                                        02S0387 00341000
@RF00358 DS    0H                                               02S0387 00342000
@RC00321 DS    0H                                               02S0387 00343000
@RF00320 DS    0H                                               02S0388 00344000
*                                                               02S0388 00345000
*   /*****************************************************************/ 00346000
*   /*                                                               */ 00347000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00348000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT.            @Y17XAU6*/ 00349000
*   /*                                                               */ 00350000
*   /*****************************************************************/ 00351000
*                                                               02S0388 00352000
*   GEN REFS(RSAVE) SETS(0,1,2,3,4,5,6,7,8,9,10,11,12,14,15) SEQFLOW;   00353000
*                                 /*                                    00354000
         L     RSAVE,4(RSAVE)     RESTORE CALLER S SAVE AREA PTR        00355000
         LM    RETADR,RBASE,12(RSAVE) RESTORE CALLER S REGISTERS        00356000
         BR    RETADR             RETURN TO CALLER                      00357000
*                                                                   */  00358000
         EJECT                                                          00359000
*                                                               02S0389 00360000
*   /*****************************************************************/ 00361000
*   /*                                                               */ 00362000
*   /* BISYNC: THIS INTERNAL PROCEDURE IS CALLED TO INSERT THE       */ 00363000
*   /* NECESSARY LINE CONTROL CHARACTERS IN THE OUTPUT MESSAGE FOR A */ 00364000
*   /* BISYNCH EP DEVICE.                                    @Y17XAU6*/ 00365000
*   /*                                                               */ 00366000
*   /*****************************************************************/ 00367000
*                                                               02S0389 00368000
*BISYNC:                                                        02S0389 00369000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0389 00370000
         B     @PB00002                                         02S0389 00371000
BISYNC   DS    0H                                               02S0390 00372000
*   RFY                                                         02S0390 00373000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 00374000
*   TOTWOSV4=RETADR;                /* SAVE RETURN ADDRESS           */ 00375000
         ST    RETADR,TOTWOSV4(,OLTCBPTR)                       02S0391 00376000
*   TOTINBUF=TOTOTBUF;              /* MOVE OUTPUT DATA TO INPUT AREA*/ 00377000
         MVC   TOTINBUF(80,OLTCBPTR),TOTOTBUF(OLTCBPTR)         02S0392 00378000
*   TOTOTBUF(1:1)=STX;              /* INSERT STX INTO FIRST BYTE       00379000
*                                                            @Y17XAU6*/ 00380000
         MVC   TOTOTBUF(1,OLTCBPTR),STX                         02S0393 00381000
*   TOTOTBUF(2:TOTOTCNT+1)=TOTINBUF;/* OUTPUT DATA BACK TO OUTPUT       00382000
*                                      AREA                          */ 00383000
         SLR   @15,@15                                          02S0394 00384000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0394 00385000
         LR    @09,@15                                          02S0394 00386000
         BCTR  @09,0                                            02S0394 00387000
         EX    @09,@SM02793                                     02S0394 00388000
*   TOTOTBUF(TOTOTCNT+2:TOTOTCNT+4)=MSGEND;/* SET NL,ETX,EOT         */ 00389000
*                                                               02S0395 00390000
         ALR   @15,OLTCBPTR                                     02S0395 00391000
         MVC   TOTOTBUF+1(3,@15),MSGEND                         02S0395 00392000
*   /*****************************************************************/ 00393000
*   /*                                                               */ 00394000
*   /* INSERT NEW LINE, ETX, AND EOT CHARACTERS AT END OF DATA       */ 00395000
*   /*                                                               */ 00396000
*   /*****************************************************************/ 00397000
*                                                               02S0396 00398000
*   TOTOTCNT=TOTOTCNT+4;            /* INCREMENT OUTPUT COUNT BY 4   */ 00399000
         SLR   @15,@15                                          02S0396 00400000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0396 00401000
         AL    @15,@CF00256                                     02S0396 00402000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          02S0396 00403000
*   RETADR=TOTWOSV4;                /* RESTORE RETURN ADDRESS        */ 00404000
         L     @09,TOTWOSV4(,OLTCBPTR)                          02S0397 00405000
         LR    RETADR,@09                                       02S0397 00406000
*   RFY                                                         02S0398 00407000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 00408000
*   END BISYNC;                     /* END BISYNC PROCEDURE          */ 00409000
@EL00002 DS    0H                                               02S0399 00410000
@EF00002 DS    0H                                               02S0399 00411000
@ER00002 BR    @14                                              02S0399 00412000
@PB00002 DS    0H                                               02S0400 00413000
*   GEN(  EJECT);                                               02S0400 00414000
           EJECT                                                        00415000
*                                                               02S0401 00416000
*   /*****************************************************************/ 00417000
*   /*                                                               */ 00418000
*   /* EPLPROC: THIS INTERNAL PROCEDURE IS ENTERED FOR PROCESSING FOR*/ 00419000
*   /* A LOCAL DEVICE OR AN EP DEVICE ALTERNATE PRINTER OR CONTROL   */ 00420000
*   /* TERMINAL MESSAGE.                                     @Y17XAU6*/ 00421000
*   /*                                                               */ 00422000
*   /*****************************************************************/ 00423000
*                                                               02S0401 00424000
*EPLPROC:                                                       02S0401 00425000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0401 00426000
         B     @PB00003                                         02S0401 00427000
EPLPROC  DS    0H                                               02S0402 00428000
*   RFY                                                         02S0402 00429000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 00430000
*   TOTWOSV2=RETADR;                /* SAVE RETURN ADDRESS           */ 00431000
         ST    RETADR,TOTWOSV2(,OLTCBPTR)                       02S0403 00432000
*   IF TOTCECOM=ON|TOTPRECT=ON      /* CECOM REQUEST OR CT EQU AP    */ 00433000
*     THEN                                                      02S0404 00434000
         TM    TOTCECOM(OLTCBPTR),B'01000000'                   02S0404 00435000
         BO    @RT00404                                         02S0404 00436000
         TM    TOTPRECT(OLTCBPTR),B'00000010'                   02S0404 00437000
         BNO   @RF00404                                         02S0404 00438000
@RT00404 DS    0H                                               02S0405 00439000
*     RDEV=ADDR(TOTCTENT);          /* CT CONTROL AREA               */ 00440000
         LA    RDEV,TOTCTENT(,OLTCBPTR)                         02S0405 00441000
*   ELSE                                                        02S0406 00442000
*     RDEV=ADDR(TOTAPENT);          /* AP CONTROL AREA               */ 00443000
         B     @RC00404                                         02S0406 00444000
@RF00404 LA    RDEV,TOTAPENT(,OLTCBPTR)                         02S0406 00445000
*   CALL STARTERM;                  /* ACTIVATE TERMINAL             */ 00446000
@RC00404 BAL   @14,STARTERM                                     02S0407 00447000
*   CALL SCBBUILD;                  /* SET UP TO REQUEST A BUFFER    */ 00448000
         BAL   @14,SCBBUILD                                     02S0408 00449000
*   CALL MVMSG;                     /* MOVE MSG TO BUFFER            */ 00450000
         BAL   @14,MVMSG                                        02S0409 00451000
*   CALL INITHDR;                   /* SET UP HEADER PREFIX          */ 00452000
         BAL   @14,INITHDR                                      02S0410 00453000
*   CALL POSTBUF;                   /* POST BUFFER TO DEST. QCB      */ 00454000
         BAL   @14,POSTBUF                                      02S0411 00455000
*   TOTEXIT=ON;                     /* SET EXIT FLAG                 */ 00456000
         L     @15,TOTEXIT(,OLTCBPTR)                           02S0412 00457000
@GL00008 LR    @09,@15                                          02S0412 00458000
         O     @09,@CF02789                                     02S0412 00459000
         CS    @15,@09,TOTEXIT(OLTCBPTR)                        02S0412 00460000
         BNE   @GL00008                                         02S0412 00461000
*   RETADR=TOTWOSV2;                /* RESTORE RETURN ADDRESS        */ 00462000
         L     RETADR,TOTWOSV2(,OLTCBPTR)                       02S0413 00463000
*   RFY                                                         02S0414 00464000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 00465000
*   END EPLPROC;                    /* END EPLPROC PROCEDURE         */ 00466000
@EL00003 DS    0H                                               02S0415 00467000
@EF00003 DS    0H                                               02S0415 00468000
@ER00003 BR    @14                                              02S0415 00469000
@PB00003 DS    0H                                               02S0416 00470000
*   GEN(  EJECT);                                               02S0416 00471000
           EJECT                                                        00472000
*                                                               02S0417 00473000
*   /*****************************************************************/ 00474000
*   /*                                                               */ 00475000
*   /* GETBUF: THIS INTERNAL PROCEDURE CALLS THE ROUTINE IN IEDQWA TO*/ 00476000
*   /* REQUEST A TCAM BUFFER                                 @Y17XAU6*/ 00477000
*   /*                                                               */ 00478000
*   /*****************************************************************/ 00479000
*                                                               02S0417 00480000
*GETBUF:                                                        02S0417 00481000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0417 00482000
         B     @PB00004                                         02S0417 00483000
GETBUF   DS    0H                                               02S0418 00484000
*   RFY                                                         02S0418 00485000
*     REG0 RSTD;                    /*                       @Y17XAU6*/ 00486000
*   RFY                                                         02S0419 00487000
*     RPARM RSTD;                   /*                       @Y17XAU6*/ 00488000
*   RFY                                                         02S0420 00489000
*     RRESPL RSTD;                  /*                       @Y17XAU6*/ 00490000
*   RFY                                                         02S0421 00491000
*     RSAVE RSTD;                   /*                       @Y17XAUV*/ 00492000
*   RFY                                                         02S0422 00493000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 00494000
*   TOTWOSV4=RETADR;                /* SAVE RETURN ADDRESS   @YM08456*/ 00495000
         ST    RETADR,TOTWOSV4(,OLTCBPTR)                       02S0423 00496000
*   REG0=ADDR(TOTWKSPC);            /* GET WORK AREA ADDRESS @Y17XAU6*/ 00497000
         LA    REG0,TOTWKSPC(,OLTCBPTR)                         02S0424 00498000
*   RPARM=((TOTOTCNT+AVTHDRSZ)/AVTKEYLE)+ONE;/* CALCULATE THE NUMBER    00499000
*                                      OF UNITS REQUIRED     @Y17XAU6*/ 00500000
         LA    RPARM,30                                         02S0425 00501000
         SLR   @15,@15                                          02S0425 00502000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0425 00503000
         ALR   RPARM,@15                                        02S0425 00504000
         LR    @10,RPARM                                        02S0425 00505000
         SRDA  @10,32                                           02S0425 00506000
         LH    RPARM,AVTKEYLE(,RAVT)                            02S0425 00507000
         DR    @10,RPARM                                        02S0425 00508000
         SLR   RPARM,RPARM                                      02S0425 00509000
         IC    RPARM,ONE                                        02S0425 00510000
         ALR   @11,RPARM                                        02S0425 00511000
         LR    RPARM,@11                                        02S0425 00512000
*   RRESPL=TOTRESPL;                /* GET ADDRESS OF RESPL  @Y17XAU6*/ 00513000
         L     RRESPL,TOTRESPL(,OLTCBPTR)                       02S0426 00514000
*   RSAVE=ADDR(TOTSAVE2);           /* SET SAVE AREA PTR FOR ALLOCBUF   00515000
*                                                            @YM07351*/ 00516000
         LA    RSAVE,TOTSAVE2(,OLTCBPTR)                        02S0427 00517000
*   CALL ALLOCBUF;                  /* CALL IEDQWA TO REQUEST A 02S0428 00518000
*                                      BUFFER                @Y17XAU6*/ 00519000
         L     @15,RESABUF(,RRESPL)                             02S0428 00520000
         BALR  @14,@15                                          02S0428 00521000
*   RSAVE=ADDR(TOTSAVE6);           /* RESTORE MY SAVE AREA PTR 02S0429 00522000
*                                                            @YM07351*/ 00523000
         LA    RSAVE,TOTSAVE6(,OLTCBPTR)                        02S0429 00524000
*   RPRF=RPARM;                     /* GET ADDRESS OF BUFFER RETURNED   00525000
*                                      BY TCAM               @Y17XAU6*/ 00526000
         LR    RPRF,RPARM                                       02S0430 00527000
*   RETADR=TOTWOSV4;                /* RESTORE RETURN ADDRESS   02S0431 00528000
*                                                            @YM08456*/ 00529000
         L     RETADR,TOTWOSV4(,OLTCBPTR)                       02S0431 00530000
*   RFY                                                         02S0432 00531000
*     REG0 UNRSTD;                  /*                       @Y17XAU6*/ 00532000
*   RFY                                                         02S0433 00533000
*     RPARM UNRSTD;                 /*                       @Y17XAU6*/ 00534000
*   RFY                                                         02S0434 00535000
*     RSAVE UNRSTD;                 /*                       @Y17XAUV*/ 00536000
*   RFY                                                         02S0435 00537000
*     RRESPL UNRSTD;                /*                       @Y17XAU6*/ 00538000
*   RFY                                                         02S0436 00539000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 00540000
*   END GETBUF;                     /* END GETBUF PROCEDURE          */ 00541000
@EL00004 DS    0H                                               02S0437 00542000
@EF00004 DS    0H                                               02S0437 00543000
@ER00004 BR    @14                                              02S0437 00544000
@PB00004 DS    0H                                               02S0438 00545000
*   GEN(  EJECT);                                               02S0438 00546000
           EJECT                                                        00547000
*                                                               02S0439 00548000
*   /*****************************************************************/ 00549000
*   /*                                                               */ 00550000
*   /* INITHDR: THIS INTERNAL PROCEDURE SETS UP THE BUFFER PREFIX IN */ 00551000
*   /* ORDER TO POST THE OUTPUT MESSAGE TO THE DESTINATION QUEUE     */ 00552000
*   /*                                                       @Y17XAU6*/ 00553000
*   /*                                                               */ 00554000
*   /*****************************************************************/ 00555000
*                                                               02S0439 00556000
*INITHDR:                                                       02S0439 00557000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0439 00558000
         B     @PB00005                                         02S0439 00559000
INITHDR  DS    0H                                               02S0440 00560000
*   RFY                                                         02S0440 00561000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 00562000
*   RFY                                                         02S0441 00563000
*     RSCB RSTD;                    /*                       @Y17XAU6*/ 00564000
*   RFY                                                         02S0442 00565000
*     RRESPL RSTD;                  /*                       @Y17XAU6*/ 00566000
*   RFY                                                         02S0443 00567000
*     RLCB RSTD;                    /*                       @Y17XAU6*/ 00568000
*   RFY                                                         02S0444 00569000
*     RTTC RSTD;                    /*                       @Y17XAU6*/ 00570000
*   RFY                                                         02S0445 00571000
*     IEDQQPTR RSTD;                /*                       @OZ31587*/ 00572000
*   IEDQQPTR=TRMDESTQ;              /* GET QCB ADDRESS       @OZ31587*/ 00573000
         SLR   IEDQQPTR,IEDQQPTR                                02S0446 00574000
         ICM   IEDQQPTR,7,TRMDESTQ(RTRM)                        02S0446 00575000
*   TOTWOSV3=RETADR;                /* SAVE RETURN ADDRESS           */ 00576000
         ST    RETADR,TOTWOSV3(,OLTCBPTR)                       02S0447 00577000
*   PRFLCB=ADDR(TOTWKSPC)-(ADDR(LCBRCQCB)-ADDR(IEDQLCB));/* SET LCB     00578000
*                                      ADDRESS TO "DUMMY" LCB IN        00579000
*                                      WORKAREA              @Y17XAU6*/ 00580000
         LA    @15,TOTWKSPC(,OLTCBPTR)                          02S0448 00581000
         LR    @11,@15                                          02S0448 00582000
         SL    @11,@CF01746                                     02S0448 00583000
         STCM  @11,7,PRFLCB(RPRF)                               02S0448 00584000
*   PRFSRCE=ZERO(1:2);              /* CLEAR SOURCE FIELD            */ 00585000
         MVC   PRFSRCE(2,RPRF),ZERO                             02S0449 00586000
*   PRFSIZE=TOTOTCNT+AVTHDRSZ;      /* SIZE OF DATA IN THE BUFFER EQU   00587000
*                                      THE MESSAGE SIZE PLUS PREFIX     00588000
*                                      SIZE                  @Y17XAU6*/ 00589000
         LA    @11,30                                           02S0450 00590000
         SLR   @09,@09                                          02S0450 00591000
         IC    @09,TOTOTCNT(,OLTCBPTR)                          02S0450 00592000
         ALR   @11,@09                                          02S0450 00593000
         STH   @11,PRFSIZE(,RPRF)                               02S0450 00594000
*   PRFNBUNT=((TOTOTCNT+AVTHDRSZ)/AVTKEYLE)+ONE;/* SET UNIT     02S0451 00595000
*                                      COUNT@Y17XAU6                 */ 00596000
         LR    @00,@11                                          02S0451 00597000
         SRDA  @00,32                                           02S0451 00598000
         LH    @11,AVTKEYLE(,RAVT)                              02S0451 00599000
         DR    @00,@11                                          02S0451 00600000
         SLR   @11,@11                                          02S0451 00601000
         IC    @11,ONE                                          02S0451 00602000
         ALR   @01,@11                                          02S0451 00603000
         STC   @01,PRFNBUNT(,RPRF)                              02S0451 00604000
*   PRFSTAT1=PRFSTAT1&&PRFSTAT1;    /* CLEAR STATUS BYTE             */ 00605000
         XC    PRFSTAT1(1,RPRF),PRFSTAT1(RPRF)                  02S0452 00606000
*   PRFSCAN=ZERO(1:2);              /* CLEAR SCAN POINTER            */ 00607000
         MVC   PRFSCAN(2,RPRF),ZERO                             02S0453 00608000
*   RTTC=ADDR(TOTWKSPC);            /* SET ADDRESS FOR TCAM/TOTE        00609000
*                                      CONTROL BLOCK STRUCTURE USED     00610000
*                                      TO MAP THE LCB AND SCB   02S0454 00611000
*                                                            @Y17XAU6*/ 00612000
         LR    RTTC,@15                                         02S0454 00613000
*   RSCB=ADDR(TTCSCB);              /* GET ADDRESS OF THE SCB   02S0455 00614000
*                                                            @Y17XAU6*/ 00615000
         LA    RSCB,TTCSCB+40(,RTTC)                            02S0455 00616000
*   IF(QCBREUS=OFF&                 /* ANY                   @OZ31587*/ 00617000
*       QCBNREUS=OFF&               /* NON-TSO               @OZ31587*/ 00618000
*       QCBCORE=OFF)|               /* QUEUES                @OZ31587*/ 00619000
*       QCBTSSES=ON THEN            /* TSO SESSION           @OZ31587*/ 00620000
         TM    QCBREUS(IEDQQPTR),B'01110000'                    02S0456 00621000
         BZ    @RT00456                                         02S0456 00622000
         TM    QCBTSSES(IEDQQPTR),B'10000000'                   02S0456 00623000
         BNO   @RF00456                                         02S0456 00624000
@RT00456 DS    0H                                               02S0457 00625000
*     SCBDESTQ=ADDR(AVTBFRTB);      /* DO NOT SEND MSG       @OZ31587   00626000
*                                      TO TERMINAL           @OZ31587*/ 00627000
         LA    @15,AVTBFRTB(,RAVT)                              02S0457 00628000
         STCM  @15,7,SCBDESTQ(RSCB)                             02S0457 00629000
*   PRFQCBA=SCBDESTQ;               /* SET ADDRESS OF QCB TO WHICH TO   00630000
*                                      POST BUFFER                   */ 00631000
@RF00456 MVC   PRFQCBA(3,RPRF),SCBDESTQ(RSCB)                   02S0458 00632000
*   PRFPRI=PRIDESTQ;                /* SET PRIORITY FOR POST TO 02S0459 00633000
*                                      DESTINATION QCB       @Y17XAU6*/ 00634000
         MVI   PRFPRI(RPRF),X'E4'                               02S0459 00635000
*   IF TOTSRCE=ON THEN              /* CHECK FOR SOURCE REQUEST      */ 00636000
         TM    TOTSRCE(OLTCBPTR),B'00010000'                    02S0460 00637000
         BNO   @RF00460                                         02S0460 00638000
*     DO;                           /*                       @Y17XAUV*/ 00639000
*       PRFDEST=TOTSROFF;           /* SET SOURCE TTCIN AND          */ 00640000
         LH    @15,TOTSROFF(,OLTCBPTR)                          02S0462 00641000
         N     @15,@CF02792                                     02S0462 00642000
         STH   @15,PRFDEST(,RPRF)                               02S0462 00643000
*       IF TRMPREF=ON&              /* 3705 RESOURCE         @YM08138*/ 00644000
*           TRMSNA=ON THEN          /* AND A SNA RESOURCE    @YM08138*/ 00645000
         TM    TRMPREF(RTRM),B'00010000'                        02S0463 00646000
         BNO   @RF00463                                         02S0463 00647000
         TM    TRMSNA(RTRM),B'00000010'                         02S0463 00648000
         BNO   @RF00463                                         02S0463 00649000
*         DO;                                                   02S0464 00650000
*           PRFSRCE=SAVTSCPT;       /* SET SSCP TTCIN        @YM08138*/ 00651000
         L     @15,AVTSAVTP(,RAVT)                              02S0465 00652000
         LH    @15,SAVTSCPT(,@15)                               02S0465 00653000
         N     @15,@CF02792                                     02S0465 00654000
         STH   @15,PRFSRCE(,RPRF)                               02S0465 00655000
*                                                               03S0466 00656000
*           /*********************************************************/ 00657000
*           /*                                                       */ 00658000
*           /* INITHDR.NEGPRFX: THIS SEGMENT BUILDS THE NEGATIVE     */ 00659000
*           /* PREFIX FOR BUFFERS POSTED TO THE SSCP QCB.    @Y17XAUV*/ 00660000
*           /*                                                       */ 00661000
*           /*********************************************************/ 00662000
*                                                               03S0466 00663000
*           PRF1RH=SSCPRH;          /* SET RH                @Y17XAUV*/ 00664000
         LR    @15,RPRF                                         03S0466 00665000
         SL    @15,@CF00045                                     03S0466 00666000
         MVC   PRF1RH(3,@15),@CB02709                           03S0466 00667000
*           PRF1FIDI=ON;            /* FID 1 INDICATOR       @Y17XAUV*/ 00668000
         OI    PRF1FIDI(@15),B'10000000'                        03S0467 00669000
*           PRF1FORM=PRF1PTRI;      /* SET POINTER INDICATOR @Y17XAUV*/ 00670000
         NI    PRF1FORM(@15),B'11011111'                        03S0468 00671000
         OI    PRF1FORM(@15),B'00010000'                        03S0468 00672000
*           PRF1SEQP=ADDR(TOTPRSN); /* SET WITH DUMMY LOCATION FOR      00673000
*                                      SEQ NUM, NOT USED     @ZM47554*/ 00674000
         LA    @11,TOTPRSN(,OLTCBPTR)                           03S0469 00675000
         ST    @11,PRF1SEQP(,@15)                               03S0469 00676000
*         END;                      /*                       @YM08138*/ 00677000
*     END;                          /* SET NEGATIVE PREFIX   @Y17XAUV*/ 00678000
*   ELSE                                                        02S0472 00679000
*     PRFDEST=ENTTTOFF;             /* SET DUMMY TTCIN               */ 00680000
         B     @RC00460                                         02S0472 00681000
@RF00460 LH    @15,ENTTTOFF(,RDEV)                              02S0472 00682000
         N     @15,@CF02792                                     02S0472 00683000
         STH   @15,PRFDEST(,RPRF)                               02S0472 00684000
*   RETADR=TOTWOSV3;                /* RESTORE RETURN ADDRESS        */ 00685000
@RC00460 L     RETADR,TOTWOSV3(,OLTCBPTR)                       02S0473 00686000
*   RFY                                                         02S0474 00687000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 00688000
*   RFY                                                         02S0475 00689000
*     RSCB UNRSTD;                  /*                       @Y17XAU6*/ 00690000
*   RFY                                                         02S0476 00691000
*     RRESPL UNRSTD;                /*                       @Y17XAU6*/ 00692000
*   RFY                                                         02S0477 00693000
*     RLCB UNRSTD;                  /*                       @Y17XAU6*/ 00694000
*   RFY                                                         02S0478 00695000
*     RTTC UNRSTD;                  /*                       @Y17XAU6*/ 00696000
*   RFY                                                         02S0479 00697000
*     IEDQQPTR UNRSTD;              /*                       @OZ31587*/ 00698000
*   END INITHDR;                    /* END INITHDR PROCEDURE         */ 00699000
@EL00005 DS    0H                                               02S0480 00700000
@EF00005 DS    0H                                               02S0480 00701000
@ER00005 BR    @14                                              02S0480 00702000
@PB00005 DS    0H                                               02S0481 00703000
*   GEN(  EJECT);                                               02S0481 00704000
           EJECT                                                        00705000
*                                                               02S0482 00706000
*   /*****************************************************************/ 00707000
*   /*                                                               */ 00708000
*   /* INSERT: THIS INTERNAL PROCEDURE CALLS THE TCAM BUFFER MOVE    */ 00709000
*   /* ROUTINE (IEDMVBFR) TO MOVE THE OUTPUT MESSAGE FROM THE OLTCB  */ 00710000
*   /* INTO THE TCAM BUFFER                                  @Y17XAU6*/ 00711000
*   /*                                                               */ 00712000
*   /*****************************************************************/ 00713000
*                                                               02S0482 00714000
*INSERT:                                                        02S0482 00715000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0482 00716000
         B     @PB00006                                         02S0482 00717000
INSERT   DS    0H                                               02S0483 00718000
*   RFY                                                         02S0483 00719000
*     IEDPLMV BASED(RPARM);         /* RESPECIFY THE BASE OF THE        00720000
*                                      PARAMETER LIST USED BY   02S0483 00721000
*                                      IEDMVBFR TO MOVE THE OUTPUT      00722000
*                                      MESSAGE TO THE TCAM BUFFER       00723000
*                                                            @Y17XAU6*/ 00724000
*   RFY                                                         02S0484 00725000
*     RPARM RSTD;                   /*                       @Y17XAU6*/ 00726000
*   RFY                                                         02S0485 00727000
*     RSAVE RSTD;                   /*                       @Y17XAUV*/ 00728000
*   RFY                                                         02S0486 00729000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 00730000
*   TOTWOSV4=RETADR;                /* SAVE RETURN ADDRESS   @Y17XAU6*/ 00731000
         ST    RETADR,TOTWOSV4(,OLTCBPTR)                       02S0487 00732000
*   RPARM=ADDR(TOTWOWRK);           /* ADDRESSIBILITY TO THE MOVE       00733000
*                                      PARAMETER LIST        @Y17XAU6*/ 00734000
         LA    RPARM,TOTWOWRK(,OLTCBPTR)                        02S0488 00735000
*   PLMVLNTH=TOTOTCNT;              /* SET LENGTH OF DATA TO BE MOVED   00736000
*                                                            @Y17XAU6*/ 00737000
         SLR   @15,@15                                          02S0489 00738000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0489 00739000
         STH   @15,PLMVLNTH(,RPARM)                             02S0489 00740000
*   PLMVTU=RPRF;                    /* ADDRESS OF TCAM BUFFER THAT      00741000
*                                      WILL CONTAIN THE MESSAGE 02S0490 00742000
*                                                            @Y17XAU6*/ 00743000
         ST    RPRF,PLMVTU(,RPARM)                              02S0490 00744000
*   PLMVTD=ADDR(PRFSHDR);           /* LOCATION IN THE BUFFER WHERE     00745000
*                                      THE DATA IS TO BE MOVED  02S0491 00746000
*                                                            @Y17XAU6*/ 00747000
         LA    @15,PRFSHDR(,RPRF)                               02S0491 00748000
         ST    @15,PLMVTD(,RPARM)                               02S0491 00749000
*   PLMVSU=ADDR(TOTOTBUF);          /* ADDRESS OF OUTPUT MESSAGE TO     00750000
*                                      BE MOVED              @Y17XAU6*/ 00751000
         LA    @15,TOTOTBUF(,OLTCBPTR)                          02S0492 00752000
         ST    @15,PLMVSU(,RPARM)                               02S0492 00753000
*   PLMVSD=ADDR(TOTOTBUF);          /* ADDRESS OF OUTPUT MESSAGE TO     00754000
*                                      BE MOVED              @Y17XAU6*/ 00755000
         ST    @15,PLMVSD(,RPARM)                               02S0493 00756000
*   PLMVFLG1=ZERO(1:1);             /* CLEAR FLAGS           @Y17XAU6*/ 00757000
         MVC   PLMVFLG1(1,RPARM),ZERO                           02S0494 00758000
*   PLMVSCTG=ON;                    /* INDICATE THAT THE MESSAGE IS     00759000
*                                      IN A CONTIGUOUS AREA  @Y17XAU6*/ 00760000
         OI    PLMVSCTG(RPARM),B'01000000'                      02S0495 00761000
*   PLMVFLG2=ZERO(1:1);             /* CLEAR FLAGS           @Y17XAU6*/ 00762000
         MVC   PLMVFLG2(1,RPARM),ZERO                           02S0496 00763000
*   RSAVE=ADDR(TOTSAVE2);           /* SET SAVE AREA FOR IEDMVBFR       00764000
*                                                            @YM07336*/ 00765000
         LA    RSAVE,TOTSAVE2(,OLTCBPTR)                        02S0497 00766000
*   CALL IEDMVBFR;                  /* GO PUT MESSAGE INTO TCAM 02S0498 00767000
*                                      BUFFER                @Y17XAU6*/ 00768000
         L     @15,AVTMVBFR(,RAVT)                              02S0498 00769000
         BALR  @14,@15                                          02S0498 00770000
*   RSAVE=ADDR(TOTSAVE6);           /* RESTORE MY SAVE AREA PTR 02S0499 00771000
*                                                            @YM07336*/ 00772000
         LA    RSAVE,TOTSAVE6(,OLTCBPTR)                        02S0499 00773000
*   RETADR=TOTWOSV4;                /* GET RETURN ADDRESS    @Y17XAU6*/ 00774000
         L     RETADR,TOTWOSV4(,OLTCBPTR)                       02S0500 00775000
*   RFY                                                         02S0501 00776000
*     RPARM UNRSTD;                 /*                       @Y17XAU6*/ 00777000
*   RFY                                                         02S0502 00778000
*     RSAVE UNRSTD;                 /*                       @Y17XAUV*/ 00779000
*   RFY                                                         02S0503 00780000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 00781000
*   END INSERT;                     /* END INSERT PROCEDURE          */ 00782000
@EL00006 DS    0H                                               02S0504 00783000
@EF00006 DS    0H                                               02S0504 00784000
@ER00006 BR    @14                                              02S0504 00785000
@PB00006 DS    0H                                               02S0505 00786000
*   GEN(  EJECT);                                               02S0505 00787000
           EJECT                                                        00788000
*                                                               02S0506 00789000
*   /*****************************************************************/ 00790000
*   /*                                                               */ 00791000
*   /* MVMSG: THIS INTERNAL PROCEDURE DETERMINES THE TYPE OF REMOTE  */ 00792000
*   /* DEVICE AND INSERTS THE CORRECT LINE CONTROL CHARACTERS INTO   */ 00793000
*   /* THE OUTPUT MESSAGE                                    @Y17XAU6*/ 00794000
*   /*                                                               */ 00795000
*   /*****************************************************************/ 00796000
*                                                               02S0506 00797000
*MVMSG:                                                         02S0506 00798000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0506 00799000
         B     @PB00007                                         02S0506 00800000
MVMSG    DS    0H                                               02S0507 00801000
*   RFY                                                         02S0507 00802000
*     RLCB RSTD;                                                02S0507 00803000
*   RFY                                                         02S0508 00804000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 00805000
*   RFY                                                         02S0509 00806000
*     RDCT RSTD;                    /*                       @Y17XAU6*/ 00807000
*   RFY                                                         02S0510 00808000
*     RSIB RSTD;                    /*                       @Y17XAUV*/ 00809000
*   RFY                                                         02S0511 00810000
*     RPARM RSTD;                   /*                       @Y17XAU6*/ 00811000
*   TOTWOSV3=RETADR;                /* SAVE RETURN ADDRESS           */ 00812000
         ST    RETADR,TOTWOSV3(,OLTCBPTR)                       02S0512 00813000
*   IF TOTSRCE=ON THEN              /* SOURCE REQUEST                */ 00814000
         TM    TOTSRCE(OLTCBPTR),B'00010000'                    02S0513 00815000
         BNO   @RF00513                                         02S0513 00816000
*     RLCB=TOTSRLCB;                /* GET LCB ADDRESS               */ 00817000
         L     RLCB,TOTSRLCB(,OLTCBPTR)                         02S0514 00818000
*   ELSE                                                        02S0515 00819000
*     RLCB=ENTLCBAD;                /* GET LCB ADDRESS RTRM CONTAINS    00820000
*                                      TTE ADDRESS ON ENTRY          */ 00821000
         B     @RC00513                                         02S0515 00822000
@RF00513 L     RLCB,ENTLCBAD-1(,RDEV)                           02S0515 00823000
         LA    RLCB,0(,RLCB)                                    02S0515 00824000
*   IF TRMPREF=ON&TRMTYPE=TRMLUNT THEN/* 3705 RESOURCE AND LU ENTRY  */ 00825000
@RC00513 TM    TRMPREF(RTRM),B'00010000'                        02S0516 00826000
         BNO   @RF00516                                         02S0516 00827000
         CLI   TRMTYPE(RTRM),X'30'                              02S0516 00828000
         BNE   @RF00516                                         02S0516 00829000
*     DO;                                                       02S0517 00830000
*       IF TOTSRCE=ON THEN          /* SOURCE REQUEST        @YM08138*/ 00831000
         TM    TOTSRCE(OLTCBPTR),B'00010000'                    02S0518 00832000
         BNO   @RF00518                                         02S0518 00833000
*         DO;                       /* YES                   @YM08138*/ 00834000
*           RDCT=AVTCSTCS+(TRMCHCIN-1)*AVTDCTLN;/* DCT ADDRESS  02S0520 00835000
*                                                            @YM08138*/ 00836000
         SLR   @11,@11                                          02S0520 00837000
         IC    @11,TRMCHCIN(,RTRM)                              02S0520 00838000
         BCTR  @11,0                                            02S0520 00839000
         MH    @11,AVTDCTLN(,RAVT)                              02S0520 00840000
         AL    @11,AVTCSTCS(,RAVT)                              02S0520 00841000
         LR    RDCT,@11                                         02S0520 00842000
*           IF DCTL3270=OFF THEN    /* NON 3270              @YM08138*/ 00843000
         TM    DCTL3270(RDCT),B'01000000'                       02S0521 00844000
         BNZ   @RF00521                                         02S0521 00845000
*             DO;                   /* INSERT CONTROL CHARACTER 02S0522 00846000
*                                                            @YM08138*/ 00847000
*               TOTOTBUF(TOTOTCNT+1:TOTOTCNT+1)=CRCHAR;/* INSERT CR     00848000
*                                                            @YM08138*/ 00849000
         SLR   @15,@15                                          02S0523 00850000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0523 00851000
         ALR   @15,OLTCBPTR                                     02S0523 00852000
         MVC   TOTOTBUF(1,@15),CRCHAR                           02S0523 00853000
*               TOTOTCNT=TOTOTCNT+1;/* UPDATE COUNT          @YM08138*/ 00854000
         SLR   @15,@15                                          02S0524 00855000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0524 00856000
         AL    @15,@CF00061                                     02S0524 00857000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          02S0524 00858000
*             END;                  /*                       @YM08138*/ 00859000
*           ELSE                    /* THIS IS 3270          @YM08138*/ 00860000
*             DO;                   /* INSERT 3270 CONTROL      02S0526 00861000
*                                      CHARS@YM08138                 */ 00862000
         B     @RC00521                                         02S0526 00863000
@RF00521 DS    0H                                               02S0527 00864000
*                                                               03S0527 00865000
*               /*****************************************************/ 00866000
*               /*                                                   */ 00867000
*               /* MVMSG.S3270: THIS SEGMENT INSERTS CONTROL         */ 00868000
*               /* CHARACTERS FOR A SNA 3270 INTO THE OUTPUT BUFFER  */ 00869000
*               /* IMMEDIATELY PRECEDING THE MESSAGE.        @YM08138*/ 00870000
*               /*                                                   */ 00871000
*               /*****************************************************/ 00872000
*                                                               03S0527 00873000
*               TOTINBUF=TOTOTBUF;  /* SAVE MESSAGE IN INPUT BUFFER     00874000
*                                                            @YM08138*/ 00875000
         MVC   TOTINBUF(80,OLTCBPTR),TOTOTBUF(OLTCBPTR)         03S0527 00876000
*               TOTOTBUF(1:2)=CNTS3270;/* INSERT WRITE,ERASE CHARS      00877000
*                                                            @YM08138*/ 00878000
         MVC   TOTOTBUF(2,OLTCBPTR),CNTS3270                    03S0528 00879000
*               TOTOTBUF(3:TOTOTCNT+3)=TOTINBUF;/* PLACE MSG AFTER      00880000
*                                      CHARS                 @YM08138*/ 00881000
         SLR   @15,@15                                          03S0529 00882000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0529 00883000
         EX    @15,@SM02799                                     03S0529 00884000
*               TOTOTCNT=TOTOTCNT+LENGTH(CNTS3270);/* UPDATE COUNT      00885000
*                                                            @YM08138*/ 00886000
         AL    @15,@CF00065                                     03S0530 00887000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          03S0530 00888000
*             END;                  /*                       @YM08138*/ 00889000
*           TOTEXIT=ON;             /* SET EXIT FLAG         @YM08138*/ 00890000
@RC00521 L     @15,TOTEXIT(,OLTCBPTR)                           02S0532 00891000
@GL00012 LR    @11,@15                                          02S0532 00892000
         O     @11,@CF02789                                     02S0532 00893000
         CS    @15,@11,TOTEXIT(OLTCBPTR)                        02S0532 00894000
         BNE   @GL00012                                         02S0532 00895000
*           CALL GETBUF;            /* GET A BUFFER          @YM08456*/ 00896000
         BAL   @14,GETBUF                                       02S0533 00897000
*           CALL INSERT;            /*                       @YM08138*/ 00898000
         BAL   @14,INSERT                                       02S0534 00899000
*         END;                      /*                       @YM08138*/ 00900000
*       ELSE                        /*                       @YM08138*/ 00901000
*         DO;                                                   02S0536 00902000
         B     @RC00518                                         02S0536 00903000
@RF00518 DS    0H                                               02S0537 00904000
*           CALL RHPROC;            /* SET UP REQUEST HEADER @Y17XAUV*/ 00905000
         BAL   @14,RHPROC                                       02S0537 00906000
*           CALL GETBUF;            /* GET A BUFFER          @YM08456*/ 00907000
         BAL   @14,GETBUF                                       02S0538 00908000
*           CALL INSERT;            /* INSERT DATA IN BUFFER         */ 00909000
         BAL   @14,INSERT                                       02S0539 00910000
*           TRMTDIFF=OFF;           /* INDICATES CONTROL FLOW FOR       00911000
*                                      TOTE MH USE           @Y17XAUV*/ 00912000
         LA    @09,TRMTDIFF(,RTRM)                              02S0540 00913000
         LR    @06,@09                                          02S0540 00914000
         LA    @15,3                                            02S0540 00915000
         NR    @06,@15                                          02S0540 00916000
         LCR   @06,@06                                          02S0540 00917000
         ALR   @09,@06                                          02S0540 00918000
         L     @15,0(,@09)                                      02S0540 00919000
@GL00013 LR    @11,@15                                          02S0540 00920000
         N     @11,@CB02801+3(@06)                              02S0540 00921000
         CS    @15,@11,0(@09)                                   02S0540 00922000
         BNE   @GL00013                                         02S0540 00923000
*           TOTEXIT=ON;             /* SET EXIT FLAG                 */ 00924000
         L     @15,TOTEXIT(,OLTCBPTR)                           02S0541 00925000
@GL00014 LR    @11,@15                                          02S0541 00926000
         O     @11,@CF02789                                     02S0541 00927000
         CS    @15,@11,TOTEXIT(OLTCBPTR)                        02S0541 00928000
         BNE   @GL00014                                         02S0541 00929000
*         END;                                                  02S0542 00930000
*     END;                                                      02S0543 00931000
*   ELSE                                                        02S0544 00932000
*     DO;                                                       02S0544 00933000
*                                                               02S0544 00934000
         B     @RC00516                                         02S0544 00935000
@RF00516 DS    0H                                               02S0545 00936000
*/* ? IEDDCT REG(RDCT);                                              */ 00937000
*                                                               02S0545 00938000
*       /*************************************************************/ 00939000
*       /*                                                           */ 00940000
*       /* SET UP ADDRESSABILITY TO THE DCT ENTRY                    */ 00941000
*       /*                                                           */ 00942000
*       /*************************************************************/ 00943000
*                                                               02S0545 00944000
*       RDCT=AVTCSTCS+(TRMCHCIN-1)*AVTDCTLN;/* DCT ENTRY ADDRESS     */ 00945000
         SLR   @11,@11                                          02S0545 00946000
         IC    @11,TRMCHCIN(,RTRM)                              02S0545 00947000
         BCTR  @11,0                                            02S0545 00948000
         MH    @11,AVTDCTLN(,RAVT)                              02S0545 00949000
         AL    @11,AVTCSTCS(,RAVT)                              02S0545 00950000
         LR    RDCT,@11                                         02S0545 00951000
*       IF DCT3270=ON THEN                                      02S0546 00952000
         TM    DCT3270(RDCT),B'00000100'                        02S0546 00953000
         BNO   @RF00546                                         02S0546 00954000
*         DO;                                                   02S0547 00955000
*           IF DCTBISYN=ON THEN     /* IF 3270 DEVICE AND BISYNC        00956000
*                                      DEVICE THEN PROCESS A REMOTE     00957000
*                                      3270 REQUEST          @Y17XAU6*/ 00958000
         TM    DCTBISYN(RDCT),B'10000000'                       02S0548 00959000
         BNO   @RF00548                                         02S0548 00960000
*                                                               03S0549 00961000
*             /*******************************************************/ 00962000
*             /*                                                     */ 00963000
*             /* MVMSG.R3270: THIS SEGMENT INSERTS A STX AT THE START*/ 00964000
*             /* OF THE DATA AND INSERTS A BLANK, INSERT CURSOR, ETX */ 00965000
*             /* ,EOT SEQUENCE AT THE END OF THE DATA FOR AN EP      */ 00966000
*             /* REMOTE 3270. A BLANK, INSERT CURSOR IS PUT AT THE   */ 00967000
*             /* END OF THE DATA FOR A REMOTE 3270 ON A 3705 @Y17XAU6*/ 00968000
*             /*                                                     */ 00969000
*             /*******************************************************/ 00970000
*                                                               03S0549 00971000
*             DO;                                               03S0549 00972000
*               IF TRMPREF=ON       /* IF 3270 IS ON A 3705  @Y17XAU6*/ 00973000
*                 THEN                                          03S0550 00974000
         TM    TRMPREF(RTRM),B'00010000'                        03S0550 00975000
         BNO   @RF00550                                         03S0550 00976000
*                 DO;               /* DO THE FOLLOWING              */ 00977000
*                   TOTINBUF=TOTOTBUF;/* OUTPUT DATA TO INPUT AREA   */ 00978000
         MVC   TOTINBUF(80,OLTCBPTR),TOTOTBUF(OLTCBPTR)         03S0552 00979000
*                   TOTOTBUF(1:3)=CNTR3270;/* INSERT CONTROL SEQUENCE*/ 00980000
         MVC   TOTOTBUF(3,OLTCBPTR),CNTR3270                    03S0553 00981000
*                   TOTOTBUF(4:TOTOTCNT+4)=TOTINBUF;/* OUTPUT DATA      00982000
*                                      BACK TO OUTPUT AREA           */ 00983000
         SLR   @15,@15                                          03S0554 00984000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0554 00985000
         EX    @15,@SM02805                                     03S0554 00986000
*                   TOTOTBUF(TOTOTCNT+4:TOTOTCNT+5)=CURSOR;/* INSERT    00987000
*                                      BLANK AND INSERT CURSOR  03S0555 00988000
*                                      COMMAND AT END OF MESSAGE        00989000
*                                                            @Y17XAU6*/ 00990000
         ALR   @15,OLTCBPTR                                     03S0555 00991000
         MVC   TOTOTBUF+3(2,@15),CURSOR                         03S0555 00992000
*                   TOTOTCNT=TOTOTCNT+5;/* INCREMENT DATA OUTPUT        00993000
*                                      COUNT BY 5            @Y17XAU6*/ 00994000
         SLR   @15,@15                                          03S0556 00995000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0556 00996000
         AL    @15,@CF00163                                     03S0556 00997000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          03S0556 00998000
*                 END;                                          03S0557 00999000
*               ELSE                                            03S0558 01000000
*                 DO;                                           03S0558 01001000
         B     @RC00550                                         03S0558 01002000
@RF00550 DS    0H                                               03S0559 01003000
*                   TOTINBUF=TOTOTBUF;/* OUTPUT DATA TO INPUT AREA   */ 01004000
         MVC   TOTINBUF(80,OLTCBPTR),TOTOTBUF(OLTCBPTR)         03S0559 01005000
*                   TOTOTBUF(1:1)=STX;/* INSERT STX IN FIRST BYTE    */ 01006000
         MVC   TOTOTBUF(1,OLTCBPTR),STX                         03S0560 01007000
*                   TOTOTBUF(2:TOTOTCNT+1)=TOTINBUF;/* OUTPUT DATA      01008000
*                                      BACK TO OUTPUT AREA           */ 01009000
         SLR   @15,@15                                          03S0561 01010000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0561 01011000
         LR    @11,@15                                          03S0561 01012000
         BCTR  @11,0                                            03S0561 01013000
         EX    @11,@SM02793                                     03S0561 01014000
*                   TOTOTBUF(TOTOTCNT+1:TOTOTCNT+4)=BSC3270;/* INSERT   01015000
*                                      BISYNCH ENDING CONTROL AT THE    01016000
*                                      END OF THE DATA       @Y17XAU6*/ 01017000
         ALR   @15,OLTCBPTR                                     03S0562 01018000
         MVC   TOTOTBUF(4,@15),BSC3270                          03S0562 01019000
*                   TOTOTCNT=TOTOTCNT+5;/* INCREMENT OUTPUT COUNT BY    01020000
*                                      5                             */ 01021000
         SLR   @15,@15                                          03S0563 01022000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0563 01023000
         AL    @15,@CF00163                                     03S0563 01024000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          03S0563 01025000
*                 END;                                          03S0564 01026000
*             END;                                              03S0565 01027000
*           ELSE                    /* OTHERWISE PROCESS A LOCAL 3270   01028000
*                                      REQUEST               @Y17XAU6*/ 01029000
*                                                               03S0566 01030000
*             /*******************************************************/ 01031000
*             /*                                                     */ 01032000
*             /* MVMSG.L3270: THIS SEGEMENT INSERTS A BLANK AND      */ 01033000
*             /* INSERT CURSOR SEQUENCE AT THE END OF THE DATA FOR A */ 01034000
*             /* LOCAL 3270.                                         */ 01035000
*             /*                                                     */ 01036000
*             /*******************************************************/ 01037000
*                                                               03S0566 01038000
*             DO;                                               03S0566 01039000
         B     @RC00548                                         03S0566 01040000
@RF00548 DS    0H                                               03S0567 01041000
*               TOTOTBUF(TOTOTCNT+1:TOTOTCNT+2)=CURSOR;/* BLANK AND     01042000
*                                      INSERT CURSOR COMMAND INSERTED   01043000
*                                      AT END OF DATA        @Y17XAU6*/ 01044000
         SLR   @15,@15                                          03S0567 01045000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0567 01046000
         ALR   @15,OLTCBPTR                                     03S0567 01047000
         MVC   TOTOTBUF(2,@15),CURSOR                           03S0567 01048000
*               TOTOTCNT=TOTOTCNT+2;/* INCREMENT OUTPUT COUNT        */ 01049000
         SLR   @15,@15                                          03S0568 01050000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0568 01051000
         AL    @15,@CF00065                                     03S0568 01052000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          03S0568 01053000
*             END;                                              03S0569 01054000
*           CALL GETBUF;            /* GET A BUFFER          @YM08456*/ 01055000
@RC00548 BAL   @14,GETBUF                                       02S0570 01056000
*           CALL INSERT;            /* PUT DATA INTO TCAM BUFFER        01057000
*                                                            @Y17XAU6*/ 01058000
         BAL   @14,INSERT                                       02S0571 01059000
*           TOTEXIT=ON;             /* SET EXIT FLAG                 */ 01060000
         L     @15,TOTEXIT(,OLTCBPTR)                           02S0572 01061000
@GL00015 LR    @11,@15                                          02S0572 01062000
         O     @11,@CF02789                                     02S0572 01063000
         CS    @15,@11,TOTEXIT(OLTCBPTR)                        02S0572 01064000
         BNE   @GL00015                                         02S0572 01065000
*         END;                      /*                       @Y17XAU6*/ 01066000
*       IF TOTEXIT=OFF THEN                                     02S0574 01067000
@RF00546 TM    TOTEXIT(OLTCBPTR),B'00010000'                    02S0574 01068000
         BNZ   @RF00574                                         02S0574 01069000
*         IF TRMPREF=ON THEN        /* PROCESSING INCOMPLETE AND 3705   01070000
*                                      RESOURCE                      */ 01071000
         TM    TRMPREF(RTRM),B'00010000'                        02S0575 01072000
         BNO   @RF00575                                         02S0575 01073000
*           DO;                                                 02S0576 01074000
*             TOTOTBUF(TOTOTCNT+1:TOTOTCNT+1)=CRCHAR;/* INSERT CR AT    01075000
*                                      END OF DATA                   */ 01076000
         SLR   @15,@15                                          02S0577 01077000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0577 01078000
         ALR   @15,OLTCBPTR                                     02S0577 01079000
         MVC   TOTOTBUF(1,@15),CRCHAR                           02S0577 01080000
*             TOTOTCNT=TOTOTCNT+ONE;/* INCREMENT OUTPUT COUNT BY 1   */ 01081000
         SLR   @15,@15                                          02S0578 01082000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          02S0578 01083000
         SLR   @11,@11                                          02S0578 01084000
         IC    @11,ONE                                          02S0578 01085000
         ALR   @15,@11                                          02S0578 01086000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          02S0578 01087000
*             CALL GETBUF;          /* GET A BUFFER          @YM08456*/ 01088000
         BAL   @14,GETBUF                                       02S0579 01089000
*             CALL INSERT;          /* PUT DATA IN UNITS             */ 01090000
         BAL   @14,INSERT                                       02S0580 01091000
*             TOTEXIT=ON;           /* SET EXIT FLAG                 */ 01092000
         L     @15,TOTEXIT(,OLTCBPTR)                           02S0581 01093000
@GL00016 LR    @11,@15                                          02S0581 01094000
         O     @11,@CF02789                                     02S0581 01095000
         CS    @15,@11,TOTEXIT(OLTCBPTR)                        02S0581 01096000
         BNE   @GL00016                                         02S0581 01097000
*           END;                                                02S0582 01098000
*       IF TOTEXIT=OFF THEN                                     02S0583 01099000
@RF00575 DS    0H                                               02S0583 01100000
@RF00574 TM    TOTEXIT(OLTCBPTR),B'00010000'                    02S0583 01101000
         BNZ   @RF00583                                         02S0583 01102000
*         IF DCTNOIDL=ON THEN       /* PROCESSING INCOMPLETE AND A      01103000
*                                      2260 REMOTE                   */ 01104000
         TM    DCTNOIDL(RDCT),B'00000010'                       02S0584 01105000
         BNO   @RF00584                                         02S0584 01106000
*           DO;                                                 02S0585 01107000
*             RFY                                               02S0586 01108000
*               RDCT UNRSTD;                                    02S0586 01109000
*             CALL BISYNC;          /* PROCESS REMOTE 2260      02S0587 01110000
*                                      DEPENDENCIES                  */ 01111000
         BAL   @14,BISYNC                                       02S0587 01112000
*             CALL GETBUF;          /* GET A BUFFER          @YM08456*/ 01113000
         BAL   @14,GETBUF                                       02S0588 01114000
*             CALL INSERT;          /* PUT DATA IN UNITS             */ 01115000
         BAL   @14,INSERT                                       02S0589 01116000
*             TOTEXIT=ON;           /* SET EXIT FLAG                 */ 01117000
         L     @15,TOTEXIT(,OLTCBPTR)                           02S0590 01118000
@GL00017 LR    @11,@15                                          02S0590 01119000
         O     @11,@CF02789                                     02S0590 01120000
         CS    @15,@11,TOTEXIT(OLTCBPTR)                        02S0590 01121000
         BNE   @GL00017                                         02S0590 01122000
*           END;                                                02S0591 01123000
*       IF TOTEXIT=OFF THEN                                     02S0592 01124000
@RF00584 DS    0H                                               02S0592 01125000
@RF00583 TM    TOTEXIT(OLTCBPTR),B'00010000'                    02S0592 01126000
         BNZ   @RF00592                                         02S0592 01127000
*         DO;                                                   02S0593 01128000
*           IF LCBSYNC=ON THEN      /* PROCESSING INCOMPLETE AND        01129000
*                                      BISYNC DEVICE         @Y17XAU6*/ 01130000
         TM    LCBSYNC(RLCB),B'00000100'                        02S0594 01131000
         BNO   @RF00594                                         02S0594 01132000
*             CALL BISYNC;          /* PROCESS BISYNC DEPENDENCIES   */ 01133000
         BAL   @14,BISYNC                                       02S0595 01134000
*           ELSE                    /* OTHERWISE, PROCESS NONBISYNC     01135000
*                                      DEPENDENCIES          @Y17XAU6*/ 01136000
*                                                               03S0596 01137000
*             /*******************************************************/ 01138000
*             /*                                                     */ 01139000
*             /* MVMSG.NBISYNC: THIS SEGMENT INSERTS THE REQUIRED    */ 01140000
*             /* LINE CONTROL FOR START/STOP CONTROL TERMINAL OR     */ 01141000
*             /* ALTERNATE PRINTER MESSAGES                  @Y17XAU6*/ 01142000
*             /*                                                     */ 01143000
*             /*******************************************************/ 01144000
*                                                               03S0596 01145000
*             DO;                                               03S0596 01146000
         B     @RC00594                                         03S0596 01147000
@RF00594 DS    0H                                               03S0597 01148000
*               TOTOTBUF(TOTOTCNT+1:TOTOTCNT+2)=SSEND;/* INSERT NEW     01149000
*                                      LINE AND EOT AT END OF OUTPUT    01150000
*                                      DATA                  @Y17XAU6*/ 01151000
         SLR   @15,@15                                          03S0597 01152000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0597 01153000
         ALR   @15,OLTCBPTR                                     03S0597 01154000
         MVC   TOTOTBUF(2,@15),SSEND                            03S0597 01155000
*               TOTOTCNT=TOTOTCNT+2;/* INCREMENT OUTPUT COUNT BY 2   */ 01156000
         SLR   @15,@15                                          03S0598 01157000
         IC    @15,TOTOTCNT(,OLTCBPTR)                          03S0598 01158000
         AL    @15,@CF00065                                     03S0598 01159000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          03S0598 01160000
*             END;                                              03S0599 01161000
*           CALL GETBUF;            /* GET A BUFFER          @YM08456*/ 01162000
@RC00594 BAL   @14,GETBUF                                       02S0600 01163000
*           CALL INSERT;            /* PUT DATA IN UNITS             */ 01164000
         BAL   @14,INSERT                                       02S0601 01165000
*         END;                                                  02S0602 01166000
*     END;                                                      02S0603 01167000
@RF00592 DS    0H                                               02S0604 01168000
*   RETADR=TOTWOSV3;                /* RESTORE RETURN ADDRESS        */ 01169000
@RC00516 L     RETADR,TOTWOSV3(,OLTCBPTR)                       02S0604 01170000
*   RFY                                                         02S0605 01171000
*     RLCB UNRSTD;                                              02S0605 01172000
*   RFY                                                         02S0606 01173000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 01174000
*   RFY                                                         02S0607 01175000
*     RSIB UNRSTD;                  /*                       @Y17XAUV*/ 01176000
*   RFY                                                         02S0608 01177000
*     RDCT UNRSTD;                  /*                       @Y17XAU6*/ 01178000
*   RFY                                                         02S0609 01179000
*     RPARM UNRSTD;                 /*                       @Y17XAU6*/ 01180000
*   END MVMSG;                      /* END MVMSG PROCEDURE           */ 01181000
@EL00007 DS    0H                                               02S0610 01182000
@EF00007 DS    0H                                               02S0610 01183000
@ER00007 BR    @14                                              02S0610 01184000
@PB00007 DS    0H                                               02S0611 01185000
*   GEN(  EJECT);                                               02S0611 01186000
           EJECT                                                        01187000
*                                                               02S0612 01188000
*   /*****************************************************************/ 01189000
*   /*                                                               */ 01190000
*   /* POSTBUF: THIS INTERNAL PROCEDURE POSTS THE BUFFER TO THE      */ 01191000
*   /* DESTINATION QUEUE AND AN ELEMENT WITH A LOWER PRIORITY CHAINED*/ 01192000
*   /* TO IT SO THAT IEDQWO DOES NOT GET CONTROL BACK UNTIL TCAM HAS */ 01193000
*   /* PROCESSED THE OUTPUT BUFFER.                          @Y17XAU6*/ 01194000
*   /*                                                               */ 01195000
*   /*****************************************************************/ 01196000
*                                                               02S0612 01197000
*POSTBUF:                                                       02S0612 01198000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0612 01199000
         B     @PB00008                                         02S0612 01200000
POSTBUF  DS    0H                                               02S0613 01201000
*   RFY                                                         02S0613 01202000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 01203000
*   RFY                                                         02S0614 01204000
*     REG0 RSTD;                    /*                       @Y17XAU6*/ 01205000
*   RFY                                                         02S0615 01206000
*     RPARM RSTD;                   /*                       @Y17XAU6*/ 01207000
*   RFY                                                         02S0616 01208000
*     RRESPL RSTD;                  /*                       @Y17XAU6*/ 01209000
*   RFY                                                         02S0617 01210000
*     RTTC RSTD;                    /*                       @Y17XAU6*/ 01211000
*   RFY                                                         02S0618 01212000
*     RLCB RSTD;                    /*                       @Y17XAU6*/ 01213000
*   TOTWOSV3=RETADR;                /* SAVE RETURN ADDRESS           */ 01214000
         ST    RETADR,TOTWOSV3(,OLTCBPTR)                       02S0619 01215000
*   REG0=ADDR(TOTWAWRK);            /* GET ADDRESS OF WORK AREA TO BE   01216000
*                                      USED BY POST/WAIT ROUTINE        01217000
*                                                            @Y17XAU6*/ 01218000
         LA    REG0,TOTWAWRK(,OLTCBPTR)                         02S0620 01219000
*   RPARM=RPRF;                     /* SET REGISTER 1 TO BUFFER TO BE   01220000
*                                      POSTED                @Y17XAU6*/ 01221000
         LR    RPARM,RPRF                                       02S0621 01222000
*   GEN(ICM RPARM,8,REQKEY);        /* SET ELEMENT KEY IN REG 0 02S0622 01223000
*                                                            @Y17XAU6*/ 01224000
         ICM RPARM,8,REQKEY                                             01225000
*   PRFLINK=ADDR(TOTWOWRK);         /* CHAIN WAITING ELEMENT TO THE     01226000
*                                      BUFFER                @Y17AXU6*/ 01227000
         LA    @15,TOTWOWRK(,OLTCBPTR)                          02S0623 01228000
         STCM  @15,7,PRFLINK(RPRF)                              02S0623 01229000
*   RTTC=ADDR(TOTWAWRK);            /* SET ADDRESS BASE FOR TCAM/TOTE   01230000
*                                      STRUCTURE             @Y17XAU6*/ 01231000
         LA    RTTC,TOTWAWRK(,OLTCBPTR)                         02S0624 01232000
*   REQQCB=ADDR(TTCQCB);            /* SET QCB TO THE QCB USED BY       01233000
*                                      IEDQWA                @Y17XAU6*/ 01234000
         LA    @15,40                                           02S0625 01235000
         ALR   @15,RTTC                                         02S0625 01236000
         ST    @15,REQQCB(,OLTCBPTR)                            02S0625 01237000
*   REQLINK=ZERO;                   /* CLEAR LINK FIELD INDICATING      01238000
*                                      LAST ELEMENT          @Y17XAU6*/ 01239000
         MVC   REQLINK(3,OLTCBPTR),ZERO+1                       02S0626 01240000
*   REQPRI=PRILNSCL;                /* SET PRIORITY TO ONE LEVEL        01241000
*                                      LOWER THAN QCB POST TO   02S0627 01242000
*                                      DESTINATION QCB       @OX21052*/ 01243000
         MVI   REQPRI(OLTCBPTR),X'E3'                           02S0627 01244000
*   RRESPL=TOTRESPL;                /* GET ADDRESS OF RESPL  @Y17XAU6*/ 01245000
         L     RRESPL,TOTRESPL(,OLTCBPTR)                       02S0628 01246000
*   CALL POSTWAIT;                  /* CALL IEDQWA TO POST OUTPUT       01247000
*                                      BUFFER AND REQUEST ELEMENT TO    01248000
*                                      TCAM                  @Y17XAU6*/ 01249000
         L     @15,RESPLRVT(,RRESPL)                            02S0629 01250000
         BALR  @14,@15                                          02S0629 01251000
*   RETADR=TOTWOSV3;                /* RESTORE RETURN ADDRESS        */ 01252000
         L     RETADR,TOTWOSV3(,OLTCBPTR)                       02S0630 01253000
*   RFY                                                         02S0631 01254000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 01255000
*   RFY                                                         02S0632 01256000
*     REG0 UNRSTD;                  /*                       @Y17XAU6*/ 01257000
*   RFY                                                         02S0633 01258000
*     RPARM UNRSTD;                 /*                       @Y17XAU6*/ 01259000
*   RFY                                                         02S0634 01260000
*     RRESPL UNRSTD;                /*                       @Y17XAU6*/ 01261000
*   RFY                                                         02S0635 01262000
*     RTTC UNRSTD;                  /*                       @Y17XAU6*/ 01263000
*   RFY                                                         02S0636 01264000
*     RLCB UNRSTD;                  /*                       @Y17XAU6*/ 01265000
*   END POSTBUF;                    /* END POSTBUF PROCEDURE         */ 01266000
@EL00008 DS    0H                                               02S0637 01267000
@EF00008 DS    0H                                               02S0637 01268000
@ER00008 BR    @14                                              02S0637 01269000
@PB00008 DS    0H                                               02S0638 01270000
*   GEN(   EJECT);                                              02S0638 01271000
            EJECT                                                       01272000
*                                                               02S0639 01273000
*   /*****************************************************************/ 01274000
*   /*                                                               */ 01275000
*   /* PROCESS.RHPROC: THIS SEGMENT SETS UP THE RH FIELDS NECESSARY  */ 01276000
*   /* TO SEND THE MESSAGE TO A SNA LU.                              */ 01277000
*   /*                                                               */ 01278000
*   /*****************************************************************/ 01279000
*                                                               02S0639 01280000
*RHPROC:                                                        02S0639 01281000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0639 01282000
         B     @PB00009                                         02S0639 01283000
RHPROC   DS    0H                                               02S0640 01284000
*   RFY                                                         02S0640 01285000
*     IEDRH BASED(ADDR(TOTOTBUF));  /* START OF OUTPUT BUF   @Y17XAUV*/ 01286000
*   RFY                                                         02S0641 01287000
*     IEDSIBD BASED(RSIB);          /* SESSION INFO. BLOCK   @Y17XAUV*/ 01288000
*   RFY                                                         02S0642 01289000
*     RSIB RSTD;                    /* SIB BASE              @Y17XAUV*/ 01290000
*   RFY                                                         02S0643 01291000
*     RDCT RSTD;                    /* DCT BASE              @Y17XAUV*/ 01292000
*   RFY                                                         02S0644 01293000
*     RRESPL RSTD;                  /* RESPL BASE            @Y17XAUV*/ 01294000
*   RFY                                                         02S0645 01295000
*     RETADR RSTD;                  /* RETURN ADDR           @Y17XAUV*/ 01296000
*   TOTINBUF=TOTOTBUF(1:LENGTH(TOTINBUF));/* SAVE TEMPORARILY   02S0646 01297000
*                                                            @Y17XAUV*/ 01298000
         MVC   TOTINBUF(80,OLTCBPTR),TOTOTBUF(OLTCBPTR)         02S0646 01299000
*   IEDRH=''B;                      /* CLEAR RH              @Y17XAUV*/ 01300000
         XC    IEDRH+844(3,OLTCBPTR),IEDRH+844(OLTCBPTR)        02S0647 01301000
*   TOTOTBUF(LENGTH(IEDRH)+1:MXSNALEN)=TOTINBUF;/* RESTORE CONTENTS     01302000
*                                      OF BUF PAST RH        @Y17XAUV*/ 01303000
         LH    @15,MXSNALEN                                     02S0648 01304000
         LR    @11,@15                                          02S0648 01305000
         SL    @11,@CF00256                                     02S0648 01306000
         EX    @11,@SM02805                                     02S0648 01307000
*   TOTOTCNT=TOTOTCNT+LENGTH(IEDRH);/* UPDATE COUNT          @Y17XAUV*/ 01308000
         LA    @11,3                                            02S0649 01309000
         SLR   @09,@09                                          02S0649 01310000
         IC    @09,TOTOTCNT(,OLTCBPTR)                          02S0649 01311000
         ALR   @11,@09                                          02S0649 01312000
         STC   @11,TOTOTCNT(,OLTCBPTR)                          02S0649 01313000
*   IF TOTOTCNT>MXSNALEN THEN       /* IF COUNT EXCEEDS MAX  @Y17XAUV*/ 01314000
         CR    @11,@15                                          02S0650 01315000
         BNH   @RF00650                                         02S0650 01316000
*     TOTOTCNT=MXSNALEN;            /* SET COUNT TO MAX      @Y17XAUV*/ 01317000
         STC   @15,TOTOTCNT(,OLTCBPTR)                          02S0651 01318000
*   RRESPL=TOTRESPL;                /* ADDR OF RESIDENT PL   @Y17XAUV*/ 01319000
@RF00650 L     RRESPL,TOTRESPL(,OLTCBPTR)                       02S0652 01320000
*   RSIB=TRMSIBPT;                  /* GET 1ST SIB           @Y17XAUV*/ 01321000
         SLR   RSIB,RSIB                                        02S0653 01322000
         ICM   RSIB,7,TRMSIBPT(RTRM)                            02S0653 01323000
*   DO WHILE(SIBINDEX^=SAVTSCPT&SIBINDEX^=RESMHSRC);/* SCAN WHILE NOT   01324000
*                                      SSCP OR TOTE SIB      @Y17XAUV*/ 01325000
         B     @DE00654                                         02S0654 01326000
@DL00654 DS    0H                                               02S0655 01327000
*     RSIB=SIBCHAIN;                /* GET NEXT SIB          @Y17XAUV*/ 01328000
         L     RSIB,SIBCHAIN(,RSIB)                             02S0655 01329000
*   END;                            /*                       @Y17XAUV*/ 01330000
@DE00654 L     @15,AVTSAVTP(,RAVT)                              02S0656 01331000
         CLC   SIBINDEX(2,RSIB),SAVTSCPT(@15)                   02S0656 01332000
         BE    @DC00654                                         02S0656 01333000
         CLC   SIBINDEX(2,RSIB),RESMHSRC(RRESPL)                02S0656 01334000
         BNE   @DL00654                                         02S0656 01335000
@DC00654 DS    0H                                               02S0657 01336000
*   IF SIBINDEX=SAVTSCPT THEN       /* IF SSCP SIB,          @Y17XAUV*/ 01337000
         L     @15,AVTSAVTP(,RAVT)                              02S0657 01338000
         CLC   SIBINDEX(2,RSIB),SAVTSCPT(@15)                   02S0657 01339000
         BNE   @RF00657                                         02S0657 01340000
*     TRHBB=ON;                     /* SET BEGIN BRACKET,    @Y17XAUV*/ 01341000
         OI    TRHBB+844(OLTCBPTR),B'10000000'                  02S0658 01342000
*   ELSE                                                        02S0659 01343000
*     ;                             /* WITHIN BRACKETS       @Y17XAUV*/ 01344000
@RF00657 DS    0H                                               02S0660 01345000
*   RDCT=AVTCSTCS+(TRMCHCIN-1)*AVTDCTLN;/* DCT ENTRY ADDR    @Y17XAUV*/ 01346000
         SLR   @01,@01                                          02S0660 01347000
         IC    @01,TRMCHCIN(,RTRM)                              02S0660 01348000
         BCTR  @01,0                                            02S0660 01349000
         MH    @01,AVTDCTLN(,RAVT)                              02S0660 01350000
         AL    @01,AVTCSTCS(,RAVT)                              02S0660 01351000
         LR    RDCT,@01                                         02S0660 01352000
*   IF TOTREPLY=ON&DCTL3270=OFF THEN/* IF CECOM W/ REPLY & NOT A 3270   01353000
*                                      (3270 IS HDX-CTX)     @Y17XAUV*/ 01354000
         TM    TOTREPLY(OLTCBPTR),B'00100000'                   02S0661 01355000
         BNO   @RF00661                                         02S0661 01356000
         TM    DCTL3270(RDCT),B'01000000'                       02S0661 01357000
         BNZ   @RF00661                                         02S0661 01358000
*     TRHCDI=ON;                    /* SET CHG DIRECTION IND @Y17XAUV*/ 01359000
         OI    TRHCDI+844(OLTCBPTR),B'00100000'                 02S0662 01360000
*   ELSE                                                        02S0663 01361000
*     ;                             /* NO CHG DIRECTION      @Y17XAUV*/ 01362000
@RF00661 DS    0H                                               02S0664 01363000
*   RFY                                                         02S0664 01364000
*     RETADR UNRSTD;                /* RETURN ADDR           @Y17XAUV*/ 01365000
*   RFY                                                         02S0665 01366000
*     RRESPL UNRSTD;                /* RESPL BASE            @Y17XAUV*/ 01367000
*   RFY                                                         02S0666 01368000
*     RDCT UNRSTD;                  /* DCT BASE              @Y17XAUV*/ 01369000
*   RFY                                                         02S0667 01370000
*     RSIB UNRSTD;                  /* SIB BASE              @Y17XAUV*/ 01371000
*   RFY                                                         02S0668 01372000
*     IEDSIBD BASED;                /* BASE AS ON ENTRY      @Y17XAUV*/ 01373000
*   RFY                                                         02S0669 01374000
*     IEDRH BASED;                  /* BASE AS ON ENTRY      @Y17XAUV*/ 01375000
*   END RHPROC;                                                 02S0670 01376000
@EL00009 DS    0H                                               02S0670 01377000
@EF00009 DS    0H                                               02S0670 01378000
@ER00009 BR    @14                                              02S0670 01379000
@PB00009 DS    0H                                               02S0671 01380000
*   GEN(  EJECT);                                               02S0671 01381000
           EJECT                                                        01382000
*                                                               02S0672 01383000
*   /*****************************************************************/ 01384000
*   /*                                                               */ 01385000
*   /* RNPROC: THIS INTERNAL PROCEDURE PROCESSES A REQUEST FOR A     */ 01386000
*   /* CONTROL TERMINAL OR ALTERNATE PRINTER ON A 3705       @Y17XAU6*/ 01387000
*   /*                                                               */ 01388000
*   /*****************************************************************/ 01389000
*                                                               02S0672 01390000
*RNPROC:                                                        02S0672 01391000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0672 01392000
         B     @PB00010                                         02S0672 01393000
RNPROC   DS    0H                                               02S0673 01394000
*   RFY                                                         02S0673 01395000
*     RTNT RSTD;                                                02S0673 01396000
*   RFY                                                         02S0674 01397000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 01398000
*   TOTWOSV2=RETADR;                /* SAVE RETURN ADDRESS           */ 01399000
         ST    RETADR,TOTWOSV2(,OLTCBPTR)                       02S0675 01400000
*   IF TOTCECOM=ON|TOTPRECT=ON      /* CECOM REQUEST OR CT EQU AP    */ 01401000
*     THEN                                                      02S0676 01402000
         TM    TOTCECOM(OLTCBPTR),B'01000000'                   02S0676 01403000
         BO    @RT00676                                         02S0676 01404000
         TM    TOTPRECT(OLTCBPTR),B'00000010'                   02S0676 01405000
         BNO   @RF00676                                         02S0676 01406000
@RT00676 DS    0H                                               02S0677 01407000
*     RDEV=ADDR(TOTCTENT);          /* CT CONTROL AREA               */ 01408000
         LA    RDEV,TOTCTENT(,OLTCBPTR)                         02S0677 01409000
*   ELSE                                                        02S0678 01410000
*     RDEV=ADDR(TOTAPENT);          /* AP CONTROL AREA               */ 01411000
         B     @RC00676                                         02S0678 01412000
@RF00676 LA    RDEV,TOTAPENT(,OLTCBPTR)                         02S0678 01413000
*   RTRM=ENTTNTAD;                  /* TNT ENTRY ADDRES      @YM08523*/ 01414000
@RC00676 L     RTRM,ENTTNTAD(,RDEV)                             02S0679 01415000
*   RTRM=RTRM+TOTTTBEL;             /* GET ADDR OF TTE ADDR  @YM08523*/ 01416000
         SLR   @15,@15                                          02S0680 01417000
         IC    @15,TOTTTBEL(,OLTCBPTR)                          02S0680 01418000
         ALR   RTRM,@15                                         02S0680 01419000
*   RTRM=RTRM->TNTTRMAD;            /* GET TTE ADDRESS       @YM08523*/ 01420000
         SLR   @15,@15                                          02S0681 01421000
         ICM   @15,7,TNTTRMAD(RTRM)                             02S0681 01422000
         LR    RTRM,@15                                         02S0681 01423000
*   RTRM=RTRM-LENGTH(IEDNTRM);      /* POINT TO NEG PREFIX   @YM08523*/ 01424000
         SL    RTRM,@CF02435                                    02S0682 01425000
*   IF TRMPREF=OFF|TRMSNA=OFF THEN  /* IF NOT SNA TERMINAL   @YM08523*/ 01426000
         TM    TRMPREF(RTRM),B'00010000'                        02S0683 01427000
         BZ    @RT00683                                         02S0683 01428000
         TM    TRMSNA(RTRM),B'00000010'                         02S0683 01429000
         BNZ   @RF00683                                         02S0683 01430000
@RT00683 DS    0H                                               02S0684 01431000
*     DO;                           /* START TERMINAL        @YM08523*/ 01432000
*/*      INFORM OP CONTROL TO USE TOTE COUNTERFEIT TTCIN     @YM08136*/ 01433000
*/*      TO COMMUNICATE WITH NCP RESOURCE                    @YM08136*/ 01434000
*                                                               02S0685 01435000
*       TOTOATTC=ON;                /* USE ALTERNATE TTCIN   @YM08136*/ 01436000
         OI    TOTOATTC(OLTCBPTR),B'10000000'                   02S0685 01437000
*       TOTOALTT=ENTTTOFF;          /* SET ALTERNATE TTCIN   @YM08136*/ 01438000
         LH    @15,ENTTTOFF(,RDEV)                              02S0686 01439000
         N     @15,@CF02792                                     02S0686 01440000
         STH   @15,TOTOALTT(,OLTCBPTR)                          02S0686 01441000
*       CALL STARTERM;              /* ACTIVATE TERMINAL             */ 01442000
         BAL   @14,STARTERM                                     02S0687 01443000
*     END;                          /*                       @YM08523*/ 01444000
*   ELSE                                                        02S0689 01445000
*     ;                             /*                       @YM08523*/ 01446000
@RF00683 DS    0H                                               02S0690 01447000
*   CALL SCBBUILD;                  /* SET UP LCB AND SCB    @Y17XAU6*/ 01448000
         BAL   @14,SCBBUILD                                     02S0690 01449000
*   CALL MVMSG;                     /* MOVE MSG TO BUFFER            */ 01450000
         BAL   @14,MVMSG                                        02S0691 01451000
*   CALL INITHDR;                   /* SET UP HEADER PREFIX          */ 01452000
         BAL   @14,INITHDR                                      02S0692 01453000
*   CALL POSTBUF;                   /* POST BUFFER TO DEST. QCB      */ 01454000
         BAL   @14,POSTBUF                                      02S0693 01455000
*   TOTEXIT=ON;                     /* SET EXIT FLAG                 */ 01456000
         L     @15,TOTEXIT(,OLTCBPTR)                           02S0694 01457000
@GL00022 LR    @06,@15                                          02S0694 01458000
         O     @06,@CF02789                                     02S0694 01459000
         CS    @15,@06,TOTEXIT(OLTCBPTR)                        02S0694 01460000
         BNE   @GL00022                                         02S0694 01461000
*   RETADR=TOTWOSV2;                /* RESTORE RETURN ADDRESS        */ 01462000
         L     RETADR,TOTWOSV2(,OLTCBPTR)                       02S0695 01463000
*   RFY                                                         02S0696 01464000
*     RTNT UNRSTD;                                              02S0696 01465000
*   RFY                                                         02S0697 01466000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 01467000
*   END RNPROC;                     /* END RNPROC PROCEDURE          */ 01468000
@EL00010 DS    0H                                               02S0698 01469000
@EF00010 DS    0H                                               02S0698 01470000
@ER00010 BR    @14                                              02S0698 01471000
@PB00010 DS    0H                                               02S0699 01472000
*   GEN(   EJECT);                                              02S0699 01473000
            EJECT                                                       01474000
*                                                               02S0700 01475000
*   /*****************************************************************/ 01476000
*   /*                                                               */ 01477000
*   /* SCBBUILD: THIS INTERNAL PROCEDURE BUILDS THE LCB AND SCB PAIR */ 01478000
*   /* IN THE WORKAREA. INPUT IS REG 2=OLTCB ADDRESS, REG 4=AVT      */ 01479000
*   /* ADDRESS, REG 7=TNT ADDRESS FOR CECOM OR DPRINT REQUEST, REG   */ 01480000
*   /* 8=SOURCE TERMINAL ENTRY ADDRESS@Y17XAU6                       */ 01481000
*   /*                                                               */ 01482000
*   /*****************************************************************/ 01483000
*                                                               02S0700 01484000
*SCBBUILD:                                                      02S0700 01485000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @Y17XAU6*/ 01486000
         B     @PB00011                                         02S0700 01487000
SCBBUILD DS    0H                                               02S0701 01488000
*   RFY                                                         02S0701 01489000
*     RLCB RSTD;                    /* RESPECIFY LCB BASE    @Y17XAU6*/ 01490000
*   RFY                                                         02S0702 01491000
*     RSCB RSTD;                    /* RESPECIFY SCB BASE    @Y17XAU6*/ 01492000
*   RFY                                                         02S0703 01493000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 01494000
*   RFY                                                         02S0704 01495000
*     RTTC RSTD;                    /*                       @Y17XAU6*/ 01496000
*   TOTWOSV3=RETADR;                /* SAVE RETURN ADDRESS           */ 01497000
         ST    RETADR,TOTWOSV3(,OLTCBPTR)                       02S0705 01498000
*   RTTC=ADDR(TOTWKSPC);            /* GET WORK AREA ADDRESS         */ 01499000
         LA    @15,TOTWKSPC(,OLTCBPTR)                          02S0706 01500000
         LR    RTTC,@15                                         02S0706 01501000
*   RLCB=ADDR(TOTWKSPC)-(ADDR(LCBRCQCB)-ADDR(IEDQLCB));/* MAP LCB       01502000
*                                      STRUCTURE ON THE WORKSPACE IN    01503000
*                                      THE OLTCB             @Y17XAU6*/ 01504000
         SL    @15,@CF01746                                     02S0707 01505000
         LR    RLCB,@15                                         02S0707 01506000
*   RSCB=ADDR(TTCSCB);              /* GET ADDRESS BASE FOR SCB FOUND   01507000
*                                      IN THE WORKAREA       @Y17XAU6*/ 01508000
         LA    @15,TTCSCB+40(,RTTC)                             02S0708 01509000
         LR    RSCB,@15                                         02S0708 01510000
*   LCBSCBA=ADDR(TTCSCB);           /* GET SCB ADDRESS       @Y17XAU6*/ 01511000
         STCM  @15,7,LCBSCBA(RLCB)                              02S0709 01512000
*   SCBSTATE=ZERO(1:1);             /* CLEAR STATUS BYTE     @Y17XAU6*/ 01513000
         MVC   SCBSTATE(1,RSCB),ZERO                            02S0710 01514000
*   IF TOTSRCE=ON                   /* SOURCE REQUEST                */ 01515000
*     THEN                                                      02S0711 01516000
         TM    TOTSRCE(OLTCBPTR),B'00010000'                    02S0711 01517000
         BNO   @RF00711                                         02S0711 01518000
*     DO;                           /* YES                           */ 01519000
*       IF TRMPREF=ON&TRMTYPE=TRMLUNT/* LU RESOURCE          @YM08097*/ 01520000
*         THEN                                                  02S0713 01521000
         TM    TRMPREF(RTRM),B'00010000'                        02S0713 01522000
         BNO   @RF00713                                         02S0713 01523000
         CLI   TRMTYPE(RTRM),X'30'                              02S0713 01524000
         BNE   @RF00713                                         02S0713 01525000
*         DO;                       /* YES                           */ 01526000
*           RFY                                                 02S0715 01527000
*             RSAVT RSTD;                                       02S0715 01528000
*           RSAVT=AVTSAVTP;         /* GET SAVT ADDRESS              */ 01529000
         L     @15,AVTSAVTP(,RAVT)                              02S0716 01530000
         LR    RSAVT,@15                                        02S0716 01531000
*           SCBDESTQ=ADDR(SAVTSCPQ);/* POST MSG TO SSCP OUTBOUND QCB    01532000
*                                                            @Y17XAU6*/ 01533000
         LA    @15,SAVTSCPQ(,@15)                               02S0717 01534000
         STCM  @15,7,SCBDESTQ(RSCB)                             02S0717 01535000
*           RFY                                                 02S0718 01536000
*             RSAVT UNRSTD;                                     02S0718 01537000
*         END;                                                  02S0719 01538000
*       ELSE                                                    02S0720 01539000
*         SCBDESTQ=TRMDESTQ;        /* NON-LU SOURCE - POST MSG TO      01540000
*                                      REAL DESTINATION QCB  @Y17XAU6*/ 01541000
         B     @RC00713                                         02S0720 01542000
@RF00713 MVC   SCBDESTQ(3,RSCB),TRMDESTQ(RTRM)                  02S0720 01543000
*     END;                                                      02S0721 01544000
*   ELSE                                                        02S0722 01545000
*     DO;                           /* NON-SOURCE REQUEST            */ 01546000
         B     @RC00711                                         02S0722 01547000
@RF00711 DS    0H                                               02S0723 01548000
*       RTRM=ENTTNTAD;              /* GET TNT ADDRESS               */ 01549000
         L     RTRM,ENTTNTAD(,RDEV)                             02S0723 01550000
*       RTRM=RTRM+TOTTTBEL;         /* GET ADDRESS OF TTE ADDRESS    */ 01551000
         SLR   @15,@15                                          02S0724 01552000
         IC    @15,TOTTTBEL(,OLTCBPTR)                          02S0724 01553000
         ALR   RTRM,@15                                         02S0724 01554000
*       RTRM=RTRM->TNTTRMAD;        /* GET TTE ADDRESS               */ 01555000
         SLR   @15,@15                                          02S0725 01556000
         ICM   @15,7,TNTTRMAD(RTRM)                             02S0725 01557000
         LR    RTRM,@15                                         02S0725 01558000
*       RTRM=RTRM-LENGTH(IEDNTRM);  /* ADJUST TTE BASE               */ 01559000
         SL    RTRM,@CF02435                                    02S0726 01560000
*       SCBDESTQ=TRMDESTQ;          /* POST MSG TO DUMMY QCB @Y17XAU6*/ 01561000
         MVC   SCBDESTQ(3,RSCB),TRMDESTQ(RTRM)                  02S0727 01562000
*     END;                                                      02S0728 01563000
*   RETADR=TOTWOSV3;                /* RESTORE RETURN ADDRESS        */ 01564000
@RC00711 L     RETADR,TOTWOSV3(,OLTCBPTR)                       02S0729 01565000
*   RFY                                                         02S0730 01566000
*     RLCB UNRSTD;                  /*                       @Y17XAU6*/ 01567000
*   RFY                                                         02S0731 01568000
*     RSCB UNRSTD;                  /*                       @Y17XAU6*/ 01569000
*   RFY                                                         02S0732 01570000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 01571000
*   RFY                                                         02S0733 01572000
*     RTTC UNRSTD;                  /*                       @Y17XAU6*/ 01573000
*   END SCBBUILD;                   /* END BFRSETUP PROCEDURE        */ 01574000
@EL00011 DS    0H                                               02S0734 01575000
@EF00011 DS    0H                                               02S0734 01576000
@ER00011 BR    @14                                              02S0734 01577000
@PB00011 DS    0H                                               02S0735 01578000
*   GEN(  EJECT);                                               02S0735 01579000
           EJECT                                                        01580000
*                                                               02S0736 01581000
*   /*****************************************************************/ 01582000
*   /*                                                               */ 01583000
*   /* STARTERM: THIS INTERNAL PROCEDURE BUILDS AN ACTIVATE TERMINAL */ 01584000
*   /* OPERATOR CONTROL REQUEST AND CALLS THE IEDQWA POST/WAIT       */ 01585000
*   /* ROUTINE TO POST THE ELEMENT TO OPERATOR CONTROL       @Y17XAU6*/ 01586000
*   /*                                                               */ 01587000
*   /*****************************************************************/ 01588000
*                                                               02S0736 01589000
*STARTERM:                                                      02S0736 01590000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0736 01591000
         B     @PB00012                                         02S0736 01592000
STARTERM DS    0H                                               02S0737 01593000
*   RFY                                                         02S0737 01594000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 01595000
*   RFY                                                         02S0738 01596000
*     REG0 RSTD;                    /*                       @Y17XAU6*/ 01597000
*   RFY                                                         02S0739 01598000
*     RPARM RSTD;                   /*                       @Y17XAU6*/ 01599000
*   RFY                                                         02S0740 01600000
*     RLCB RSTD;                    /*                       @Y17XAUV*/ 01601000
*   RFY                                                         02S0741 01602000
*     RRESPL RSTD;                  /*                       @Y17XAU6*/ 01603000
*   RFY                                                         02S0742 01604000
*     RTTC RSTD;                    /*                       @Y17XAU6*/ 01605000
*   TOTWOSV3=RETADR;                /* SAVE RETURN ADDRESS           */ 01606000
         ST    RETADR,TOTWOSV3(,OLTCBPTR)                       02S0743 01607000
*   TOTOKEY=ZERO(1:1);              /* CLEAR REQUEST KEY     @Y17XAU6*/ 01608000
         MVC   TOTOKEY(1,OLTCBPTR),ZERO                         02S0744 01609000
*   TOTOQCBA=ADDR(AVTOPCOB);        /* OP CONTROL QCB ADDRESS   02S0745 01610000
*                                                            @Y17XAU6*/ 01611000
         LA    @15,AVTOPCOB(,RAVT)                              02S0745 01612000
         STCM  @15,7,TOTOQCBA(OLTCBPTR)                         02S0745 01613000
*   TOTOPRI=PRISSOLT;               /* SET POST PRIORITY     @Y17XAU6*/ 01614000
         MVI   TOTOPRI(OLTCBPTR),X'DC'                          02S0746 01615000
*   TOTOLINK=ZERO;                  /* CLEAR LINK FIELD      @Y17XAU6*/ 01616000
         MVC   TOTOLINK(3,OLTCBPTR),ZERO                        02S0747 01617000
*   TOTOVBCD=VERBCODE;              /* SET ACTIVATE VERB CODE   02S0748 01618000
*                                                            @Y17XAU6*/ 01619000
         MVC   TOTOVBCD(1,OLTCBPTR),VERBCODE                    02S0748 01620000
*   TOTOELNG=LEN;                   /* LENGTH OF ELEMENT     @Y17XAU6*/ 01621000
         MVC   TOTOELNG(1,OLTCBPTR),LEN                         02S0749 01622000
*   TOTORLN=ENTRLN;                 /* SET UP RLN            @Y17XAU6*/ 01623000
         MVC   TOTORLN(1,OLTCBPTR),ENTRLN(RDEV)                 02S0750 01624000
*   TOTORTCD=ZERO(1:1);             /* CLEAR RETURN CODE     @Y17XAU6*/ 01625000
         MVC   TOTORTCD(1,OLTCBPTR),ZERO                        02S0751 01626000
*   RTTC=ADDR(TOTWAWRK);            /* SET BASE FOR IEDQWA WORKAREA     01627000
*                                                            @Y17XAU6*/ 01628000
         LA    RTTC,TOTWAWRK(,OLTCBPTR)                         02S0752 01629000
*   RPARM=ADDR(TTCQBECB);           /* GET ECB ADDRESS       @YM08136*/ 01630000
         LA    RPARM,TTCQBECB+40(,RTTC)                         02S0753 01631000
*   GEN(STCM RPARM,7,TOTOECBA+1(OLTCBPTR));/* SET ECB ADDRESS   02S0754 01632000
*                                                            @YM08136*/ 01633000
         STCM RPARM,7,TOTOECBA+1(OLTCBPTR)                              01634000
*   TOTOLADR=''B;                   /* BLANK NAME FIELD      @Y17XAU6*/ 01635000
         XC    TOTOLADR(8,OLTCBPTR),TOTOLADR(OLTCBPTR)          02S0755 01636000
*   TOTOLADR=NAME(1:TOTTTBEL);      /* SET RESOURCE NAME     @Y17XAU6*/ 01637000
         MVI   TOTOLADR+1(OLTCBPTR),C' '                        02S0756 01638000
         MVC   TOTOLADR+2(6,OLTCBPTR),TOTOLADR+1(OLTCBPTR)      02S0756 01639000
         SLR   @15,@15                                          02S0756 01640000
         IC    @15,TOTTTBEL(,OLTCBPTR)                          02S0756 01641000
         BCTR  @15,0                                            02S0756 01642000
         L     @11,ENTTNTRA(,RDEV)                              02S0756 01643000
         EX    @15,@SM02808                                     02S0756 01644000
*   REG0=ADDR(TOTWAWRK);            /* SET WORKAREA ADDRESS TO BE       01645000
*                                      USED BY THE POST/WAIT ROUTINE    01646000
*                                                            @Y17XAU6*/ 01647000
         LA    REG0,TOTWAWRK(,OLTCBPTR)                         02S0757 01648000
*   RPARM=ADDR(TOTPLIST);           /* SET OPERATOR CONTROL PARAMETER   01649000
*                                      LIST AS THE ELEMENT TO BE        01650000
*                                      POSTED                @Y17XAU6*/ 01651000
         LA    RPARM,TOTPLIST(,OLTCBPTR)                        02S0758 01652000
*   GEN(ICM RPARM,8,REQKEY);        /* SET REQUEST KEY INDICATING       01653000
*                                      THAT THE THIRD WORD OF THE       01654000
*                                      PARAMTER LIST SHOULD NOT BE      01655000
*                                      CHANGED               @Y17XAU6*/ 01656000
         ICM RPARM,8,REQKEY                                             01657000
*   RRESPL=TOTRESPL;                /* GET ADDRESS OF THE RESPL 02S0760 01658000
*                                                            @Y17XAU6*/ 01659000
         L     RRESPL,TOTRESPL(,OLTCBPTR)                       02S0760 01660000
*   CALL POSTWAIT;                  /* POST OPERATOR CONTROL REQUEST    01661000
*                                      VIA IEDQWA            @Y17XAU6*/ 01662000
         L     @15,RESPLRVT(,RRESPL)                            02S0761 01663000
         BALR  @14,@15                                          02S0761 01664000
*   TOTOATTC=OFF;                   /* RESET ALT TTCIN FLAG  @YM08136*/ 01665000
         NI    TOTOATTC(OLTCBPTR),B'01111111'                   02S0762 01666000
*   RETADR=TOTWOSV3;                /* RESTORE RETURN ADDRESS        */ 01667000
         L     RETADR,TOTWOSV3(,OLTCBPTR)                       02S0763 01668000
*   RFY                                                         02S0764 01669000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 01670000
*   RFY                                                         02S0765 01671000
*     REG0 UNRSTD;                  /*                       @Y17XAU6*/ 01672000
*   RFY                                                         02S0766 01673000
*     RPARM UNRSTD;                 /*                       @Y17XAU6*/ 01674000
*   RFY                                                         02S0767 01675000
*     RLCB UNRSTD;                  /*                       @Y17XAUV*/ 01676000
*   RFY                                                         02S0768 01677000
*     RRESPL UNRSTD;                /*                       @Y17XAU6*/ 01678000
*   RFY                                                         02S0769 01679000
*     RTTC UNRSTD;                  /*                       @Y17XAU6*/ 01680000
*   END STARTERM;                   /* END STARTERM PROCEDURE        */ 01681000
@EL00012 DS    0H                                               02S0770 01682000
@EF00012 DS    0H                                               02S0770 01683000
@ER00012 BR    @14                                              02S0770 01684000
@PB00012 DS    0H                                               02S0771 01685000
*   GEN(  EJECT);                                               02S0771 01686000
           EJECT                                                        01687000
*                                                               02S0772 01688000
*   /*****************************************************************/ 01689000
*   /*                                                               */ 01690000
*   /* SYSCON: THIS INTERNAL PROCEDURE IS CALLED TO PROCESS A MESSAGE*/ 01691000
*   /* IF THE CONTROL TERMINAL OR ALTERNATE PRINTER IS THE SYSTEM    */ 01692000
*   /* CONSOLE. IF A CECOM WITH REPLY IS REQUESTED, A WTOR IS ISSUED.*/ 01693000
*   /* OTHERWISE A WTO IS ISSUED                             @Y17XAU6*/ 01694000
*   /*                                                               */ 01695000
*   /*****************************************************************/ 01696000
*                                                               02S0772 01697000
*SYSCON:                                                        02S0772 01698000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0772 01699000
         B     @PB00013                                         02S0772 01700000
SYSCON   DS    0H                                               02S0773 01701000
*   RFY                                                         02S0773 01702000
*     REG9 RSTD;                                                02S0773 01703000
*   RFY                                                         02S0774 01704000
*     RETADR RSTD;                  /*                       @Y17XAU6*/ 01705000
*   RFY                                                         02S0775 01706000
*     RPARM RSTD;                   /*                       @Y17XAU6*/ 01707000
*   TOTWOSV2=RETADR;                /* SAVE RETURN ADDRESS           */ 01708000
         ST    RETADR,TOTWOSV2(,OLTCBPTR)                       02S0776 01709000
*   TOTINBUF='';                    /* BLANK OUT INPUT BUFFER        */ 01710000
         MVI   TOTINBUF(OLTCBPTR),C' '                          02S0777 01711000
         MVC   TOTINBUF+1(79,OLTCBPTR),TOTINBUF(OLTCBPTR)       02S0777 01712000
*   REG9=TOTOTCNT;                  /* GET OUTPUT COUNT              */ 01713000
         SLR   REG9,REG9                                        02S0778 01714000
         IC    REG9,TOTOTCNT(,OLTCBPTR)                         02S0778 01715000
*   REG9=REG9+WTOPLST;              /* ADD WTO CTL AREA SIZE         */ 01716000
         LH    @15,WTOPLST                                      02S0779 01717000
         ALR   REG9,@15                                         02S0779 01718000
*   TOTOTCNT=REG9;                  /* ADJUST OUTPUT COUNT           */ 01719000
         STC   REG9,TOTOTCNT(,OLTCBPTR)                         02S0780 01720000
*   IF TOTREPLY=ON THEN             /* REPLY EXPECTED                */ 01721000
         TM    TOTREPLY(OLTCBPTR),B'00100000'                   02S0781 01722000
         BNO   @RF00781                                         02S0781 01723000
*     DO;                           /* YES - PROCESS WTOR            */ 01724000
*       TOTOTECB=TOTOTECB&&TOTOTECB;/* CLEAR ECB                     */ 01725000
         XC    TOTOTECB(4,OLTCBPTR),TOTOTECB(OLTCBPTR)          02S0783 01726000
*       RETADR=ADDR(TOTOTBUF)-WTOPLST;/* CALCULATE WHERE TO BLD 02S0784 01727000
*                                                            @YM07362*/ 01728000
         LA    RETADR,TOTOTBUF(,OLTCBPTR)                       02S0784 01729000
         SLR   RETADR,@15                                       02S0784 01730000
*       REG9=REG9+RETADR;           /* WTOR CONTROL FLAGS    @YM07362*/ 01731000
         ALR   REG9,RETADR                                      02S0785 01732000
*       RPARM=ADDR(TOTINCNT);       /* SET WTOR PLIST ADDRESS   02S0786 01733000
*                                                            @YM07362*/ 01734000
         LA    RPARM,TOTINCNT(,OLTCBPTR)                        02S0786 01735000
*       GENERATE REFS(1,REG9) SEQFLOW;                          02S0787 01736000
         USING TOTOLTCB,OLTCBPTR  RESPECIFY OLTCB BASE         @YM07379 01737000
         MVC   0(4,REG9),CDE102   SET CONTROL FLAGS            @YM07362 01738000
         WTOR  ,TOTINBUF,X'50',TOTOTECB,MF=(E,(1)),ROUTCDE=10,DESC=2    01739000
         WAIT  1,ECB=TOTOTECB      WAIT FOR REPLY                       01740000
         DROP  OLTCBPTR                                        @YM07379 01741000
*     END;                                                      02S0788 01742000
*   ELSE                                                        02S0789 01743000
*     DO;                                                       02S0789 01744000
         B     @RC00781                                         02S0789 01745000
@RF00781 DS    0H                                               02S0790 01746000
*       RPARM=ADDR(TOTOTCNT)-1;     /* WTO PLIST ADDRESS     @Y17XAU6*/ 01747000
         LA    RPARM,TOTOTCNT(,OLTCBPTR)                        02S0790 01748000
         BCTR  RPARM,0                                          02S0790 01749000
*       RETADR=ADDR(TOTOTBUF)-WTOPLST;/* CALCULATE WHERE TO BLD 02S0791 01750000
*                                                            @YM07362*/ 01751000
         LA    RETADR,TOTOTBUF(,OLTCBPTR)                       02S0791 01752000
         SH    RETADR,WTOPLST                                   02S0791 01753000
*       REG9=REG9+RETADR;           /* WTO FLAG BYTES        @YM07362*/ 01754000
         ALR   REG9,RETADR                                      02S0792 01755000
*       GENERATE REFS(1,REG9) SEQFLOW;                          02S0793 01756000
         MVC   0(4,REG9),CDE107   SET WTO FLAG BYTES           @YM07362 01757000
         WTO   MF=(E,(1)),ROUTCDE=10,DESC=7                             01758000
*     END;                                                      02S0794 01759000
*   TOTEXIT=ON;                     /* SET EXIT FLAG                 */ 01760000
@RC00781 L     @15,TOTEXIT(,OLTCBPTR)                           02S0795 01761000
@GL00024 LR    @06,@15                                          02S0795 01762000
         O     @06,@CF02789                                     02S0795 01763000
         CS    @15,@06,TOTEXIT(OLTCBPTR)                        02S0795 01764000
         BNE   @GL00024                                         02S0795 01765000
*   RETADR=TOTWOSV2;                /* RESTORE RETURN ADDRESS        */ 01766000
         L     RETADR,TOTWOSV2(,OLTCBPTR)                       02S0796 01767000
*   RFY                                                         02S0797 01768000
*     REG9 UNRSTD;                                              02S0797 01769000
*   RFY                                                         02S0798 01770000
*     RETADR UNRSTD;                /*                       @Y17XAU6*/ 01771000
*   RFY                                                         02S0799 01772000
*     RPARM UNRSTD;                 /*                       @Y17XAU6*/ 01773000
*   END SYSCON;                     /* END SYSCON PROCEDURE          */ 01774000
@EL00013 DS    0H                                               02S0800 01775000
@EF00013 DS    0H                                               02S0800 01776000
@ER00013 BR    @14                                              02S0800 01777000
@PB00013 DS    0H                                               02S0801 01778000
*   GEN(  EJECT);                                               02S0801 01779000
           EJECT                                                        01780000
*                                                               02S0802 01781000
*   /*****************************************************************/ 01782000
*   /*                                                               */ 01783000
*   /* SYNAD: THIS INTERNAL PROCEDURE IS GIVEN CONTROL BY THE SYSTEM */ 01784000
*   /* IF AN ERROR OCCURS WHILE WRITING A DPRINT TO THE SYSTEM OUTPUT*/ 01785000
*   /* DEVICE                                                @Y17XAU6*/ 01786000
*   /*                                                               */ 01787000
*   /*****************************************************************/ 01788000
*                                                               02S0802 01789000
*SYNAD:                                                         02S0802 01790000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0802 01791000
         B     @PB00014                                         02S0802 01792000
SYNAD    DS    0H                                               02S0803 01793000
*   RFY                                                         02S0803 01794000
*     RETCDE RSTD;                                              02S0803 01795000
*   RETCDE=RETCDE&&RETCDE;          /* CLEAR RETURN CODE             */ 01796000
         XR    RETCDE,RETCDE                                    02S0804 01797000
*   RFY                                                         02S0805 01798000
*     RETCDE UNRSTD;                                            02S0805 01799000
*   END SYNAD;                      /* END SYNAD PROCEDURE           */ 01800000
@EL00014 DS    0H                                               02S0806 01801000
@EF00014 DS    0H                                               02S0806 01802000
@ER00014 BR    @14                                              02S0806 01803000
@PB00014 DS    0H                                               02S0807 01804000
*   GEN(  EJECT);                                               02S0807 01805000
           EJECT                                                        01806000
*   END IEDQWO                      /* END OF IEDQWO PROCEDURE       */ 01807000
*                                                               01S0808 01808000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01809000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 01810000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 01811000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 01812000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 01813000
*/*%INCLUDE SYSLIB  (TDCTD   )                                       */ 01814000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 01815000
*/*%INCLUDE SYSLIB  (OLTCB   )                                       */ 01816000
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */ 01817000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 01818000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01819000
*/*%INCLUDE SYSLIB  (RESPL   )                                       */ 01820000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 01821000
*/*%INCLUDE SYSLIB  (TSCBD   )                                       */ 01822000
*/*%INCLUDE SYSLIB  (TSIBD   )                                       */ 01823000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 01824000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01825000
*/*%INCLUDE SYSLIB  (TTTCD   )                                       */ 01826000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 01827000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 01828000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 01829000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 01830000
*/*%INCLUDE SYSUT5  (CECOM   )                                       */ 01831000
*/*%INCLUDE SYSUT5  (DPRINT  )                                       */ 01832000
*/*%INCLUDE SYSUT5  (SYSOUT  )                                       */ 01833000
*/*%INCLUDE SYSUT5  (SOURCE  )                                       */ 01834000
*/*%INCLUDE SYSUT5  (RNSRC   )                                       */ 01835000
*/*%INCLUDE SYSUT5  (EPLSRC  )                                       */ 01836000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 01837000
*/*%INCLUDE SYSUT5  (BISYNC  )                                       */ 01838000
*/*%INCLUDE SYSUT5  (EPLPROC )                                       */ 01839000
*/*%INCLUDE SYSUT5  (GETBUF  )                                       */ 01840000
*/*%INCLUDE SYSUT5  (INITHDR )                                       */ 01841000
*/*%INCLUDE SYSUT5  (NEGPRFX )                                       */ 01842000
*/*%INCLUDE SYSUT5  (INSERT  )                                       */ 01843000
*/*%INCLUDE SYSUT5  (MVMSG   )                                       */ 01844000
*/*%INCLUDE SYSUT5  (S3270   )                                       */ 01845000
*/*%INCLUDE SYSUT5  (R3270   )                                       */ 01846000
*/*%INCLUDE SYSUT5  (L3270   )                                       */ 01847000
*/*%INCLUDE SYSUT5  (NBISYNC )                                       */ 01848000
*/*%INCLUDE SYSUT5  (POSTBUF )                                       */ 01849000
*/*%INCLUDE SYSUT5  (RHPROC  )                                       */ 01850000
*/*%INCLUDE SYSUT5  (RNPROC  )                                       */ 01851000
*/*%INCLUDE SYSUT5  (SCBBUILD)                                       */ 01852000
*/*%INCLUDE SYSUT5  (STARTERM)                                       */ 01853000
*/*%INCLUDE SYSUT5  (SYSCON  )                                       */ 01854000
*/*%INCLUDE SYSUT5  (SYNAD   )                                       */ 01855000
*                                                               01S0808 01856000
*       ;                                                       01S0808 01857000
@EL00001 DS    0H                                               01S0808 01858000
@EF00001 DS    0H                                               01S0808 01859000
@ER00001 BR    @14                                              01S0808 01860000
@DATA    DS    0H                                                       01861000
@SM02793 MVC   TOTOTBUF+1(0,OLTCBPTR),TOTINBUF(OLTCBPTR)                01862000
@SM02799 MVC   TOTOTBUF+2(0,OLTCBPTR),TOTINBUF(OLTCBPTR)                01863000
@SM02805 MVC   TOTOTBUF+3(0,OLTCBPTR),TOTINBUF(OLTCBPTR)                01864000
@SM02808 MVC   TOTOLADR(0,OLTCBPTR),NAME(@11)                           01865000
@DATD    DSECT                                                          01866000
         DS    0F                                                       01867000
IEDQWO   CSECT                                                          01868000
         DS    0F                                                       01869000
@CF00061 DC    F'1'                                                     01870000
@CF00065 DC    F'2'                                                     01871000
@CF00256 DC    F'4'                                                     01872000
@CF00163 DC    F'5'                                                     01873000
@CF00045 DC    F'8'                                                     01874000
@CF02435 DC    F'14'                                                    01875000
@CF01746 DC    F'56'                                                    01876000
@CF02792 DC    XL4'0000FFFF'                                            01877000
@CF02785 DC    BL4'11101111111111111111111111111111'                    01878000
@CF02789 DC    BL4'00010000000000000000000000000000'                    01879000
@DATD    DSECT                                                          01880000
         DS    0D                                                       01881000
@ENDDATD EQU   *                                                        01882000
IEDQWO   CSECT                                                          01883000
         NOPR  ((@ENDDATD-@DATD)*16)                                    01884000
         DS    0F                                                       01885000
@SIZDATD DC    AL1(0)                                                   01886000
         DC    AL3(@ENDDATD-@DATD)                                      01887000
         DS    0D                                                       01888000
WTOPLST  DC    XL2'04'                                                  01889000
MXSNALEN DC    AL2(80+3)                                                01890000
ONE      DC    AL1(1)                                                   01891000
@CB02709 DC    X'038000'                                                01892000
@CB02801 DC    B'111111111111111111111111111011111111111111111111111111C01893000
               11'                                                      01894000
ZERO     DC    X'00000000'                                              01895000
VERBCODE DC    X'46'                                                    01896000
LEN      DC    X'18'                                                    01897000
STX      DC    X'02'                                                    01898000
MSGEND   DC    X'150337'                                                01899000
CNTS3270 DC    X'F5C2'                                                  01900000
SSEND    DC    X'1537'                                                  01901000
CURSOR   DC    X'4013'                                                  01902000
CNTR3270 DC    X'27F13F'                                                01903000
BSC3270  DC    X'40130337'                                              01904000
CRCHAR   DC    X'15'                                                    01905000
REQKEY   DC    X'E0'                                                    01906000
CDE102   DC    X'02000002'                                              01907000
CDE107   DC    X'02000040'                                              01908000
PRINTER  DC    X'48'                                                    01909000
         DS    CL1                                                      01910000
PATCH    DC    XL50'0'                                                  01911000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01912000
@01      EQU   01                                                       01913000
@02      EQU   02                                                       01914000
@03      EQU   03                                                       01915000
@04      EQU   04                                                       01916000
@05      EQU   05                                                       01917000
@06      EQU   06                                                       01918000
@07      EQU   07                                                       01919000
@08      EQU   08                                                       01920000
@09      EQU   09                                                       01921000
@10      EQU   10                                                       01922000
@11      EQU   11                                                       01923000
@12      EQU   12                                                       01924000
@13      EQU   13                                                       01925000
@14      EQU   14                                                       01926000
@15      EQU   15                                                       01927000
IEDQQPTR EQU   @07                                                      01928000
LCBXPTR  EQU   @05                                                      01929000
OLTCBPTR EQU   @02                                                      01930000
RTRM     EQU   @08                                                      01931000
RAVT     EQU   @04                                                      01932000
RTNT     EQU   @09                                                      01933000
RDCB     EQU   @10                                                      01934000
RLCB     EQU   @03                                                      01935000
RPRF     EQU   @05                                                      01936000
RSCB     EQU   @06                                                      01937000
RRESPL   EQU   @06                                                      01938000
RDCT     EQU   @10                                                      01939000
RTTC     EQU   @10                                                      01940000
REG0     EQU   @00                                                      01941000
RPARM    EQU   @01                                                      01942000
REG6     EQU   @06                                                      01943000
RDEV     EQU   @07                                                      01944000
REG7     EQU   @07                                                      01945000
REG9     EQU   @09                                                      01946000
RSIB     EQU   @10                                                      01947000
RSAVT    EQU   @10                                                      01948000
RBASE    EQU   @12                                                      01949000
RSAVE    EQU   @13                                                      01950000
RETADR   EQU   @14                                                      01951000
RETCDE   EQU   @15                                                      01952000
RENTRY   EQU   @15                                                      01953000
REG11    EQU   @11                                                      01954000
IEDQAVTD EQU   0                                                        01955000
AVTSAVEX EQU   IEDQAVTD+288                                             01956000
AVTCSTCS EQU   IEDQAVTD+328                                             01957000
AVTREADD EQU   IEDQAVTD+380                                             01958000
AVTBUFSW EQU   IEDQAVTD+384                                             01959000
@NM00004 EQU   IEDQAVTD+388                                             01960000
AVTCKFLG EQU   @NM00004                                                 01961000
AVTBASE  EQU   IEDQAVTD+412                                             01962000
AVTPKF   EQU   AVTBASE                                                  01963000
AVTRNMPT EQU   IEDQAVTD+424                                             01964000
AVTMVBFR EQU   IEDQAVTD+444                                             01965000
AVTOSECB EQU   IEDQAVTD+492                                             01966000
AVTECB1  EQU   AVTOSECB                                                 01967000
AVTHG02  EQU   IEDQAVTD+528                                             01968000
AVTDISP  EQU   IEDQAVTD+552                                             01969000
AVTHD    EQU   IEDQAVTD+556                                             01970000
AVTSCOPT EQU   AVTHD                                                    01971000
AVTSAVTP EQU   IEDQAVTD+612                                             01972000
AVTSAVTF EQU   AVTSAVTP                                                 01973000
AVTCKPEL EQU   IEDQAVTD+652                                             01974000
AVTCKRMV EQU   AVTCKPEL                                                 01975000
AVTCKELF EQU   IEDQAVTD+680                                             01976000
AVTCKBYT EQU   IEDQAVTD+691                                             01977000
AVTHG01  EQU   IEDQAVTD+692                                             01978000
AVTCKLNK EQU   IEDQAVTD+696                                             01979000
AVTCRELE EQU   IEDQAVTD+708                                             01980000
AVTCCELE EQU   AVTCRELE                                                 01981000
AVTCLRHI EQU   IEDQAVTD+716                                             01982000
AVTADBUF EQU   IEDQAVTD+720                                             01983000
AVTSYSER EQU   IEDQAVTD+728                                             01984000
AVTBFRFG EQU   IEDQAVTD+784                                             01985000
AVTBFRTB EQU   IEDQAVTD+792                                             01986000
AVTCKPQB EQU   IEDQAVTD+804                                             01987000
AVTCKPTB EQU   AVTCKPQB                                                 01988000
AVTCKPEC EQU   AVTCKPQB+4                                               01989000
AVTCKPCC EQU   AVTCKPEC                                                 01990000
AVTOPCQB EQU   IEDQAVTD+816                                             01991000
AVTOPCOB EQU   AVTOPCQB                                                 01992000
AVTOPCEC EQU   AVTOPCQB+4                                               01993000
AVTOPCCC EQU   AVTOPCEC                                                 01994000
AVTOLTQB EQU   IEDQAVTD+828                                             01995000
AVTCWFL1 EQU   IEDQAVTD+924                                             01996000
AVTCWFL2 EQU   IEDQAVTD+925                                             01997000
AVTSUBT  EQU   IEDQAVTD+948                                             01998000
AVTIOTR  EQU   IEDQAVTD+949                                             01999000
AVTKEYLE EQU   IEDQAVTD+1032                                            02000000
AVTBIT1  EQU   IEDQAVTD+1050                                            02001000
AVTBIT2  EQU   IEDQAVTD+1051                                            02002000
AVTBIT3  EQU   IEDQAVTD+1052                                            02003000
AVTDCTLN EQU   IEDQAVTD+1072                                            02004000
AVTBIT4  EQU   IEDQAVTD+1136                                            02005000
@NM00086 EQU   IEDQAVTD+1232                                            02006000
IEDQAPTR EQU   0                                                        02007000
IEDNSVTD EQU   0                                                        02008000
SAVTDIAG EQU   IEDNSVTD                                                 02009000
SAVTDIAF EQU   SAVTDIAG                                                 02010000
SAVTLUSQ EQU   IEDNSVTD+88                                              02011000
SAVTSCPQ EQU   IEDNSVTD+108                                             02012000
SAVTTCPU EQU   IEDNSVTD+238                                             02013000
SAVTSCPT EQU   SAVTTCPU                                                 02014000
SAVTZELM EQU   IEDNSVTD+270                                             02015000
SAVTRDRV EQU   IEDNSVTD+284                                             02016000
SAVTCKQB EQU   IEDNSVTD+300                                             02017000
SAVTCKTB EQU   SAVTCKQB                                                 02018000
SAVTCKEC EQU   SAVTCKQB+4                                               02019000
SAVTCKCC EQU   SAVTCKEC                                                 02020000
IEDQQCB  EQU   0                                                        02021000
QCBDSFLG EQU   IEDQQCB                                                  02022000
QCBCORE  EQU   QCBDSFLG                                                 02023000
QCBDISK  EQU   QCBDSFLG                                                 02024000
QCBNREUS EQU   QCBDISK                                                  02025000
QCBREUS  EQU   QCBDISK                                                  02026000
QCBELCHN EQU   IEDQQCB+1                                                02027000
QCBEOLDT EQU   IEDQQCB+16                                               02028000
QCBBYTE1 EQU   QCBEOLDT+1                                               02029000
QCBLKRLN EQU   IEDQQCB+18                                               02030000
QCBRETCT EQU   QCBLKRLN                                                 02031000
QCBSTAT  EQU   IEDQQCB+19                                               02032000
QCBINSRC EQU   IEDQQCB+21                                               02033000
@NM00110 EQU   QCBINSRC                                                 02034000
QCBTSOF2 EQU   @NM00110+1                                               02035000
QCBTSOF1 EQU   @NM00110+2                                               02036000
QCBINTVL EQU   IEDQQCB+24                                               02037000
QCBPREN  EQU   IEDQQCB+28                                               02038000
QCBLKRRN EQU   QCBPREN+1                                                02039000
QCBDCBAD EQU   IEDQQCB+33                                               02040000
QCBFLAG  EQU   IEDQQCB+36                                               02041000
QCBTSSES EQU   QCBFLAG                                                  02042000
IEDQPQCB EQU   0                                                        02043000
QCBFHDLZ EQU   IEDQPQCB+3                                               02044000
QCBPFEFO EQU   QCBFHDLZ+1                                               02045000
QCBFHDTZ EQU   IEDQPQCB+6                                               02046000
QCBINTLF EQU   IEDQPQCB+12                                              02047000
IEDNQCB  EQU   0                                                        02048000
QCBSTAT1 EQU   IEDNQCB+4                                                02049000
QCBPLCBA EQU   IEDNQCB+5                                                02050000
IHADCB   EQU   0                                                        02051000
DCBPTR   EQU   0                                                        02052000
IHADCS11 EQU   0                                                        02053000
DCBRELB  EQU   IHADCS11                                                 02054000
DCBREL   EQU   DCBRELB+1                                                02055000
DCBDEVT  EQU   DCBREL                                                   02056000
DCBBUFCB EQU   IHADCS11+4                                               02057000
DCBDSORG EQU   IHADCS11+10                                              02058000
DCBDSRG1 EQU   DCBDSORG                                                 02059000
DCBDSRG2 EQU   DCBDSORG+1                                               02060000
DCBIOBAD EQU   IHADCS11+12                                              02061000
DCBODEB  EQU   DCBIOBAD                                                 02062000
DCBLNP   EQU   DCBODEB                                                  02063000
DCBQSLM  EQU   DCBLNP                                                   02064000
DCBIOBAA EQU   DCBODEB+1                                                02065000
IHADCS50 EQU   0                                                        02066000
DCBSVCXL EQU   IHADCS50                                                 02067000
DCBEODAD EQU   IHADCS50+4                                               02068000
DCBBFALN EQU   DCBEODAD                                                 02069000
DCBHIARC EQU   DCBBFALN                                                 02070000
DCBBFTEK EQU   DCBHIARC                                                 02071000
DCBBFT   EQU   DCBBFTEK                                                 02072000
DCBEXLST EQU   IHADCS50+8                                               02073000
DCBRECFM EQU   DCBEXLST                                                 02074000
DCBRECLA EQU   DCBRECFM                                                 02075000
IHADCS24 EQU   0                                                        02076000
DCBOFLGS EQU   IHADCS24+8                                               02077000
DCBOFLWR EQU   DCBOFLGS                                                 02078000
DCBIFLG  EQU   IHADCS24+9                                               02079000
DCBIBPCT EQU   DCBIFLG                                                  02080000
DCBMACR  EQU   IHADCS24+10                                              02081000
DCBMACR1 EQU   DCBMACR                                                  02082000
DCBMRFE  EQU   DCBMACR1                                                 02083000
DCBMRGET EQU   DCBMRFE                                                  02084000
DCBMRAPG EQU   DCBMACR1                                                 02085000
DCBMRRD  EQU   DCBMRAPG                                                 02086000
DCBMRCI  EQU   DCBMACR1                                                 02087000
DCBMRMVG EQU   DCBMRCI                                                  02088000
DCBMRLCG EQU   DCBMACR1                                                 02089000
DCBMRABC EQU   DCBMACR1                                                 02090000
DCBMRPT1 EQU   DCBMRABC                                                 02091000
DCBMRSBG EQU   DCBMRPT1                                                 02092000
DCBMRCRL EQU   DCBMACR1                                                 02093000
DCBMRCHK EQU   DCBMRCRL                                                 02094000
DCBMRRDX EQU   DCBMRCHK                                                 02095000
DCBMRDMG EQU   DCBMACR1                                                 02096000
DCBMACR2 EQU   DCBMACR+1                                                02097000
DCBMRPUT EQU   DCBMACR2                                                 02098000
DCBMRWRT EQU   DCBMACR2                                                 02099000
DCBMRMVP EQU   DCBMACR2                                                 02100000
DCBMR5WD EQU   DCBMACR2                                                 02101000
DCBMRLDM EQU   DCBMR5WD                                                 02102000
DCBMRLCP EQU   DCBMRLDM                                                 02103000
DCBMR4WD EQU   DCBMACR2                                                 02104000
DCBMRPT2 EQU   DCBMR4WD                                                 02105000
DCBMRTMD EQU   DCBMRPT2                                                 02106000
DCBMR3WD EQU   DCBMACR2                                                 02107000
DCBMRCTL EQU   DCBMR3WD                                                 02108000
DCBMRSTK EQU   DCBMRCTL                                                 02109000
DCBMR1WD EQU   DCBMACR2                                                 02110000
DCBMRSWA EQU   DCBMR1WD                                                 02111000
DCBMRDMD EQU   DCBMRSWA                                                 02112000
IHADCS25 EQU   0                                                        02113000
DCBMACRF EQU   IHADCS25+2                                               02114000
DCBMACF1 EQU   DCBMACRF                                                 02115000
DCBMFFE  EQU   DCBMACF1                                                 02116000
DCBMFGET EQU   DCBMFFE                                                  02117000
DCBMFAPG EQU   DCBMACF1                                                 02118000
DCBMFRD  EQU   DCBMFAPG                                                 02119000
DCBMFCI  EQU   DCBMACF1                                                 02120000
DCBMFMVG EQU   DCBMFCI                                                  02121000
DCBMFLCG EQU   DCBMACF1                                                 02122000
DCBMFABC EQU   DCBMACF1                                                 02123000
DCBMFPT1 EQU   DCBMFABC                                                 02124000
DCBMFSBG EQU   DCBMFPT1                                                 02125000
DCBMFCRL EQU   DCBMACF1                                                 02126000
DCBMFCHK EQU   DCBMFCRL                                                 02127000
DCBMFDMG EQU   DCBMACF1                                                 02128000
DCBMACF2 EQU   DCBMACRF+1                                               02129000
DCBMFPUT EQU   DCBMACF2                                                 02130000
DCBMFWRT EQU   DCBMACF2                                                 02131000
DCBMFMVP EQU   DCBMACF2                                                 02132000
DCBMF5WD EQU   DCBMACF2                                                 02133000
DCBMFLDM EQU   DCBMF5WD                                                 02134000
DCBMFLCP EQU   DCBMFLDM                                                 02135000
DCBMF4WD EQU   DCBMACF2                                                 02136000
DCBMFPT2 EQU   DCBMF4WD                                                 02137000
DCBMFTMD EQU   DCBMFPT2                                                 02138000
DCBMF3WD EQU   DCBMACF2                                                 02139000
DCBMFCTL EQU   DCBMF3WD                                                 02140000
DCBMFSTK EQU   DCBMFCTL                                                 02141000
DCBMF1WD EQU   DCBMACF2                                                 02142000
DCBMFSWA EQU   DCBMF1WD                                                 02143000
DCBMFDMD EQU   DCBMFSWA                                                 02144000
DCBDEBAD EQU   IHADCS25+4                                               02145000
DCBIFLGS EQU   DCBDEBAD                                                 02146000
DCBIFPCT EQU   DCBIFLGS                                                 02147000
IHADCS26 EQU   0                                                        02148000
DCBWRITE EQU   IHADCS26                                                 02149000
DCBREAD  EQU   DCBWRITE                                                 02150000
DCBWRITA EQU   DCBREAD+1                                                02151000
IHADCS36 EQU   0                                                        02152000
DCBGERR  EQU   IHADCS36                                                 02153000
DCBPERR  EQU   DCBGERR                                                  02154000
DCBCHECK EQU   DCBPERR                                                  02155000
DCBOPTCD EQU   DCBCHECK                                                 02156000
DCBOPTH  EQU   DCBOPTCD                                                 02157000
DCBOPTO  EQU   DCBOPTH                                                  02158000
DCBOPTZ  EQU   DCBOPTCD                                                 02159000
DCBGERRA EQU   DCBCHECK+1                                               02160000
DCBPERRA EQU   DCBGERRA                                                 02161000
DCBSYNAD EQU   IHADCS36+4                                               02162000
DCBCIND1 EQU   IHADCS36+8                                               02163000
DCBCIND2 EQU   IHADCS36+9                                               02164000
DCBIOBA  EQU   IHADCS36+16                                              02165000
DCBCICB  EQU   DCBIOBA                                                  02166000
IHADCS52 EQU   0                                                        02167000
DCBDIRCT EQU   IHADCS52                                                 02168000
DCBQSWS  EQU   DCBDIRCT                                                 02169000
DCBUSASI EQU   DCBQSWS                                                  02170000
DCBQADFS EQU   DCBUSASI                                                 02171000
DCBBUFOF EQU   DCBDIRCT+1                                               02172000
IHADCS37 EQU   0                                                        02173000
DCBFLAG1 EQU   IHADCS37                                                 02174000
IHADCS38 EQU   0                                                        02175000
DCBEOBR  EQU   IHADCS38                                                 02176000
DCBPOINT EQU   IHADCS38+12                                              02177000
DCBCNTRL EQU   DCBPOINT                                                 02178000
IEDDCT   EQU   0                                                        02179000
DCTBYTE1 EQU   IEDDCT+1                                                 02180000
DCT3270  EQU   DCTBYTE1                                                 02181000
DCTUMASK EQU   DCTBYTE1                                                 02182000
DCTBYTE2 EQU   IEDDCT+2                                                 02183000
DCTBISYN EQU   DCTBYTE2                                                 02184000
DCTBYTE3 EQU   IEDDCT+3                                                 02185000
DCTNOIDL EQU   DCTBYTE3                                                 02186000
DCTBYTE4 EQU   IEDDCT+4                                                 02187000
DCTBYTE5 EQU   IEDDCT+5                                                 02188000
DCTL3270 EQU   DCTBYTE5                                                 02189000
IEDQLCB  EQU   0                                                        02190000
LCBRCB   EQU   IEDQLCB                                                  02191000
LCBTSOB  EQU   IEDQLCB+19                                               02192000
LCBCHAIN EQU   IEDQLCB+20                                               02193000
LCBSCRNN EQU   LCBCHAIN                                                 02194000
LCBTETEN EQU   LCBCHAIN                                                 02195000
LCBINSRC EQU   IEDQLCB+21                                               02196000
LCBLKMDE EQU   LCBINSRC+2                                               02197000
LCBNTXT  EQU   IEDQLCB+24                                               02198000
LCBSTAT4 EQU   LCBNTXT                                                  02199000
LCBPHASE EQU   LCBSTAT4                                                 02200000
LCBSCBDA EQU   IEDQLCB+25                                               02201000
LCBMHA   EQU   IEDQLCB+29                                               02202000
LCBFLAG1 EQU   IEDQLCB+32                                               02203000
LCBIOBSN EQU   IEDQLCB+33                                               02204000
LCBSNS   EQU   LCBIOBSN+1                                               02205000
LCBSENS0 EQU   LCBSNS                                                   02206000
LCBLOSDT EQU   LCBSENS0                                                 02207000
LCBTMOUT EQU   LCBSENS0                                                 02208000
LCBFLAG3 EQU   LCBIOBSN+7                                               02209000
LCBCSW   EQU   LCBIOBSN+8                                               02210000
LCBCSWST EQU   LCBCSW+3                                                 02211000
LCBCSWUS EQU   LCBCSWST                                                 02212000
LCBCSWCS EQU   LCBCSWST+1                                               02213000
LCBSIOCC EQU   LCBIOBSN+15                                              02214000
LCBDCBPT EQU   IEDQLCB+52                                               02215000
LCBRCQCB EQU   IEDQLCB+56                                               02216000
LCBRESTR EQU   LCBRCQCB                                                 02217000
LCBTHSQ  EQU   IEDQLCB+60                                               02218000
LCBINCAM EQU   LCBTHSQ                                                  02219000
LCBERRCT EQU   IEDQLCB+62                                               02220000
LCBLSPCI EQU   IEDQLCB+65                                               02221000
LCBRCBFR EQU   LCBLSPCI                                                 02222000
LCBSTATE EQU   IEDQLCB+70                                               02223000
LCBSTAT1 EQU   LCBSTATE                                                 02224000
LCBSTAT2 EQU   LCBSTATE+1                                               02225000
LCBBEOTN EQU   LCBSTAT2                                                 02226000
LCBSYNC  EQU   LCBSTAT2                                                 02227000
LCBDIAL  EQU   LCBSTAT2                                                 02228000
LCBTSTSW EQU   IEDQLCB+72                                               02229000
LCBERB   EQU   IEDQLCB+76                                               02230000
LCBERBST EQU   IEDQLCB+84                                               02231000
LCBDLNKN EQU   LCBERBST                                                 02232000
LCBERBCT EQU   IEDQLCB+88                                               02233000
LCBRBCT2 EQU   LCBERBCT+1                                               02234000
LCBMSGFM EQU   IEDQLCB+92                                               02235000
LCBSCBA  EQU   IEDQLCB+93                                               02236000
LCBOBRCH EQU   IEDQLCB+96                                               02237000
LCBINVPT EQU   LCBOBRCH+1                                               02238000
LCBBFRW  EQU   LCBINVPT                                                 02239000
LCBTPCD  EQU   IEDQLCB+100                                              02240000
LCBSTAT5 EQU   LCBTPCD                                                  02241000
LCBSTAT6 EQU   LCBTPCD+4                                                02242000
LCBRSPSV EQU   LCBTPCD+8                                                02243000
LCBSAVSN EQU   IEDQLCB+112                                              02244000
LCBERCCW EQU   IEDQLCB+120                                              02245000
LCBCPA   EQU   IEDQLCB+144                                              02246000
LCBCCW5  EQU   LCBCPA+32                                                02247000
LCBATTEL EQU   LCBCCW5                                                  02248000
LCBQEBPL EQU   LCBATTEL                                                 02249000
IEDQLPTR EQU   0                                                        02250000
IEDQLCBX EQU   0                                                        02251000
LCBXCON  EQU   IEDQLCBX                                                 02252000
LCBXFLAG EQU   LCBXCON                                                  02253000
LCBXDCT  EQU   LCBXCON+1                                                02254000
LCBXRADR EQU   LCBXCON+4                                                02255000
TOTOLTCB EQU   0                                                        02256000
$SCTTBLE EQU   TOTOLTCB                                                 02257000
$TESTOPT EQU   $SCTTBLE+2                                               02258000
$ERROPT  EQU   $SCTTBLE+3                                               02259000
$PDEVFLG EQU   $SCTTBLE+10                                              02260000
$CDSFLGS EQU   $SCTTBLE+11                                              02261000
$EXECFLG EQU   $SCTTBLE+33                                              02262000
$OLTFLGS EQU   $SCTTBLE+36                                              02263000
$TOTFLG1 EQU   $SCTTBLE+38                                              02264000
TOTSAVE2 EQU   TOTOLTCB+192                                             02265000
TOTSAVE5 EQU   TOTOLTCB+408                                             02266000
TOTSAVE6 EQU   TOTOLTCB+480                                             02267000
TOTWOSV2 EQU   TOTOLTCB+556                                             02268000
TOTWOSV3 EQU   TOTOLTCB+560                                             02269000
TOTWOSV4 EQU   TOTOLTCB+564                                             02270000
TOTSRENT EQU   TOTOLTCB+576                                             02271000
TOTSROFF EQU   TOTSRENT                                                 02272000
TOTSRLCB EQU   TOTSRENT+4                                               02273000
TOTCTENT EQU   TOTOLTCB+584                                             02274000
TOTCTFLG EQU   TOTCTENT+22                                              02275000
TOTCTORN EQU   TOTCTFLG                                                 02276000
TOTCTDFL EQU   TOTOLTCB+624                                             02277000
TOTCUTST EQU   TOTOLTCB+628                                             02278000
TOTCUFLG EQU   TOTCUTST                                                 02279000
TOTPLIST EQU   TOTOLTCB+664                                             02280000
TOTOKEY  EQU   TOTPLIST                                                 02281000
TOTOQCBA EQU   TOTPLIST+1                                               02282000
TOTOPRI  EQU   TOTPLIST+4                                               02283000
TOTOLINK EQU   TOTPLIST+5                                               02284000
TOTOVBCD EQU   TOTPLIST+8                                               02285000
TOTOELNG EQU   TOTPLIST+9                                               02286000
TOTORLN  EQU   TOTPLIST+10                                              02287000
TOTORTCD EQU   TOTPLIST+11                                              02288000
TOTOECBA EQU   TOTPLIST+12                                              02289000
TOTOFLG  EQU   TOTOECBA                                                 02290000
TOTOATTC EQU   TOTOFLG                                                  02291000
TOTOLADR EQU   TOTPLIST+16                                              02292000
TOTOALTT EQU   TOTOLTCB+688                                             02293000
TOTAPENT EQU   TOTOLTCB+736                                             02294000
TOTAPFLG EQU   TOTAPENT+22                                              02295000
TOTAPORN EQU   TOTAPFLG                                                 02296000
TOTAPDFL EQU   TOTOLTCB+767                                             02297000
TOTAPDCB EQU   TOTOLTCB+772                                             02298000
TOTPDECB EQU   TOTOLTCB+776                                             02299000
TOTOTECB EQU   TOTOLTCB+804                                             02300000
TOTOLTPL EQU   TOTOLTCB+820                                             02301000
TOTWTORP EQU   TOTOLTCB+832                                             02302000
TOTINCNT EQU   TOTWTORP                                                 02303000
TOTWTOPL EQU   TOTOLTCB+840                                             02304000
TOTOTCNT EQU   TOTWTOPL+1                                               02305000
TOTOTBUF EQU   TOTWTOPL+4                                               02306000
TOTINBUF EQU   TOTWTOPL+88                                              02307000
TOTPLNKQ EQU   TOTOLTCB+1012                                            02308000
TOTWKSPC EQU   TOTOLTCB+1024                                            02309000
TOTAVTPT EQU   TOTOLTCB+1172                                            02310000
TOTRESPL EQU   TOTOLTCB+1180                                            02311000
TOTFLG01 EQU   TOTOLTCB+1184                                            02312000
TOTEXIT  EQU   TOTFLG01                                                 02313000
TOTFLG02 EQU   TOTOLTCB+1185                                            02314000
TOTFLG03 EQU   TOTOLTCB+1186                                            02315000
TOTFLG04 EQU   TOTOLTCB+1187                                            02316000
TOTFLG05 EQU   TOTOLTCB+1188                                            02317000
TOTPRINT EQU   TOTFLG05                                                 02318000
TOTCECOM EQU   TOTFLG05                                                 02319000
TOTREPLY EQU   TOTFLG05                                                 02320000
TOTSRCE  EQU   TOTFLG05                                                 02321000
TOTFLG06 EQU   TOTOLTCB+1189                                            02322000
TOTFLG07 EQU   TOTOLTCB+1190                                            02323000
TOTFLG08 EQU   TOTOLTCB+1191                                            02324000
TOTFMCTL EQU   TOTFLG08                                                 02325000
TOTFLG09 EQU   TOTOLTCB+1192                                            02326000
TOTAPCON EQU   TOTFLG09                                                 02327000
TOTAPOUT EQU   TOTFLG09                                                 02328000
TOTCTCON EQU   TOTFLG09                                                 02329000
TOTPRECT EQU   TOTFLG09                                                 02330000
TOTFLG10 EQU   TOTOLTCB+1193                                            02331000
TOTTTBEL EQU   TOTOLTCB+1194                                            02332000
TOTPRECB EQU   TOTOLTCB+1316                                            02333000
TOTPRIBK EQU   TOTPRECB                                                 02334000
TOTPRENT EQU   TOTOLTCB+1320                                            02335000
TOTPRFLG EQU   TOTPRENT+22                                              02336000
TOTPRSN  EQU   TOTOLTCB+1364                                            02337000
TOTPRDCB EQU   TOTOLTCB+1416                                            02338000
TOTSCECB EQU   TOTOLTCB+1488                                            02339000
TOTSCENT EQU   TOTOLTCB+1492                                            02340000
TOTSCFLG EQU   TOTSCENT+22                                              02341000
TOTSCSN  EQU   TOTOLTCB+1536                                            02342000
TOTSCDCB EQU   TOTOLTCB+1588                                            02343000
TOTCROLT EQU   TOTOLTCB+1660                                            02344000
TOTTDTBL EQU   TOTOLTCB+1748                                            02345000
@NM00225 EQU   TOTTDTBL                                                 02346000
TOTWAWRK EQU   TOTOLTCB+1824                                            02347000
TOTWOWRK EQU   TOTOLTCB+1904                                            02348000
IEDPLMV  EQU   0                                                        02349000
PLMVTU   EQU   IEDPLMV                                                  02350000
PLMVTD   EQU   IEDPLMV+4                                                02351000
PLMVSU   EQU   IEDPLMV+8                                                02352000
PLMVSD   EQU   IEDPLMV+12                                               02353000
PLMVLNTH EQU   IEDPLMV+16                                               02354000
PLMVFLG1 EQU   IEDPLMV+18                                               02355000
PLMVSCTG EQU   PLMVFLG1                                                 02356000
PLMVFLG2 EQU   IEDPLMV+19                                               02357000
IEDPLMVP EQU   0                                                        02358000
IEDQPRF  EQU   0                                                        02359000
PRFRCB   EQU   IEDQPRF                                                  02360000
PRFKEY   EQU   PRFRCB                                                   02361000
PRFQCBA  EQU   PRFRCB+1                                                 02362000
PRFPRI   EQU   PRFRCB+4                                                 02363000
PRFLINK  EQU   PRFRCB+5                                                 02364000
PRFTIC   EQU   IEDQPRF+8                                                02365000
PRFTICC  EQU   PRFTIC                                                   02366000
PRFNBUNT EQU   IEDQPRF+12                                               02367000
PRFSUNIT EQU   PRFNBUNT                                                 02368000
PRFPLQCB EQU   PRFSUNIT                                                 02369000
PRFLCB   EQU   IEDQPRF+13                                               02370000
@NM00236 EQU   IEDQPRF+16                                               02371000
PRFSVFFO EQU   @NM00236                                                 02372000
PRFSRCE  EQU   PRFSVFFO                                                 02373000
PRFSIZE  EQU   PRFSVFFO+2                                               02374000
PRFSTAT1 EQU   IEDQPRF+20                                               02375000
PRFEOFN  EQU   PRFSTAT1                                                 02376000
PRFCORE  EQU   IEDQPRF+21                                               02377000
PRFXTRA  EQU   PRFCORE                                                  02378000
PRFSCAN  EQU   IEDQPRF+24                                               02379000
PRFTQBCK EQU   IEDQPRF+26                                               02380000
PRFNTXT  EQU   PRFTQBCK                                                 02381000
PRFEOBOF EQU   PRFNTXT                                                  02382000
PRFCHDR  EQU   IEDQPRF+32                                               02383000
PRFHQBCK EQU   IEDQPRF+35                                               02384000
PRFDEST  EQU   IEDQPRF+40                                               02385000
IEDQPPTR EQU   0                                                        02386000
IEDPF1   EQU   0                                                        02387000
PRF1RH   EQU   IEDPF1                                                   02388000
PRF1FLG1 EQU   IEDPF1+3                                                 02389000
PRF1FIDI EQU   PRF1FLG1                                                 02390000
PRF1FORM EQU   PRF1FLG1                                                 02391000
PRF1WD2  EQU   IEDPF1+4                                                 02392000
PRF1SEQP EQU   PRF1WD2                                                  02393000
PRF1SQID EQU   PRF1SEQP                                                 02394000
PRF1TAG1 EQU   PRF1SQID                                                 02395000
IEDPF2   EQU   0                                                        02396000
PRF2FLG2 EQU   IEDPF2                                                   02397000
PRF2WD2  EQU   IEDPF2+4                                                 02398000
IEDRESPL EQU   0                                                        02399000
RESOBQCB EQU   IEDRESPL+12                                              02400000
RESFLAGS EQU   IEDRESPL+49                                              02401000
RESQHBL  EQU   IEDRESPL+60                                              02402000
RESPLRVT EQU   IEDRESPL+76                                              02403000
RESABUF  EQU   IEDRESPL+80                                              02404000
RESMHSRC EQU   IEDRESPL+88                                              02405000
RESPLADR EQU   IEDRESPL+96                                              02406000
RESPLAC  EQU   RESPLADR+44                                              02407000
RESPL42  EQU   RESPLADR+56                                              02408000
IEDRH    EQU   0                                                        02409000
TRHBYTE0 EQU   IEDRH                                                    02410000
TRHBYTE1 EQU   IEDRH+1                                                  02411000
TRHBYTE2 EQU   IEDRH+2                                                  02412000
TRHBB    EQU   TRHBYTE2                                                 02413000
TRHCDI   EQU   TRHBYTE2                                                 02414000
IEDQSCB  EQU   0                                                        02415000
SCBSTATE EQU   IEDQSCB                                                  02416000
SCBSEQIN EQU   SCBSTATE                                                 02417000
SCBDESTQ EQU   IEDQSCB+1                                                02418000
SCBRCVCT EQU   IEDQSCB+4                                                02419000
SCBMBHEN EQU   IEDQSCB+5                                                02420000
SCBBKFCT EQU   IEDQSCB+9                                                02421000
SCBEOBSZ EQU   SCBBKFCT+1                                               02422000
SCBSALEV EQU   IEDQSCB+12                                               02423000
SCBQTYPE EQU   SCBSALEV                                                 02424000
SCBERRST EQU   IEDQSCB+16                                               02425000
SCBERR1  EQU   SCBERRST                                                 02426000
SCBHDRRN EQU   SCBERR1                                                  02427000
SCBORIGN EQU   SCBERR1                                                  02428000
SCBNOTRM EQU   SCBERR1                                                  02429000
SCBSEQHN EQU   SCBERR1                                                  02430000
SCBSEQLN EQU   SCBERR1                                                  02431000
SCBCUTFN EQU   SCBERR1                                                  02432000
SCBERR2  EQU   SCBERRST+1                                               02433000
SCBABRTN EQU   SCBERR2                                                  02434000
SCBERR3  EQU   SCBERRST+2                                               02435000
SCBLOSTN EQU   SCBERR3                                                  02436000
SCBTMIDN EQU   SCBERR3                                                  02437000
SCBFORMN EQU   SCBERR3                                                  02438000
SCBATTN  EQU   SCBERR3                                                  02439000
SCBXCEPN EQU   SCBERR3                                                  02440000
SCBERR4  EQU   SCBERRST+3                                               02441000
SCBTXTTN EQU   SCBERR4                                                  02442000
SCBCTLUN EQU   SCBERR4                                                  02443000
SCBCHANN EQU   SCBERR4                                                  02444000
SCBDLPTR EQU   IEDQSCB+22                                               02445000
SCBEOBAC EQU   SCBDLPTR                                                 02446000
SCBCTBAC EQU   SCBEOBAC                                                 02447000
SCBBSCFM EQU   IEDQSCB+24                                               02448000
SCBDATEN EQU   SCBBSCFM                                                 02449000
SCBITBSZ EQU   IEDQSCB+40                                               02450000
SCBCTBSV EQU   SCBITBSZ                                                 02451000
SCBDNSEG EQU   IEDQSCB+41                                               02452000
SCBCLSEG EQU   IEDQSCB+45                                               02453000
SCBITBAC EQU   IEDQSCB+48                                               02454000
SCBCTBFL EQU   SCBITBAC                                                 02455000
SCBBLKCT EQU   SCBCTBFL                                                 02456000
SCBDCSEG EQU   IEDQSCB+49                                               02457000
SCBSTAT1 EQU   IEDQSCB+60                                               02458000
SCBCORE  EQU   IEDQSCB+61                                               02459000
SCBSCAN  EQU   IEDQSCB+64                                               02460000
SCBNTXT  EQU   IEDQSCB+66                                               02461000
SCBCHDR  EQU   IEDQSCB+72                                               02462000
SCBCCSEG EQU   IEDQSCB+75                                               02463000
SCBEND   EQU   IEDQSCB+84                                               02464000
IEDQSPTR EQU   0                                                        02465000
IEDSIBD  EQU   0                                                        02466000
SIBCHAIN EQU   IEDSIBD+4                                                02467000
SIBINDEX EQU   IEDSIBD+8                                                02468000
SIBSESSN EQU   IEDSIBD+10                                               02469000
SIBPACIN EQU   IEDSIBD+11                                               02470000
SIBSEQN  EQU   IEDSIBD+12                                               02471000
SIBSTAT1 EQU   IEDSIBD+16                                               02472000
SIBSTAT2 EQU   IEDSIBD+17                                               02473000
SIBBIND  EQU   IEDSIBD+20                                               02474000
SIBBIND1 EQU   SIBBIND                                                  02475000
SIBBIND2 EQU   SIBBIND+1                                                02476000
SIBBIND3 EQU   SIBBIND+2                                                02477000
SIBSTAT0 EQU   IEDSIBD+23                                               02478000
IEDQTNTD EQU   0                                                        02479000
IEDQTCDE EQU   IEDQTNTD                                                 02480000
IEDQTDCE EQU   IEDQTNTD+46                                              02481000
IEDQNPTR EQU   0                                                        02482000
IEDTNTA  EQU   0                                                        02483000
TNTTRMAD EQU   IEDTNTA                                                  02484000
IEDTRM   EQU   0                                                        02485000
IEDNTRM  EQU   IEDTRM                                                   02486000
TRMBYTE4 EQU   IEDNTRM                                                  02487000
TRMBYTE3 EQU   IEDNTRM+1                                                02488000
TRMBYTE2 EQU   IEDNTRM+2                                                02489000
TRMINPG  EQU   TRMBYTE2                                                 02490000
TRMBYTE1 EQU   IEDNTRM+3                                                02491000
TRMSCPRQ EQU   TRMBYTE1                                                 02492000
TRMBYTE0 EQU   IEDNTRM+6                                                02493000
TRMSNA   EQU   TRMBYTE0                                                 02494000
TRMSIBPT EQU   IEDNTRM+7                                                02495000
TRMTYPE  EQU   IEDNTRM+11                                               02496000
IEDQTRM  EQU   IEDTRM+14                                                02497000
TRMSTATE EQU   IEDQTRM                                                  02498000
TRMLOG   EQU   TRMSTATE                                                 02499000
TRMPREF  EQU   TRMSTATE                                                 02500000
TRMDESTQ EQU   IEDQTRM+1                                                02501000
TRMINSEQ EQU   IEDQTRM+4                                                02502000
TLISTCNT EQU   TRMINSEQ                                                 02503000
TRMOUTSQ EQU   IEDQTRM+6                                                02504000
TLISTEN  EQU   TRMOUTSQ                                                 02505000
TRMDSORG EQU   TLISTEN                                                  02506000
TRMALTD  EQU   IEDQTRM+8                                                02507000
TRMDEVFL EQU   IEDQTRM+10                                               02508000
TRMSTAT  EQU   IEDQTRM+12                                               02509000
TRMCHCIN EQU   IEDQTRM+16                                               02510000
IEDTTCD  EQU   0                                                        02511000
IEDTTCP  EQU   0                                                        02512000
IEDTTCPL EQU   0                                                        02513000
TTCSVCPL EQU   IEDTTCPL                                                 02514000
TTCSVCW1 EQU   TTCSVCPL                                                 02515000
TTCSVCW2 EQU   TTCSVCPL+4                                               02516000
IEDTTCFD EQU   0                                                        02517000
IEDTTCQB EQU   0                                                        02518000
TTCQCB   EQU   IEDTTCQB                                                 02519000
TTCQBECB EQU   TTCQCB+4                                                 02520000
TTCSCB   EQU   IEDTTCQB+12                                              02521000
IEDQTNT  EQU   0                                                        02522000
IEDMVBFR EQU   0                                                        02523000
ALLOCBUF EQU   0                                                        02524000
POSTWAIT EQU   0                                                        02525000
DEVENTRY EQU   0                                                        02526000
ENTTTOFF EQU   DEVENTRY+2                                               02527000
ENTRLN   EQU   DEVENTRY+8                                               02528000
ENTLCBAD EQU   DEVENTRY+9                                               02529000
ENTTNTAD EQU   DEVENTRY+12                                              02530000
ENTTNTRA EQU   DEVENTRY+16                                              02531000
ENTFLG   EQU   DEVENTRY+22                                              02532000
NAME     EQU   0                                                        02533000
QCBLDCB  EQU   0                                                        02534000
TNTCODE  EQU   0                                                        02535000
TNTDCODE EQU   0                                                        02536000
TNTFIRST EQU   0                                                        02537000
LCBRSPIN EQU   LCBIOBSN                                                 02538000
LCBLUSNS EQU   LCBRSPIN+5                                               02539000
LCBSCPRS EQU   LCBRSPIN+9                                               02540000
LCBCSWU1 EQU   LCBSCPRS+2                                               02541000
LCBRSPFG EQU   LCBRSPIN+15                                              02542000
LCBCOREQ EQU   LCBTPCD                                                  02543000
@NM00160 EQU   LCBCPA+40                                                02544000
LCBQNX   EQU   LCBERCCW                                                 02545000
LCBQNXMN EQU   LCBQNX                                                   02546000
LCBCANCL EQU   LCBSAVSN                                                 02547000
LCBCANFG EQU   LCBCANCL                                                 02548000
PRFSHDR  EQU   IEDQPRF+42                                               02549000
TRMPRE1  EQU   TRMBYTE4                                                 02550000
TRMNCP1  EQU   TRMBYTE4                                                 02551000
TRMPRE   EQU   TRMBYTE3                                                 02552000
TRMNCP   EQU   TRMBYTE3                                                 02553000
TRMPU    EQU   TRMBYTE3                                                 02554000
TRMLU    EQU   TRMBYTE3                                                 02555000
TRMTDIFF EQU   TRMLU                                                    02556000
TRMLINK  EQU   TRMBYTE3                                                 02557000
REQELEM  EQU   TOTWOWRK                                                 02558000
REQQCB   EQU   REQELEM                                                  02559000
@NM00272 EQU   REQELEM+4                                                02560000
REQPRI   EQU   @NM00272                                                 02561000
REQLINK  EQU   @NM00272+1                                               02562000
SCBRGSAV EQU   SCBEND                                                   02563000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02564000
@NM00267 EQU   TRMLINK                                                  02565000
TRMLSTAT EQU   TRMLINK                                                  02566000
TRMLINT  EQU   TRMLINK                                                  02567000
TRMEPMOD EQU   TRMLINK                                                  02568000
TRMLULOG EQU   TRMLU                                                    02569000
TRMINERR EQU   TRMLU                                                    02570000
TRMLUREQ EQU   TRMLU                                                    02571000
TRMSESRQ EQU   TRMLU                                                    02572000
TRMLUTM  EQU   TRMLU                                                    02573000
TRMLUIT  EQU   TRMLU                                                    02574000
TRMAUTO  EQU   TRMLU                                                    02575000
TRMPCONT EQU   TRMPU                                                    02576000
@NM00266 EQU   TRMPU                                                    02577000
TRMNCONT EQU   TRMNCP                                                   02578000
TRMQUCKN EQU   TRMNCP                                                   02579000
TRMSLOWN EQU   TRMNCP                                                   02580000
TRMSYGEN EQU   TRMNCP                                                   02581000
TRMNCPCL EQU   TRMNCP                                                   02582000
TRMIPLDM EQU   TRMNCP                                                   02583000
TRMINOUT EQU   TRMPRE                                                   02584000
TRMRDOUT EQU   TRMPRE                                                   02585000
TRMNLOUT EQU   TRMPRE                                                   02586000
TRMWROUT EQU   TRMPRE                                                   02587000
TRMASNXI EQU   TRMPRE                                                   02588000
TRMSTMM  EQU   TRMPRE                                                   02589000
TRMCMODE EQU   TRMPRE                                                   02590000
TRMSTPND EQU   TRMPRE                                                   02591000
@NM00265 EQU   TRMNCP1                                                  02592000
TRMINOP  EQU   TRMNCP1                                                  02593000
TRMLYNCH EQU   TRMPRE1                                                  02594000
TRMSPOUT EQU   TRMPRE1                                                  02595000
TRMERLCK EQU   TRMPRE1                                                  02596000
TRMQNPL  EQU   TRMPRE1                                                  02597000
TRMSPACT EQU   TRMPRE1                                                  02598000
TRMOCNI  EQU   TRMPRE1                                                  02599000
TRMSESSN EQU   TRMPRE1                                                  02600000
TRMCONT  EQU   TRMPRE1                                                  02601000
@NM00168 EQU   LCBCANCL+3                                               02602000
LCBCANTH EQU   LCBCANCL+1                                               02603000
@NM00167 EQU   LCBCANFG                                                 02604000
LCBCANCD EQU   LCBCANFG                                                 02605000
@NM00166 EQU   LCBCANFG                                                 02606000
LCBCANEB EQU   LCBCANFG                                                 02607000
LCBCANXT EQU   LCBCANFG                                                 02608000
LCBUNADD EQU   LCBQNX+21                                                02609000
LCBUASZE EQU   LCBQNX+20                                                02610000
LCBDSTEA EQU   LCBQNX+16                                                02611000
@NM00165 EQU   LCBQNX+8                                                 02612000
LCBIOSBS EQU   LCBQNX+5                                                 02613000
@NM00164 EQU   LCBQNX+4                                                 02614000
LCBSTSAV EQU   LCBQNX+1                                                 02615000
@NM00163 EQU   LCBQNXMN                                                 02616000
LCBNX509 EQU   LCBQNXMN                                                 02617000
LCBNX162 EQU   LCBQNXMN                                                 02618000
LCBNX142 EQU   LCBQNXMN                                                 02619000
LCBNX064 EQU   LCBQNXMN                                                 02620000
@NM00162 EQU   @NM00160+4                                               02621000
LCBNCPPT EQU   @NM00160+1                                               02622000
@NM00161 EQU   @NM00160                                                 02623000
LCBWRSCH EQU   LCBCOREQ+8                                               02624000
LCBCQLNK EQU   LCBCOREQ+4                                               02625000
LCBCQELE EQU   LCBCOREQ                                                 02626000
LCBPAKCH EQU   LCBRSPIN+16                                              02627000
@NM00159 EQU   LCBRSPFG                                                 02628000
LCBRSRH  EQU   LCBRSPFG                                                 02629000
LCBEXPI  EQU   LCBRSPFG                                                 02630000
@NM00158 EQU   LCBRSPIN+12                                              02631000
LCBUSUE1 EQU   LCBCSWU1                                                 02632000
@NM00157 EQU   LCBCSWU1                                                 02633000
@NM00156 EQU   LCBSCPRS+1                                               02634000
LCBDFCMD EQU   LCBSCPRS                                                 02635000
LCBUSER  EQU   LCBLUSNS+2                                               02636000
LCBSMIN  EQU   LCBLUSNS+1                                               02637000
LCBSMAJ  EQU   LCBLUSNS                                                 02638000
LCBRHSV  EQU   LCBRSPIN+2                                               02639000
LCBSNS0  EQU   LCBRSPIN+1                                               02640000
@NM00155 EQU   LCBRSPIN                                                 02641000
@NM00271 EQU   ENTFLG                                                   02642000
ENTORN   EQU   ENTFLG                                                   02643000
ENTASN   EQU   ENTFLG                                                   02644000
ENTLN    EQU   DEVENTRY+20                                              02645000
ENTRSID  EQU   DEVENTRY+6                                               02646000
ENTTROFF EQU   DEVENTRY+4                                               02647000
ENTUCBAD EQU   DEVENTRY                                                 02648000
TTCQSTCB EQU   TTCQCB+8                                                 02649000
TTCQBELC EQU   TTCQCB+1                                                 02650000
TTCQBFLG EQU   TTCQCB                                                   02651000
@NM00270 EQU   IEDTTCFD                                                 02652000
@NM00269 EQU   IEDTTCPL+8                                               02653000
TTCLAST  EQU   TTCSVCW2                                                 02654000
TTCFIRST EQU   TTCSVCW1+1                                               02655000
TTCPCODE EQU   TTCSVCW1                                                 02656000
@NM00268 EQU   IEDTTCD                                                  02657000
TRMOPT   EQU   IEDTRM+34                                                02658000
TRMOPTBL EQU   IEDQTRM+18                                               02659000
TRMOPNO  EQU   IEDQTRM+17                                               02660000
TRMSENSE EQU   TRMSTAT+3                                                02661000
TRMTEMPR EQU   TRMSTAT+2                                                02662000
TRMSIO   EQU   TRMSTAT                                                  02663000
@NM00264 EQU   TRMDEVFL+1                                               02664000
TRMTPIN  EQU   TRMDEVFL+1                                               02665000
TRMNCPI  EQU   TRMDEVFL+1                                               02666000
TRMRNTRM EQU   TRMDEVFL+1                                               02667000
@NM00263 EQU   TRMDEVFL+1                                               02668000
TRMLMD   EQU   TRMDEVFL+1                                               02669000
TRMCONC  EQU   TRMDEVFL+1                                               02670000
TRMTSOB  EQU   TRMDEVFL                                                 02671000
TRMBFDY  EQU   TRMDEVFL                                                 02672000
TRMTBLK  EQU   TRMDEVFL                                                 02673000
TRMSBLK  EQU   TRMDEVFL                                                 02674000
TRMBLKS  EQU   TRMDEVFL                                                 02675000
TRMADDC  EQU   TRMDEVFL                                                 02676000
TRMDDIG  EQU   TRMDEVFL                                                 02677000
TRMBUFS  EQU   TRMDEVFL                                                 02678000
TRMPRILK EQU   TRMALTD                                                  02679000
TRMLGB   EQU   TRMDSORG                                                 02680000
TRMUTERM EQU   TLISTCNT                                                 02681000
TRMSCNYN EQU   TRMSTATE                                                 02682000
TRMOPTFN EQU   TRMSTATE                                                 02683000
TRMHELDN EQU   TRMSTATE                                                 02684000
TRMACPTN EQU   TRMSTATE                                                 02685000
TRMPROC  EQU   TRMLOG                                                   02686000
TRMLIST  EQU   TRMLOG                                                   02687000
TRMLINE  EQU   TRMSTATE                                                 02688000
TRMSUBST EQU   IEDNTRM+12                                               02689000
TRMRLMCT EQU   IEDNTRM+10                                               02690000
TRMCOHTG EQU   TRMSIBPT+1                                               02691000
TRMGPCNT EQU   TRMSIBPT                                                 02692000
TRMBUFRD EQU   TRMBYTE0                                                 02693000
TRMGP    EQU   TRMBYTE0                                                 02694000
TRMDIAL  EQU   TRMBYTE0                                                 02695000
@NM00262 EQU   TRMBYTE0                                                 02696000
TRMOUTPT EQU   TRMBYTE0                                                 02697000
TRMINPUT EQU   TRMBYTE0                                                 02698000
TRMUDEF  EQU   TRMBYTE0                                                 02699000
TRMCOHRT EQU   IEDNTRM+4                                                02700000
TRMSTOTE EQU   TRMBYTE1                                                 02701000
TRMCKPRN EQU   TRMBYTE1                                                 02702000
TRMTSATN EQU   TRMBYTE1                                                 02703000
TRMTRACE EQU   TRMBYTE1                                                 02704000
TRMSWBCK EQU   TRMBYTE1                                                 02705000
TRMAUTOC EQU   TRMBYTE1                                                 02706000
TRMINPTP EQU   TRMBYTE1                                                 02707000
TRMWTNEG EQU   TRMSCPRQ                                                 02708000
TRMWRBRK EQU   TRMBYTE2                                                 02709000
TRMNOSND EQU   TRMBYTE2                                                 02710000
TRMPREP  EQU   TRMBYTE2                                                 02711000
TRMGPACT EQU   TRMBYTE2                                                 02712000
TRMANDL  EQU   TRMBYTE2                                                 02713000
TRMCLOSN EQU   TRMINPG                                                  02714000
TRMREMB  EQU   TRMBYTE2                                                 02715000
TRMRSACT EQU   TRMBYTE2                                                 02716000
TNTLEN   EQU   IEDQTNTD+44                                              02717000
TNTMIDEN EQU   IEDQTNTD+41                                              02718000
TNTENLEN EQU   IEDQTNTD+40                                              02719000
TNTSRCHX EQU   IEDQTNTD+38                                              02720000
SIBLUTYP EQU   SIBSTAT0                                                 02721000
SIBCD    EQU   SIBSTAT0                                                 02722000
@NM00261 EQU   SIBBIND3                                                 02723000
SIBCRES  EQU   SIBBIND3                                                 02724000
SIBSPKR  EQU   SIBBIND3                                                 02725000
SIBRECOV EQU   SIBBIND3                                                 02726000
SIBFMODE EQU   SIBBIND3                                                 02727000
SIBALT   EQU   SIBBIND2                                                 02728000
SIBBTERM EQU   SIBBIND2                                                 02729000
SIBBRACK EQU   SIBBIND2                                                 02730000
SIBFMUSE EQU   SIBBIND2                                                 02731000
SIBSEBI  EQU   SIBBIND2                                                 02732000
SIBSCMP  EQU   SIBBIND2                                                 02733000
SIBSEXC  EQU   SIBBIND2                                                 02734000
SIBSDEF  EQU   SIBBIND2                                                 02735000
SIBSRQM  EQU   SIBBIND1                                                 02736000
SIBSCHNG EQU   SIBBIND1                                                 02737000
SIBPEBI  EQU   SIBBIND1                                                 02738000
SIBPCMP  EQU   SIBBIND1                                                 02739000
SIBPEXC  EQU   SIBBIND1                                                 02740000
SIBPDEF  EQU   SIBBIND1                                                 02741000
SIBPRQM  EQU   SIBBIND1                                                 02742000
SIBPCHN  EQU   SIBBIND1                                                 02743000
SIBFMPRO EQU   IEDSIBD+19                                               02744000
SIBTSPRO EQU   IEDSIBD+18                                               02745000
@NM00260 EQU   SIBSTAT2                                                 02746000
SIBDACLU EQU   SIBSTAT2                                                 02747000
SIBRDSCN EQU   SIBSTAT2                                                 02748000
SIBTERM  EQU   SIBSTAT2                                                 02749000
SIBUSS   EQU   SIBSTAT2                                                 02750000
SIBBSTAT EQU   SIBSTAT1                                                 02751000
SIBRTRP  EQU   SIBSTAT1                                                 02752000
SIBFTERM EQU   SIBSTAT1                                                 02753000
SIBRQEND EQU   SIBSTAT1                                                 02754000
SIBRQSHT EQU   SIBSTAT1                                                 02755000
SIBSEQO  EQU   SIBSEQN+2                                                02756000
SIBSEQI  EQU   SIBSEQN                                                  02757000
SIBNCNT  EQU   SIBPACIN                                                 02758000
SIBMCNT  EQU   SIBPACIN                                                 02759000
SIBDSTAT EQU   SIBSESSN                                                 02760000
SIBSSTAT EQU   SIBSESSN                                                 02761000
SIBINBIU EQU   SIBSESSN                                                 02762000
SIBSHUTC EQU   SIBSESSN                                                 02763000
SIBLGOFF EQU   SIBSESSN                                                 02764000
SIBRUSEG EQU   IEDSIBD                                                  02765000
SCBTRANS EQU   IEDQSCB+81                                               02766000
SCBUNTCT EQU   IEDQSCB+80                                               02767000
SCBEOB   EQU   IEDQSCB+78                                               02768000
SCBNXCPB EQU   SCBCCSEG                                                 02769000
SCBNHDR  EQU   SCBCHDR                                                  02770000
SCBCRCD  EQU   IEDQSCB+69                                               02771000
SCBTQBCK EQU   SCBNTXT                                                  02772000
SCBOSEQ  EQU   SCBSCAN                                                  02773000
SCBXTRA  EQU   SCBCORE                                                  02774000
SCBNOPST EQU   SCBSTAT1                                                 02775000
SCBNIDLE EQU   SCBSTAT1                                                 02776000
SCBCEND  EQU   SCBSTAT1                                                 02777000
SCBCBGN  EQU   SCBSTAT1                                                 02778000
SCBSIZE  EQU   IEDQSCB+58                                               02779000
SCBSRCE  EQU   IEDQSCB+56                                               02780000
SCBDEOB  EQU   IEDQSCB+52                                               02781000
SCBFEFO  EQU   SCBDCSEG                                                 02782000
SCBCTBND EQU   SCBBLKCT                                                 02783000
SCBSCHDR EQU   SCBCLSEG                                                 02784000
SCBHBFNO EQU   IEDQSCB+44                                               02785000
SCBSCSEG EQU   SCBDNSEG                                                 02786000
SCBBCTR  EQU   SCBCTBSV                                                 02787000
SCBCCHDR EQU   IEDQSCB+37                                               02788000
SCBDESTL EQU   IEDQSCB+36                                               02789000
SCBDCHDR EQU   IEDQSCB+33                                               02790000
SCBCPBNO EQU   IEDQSCB+32                                               02791000
SCBMBSSA EQU   IEDQSCB+25                                               02792000
SCBMLMTN EQU   SCBBSCFM                                                 02793000
SCBNOEOT EQU   SCBBSCFM                                                 02794000
@NM00259 EQU   SCBBSCFM                                                 02795000
SCBNPDTR EQU   SCBDATEN                                                 02796000
SCBCNTEN EQU   SCBBSCFM                                                 02797000
SCBRCVTX EQU   SCBBSCFM                                                 02798000
SCBNONTR EQU   SCBBSCFM                                                 02799000
SCBTRNSP EQU   SCBBSCFM                                                 02800000
SCBENDCR EQU   SCBCTBAC+1                                               02801000
SCBCRLEN EQU   SCBCTBAC                                                 02802000
SCBMRFSD EQU   IEDQSCB+20                                               02803000
SCBUNDFN EQU   SCBERR4                                                  02804000
SCBSTERN EQU   SCBCHANN                                                 02805000
SCBCPMEN EQU   SCBCTLUN                                                 02806000
@NM00258 EQU   SCBERR4                                                  02807000
SCBTRMLN EQU   SCBERR4                                                  02808000
SCBCONNN EQU   SCBERR4                                                  02809000
SCBAPERR EQU   SCBTXTTN                                                 02810000
SCBSLCTN EQU   SCBERR4                                                  02811000
SCBPERRN EQU   SCBXCEPN                                                 02812000
SCBTHRSN EQU   SCBATTN                                                  02813000
SCBFIERN EQU   SCBFORMN                                                 02814000
SCBUSERN EQU   SCBERR3                                                  02815000
SCBSATTN EQU   SCBERR3                                                  02816000
SCBTMINN EQU   SCBERR3                                                  02817000
SCBXPD   EQU   SCBTMIDN                                                 02818000
SCBXPI   EQU   SCBLOSTN                                                 02819000
SCBSOHE  EQU   SCBERR2                                                  02820000
SCBFRWDN EQU   SCBERR2                                                  02821000
SCBRRJN  EQU   SCBABRTN                                                 02822000
SCBOLTR  EQU   SCBERR2                                                  02823000
SCBALN   EQU   SCBERR2                                                  02824000
SCBCODER EQU   SCBERR2                                                  02825000
SCBCRMAX EQU   SCBERR2                                                  02826000
SCBCRMIN EQU   SCBERR2                                                  02827000
SCBRVISL EQU   SCBCUTFN                                                 02828000
SCBNOBFN EQU   SCBERR1                                                  02829000
@NM00257 EQU   SCBERR1                                                  02830000
SCBNOVAC EQU   SCBSEQLN                                                 02831000
SCBNOTSO EQU   SCBSEQHN                                                 02832000
SCBRVITX EQU   SCBNOTRM                                                 02833000
SCBHANG  EQU   SCBORIGN                                                 02834000
SCBNOLOG EQU   SCBHDRRN                                                 02835000
SCBMRFPL EQU   IEDQSCB+13                                               02836000
SCBBFMM  EQU   SCBQTYPE                                                 02837000
SCBBBFTM EQU   SCBQTYPE                                                 02838000
SCBNOFF  EQU   SCBQTYPE                                                 02839000
SCBCONC  EQU   SCBQTYPE                                                 02840000
SCBNREUS EQU   SCBQTYPE                                                 02841000
SCBREUS  EQU   SCBQTYPE                                                 02842000
SCBCOREQ EQU   SCBQTYPE                                                 02843000
SCBNORCL EQU   SCBQTYPE                                                 02844000
SCBCTBSZ EQU   SCBEOBSZ                                                 02845000
@NM00256 EQU   SCBBKFCT                                                 02846000
SCBPRI   EQU   IEDQSCB+8                                                02847000
SCBMACR  EQU   SCBMBHEN                                                 02848000
SCBSNDCT EQU   SCBRCVCT                                                 02849000
SCBCODE  EQU   SCBSTATE                                                 02850000
SCBPRER  EQU   SCBSTATE                                                 02851000
SCBCKPT  EQU   SCBSTATE                                                 02852000
SCBMSGLN EQU   SCBSTATE                                                 02853000
SCBERSDS EQU   SCBSTATE                                                 02854000
SCBLCK1N EQU   SCBSTATE                                                 02855000
SCBMGFMN EQU   SCBSEQIN                                                 02856000
SCBTRANP EQU   SCBSTATE                                                 02857000
@NM00255 EQU   TRHBYTE2                                                 02858000
@NM00254 EQU   TRHBYTE2                                                 02859000
@NM00253 EQU   TRHBYTE2                                                 02860000
TRHCSI   EQU   TRHBYTE2                                                 02861000
@NM00252 EQU   TRHBYTE2                                                 02862000
TRHEB    EQU   TRHBYTE2                                                 02863000
TRHPI    EQU   TRHBYTE1                                                 02864000
@NM00251 EQU   TRHBYTE1                                                 02865000
@NM00250 EQU   TRHBYTE1                                                 02866000
@NM00249 EQU   TRHBYTE1                                                 02867000
TRHER    EQU   TRHBYTE1                                                 02868000
TRHDR2   EQU   TRHBYTE1                                                 02869000
@NM00248 EQU   TRHBYTE1                                                 02870000
TRHDR1   EQU   TRHBYTE1                                                 02871000
TRHEC    EQU   TRHBYTE0                                                 02872000
TRHBC    EQU   TRHBYTE0                                                 02873000
TRHSDI   EQU   TRHBYTE0                                                 02874000
TRHFI    EQU   TRHBYTE0                                                 02875000
@NM00247 EQU   TRHBYTE0                                                 02876000
TRHRUCAT EQU   TRHBYTE0                                                 02877000
TRHTYPE  EQU   TRHBYTE0                                                 02878000
RESAPDCB EQU   IEDRESPL+180                                             02879000
RESTLIB  EQU   IEDRESPL+176                                             02880000
RESPL33  EQU   RESPLADR+76                                              02881000
RESPL25  EQU   RESPLADR+72                                              02882000
RESPLM2  EQU   RESPLADR+68                                              02883000
RESPL47  EQU   RESPLADR+64                                              02884000
RESPL44  EQU   RESPLADR+60                                              02885000
RESPL43  EQU   RESPL42                                                  02886000
RESPL16  EQU   RESPLADR+52                                              02887000
RESPL41  EQU   RESPLADR+48                                              02888000
RESPL21  EQU   RESPLAC                                                  02889000
RESPL36  EQU   RESPLADR+40                                              02890000
RESPL28  EQU   RESPLADR+36                                              02891000
RESPL37  EQU   RESPLADR+32                                              02892000
RESPLP2  EQU   RESPLADR+28                                              02893000
RESPLP1  EQU   RESPLADR+24                                              02894000
RESPL39  EQU   RESPLADR+20                                              02895000
RESPLAA  EQU   RESPLADR+16                                              02896000
RESPL35  EQU   RESPLADR+12                                              02897000
RESPLAJ  EQU   RESPLADR+8                                               02898000
RESPLAB  EQU   RESPLADR+4                                               02899000
RESPLWO  EQU   RESPLADR                                                 02900000
RESTOTMH EQU   IEDRESPL+92                                              02901000
RESMHNAT EQU   IEDRESPL+90                                              02902000
RESFBUF  EQU   IEDRESPL+84                                              02903000
RESADDAF EQU   RESQHBL+12                                               02904000
RESADDND EQU   RESQHBL+8                                                02905000
RESREMEL EQU   RESQHBL+4                                                02906000
RESREMFR EQU   RESQHBL                                                  02907000
RESTNTPT EQU   IEDRESPL+57                                              02908000
@NM00246 EQU   IEDRESPL+56                                              02909000
RESTRMQ  EQU   IEDRESPL+52                                              02910000
@NM00245 EQU   IEDRESPL+50                                              02911000
@NM00244 EQU   RESFLAGS                                                 02912000
RESFIRST EQU   RESFLAGS                                                 02913000
RESINIT  EQU   RESFLAGS                                                 02914000
RESWBFNC EQU   IEDRESPL+48                                              02915000
RESSMGRA EQU   IEDRESPL+44                                              02916000
RESSTAEA EQU   IEDRESPL+40                                              02917000
RESETXRA EQU   IEDRESPL+36                                              02918000
RESDMTTE EQU   IEDRESPL+33                                              02919000
RESTNTCT EQU   IEDRESPL+32                                              02920000
RESEFQCB EQU   IEDRESPL+28                                              02921000
RESBKAVL EQU   IEDRESPL+26                                              02922000
RESBKTOT EQU   IEDRESPL+24                                              02923000
RESTTLST EQU   IEDRESPL+20                                              02924000
RESOBBKW EQU   RESOBQCB+4                                               02925000
RESOBFWD EQU   RESOBQCB                                                 02926000
RESTECB1 EQU   IEDRESPL+8                                               02927000
@NM00243 EQU   IEDRESPL+5                                               02928000
@NM00242 EQU   IEDRESPL+4                                               02929000
RESTECBS EQU   IEDRESPL                                                 02930000
PRF2SEQP EQU   PRF2WD2                                                  02931000
@NM00241 EQU   IEDPF2+1                                                 02932000
@NM00240 EQU   PRF2FLG2                                                 02933000
PRF2TERM EQU   PRF2FLG2                                                 02934000
PRF2SMI  EQU   PRF2FLG2                                                 02935000
PRF2FORM EQU   PRF2FLG2                                                 02936000
PRF2TNTI EQU   PRF2FLG2                                                 02937000
PRF1RULN EQU   PRF1SEQP+2                                               02938000
PRF1TAG2 EQU   PRF1SQID+1                                               02939000
@NM00239 EQU   PRF1TAG1                                                 02940000
PRF1TAGS EQU   PRF1TAG1                                                 02941000
@NM00238 EQU   PRF1FLG1                                                 02942000
PRF1LOGD EQU   PRF1FLG1                                                 02943000
PRF1USS  EQU   PRF1FLG1                                                 02944000
PRF1EXPI EQU   PRF1FLG1                                                 02945000
PRFISEQ  EQU   IEDQPRF+38                                               02946000
PRFSTXT  EQU   PRFHQBCK                                                 02947000
PRFNHDR  EQU   PRFCHDR                                                  02948000
PRFCRCD  EQU   IEDQPRF+29                                               02949000
PRFSVSEQ EQU   PRFNTXT+1                                                02950000
PRFSVPRI EQU   PRFEOBOF                                                 02951000
PRFISIZE EQU   PRFSCAN+1                                                02952000
@NM00237 EQU   PRFSCAN                                                  02953000
PRFEOB   EQU   PRFXTRA+1                                                02954000
PRFSTSO  EQU   PRFXTRA                                                  02955000
PRFNHDRN EQU   PRFSTAT1                                                 02956000
PRFNLSTN EQU   PRFSTAT1                                                 02957000
PRFLOCK  EQU   PRFEOFN                                                  02958000
PRFDUPLN EQU   PRFSTAT1                                                 02959000
PRFTSMSG EQU   PRFSTAT1                                                 02960000
PRFITCPN EQU   PRFSTAT1                                                 02961000
PRFERMGN EQU   PRFSTAT1                                                 02962000
PRFCNCLN EQU   PRFSTAT1                                                 02963000
PRFSVFLG EQU   @NM00236+3                                               02964000
PRFPIUO  EQU   PRFPLQCB                                                 02965000
PRFTI0   EQU   PRFTIC+1                                                 02966000
@NM00235 EQU   PRFTICC                                                  02967000
@NM00234 EQU   PRFTICC                                                  02968000
@NM00233 EQU   PRFTICC                                                  02969000
PRFTICON EQU   PRFTICC                                                  02970000
@NM00232 EQU   PRFTICC                                                  02971000
@NM00231 EQU   PRFTICC                                                  02972000
PRFBFMM  EQU   PRFTICC                                                  02973000
PRFEOMSG EQU   PRFTICC                                                  02974000
PRFCOUNT EQU   PRFLINK+1                                                02975000
@NM00230 EQU   PRFLINK                                                  02976000
PRFFLAGS EQU   PRFPRI                                                   02977000
PRFIOADR EQU   PRFQCBA                                                  02978000
PRFOPCDE EQU   PRFKEY                                                   02979000
PLMVUNCA EQU   IEDPLMV+20                                               02980000
@NM00229 EQU   PLMVFLG1                                                 02981000
PLMVTCTG EQU   PLMVFLG1                                                 02982000
PLMVUNCF EQU   PLMVFLG1                                                 02983000
TOTOBEND EQU   TOTOLTCB+2100                                            02984000
TOTSERV  EQU   TOTOLTCB+2096                                            02985000
@NM00228 EQU   TOTOLTCB+2044                                            02986000
TOTOLTEN EQU   TOTOLTCB+1820                                            02987000
TOTAPNAM EQU   TOTOLTCB+1812                                            02988000
TOTGRABP EQU   TOTOLTCB+1808                                            02989000
TOTWAITI EQU   TOTOLTCB+1800                                            02990000
@NM00227 EQU   TOTOLTCB+1798                                            02991000
TOTTLCNT EQU   TOTOLTCB+1796                                            02992000
TOTECBPT EQU   TOTOLTCB+1792                                            02993000
TOTWECBA EQU   TOTOLTCB+1788                                            02994000
TOTTDEND EQU   TOTOLTCB+1788                                            02995000
@NM00226 EQU   TOTTDTBL+1                                               02996000
TOTTSWPM EQU   @NM00225                                                 02997000
TOTTDIAC EQU   @NM00225                                                 02998000
TOTTDTHD EQU   @NM00225                                                 02999000
TOTTDLST EQU   @NM00225                                                 03000000
TOTTDORN EQU   @NM00225                                                 03001000
TOTTDGRB EQU   @NM00225                                                 03002000
TOTTDLIN EQU   @NM00225                                                 03003000
TOTTDTRM EQU   @NM00225                                                 03004000
@NM00224 EQU   TOTOLTCB+1710                                            03005000
TOTCONND EQU   TOTOLTCB+1710                                            03006000
TOTCONAP EQU   TOTOLTCB+1709                                            03007000
TOTCONCT EQU   TOTOLTCB+1708                                            03008000
TOTCONTB EQU   TOTOLTCB+1698                                            03009000
TOTOLTTE EQU   TOTOLTCB+1698                                            03010000
TOTOLTTB EQU   TOTOLTCB+1668                                            03011000
TOTTRMND EQU   TOTCROLT                                                 03012000
TOTSCDEB EQU   TOTSCDCB+44                                              03013000
@NM00223 EQU   TOTSCDCB                                                 03014000
TOTSCIOB EQU   TOTOLTCB+1544                                            03015000
TOTSTECB EQU   TOTOLTCB+1540                                            03016000
TOTSCSEQ EQU   TOTSCSN+2                                                03017000
@NM00222 EQU   TOTSCSN                                                  03018000
@NM00221 EQU   TOTOLTCB+1535                                            03019000
TOTSFLGS EQU   TOTOLTCB+1534                                            03020000
TOTSDTCT EQU   TOTOLTCB+1532                                            03021000
TOTSDTBF EQU   TOTOLTCB+1528                                            03022000
TOTSCBUF EQU   TOTSCENT+32                                              03023000
TOTSCCCW EQU   TOTSCENT+28                                              03024000
TOTSCQCB EQU   TOTSCENT+24                                              03025000
@NM00220 EQU   TOTSCENT+23                                              03026000
@NM00219 EQU   TOTSCFLG                                                 03027000
TOTSEXNM EQU   TOTSCFLG                                                 03028000
TOTSCFME EQU   TOTSCFLG                                                 03029000
TOTSCEX  EQU   TOTSCFLG                                                 03030000
TOTSUNRD EQU   TOTSCFLG                                                 03031000
TOTSPRSC EQU   TOTSCFLG                                                 03032000
TOTSCLU  EQU   TOTSCFLG                                                 03033000
TOTSCTAS EQU   TOTSCFLG                                                 03034000
TOTSCLEN EQU   TOTSCENT+20                                              03035000
TOTSRTNT EQU   TOTSCENT+16                                              03036000
TOTSDTNT EQU   TOTSCENT+12                                              03037000
TOTSCLCB EQU   TOTSCENT+9                                               03038000
TOTSCRLN EQU   TOTSCENT+8                                               03039000
TOTSRSID EQU   TOTSCENT+6                                               03040000
TOTSCOFF EQU   TOTSCENT+4                                               03041000
TOTNCOFF EQU   TOTSCENT+2                                               03042000
TOTSCUCB EQU   TOTSCENT                                                 03043000
TOTSCIBK EQU   TOTSCECB                                                 03044000
TOTPRDEB EQU   TOTPRDCB+44                                              03045000
@NM00218 EQU   TOTPRDCB                                                 03046000
TOTPRIOB EQU   TOTOLTCB+1372                                            03047000
TOTPTECB EQU   TOTOLTCB+1368                                            03048000
TOTPRSEQ EQU   TOTPRSN+2                                                03049000
@NM00217 EQU   TOTPRSN                                                  03050000
@NM00216 EQU   TOTOLTCB+1363                                            03051000
TOTPFLGS EQU   TOTOLTCB+1362                                            03052000
TOTPDTCT EQU   TOTOLTCB+1360                                            03053000
TOTPDTBF EQU   TOTOLTCB+1356                                            03054000
TOTPRBUF EQU   TOTPRENT+32                                              03055000
TOTPRCCW EQU   TOTPRENT+28                                              03056000
TOTPRQCB EQU   TOTPRENT+24                                              03057000
@NM00215 EQU   TOTPRENT+23                                              03058000
@NM00214 EQU   TOTPRFLG                                                 03059000
TOTPEXNM EQU   TOTPRFLG                                                 03060000
TOTPRFME EQU   TOTPRFLG                                                 03061000
TOTPREX  EQU   TOTPRFLG                                                 03062000
TOTPUNRD EQU   TOTPRFLG                                                 03063000
TOTPPRSC EQU   TOTPRFLG                                                 03064000
TOTPRLU  EQU   TOTPRFLG                                                 03065000
TOTPRTAS EQU   TOTPRFLG                                                 03066000
TOTPRLEN EQU   TOTPRENT+20                                              03067000
TOTTNTPR EQU   TOTPRENT+16                                              03068000
TOTPDTNT EQU   TOTPRENT+12                                              03069000
TOTPRLCB EQU   TOTPRENT+9                                               03070000
TOTPRRLN EQU   TOTPRENT+8                                               03071000
TOTPRSID EQU   TOTPRENT+6                                               03072000
TOTPROFF EQU   TOTPRENT+4                                               03073000
TOTPCOFF EQU   TOTPRENT+2                                               03074000
TOTPRUCB EQU   TOTPRENT                                                 03075000
TOTTRMBF EQU   TOTPRIBK                                                 03076000
TOTPASS  EQU   TOTOLTCB+1252                                            03077000
TOTEXT   EQU   TOTOLTCB+1196                                            03078000
@NM00213 EQU   TOTOLTCB+1195                                            03079000
TOTOLTRS EQU   TOTFLG10                                                 03080000
TOTOLTWT EQU   TOTFLG10                                                 03081000
TOTOLTED EQU   TOTFLG10                                                 03082000
TOTTNTRQ EQU   TOTFLG10                                                 03083000
@NM00212 EQU   TOTFLG10                                                 03084000
@NM00211 EQU   TOTFLG10                                                 03085000
@NM00210 EQU   TOTFLG10                                                 03086000
TOTTERMS EQU   TOTFLG10                                                 03087000
TOTMACFT EQU   TOTFLG09                                                 03088000
TOTLNCON EQU   TOTFLG09                                                 03089000
TOTNOBRK EQU   TOTFLG09                                                 03090000
TOTAPTRM EQU   TOTFLG09                                                 03091000
@NM00209 EQU   TOTFLG08                                                 03092000
TOTMSSRC EQU   TOTFLG07                                                 03093000
TOTMSPRT EQU   TOTFLG07                                                 03094000
TOTMSREP EQU   TOTFLG07                                                 03095000
TOTMSCEC EQU   TOTFLG07                                                 03096000
@NM00208 EQU   TOTFLG07                                                 03097000
@NM00207 EQU   TOTFLG07                                                 03098000
TOTSECEX EQU   TOTFLG07                                                 03099000
TOTPRIEX EQU   TOTFLG07                                                 03100000
TOTNPERR EQU   TOTFLG06                                                 03101000
TOTOTACT EQU   TOTFLG06                                                 03102000
TOTCANCL EQU   TOTFLG06                                                 03103000
TOTABEND EQU   TOTFLG06                                                 03104000
TOTNCMFG EQU   TOTFLG06                                                 03105000
TOTWACAN EQU   TOTFLG06                                                 03106000
TOTCBOPN EQU   TOTFLG06                                                 03107000
TOTOTERM EQU   TOTFLG06                                                 03108000
TOTNDMSG EQU   TOTFLG05                                                 03109000
TOTEXIOF EQU   TOTFLG05                                                 03110000
TOTTMOUT EQU   TOTFLG05                                                 03111000
TOTSRCON EQU   TOTFLG05                                                 03112000
TOTTTSWT EQU   TOTFLG04                                                 03113000
@NM00206 EQU   TOTFLG04                                                 03114000
@NM00205 EQU   TOTFLG04                                                 03115000
TOTSCCTF EQU   TOTFLG04                                                 03116000
TOTPRCTF EQU   TOTFLG04                                                 03117000
TOTCLOSE EQU   TOTFLG04                                                 03118000
TOTDTCHD EQU   TOTFLG04                                                 03119000
TOTNUMDV EQU   TOTFLG04                                                 03120000
@NM00204 EQU   TOTFLG03                                                 03121000
TOTREPEX EQU   TOTFLG03                                                 03122000
TOTTSINC EQU   TOTFLG03                                                 03123000
TOTIMNCP EQU   TOTFLG03                                                 03124000
TOTOPTER EQU   TOTFLG03                                                 03125000
TOTTSTER EQU   TOTFLG03                                                 03126000
TOTTDFER EQU   TOTFLG03                                                 03127000
TOTAPOER EQU   TOTFLG03                                                 03128000
TOTDEVRN EQU   TOTFLG02                                                 03129000
TOTCONCU EQU   TOTFLG02                                                 03130000
TOTCONMD EQU   TOTFLG02                                                 03131000
TOTCHKSZ EQU   TOTFLG02                                                 03132000
TOTOLTRQ EQU   TOTFLG02                                                 03133000
TOTDEV0X EQU   TOTFLG02                                                 03134000
TOTTSST  EQU   TOTFLG02                                                 03135000
TOTTTSPE EQU   TOTFLG02                                                 03136000
TOTCLNED EQU   TOTFLG01                                                 03137000
TOTCLNST EQU   TOTFLG01                                                 03138000
TOTPRMPT EQU   TOTFLG01                                                 03139000
TOTAPTST EQU   TOTFLG01                                                 03140000
TOTIPLCU EQU   TOTFLG01                                                 03141000
TOTCONFG EQU   TOTFLG01                                                 03142000
TOTFINAL EQU   TOTFLG01                                                 03143000
TOTSTAE  EQU   TOTOLTCB+1176                                            03144000
@NM00203 EQU   TOTOLTCB+1152                                            03145000
TOTWKEND EQU   TOTOLTCB+1152                                            03146000
@NM00202 EQU   TOTOLTCB+1020                                            03147000
TOTPLBKW EQU   TOTPLNKQ+4                                               03148000
TOTPLFWD EQU   TOTPLNKQ                                                 03149000
@NM00201 EQU   TOTOLTCB+1011                                            03150000
TOTRTCOD EQU   TOTOLTCB+1010                                            03151000
TOTOLTID EQU   TOTOLTCB+1008                                            03152000
@NM00200 EQU   TOTWTOPL+2                                               03153000
@NM00199 EQU   TOTWTOPL                                                 03154000
TOTINECB EQU   TOTWTORP+4                                               03155000
TOTINADR EQU   TOTWTORP+1                                               03156000
TOT#TBLE EQU   TOTOLTPL+8                                               03157000
@NM00198 EQU   TOTOLTPL                                                 03158000
TOTCMPCD EQU   TOTOLTCB+816                                             03159000
TOTTCBAD EQU   TOTOLTCB+812                                             03160000
TOTRESSV EQU   TOTOLTCB+808                                             03161000
TOTOLTMQ EQU   TOTOLTCB+800                                             03162000
TOTPARML EQU   TOTOLTCB+796                                             03163000
@NM00197 EQU   TOTOLTCB+768                                             03164000
@NM00196 EQU   TOTAPDFL                                                 03165000
TOTAPIAC EQU   TOTAPDFL                                                 03166000
TOTAPHD  EQU   TOTAPDFL                                                 03167000
TOTAPLST EQU   TOTAPDFL                                                 03168000
TOTAPGP  EQU   TOTAPDFL                                                 03169000
@NM00195 EQU   TOTAPDFL                                                 03170000
TOTAPLIN EQU   TOTAPDFL                                                 03171000
TOTAPTER EQU   TOTAPDFL                                                 03172000
TOTAPRNL EQU   TOTAPENT+23                                              03173000
TOTAPEND EQU   TOTAPENT+23                                              03174000
TOTAPSWD EQU   TOTAPFLG                                                 03175000
@NM00194 EQU   TOTAPFLG                                                 03176000
TOTAPASN EQU   TOTAPFLG                                                 03177000
TOTAPTLN EQU   TOTAPENT+20                                              03178000
TOTARTNT EQU   TOTAPENT+16                                              03179000
TOTAPTNT EQU   TOTAPENT+12                                              03180000
TOTAPLCB EQU   TOTAPENT+9                                               03181000
TOTAPRLN EQU   TOTAPENT+8                                               03182000
TOTARSID EQU   TOTAPENT+6                                               03183000
TOTAROFF EQU   TOTAPENT+4                                               03184000
TOTAPOFF EQU   TOTAPENT+2                                               03185000
TOTAPUCB EQU   TOTAPENT                                                 03186000
TOTUSCOR EQU   TOTOLTCB+732                                             03187000
TOTOPCLN EQU   TOTOLTCB+728                                             03188000
@NM00193 EQU   TOTOLTCB+690                                             03189000
@NM00192 EQU   TOTOECBA+1                                               03190000
@NM00191 EQU   TOTOFLG                                                  03191000
TOTWOOPC EQU   TOTOLTCB+640                                             03192000
TOTCURS4 EQU   TOTCUTST+11                                              03193000
TOTCURS3 EQU   TOTCUTST+10                                              03194000
TOTCURS2 EQU   TOTCUTST+9                                               03195000
TOTCURS1 EQU   TOTCUTST+8                                               03196000
TOTCUSAV EQU   TOTCUTST+4                                               03197000
TOTCUCUU EQU   TOTCUTST+2                                               03198000
TOTCU#AD EQU   TOTCUTST+1                                               03199000
@NM00190 EQU   TOTCUFLG                                                 03200000
TOTCUCUP EQU   TOTCUFLG                                                 03201000
TOTCUDON EQU   TOTCUFLG                                                 03202000
@NM00189 EQU   TOTOLTCB+625                                             03203000
@NM00188 EQU   TOTCTDFL                                                 03204000
TOTCTIAC EQU   TOTCTDFL                                                 03205000
TOTCTHD  EQU   TOTCTDFL                                                 03206000
TOTCTLST EQU   TOTCTDFL                                                 03207000
TOTCTGP  EQU   TOTCTDFL                                                 03208000
@NM00187 EQU   TOTCTDFL                                                 03209000
TOTCTLIN EQU   TOTCTDFL                                                 03210000
TOTCTTRM EQU   TOTCTDFL                                                 03211000
TOTCTNAM EQU   TOTCTENT+31                                              03212000
TOTCTRNL EQU   TOTCTENT+23                                              03213000
TOTCTEND EQU   TOTCTENT+23                                              03214000
TOTCTSWD EQU   TOTCTFLG                                                 03215000
@NM00186 EQU   TOTCTFLG                                                 03216000
TOTCTASN EQU   TOTCTFLG                                                 03217000
TOTCTTLN EQU   TOTCTENT+20                                              03218000
TOTCRTNT EQU   TOTCTENT+16                                              03219000
TOTCTTNT EQU   TOTCTENT+12                                              03220000
TOTCTLCB EQU   TOTCTENT+9                                               03221000
TOTCTRLN EQU   TOTCTENT+8                                               03222000
TOTCRSID EQU   TOTCTENT+6                                               03223000
TOTCROFF EQU   TOTCTENT+4                                               03224000
TOTCTOFF EQU   TOTCTENT+2                                               03225000
TOTCTUCB EQU   TOTCTENT                                                 03226000
@NM00185 EQU   TOTSRENT+2                                               03227000
TOTMMSPC EQU   TOTOLTCB+572                                             03228000
TOTBKRQD EQU   TOTOLTCB+570                                             03229000
TOTBKASN EQU   TOTOLTCB+568                                             03230000
TOTSVEND EQU   TOTOLTCB+568                                             03231000
TOTWOSV1 EQU   TOTOLTCB+552                                             03232000
@NM00184 EQU   TOTSAVE5+68                                              03233000
TOTOLTEP EQU   TOTSAVE5+64                                              03234000
@NM00183 EQU   TOTSAVE5+48                                              03235000
TOTOLTPT EQU   TOTSAVE5+44                                              03236000
@NM00182 EQU   TOTSAVE5                                                 03237000
TOTSAVE4 EQU   TOTOLTCB+336                                             03238000
TOTSAVE3 EQU   TOTOLTCB+264                                             03239000
TOTSAVE1 EQU   TOTOLTCB+120                                             03240000
TOTSMGRT EQU   TOTOLTCB+116                                             03241000
@NM00181 EQU   $SCTTBLE+92                                              03242000
$EXT     EQU   $SCTTBLE+88                                              03243000
$PASS    EQU   $SCTTBLE+84                                              03244000
$TABLE   EQU   $SCTTBLE+80                                              03245000
$MSGIDAC EQU   $SCTTBLE+78                                              03246000
@NM00180 EQU   $SCTTBLE+72                                              03247000
@NM00179 EQU   $SCTTBLE+71                                              03248000
$RETMASK EQU   $SCTTBLE+70                                              03249000
$R249255 EQU   $SCTTBLE+69                                              03250000
$R241248 EQU   $SCTTBLE+68                                              03251000
$R233240 EQU   $SCTTBLE+67                                              03252000
$R225232 EQU   $SCTTBLE+66                                              03253000
$R217224 EQU   $SCTTBLE+65                                              03254000
$R209216 EQU   $SCTTBLE+64                                              03255000
$R201208 EQU   $SCTTBLE+63                                              03256000
$R193200 EQU   $SCTTBLE+62                                              03257000
$R185192 EQU   $SCTTBLE+61                                              03258000
$R177184 EQU   $SCTTBLE+60                                              03259000
$R169176 EQU   $SCTTBLE+59                                              03260000
$R161168 EQU   $SCTTBLE+58                                              03261000
$R153160 EQU   $SCTTBLE+57                                              03262000
$R145152 EQU   $SCTTBLE+56                                              03263000
$R137144 EQU   $SCTTBLE+55                                              03264000
$R129136 EQU   $SCTTBLE+54                                              03265000
$R121128 EQU   $SCTTBLE+53                                              03266000
$R113120 EQU   $SCTTBLE+52                                              03267000
$R105112 EQU   $SCTTBLE+51                                              03268000
$R097104 EQU   $SCTTBLE+50                                              03269000
$R089096 EQU   $SCTTBLE+49                                              03270000
$R081088 EQU   $SCTTBLE+48                                              03271000
$R073080 EQU   $SCTTBLE+47                                              03272000
$R065072 EQU   $SCTTBLE+46                                              03273000
$R057064 EQU   $SCTTBLE+45                                              03274000
$R049056 EQU   $SCTTBLE+44                                              03275000
$R041048 EQU   $SCTTBLE+43                                              03276000
$R033040 EQU   $SCTTBLE+42                                              03277000
$R025032 EQU   $SCTTBLE+41                                              03278000
$R017024 EQU   $SCTTBLE+40                                              03279000
$TOTFLG2 EQU   $SCTTBLE+39                                              03280000
@NM00178 EQU   $TOTFLG1                                                 03281000
$CTEQTT  EQU   $TOTFLG1                                                 03282000
$TERMSEC EQU   $TOTFLG1                                                 03283000
$TDATBLK EQU   $TOTFLG1                                                 03284000
$LINESHR EQU   $TOTFLG1                                                 03285000
@NM00177 EQU   $SCTTBLE+37                                              03286000
@NM00176 EQU   $OLTFLGS                                                 03287000
$LASTSEC EQU   $OLTFLGS                                                 03288000
$TRACE   EQU   $OLTFLGS                                                 03289000
$RETCODE EQU   $OLTFLGS                                                 03290000
$CONTCB  EQU   $OLTFLGS                                                 03291000
$RETAIN  EQU   $OLTFLGS                                                 03292000
$CLEANRT EQU   $OLTFLGS                                                 03293000
$MANINTV EQU   $OLTFLGS                                                 03294000
$OLTSIZE EQU   $SCTTBLE+34                                              03295000
$QSCTMOD EQU   $EXECFLG                                                 03296000
$CTRLMOD EQU   $EXECFLG                                                 03297000
$CLEANUP EQU   $EXECFLG                                                 03298000
$LSTPDEV EQU   $EXECFLG                                                 03299000
$ERRCNT  EQU   $EXECFLG                                                 03300000
$RTNSLCT EQU   $EXECFLG                                                 03301000
$MULTDEV EQU   $EXECFLG                                                 03302000
$CECCMIN EQU   $EXECFLG                                                 03303000
$RMSKCNT EQU   $SCTTBLE+32                                              03304000
$CDS8T19 EQU   $SCTTBLE+20                                              03305000
$PDEVDSC EQU   $SCTTBLE+16                                              03306000
$PDEVADR EQU   $SCTTBLE+12                                              03307000
$COMMCN  EQU   $CDSFLGS                                                 03308000
$CUSTSYM EQU   $CDSFLGS                                                 03309000
$TWOCHSW EQU   $CDSFLGS                                                 03310000
$SYMNAME EQU   $CDSFLGS                                                 03311000
$EXTINTC EQU   $CDSFLGS                                                 03312000
$CEVOL   EQU   $CDSFLGS                                                 03313000
$SHARED  EQU   $CDSFLGS                                                 03314000
$FPM     EQU   $CDSFLGS                                                 03315000
$LASTSUB EQU   $PDEVFLG                                                 03316000
$PATHDEF EQU   $PDEVFLG                                                 03317000
$TERMNDX EQU   $PDEVFLG                                                 03318000
@NM00175 EQU   $PDEVFLG                                                 03319000
$LASTDEV EQU   $PDEVFLG                                                 03320000
$TSSSYS1 EQU   $PDEVFLG                                                 03321000
$EXFILPT EQU   $PDEVFLG                                                 03322000
$FPMOLD  EQU   $PDEVFLG                                                 03323000
$TSSSYM  EQU   $SCTTBLE+8                                               03324000
$SPARE1  EQU   $SCTTBLE+7                                               03325000
$DRIVER  EQU   $SCTTBLE+6                                               03326000
$RT0916  EQU   $SCTTBLE+5                                               03327000
$RT0108  EQU   $SCTTBLE+4                                               03328000
$LOOPTST EQU   $ERROPT                                                  03329000
$LOOPERR EQU   $ERROPT                                                  03330000
$NERRPRT EQU   $ERROPT                                                  03331000
$NOCNTRL EQU   $ERROPT                                                  03332000
$ALTPRNT EQU   $ERROPT                                                  03333000
$CATERR  EQU   $ERROPT                                                  03334000
$ASTERIK EQU   $ERROPT                                                  03335000
$TESTERR EQU   $ERROPT                                                  03336000
$FSTCOMM EQU   $TESTOPT                                                 03337000
$INDEFLP EQU   $TESTOPT                                                 03338000
$NOPRT   EQU   $TESTOPT                                                 03339000
@NM00174 EQU   $TESTOPT                                                 03340000
$ERRLPCT EQU   $SCTTBLE                                                 03341000
LCBERADR EQU   LCBXRADR+1                                               03342000
LCBPCIRC EQU   LCBXRADR                                                 03343000
LCBDCT3  EQU   LCBXDCT+2                                                03344000
LCBDCT2  EQU   LCBXDCT+1                                                03345000
LCBDCT1  EQU   LCBXDCT                                                  03346000
@NM00173 EQU   LCBXFLAG                                                 03347000
LCBERPND EQU   LCBXFLAG                                                 03348000
LCBSRCPF EQU   LCBXFLAG                                                 03349000
LCBGPCTV EQU   LCBXFLAG                                                 03350000
@NM00172 EQU   LCBXFLAG                                                 03351000
@NM00171 EQU   LCBXFLAG                                                 03352000
@NM00170 EQU   LCBXFLAG                                                 03353000
@NM00169 EQU   LCBXFLAG                                                 03354000
LCBCCW10 EQU   LCBCPA+72                                                03355000
LCBCCW9  EQU   LCBCPA+64                                                03356000
LCBCCW8  EQU   LCBCPA+56                                                03357000
LCBCCW7  EQU   LCBCPA+48                                                03358000
LCBCCW6  EQU   LCBCPA+40                                                03359000
LCBCP    EQU   LCBQEBPL+4                                               03360000
LCBIOSB  EQU   LCBQEBPL+1                                               03361000
LCBSIO   EQU   LCBQEBPL                                                 03362000
LCBCCW4  EQU   LCBCPA+24                                                03363000
LCBCCW3  EQU   LCBCPA+16                                                03364000
LCBCCW2  EQU   LCBCPA+8                                                 03365000
LCBCCW1  EQU   LCBCPA                                                   03366000
@NM00154 EQU   LCBERCCW+16                                              03367000
LCBATL05 EQU   LCBERCCW+8                                               03368000
@NM00153 EQU   LCBERCCW                                                 03369000
LCBCSWSV EQU   LCBSAVSN+1                                               03370000
LCBSNSV  EQU   LCBSAVSN                                                 03371000
LCBBFSNS EQU   LCBRSPSV                                                 03372000
LCBWAITC EQU   LCBTPCD+5                                                03373000
LCBINPAK EQU   LCBSTAT6                                                 03374000
LCBMHBID EQU   LCBSTAT6                                                 03375000
LCBRTRRO EQU   LCBSTAT6                                                 03376000
LCBHDRPD EQU   LCBSTAT6                                                 03377000
LCBCHN   EQU   LCBSTAT6                                                 03378000
LCBBFRSV EQU   LCBTPCD+1                                                03379000
@NM00152 EQU   LCBSTAT5                                                 03380000
LCBLUS   EQU   LCBSTAT5                                                 03381000
LCBLUNIT EQU   LCBSTAT5                                                 03382000
LCBPERM  EQU   LCBSTAT5                                                 03383000
LCBNXCMD EQU   LCBBFRW                                                  03384000
LCBERMSK EQU   LCBOBRCH                                                 03385000
LCBOLT   EQU   LCBMSGFM                                                 03386000
LCBEOT   EQU   LCBMSGFM                                                 03387000
LCBENQ   EQU   LCBMSGFM                                                 03388000
LCBTTD   EQU   LCBMSGFM                                                 03389000
LCBRSTRT EQU   LCBMSGFM                                                 03390000
LCBVSTRT EQU   LCBMSGFM                                                 03391000
LCBACKI  EQU   LCBMSGFM                                                 03392000
LCBNAK   EQU   LCBMSGFM                                                 03393000
LCBTTCIN EQU   IEDQLCB+90                                               03394000
@NM00151 EQU   LCBRBCT2                                                 03395000
LCBDCNT  EQU   LCBRBCT2                                                 03396000
LCBRBCT1 EQU   LCBERBCT                                                 03397000
LCBERBCH EQU   IEDQLCB+85                                               03398000
LCBCOMPL EQU   LCBDLNKN                                                 03399000
LCBPRCPG EQU   LCBERBST                                                 03400000
LCBERROR EQU   LCBERBST                                                 03401000
LCBLOGDV EQU   LCBERBST                                                 03402000
LCBINQ   EQU   LCBERBST                                                 03403000
LCBRDERR EQU   LCBERBST                                                 03404000
LCBEOMSG EQU   LCBERBST                                                 03405000
LCBMSG   EQU   LCBERBST                                                 03406000
LCBERBLK EQU   IEDQLCB+81                                               03407000
LCBERBPY EQU   IEDQLCB+80                                               03408000
LCBERBQB EQU   LCBERB+1                                                 03409000
LCBERBKY EQU   LCBERB                                                   03410000
LCBRECAD EQU   IEDQLCB+73                                               03411000
@NM00150 EQU   LCBTSTSW                                                 03412000
@NM00149 EQU   LCBTSTSW                                                 03413000
@NM00148 EQU   LCBTSTSW                                                 03414000
@NM00147 EQU   LCBTSTSW                                                 03415000
@NM00146 EQU   LCBTSTSW                                                 03416000
@NM00145 EQU   LCBTSTSW                                                 03417000
@NM00144 EQU   LCBTSTSW                                                 03418000
LCBCONCT EQU   LCBTSTSW                                                 03419000
LCBRESP  EQU   LCBSTAT2                                                 03420000
LCBBFRAV EQU   LCBDIAL                                                  03421000
LCBATTN  EQU   LCBSYNC                                                  03422000
LCBNEGRP EQU   LCBSTAT2                                                 03423000
LCBSNDPR EQU   LCBSTAT2                                                 03424000
LCBCONNN EQU   LCBBEOTN                                                 03425000
LCBMSGNN EQU   LCBSTAT2                                                 03426000
LCBTRACE EQU   LCBSTAT2                                                 03427000
LCBSENDN EQU   LCBSTAT1                                                 03428000
LCBRECVN EQU   LCBSTAT1                                                 03429000
LCBFREEN EQU   LCBSTAT1                                                 03430000
LCBCONT  EQU   LCBSTAT1                                                 03431000
LCBINITN EQU   LCBSTAT1                                                 03432000
LCBOCNI  EQU   LCBSTAT1                                                 03433000
LCBOCWTN EQU   LCBSTAT1                                                 03434000
LCBRCLLN EQU   LCBSTAT1                                                 03435000
LCBRECOF EQU   IEDQLCB+68                                               03436000
LCBRDBFR EQU   LCBRCBFR                                                 03437000
LCBUCBX  EQU   IEDQLCB+64                                               03438000
LCBTTBIN EQU   LCBERRCT                                                 03439000
@NM00143 EQU   LCBINCAM                                                 03440000
LCBGETMN EQU   LCBINCAM                                                 03441000
@NM00142 EQU   LCBRESTR+1                                               03442000
LCBCMDSV EQU   LCBRESTR                                                 03443000
LCBPCILK EQU   LCBDCBPT                                                 03444000
LCBSTART EQU   LCBIOBSN+16                                              03445000
LCBAP4OL EQU   LCBSIOCC                                                 03446000
LCBAP3OL EQU   LCBSIOCC                                                 03447000
LCBAP2OL EQU   LCBSIOCC                                                 03448000
LCBAP1OL EQU   LCBSIOCC                                                 03449000
LCBSIOC2 EQU   LCBSIOCC                                                 03450000
LCBSIOC1 EQU   LCBSIOCC                                                 03451000
@NM00141 EQU   LCBSIOCC                                                 03452000
LCBCSWRC EQU   LCBCSW+5                                                 03453000
LCBCSCHC EQU   LCBCSWCS                                                 03454000
LCBCSICC EQU   LCBCSWCS                                                 03455000
LCBCSCCC EQU   LCBCSWCS                                                 03456000
LCBCSCDC EQU   LCBCSWCS                                                 03457000
LCBCSPTC EQU   LCBCSWCS                                                 03458000
LCBCSPGC EQU   LCBCSWCS                                                 03459000
LCBCSIL  EQU   LCBCSWCS                                                 03460000
LCBCSPCI EQU   LCBCSWCS                                                 03461000
LCBUSUE  EQU   LCBCSWUS                                                 03462000
LCBUSUC  EQU   LCBCSWUS                                                 03463000
LCBUSDE  EQU   LCBCSWUS                                                 03464000
LCBUSCE  EQU   LCBCSWUS                                                 03465000
LCBUSBSY EQU   LCBCSWUS                                                 03466000
LCBUSCUE EQU   LCBCSWUS                                                 03467000
LCBUSSM  EQU   LCBCSWUS                                                 03468000
LCBUSAT  EQU   LCBCSWUS                                                 03469000
LCBCSWCA EQU   LCBCSW                                                   03470000
LCBOBR   EQU   LCBFLAG3                                                 03471000
LCBOBRRD EQU   LCBFLAG3                                                 03472000
LCBIOMSG EQU   LCBFLAG3                                                 03473000
LCBSOHC  EQU   LCBFLAG3                                                 03474000
LCBRLAD  EQU   LCBFLAG3                                                 03475000
LCBSOHR  EQU   LCBFLAG3                                                 03476000
@NM00140 EQU   LCBFLAG3                                                 03477000
LCBECBPT EQU   LCBIOBSN+4                                               03478000
LCBECBCC EQU   LCBIOBSN+3                                               03479000
LCBSENS1 EQU   LCBSNS+1                                                 03480000
LCBABORT EQU   LCBTMOUT                                                 03481000
LCBNOTIN EQU   LCBLOSDT                                                 03482000
LCBOVRUN EQU   LCBSENS0                                                 03483000
LCBDATCK EQU   LCBSENS0                                                 03484000
LCBEQUCK EQU   LCBSENS0                                                 03485000
LCBBUSCK EQU   LCBSENS0                                                 03486000
LCBINTRQ EQU   LCBSENS0                                                 03487000
LCBCMDRJ EQU   LCBSENS0                                                 03488000
LCBFLAG2 EQU   LCBIOBSN                                                 03489000
@NM00139 EQU   LCBFLAG1                                                 03490000
LCBUNREL EQU   LCBFLAG1                                                 03491000
LCBEXCPN EQU   LCBFLAG1                                                 03492000
@NM00138 EQU   LCBFLAG1                                                 03493000
LCBERPIN EQU   LCBFLAG1                                                 03494000
@NM00137 EQU   LCBFLAG1                                                 03495000
LCBFSBFR EQU   LCBMHA                                                   03496000
LCBISZE  EQU   IEDQLCB+28                                               03497000
LCBLNENT EQU   LCBSCBDA+1                                               03498000
@NM00136 EQU   LCBSCBDA                                                 03499000
LCBCPGMH EQU   LCBSTAT4                                                 03500000
LCBREAL  EQU   LCBPHASE                                                 03501000
@NM00135 EQU   LCBSTAT4                                                 03502000
LCBACTRQ EQU   LCBSTAT4                                                 03503000
LCBIPLRQ EQU   LCBSTAT4                                                 03504000
LCBDACRQ EQU   LCBSTAT4                                                 03505000
LCBDMPRQ EQU   LCBSTAT4                                                 03506000
@NM00134 EQU   LCBLKMDE                                                 03507000
LCBLOCKI EQU   LCBLKMDE                                                 03508000
LCBLOCKR EQU   LCBLKMDE                                                 03509000
LCBHMFLG EQU   LCBLKMDE                                                 03510000
LCBBDFLG EQU   LCBLKMDE                                                 03511000
@NM00133 EQU   LCBINSRC                                                 03512000
LCBABRTN EQU   LCBCHAIN                                                 03513000
LCBCTLMD EQU   LCBTETEN                                                 03514000
LCBBFRSZ EQU   LCBCHAIN                                                 03515000
LCBUREQN EQU   LCBCHAIN                                                 03516000
LCBNORTY EQU   LCBCHAIN                                                 03517000
LCBERMSG EQU   LCBCHAIN                                                 03518000
LCBEXCP  EQU   LCBCHAIN                                                 03519000
LCBINVRQ EQU   LCBSCRNN                                                 03520000
LCB2741N EQU   LCBTSOB                                                  03521000
LCBINHBN EQU   LCBTSOB                                                  03522000
LCBCIRCD EQU   LCBTSOB                                                  03523000
LCBPREP  EQU   LCBTSOB                                                  03524000
LCBSOPL  EQU   LCBTSOB                                                  03525000
LCBSATRD EQU   LCBTSOB                                                  03526000
LCBTSBUF EQU   LCBTSOB                                                  03527000
LCBWRBRK EQU   LCBTSOB                                                  03528000
LCBTDL   EQU   IEDQLCB+18                                               03529000
LCBEOLTD EQU   IEDQLCB+16                                               03530000
LCBRSLNK EQU   IEDQLCB+13                                               03531000
LCBRSPRI EQU   IEDQLCB+12                                               03532000
LCBSTCBA EQU   IEDQLCB+9                                                03533000
LCBRSKEY EQU   IEDQLCB+8                                                03534000
LCBLINK  EQU   LCBRCB+5                                                 03535000
LCBPRI   EQU   LCBRCB+4                                                 03536000
LCBQCBA  EQU   LCBRCB+1                                                 03537000
LCBKEY   EQU   LCBRCB                                                   03538000
@NM00132 EQU   DCTBYTE5                                                 03539000
DCTSCS   EQU   DCTBYTE5                                                 03540000
DCTTSPRF EQU   DCTBYTE4                                                 03541000
DCTFMPRF EQU   DCTBYTE4                                                 03542000
DCT2760  EQU   DCTBYTE3                                                 03543000
DCTCONTN EQU   DCTBYTE3                                                 03544000
DCTBUFF  EQU   DCTBYTE3                                                 03545000
DCTCHECK EQU   DCTBYTE3                                                 03546000
DCTENCTL EQU   DCTBYTE3                                                 03547000
DCTWTTA  EQU   DCTBYTE3                                                 03548000
DCT1050  EQU   DCTBYTE3                                                 03549000
DCTAUDIO EQU   DCTBYTE2                                                 03550000
DCTLOCAL EQU   DCTBYTE2                                                 03551000
DCTCONT  EQU   DCTBYTE2                                                 03552000
DCTXMIT  EQU   DCTBYTE2                                                 03553000
DCTSTCTL EQU   DCTBYTE2                                                 03554000
DCTTWX   EQU   DCTBYTE2                                                 03555000
DCTBRDST EQU   DCTBYTE2                                                 03556000
DCTSADEV EQU   DCTBYTE1                                                 03557000
DCT2741  EQU   DCTBYTE1                                                 03558000
DCT5041  EQU   DCTBYTE1                                                 03559000
DCTATTEN EQU   DCTBYTE1                                                 03560000
DCTBREAK EQU   DCTBYTE1                                                 03561000
DCTINHIB EQU   DCTBYTE1                                                 03562000
DCTBYTE0 EQU   IEDDCT                                                   03563000
DCBNOTE  EQU   DCBCNTRL                                                 03564000
DCBLRECL EQU   IHADCS38+10                                              03565000
@NM00131 EQU   IHADCS38+8                                               03566000
DCBEOBW  EQU   IHADCS38+4                                               03567000
DCBEOBRA EQU   DCBEOBR+1                                                03568000
DCBNCP   EQU   DCBEOBR                                                  03569000
@NM00130 EQU   DCBFLAG1                                                 03570000
DCBSTFLS EQU   DCBFLAG1                                                 03571000
DCBSTQCK EQU   DCBFLAG1                                                 03572000
DCBDIRCQ EQU   DCBBUFOF                                                 03573000
DCBQSTRU EQU   DCBUSASI                                                 03574000
@NM00129 EQU   DCBUSASI                                                 03575000
DCBQADF3 EQU   DCBQADFS                                                 03576000
DCBQADF2 EQU   DCBQADFS                                                 03577000
DCBQADF1 EQU   DCBQADFS                                                 03578000
DCBBLBP  EQU   DCBUSASI                                                 03579000
@NM00128 EQU   DCBUSASI                                                 03580000
DCBCICBA EQU   DCBCICB+1                                                03581000
@NM00127 EQU   DCBCICB                                                  03582000
DCBOFFSW EQU   IHADCS36+15                                              03583000
DCBOFFSR EQU   IHADCS36+14                                              03584000
DCBWCPL  EQU   IHADCS36+13                                              03585000
DCBWCPO  EQU   IHADCS36+12                                              03586000
DCBBLKSI EQU   IHADCS36+10                                              03587000
DCBCNQSM EQU   DCBCIND2                                                 03588000
DCBCNFEO EQU   DCBCIND2                                                 03589000
DCBCNCHS EQU   DCBCIND2                                                 03590000
DCBCNBFP EQU   DCBCIND2                                                 03591000
DCBCNIOE EQU   DCBCIND2                                                 03592000
DCBCNCLO EQU   DCBCIND2                                                 03593000
DCBCNWRO EQU   DCBCIND2                                                 03594000
DCBCNSTO EQU   DCBCIND2                                                 03595000
DCBCNEXB EQU   DCBCIND1                                                 03596000
@NM00126 EQU   DCBCIND1                                                 03597000
DCBCNBRM EQU   DCBCIND1                                                 03598000
@NM00125 EQU   DCBCIND1                                                 03599000
DCBCNEVA EQU   DCBCIND1                                                 03600000
DCBCNEVB EQU   DCBCIND1                                                 03601000
DCBCNSRD EQU   DCBCIND1                                                 03602000
DCBCNTOV EQU   DCBCIND1                                                 03603000
DCBSYNA  EQU   DCBSYNAD+1                                               03604000
DCBIOBL  EQU   DCBSYNAD                                                 03605000
DCBCHCKA EQU   DCBPERRA                                                 03606000
DCBOPTJ  EQU   DCBOPTCD                                                 03607000
DCBOPTT  EQU   DCBOPTCD                                                 03608000
DCBSRCHD EQU   DCBOPTZ                                                  03609000
DCBOPTQ  EQU   DCBOPTCD                                                 03610000
DCBBCKPT EQU   DCBOPTO                                                  03611000
DCBOPTC  EQU   DCBOPTCD                                                 03612000
DCBOPTU  EQU   DCBOPTCD                                                 03613000
DCBOPTW  EQU   DCBOPTCD                                                 03614000
DCBREADA EQU   DCBWRITA                                                 03615000
@NM00124 EQU   DCBREAD                                                  03616000
DCBDEBA  EQU   DCBDEBAD+1                                               03617000
@NM00123 EQU   DCBIFLGS                                                 03618000
DCBIFIOE EQU   DCBIFLGS                                                 03619000
DCBCH12  EQU   DCBIFPCT                                                 03620000
DCBCH9   EQU   DCBIFPCT                                                 03621000
DCBIFEC  EQU   DCBIFLGS                                                 03622000
DCBMFSTI EQU   DCBMFDMD                                                 03623000
DCBMFAWR EQU   DCBMFSTK                                                 03624000
DCBMFUIP EQU   DCBMFTMD                                                 03625000
DCBMFIDW EQU   DCBMFLCP                                                 03626000
DCBMFWRK EQU   DCBMFMVP                                                 03627000
DCBMFRDQ EQU   DCBMFWRT                                                 03628000
DCBMFGTQ EQU   DCBMFPUT                                                 03629000
DCBMFSTL EQU   DCBMACF2                                                 03630000
DCBMFCK  EQU   DCBMFDMG                                                 03631000
DCBMFRDX EQU   DCBMFCHK                                                 03632000
DCBMFDBF EQU   DCBMFSBG                                                 03633000
DCBMFRDI EQU   DCBMFLCG                                                 03634000
DCBMFRDK EQU   DCBMFMVG                                                 03635000
DCBMFWRQ EQU   DCBMFRD                                                  03636000
DCBMFPTQ EQU   DCBMFGET                                                 03637000
DCBMFECP EQU   DCBMACF1                                                 03638000
DCBTIOT  EQU   IHADCS25                                                 03639000
DCBMRSTI EQU   DCBMRDMD                                                 03640000
DCBMRAWR EQU   DCBMRSTK                                                 03641000
DCBMRUIP EQU   DCBMRTMD                                                 03642000
DCBMRIDW EQU   DCBMRLCP                                                 03643000
DCBMRWRK EQU   DCBMRMVP                                                 03644000
DCBMRRDQ EQU   DCBMRWRT                                                 03645000
DCBMRGTQ EQU   DCBMRPUT                                                 03646000
DCBMRSTL EQU   DCBMACR2                                                 03647000
DCBMRCK  EQU   DCBMRDMG                                                 03648000
DCBPGFXA EQU   DCBMRRDX                                                 03649000
DCBMRDBF EQU   DCBMRSBG                                                 03650000
DCBMRRDI EQU   DCBMRLCG                                                 03651000
DCBMRRDK EQU   DCBMRMVG                                                 03652000
DCBMRWRQ EQU   DCBMRRD                                                  03653000
DCBMRPTQ EQU   DCBMRGET                                                 03654000
DCBMRECP EQU   DCBMACR1                                                 03655000
@NM00122 EQU   DCBIFLG                                                  03656000
DCBIBIOE EQU   DCBIFLG                                                  03657000
DCBICH12 EQU   DCBIBPCT                                                 03658000
DCBICH9  EQU   DCBIBPCT                                                 03659000
DCBIBEC  EQU   DCBIFLG                                                  03660000
DCBOFIOF EQU   DCBOFLGS                                                 03661000
DCBOFUEX EQU   DCBOFLGS                                                 03662000
DCBOFTM  EQU   DCBOFLGS                                                 03663000
DCBOFPPC EQU   DCBOFLGS                                                 03664000
DCBOFOPN EQU   DCBOFLGS                                                 03665000
DCBOFEOV EQU   DCBOFLGS                                                 03666000
DCBOFLRB EQU   DCBOFLGS                                                 03667000
DCBOFIOD EQU   DCBOFLWR                                                 03668000
DCBDDNAM EQU   IHADCS24                                                 03669000
DCBEXLSA EQU   DCBEXLST+1                                               03670000
DCBRECKL EQU   DCBRECFM                                                 03671000
DCBRECCC EQU   DCBRECFM                                                 03672000
DCBRECSB EQU   DCBRECFM                                                 03673000
DCBRECBR EQU   DCBRECFM                                                 03674000
DCBRECTO EQU   DCBRECLA                                                 03675000
DCBRECL  EQU   DCBRECLA                                                 03676000
DCBEODA  EQU   DCBEODAD+1                                               03677000
DCBBFA   EQU   DCBBFTEK                                                 03678000
DCBH0    EQU   DCBBFTEK                                                 03679000
DCBBFTKD EQU   DCBBFTEK                                                 03680000
DCBBFTE  EQU   DCBBFT                                                   03681000
DCBBFTKR EQU   DCBBFT                                                   03682000
DCBBFTS  EQU   DCBBFT                                                   03683000
DCBH1    EQU   DCBBFTEK                                                 03684000
DCBSVCXA EQU   DCBSVCXL+1                                               03685000
@NM00121 EQU   DCBSVCXL                                                 03686000
DCBODEBA EQU   DCBIOBAA                                                 03687000
@NM00120 EQU   DCBQSLM                                                  03688000
DCBUPDBT EQU   DCBQSLM                                                  03689000
DCBUPDCM EQU   DCBQSLM                                                  03690000
DCB1DVDS EQU   DCBQSLM                                                  03691000
@NM00119 EQU   DCBDSRG2                                                 03692000
DCBDSGTR EQU   DCBDSRG2                                                 03693000
DCBACBM  EQU   DCBDSRG2                                                 03694000
@NM00118 EQU   DCBDSRG2                                                 03695000
DCBDSGTQ EQU   DCBDSRG2                                                 03696000
DCBDSGTX EQU   DCBDSRG2                                                 03697000
DCBDSGGS EQU   DCBDSRG2                                                 03698000
DCBDSGU  EQU   DCBDSRG1                                                 03699000
DCBDSGPO EQU   DCBDSRG1                                                 03700000
@NM00117 EQU   DCBDSRG1                                                 03701000
@NM00116 EQU   DCBDSRG1                                                 03702000
DCBDSGCX EQU   DCBDSRG1                                                 03703000
DCBDSGDA EQU   DCBDSRG1                                                 03704000
DCBDSGPS EQU   DCBDSRG1                                                 03705000
DCBDSGIS EQU   DCBDSRG1                                                 03706000
DCBBUFL  EQU   IHADCS11+8                                               03707000
DCBBUFCA EQU   DCBBUFCB+1                                               03708000
DCBBUFNO EQU   DCBBUFCB                                                 03709000
DCBKEYLE EQU   DCBRELB                                                  03710000
@NM00115 EQU   IHADCB                                                   03711000
QCBTTCIN EQU   QCBPLCBA+1                                               03712000
@NM00114 EQU   QCBPLCBA                                                 03713000
@NM00113 EQU   QCBSTAT1                                                 03714000
QCBFLUSH EQU   QCBSTAT1                                                 03715000
QCBNDXRQ EQU   QCBSTAT1                                                 03716000
QCBESIG  EQU   QCBSTAT1                                                 03717000
QCBRCVRQ EQU   QCBSTAT1                                                 03718000
QCBSNDRQ EQU   QCBSTAT1                                                 03719000
QCBWAITC EQU   QCBSTAT1                                                 03720000
QCBPLCBN EQU   QCBSTAT1                                                 03721000
QCBCHAIN EQU   IEDNQCB                                                  03722000
QCBPQBCK EQU   IEDQPQCB+25                                              03723000
QCBPRIPQ EQU   IEDQPQCB+24                                              03724000
QCBCFHDR EQU   IEDQPQCB+21                                              03725000
QCBLFEFO EQU   IEDQPQCB+18                                              03726000
QCBFFEFO EQU   IEDQPQCB+15                                              03727000
QCBPREVF EQU   QCBINTLF                                                 03728000
QCBINTFF EQU   IEDQPQCB+9                                               03729000
QCBDATSQ EQU   QCBFHDTZ+1                                               03730000
@NM00112 EQU   QCBFHDTZ                                                 03731000
@NM00111 EQU   QCBPFEFO                                                 03732000
QCBDATFL EQU   QCBFHDLZ                                                 03733000
QCBDNHDR EQU   IEDQPQCB                                                 03734000
QCBQBACK EQU   IEDQQCB+37                                               03735000
QCBCKPT  EQU   QCBFLAG                                                  03736000
QCBPROC  EQU   QCBFLAG                                                  03737000
QCBSDFFO EQU   QCBFLAG                                                  03738000
QCBTERMQ EQU   QCBFLAG                                                  03739000
QCBRSRV  EQU   QCBFLAG                                                  03740000
QCBREAD  EQU   QCBFLAG                                                  03741000
QCBNOBRK EQU   QCBFLAG                                                  03742000
QCBLGBAD EQU   QCBDCBAD                                                 03743000
QCBRELLN EQU   IEDQQCB+32                                               03744000
QCBTJID  EQU   QCBLKRRN+1                                               03745000
QCBCARCT EQU   QCBLKRRN                                                 03746000
QCBPRLVL EQU   QCBPREN                                                  03747000
QCBMSGCT EQU   IEDQQCB+26                                               03748000
QCBEXTO  EQU   QCBINTVL                                                 03749000
QCBDISC  EQU   QCBTSOF1                                                 03750000
QCBDELAY EQU   QCBTSOF1                                                 03751000
QCBPARTO EQU   QCBTSOF1                                                 03752000
QCBSATRD EQU   QCBTSOF1                                                 03753000
QCBNOBUF EQU   QCBTSOF1                                                 03754000
QCBTPUT  EQU   QCBTSOF1                                                 03755000
QCBTGET  EQU   QCBTSOF1                                                 03756000
QCBWRBRK EQU   QCBTSOF1                                                 03757000
QCBSATLC EQU   QCBTSOF2                                                 03758000
QCBSATTI EQU   QCBTSOF2                                                 03759000
QCBSATCH EQU   QCBTSOF2                                                 03760000
QCBSIMRD EQU   QCBTSOF2                                                 03761000
QCBDSSMI EQU   QCBTSOF2                                                 03762000
QCBPOSTO EQU   QCBTSOF2                                                 03763000
QCBBUFQ  EQU   QCBTSOF2                                                 03764000
QCBINHBN EQU   QCBTSOF2                                                 03765000
QCBSATCT EQU   @NM00110                                                 03766000
QCBSCBOF EQU   IEDQQCB+20                                               03767000
QCBTIME  EQU   QCBSTAT                                                  03768000
QCBCLOCK EQU   QCBSTAT                                                  03769000
QCBSCHDL EQU   QCBSTAT                                                  03770000
QCBSMODE EQU   QCBSTAT                                                  03771000
QCBSEND  EQU   QCBSTAT                                                  03772000
QCBBUFRD EQU   QCBSTAT                                                  03773000
QCBTRMHO EQU   QCBSTAT                                                  03774000
QCBEOM   EQU   QCBSTAT                                                  03775000
QCBHUCT  EQU   QCBRETCT                                                 03776000
QCBIEND  EQU   QCBRETCT                                                 03777000
QCBEND   EQU   QCBRETCT                                                 03778000
QCBNL    EQU   QCBRETCT                                                 03779000
QCBLOGCT EQU   QCBRETCT                                                 03780000
@NM00109 EQU   QCBBYTE1                                                 03781000
QCBRITRM EQU   QCBBYTE1                                                 03782000
@NM00108 EQU   QCBEOLDT                                                 03783000
QCBSLINK EQU   IEDQQCB+13                                               03784000
QCBSTPRI EQU   IEDQQCB+12                                               03785000
QCBSTCHN EQU   IEDQQCB+9                                                03786000
QCBSTVTO EQU   IEDQQCB+8                                                03787000
QCBLINK  EQU   IEDQQCB+5                                                03788000
QCBPRI   EQU   IEDQQCB+4                                                03789000
QCBCNTEN EQU   QCBELCHN+2                                               03790000
@NM00107 EQU   QCBELCHN+2                                               03791000
@NM00106 EQU   QCBELCHN                                                 03792000
QCBHELD  EQU   QCBDSFLG                                                 03793000
QCBFQCB  EQU   QCBDSFLG                                                 03794000
QCBDRQQ  EQU   QCBDSFLG                                                 03795000
QCBALTMH EQU   QCBDSFLG                                                 03796000
QCBTSQ   EQU   QCBDSFLG                                                 03797000
SAVTLLCB EQU   IEDNSVTD+316                                             03798000
SAVTBITN EQU   IEDNSVTD+312                                             03799000
@NM00105 EQU   SAVTCKQB+8                                               03800000
@NM00104 EQU   SAVTCKEC+1                                               03801000
@NM00103 EQU   SAVTCKCC                                                 03802000
SAVTCKPO EQU   SAVTCKCC                                                 03803000
SAVTCKWA EQU   SAVTCKCC                                                 03804000
SAVTCKCH EQU   SAVTCKTB+1                                               03805000
SAVTCKVT EQU   SAVTCKTB                                                 03806000
@NM00102 EQU   IEDNSVTD+297                                             03807000
SAVTRDFG EQU   SAVTRDRV+12                                              03808000
@NM00101 EQU   SAVTRDRV+5                                               03809000
SAVTRDPY EQU   SAVTRDRV+4                                               03810000
SAVTRDQB EQU   SAVTRDRV+1                                               03811000
SAVTRDKY EQU   SAVTRDRV                                                 03812000
SAVTNID  EQU   IEDNSVTD+280                                             03813000
SAVTDVAS EQU   IEDNSVTD+276                                             03814000
SAVTPLSZ EQU   IEDNSVTD+274                                             03815000
@NM00100 EQU   IEDNSVTD+273                                             03816000
SAVTSUBL EQU   IEDNSVTD+272                                             03817000
@NM00099 EQU   SAVTZELM+1                                               03818000
SAVTSUBM EQU   SAVTZELM                                                 03819000
SAVTMHDX EQU   IEDNSVTD+268                                             03820000
SAVTNAT1 EQU   IEDNSVTD+266                                             03821000
SAVTSH20 EQU   IEDNSVTD+264                                             03822000
SAVTLCBS EQU   IEDNSVTD+260                                             03823000
SAVTRNMP EQU   IEDNSVTD+256                                             03824000
SAVTTNTX EQU   IEDNSVTD+252                                             03825000
SAVTNAX  EQU   IEDNSVTD+248                                             03826000
SAVTSUBV EQU   IEDNSVTD+247                                             03827000
SAVTSUBA EQU   IEDNSVTD+246                                             03828000
SAVTSIBC EQU   IEDNSVTD+244                                             03829000
SAVTBSM  EQU   IEDNSVTD+240                                             03830000
SAVTRQTG EQU   IEDNSVTD+236                                             03831000
SAVTRQCH EQU   IEDNSVTD+232                                             03832000
SAVTMAND EQU   IEDNSVTD+228                                             03833000
SAVTSPLN EQU   IEDNSVTD+224                                             03834000
SAVTNADL EQU   IEDNSVTD+222                                             03835000
SAVTNATL EQU   IEDNSVTD+220                                             03836000
SAVTMHTB EQU   IEDNSVTD+216                                             03837000
SAVTSSMH EQU   IEDNSVTD+212                                             03838000
SAVTQRS  EQU   IEDNSVTD+208                                             03839000
SAVTRQIN EQU   IEDNSVTD+204                                             03840000
SAVTDFCO EQU   IEDNSVTD+200                                             03841000
SAVTSAO  EQU   IEDNSVTD+196                                             03842000
SAVTSARI EQU   IEDNSVTD+192                                             03843000
SAVTSAC  EQU   IEDNSVTD+188                                             03844000
SAVTSAI  EQU   IEDNSVTD+184                                             03845000
SAVTCSCI EQU   IEDNSVTD+180                                             03846000
SAVTSSRP EQU   IEDNSVTD+176                                             03847000
SAVTSSRQ EQU   IEDNSVTD+172                                             03848000
SAVTSCLU EQU   IEDNSVTD+168                                             03849000
SAVTXTRQ EQU   IEDNSVTD+164                                             03850000
SAVTMVBF EQU   IEDNSVTD+160                                             03851000
@NM00098 EQU   IEDNSVTD+148                                             03852000
SAVTIPCQ EQU   IEDNSVTD+144                                             03853000
@NM00097 EQU   IEDNSVTD+136                                             03854000
SAVTXFMI EQU   IEDNSVTD+132                                             03855000
@NM00096 EQU   IEDNSVTD+124                                             03856000
SAVTXFMO EQU   IEDNSVTD+120                                             03857000
@NM00095 EQU   IEDNSVTD+116                                             03858000
SAVTSSSR EQU   IEDNSVTD+112                                             03859000
SAVTSLCB EQU   IEDNSVTD+104                                             03860000
SAVTLUSR EQU   IEDNSVTD+100                                             03861000
@NM00094 EQU   SAVTLUSQ+8                                               03862000
SAVTLUSP EQU   SAVTLUSQ+4                                               03863000
SAVTLUSB EQU   SAVTLUSQ                                                 03864000
@NM00093 EQU   IEDNSVTD+84                                              03865000
SAVTSAT  EQU   IEDNSVTD+80                                              03866000
SAVTNAT  EQU   IEDNSVTD+76                                              03867000
SAVTCLUP EQU   IEDNSVTD+72                                              03868000
SAVTPIUT EQU   IEDNSVTD+68                                              03869000
SAVTRNTA EQU   IEDNSVTD+64                                              03870000
SAVTDNIR EQU   IEDNSVTD+60                                              03871000
SAVTCNIR EQU   IEDNSVTD+56                                              03872000
SAVTFLDH EQU   IEDNSVTD+52                                              03873000
SAVTSRTN EQU   IEDNSVTD+48                                              03874000
SAVTSREQ EQU   IEDNSVTD+44                                              03875000
SAVTFAIL EQU   IEDNSVTD+42                                              03876000
SAVTSUSE EQU   IEDNSVTD+40                                              03877000
SAVTSIB  EQU   IEDNSVTD+36                                              03878000
SAVTPRTN EQU   IEDNSVTD+32                                              03879000
@NM00092 EQU   IEDNSVTD+28                                              03880000
SAVTWH20 EQU   IEDNSVTD+26                                              03881000
SAVTPWT  EQU   IEDNSVTD+24                                              03882000
SAVTPRTQ EQU   IEDNSVTD+20                                              03883000
SAVTPREQ EQU   IEDNSVTD+16                                              03884000
SAVTPH20 EQU   IEDNSVTD+14                                              03885000
SAVTPUSE EQU   IEDNSVTD+12                                              03886000
SAVTPLCB EQU   IEDNSVTD+8                                               03887000
SAVTPOOL EQU   IEDNSVTD+4                                               03888000
SAVTPRMT EQU   SAVTDIAF                                                 03889000
SAVTVIRT EQU   SAVTDIAF                                                 03890000
AVTCPBNO EQU   IEDQAVTD+1244                                            03891000
AVTHRESS EQU   IEDQAVTD+1243                                            03892000
@NM00091 EQU   IEDQAVTD+1242                                            03893000
@NM00090 EQU   IEDQAVTD+1241                                            03894000
@NM00089 EQU   IEDQAVTD+1240                                            03895000
@NM00088 EQU   IEDQAVTD+1237                                            03896000
@NM00087 EQU   IEDQAVTD+1236                                            03897000
AVTHRESE EQU   @NM00086                                                 03898000
AVTRADDR EQU   IEDQAVTD+1228                                            03899000
AVTNADDR EQU   IEDQAVTD+1224                                            03900000
AVTHRESN EQU   IEDQAVTD+1220                                            03901000
AVTVOLRN EQU   IEDQAVTD+1216                                            03902000
AVTTOTNN EQU   IEDQAVTD+1212                                            03903000
AVTTRCYN EQU   IEDQAVTD+1208                                            03904000
AVTRCTRN EQU   IEDQAVTD+1204                                            03905000
AVTNOVON EQU   IEDQAVTD+1200                                            03906000
AVTADEBN EQU   IEDQAVTD+1196                                            03907000
AVTVOLRR EQU   IEDQAVTD+1192                                            03908000
AVTTOTNR EQU   IEDQAVTD+1188                                            03909000
AVTTRCYR EQU   IEDQAVTD+1184                                            03910000
AVTRCTRR EQU   IEDQAVTD+1180                                            03911000
AVTNOVOR EQU   IEDQAVTD+1176                                            03912000
AVTADEBR EQU   IEDQAVTD+1172                                            03913000
AVTLODPT EQU   IEDQAVTD+1168                                            03914000
AVTIOBN  EQU   IEDQAVTD+1164                                            03915000
AVTIOBR  EQU   IEDQAVTD+1160                                            03916000
AVTCPBPT EQU   IEDQAVTD+1156                                            03917000
AVTFCPB  EQU   IEDQAVTD+1152                                            03918000
@NM00085 EQU   IEDQAVTD+1148                                            03919000
AVTINCPQ EQU   IEDQAVTD+1144                                            03920000
@NM00084 EQU   IEDQAVTD+1140                                            03921000
@NM00083 EQU   IEDQAVTD+1137                                            03922000
@NM00082 EQU   AVTBIT4                                                  03923000
@NM00081 EQU   AVTBIT4                                                  03924000
@NM00080 EQU   AVTBIT4                                                  03925000
@NM00079 EQU   AVTBIT4                                                  03926000
@NM00078 EQU   AVTBIT4                                                  03927000
@NM00077 EQU   AVTBIT4                                                  03928000
@NM00076 EQU   AVTBIT4                                                  03929000
AVTRUFTN EQU   AVTBIT4                                                  03930000
@NM00075 EQU   IEDQAVTD+1132                                            03931000
AVTNOBFQ EQU   IEDQAVTD+1128                                            03932000
@NM00074 EQU   IEDQAVTD+1124                                            03933000
AVTDKENQ EQU   IEDQAVTD+1120                                            03934000
@NM00073 EQU   IEDQAVTD+1116                                            03935000
AVTDKAPQ EQU   IEDQAVTD+1112                                            03936000
AVTCOPY  EQU   IEDQAVTD+1108                                            03937000
AVTIA    EQU   IEDQAVTD+1104                                            03938000
AVTFL    EQU   IEDQAVTD+1100                                            03939000
@NM00072 EQU   IEDQAVTD+1096                                            03940000
AVTNCPBQ EQU   IEDQAVTD+1092                                            03941000
AVTTOTNC EQU   IEDQAVTD+1088                                            03942000
AVTCMAX  EQU   IEDQAVTD+1084                                            03943000
AVTCMIN  EQU   IEDQAVTD+1080                                            03944000
AVTHM02  EQU   IEDQAVTD+1076                                            03945000
AVTOPCIN EQU   IEDQAVTD+1074                                            03946000
AVTOPMSK EQU   IEDQAVTD+1068                                            03947000
AVTDDFT  EQU   IEDQAVTD+1064                                            03948000
AVTSTEAL EQU   IEDQAVTD+1060                                            03949000
AVTOPTN  EQU   IEDQAVTD+1056                                            03950000
AVTDSKCT EQU   IEDQAVTD+1054                                            03951000
AVTCKRST EQU   IEDQAVTD+1053                                            03952000
AVTSTAN  EQU   AVTBIT3                                                  03953000
AVTSTACN EQU   AVTBIT3                                                  03954000
AVTSTAIN EQU   AVTBIT3                                                  03955000
AVTSTAYN EQU   AVTBIT3                                                  03956000
AVTOLTBN EQU   AVTBIT3                                                  03957000
AVTTSAB  EQU   AVTBIT3                                                  03958000
AVTRFULN EQU   AVTBIT3                                                  03959000
AVTRECVN EQU   AVTBIT3                                                  03960000
@NM00071 EQU   AVTBIT2                                                  03961000
@NM00070 EQU   AVTBIT2                                                  03962000
AVTOPEIN EQU   AVTBIT2                                                  03963000
AVTSTRTN EQU   AVTBIT2                                                  03964000
AVTTOPOL EQU   AVTBIT2                                                  03965000
AVTCOPYN EQU   AVTBIT2                                                  03966000
AVTREUSN EQU   AVTBIT2                                                  03967000
AVTEXTSC EQU   AVTBIT2                                                  03968000
AVTDISKN EQU   AVTBIT1                                                  03969000
AVTQUCKN EQU   AVTBIT1                                                  03970000
AVTCLOSN EQU   AVTBIT1                                                  03971000
AVTREADN EQU   AVTBIT1                                                  03972000
AVTDLAYN EQU   AVTBIT1                                                  03973000
AVTAQTAN EQU   AVTBIT1                                                  03974000
AVTTSON  EQU   AVTBIT1                                                  03975000
AVTAPLKN EQU   AVTBIT1                                                  03976000
AVTDUMBR EQU   IEDQAVTD+1048                                            03977000
AVTDLQX  EQU   IEDQAVTD+1046                                            03978000
AVTINTLV EQU   IEDQAVTD+1044                                            03979000
AVTSMCNT EQU   IEDQAVTD+1042                                            03980000
AVTAVFCT EQU   IEDQAVTD+1040                                            03981000
AVTOPCON EQU   IEDQAVTD+1038                                            03982000
AVTOPCNT EQU   IEDQAVTD+1036                                            03983000
AVTLNCNT EQU   IEDQAVTD+1034                                            03984000
AVTHA16  EQU   IEDQAVTD+1030                                            03985000
AVTHA7   EQU   IEDQAVTD+1028                                            03986000
AVTHA4   EQU   IEDQAVTD+1026                                            03987000
AVTHA3   EQU   IEDQAVTD+1024                                            03988000
AVTHA2   EQU   IEDQAVTD+1022                                            03989000
AVTGETMS EQU   IEDQAVTD+1021                                            03990000
@NM00069 EQU   IEDQAVTD+1020                                            03991000
AVTGETMD EQU   IEDQAVTD+1016                                            03992000
AVTGETMN EQU   IEDQAVTD+1012                                            03993000
AVTCWTOT EQU   IEDQAVTD+1008                                            03994000
AVTCWINT EQU   IEDQAVTD+956                                             03995000
AVTDTRAP EQU   IEDQAVTD+952                                             03996000
@NM00068 EQU   IEDQAVTD+950                                             03997000
@NM00067 EQU   AVTIOTR                                                  03998000
AVTIOTRH EQU   AVTIOTR                                                  03999000
AVTIOTRE EQU   AVTIOTR                                                  04000000
@NM00066 EQU   AVTSUBT                                                  04001000
AVTSUBPT EQU   AVTSUBT                                                  04002000
AVTSUBON EQU   AVTSUBT                                                  04003000
AVTAFE30 EQU   IEDQAVTD+944                                             04004000
AVTAFE20 EQU   IEDQAVTD+940                                             04005000
AVTAFE10 EQU   IEDQAVTD+936                                             04006000
AVTCWEC2 EQU   IEDQAVTD+932                                             04007000
AVTCWPM2 EQU   IEDQAVTD+928                                             04008000
AVTCWTS2 EQU   IEDQAVTD+927                                             04009000
AVTCWTS1 EQU   IEDQAVTD+926                                             04010000
AVTCWCLD EQU   AVTCWFL2                                                 04011000
AVTCWRAP EQU   AVTCWFL2                                                 04012000
@NM00065 EQU   AVTCWFL2                                                 04013000
@NM00064 EQU   AVTCWFL2                                                 04014000
@NM00063 EQU   AVTCWFL2                                                 04015000
@NM00062 EQU   AVTCWFL2                                                 04016000
@NM00061 EQU   AVTCWFL2                                                 04017000
AVTCWACT EQU   AVTCWFL2                                                 04018000
@NM00060 EQU   AVTCWFL1                                                 04019000
@NM00059 EQU   AVTCWFL1                                                 04020000
@NM00058 EQU   AVTCWFL1                                                 04021000
@NM00057 EQU   AVTCWFL1                                                 04022000
@NM00056 EQU   AVTCWFL1                                                 04023000
@NM00055 EQU   AVTCWFL1                                                 04024000
@NM00054 EQU   AVTCWFL1                                                 04025000
AVTCOMWN EQU   AVTCWFL1                                                 04026000
AVTCWEC1 EQU   IEDQAVTD+920                                             04027000
AVTCWPM1 EQU   IEDQAVTD+916                                             04028000
AVTCAREA EQU   IEDQAVTD+912                                             04029000
AVTFZERO EQU   IEDQAVTD+908                                             04030000
AVTCADDR EQU   IEDQAVTD+904                                             04031000
AVTCOREC EQU   IEDQAVTD+900                                             04032000
@NM00053 EQU   IEDQAVTD+892                                             04033000
AVTCPBCB EQU   IEDQAVTD+888                                             04034000
@NM00052 EQU   IEDQAVTD+880                                             04035000
AVTDSIOB EQU   IEDQAVTD+876                                             04036000
@NM00051 EQU   IEDQAVTD+868                                             04037000
AVTCPRMB EQU   IEDQAVTD+864                                             04038000
@NM00050 EQU   IEDQAVTD+856                                             04039000
AVTCLOSB EQU   IEDQAVTD+852                                             04040000
@NM00049 EQU   IEDQAVTD+844                                             04041000
AVTACTIB EQU   IEDQAVTD+840                                             04042000
@NM00048 EQU   IEDQAVTD+836                                             04043000
AVTOLTEB EQU   IEDQAVTD+832                                             04044000
AVTOLTCH EQU   AVTOLTQB+1                                               04045000
AVTOLTVT EQU   AVTOLTQB                                                 04046000
@NM00047 EQU   AVTOPCQB+8                                               04047000
@NM00046 EQU   AVTOPCEC+1                                               04048000
@NM00045 EQU   AVTOPCCC                                                 04049000
AVTOPCPO EQU   AVTOPCCC                                                 04050000
AVTOPCWA EQU   AVTOPCCC                                                 04051000
AVTOPCCH EQU   AVTOPCOB+1                                               04052000
AVTOPCVT EQU   AVTOPCOB                                                 04053000
@NM00044 EQU   AVTCKPQB+9                                               04054000
AVTCKPTS EQU   AVTCKPQB+8                                               04055000
@NM00043 EQU   AVTCKPEC+1                                               04056000
@NM00042 EQU   AVTCKPCC                                                 04057000
AVTCKPPO EQU   AVTCKPCC                                                 04058000
AVTCKPWA EQU   AVTCKPCC                                                 04059000
AVTCKPCH EQU   AVTCKPTB+1                                               04060000
AVTCKPVT EQU   AVTCKPTB                                                 04061000
@NM00041 EQU   IEDQAVTD+796                                             04062000
@NM00040 EQU   IEDQAVTD+788                                             04063000
AVTSELCH EQU   IEDQAVTD+785                                             04064000
AVTBFRTN EQU   AVTBFRFG                                                 04065000
AVTBFREB EQU   IEDQAVTD+780                                             04066000
AVTTIMQ  EQU   IEDQAVTD+776                                             04067000
@NM00039 EQU   IEDQAVTD+772                                             04068000
AVTIMQPS EQU   IEDQAVTD+768                                             04069000
AVTINOUT EQU   IEDQAVTD+766                                             04070000
AVTREFTM EQU   IEDQAVTD+764                                             04071000
@NM00038 EQU   IEDQAVTD+752                                             04072000
AVTDELYB EQU   IEDQAVTD+748                                             04073000
AVTOCQPT EQU   IEDQAVTD+744                                             04074000
AVTTSOPT EQU   IEDQAVTD+740                                             04075000
AVTSUPPT EQU   IEDQAVTD+736                                             04076000
AVTCBQCB EQU   IEDQAVTD+732                                             04077000
AVTMSGS  EQU   IEDQAVTD+729                                             04078000
@NM00037 EQU   AVTSYSER                                                 04079000
@NM00036 EQU   AVTSYSER                                                 04080000
@NM00035 EQU   AVTSYSER                                                 04081000
@NM00034 EQU   AVTSYSER                                                 04082000
@NM00033 EQU   AVTSYSER                                                 04083000
@NM00032 EQU   AVTSYSER                                                 04084000
AVTCMAXN EQU   AVTSYSER                                                 04085000
AVTCMINN EQU   AVTSYSER                                                 04086000
AVT2260L EQU   IEDQAVTD+724                                             04087000
AVTABEPL EQU   AVTADBUF                                                 04088000
AVTHFF   EQU   AVTCLRHI+2                                               04089000
@NM00031 EQU   AVTCLRHI                                                 04090000
AVTCCLNK EQU   AVTCRELE+5                                               04091000
AVTCCPRI EQU   AVTCRELE+4                                               04092000
AVTCCQCB EQU   AVTCCELE+1                                               04093000
AVTCCKEY EQU   AVTCCELE                                                 04094000
AVTDELAD EQU   IEDQAVTD+704                                             04095000
AVTDELEM EQU   IEDQAVTD+700                                             04096000
AVTBSX   EQU   AVTCKLNK                                                 04097000
AVTOPETR EQU   AVTHG01                                                  04098000
@NM00030 EQU   AVTCKBYT                                                 04099000
AVTCKONQ EQU   AVTCKBYT                                                 04100000
@NM00029 EQU   AVTCKBYT                                                 04101000
@NM00028 EQU   AVTCKBYT                                                 04102000
@NM00027 EQU   AVTCKBYT                                                 04103000
@NM00026 EQU   AVTCKBYT                                                 04104000
@NM00025 EQU   AVTCKBYT                                                 04105000
@NM00024 EQU   AVTCKBYT                                                 04106000
AVTOPERT EQU   IEDQAVTD+690                                             04107000
AVTOPXCL EQU   IEDQAVTD+688                                             04108000
AVTOPERL EQU   IEDQAVTD+687                                             04109000
@NM00023 EQU   IEDQAVTD+686                                             04110000
AVTCKTIM EQU   IEDQAVTD+684                                             04111000
AVTCKELV EQU   IEDQAVTD+682                                             04112000
AVTCPRCD EQU   IEDQAVTD+681                                             04113000
AVTWARMN EQU   AVTCKELF                                                 04114000
AVTCRTLN EQU   AVTCKELF                                                 04115000
AVTCPIPN EQU   AVTCKELF                                                 04116000
AVTCCLCN EQU   AVTCKELF                                                 04117000
AVTCINCN EQU   AVTCKELF                                                 04118000
@NM00022 EQU   AVTCKELF                                                 04119000
AVTCMCPN EQU   AVTCKELF                                                 04120000
AVTNQBCK EQU   AVTCKELF                                                 04121000
AVTCKQAD EQU   IEDQAVTD+677                                             04122000
AVTSCBSZ EQU   IEDQAVTD+676                                             04123000
@NM00021 EQU   IEDQAVTD+672                                             04124000
AVTCKELE EQU   IEDQAVTD+668                                             04125000
@NM00020 EQU   AVTCKPEL+8                                               04126000
AVTCKRLK EQU   AVTCKPEL+5                                               04127000
AVTCKRPR EQU   AVTCKPEL+4                                               04128000
AVTCKRMQ EQU   AVTCKRMV+1                                               04129000
AVTCKRKY EQU   AVTCKRMV                                                 04130000
AVTHK    EQU   IEDQAVTD+648                                             04131000
AVTHI    EQU   IEDQAVTD+644                                             04132000
AVTIOT   EQU   IEDQAVTD+640                                             04133000
AVTNX    EQU   IEDQAVTD+636                                             04134000
AVTTONE  EQU   IEDQAVTD+632                                             04135000
AVTA3TL  EQU   IEDQAVTD+628                                             04136000
AVTDMECB EQU   IEDQAVTD+624                                             04137000
AVTABEND EQU   IEDQAVTD+618                                             04138000
AVTPLCBN EQU   IEDQAVTD+616                                             04139000
@NM00019 EQU   AVTSAVTP+1                                               04140000
@NM00018 EQU   AVTSAVTF                                                 04141000
AVTSNA   EQU   AVTSAVTF                                                 04142000
AVTONSNA EQU   AVTSAVTF                                                 04143000
AVTVTMCP EQU   AVTSAVTF                                                 04144000
@NM00017 EQU   IEDQAVTD+608                                             04145000
AVTCMBSS EQU   IEDQAVTD+604                                             04146000
AVTRCV   EQU   IEDQAVTD+600                                             04147000
AVTSEND  EQU   IEDQAVTD+596                                             04148000
AVTCSCH  EQU   IEDQAVTD+592                                             04149000
AVTQ1    EQU   IEDQAVTD+588                                             04150000
AVTE7    EQU   IEDQAVTD+584                                             04151000
AVTHB    EQU   IEDQAVTD+580                                             04152000
AVTR1    EQU   IEDQAVTD+576                                             04153000
AVTBZ    EQU   IEDQAVTD+572                                             04154000
AVTEZ    EQU   IEDQAVTD+568                                             04155000
AVTEC    EQU   IEDQAVTD+564                                             04156000
AVTEW    EQU   IEDQAVTD+560                                             04157000
AVTNDIAL EQU   AVTSCOPT                                                 04158000
AVTN2741 EQU   AVTSCOPT                                                 04159000
AVTCONCO EQU   AVTSCOPT                                                 04160000
AVTCONC  EQU   AVTSCOPT                                                 04161000
AVTCMBUF EQU   AVTSCOPT                                                 04162000
AVTAPDMP EQU   AVTSCOPT                                                 04163000
@NM00016 EQU   AVTSCOPT                                                 04164000
AVTHA    EQU   AVTDISP                                                  04165000
AVTEA    EQU   IEDQAVTD+548                                             04166000
AVTAX    EQU   IEDQAVTD+544                                             04167000
AVTA3    EQU   IEDQAVTD+540                                             04168000
AVTGD    EQU   IEDQAVTD+536                                             04169000
AVTAL    EQU   IEDQAVTD+532                                             04170000
AVTOLTST EQU   AVTHG02                                                  04171000
AVTE8    EQU   IEDQAVTD+524                                             04172000
AVTUI    EQU   IEDQAVTD+520                                             04173000
AVTCOMPT EQU   IEDQAVTD+516                                             04174000
AVTCRSRF EQU   IEDQAVTD+512                                             04175000
@NM00015 EQU   IEDQAVTD+508                                             04176000
AVTKA02  EQU   IEDQAVTD+504                                             04177000
AVTOPTPT EQU   IEDQAVTD+500                                             04178000
AVTPCBPT EQU   IEDQAVTD+496                                             04179000
@NM00014 EQU   AVTECB1                                                  04180000
AVTCOMP  EQU   AVTECB1                                                  04181000
@NM00013 EQU   AVTECB1                                                  04182000
AVTOPECA EQU   IEDQAVTD+488                                             04183000
AVTOLECA EQU   IEDQAVTD+484                                             04184000
AVTCKECA EQU   IEDQAVTD+480                                             04185000
AVTCWECA EQU   IEDQAVTD+476                                             04186000
AVTCWTCB EQU   IEDQAVTD+472                                             04187000
AVTOLTCB EQU   IEDQAVTD+468                                             04188000
AVTOCTCB EQU   IEDQAVTD+464                                             04189000
AVTCKTCB EQU   IEDQAVTD+460                                             04190000
AVTAS    EQU   IEDQAVTD+456                                             04191000
AVTNOLBF EQU   IEDQAVTD+454                                             04192000
AVTNCKPR EQU   IEDQAVTD+453                                             04193000
AVTCIB   EQU   IEDQAVTD+452                                             04194000
AVTSPLPT EQU   IEDQAVTD+448                                             04195000
AVTSBTA  EQU   IEDQAVTD+440                                             04196000
AVTRARTN EQU   IEDQAVTD+436                                             04197000
AVTBSCAN EQU   IEDQAVTD+432                                             04198000
AVTRDYA  EQU   IEDQAVTD+428                                             04199000
AVTDISTR EQU   IEDQAVTD+420                                             04200000
AVTPARM3 EQU   IEDQAVTD+416                                             04201000
@NM00012 EQU   AVTPKF                                                   04202000
@NM00011 EQU   AVTPKF                                                   04203000
@NM00010 EQU   AVTPKF                                                   04204000
AVTFTCHF EQU   AVTPKF                                                   04205000
@NM00009 EQU   AVTPKF                                                   04206000
@NM00008 EQU   AVTPKF                                                   04207000
@NM00007 EQU   AVTPKF                                                   04208000
@NM00006 EQU   AVTPKF                                                   04209000
AVTPARM  EQU   IEDQAVTD+408                                             04210000
AVTEXS2A EQU   IEDQAVTD+402                                             04211000
AVTEXA2S EQU   IEDQAVTD+396                                             04212000
AVTOCGET EQU   IEDQAVTD+392                                             04213000
AVTCKAVT EQU   @NM00004+1                                               04214000
@NM00005 EQU   AVTCKFLG                                                 04215000
AVTCKHLT EQU   AVTCKFLG                                                 04216000
AVTCKREQ EQU   AVTCKFLG                                                 04217000
AVTCKENV EQU   AVTCKFLG                                                 04218000
AVTCKNAC EQU   AVTCKFLG                                                 04219000
AVTCKTAC EQU   AVTCKFLG                                                 04220000
AVTBUENT EQU   IEDQAVTD+386                                             04221000
@NM00003 EQU   IEDQAVTD+385                                             04222000
AVTFULLT EQU   AVTBUFSW                                                 04223000
AVTUNCON EQU   AVTBUFSW                                                 04224000
@NM00002 EQU   AVTBUFSW                                                 04225000
AVTBUFTR EQU   AVTREADD                                                 04226000
AVTREADY EQU   IEDQAVTD+376                                             04227000
AVTRACE  EQU   IEDQAVTD+372                                             04228000
AVTTCB   EQU   IEDQAVTD+368                                             04229000
AVTPASWD EQU   IEDQAVTD+360                                             04230000
AVTCTLCH EQU   IEDQAVTD+352                                             04231000
AVTDOUBL EQU   IEDQAVTD+344                                             04232000
AVTDOUBX EQU   IEDQAVTD+336                                             04233000
AVTDPARM EQU   IEDQAVTD+332                                             04234000
AVTDLQ   EQU   AVTSAVEX+32                                              04235000
@NM00001 EQU   AVTSAVEX                                                 04236000
AVTSAVE4 EQU   IEDQAVTD+216                                             04237000
AVTSAVE3 EQU   IEDQAVTD+144                                             04238000
AVTSAVE2 EQU   IEDQAVTD+72                                              04239000
AVTSAVE1 EQU   IEDQAVTD                                                 04240000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04241000
@RC00354 EQU   @RC00321                                                 04242000
@RC00326 EQU   @RC00321                                                 04243000
@RF00325 EQU   @RC00321                                                 04244000
@RC00368 EQU   @RC00367                                                 04245000
@RF00463 EQU   @RC00460                                                 04246000
@RC00518 EQU   @RC00516                                                 04247000
@RC00550 EQU   @RC00548                                                 04248000
@RC00713 EQU   @RC00711                                                 04249000
@ENDDATA EQU   *                                                        04250000
         END   IEDQWO,(C'PLS2006',0701,78129)                           04251000
