         TITLE 'IEDSAO: STATUS ANALYSIS OUTBOUND                       *00001000
                        '                                               00002000
IEDSAO   CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
         DC    A(0)                START OF QCB                         00005000
         DC    A(0)                                                     00006000
         DC    X'06'               START OF STCB                        00007000
         DC    AL3(*-1)                                                 00008000
         USING *,RBASE                                                  00009000
         LR    RBASE,R15           ESTABLISH ADDRESSABILTY              00010000
IEDSAO   IEDHJN START,HJN                                               00011000
*                                                                  0444 00012000
*/********************************************************************/ 00013000
*/*                                                                  */ 00014000
*/*     M A I N     R O U T I N E                                    */ 00015000
*/*                                                                  */ 00016000
*/********************************************************************/ 00017000
*                                                                  0444 00018000
*   RPRF=RPARM;                     /* PIU BUFFER ADDRESS            */ 00019000
         LR    RPRF,RPARM                                          0444 00020000
*   PIUSTART=ADDR(PRFPIUO)+PRFPIUO; /* ADDRESS OF PIU DATA(TH-RH-RU) */ 00021000
         LA    PIUSTART,PRFPIUO(,IEDQPPTR)                         0445 00022000
         SLR   @09,@09                                             0445 00023000
         IC    @09,PRFPIUO(,IEDQPPTR)                              0445 00024000
         ALR   PIUSTART,@09                                        0445 00025000
*/*                                                                  */ 00026000
*                                                                  0446 00027000
*   RPARM=TTHDAF;                   /* DAF TNT OFFSET VALUE          */ 00028000
         SLR   RPARM,RPARM                                         0446 00029000
         ICM   RPARM,3,TTHDAF(PIUSTART)                            0446 00030000
*   CALL IEDQTNT;                   /* GET DAF TERMINAL ENTRY        */ 00031000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0447 00032000
         BALR  @14,@15                                             0447 00033000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* ADJUST PTR TO IEDQTRM         */ 00034000
         LA    @05,14                                              0448 00035000
         LR    RTRM,RPARM                                          0448 00036000
         SLR   RTRM,@05                                            0448 00037000
*   RQCB=TRMDESTQ;                  /* QCB ADDRESSABILITY            */ 00038000
         SLR   RQCB,RQCB                                           0449 00039000
         ICM   RQCB,7,TRMDESTQ(RTRM)                               0449 00040000
*   IF(BDUCMND=CD0READ|             /* READ COMMAND OR               */ 00041000
*       BDUCMND=CD0INV) THEN        /* INVITE COMMAND ?              */ 00042000
         ALR   @05,PIUSTART                                        0450 00043000
         CLI   BDUCMND(@05),X'01'                                  0450 00044000
         BE    @RT00450                                            0450 00045000
         CLI   BDUCMND(@05),X'05'                                  0450 00046000
         BNE   @RF00450                                            0450 00047000
@RT00450 DS    0H                                                  0451 00048000
*     DO;                                                          0451 00049000
*       IF TRMASNXI=ON THEN         /* STOPLINE,I IN PROGRESS?       */ 00050000
         TM    TRMASNXI(RTRM),B'00010000'                          0452 00051000
         BNO   @RF00452                                            0452 00052000
*         DO;                                                      0453 00053000
*           TRMASNXI=OFF;           /* RESET STOPLINE INDICATOR      */ 00054000
         NI    TRMASNXI(RTRM),B'11101111'                          0454 00055000
*           RPARM=TTHOAF;           /* SWAP ...              @YM08042*/ 00056000
         SLR   RPARM,RPARM                                         0455 00057000
         ICM   RPARM,3,TTHOAF(PIUSTART)                            0455 00058000
*           TTHOAF=TTHDAF;          /* ... OAF ...           @YM08042*/ 00059000
         MVC   @TS00001(2),TTHDAF(PIUSTART)                        0456 00060000
         MVC   TTHOAF(2,PIUSTART),@TS00001                         0456 00061000
*           TTHDAF=RPARM;           /* ... AND DAF           @YM08042*/ 00062000
         STCM  RPARM,3,TTHDAF(PIUSTART)                            0457 00063000
*           TTHDCF=LENGTH(IEDRH)+1+LENGTH(IEDBDU);/* SET MINIMUM   0458 00064000
*                                      LENGTH ALLOWABLE      @YM08042*/ 00065000
         LA    @09,10                                              0458 00066000
         STCM  @09,3,TTHDCF(PIUSTART)                              0458 00067000
*           TRHTYPE=ON;             /* SET RESPONSE          @YM08042*/ 00068000
         ALR   @09,PIUSTART                                        0459 00069000
         OI    TRHTYPE(@09),B'10000000'                            0459 00070000
*           BDUERROR=ON;            /* MAKE THIS BUFFER ...          */ 00071000
         LA    @09,14                                              0460 00072000
         ALR   @09,PIUSTART                                        0460 00073000
         OI    BDUERROR(@09),B'10000000'                           0460 00074000
*           BDUPHASE=RSP00;         /* LOOK LIKE IT WAS ...          */ 00075000
         NI    BDUPHASE(@09),B'10011111'                           0461 00076000
*           BDURESP=RSPE1E;         /* RESET, THEN POST IT...        */ 00077000
         NI    BDURESP(@09),B'11111110'                            0462 00078000
         OI    BDURESP(@09),B'00011110'                            0462 00079000
*           IF PRFPIUO<MINPIUO THEN /* IF PIU OFFSET IS LESS THAN  0463 00080000
*                                      MINIMUM               @YM08042*/ 00081000
         CLI   PRFPIUO(IEDQPPTR),17                                0463 00082000
         BNL   @RF00463                                            0463 00083000
*             DO;                   /* THEN FORCE MINIMUM PIU OFFSET    00084000
*                                                            @YM08042*/ 00085000
*               PIUSAVE=PIU;        /* SAVE PIU              @YM08042*/ 00086000
         MVC   PIUSAVE(20),PIU(PIUSTART)                           0465 00087000
*               PRFPIUO=MINPIUO;    /* MIN PIU OFFSET        @YM08042*/ 00088000
         LA    @09,17                                              0466 00089000
         STC   @09,PRFPIUO(,IEDQPPTR)                              0466 00090000
*               PIUSTART=ADDR(PRFPIUO)+PRFPIUO;/* PIU ADDR   @YM08042*/ 00091000
         LA    PIUSTART,PRFPIUO(,IEDQPPTR)                         0467 00092000
         ALR   PIUSTART,@09                                        0467 00093000
*               PIU=PIUSAVE;        /* RESTORE PIU           @YM08042*/ 00094000
         MVC   PIU(20,PIUSTART),PIUSAVE                            0468 00095000
*             END;                  /*                       @YM08042*/ 00096000
*           PRFQCBA=SAVTSAI;        /* TO INBOUND DEBLOCK WHERE...   */ 00097000
@RF00463 L     @10,AVTSAVTP(,IEDQAPTR)                             0470 00098000
         MVC   PRFQCBA(3,IEDQPPTR),SAVTSAI+1(@10)                  0470 00099000
*           PRFPRI=PRIFIDIN;        /* IT WILL BE TREATED AS ...     */ 00100000
         MVI   PRFPRI(IEDQPPTR),X'E4'                              0471 00101000
*           RPARM=RPRF;             /* ANY RESETTED READ/INVITE      */ 00102000
         LR    RPARM,RPRF                                          0472 00103000
*           CALL DSPPOST;                                          0473 00104000
         LA    @15,DSPPOST(,RDISP)                                 0473 00105000
         BALR  @14,@15                                             0473 00106000
*         END;                                                     0474 00107000
*       ELSE                                                       0475 00108000
*         CALL BYPPCOUT;                                           0475 00109000
         B     @RC00452                                            0475 00110000
@RF00452 BAL   @14,BYPPCOUT                                        0475 00111000
*     END;                                                         0476 00112000
*   ELSE                            /* NOT READ COMMAND              */ 00113000
*     IF BDUCMND=CD0WRT THEN        /* WRITE COMMAND                 */ 00114000
         B     @RC00450                                            0477 00115000
@RF00450 CLI   BDUCMND+14(PIUSTART),X'02'                          0477 00116000
         BNE   @RF00477                                            0477 00117000
*       CALL WRTPROC;               /* YES PROCESS WRITE COMMAND     */ 00118000
         BAL   @14,WRTPROC                                         0478 00119000
*     ELSE                                                         0479 00120000
*       IF BDUCMND=CD0CONT THEN     /* IF THIS IS A CONTACT          */ 00121000
         B     @RC00477                                            0479 00122000
@RF00477 CLI   BDUCMND+14(PIUSTART),X'06'                          0479 00123000
         BNE   @RF00479                                            0479 00124000
*         DO;                                                      0480 00125000
*           IF TRMASNXI=ON THEN     /* AND STOPLINE,I IS IN PROGRESS */ 00126000
         TM    TRMASNXI(RTRM),B'00010000'                          0481 00127000
         BNO   @RF00481                                            0481 00128000
*             DO;                                                  0482 00129000
*               RLCB=QCBPLCBA;      /* PLCB EXIST FOR SPECOUT CONTACT   00130000
*                                                            @OZ27856*/ 00131000
         LR    @10,IEDQQPTR                                        0483 00132000
         AL    @10,@CF02064                                        0483 00133000
         L     RLCB,QCBPLCBA-5(,@10)                               0483 00134000
         LA    RLCB,0(,RLCB)                                       0483 00135000
*               CALL OUTDHPST;      /* SIMULATE NORMAL COMPLETION BY    00136000
*                                      POSTING THIS PIU BACK TO    0484 00137000
*                                      IEDNKA, THEN EXIT. THE NEXT 0484 00138000
*                                      WRITE BUFFER WILL FOLLOW THE     00139000
*                                      "ABORT" EXCEPTION PATH IN   0484 00140000
*                                      "WRITPROC" SUBROUTINE WHICH 0484 00141000
*                                      WILL TERMINATE THIS OPERATION */ 00142000
         BAL   @14,OUTDHPST                                        0484 00143000
*             END;                                                 0485 00144000
*         END;                                                     0486 00145000
*                                                                  0486 00146000
*/*                                                                  */ 00147000
*                                                                  0487 00148000
*       ELSE                        /* IF NOT WRITE, READ OR CONTACT */ 00149000
*         CALL BYPPCOUT;            /* THEN BYPASS TO IEDPCOUT       */ 00150000
         B     @RC00479                                            0487 00151000
@RF00479 BAL   @14,BYPPCOUT                                        0487 00152000
*/********************************************************************/ 00153000
*/*                                                                  */ 00154000
*/* END OF MAIN ROUTINE                                              */ 00155000
*/*                                                                  */ 00156000
*/********************************************************************/ 00157000
*                                                                  0488 00158000
*                                                                  0488 00159000
*   /*****************************************************************/ 00160000
*   /*                                                               */ 00161000
*   /* ABORT: THIS PROCEDURE IS CALLED WHEN A WRITE OPERATION IS     */ 00162000
*   /* BEING TERMINATED. IF LCBABRTN IS ON, THE CURRENT BUFFER IS    */ 00163000
*   /* FREED. ELSE LCBABRTN IS SET ON, A TAGGED RESET IMMEDIATE IS   */ 00164000
*   /* BUILT IN THE CURRENT BUFFER AND THIS BUFFER IS POSTED TO      */ 00165000
*   /* IEDPCOUT. ANY FURTHER WRITE BUFFERS WILL FIND LCBABRTN ON AND */ 00166000
*   /* WILL BE FREED. THE TAGGED RESET ENSURES ALL COMMANDS ARE ENDED*/ 00167000
*   /* IN THE NCP. WHEN THIS TAGGED RESET RESPONSE IS RECEIVED BY    */ 00168000
*   /* INBOUND DEBLOCK, IT WILL BE POSTED TO THE MH AS AN ERROR      */ 00169000
*   /* BUFFER                                                        */ 00170000
*   /*                                                               */ 00171000
*   /*****************************************************************/ 00172000
*                                                                  0488 00173000
*ABORT:                                                            0488 00174000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0488 00175000
*                                                                  0488 00176000
         B     @PB00002                                            0488 00177000
ABORT    DS    0H                                                  0489 00178000
*/*                                                                  */ 00179000
*                                                                  0489 00180000
*   IF LCBABRTN=ON THEN             /* IF ALREADY SET FOR TERMINATION*/ 00181000
         TM    LCBABRTN(IEDQLPTR),B'00000001'                      0489 00182000
         BNO   @RF00489                                            0489 00183000
*     DO;                                                          0490 00184000
*       RPARM=RPRF;                 /* PICKUP POINTER TO BUFFER      */ 00185000
         LR    RPARM,RPRF                                          0491 00186000
*       CALL DISCARD;               /* FREE THE BUFFER               */ 00187000
         BAL   @14,DISCARD                                         0492 00188000
*       CALL DSPDISP;               /* EXIT                          */ 00189000
         LA    @15,DSPDISP(,RDISP)                                 0493 00190000
         BALR  @14,@15                                             0493 00191000
*     END;                                                         0494 00192000
*   ELSE                                                           0495 00193000
*     DO;                                                          0495 00194000
         B     @RC00489                                            0495 00195000
@RF00489 DS    0H                                                  0496 00196000
*       LCBABRTN=ON;                /* INDICATE SUBSEQUENT WRITE BFRS   00197000
*                                      WILL BE FREED                 */ 00198000
         OI    LCBABRTN(IEDQLPTR),B'00000001'                      0496 00199000
*       TTHTAG1=0;                  /* PUT A TAG...                  */ 00200000
         MVI   TTHTAG1(PIUSTART),X'00'                             0497 00201000
*       TTHTAG2=TTHRESET;           /* ...IN THIS BUFFER             */ 00202000
         MVI   TTHTAG2(PIUSTART),X'02'                             0498 00203000
*       TTHDCF=LENGTH(PIU0RH)+LENGTH(PIU0PAD)+LENGTH(IEDBDU);/* SET     00204000
*                                      DATA CNT                      */ 00205000
         MVC   TTHDCF(2,PIUSTART),@CH01155                         0499 00206000
*       PIU0RH=TRHFID0;             /* SETUP TRH FIELDS              */ 00207000
         MVC   PIU0RH(3,PIUSTART),@CB01539                         0500 00208000
*       PIU0PAD=PIU0PAD0;           /* SETUP PAD CHAR                */ 00209000
         MVI   PIU0PAD(PIUSTART),X'00'                             0501 00210000
*       BDUCMND=CD0CTRL;            /* CONTROL CMND                  */ 00211000
         LA    @09,14                                              0502 00212000
         ALR   @09,PIUSTART                                        0502 00213000
         MVI   BDUCMND(@09),X'08'                                  0502 00214000
*       BDUMODIF=CD0CRI;            /* RESET IMMEDIATE               */ 00215000
         MVI   BDUMODIF(@09),X'44'                                 0503 00216000
*       IEDBDU(3:6)=IEDBDU(3:6)&&IEDBDU(3:6);/* SET OTHER BDU FIELDS    00217000
*                                      TO ZERO                       */ 00218000
         XC    IEDBDU+2(4,@09),IEDBDU+2(@09)                       0504 00219000
*       IF PRFTIC^=PRFINTIC THEN    /* IF BFR HAS MORE THAN ONE UNIT */ 00220000
         CLC   PRFTIC(4,IEDQPPTR),@CB01258                         0505 00221000
         BE    @RF00505                                            0505 00222000
*         DO;                                                      0506 00223000
*           RPARM=PRFTI0;           /* PICKUP PTR TO NEXT UNIT       */ 00224000
         L     RPARM,PRFTI0-1(,IEDQPPTR)                           0507 00225000
         LA    RPARM,0(,RPARM)                                     0507 00226000
*           PRFTIC=PRFINTIC;        /* SET INVALID TIC IN FIRST UNIT */ 00227000
         MVC   PRFTIC(4,IEDQPPTR),@CB01258                         0508 00228000
*           CALL DISCARD;           /* FREE REMAINING UNITS          */ 00229000
         BAL   @14,DISCARD                                         0509 00230000
*         END;                                                     0510 00231000
*       SCBTXTTN=ON;                                               0511 00232000
@RF00505 L     @10,IEDQSPTR-1(,IEDQLPTR)                           0511 00233000
         OI    SCBTXTTN(@10),B'01000000'                           0511 00234000
*       CALL BYPPCOUT;                                             0512 00235000
         BAL   @14,BYPPCOUT                                        0512 00236000
*     END;                                                         0513 00237000
*   END ABORT;                                                     0514 00238000
@EL00002 DS    0H                                                  0514 00239000
@EF00002 DS    0H                                                  0514 00240000
@ER00002 BR    @14                                                 0514 00241000
@PB00002 DS    0H                                                  0515 00242000
*                                                                  0515 00243000
*/********************************************************************/ 00244000
*/*                                                                  */ 00245000
*/* THIS ROUTINE BYPASSES(THROUGH THE DISPATCHER) TO PATH CONTROL    */ 00246000
*/* OUTBOUND(IEDPCOUT). IT PASSES THE PIU BUFFER.                    */ 00247000
*/*                                                                  */ 00248000
*/********************************************************************/ 00249000
*                                                                  0515 00250000
*BYPPCOUT:                                                         0515 00251000
*   RQCB=ADDR(IEDPCOUT);            /* IEDPCOUT'S QCB ADDRESS        */ 00252000
BYPPCOUT L     RQCB,@CV02017                                       0515 00253000
*   RSTCB=QCBSTCHN;                 /* IEDPCOUT'S STCB ADDRESS       */ 00254000
         L     RSTCB,QCBSTCHN-1(,IEDQQPTR)                         0516 00255000
         LA    RSTCB,0(,RSTCB)                                     0516 00256000
*   RPARM=RPRF;                     /* PIU BUFFER ADDRESS            */ 00257000
         LR    RPARM,RPRF                                          0517 00258000
*   CALL DSPBYPAS;                  /* BYPASS TO PATH CONTROL      0518 00259000
*                                      OUTBOUND                      */ 00260000
         LA    @15,DSPBYPAS(,RDISP)                                0518 00261000
         BALR  @14,@15                                             0518 00262000
*                                                                  0519 00263000
*/********************************************************************/ 00264000
*/*                                                                  */ 00265000
*/* THIS ROUTINE DISCARDS ALL THE UNITS IN A PIU BUFFER.  IT POSTS   */ 00266000
*/* THEM TO BUF  RETURN(IEDQGB).                                     */ 00267000
*/*       INPUT= REG1 POINTS TO PIU BUFFER TO BE DISCARDED           */ 00268000
*/*                                                                  */ 00269000
*/********************************************************************/ 00270000
*                                                                  0519 00271000
*DISCARD:                                                          0519 00272000
*   PROC OPTIONS(SAVE(14),RETREG);                                 0519 00273000
*                                                                  0519 00274000
         B     @PB00003                                            0519 00275000
DISCARD  ST    @14,@SA00003                                        0519 00276000
*/*                                                                  */ 00277000
*                                                                  0520 00278000
*   RPARM->PRFNBUNT=0;              /* SET NUMBER OF UNITS = 0 (THIS    00279000
*                                      MEANS IEDQGB WILL CALCULATE 0520 00280000
*                                      THE NUMBER OF UNITS TO BE   0520 00281000
*                                      FREED)                        */ 00282000
         MVI   PRFNBUNT(RPARM),X'00'                               0520 00283000
*   RPARM->PRFQCBA=ADDR(AVTBFRTB);  /* ADDR OF BUFFER RETURN QCB     */ 00284000
         LA    @10,AVTBFRTB(,IEDQAPTR)                             0521 00285000
         STCM  @10,7,PRFQCBA(RPARM)                                0521 00286000
*   RPARM->PRFPRI=PRIBFRTB;         /* POST PRIORITY                 */ 00287000
         MVI   PRFPRI(RPARM),X'E0'                                 0522 00288000
*   CALL DSPPOSTR;                  /* FREE UNITS                    */ 00289000
         LA    @15,DSPPOSTR(,RDISP)                                0523 00290000
         BALR  @14,@15                                             0523 00291000
*/*                                                                  */ 00292000
*                                                                  0524 00293000
*   END DISCARD;                                                   0524 00294000
@EL00003 DS    0H                                                  0524 00295000
@EF00003 DS    0H                                                  0524 00296000
@ER00003 L     @14,@SA00003                                        0524 00297000
         BR    @14                                                 0524 00298000
*                                                                  0525 00299000
*   /*****************************************************************/ 00300000
*   /*                                                               */ 00301000
*   /* OUTDHPST: POST PIU TO OUTDH WITHOUT TRANSFORMING TO A TCAM    */ 00302000
*   /* BUFFER. OUTDH USES THESE RESPONSE ONLY AS A TRIGGER TO DRIVE  */ 00303000
*   /* OTHER PROCESSING, THUS THEY CAN BE IN PIU FORM.               */ 00304000
*   /*                                                               */ 00305000
*   /*****************************************************************/ 00306000
*                                                                  0525 00307000
*OUTDHPST:                                                         0525 00308000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0525 00309000
OUTDHPST DS    0H                                                  0526 00310000
*   RPARM=RPRF;                     /* ELEMENT ADDR                  */ 00311000
         LR    RPARM,RPRF                                          0526 00312000
*   PRFLCB=RLCB;                    /* LCB ADDR                      */ 00313000
         STCM  RLCB,7,PRFLCB(IEDQPPTR)                             0527 00314000
*   PRFPRI=PRIRESUM;                /* PRIORITY                      */ 00315000
         MVI   PRFPRI(IEDQPPTR),X'E5'                              0528 00316000
*   PRFQCBA=SAVTCNIR;               /* QCB ADDR (IEDNKA)             */ 00317000
         L     @10,AVTSAVTP(,IEDQAPTR)                             0529 00318000
         MVC   PRFQCBA(3,IEDQPPTR),SAVTCNIR+1(@10)                 0529 00319000
*   CALL DSPPOST;                   /* POST BUFFER                   */ 00320000
         LA    @15,DSPPOST(,RDISP)                                 0530 00321000
         BALR  @14,@15                                             0530 00322000
*   END OUTDHPST;                                                  0531 00323000
@EL00004 DS    0H                                                  0531 00324000
@EF00004 DS    0H                                                  0531 00325000
@ER00004 BR    @14                                                 0531 00326000
*                                                                  0532 00327000
*   /*****************************************************************/ 00328000
*   /*                                                               */ 00329000
*   /* POST PLCB TO IEDQBD TO REDRIVE THE SCHEDULERS                 */ 00330000
*   /*                                                               */ 00331000
*   /*****************************************************************/ 00332000
*                                                                  0532 00333000
*POSTPLCB:                                                         0532 00334000
*   PROC OPTIONS(SAVE(14),RETREG);                                 0532 00335000
*                                                                  0532 00336000
POSTPLCB ST    @14,@SA00005                                        0532 00337000
*/*                                                                  */ 00338000
*                                                                  0533 00339000
*   RPARM=RLCB;                     /* PARM REG POINTS TO ELEMENT    */ 00340000
         LR    RPARM,RLCB                                          0533 00341000
*   LCBPRI=PRILCB;                  /* PRIORITY OF POST              */ 00342000
         MVI   LCBPRI(IEDQLPTR),X'E7'                              0534 00343000
*   LCBQCBA=AVTMSGS->BDQCB;         /* BD'S QCB ADDRESS              */ 00344000
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0535 00345000
         MVC   LCBQCBA(3,IEDQLPTR),BDQCB+1(@10)                    0535 00346000
*   CALL DSPPOSTR;                                                 0536 00347000
*                                                                  0536 00348000
         LA    @15,DSPPOSTR(,RDISP)                                0536 00349000
         BALR  @14,@15                                             0536 00350000
*/*                                                                  */ 00351000
*                                                                  0537 00352000
*   END POSTPLCB;                   /* RETURN TO CALLER              */ 00353000
@EL00005 DS    0H                                                  0537 00354000
@EF00005 DS    0H                                                  0537 00355000
@ER00005 L     @14,@SA00005                                        0537 00356000
         BR    @14                                                 0537 00357000
@PB00005 DS    0H                                                  0538 00358000
         EJECT                                                          00359000
*                                                                  0538 00360000
*/********************************************************************/ 00361000
*/*                                                                  */ 00362000
*/* THIS ROUTINE PROCESSES WRITE COMMANDS.                           */ 00363000
*/*                                                                  */ 00364000
*/********************************************************************/ 00365000
*                                                                  0538 00366000
*WRTPROC:                                                          0538 00367000
*   RLCB=QCBPLCBA;                  /* PLCB ADDRESSABILITY           */ 00368000
WRTPROC  LR    @09,IEDQQPTR                                        0538 00369000
         AL    @09,@CF02064                                        0538 00370000
         L     RLCB,QCBPLCBA-5(,@09)                               0538 00371000
         LA    RLCB,0(,RLCB)                                       0538 00372000
*/*                                                                  */ 00373000
*/*IF A WRITE IS IN PROGRESS AT SAME TIME AS STOPLINE,I THE WRITE    */ 00374000
*/*WILL BE TERMINATED                                                */ 00375000
*/*                                                                  */ 00376000
*                                                                  0539 00377000
*   IF TRMASNXI=ON THEN             /* HAS RESET IMMEDIATE BEEN    0539 00378000
*                                      ISSUED?                       */ 00379000
         TM    TRMASNXI(RTRM),B'00010000'                          0539 00380000
         BNO   @RF00539                                            0539 00381000
*     DO;                                                          0540 00382000
*       TRMASNXI=OFF;               /* RESET STOPLINE INDICATOR      */ 00383000
         NI    TRMASNXI(RTRM),B'11101111'                          0541 00384000
*       IF LCBMSGNN=ON THEN         /* IF THIS IS A MSGGEN DURING A     00385000
*                                      STOP LINE, THE ERB WILL BE  0542 00386000
*                                      POSTED TO IEDQBD              */ 00387000
         TM    LCBMSGNN(IEDQLPTR),B'01000000'                      0542 00388000
         BNO   @RF00542                                            0542 00389000
*         DO;                                                      0543 00390000
*           RPARM=RPRF;                                            0544 00391000
         LR    RPARM,RPRF                                          0544 00392000
*           CALL DISCARD;           /* FREE THE BUFFER               */ 00393000
         BAL   @14,DISCARD                                         0545 00394000
*           LCBMSGNN=OFF;           /* INDICATE MSGGEN NOT OUT       */ 00395000
         NI    LCBMSGNN(IEDQLPTR),B'10111111'                      0546 00396000
*           PRFPRI=PRIRCQCB;        /* SET PRIORITY FOR ERB POST     */ 00397000
         MVI   PRFPRI(IEDQPPTR),X'E0'                              0547 00398000
*           LCBERBQB=AVTMSGS->BDQCB;/* IEDQBD'S QCB ADDRESS          */ 00399000
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0548 00400000
         MVC   LCBERBQB(3,IEDQLPTR),BDQCB+1(@10)                   0548 00401000
*           RPARM=ADDR(LCBERB);     /* POSTED ELEMENT IS ERB         */ 00402000
         LA    RPARM,LCBERB(,IEDQLPTR)                             0549 00403000
*           CALL DSPPOST;                                          0550 00404000
         LA    @15,DSPPOST(,RDISP)                                 0550 00405000
         BALR  @14,@15                                             0550 00406000
*         END;                                                     0551 00407000
*       ELSE                                                       0552 00408000
*         IF TRMNLOUT=ON THEN       /* IF A NULL WRITE IS IN PROGRESS   00409000
*                                      DURING STOPLINE,I             */ 00410000
         B     @RC00542                                            0552 00411000
@RF00542 TM    TRMNLOUT(RTRM),B'00000100'                          0552 00412000
         BNO   @RF00552                                            0552 00413000
*           DO;                                                    0553 00414000
*             IF BDUMODIF=CD0WT THEN/* IF THIS IS A NULL WR TX       */ 00415000
         CLI   BDUMODIF+14(PIUSTART),X'02'                         0554 00416000
         BNE   @RF00554                                            0554 00417000
*               DO;                                                0555 00418000
*                 LCBRESP=OFF;      /* TURN OFF RESPONSE OWED        */ 00419000
         NI    LCBRESP(IEDQLPTR),B'11111110'                       0556 00420000
*                 RPARM=RPRF;       /* PASS PIU ADDR         @YM08463*/ 00421000
         LR    RPARM,RPRF                                          0557 00422000
*                 CALL DISCARD;     /* FREE PIU              @YM08463*/ 00423000
         BAL   @14,DISCARD                                         0558 00424000
*                 LCBRCLLN=ON;      /* INDICATE BFRS FREED   @YM08463*/ 00425000
         OI    LCBRCLLN(IEDQLPTR),B'10000000'                      0559 00426000
*                 CALL POSTPLCB;    /* POSTPLCB TO IEDQBD            */ 00427000
         BAL   @14,POSTPLCB                                        0560 00428000
*                 CALL DSPDISP;     /* EXIT                          */ 00429000
         LA    @15,DSPDISP(,RDISP)                                 0561 00430000
         BALR  @14,@15                                             0561 00431000
*               END;                                               0562 00432000
*             ELSE                  /* IF THIS IS A NULL WRITE BLOCK    00433000
*                                      FOR SPEC OUT PROCESSING THEN  */ 00434000
*               DO;                                                0563 00435000
         B     @RC00554                                            0563 00436000
@RF00554 DS    0H                                                  0564 00437000
*                 QCBSDFFO=OFF;     /* TURN OFF SENDING BIT AND    0564 00438000
*                                      SIMULATE A GOOD COMPLETION BY    00439000
*                                      POSTING PIU BACK TO OUTDH. THE   00440000
*                                      NEXT WRITE BUFFER WILL FOLLOW    00441000
*                                      THE "ABORT" EXCEPTION PATH IN    00442000
*                                      THIS MODULE AND THUS TERMINATE   00443000
*                                      THE WRITE                     */ 00444000
         NI    QCBSDFFO(IEDQQPTR),B'11111011'                      0564 00445000
*                 CALL OUTDHPST;                                   0565 00446000
         BAL   @14,OUTDHPST                                        0565 00447000
*               END;                                               0566 00448000
*           END;                                                   0567 00449000
*         ELSE                      /*                       @YM08038*/ 00450000
*           IF TTHTAG2=TTHABORT&    /* IF NULL WRITE TO ABORT      0568 00451000
*                                                            @YM08038*/ 00452000
*               TTHTAG1=0 THEN      /* AN INPUT OPERATION    @YM08038*/ 00453000
         B     @RC00552                                            0568 00454000
@RF00552 CLI   TTHTAG2(PIUSTART),X'04'                             0568 00455000
         BNE   @RF00568                                            0568 00456000
         CLI   TTHTAG1(PIUSTART),0                                 0568 00457000
         BNE   @RF00568                                            0568 00458000
*             DO;                   /*                       @YM08038*/ 00459000
*               LCBUSUE=ON;         /* INDICATE END OF RCV OPERATION    00460000
*                                                            @YM08038*/ 00461000
         OI    LCBUSUE(IEDQLPTR),B'00000001'                       0570 00462000
*               CALL OUTDHPST;      /* RETURN RESPONSE TO IEDNKA   0571 00463000
*                                                            @YM08038*/ 00464000
         BAL   @14,OUTDHPST                                        0571 00465000
*             END;                  /*                       @YM08038*/ 00466000
*           ELSE                                                   0573 00467000
*             CALL ABORT;           /* THIS SUBROUTINE TERMINATES  0573 00468000
*                                      DATA WRITES                   */ 00469000
         B     @RC00568                                            0573 00470000
@RF00568 BAL   @14,ABORT                                           0573 00471000
*     END;                                                         0574 00472000
*                                                                  0574 00473000
*/*                                                                  */ 00474000
*/*STOPLINE,I IS NOT IN PROGRESS                                     */ 00475000
*/*                                                                  */ 00476000
*                                                                  0575 00477000
*   ELSE                                                           0575 00478000
*     DO;                                                          0575 00479000
         B     @RC00539                                            0575 00480000
@RF00539 DS    0H                                                  0576 00481000
*       IF LCBMSGNN=ON|             /* IF MSGGEN OR          @YM08038*/ 00482000
*           (TTHTAG2=TTHABORT&      /* NULL WRITE TO ABORT   @YM08038*/ 00483000
*           TTHTAG1=0) THEN         /* AN INPUT OPERATION THEN     0576 00484000
*                                                            @YM08038*/ 00485000
         TM    LCBMSGNN(IEDQLPTR),B'01000000'                      0576 00486000
         BO    @RT00576                                            0576 00487000
         CLI   TTHTAG2(PIUSTART),X'04'                             0576 00488000
         BNE   @RF00576                                            0576 00489000
         CLI   TTHTAG1(PIUSTART),0                                 0576 00490000
         BNE   @RF00576                                            0576 00491000
@RT00576 DS    0H                                                  0577 00492000
*         CALL BYPPCOUT;            /* BYPASS TO PATH CONTROL      0577 00493000
*                                      OUTBOUND                      */ 00494000
         BAL   @14,BYPPCOUT                                        0577 00495000
*       ELSE                        /* NOT MSGGEN                    */ 00496000
*         DO;                                                      0578 00497000
         B     @RC00576                                            0578 00498000
@RF00576 DS    0H                                                  0579 00499000
*           IF LCBABRTN=ON THEN     /* ABORT SEQUENCE                */ 00500000
         TM    LCBABRTN(IEDQLPTR),B'00000001'                      0579 00501000
         BNO   @RF00579                                            0579 00502000
*             DO;                   /* YES                           */ 00503000
*               RPARM=RPRF;         /* PIU BUFFER ADDRESS            */ 00504000
         LR    RPARM,RPRF                                          0581 00505000
*               CALL DISCARD;       /* DISCARD PIU BUFFER            */ 00506000
         BAL   @14,DISCARD                                         0582 00507000
*               CALL DSPDISP;       /* EXIT TO DISPATCHER            */ 00508000
         LA    @15,DSPDISP(,RDISP)                                 0583 00509000
         BALR  @14,@15                                             0583 00510000
*             END;                                                 0584 00511000
*           ELSE                    /* NOT ABORT SEQUENCE            */ 00512000
*             CALL BYPPCOUT;        /* BYPASS TO PATH CONTROL      0585 00513000
*                                      OUTBOUND                      */ 00514000
         B     @RC00579                                            0585 00515000
@RF00579 BAL   @14,BYPPCOUT                                        0585 00516000
*         END;                                                     0586 00517000
*     END;                                                         0587 00518000
*   END IEDSAO                                                     0588 00519000
*                                                                  0588 00520000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00521000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00522000
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */ 00523000
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */ 00524000
*/*%INCLUDE SYSLIB  (TDISPD  )                                       */ 00525000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 00526000
*/*%INCLUDE SYSLIB  (TPIU0D  )                                       */ 00527000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00528000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00529000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 00530000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00531000
*/*%INCLUDE SYSLIB  (TRSPD   )                                       */ 00532000
*/*%INCLUDE SYSLIB  (TSCBD   )                                       */ 00533000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00534000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00535000
*                                                                  0588 00536000
*       ;                                                          0588 00537000
@EL00001 DS    0H                                                  0588 00538000
@EF00001 DS    0H                                                  0588 00539000
@ER00001 BR    @14                                                 0588 00540000
@DATA    DS    0H                                                       00541000
@CH01155 DC    H'10'                                                    00542000
         DS    0F                                                       00543000
@SA00003 DS    1F                                                       00544000
@SA00005 DS    1F                                                       00545000
         DS    0F                                                       00546000
@CF02064 DC    F'-4'                                                    00547000
@CV02017 DC    V(IEDPCOUT)                                              00548000
         DS    0D                                                       00549000
@TS00001 DS    CL2                                                      00550000
@CB01258 DC    X'08000002'                                              00551000
@CB01539 DC    X'0B8000'                                                00552000
         DS    CL3                                                      00553000
PIUSAVE  DS    CL20                                                     00554000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00555000
@01      EQU   01                                                       00556000
@02      EQU   02                                                       00557000
@03      EQU   03                                                       00558000
@04      EQU   04                                                       00559000
@05      EQU   05                                                       00560000
@06      EQU   06                                                       00561000
@07      EQU   07                                                       00562000
@08      EQU   08                                                       00563000
@09      EQU   09                                                       00564000
@10      EQU   10                                                       00565000
@11      EQU   11                                                       00566000
@12      EQU   12                                                       00567000
@13      EQU   13                                                       00568000
@14      EQU   14                                                       00569000
@15      EQU   15                                                       00570000
PIUSTART EQU   @10                                                      00571000
IEDQAPTR EQU   @13                                                      00572000
RDISP    EQU   @11                                                      00573000
IEDQLPTR EQU   @04                                                      00574000
LCBXPTR  EQU   @05                                                      00575000
IEDQPPTR EQU   @06                                                      00576000
IEDQQPTR EQU   @07                                                      00577000
RTRM     EQU   @08                                                      00578000
RPARM    EQU   @01                                                      00579000
REG0     EQU   @00                                                      00580000
RSTCB    EQU   @03                                                      00581000
RLCB     EQU   @04                                                      00582000
RPRF     EQU   @06                                                      00583000
RQCB     EQU   @07                                                      00584000
RBASE    EQU   @12                                                      00585000
RAVT     EQU   @13                                                      00586000
R14      EQU   @14                                                      00587000
R15      EQU   @15                                                      00588000
IEDQAVTD EQU   0                                                        00589000
AVTSAVEX EQU   IEDQAVTD+216                                             00590000
AVTREADD EQU   IEDQAVTD+308                                             00591000
AVTBUFSW EQU   IEDQAVTD+312                                             00592000
@NM00004 EQU   IEDQAVTD+316                                             00593000
AVTCKFLG EQU   @NM00004                                                 00594000
AVTBASE  EQU   IEDQAVTD+340                                             00595000
AVTPKF   EQU   AVTBASE                                                  00596000
AVTRNMPT EQU   IEDQAVTD+352                                             00597000
AVTOSECB EQU   IEDQAVTD+420                                             00598000
AVTECB1  EQU   AVTOSECB                                                 00599000
AVTHG02  EQU   IEDQAVTD+456                                             00600000
AVTDISP  EQU   IEDQAVTD+480                                             00601000
AVTHD    EQU   IEDQAVTD+484                                             00602000
AVTSCOPT EQU   AVTHD                                                    00603000
AVTSAVTP EQU   IEDQAVTD+540                                             00604000
AVTSAVTF EQU   AVTSAVTP                                                 00605000
AVTCKPEL EQU   IEDQAVTD+580                                             00606000
AVTCKRMV EQU   AVTCKPEL                                                 00607000
AVTCKELF EQU   IEDQAVTD+608                                             00608000
AVTCKBYT EQU   IEDQAVTD+619                                             00609000
AVTHG01  EQU   IEDQAVTD+620                                             00610000
AVTCKLNK EQU   IEDQAVTD+624                                             00611000
AVTCRELE EQU   IEDQAVTD+636                                             00612000
AVTCCELE EQU   AVTCRELE                                                 00613000
AVTCLRHI EQU   IEDQAVTD+644                                             00614000
AVTADBUF EQU   IEDQAVTD+648                                             00615000
AVTSYSER EQU   IEDQAVTD+656                                             00616000
AVTMSGS  EQU   IEDQAVTD+657                                             00617000
AVTBFRFG EQU   IEDQAVTD+712                                             00618000
AVTBFRTB EQU   IEDQAVTD+720                                             00619000
AVTCKPQB EQU   IEDQAVTD+732                                             00620000
AVTCKPTB EQU   AVTCKPQB                                                 00621000
AVTCKPEC EQU   AVTCKPQB+4                                               00622000
AVTCKPCC EQU   AVTCKPEC                                                 00623000
AVTOPCQB EQU   IEDQAVTD+744                                             00624000
AVTOPCOB EQU   AVTOPCQB                                                 00625000
AVTOPCEC EQU   AVTOPCQB+4                                               00626000
AVTOPCCC EQU   AVTOPCEC                                                 00627000
AVTOLTQB EQU   IEDQAVTD+756                                             00628000
AVTCWFL1 EQU   IEDQAVTD+852                                             00629000
AVTCWFL2 EQU   IEDQAVTD+853                                             00630000
AVTSUBT  EQU   IEDQAVTD+876                                             00631000
AVTIOTR  EQU   IEDQAVTD+877                                             00632000
AVTBIT1  EQU   IEDQAVTD+978                                             00633000
AVTBIT2  EQU   IEDQAVTD+979                                             00634000
AVTBIT3  EQU   IEDQAVTD+980                                             00635000
AVTBIT4  EQU   IEDQAVTD+1064                                            00636000
@NM00086 EQU   IEDQAVTD+1160                                            00637000
IEDNSVTD EQU   0                                                        00638000
SAVTDIAG EQU   IEDNSVTD                                                 00639000
SAVTDIAF EQU   SAVTDIAG                                                 00640000
SAVTCNIR EQU   IEDNSVTD+56                                              00641000
SAVTLUSQ EQU   IEDNSVTD+88                                              00642000
SAVTXFMI EQU   IEDNSVTD+132                                             00643000
SAVTSAI  EQU   IEDNSVTD+184                                             00644000
SAVTTCPU EQU   IEDNSVTD+238                                             00645000
SAVTZELM EQU   IEDNSVTD+270                                             00646000
SAVTRDRV EQU   IEDNSVTD+284                                             00647000
SAVTCKQB EQU   IEDNSVTD+300                                             00648000
SAVTCKTB EQU   SAVTCKQB                                                 00649000
SAVTCKEC EQU   SAVTCKQB+4                                               00650000
SAVTCKCC EQU   SAVTCKEC                                                 00651000
IEDBDU   EQU   0                                                        00652000
BDUCMND  EQU   IEDBDU                                                   00653000
BDUMODIF EQU   IEDBDU+1                                                 00654000
BDUFNFLG EQU   IEDBDU+2                                                 00655000
BDUBDUFG EQU   IEDBDU+3                                                 00656000
BDURSP   EQU   IEDBDU+4                                                 00657000
BDUSYRSP EQU   BDURSP                                                   00658000
BDUERROR EQU   BDUSYRSP                                                 00659000
BDUPHASE EQU   BDUSYRSP                                                 00660000
BDURESP  EQU   BDUSYRSP                                                 00661000
BDUEXRSP EQU   BDURSP+1                                                 00662000
BDUEND   EQU   IEDBDU+6                                                 00663000
IEDQDISP EQU   0                                                        00664000
DSPDISP  EQU   4                                                        00665000
DSPBYPAS EQU   20                                                       00666000
DSPPOST  EQU   24                                                       00667000
DSPPOSTR EQU   28                                                       00668000
IEDQLCB  EQU   0                                                        00669000
LCBRCB   EQU   IEDQLCB                                                  00670000
LCBQCBA  EQU   LCBRCB+1                                                 00671000
LCBPRI   EQU   LCBRCB+4                                                 00672000
LCBTSOB  EQU   IEDQLCB+19                                               00673000
LCBCHAIN EQU   IEDQLCB+20                                               00674000
LCBSCRNN EQU   LCBCHAIN                                                 00675000
LCBTETEN EQU   LCBCHAIN                                                 00676000
LCBABRTN EQU   LCBCHAIN                                                 00677000
LCBINSRC EQU   IEDQLCB+21                                               00678000
LCBLKMDE EQU   LCBINSRC+2                                               00679000
LCBNTXT  EQU   IEDQLCB+24                                               00680000
LCBSTAT4 EQU   LCBNTXT                                                  00681000
LCBPHASE EQU   LCBSTAT4                                                 00682000
LCBSCBDA EQU   IEDQLCB+25                                               00683000
LCBMHA   EQU   IEDQLCB+29                                               00684000
LCBFLAG1 EQU   IEDQLCB+32                                               00685000
LCBIOBSN EQU   IEDQLCB+33                                               00686000
LCBSNS   EQU   LCBIOBSN+1                                               00687000
LCBSENS0 EQU   LCBSNS                                                   00688000
LCBLOSDT EQU   LCBSENS0                                                 00689000
LCBTMOUT EQU   LCBSENS0                                                 00690000
LCBFLAG3 EQU   LCBIOBSN+7                                               00691000
LCBCSW   EQU   LCBIOBSN+8                                               00692000
LCBCSWST EQU   LCBCSW+3                                                 00693000
LCBCSWUS EQU   LCBCSWST                                                 00694000
LCBUSUE  EQU   LCBCSWUS                                                 00695000
LCBCSWCS EQU   LCBCSWST+1                                               00696000
LCBSIOCC EQU   LCBIOBSN+15                                              00697000
LCBDCBPT EQU   IEDQLCB+52                                               00698000
LCBRCQCB EQU   IEDQLCB+56                                               00699000
LCBRESTR EQU   LCBRCQCB                                                 00700000
LCBTHSQ  EQU   IEDQLCB+60                                               00701000
LCBINCAM EQU   LCBTHSQ                                                  00702000
LCBERRCT EQU   IEDQLCB+62                                               00703000
LCBLSPCI EQU   IEDQLCB+65                                               00704000
LCBRCBFR EQU   LCBLSPCI                                                 00705000
LCBSTATE EQU   IEDQLCB+70                                               00706000
LCBSTAT1 EQU   LCBSTATE                                                 00707000
LCBRCLLN EQU   LCBSTAT1                                                 00708000
LCBSTAT2 EQU   LCBSTATE+1                                               00709000
LCBMSGNN EQU   LCBSTAT2                                                 00710000
LCBBEOTN EQU   LCBSTAT2                                                 00711000
LCBSYNC  EQU   LCBSTAT2                                                 00712000
LCBDIAL  EQU   LCBSTAT2                                                 00713000
LCBRESP  EQU   LCBSTAT2                                                 00714000
LCBTSTSW EQU   IEDQLCB+72                                               00715000
LCBERB   EQU   IEDQLCB+76                                               00716000
LCBERBQB EQU   LCBERB+1                                                 00717000
LCBERBST EQU   IEDQLCB+84                                               00718000
LCBDLNKN EQU   LCBERBST                                                 00719000
LCBERBCT EQU   IEDQLCB+88                                               00720000
LCBRBCT2 EQU   LCBERBCT+1                                               00721000
LCBMSGFM EQU   IEDQLCB+92                                               00722000
LCBSCBA  EQU   IEDQLCB+93                                               00723000
LCBOBRCH EQU   IEDQLCB+96                                               00724000
LCBINVPT EQU   LCBOBRCH+1                                               00725000
LCBBFRW  EQU   LCBINVPT                                                 00726000
LCBTPCD  EQU   IEDQLCB+100                                              00727000
LCBSTAT5 EQU   LCBTPCD                                                  00728000
LCBSTAT6 EQU   LCBTPCD+4                                                00729000
LCBRSPSV EQU   LCBTPCD+8                                                00730000
LCBSAVSN EQU   IEDQLCB+112                                              00731000
LCBERCCW EQU   IEDQLCB+120                                              00732000
LCBCPA   EQU   IEDQLCB+144                                              00733000
LCBCCW5  EQU   LCBCPA+32                                                00734000
LCBATTEL EQU   LCBCCW5                                                  00735000
LCBQEBPL EQU   LCBATTEL                                                 00736000
IEDQLCBX EQU   0                                                        00737000
LCBXCON  EQU   IEDQLCBX                                                 00738000
LCBXFLAG EQU   LCBXCON                                                  00739000
LCBXDCT  EQU   LCBXCON+1                                                00740000
LCBXRADR EQU   LCBXCON+4                                                00741000
IEDPIU0  EQU   0                                                        00742000
PIU0TH   EQU   IEDPIU0                                                  00743000
PIU0RH   EQU   IEDPIU0+10                                               00744000
PIU0PAD  EQU   IEDPIU0+13                                               00745000
PIU0RU   EQU   IEDPIU0+14                                               00746000
IEDQPRF  EQU   0                                                        00747000
PRFRCB   EQU   IEDQPRF                                                  00748000
PRFKEY   EQU   PRFRCB                                                   00749000
PRFQCBA  EQU   PRFRCB+1                                                 00750000
PRFPRI   EQU   PRFRCB+4                                                 00751000
PRFLINK  EQU   PRFRCB+5                                                 00752000
PRFTIC   EQU   IEDQPRF+8                                                00753000
PRFTICC  EQU   PRFTIC                                                   00754000
PRFTI0   EQU   PRFTIC+1                                                 00755000
PRFNBUNT EQU   IEDQPRF+12                                               00756000
PRFSUNIT EQU   PRFNBUNT                                                 00757000
PRFPLQCB EQU   PRFSUNIT                                                 00758000
PRFPIUO  EQU   PRFPLQCB                                                 00759000
PRFLCB   EQU   IEDQPRF+13                                               00760000
@NM00154 EQU   IEDQPRF+16                                               00761000
PRFSVFFO EQU   @NM00154                                                 00762000
PRFSTAT1 EQU   IEDQPRF+20                                               00763000
PRFEOFN  EQU   PRFSTAT1                                                 00764000
PRFCORE  EQU   IEDQPRF+21                                               00765000
PRFXTRA  EQU   PRFCORE                                                  00766000
PRFSCAN  EQU   IEDQPRF+24                                               00767000
PRFTQBCK EQU   IEDQPRF+26                                               00768000
PRFNTXT  EQU   PRFTQBCK                                                 00769000
PRFEOBOF EQU   PRFNTXT                                                  00770000
PRFCHDR  EQU   IEDQPRF+32                                               00771000
PRFHQBCK EQU   IEDQPRF+35                                               00772000
IEDPF1   EQU   0                                                        00773000
PRF1FLG1 EQU   IEDPF1+3                                                 00774000
PRF1WD2  EQU   IEDPF1+4                                                 00775000
PRF1SEQP EQU   PRF1WD2                                                  00776000
PRF1SQID EQU   PRF1SEQP                                                 00777000
PRF1TAG1 EQU   PRF1SQID                                                 00778000
IEDPF2   EQU   0                                                        00779000
PRF2FLG2 EQU   IEDPF2                                                   00780000
PRF2WD2  EQU   IEDPF2+4                                                 00781000
IEDQQCB  EQU   0                                                        00782000
QCBDSFLG EQU   IEDQQCB                                                  00783000
QCBDISK  EQU   QCBDSFLG                                                 00784000
QCBELCHN EQU   IEDQQCB+1                                                00785000
QCBSTCHN EQU   IEDQQCB+9                                                00786000
QCBEOLDT EQU   IEDQQCB+16                                               00787000
QCBBYTE1 EQU   QCBEOLDT+1                                               00788000
QCBLKRLN EQU   IEDQQCB+18                                               00789000
QCBRETCT EQU   QCBLKRLN                                                 00790000
QCBSTAT  EQU   IEDQQCB+19                                               00791000
QCBINSRC EQU   IEDQQCB+21                                               00792000
@NM00164 EQU   QCBINSRC                                                 00793000
QCBTSOF2 EQU   @NM00164+1                                               00794000
QCBTSOF1 EQU   @NM00164+2                                               00795000
QCBINTVL EQU   IEDQQCB+24                                               00796000
QCBPREN  EQU   IEDQQCB+28                                               00797000
QCBLKRRN EQU   QCBPREN+1                                                00798000
QCBDCBAD EQU   IEDQQCB+33                                               00799000
QCBFLAG  EQU   IEDQQCB+36                                               00800000
QCBSDFFO EQU   QCBFLAG                                                  00801000
IEDQPQCB EQU   0                                                        00802000
QCBFHDLZ EQU   IEDQPQCB+3                                               00803000
QCBPFEFO EQU   QCBFHDLZ+1                                               00804000
QCBFHDTZ EQU   IEDQPQCB+6                                               00805000
QCBINTLF EQU   IEDQPQCB+12                                              00806000
IEDNQCB  EQU   0                                                        00807000
QCBSTAT1 EQU   IEDNQCB+4                                                00808000
QCBPLCBA EQU   IEDNQCB+5                                                00809000
IEDRH    EQU   0                                                        00810000
TRHBYTE0 EQU   IEDRH                                                    00811000
TRHTYPE  EQU   TRHBYTE0                                                 00812000
TRHBYTE1 EQU   IEDRH+1                                                  00813000
TRHBYTE2 EQU   IEDRH+2                                                  00814000
IEDQSCB  EQU   0                                                        00815000
SCBSTATE EQU   IEDQSCB                                                  00816000
SCBSEQIN EQU   SCBSTATE                                                 00817000
SCBRCVCT EQU   IEDQSCB+4                                                00818000
SCBMBHEN EQU   IEDQSCB+5                                                00819000
SCBBKFCT EQU   IEDQSCB+9                                                00820000
SCBEOBSZ EQU   SCBBKFCT+1                                               00821000
SCBSALEV EQU   IEDQSCB+12                                               00822000
SCBQTYPE EQU   SCBSALEV                                                 00823000
SCBERRST EQU   IEDQSCB+16                                               00824000
SCBERR1  EQU   SCBERRST                                                 00825000
SCBHDRRN EQU   SCBERR1                                                  00826000
SCBORIGN EQU   SCBERR1                                                  00827000
SCBNOTRM EQU   SCBERR1                                                  00828000
SCBSEQHN EQU   SCBERR1                                                  00829000
SCBSEQLN EQU   SCBERR1                                                  00830000
SCBCUTFN EQU   SCBERR1                                                  00831000
SCBERR2  EQU   SCBERRST+1                                               00832000
SCBABRTN EQU   SCBERR2                                                  00833000
SCBERR3  EQU   SCBERRST+2                                               00834000
SCBLOSTN EQU   SCBERR3                                                  00835000
SCBTMIDN EQU   SCBERR3                                                  00836000
SCBFORMN EQU   SCBERR3                                                  00837000
SCBATTN  EQU   SCBERR3                                                  00838000
SCBXCEPN EQU   SCBERR3                                                  00839000
SCBERR4  EQU   SCBERRST+3                                               00840000
SCBTXTTN EQU   SCBERR4                                                  00841000
SCBCTLUN EQU   SCBERR4                                                  00842000
SCBCHANN EQU   SCBERR4                                                  00843000
SCBDLPTR EQU   IEDQSCB+22                                               00844000
SCBEOBAC EQU   SCBDLPTR                                                 00845000
SCBCTBAC EQU   SCBEOBAC                                                 00846000
SCBBSCFM EQU   IEDQSCB+24                                               00847000
SCBDATEN EQU   SCBBSCFM                                                 00848000
SCBITBSZ EQU   IEDQSCB+40                                               00849000
SCBCTBSV EQU   SCBITBSZ                                                 00850000
SCBDNSEG EQU   IEDQSCB+41                                               00851000
SCBCLSEG EQU   IEDQSCB+45                                               00852000
SCBITBAC EQU   IEDQSCB+48                                               00853000
SCBCTBFL EQU   SCBITBAC                                                 00854000
SCBBLKCT EQU   SCBCTBFL                                                 00855000
SCBDCSEG EQU   IEDQSCB+49                                               00856000
SCBSTAT1 EQU   IEDQSCB+60                                               00857000
SCBCORE  EQU   IEDQSCB+61                                               00858000
SCBSCAN  EQU   IEDQSCB+64                                               00859000
SCBNTXT  EQU   IEDQSCB+66                                               00860000
SCBCHDR  EQU   IEDQSCB+72                                               00861000
SCBCCSEG EQU   IEDQSCB+75                                               00862000
SCBEND   EQU   IEDQSCB+84                                               00863000
IEDTH    EQU   0                                                        00864000
TTHBYTE0 EQU   IEDTH                                                    00865000
TTHDAF   EQU   IEDTH+2                                                  00866000
TTHOAF   EQU   IEDTH+4                                                  00867000
TTHSNF   EQU   IEDTH+6                                                  00868000
TTHTAG   EQU   TTHSNF                                                   00869000
TTHTAG1  EQU   TTHTAG                                                   00870000
TTHTAG2  EQU   TTHTAG+1                                                 00871000
TTHDCF   EQU   IEDTH+8                                                  00872000
IEDTRM   EQU   0                                                        00873000
IEDNTRM  EQU   IEDTRM                                                   00874000
TRMBYTE4 EQU   IEDNTRM                                                  00875000
TRMBYTE3 EQU   IEDNTRM+1                                                00876000
TRMBYTE2 EQU   IEDNTRM+2                                                00877000
TRMINPG  EQU   TRMBYTE2                                                 00878000
TRMBYTE1 EQU   IEDNTRM+3                                                00879000
TRMSCPRQ EQU   TRMBYTE1                                                 00880000
TRMBYTE0 EQU   IEDNTRM+6                                                00881000
TRMSIBPT EQU   IEDNTRM+7                                                00882000
IEDQTRM  EQU   IEDTRM+14                                                00883000
TRMSTATE EQU   IEDQTRM                                                  00884000
TRMLOG   EQU   TRMSTATE                                                 00885000
TRMDESTQ EQU   IEDQTRM+1                                                00886000
TRMINSEQ EQU   IEDQTRM+4                                                00887000
TLISTCNT EQU   TRMINSEQ                                                 00888000
TRMOUTSQ EQU   IEDQTRM+6                                                00889000
TLISTEN  EQU   TRMOUTSQ                                                 00890000
TRMDSORG EQU   TLISTEN                                                  00891000
TRMALTD  EQU   IEDQTRM+8                                                00892000
TRMDEVFL EQU   IEDQTRM+10                                               00893000
TRMSTAT  EQU   IEDQTRM+12                                               00894000
IEDQTNT  EQU   0                                                        00895000
BDQCB    EQU   0                                                        00896000
PIU      EQU   0                                                        00897000
DSPCHAIN EQU   12                                                       00898000
DSPLIFO  EQU   56                                                       00899000
DSPLIFOR EQU   60                                                       00900000
DSPLIST  EQU   8                                                        00901000
DSPPRIO  EQU   48                                                       00902000
DSPPRIOR EQU   52                                                       00903000
DSPTRACE EQU   64                                                       00904000
DSPTSTQ  EQU   32                                                       00905000
DSPTSTQR EQU   36                                                       00906000
DSPUNAV  EQU   40                                                       00907000
DSPUNAVR EQU   44                                                       00908000
DSPWAIT  EQU   16                                                       00909000
IEDXFMI  EQU   0                                                        00910000
QCBLDCB  EQU   0                                                        00911000
LCBRSPIN EQU   LCBIOBSN                                                 00912000
LCBLUSNS EQU   LCBRSPIN+5                                               00913000
LCBSCPRS EQU   LCBRSPIN+9                                               00914000
LCBCSWU1 EQU   LCBSCPRS+2                                               00915000
LCBRSPFG EQU   LCBRSPIN+15                                              00916000
LCBCOREQ EQU   LCBTPCD                                                  00917000
@NM00134 EQU   LCBCPA+40                                                00918000
LCBQNX   EQU   LCBERCCW                                                 00919000
LCBQNXMN EQU   LCBQNX                                                   00920000
LCBCANCL EQU   LCBSAVSN                                                 00921000
LCBCANFG EQU   LCBCANCL                                                 00922000
IEDQSPTR EQU   LCBSCBA                                                  00923000
TRMPRE1  EQU   TRMBYTE4                                                 00924000
TRMNCP1  EQU   TRMBYTE4                                                 00925000
TRMPRE   EQU   TRMBYTE3                                                 00926000
TRMASNXI EQU   TRMPRE                                                   00927000
TRMNLOUT EQU   TRMPRE                                                   00928000
TRMNCP   EQU   TRMBYTE3                                                 00929000
TRMPU    EQU   TRMBYTE3                                                 00930000
TRMLU    EQU   TRMBYTE3                                                 00931000
TRMLINK  EQU   TRMBYTE3                                                 00932000
BDUTEXT  EQU   BDUEND                                                   00933000
PRFSHDR  EQU   IEDQPRF+42                                               00934000
SCBRGSAV EQU   SCBEND                                                   00935000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00936000
@NM00189 EQU   TRMLINK                                                  00937000
TRMLSTAT EQU   TRMLINK                                                  00938000
TRMLINT  EQU   TRMLINK                                                  00939000
TRMEPMOD EQU   TRMLINK                                                  00940000
TRMLULOG EQU   TRMLU                                                    00941000
TRMINERR EQU   TRMLU                                                    00942000
TRMLUREQ EQU   TRMLU                                                    00943000
TRMSESRQ EQU   TRMLU                                                    00944000
TRMTDIFF EQU   TRMLU                                                    00945000
TRMLUTM  EQU   TRMLU                                                    00946000
TRMLUIT  EQU   TRMLU                                                    00947000
TRMAUTO  EQU   TRMLU                                                    00948000
TRMPCONT EQU   TRMPU                                                    00949000
@NM00188 EQU   TRMPU                                                    00950000
TRMNCONT EQU   TRMNCP                                                   00951000
TRMQUCKN EQU   TRMNCP                                                   00952000
TRMSLOWN EQU   TRMNCP                                                   00953000
TRMSYGEN EQU   TRMNCP                                                   00954000
TRMNCPCL EQU   TRMNCP                                                   00955000
TRMIPLDM EQU   TRMNCP                                                   00956000
TRMINOUT EQU   TRMPRE                                                   00957000
TRMRDOUT EQU   TRMPRE                                                   00958000
TRMWROUT EQU   TRMPRE                                                   00959000
TRMSTMM  EQU   TRMPRE                                                   00960000
TRMCMODE EQU   TRMPRE                                                   00961000
TRMSTPND EQU   TRMPRE                                                   00962000
@NM00187 EQU   TRMNCP1                                                  00963000
TRMINOP  EQU   TRMNCP1                                                  00964000
TRMLYNCH EQU   TRMPRE1                                                  00965000
TRMSPOUT EQU   TRMPRE1                                                  00966000
TRMERLCK EQU   TRMPRE1                                                  00967000
TRMQNPL  EQU   TRMPRE1                                                  00968000
TRMSPACT EQU   TRMPRE1                                                  00969000
TRMOCNI  EQU   TRMPRE1                                                  00970000
TRMSESSN EQU   TRMPRE1                                                  00971000
TRMCONT  EQU   TRMPRE1                                                  00972000
@NM00142 EQU   LCBCANCL+3                                               00973000
LCBCANTH EQU   LCBCANCL+1                                               00974000
@NM00141 EQU   LCBCANFG                                                 00975000
LCBCANCD EQU   LCBCANFG                                                 00976000
@NM00140 EQU   LCBCANFG                                                 00977000
LCBCANEB EQU   LCBCANFG                                                 00978000
LCBCANXT EQU   LCBCANFG                                                 00979000
LCBUNADD EQU   LCBQNX+21                                                00980000
LCBUASZE EQU   LCBQNX+20                                                00981000
LCBDSTEA EQU   LCBQNX+16                                                00982000
@NM00139 EQU   LCBQNX+8                                                 00983000
LCBIOSBS EQU   LCBQNX+5                                                 00984000
@NM00138 EQU   LCBQNX+4                                                 00985000
LCBSTSAV EQU   LCBQNX+1                                                 00986000
@NM00137 EQU   LCBQNXMN                                                 00987000
LCBNX509 EQU   LCBQNXMN                                                 00988000
LCBNX162 EQU   LCBQNXMN                                                 00989000
LCBNX142 EQU   LCBQNXMN                                                 00990000
LCBNX064 EQU   LCBQNXMN                                                 00991000
@NM00136 EQU   @NM00134+4                                               00992000
LCBNCPPT EQU   @NM00134+1                                               00993000
@NM00135 EQU   @NM00134                                                 00994000
LCBWRSCH EQU   LCBCOREQ+8                                               00995000
LCBCQLNK EQU   LCBCOREQ+4                                               00996000
LCBCQELE EQU   LCBCOREQ                                                 00997000
LCBPAKCH EQU   LCBRSPIN+16                                              00998000
@NM00133 EQU   LCBRSPFG                                                 00999000
LCBRSRH  EQU   LCBRSPFG                                                 01000000
LCBEXPI  EQU   LCBRSPFG                                                 01001000
@NM00132 EQU   LCBRSPIN+12                                              01002000
LCBUSUE1 EQU   LCBCSWU1                                                 01003000
@NM00131 EQU   LCBCSWU1                                                 01004000
@NM00130 EQU   LCBSCPRS+1                                               01005000
LCBDFCMD EQU   LCBSCPRS                                                 01006000
LCBUSER  EQU   LCBLUSNS+2                                               01007000
LCBSMIN  EQU   LCBLUSNS+1                                               01008000
LCBSMAJ  EQU   LCBLUSNS                                                 01009000
LCBRHSV  EQU   LCBRSPIN+2                                               01010000
LCBSNS0  EQU   LCBRSPIN+1                                               01011000
@NM00129 EQU   LCBRSPIN                                                 01012000
TRMOPT   EQU   IEDTRM+34                                                01013000
TRMOPTBL EQU   IEDQTRM+18                                               01014000
TRMOPNO  EQU   IEDQTRM+17                                               01015000
TRMCHCIN EQU   IEDQTRM+16                                               01016000
TRMSENSE EQU   TRMSTAT+3                                                01017000
TRMTEMPR EQU   TRMSTAT+2                                                01018000
TRMSIO   EQU   TRMSTAT                                                  01019000
@NM00186 EQU   TRMDEVFL+1                                               01020000
TRMTPIN  EQU   TRMDEVFL+1                                               01021000
TRMNCPI  EQU   TRMDEVFL+1                                               01022000
TRMRNTRM EQU   TRMDEVFL+1                                               01023000
@NM00185 EQU   TRMDEVFL+1                                               01024000
TRMLMD   EQU   TRMDEVFL+1                                               01025000
TRMCONC  EQU   TRMDEVFL+1                                               01026000
TRMTSOB  EQU   TRMDEVFL                                                 01027000
TRMBFDY  EQU   TRMDEVFL                                                 01028000
TRMTBLK  EQU   TRMDEVFL                                                 01029000
TRMSBLK  EQU   TRMDEVFL                                                 01030000
TRMBLKS  EQU   TRMDEVFL                                                 01031000
TRMADDC  EQU   TRMDEVFL                                                 01032000
TRMDDIG  EQU   TRMDEVFL                                                 01033000
TRMBUFS  EQU   TRMDEVFL                                                 01034000
TRMPRILK EQU   TRMALTD                                                  01035000
TRMLGB   EQU   TRMDSORG                                                 01036000
TRMUTERM EQU   TLISTCNT                                                 01037000
TRMSCNYN EQU   TRMSTATE                                                 01038000
TRMOPTFN EQU   TRMSTATE                                                 01039000
TRMHELDN EQU   TRMSTATE                                                 01040000
TRMACPTN EQU   TRMSTATE                                                 01041000
TRMPREF  EQU   TRMSTATE                                                 01042000
TRMPROC  EQU   TRMLOG                                                   01043000
TRMLIST  EQU   TRMLOG                                                   01044000
TRMLINE  EQU   TRMSTATE                                                 01045000
TRMSUBST EQU   IEDNTRM+12                                               01046000
TRMTYPE  EQU   IEDNTRM+11                                               01047000
TRMRLMCT EQU   IEDNTRM+10                                               01048000
TRMCOHTG EQU   TRMSIBPT+1                                               01049000
TRMGPCNT EQU   TRMSIBPT                                                 01050000
TRMBUFRD EQU   TRMBYTE0                                                 01051000
TRMSNA   EQU   TRMBYTE0                                                 01052000
TRMGP    EQU   TRMBYTE0                                                 01053000
TRMDIAL  EQU   TRMBYTE0                                                 01054000
@NM00184 EQU   TRMBYTE0                                                 01055000
TRMOUTPT EQU   TRMBYTE0                                                 01056000
TRMINPUT EQU   TRMBYTE0                                                 01057000
TRMUDEF  EQU   TRMBYTE0                                                 01058000
TRMCOHRT EQU   IEDNTRM+4                                                01059000
TRMSTOTE EQU   TRMBYTE1                                                 01060000
TRMCKPRN EQU   TRMBYTE1                                                 01061000
TRMTSATN EQU   TRMBYTE1                                                 01062000
TRMTRACE EQU   TRMBYTE1                                                 01063000
TRMSWBCK EQU   TRMBYTE1                                                 01064000
TRMAUTOC EQU   TRMBYTE1                                                 01065000
TRMINPTP EQU   TRMBYTE1                                                 01066000
TRMWTNEG EQU   TRMSCPRQ                                                 01067000
TRMWRBRK EQU   TRMBYTE2                                                 01068000
TRMNOSND EQU   TRMBYTE2                                                 01069000
TRMPREP  EQU   TRMBYTE2                                                 01070000
TRMGPACT EQU   TRMBYTE2                                                 01071000
TRMANDL  EQU   TRMBYTE2                                                 01072000
TRMCLOSN EQU   TRMINPG                                                  01073000
TRMREMB  EQU   TRMBYTE2                                                 01074000
TRMRSACT EQU   TRMBYTE2                                                 01075000
@NM00183 EQU   TTHTAG1                                                  01076000
TTHTAGS  EQU   TTHTAG1                                                  01077000
TTHBYTE1 EQU   IEDTH+1                                                  01078000
TTHEFI   EQU   TTHBYTE0                                                 01079000
@NM00182 EQU   TTHBYTE0                                                 01080000
TTHEBIU  EQU   TTHBYTE0                                                 01081000
TTHBBIU  EQU   TTHBYTE0                                                 01082000
TTHFTYPE EQU   TTHBYTE0                                                 01083000
SCBTRANS EQU   IEDQSCB+81                                               01084000
SCBUNTCT EQU   IEDQSCB+80                                               01085000
SCBEOB   EQU   IEDQSCB+78                                               01086000
SCBNXCPB EQU   SCBCCSEG                                                 01087000
SCBNHDR  EQU   SCBCHDR                                                  01088000
SCBCRCD  EQU   IEDQSCB+69                                               01089000
SCBTQBCK EQU   SCBNTXT                                                  01090000
SCBOSEQ  EQU   SCBSCAN                                                  01091000
SCBXTRA  EQU   SCBCORE                                                  01092000
SCBNOPST EQU   SCBSTAT1                                                 01093000
SCBNIDLE EQU   SCBSTAT1                                                 01094000
SCBCEND  EQU   SCBSTAT1                                                 01095000
SCBCBGN  EQU   SCBSTAT1                                                 01096000
SCBSIZE  EQU   IEDQSCB+58                                               01097000
SCBSRCE  EQU   IEDQSCB+56                                               01098000
SCBDEOB  EQU   IEDQSCB+52                                               01099000
SCBFEFO  EQU   SCBDCSEG                                                 01100000
SCBCTBND EQU   SCBBLKCT                                                 01101000
SCBSCHDR EQU   SCBCLSEG                                                 01102000
SCBHBFNO EQU   IEDQSCB+44                                               01103000
SCBSCSEG EQU   SCBDNSEG                                                 01104000
SCBBCTR  EQU   SCBCTBSV                                                 01105000
SCBCCHDR EQU   IEDQSCB+37                                               01106000
SCBDESTL EQU   IEDQSCB+36                                               01107000
SCBDCHDR EQU   IEDQSCB+33                                               01108000
SCBCPBNO EQU   IEDQSCB+32                                               01109000
SCBMBSSA EQU   IEDQSCB+25                                               01110000
SCBMLMTN EQU   SCBBSCFM                                                 01111000
SCBNOEOT EQU   SCBBSCFM                                                 01112000
@NM00181 EQU   SCBBSCFM                                                 01113000
SCBNPDTR EQU   SCBDATEN                                                 01114000
SCBCNTEN EQU   SCBBSCFM                                                 01115000
SCBRCVTX EQU   SCBBSCFM                                                 01116000
SCBNONTR EQU   SCBBSCFM                                                 01117000
SCBTRNSP EQU   SCBBSCFM                                                 01118000
SCBENDCR EQU   SCBCTBAC+1                                               01119000
SCBCRLEN EQU   SCBCTBAC                                                 01120000
SCBMRFSD EQU   IEDQSCB+20                                               01121000
SCBUNDFN EQU   SCBERR4                                                  01122000
SCBSTERN EQU   SCBCHANN                                                 01123000
SCBCPMEN EQU   SCBCTLUN                                                 01124000
@NM00180 EQU   SCBERR4                                                  01125000
SCBTRMLN EQU   SCBERR4                                                  01126000
SCBCONNN EQU   SCBERR4                                                  01127000
SCBAPERR EQU   SCBTXTTN                                                 01128000
SCBSLCTN EQU   SCBERR4                                                  01129000
SCBPERRN EQU   SCBXCEPN                                                 01130000
SCBTHRSN EQU   SCBATTN                                                  01131000
SCBFIERN EQU   SCBFORMN                                                 01132000
SCBUSERN EQU   SCBERR3                                                  01133000
SCBSATTN EQU   SCBERR3                                                  01134000
SCBTMINN EQU   SCBERR3                                                  01135000
SCBXPD   EQU   SCBTMIDN                                                 01136000
SCBXPI   EQU   SCBLOSTN                                                 01137000
SCBSOHE  EQU   SCBERR2                                                  01138000
SCBFRWDN EQU   SCBERR2                                                  01139000
SCBRRJN  EQU   SCBABRTN                                                 01140000
SCBOLTR  EQU   SCBERR2                                                  01141000
SCBALN   EQU   SCBERR2                                                  01142000
SCBCODER EQU   SCBERR2                                                  01143000
SCBCRMAX EQU   SCBERR2                                                  01144000
SCBCRMIN EQU   SCBERR2                                                  01145000
SCBRVISL EQU   SCBCUTFN                                                 01146000
SCBNOBFN EQU   SCBERR1                                                  01147000
@NM00179 EQU   SCBERR1                                                  01148000
SCBNOVAC EQU   SCBSEQLN                                                 01149000
SCBNOTSO EQU   SCBSEQHN                                                 01150000
SCBRVITX EQU   SCBNOTRM                                                 01151000
SCBHANG  EQU   SCBORIGN                                                 01152000
SCBNOLOG EQU   SCBHDRRN                                                 01153000
SCBMRFPL EQU   IEDQSCB+13                                               01154000
SCBBFMM  EQU   SCBQTYPE                                                 01155000
SCBBBFTM EQU   SCBQTYPE                                                 01156000
SCBNOFF  EQU   SCBQTYPE                                                 01157000
SCBCONC  EQU   SCBQTYPE                                                 01158000
SCBNREUS EQU   SCBQTYPE                                                 01159000
SCBREUS  EQU   SCBQTYPE                                                 01160000
SCBCOREQ EQU   SCBQTYPE                                                 01161000
SCBNORCL EQU   SCBQTYPE                                                 01162000
SCBCTBSZ EQU   SCBEOBSZ                                                 01163000
@NM00178 EQU   SCBBKFCT                                                 01164000
SCBPRI   EQU   IEDQSCB+8                                                01165000
SCBMACR  EQU   SCBMBHEN                                                 01166000
SCBSNDCT EQU   SCBRCVCT                                                 01167000
SCBDESTQ EQU   IEDQSCB+1                                                01168000
SCBCODE  EQU   SCBSTATE                                                 01169000
SCBPRER  EQU   SCBSTATE                                                 01170000
SCBCKPT  EQU   SCBSTATE                                                 01171000
SCBMSGLN EQU   SCBSTATE                                                 01172000
SCBERSDS EQU   SCBSTATE                                                 01173000
SCBLCK1N EQU   SCBSTATE                                                 01174000
SCBMGFMN EQU   SCBSEQIN                                                 01175000
SCBTRANP EQU   SCBSTATE                                                 01176000
@NM00177 EQU   TRHBYTE2                                                 01177000
@NM00176 EQU   TRHBYTE2                                                 01178000
@NM00175 EQU   TRHBYTE2                                                 01179000
TRHCSI   EQU   TRHBYTE2                                                 01180000
@NM00174 EQU   TRHBYTE2                                                 01181000
TRHCDI   EQU   TRHBYTE2                                                 01182000
TRHEB    EQU   TRHBYTE2                                                 01183000
TRHBB    EQU   TRHBYTE2                                                 01184000
TRHPI    EQU   TRHBYTE1                                                 01185000
@NM00173 EQU   TRHBYTE1                                                 01186000
@NM00172 EQU   TRHBYTE1                                                 01187000
@NM00171 EQU   TRHBYTE1                                                 01188000
TRHER    EQU   TRHBYTE1                                                 01189000
TRHDR2   EQU   TRHBYTE1                                                 01190000
@NM00170 EQU   TRHBYTE1                                                 01191000
TRHDR1   EQU   TRHBYTE1                                                 01192000
TRHEC    EQU   TRHBYTE0                                                 01193000
TRHBC    EQU   TRHBYTE0                                                 01194000
TRHSDI   EQU   TRHBYTE0                                                 01195000
TRHFI    EQU   TRHBYTE0                                                 01196000
@NM00169 EQU   TRHBYTE0                                                 01197000
TRHRUCAT EQU   TRHBYTE0                                                 01198000
QCBTTCIN EQU   QCBPLCBA+1                                               01199000
@NM00168 EQU   QCBPLCBA                                                 01200000
@NM00167 EQU   QCBSTAT1                                                 01201000
QCBFLUSH EQU   QCBSTAT1                                                 01202000
QCBNDXRQ EQU   QCBSTAT1                                                 01203000
QCBESIG  EQU   QCBSTAT1                                                 01204000
QCBRCVRQ EQU   QCBSTAT1                                                 01205000
QCBSNDRQ EQU   QCBSTAT1                                                 01206000
QCBWAITC EQU   QCBSTAT1                                                 01207000
QCBPLCBN EQU   QCBSTAT1                                                 01208000
QCBCHAIN EQU   IEDNQCB                                                  01209000
QCBPQBCK EQU   IEDQPQCB+25                                              01210000
QCBPRIPQ EQU   IEDQPQCB+24                                              01211000
QCBCFHDR EQU   IEDQPQCB+21                                              01212000
QCBLFEFO EQU   IEDQPQCB+18                                              01213000
QCBFFEFO EQU   IEDQPQCB+15                                              01214000
QCBPREVF EQU   QCBINTLF                                                 01215000
QCBINTFF EQU   IEDQPQCB+9                                               01216000
QCBDATSQ EQU   QCBFHDTZ+1                                               01217000
@NM00166 EQU   QCBFHDTZ                                                 01218000
@NM00165 EQU   QCBPFEFO                                                 01219000
QCBDATFL EQU   QCBFHDLZ                                                 01220000
QCBDNHDR EQU   IEDQPQCB                                                 01221000
QCBQBACK EQU   IEDQQCB+37                                               01222000
QCBCKPT  EQU   QCBFLAG                                                  01223000
QCBPROC  EQU   QCBFLAG                                                  01224000
QCBTERMQ EQU   QCBFLAG                                                  01225000
QCBRSRV  EQU   QCBFLAG                                                  01226000
QCBREAD  EQU   QCBFLAG                                                  01227000
QCBNOBRK EQU   QCBFLAG                                                  01228000
QCBTSSES EQU   QCBFLAG                                                  01229000
QCBLGBAD EQU   QCBDCBAD                                                 01230000
QCBRELLN EQU   IEDQQCB+32                                               01231000
QCBTJID  EQU   QCBLKRRN+1                                               01232000
QCBCARCT EQU   QCBLKRRN                                                 01233000
QCBPRLVL EQU   QCBPREN                                                  01234000
QCBMSGCT EQU   IEDQQCB+26                                               01235000
QCBEXTO  EQU   QCBINTVL                                                 01236000
QCBDISC  EQU   QCBTSOF1                                                 01237000
QCBDELAY EQU   QCBTSOF1                                                 01238000
QCBPARTO EQU   QCBTSOF1                                                 01239000
QCBSATRD EQU   QCBTSOF1                                                 01240000
QCBNOBUF EQU   QCBTSOF1                                                 01241000
QCBTPUT  EQU   QCBTSOF1                                                 01242000
QCBTGET  EQU   QCBTSOF1                                                 01243000
QCBWRBRK EQU   QCBTSOF1                                                 01244000
QCBSATLC EQU   QCBTSOF2                                                 01245000
QCBSATTI EQU   QCBTSOF2                                                 01246000
QCBSATCH EQU   QCBTSOF2                                                 01247000
QCBSIMRD EQU   QCBTSOF2                                                 01248000
QCBDSSMI EQU   QCBTSOF2                                                 01249000
QCBPOSTO EQU   QCBTSOF2                                                 01250000
QCBBUFQ  EQU   QCBTSOF2                                                 01251000
QCBINHBN EQU   QCBTSOF2                                                 01252000
QCBSATCT EQU   @NM00164                                                 01253000
QCBSCBOF EQU   IEDQQCB+20                                               01254000
QCBTIME  EQU   QCBSTAT                                                  01255000
QCBCLOCK EQU   QCBSTAT                                                  01256000
QCBSCHDL EQU   QCBSTAT                                                  01257000
QCBSMODE EQU   QCBSTAT                                                  01258000
QCBSEND  EQU   QCBSTAT                                                  01259000
QCBBUFRD EQU   QCBSTAT                                                  01260000
QCBTRMHO EQU   QCBSTAT                                                  01261000
QCBEOM   EQU   QCBSTAT                                                  01262000
QCBHUCT  EQU   QCBRETCT                                                 01263000
QCBIEND  EQU   QCBRETCT                                                 01264000
QCBEND   EQU   QCBRETCT                                                 01265000
QCBNL    EQU   QCBRETCT                                                 01266000
QCBLOGCT EQU   QCBRETCT                                                 01267000
@NM00163 EQU   QCBBYTE1                                                 01268000
QCBRITRM EQU   QCBBYTE1                                                 01269000
@NM00162 EQU   QCBEOLDT                                                 01270000
QCBSLINK EQU   IEDQQCB+13                                               01271000
QCBSTPRI EQU   IEDQQCB+12                                               01272000
QCBSTVTO EQU   IEDQQCB+8                                                01273000
QCBLINK  EQU   IEDQQCB+5                                                01274000
QCBPRI   EQU   IEDQQCB+4                                                01275000
QCBCNTEN EQU   QCBELCHN+2                                               01276000
@NM00161 EQU   QCBELCHN+2                                               01277000
@NM00160 EQU   QCBELCHN                                                 01278000
QCBHELD  EQU   QCBDSFLG                                                 01279000
QCBFQCB  EQU   QCBDSFLG                                                 01280000
QCBDRQQ  EQU   QCBDSFLG                                                 01281000
QCBALTMH EQU   QCBDSFLG                                                 01282000
QCBREUS  EQU   QCBDISK                                                  01283000
QCBNREUS EQU   QCBDISK                                                  01284000
QCBCORE  EQU   QCBDSFLG                                                 01285000
QCBTSQ   EQU   QCBDSFLG                                                 01286000
PRF2SEQP EQU   PRF2WD2                                                  01287000
@NM00159 EQU   IEDPF2+1                                                 01288000
@NM00158 EQU   PRF2FLG2                                                 01289000
PRF2TERM EQU   PRF2FLG2                                                 01290000
PRF2SMI  EQU   PRF2FLG2                                                 01291000
PRF2FORM EQU   PRF2FLG2                                                 01292000
PRF2TNTI EQU   PRF2FLG2                                                 01293000
PRF1RULN EQU   PRF1SEQP+2                                               01294000
PRF1TAG2 EQU   PRF1SQID+1                                               01295000
@NM00157 EQU   PRF1TAG1                                                 01296000
PRF1TAGS EQU   PRF1TAG1                                                 01297000
@NM00156 EQU   PRF1FLG1                                                 01298000
PRF1LOGD EQU   PRF1FLG1                                                 01299000
PRF1USS  EQU   PRF1FLG1                                                 01300000
PRF1FORM EQU   PRF1FLG1                                                 01301000
PRF1EXPI EQU   PRF1FLG1                                                 01302000
PRF1FIDI EQU   PRF1FLG1                                                 01303000
PRF1RH   EQU   IEDPF1                                                   01304000
PRFDEST  EQU   IEDQPRF+40                                               01305000
PRFISEQ  EQU   IEDQPRF+38                                               01306000
PRFSTXT  EQU   PRFHQBCK                                                 01307000
PRFNHDR  EQU   PRFCHDR                                                  01308000
PRFCRCD  EQU   IEDQPRF+29                                               01309000
PRFSVSEQ EQU   PRFNTXT+1                                                01310000
PRFSVPRI EQU   PRFEOBOF                                                 01311000
PRFISIZE EQU   PRFSCAN+1                                                01312000
@NM00155 EQU   PRFSCAN                                                  01313000
PRFEOB   EQU   PRFXTRA+1                                                01314000
PRFSTSO  EQU   PRFXTRA                                                  01315000
PRFNHDRN EQU   PRFSTAT1                                                 01316000
PRFNLSTN EQU   PRFSTAT1                                                 01317000
PRFLOCK  EQU   PRFEOFN                                                  01318000
PRFDUPLN EQU   PRFSTAT1                                                 01319000
PRFTSMSG EQU   PRFSTAT1                                                 01320000
PRFITCPN EQU   PRFSTAT1                                                 01321000
PRFERMGN EQU   PRFSTAT1                                                 01322000
PRFCNCLN EQU   PRFSTAT1                                                 01323000
PRFSVFLG EQU   @NM00154+3                                               01324000
PRFSIZE  EQU   PRFSVFFO+2                                               01325000
PRFSRCE  EQU   PRFSVFFO                                                 01326000
@NM00153 EQU   PRFTICC                                                  01327000
@NM00152 EQU   PRFTICC                                                  01328000
@NM00151 EQU   PRFTICC                                                  01329000
PRFTICON EQU   PRFTICC                                                  01330000
@NM00150 EQU   PRFTICC                                                  01331000
@NM00149 EQU   PRFTICC                                                  01332000
PRFBFMM  EQU   PRFTICC                                                  01333000
PRFEOMSG EQU   PRFTICC                                                  01334000
PRFCOUNT EQU   PRFLINK+1                                                01335000
@NM00148 EQU   PRFLINK                                                  01336000
PRFFLAGS EQU   PRFPRI                                                   01337000
PRFIOADR EQU   PRFQCBA                                                  01338000
PRFOPCDE EQU   PRFKEY                                                   01339000
LCBERADR EQU   LCBXRADR+1                                               01340000
LCBPCIRC EQU   LCBXRADR                                                 01341000
LCBDCT3  EQU   LCBXDCT+2                                                01342000
LCBDCT2  EQU   LCBXDCT+1                                                01343000
LCBDCT1  EQU   LCBXDCT                                                  01344000
@NM00147 EQU   LCBXFLAG                                                 01345000
LCBERPND EQU   LCBXFLAG                                                 01346000
LCBSRCPF EQU   LCBXFLAG                                                 01347000
LCBGPCTV EQU   LCBXFLAG                                                 01348000
@NM00146 EQU   LCBXFLAG                                                 01349000
@NM00145 EQU   LCBXFLAG                                                 01350000
@NM00144 EQU   LCBXFLAG                                                 01351000
@NM00143 EQU   LCBXFLAG                                                 01352000
LCBCCW10 EQU   LCBCPA+72                                                01353000
LCBCCW9  EQU   LCBCPA+64                                                01354000
LCBCCW8  EQU   LCBCPA+56                                                01355000
LCBCCW7  EQU   LCBCPA+48                                                01356000
LCBCCW6  EQU   LCBCPA+40                                                01357000
LCBCP    EQU   LCBQEBPL+4                                               01358000
LCBIOSB  EQU   LCBQEBPL+1                                               01359000
LCBSIO   EQU   LCBQEBPL                                                 01360000
LCBCCW4  EQU   LCBCPA+24                                                01361000
LCBCCW3  EQU   LCBCPA+16                                                01362000
LCBCCW2  EQU   LCBCPA+8                                                 01363000
LCBCCW1  EQU   LCBCPA                                                   01364000
@NM00128 EQU   LCBERCCW+16                                              01365000
LCBATL05 EQU   LCBERCCW+8                                               01366000
@NM00127 EQU   LCBERCCW                                                 01367000
LCBCSWSV EQU   LCBSAVSN+1                                               01368000
LCBSNSV  EQU   LCBSAVSN                                                 01369000
LCBBFSNS EQU   LCBRSPSV                                                 01370000
LCBWAITC EQU   LCBTPCD+5                                                01371000
LCBINPAK EQU   LCBSTAT6                                                 01372000
LCBMHBID EQU   LCBSTAT6                                                 01373000
LCBRTRRO EQU   LCBSTAT6                                                 01374000
LCBHDRPD EQU   LCBSTAT6                                                 01375000
LCBCHN   EQU   LCBSTAT6                                                 01376000
LCBBFRSV EQU   LCBTPCD+1                                                01377000
@NM00126 EQU   LCBSTAT5                                                 01378000
LCBLUS   EQU   LCBSTAT5                                                 01379000
LCBLUNIT EQU   LCBSTAT5                                                 01380000
LCBPERM  EQU   LCBSTAT5                                                 01381000
LCBNXCMD EQU   LCBBFRW                                                  01382000
LCBERMSK EQU   LCBOBRCH                                                 01383000
LCBOLT   EQU   LCBMSGFM                                                 01384000
LCBEOT   EQU   LCBMSGFM                                                 01385000
LCBENQ   EQU   LCBMSGFM                                                 01386000
LCBTTD   EQU   LCBMSGFM                                                 01387000
LCBRSTRT EQU   LCBMSGFM                                                 01388000
LCBVSTRT EQU   LCBMSGFM                                                 01389000
LCBACKI  EQU   LCBMSGFM                                                 01390000
LCBNAK   EQU   LCBMSGFM                                                 01391000
LCBTTCIN EQU   IEDQLCB+90                                               01392000
@NM00125 EQU   LCBRBCT2                                                 01393000
LCBDCNT  EQU   LCBRBCT2                                                 01394000
LCBRBCT1 EQU   LCBERBCT                                                 01395000
LCBERBCH EQU   IEDQLCB+85                                               01396000
LCBCOMPL EQU   LCBDLNKN                                                 01397000
LCBPRCPG EQU   LCBERBST                                                 01398000
LCBERROR EQU   LCBERBST                                                 01399000
@NM00124 EQU   LCBERBST                                                 01400000
LCBINQ   EQU   LCBERBST                                                 01401000
LCBRDERR EQU   LCBERBST                                                 01402000
LCBEOMSG EQU   LCBERBST                                                 01403000
LCBMSG   EQU   LCBERBST                                                 01404000
LCBERBLK EQU   IEDQLCB+81                                               01405000
LCBERBPY EQU   IEDQLCB+80                                               01406000
LCBERBKY EQU   LCBERB                                                   01407000
LCBRECAD EQU   IEDQLCB+73                                               01408000
@NM00123 EQU   LCBTSTSW                                                 01409000
@NM00122 EQU   LCBTSTSW                                                 01410000
@NM00121 EQU   LCBTSTSW                                                 01411000
@NM00120 EQU   LCBTSTSW                                                 01412000
@NM00119 EQU   LCBTSTSW                                                 01413000
@NM00118 EQU   LCBTSTSW                                                 01414000
@NM00117 EQU   LCBTSTSW                                                 01415000
LCBCONCT EQU   LCBTSTSW                                                 01416000
LCBBFRAV EQU   LCBDIAL                                                  01417000
LCBATTN  EQU   LCBSYNC                                                  01418000
LCBNEGRP EQU   LCBSTAT2                                                 01419000
LCBSNDPR EQU   LCBSTAT2                                                 01420000
LCBCONNN EQU   LCBBEOTN                                                 01421000
LCBTRACE EQU   LCBSTAT2                                                 01422000
LCBSENDN EQU   LCBSTAT1                                                 01423000
LCBRECVN EQU   LCBSTAT1                                                 01424000
LCBFREEN EQU   LCBSTAT1                                                 01425000
LCBCONT  EQU   LCBSTAT1                                                 01426000
LCBINITN EQU   LCBSTAT1                                                 01427000
LCBOCNI  EQU   LCBSTAT1                                                 01428000
LCBOCWTN EQU   LCBSTAT1                                                 01429000
LCBRECOF EQU   IEDQLCB+68                                               01430000
LCBRDBFR EQU   LCBRCBFR                                                 01431000
LCBUCBX  EQU   IEDQLCB+64                                               01432000
LCBTTBIN EQU   LCBERRCT                                                 01433000
@NM00116 EQU   LCBINCAM                                                 01434000
LCBGETMN EQU   LCBINCAM                                                 01435000
@NM00115 EQU   LCBRESTR+1                                               01436000
LCBCMDSV EQU   LCBRESTR                                                 01437000
LCBPCILK EQU   LCBDCBPT                                                 01438000
LCBSTART EQU   LCBIOBSN+16                                              01439000
LCBAP4OL EQU   LCBSIOCC                                                 01440000
LCBAP3OL EQU   LCBSIOCC                                                 01441000
LCBAP2OL EQU   LCBSIOCC                                                 01442000
LCBAP1OL EQU   LCBSIOCC                                                 01443000
LCBSIOC2 EQU   LCBSIOCC                                                 01444000
LCBSIOC1 EQU   LCBSIOCC                                                 01445000
@NM00114 EQU   LCBSIOCC                                                 01446000
LCBCSWRC EQU   LCBCSW+5                                                 01447000
LCBCSCHC EQU   LCBCSWCS                                                 01448000
LCBCSICC EQU   LCBCSWCS                                                 01449000
LCBCSCCC EQU   LCBCSWCS                                                 01450000
LCBCSCDC EQU   LCBCSWCS                                                 01451000
LCBCSPTC EQU   LCBCSWCS                                                 01452000
LCBCSPGC EQU   LCBCSWCS                                                 01453000
LCBCSIL  EQU   LCBCSWCS                                                 01454000
LCBCSPCI EQU   LCBCSWCS                                                 01455000
LCBUSUC  EQU   LCBCSWUS                                                 01456000
LCBUSDE  EQU   LCBCSWUS                                                 01457000
LCBUSCE  EQU   LCBCSWUS                                                 01458000
LCBUSBSY EQU   LCBCSWUS                                                 01459000
LCBUSCUE EQU   LCBCSWUS                                                 01460000
LCBUSSM  EQU   LCBCSWUS                                                 01461000
LCBUSAT  EQU   LCBCSWUS                                                 01462000
LCBCSWCA EQU   LCBCSW                                                   01463000
LCBOBR   EQU   LCBFLAG3                                                 01464000
LCBOBRRD EQU   LCBFLAG3                                                 01465000
LCBIOMSG EQU   LCBFLAG3                                                 01466000
LCBSOHC  EQU   LCBFLAG3                                                 01467000
LCBRLAD  EQU   LCBFLAG3                                                 01468000
LCBSOHR  EQU   LCBFLAG3                                                 01469000
@NM00113 EQU   LCBFLAG3                                                 01470000
LCBECBPT EQU   LCBIOBSN+4                                               01471000
LCBECBCC EQU   LCBIOBSN+3                                               01472000
LCBSENS1 EQU   LCBSNS+1                                                 01473000
LCBABORT EQU   LCBTMOUT                                                 01474000
LCBNOTIN EQU   LCBLOSDT                                                 01475000
LCBOVRUN EQU   LCBSENS0                                                 01476000
LCBDATCK EQU   LCBSENS0                                                 01477000
LCBEQUCK EQU   LCBSENS0                                                 01478000
LCBBUSCK EQU   LCBSENS0                                                 01479000
LCBINTRQ EQU   LCBSENS0                                                 01480000
LCBCMDRJ EQU   LCBSENS0                                                 01481000
LCBFLAG2 EQU   LCBIOBSN                                                 01482000
@NM00112 EQU   LCBFLAG1                                                 01483000
LCBUNREL EQU   LCBFLAG1                                                 01484000
LCBEXCPN EQU   LCBFLAG1                                                 01485000
@NM00111 EQU   LCBFLAG1                                                 01486000
LCBERPIN EQU   LCBFLAG1                                                 01487000
@NM00110 EQU   LCBFLAG1                                                 01488000
LCBFSBFR EQU   LCBMHA                                                   01489000
LCBISZE  EQU   IEDQLCB+28                                               01490000
LCBLNENT EQU   LCBSCBDA+1                                               01491000
@NM00109 EQU   LCBSCBDA                                                 01492000
LCBCPGMH EQU   LCBSTAT4                                                 01493000
LCBREAL  EQU   LCBPHASE                                                 01494000
@NM00108 EQU   LCBSTAT4                                                 01495000
LCBACTRQ EQU   LCBSTAT4                                                 01496000
LCBIPLRQ EQU   LCBSTAT4                                                 01497000
LCBDACRQ EQU   LCBSTAT4                                                 01498000
LCBDMPRQ EQU   LCBSTAT4                                                 01499000
@NM00107 EQU   LCBLKMDE                                                 01500000
LCBLOCKI EQU   LCBLKMDE                                                 01501000
LCBLOCKR EQU   LCBLKMDE                                                 01502000
LCBHMFLG EQU   LCBLKMDE                                                 01503000
LCBBDFLG EQU   LCBLKMDE                                                 01504000
@NM00106 EQU   LCBINSRC                                                 01505000
LCBCTLMD EQU   LCBTETEN                                                 01506000
LCBBFRSZ EQU   LCBCHAIN                                                 01507000
LCBUREQN EQU   LCBCHAIN                                                 01508000
LCBNORTY EQU   LCBCHAIN                                                 01509000
LCBERMSG EQU   LCBCHAIN                                                 01510000
LCBEXCP  EQU   LCBCHAIN                                                 01511000
LCBINVRQ EQU   LCBSCRNN                                                 01512000
LCB2741N EQU   LCBTSOB                                                  01513000
LCBINHBN EQU   LCBTSOB                                                  01514000
LCBCIRCD EQU   LCBTSOB                                                  01515000
LCBPREP  EQU   LCBTSOB                                                  01516000
LCBSOPL  EQU   LCBTSOB                                                  01517000
LCBSATRD EQU   LCBTSOB                                                  01518000
LCBTSBUF EQU   LCBTSOB                                                  01519000
LCBWRBRK EQU   LCBTSOB                                                  01520000
LCBTDL   EQU   IEDQLCB+18                                               01521000
LCBEOLTD EQU   IEDQLCB+16                                               01522000
LCBRSLNK EQU   IEDQLCB+13                                               01523000
LCBRSPRI EQU   IEDQLCB+12                                               01524000
LCBSTCBA EQU   IEDQLCB+9                                                01525000
LCBRSKEY EQU   IEDQLCB+8                                                01526000
LCBLINK  EQU   LCBRCB+5                                                 01527000
LCBKEY   EQU   LCBRCB                                                   01528000
BDUXGRPH EQU   BDUEXRSP                                                 01529000
BDUXFINL EQU   BDUEXRSP                                                 01530000
BDUXINIT EQU   BDUEXRSP                                                 01531000
BDUXERLK EQU   BDUBDUFG                                                 01532000
BDUALTAK EQU   BDUFNFLG                                                 01533000
BDUNEGAK EQU   BDUFNFLG                                                 01534000
BDUPOSAK EQU   BDUFNFLG                                                 01535000
BDUTPTX  EQU   BDUFNFLG                                                 01536000
BDUFRSTB EQU   BDUFNFLG                                                 01537000
BDULEADG EQU   BDUFNFLG                                                 01538000
BDUHEADR EQU   BDUFNFLG                                                 01539000
BDUSTHDR EQU   BDUFNFLG                                                 01540000
SAVTLLCB EQU   IEDNSVTD+316                                             01541000
SAVTBITN EQU   IEDNSVTD+312                                             01542000
@NM00105 EQU   SAVTCKQB+8                                               01543000
@NM00104 EQU   SAVTCKEC+1                                               01544000
@NM00103 EQU   SAVTCKCC                                                 01545000
SAVTCKPO EQU   SAVTCKCC                                                 01546000
SAVTCKWA EQU   SAVTCKCC                                                 01547000
SAVTCKCH EQU   SAVTCKTB+1                                               01548000
SAVTCKVT EQU   SAVTCKTB                                                 01549000
@NM00102 EQU   IEDNSVTD+297                                             01550000
SAVTRDFG EQU   SAVTRDRV+12                                              01551000
@NM00101 EQU   SAVTRDRV+5                                               01552000
SAVTRDPY EQU   SAVTRDRV+4                                               01553000
SAVTRDQB EQU   SAVTRDRV+1                                               01554000
SAVTRDKY EQU   SAVTRDRV                                                 01555000
SAVTNID  EQU   IEDNSVTD+280                                             01556000
SAVTDVAS EQU   IEDNSVTD+276                                             01557000
SAVTPLSZ EQU   IEDNSVTD+274                                             01558000
@NM00100 EQU   IEDNSVTD+273                                             01559000
SAVTSUBL EQU   IEDNSVTD+272                                             01560000
@NM00099 EQU   SAVTZELM+1                                               01561000
SAVTSUBM EQU   SAVTZELM                                                 01562000
SAVTMHDX EQU   IEDNSVTD+268                                             01563000
SAVTNAT1 EQU   IEDNSVTD+266                                             01564000
SAVTSH20 EQU   IEDNSVTD+264                                             01565000
SAVTLCBS EQU   IEDNSVTD+260                                             01566000
SAVTRNMP EQU   IEDNSVTD+256                                             01567000
SAVTTNTX EQU   IEDNSVTD+252                                             01568000
SAVTNAX  EQU   IEDNSVTD+248                                             01569000
SAVTSUBV EQU   IEDNSVTD+247                                             01570000
SAVTSUBA EQU   IEDNSVTD+246                                             01571000
SAVTSIBC EQU   IEDNSVTD+244                                             01572000
SAVTBSM  EQU   IEDNSVTD+240                                             01573000
SAVTSCPT EQU   SAVTTCPU                                                 01574000
SAVTRQTG EQU   IEDNSVTD+236                                             01575000
SAVTRQCH EQU   IEDNSVTD+232                                             01576000
SAVTMAND EQU   IEDNSVTD+228                                             01577000
SAVTSPLN EQU   IEDNSVTD+224                                             01578000
SAVTNADL EQU   IEDNSVTD+222                                             01579000
SAVTNATL EQU   IEDNSVTD+220                                             01580000
SAVTMHTB EQU   IEDNSVTD+216                                             01581000
SAVTSSMH EQU   IEDNSVTD+212                                             01582000
SAVTQRS  EQU   IEDNSVTD+208                                             01583000
SAVTRQIN EQU   IEDNSVTD+204                                             01584000
SAVTDFCO EQU   IEDNSVTD+200                                             01585000
SAVTSAO  EQU   IEDNSVTD+196                                             01586000
SAVTSARI EQU   IEDNSVTD+192                                             01587000
SAVTSAC  EQU   IEDNSVTD+188                                             01588000
SAVTCSCI EQU   IEDNSVTD+180                                             01589000
SAVTSSRP EQU   IEDNSVTD+176                                             01590000
SAVTSSRQ EQU   IEDNSVTD+172                                             01591000
SAVTSCLU EQU   IEDNSVTD+168                                             01592000
SAVTXTRQ EQU   IEDNSVTD+164                                             01593000
SAVTMVBF EQU   IEDNSVTD+160                                             01594000
@NM00098 EQU   IEDNSVTD+148                                             01595000
SAVTIPCQ EQU   IEDNSVTD+144                                             01596000
@NM00097 EQU   IEDNSVTD+136                                             01597000
@NM00096 EQU   IEDNSVTD+124                                             01598000
SAVTXFMO EQU   IEDNSVTD+120                                             01599000
@NM00095 EQU   IEDNSVTD+116                                             01600000
SAVTSSSR EQU   IEDNSVTD+112                                             01601000
SAVTSCPQ EQU   IEDNSVTD+108                                             01602000
SAVTSLCB EQU   IEDNSVTD+104                                             01603000
SAVTLUSR EQU   IEDNSVTD+100                                             01604000
@NM00094 EQU   SAVTLUSQ+8                                               01605000
SAVTLUSP EQU   SAVTLUSQ+4                                               01606000
SAVTLUSB EQU   SAVTLUSQ                                                 01607000
@NM00093 EQU   IEDNSVTD+84                                              01608000
SAVTSAT  EQU   IEDNSVTD+80                                              01609000
SAVTNAT  EQU   IEDNSVTD+76                                              01610000
SAVTCLUP EQU   IEDNSVTD+72                                              01611000
SAVTPIUT EQU   IEDNSVTD+68                                              01612000
SAVTRNTA EQU   IEDNSVTD+64                                              01613000
SAVTDNIR EQU   IEDNSVTD+60                                              01614000
SAVTFLDH EQU   IEDNSVTD+52                                              01615000
SAVTSRTN EQU   IEDNSVTD+48                                              01616000
SAVTSREQ EQU   IEDNSVTD+44                                              01617000
SAVTFAIL EQU   IEDNSVTD+42                                              01618000
SAVTSUSE EQU   IEDNSVTD+40                                              01619000
SAVTSIB  EQU   IEDNSVTD+36                                              01620000
SAVTPRTN EQU   IEDNSVTD+32                                              01621000
@NM00092 EQU   IEDNSVTD+28                                              01622000
SAVTWH20 EQU   IEDNSVTD+26                                              01623000
SAVTPWT  EQU   IEDNSVTD+24                                              01624000
SAVTPRTQ EQU   IEDNSVTD+20                                              01625000
SAVTPREQ EQU   IEDNSVTD+16                                              01626000
SAVTPH20 EQU   IEDNSVTD+14                                              01627000
SAVTPUSE EQU   IEDNSVTD+12                                              01628000
SAVTPLCB EQU   IEDNSVTD+8                                               01629000
SAVTPOOL EQU   IEDNSVTD+4                                               01630000
SAVTPRMT EQU   SAVTDIAF                                                 01631000
SAVTVIRT EQU   SAVTDIAF                                                 01632000
AVTCPBNO EQU   IEDQAVTD+1172                                            01633000
AVTHRESS EQU   IEDQAVTD+1171                                            01634000
@NM00091 EQU   IEDQAVTD+1170                                            01635000
@NM00090 EQU   IEDQAVTD+1169                                            01636000
@NM00089 EQU   IEDQAVTD+1168                                            01637000
@NM00088 EQU   IEDQAVTD+1165                                            01638000
@NM00087 EQU   IEDQAVTD+1164                                            01639000
AVTHRESE EQU   @NM00086                                                 01640000
AVTRADDR EQU   IEDQAVTD+1156                                            01641000
AVTNADDR EQU   IEDQAVTD+1152                                            01642000
AVTHRESN EQU   IEDQAVTD+1148                                            01643000
AVTVOLRN EQU   IEDQAVTD+1144                                            01644000
AVTTOTNN EQU   IEDQAVTD+1140                                            01645000
AVTTRCYN EQU   IEDQAVTD+1136                                            01646000
AVTRCTRN EQU   IEDQAVTD+1132                                            01647000
AVTNOVON EQU   IEDQAVTD+1128                                            01648000
AVTADEBN EQU   IEDQAVTD+1124                                            01649000
AVTVOLRR EQU   IEDQAVTD+1120                                            01650000
AVTTOTNR EQU   IEDQAVTD+1116                                            01651000
AVTTRCYR EQU   IEDQAVTD+1112                                            01652000
AVTRCTRR EQU   IEDQAVTD+1108                                            01653000
AVTNOVOR EQU   IEDQAVTD+1104                                            01654000
AVTADEBR EQU   IEDQAVTD+1100                                            01655000
AVTLODPT EQU   IEDQAVTD+1096                                            01656000
AVTIOBN  EQU   IEDQAVTD+1092                                            01657000
AVTIOBR  EQU   IEDQAVTD+1088                                            01658000
AVTCPBPT EQU   IEDQAVTD+1084                                            01659000
AVTFCPB  EQU   IEDQAVTD+1080                                            01660000
@NM00085 EQU   IEDQAVTD+1076                                            01661000
AVTINCPQ EQU   IEDQAVTD+1072                                            01662000
@NM00084 EQU   IEDQAVTD+1068                                            01663000
@NM00083 EQU   IEDQAVTD+1065                                            01664000
@NM00082 EQU   AVTBIT4                                                  01665000
@NM00081 EQU   AVTBIT4                                                  01666000
@NM00080 EQU   AVTBIT4                                                  01667000
@NM00079 EQU   AVTBIT4                                                  01668000
@NM00078 EQU   AVTBIT4                                                  01669000
@NM00077 EQU   AVTBIT4                                                  01670000
@NM00076 EQU   AVTBIT4                                                  01671000
AVTRUFTN EQU   AVTBIT4                                                  01672000
@NM00075 EQU   IEDQAVTD+1060                                            01673000
AVTNOBFQ EQU   IEDQAVTD+1056                                            01674000
@NM00074 EQU   IEDQAVTD+1052                                            01675000
AVTDKENQ EQU   IEDQAVTD+1048                                            01676000
@NM00073 EQU   IEDQAVTD+1044                                            01677000
AVTDKAPQ EQU   IEDQAVTD+1040                                            01678000
AVTCOPY  EQU   IEDQAVTD+1036                                            01679000
AVTIA    EQU   IEDQAVTD+1032                                            01680000
AVTFL    EQU   IEDQAVTD+1028                                            01681000
@NM00072 EQU   IEDQAVTD+1024                                            01682000
AVTNCPBQ EQU   IEDQAVTD+1020                                            01683000
AVTTOTNC EQU   IEDQAVTD+1016                                            01684000
AVTCMAX  EQU   IEDQAVTD+1012                                            01685000
AVTCMIN  EQU   IEDQAVTD+1008                                            01686000
AVTHM02  EQU   IEDQAVTD+1004                                            01687000
AVTOPCIN EQU   IEDQAVTD+1002                                            01688000
AVTDCTLN EQU   IEDQAVTD+1000                                            01689000
AVTOPMSK EQU   IEDQAVTD+996                                             01690000
AVTDDFT  EQU   IEDQAVTD+992                                             01691000
AVTSTEAL EQU   IEDQAVTD+988                                             01692000
AVTOPTN  EQU   IEDQAVTD+984                                             01693000
AVTDSKCT EQU   IEDQAVTD+982                                             01694000
AVTCKRST EQU   IEDQAVTD+981                                             01695000
AVTSTAN  EQU   AVTBIT3                                                  01696000
AVTSTACN EQU   AVTBIT3                                                  01697000
AVTSTAIN EQU   AVTBIT3                                                  01698000
AVTSTAYN EQU   AVTBIT3                                                  01699000
AVTOLTBN EQU   AVTBIT3                                                  01700000
AVTTSAB  EQU   AVTBIT3                                                  01701000
AVTRFULN EQU   AVTBIT3                                                  01702000
AVTRECVN EQU   AVTBIT3                                                  01703000
@NM00071 EQU   AVTBIT2                                                  01704000
@NM00070 EQU   AVTBIT2                                                  01705000
AVTOPEIN EQU   AVTBIT2                                                  01706000
AVTSTRTN EQU   AVTBIT2                                                  01707000
AVTTOPOL EQU   AVTBIT2                                                  01708000
AVTCOPYN EQU   AVTBIT2                                                  01709000
AVTREUSN EQU   AVTBIT2                                                  01710000
AVTEXTSC EQU   AVTBIT2                                                  01711000
AVTDISKN EQU   AVTBIT1                                                  01712000
AVTQUCKN EQU   AVTBIT1                                                  01713000
AVTCLOSN EQU   AVTBIT1                                                  01714000
AVTREADN EQU   AVTBIT1                                                  01715000
AVTDLAYN EQU   AVTBIT1                                                  01716000
AVTAQTAN EQU   AVTBIT1                                                  01717000
AVTTSON  EQU   AVTBIT1                                                  01718000
AVTAPLKN EQU   AVTBIT1                                                  01719000
AVTDUMBR EQU   IEDQAVTD+976                                             01720000
AVTDLQX  EQU   IEDQAVTD+974                                             01721000
AVTINTLV EQU   IEDQAVTD+972                                             01722000
AVTSMCNT EQU   IEDQAVTD+970                                             01723000
AVTAVFCT EQU   IEDQAVTD+968                                             01724000
AVTOPCON EQU   IEDQAVTD+966                                             01725000
AVTOPCNT EQU   IEDQAVTD+964                                             01726000
AVTLNCNT EQU   IEDQAVTD+962                                             01727000
AVTKEYLE EQU   IEDQAVTD+960                                             01728000
AVTHA16  EQU   IEDQAVTD+958                                             01729000
AVTHA7   EQU   IEDQAVTD+956                                             01730000
AVTHA4   EQU   IEDQAVTD+954                                             01731000
AVTHA3   EQU   IEDQAVTD+952                                             01732000
AVTHA2   EQU   IEDQAVTD+950                                             01733000
AVTGETMS EQU   IEDQAVTD+949                                             01734000
@NM00069 EQU   IEDQAVTD+948                                             01735000
AVTGETMD EQU   IEDQAVTD+944                                             01736000
AVTGETMN EQU   IEDQAVTD+940                                             01737000
AVTCWTOT EQU   IEDQAVTD+936                                             01738000
AVTCWINT EQU   IEDQAVTD+884                                             01739000
AVTDTRAP EQU   IEDQAVTD+880                                             01740000
@NM00068 EQU   IEDQAVTD+878                                             01741000
@NM00067 EQU   AVTIOTR                                                  01742000
AVTIOTRH EQU   AVTIOTR                                                  01743000
AVTIOTRE EQU   AVTIOTR                                                  01744000
@NM00066 EQU   AVTSUBT                                                  01745000
AVTSUBPT EQU   AVTSUBT                                                  01746000
AVTSUBON EQU   AVTSUBT                                                  01747000
AVTAFE30 EQU   IEDQAVTD+872                                             01748000
AVTAFE20 EQU   IEDQAVTD+868                                             01749000
AVTAFE10 EQU   IEDQAVTD+864                                             01750000
AVTCWEC2 EQU   IEDQAVTD+860                                             01751000
AVTCWPM2 EQU   IEDQAVTD+856                                             01752000
AVTCWTS2 EQU   IEDQAVTD+855                                             01753000
AVTCWTS1 EQU   IEDQAVTD+854                                             01754000
AVTCWCLD EQU   AVTCWFL2                                                 01755000
AVTCWRAP EQU   AVTCWFL2                                                 01756000
@NM00065 EQU   AVTCWFL2                                                 01757000
@NM00064 EQU   AVTCWFL2                                                 01758000
@NM00063 EQU   AVTCWFL2                                                 01759000
@NM00062 EQU   AVTCWFL2                                                 01760000
@NM00061 EQU   AVTCWFL2                                                 01761000
AVTCWACT EQU   AVTCWFL2                                                 01762000
@NM00060 EQU   AVTCWFL1                                                 01763000
@NM00059 EQU   AVTCWFL1                                                 01764000
@NM00058 EQU   AVTCWFL1                                                 01765000
@NM00057 EQU   AVTCWFL1                                                 01766000
@NM00056 EQU   AVTCWFL1                                                 01767000
@NM00055 EQU   AVTCWFL1                                                 01768000
@NM00054 EQU   AVTCWFL1                                                 01769000
AVTCOMWN EQU   AVTCWFL1                                                 01770000
AVTCWEC1 EQU   IEDQAVTD+848                                             01771000
AVTCWPM1 EQU   IEDQAVTD+844                                             01772000
AVTCAREA EQU   IEDQAVTD+840                                             01773000
AVTFZERO EQU   IEDQAVTD+836                                             01774000
AVTCADDR EQU   IEDQAVTD+832                                             01775000
AVTCOREC EQU   IEDQAVTD+828                                             01776000
@NM00053 EQU   IEDQAVTD+820                                             01777000
AVTCPBCB EQU   IEDQAVTD+816                                             01778000
@NM00052 EQU   IEDQAVTD+808                                             01779000
AVTDSIOB EQU   IEDQAVTD+804                                             01780000
@NM00051 EQU   IEDQAVTD+796                                             01781000
AVTCPRMB EQU   IEDQAVTD+792                                             01782000
@NM00050 EQU   IEDQAVTD+784                                             01783000
AVTCLOSB EQU   IEDQAVTD+780                                             01784000
@NM00049 EQU   IEDQAVTD+772                                             01785000
AVTACTIB EQU   IEDQAVTD+768                                             01786000
@NM00048 EQU   IEDQAVTD+764                                             01787000
AVTOLTEB EQU   IEDQAVTD+760                                             01788000
AVTOLTCH EQU   AVTOLTQB+1                                               01789000
AVTOLTVT EQU   AVTOLTQB                                                 01790000
@NM00047 EQU   AVTOPCQB+8                                               01791000
@NM00046 EQU   AVTOPCEC+1                                               01792000
@NM00045 EQU   AVTOPCCC                                                 01793000
AVTOPCPO EQU   AVTOPCCC                                                 01794000
AVTOPCWA EQU   AVTOPCCC                                                 01795000
AVTOPCCH EQU   AVTOPCOB+1                                               01796000
AVTOPCVT EQU   AVTOPCOB                                                 01797000
@NM00044 EQU   AVTCKPQB+9                                               01798000
AVTCKPTS EQU   AVTCKPQB+8                                               01799000
@NM00043 EQU   AVTCKPEC+1                                               01800000
@NM00042 EQU   AVTCKPCC                                                 01801000
AVTCKPPO EQU   AVTCKPCC                                                 01802000
AVTCKPWA EQU   AVTCKPCC                                                 01803000
AVTCKPCH EQU   AVTCKPTB+1                                               01804000
AVTCKPVT EQU   AVTCKPTB                                                 01805000
@NM00041 EQU   IEDQAVTD+724                                             01806000
@NM00040 EQU   IEDQAVTD+716                                             01807000
AVTSELCH EQU   IEDQAVTD+713                                             01808000
AVTBFRTN EQU   AVTBFRFG                                                 01809000
AVTBFREB EQU   IEDQAVTD+708                                             01810000
AVTTIMQ  EQU   IEDQAVTD+704                                             01811000
@NM00039 EQU   IEDQAVTD+700                                             01812000
AVTIMQPS EQU   IEDQAVTD+696                                             01813000
AVTINOUT EQU   IEDQAVTD+694                                             01814000
AVTREFTM EQU   IEDQAVTD+692                                             01815000
@NM00038 EQU   IEDQAVTD+680                                             01816000
AVTDELYB EQU   IEDQAVTD+676                                             01817000
AVTOCQPT EQU   IEDQAVTD+672                                             01818000
AVTTSOPT EQU   IEDQAVTD+668                                             01819000
AVTSUPPT EQU   IEDQAVTD+664                                             01820000
AVTCBQCB EQU   IEDQAVTD+660                                             01821000
@NM00037 EQU   AVTSYSER                                                 01822000
@NM00036 EQU   AVTSYSER                                                 01823000
@NM00035 EQU   AVTSYSER                                                 01824000
@NM00034 EQU   AVTSYSER                                                 01825000
@NM00033 EQU   AVTSYSER                                                 01826000
@NM00032 EQU   AVTSYSER                                                 01827000
AVTCMAXN EQU   AVTSYSER                                                 01828000
AVTCMINN EQU   AVTSYSER                                                 01829000
AVT2260L EQU   IEDQAVTD+652                                             01830000
AVTABEPL EQU   AVTADBUF                                                 01831000
AVTHFF   EQU   AVTCLRHI+2                                               01832000
@NM00031 EQU   AVTCLRHI                                                 01833000
AVTCCLNK EQU   AVTCRELE+5                                               01834000
AVTCCPRI EQU   AVTCRELE+4                                               01835000
AVTCCQCB EQU   AVTCCELE+1                                               01836000
AVTCCKEY EQU   AVTCCELE                                                 01837000
AVTDELAD EQU   IEDQAVTD+632                                             01838000
AVTDELEM EQU   IEDQAVTD+628                                             01839000
AVTBSX   EQU   AVTCKLNK                                                 01840000
AVTOPETR EQU   AVTHG01                                                  01841000
@NM00030 EQU   AVTCKBYT                                                 01842000
AVTCKONQ EQU   AVTCKBYT                                                 01843000
@NM00029 EQU   AVTCKBYT                                                 01844000
@NM00028 EQU   AVTCKBYT                                                 01845000
@NM00027 EQU   AVTCKBYT                                                 01846000
@NM00026 EQU   AVTCKBYT                                                 01847000
@NM00025 EQU   AVTCKBYT                                                 01848000
@NM00024 EQU   AVTCKBYT                                                 01849000
AVTOPERT EQU   IEDQAVTD+618                                             01850000
AVTOPXCL EQU   IEDQAVTD+616                                             01851000
AVTOPERL EQU   IEDQAVTD+615                                             01852000
@NM00023 EQU   IEDQAVTD+614                                             01853000
AVTCKTIM EQU   IEDQAVTD+612                                             01854000
AVTCKELV EQU   IEDQAVTD+610                                             01855000
AVTCPRCD EQU   IEDQAVTD+609                                             01856000
AVTWARMN EQU   AVTCKELF                                                 01857000
AVTCRTLN EQU   AVTCKELF                                                 01858000
AVTCPIPN EQU   AVTCKELF                                                 01859000
AVTCCLCN EQU   AVTCKELF                                                 01860000
AVTCINCN EQU   AVTCKELF                                                 01861000
@NM00022 EQU   AVTCKELF                                                 01862000
AVTCMCPN EQU   AVTCKELF                                                 01863000
AVTNQBCK EQU   AVTCKELF                                                 01864000
AVTCKQAD EQU   IEDQAVTD+605                                             01865000
AVTSCBSZ EQU   IEDQAVTD+604                                             01866000
@NM00021 EQU   IEDQAVTD+600                                             01867000
AVTCKELE EQU   IEDQAVTD+596                                             01868000
@NM00020 EQU   AVTCKPEL+8                                               01869000
AVTCKRLK EQU   AVTCKPEL+5                                               01870000
AVTCKRPR EQU   AVTCKPEL+4                                               01871000
AVTCKRMQ EQU   AVTCKRMV+1                                               01872000
AVTCKRKY EQU   AVTCKRMV                                                 01873000
AVTHK    EQU   IEDQAVTD+576                                             01874000
AVTHI    EQU   IEDQAVTD+572                                             01875000
AVTIOT   EQU   IEDQAVTD+568                                             01876000
AVTNX    EQU   IEDQAVTD+564                                             01877000
AVTTONE  EQU   IEDQAVTD+560                                             01878000
AVTA3TL  EQU   IEDQAVTD+556                                             01879000
AVTDMECB EQU   IEDQAVTD+552                                             01880000
AVTABEND EQU   IEDQAVTD+546                                             01881000
AVTPLCBN EQU   IEDQAVTD+544                                             01882000
@NM00019 EQU   AVTSAVTP+1                                               01883000
@NM00018 EQU   AVTSAVTF                                                 01884000
AVTSNA   EQU   AVTSAVTF                                                 01885000
AVTONSNA EQU   AVTSAVTF                                                 01886000
AVTVTMCP EQU   AVTSAVTF                                                 01887000
@NM00017 EQU   IEDQAVTD+536                                             01888000
AVTCMBSS EQU   IEDQAVTD+532                                             01889000
AVTRCV   EQU   IEDQAVTD+528                                             01890000
AVTSEND  EQU   IEDQAVTD+524                                             01891000
AVTCSCH  EQU   IEDQAVTD+520                                             01892000
AVTQ1    EQU   IEDQAVTD+516                                             01893000
AVTE7    EQU   IEDQAVTD+512                                             01894000
AVTHB    EQU   IEDQAVTD+508                                             01895000
AVTR1    EQU   IEDQAVTD+504                                             01896000
AVTBZ    EQU   IEDQAVTD+500                                             01897000
AVTEZ    EQU   IEDQAVTD+496                                             01898000
AVTEC    EQU   IEDQAVTD+492                                             01899000
AVTEW    EQU   IEDQAVTD+488                                             01900000
AVTNDIAL EQU   AVTSCOPT                                                 01901000
AVTN2741 EQU   AVTSCOPT                                                 01902000
AVTCONCO EQU   AVTSCOPT                                                 01903000
AVTCONC  EQU   AVTSCOPT                                                 01904000
AVTCMBUF EQU   AVTSCOPT                                                 01905000
AVTAPDMP EQU   AVTSCOPT                                                 01906000
@NM00016 EQU   AVTSCOPT                                                 01907000
AVTHA    EQU   AVTDISP                                                  01908000
AVTEA    EQU   IEDQAVTD+476                                             01909000
AVTAX    EQU   IEDQAVTD+472                                             01910000
AVTA3    EQU   IEDQAVTD+468                                             01911000
AVTGD    EQU   IEDQAVTD+464                                             01912000
AVTAL    EQU   IEDQAVTD+460                                             01913000
AVTOLTST EQU   AVTHG02                                                  01914000
AVTE8    EQU   IEDQAVTD+452                                             01915000
AVTUI    EQU   IEDQAVTD+448                                             01916000
AVTCOMPT EQU   IEDQAVTD+444                                             01917000
AVTCRSRF EQU   IEDQAVTD+440                                             01918000
@NM00015 EQU   IEDQAVTD+436                                             01919000
AVTKA02  EQU   IEDQAVTD+432                                             01920000
AVTOPTPT EQU   IEDQAVTD+428                                             01921000
AVTPCBPT EQU   IEDQAVTD+424                                             01922000
@NM00014 EQU   AVTECB1                                                  01923000
AVTCOMP  EQU   AVTECB1                                                  01924000
@NM00013 EQU   AVTECB1                                                  01925000
AVTOPECA EQU   IEDQAVTD+416                                             01926000
AVTOLECA EQU   IEDQAVTD+412                                             01927000
AVTCKECA EQU   IEDQAVTD+408                                             01928000
AVTCWECA EQU   IEDQAVTD+404                                             01929000
AVTCWTCB EQU   IEDQAVTD+400                                             01930000
AVTOLTCB EQU   IEDQAVTD+396                                             01931000
AVTOCTCB EQU   IEDQAVTD+392                                             01932000
AVTCKTCB EQU   IEDQAVTD+388                                             01933000
AVTAS    EQU   IEDQAVTD+384                                             01934000
AVTNOLBF EQU   IEDQAVTD+382                                             01935000
AVTNCKPR EQU   IEDQAVTD+381                                             01936000
AVTCIB   EQU   IEDQAVTD+380                                             01937000
AVTSPLPT EQU   IEDQAVTD+376                                             01938000
AVTMVBFR EQU   IEDQAVTD+372                                             01939000
AVTSBTA  EQU   IEDQAVTD+368                                             01940000
AVTRARTN EQU   IEDQAVTD+364                                             01941000
AVTBSCAN EQU   IEDQAVTD+360                                             01942000
AVTRDYA  EQU   IEDQAVTD+356                                             01943000
AVTDISTR EQU   IEDQAVTD+348                                             01944000
AVTPARM3 EQU   IEDQAVTD+344                                             01945000
@NM00012 EQU   AVTPKF                                                   01946000
@NM00011 EQU   AVTPKF                                                   01947000
@NM00010 EQU   AVTPKF                                                   01948000
AVTFTCHF EQU   AVTPKF                                                   01949000
@NM00009 EQU   AVTPKF                                                   01950000
@NM00008 EQU   AVTPKF                                                   01951000
@NM00007 EQU   AVTPKF                                                   01952000
@NM00006 EQU   AVTPKF                                                   01953000
AVTPARM  EQU   IEDQAVTD+336                                             01954000
AVTEXS2A EQU   IEDQAVTD+330                                             01955000
AVTEXA2S EQU   IEDQAVTD+324                                             01956000
AVTOCGET EQU   IEDQAVTD+320                                             01957000
AVTCKAVT EQU   @NM00004+1                                               01958000
@NM00005 EQU   AVTCKFLG                                                 01959000
AVTCKHLT EQU   AVTCKFLG                                                 01960000
AVTCKREQ EQU   AVTCKFLG                                                 01961000
AVTCKENV EQU   AVTCKFLG                                                 01962000
AVTCKNAC EQU   AVTCKFLG                                                 01963000
AVTCKTAC EQU   AVTCKFLG                                                 01964000
AVTBUENT EQU   IEDQAVTD+314                                             01965000
@NM00003 EQU   IEDQAVTD+313                                             01966000
AVTFULLT EQU   AVTBUFSW                                                 01967000
AVTUNCON EQU   AVTBUFSW                                                 01968000
@NM00002 EQU   AVTBUFSW                                                 01969000
AVTBUFTR EQU   AVTREADD                                                 01970000
AVTREADY EQU   IEDQAVTD+304                                             01971000
AVTRACE  EQU   IEDQAVTD+300                                             01972000
AVTTCB   EQU   IEDQAVTD+296                                             01973000
AVTPASWD EQU   IEDQAVTD+288                                             01974000
AVTCTLCH EQU   IEDQAVTD+280                                             01975000
AVTDOUBL EQU   IEDQAVTD+272                                             01976000
AVTDOUBX EQU   IEDQAVTD+264                                             01977000
AVTDPARM EQU   IEDQAVTD+260                                             01978000
AVTCSTCS EQU   IEDQAVTD+256                                             01979000
AVTDLQ   EQU   AVTSAVEX+32                                              01980000
@NM00001 EQU   AVTSAVEX                                                 01981000
AVTSAVE4 EQU   IEDQAVTD+144                                             01982000
AVTSAVE3 EQU   IEDQAVTD+72                                              01983000
AVTSAVE2 EQU   IEDQAVTD                                                 01984000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01985000
@RC00479 EQU   @PB00002                                                 01986000
@RC00477 EQU   @PB00002                                                 01987000
@RC00450 EQU   @PB00002                                                 01988000
@RC00489 EQU   @EL00002                                                 01989000
@PB00004 EQU   @PB00005                                                 01990000
@RC00539 EQU   @EL00001                                                 01991000
@RC00576 EQU   @EL00001                                                 01992000
@RC00579 EQU   @EL00001                                                 01993000
@RC00452 EQU   @RC00450                                                 01994000
@RF00481 EQU   @RC00479                                                 01995000
@PB00003 EQU   @PB00004                                                 01996000
@RC00568 EQU   @RC00539                                                 01997000
@RC00552 EQU   @RC00539                                                 01998000
@RC00542 EQU   @RC00539                                                 01999000
@RC00554 EQU   @RC00552                                                 02000000
@ENDDATA EQU   *                                                        02001000
         END   IEDSAO,(C'PLS1316',0701,78010)                           02002000
