         TITLE 'IGCA810D, DEACTIVATE A LOGICAL UNIT                    *00001000
                        '                                               00002000
IGCA810D CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
*                                                               02S0431 00005000
*   /*****************************************************************/ 00006000
*   /*                                                               */ 00007000
*   /* PROLOGUE: THIS SEGMENT COMPLETES THE PROLOGUE CODE THAT WAS   */ 00008000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT.                    */ 00009000
*   /*                                                               */ 00010000
*   /*****************************************************************/ 00011000
*                                                               02S0431 00012000
*   RBASE=REG15;                    /* SET THE CODE BASE REGISTER       00013000
*                                      WITH THE POINTER TO THE FIRST    00014000
*                                      INSTRUCTION OF THIS MODULE    */ 00015000
         LR    RBASE,REG15                                      02S0431 00016000
*   GEN REFS(RBASE) NOSETS;                                     02S0432 00017000
*                                   /*                                  00018000
         USING IGCA810D,RBASE          INFORM THE ASSEMBLER OF THE      00019000
*                                      BASE REGISTER TO BE USED FOR     00020000
*                                      ADDRESSING CODE                  00021000
*   GEN NOREFS NOSETS;                                          02S0433 00022000
*                                   /*                                  00023000
IGCA810D IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO      00024000
*   ROPCAVT=RPARM;                  /* ESTABLISH ADDRESSABILITY TO      00025000
*                                      THE OPERATOR CONTROL ADDRESS     00026000
*                                      VECTOR TABLE FROM THE INPUT      00027000
*                                      PARAMETER REGISTER            */ 00028000
         LR    ROPCAVT,RPARM                                    02S0434 00029000
*   REG10=OPCWORK;                  /* SET THE BASE REGISTER TO BE      00030000
*                                      USED FOR ADDRESSING AUTOMATIC    00031000
*                                      DATA WITH THE POINTER TO THE     00032000
*                                      OPERATOR CONTROL RESIDENT WORK   00033000
*                                      AREA                          */ 00034000
         L     REG10,OPCWORK(,ROPCAVT)                          02S0435 00035000
*   GEN REFS(REG10) NOSETS;                                     02S0436 00036000
*                                   /*                                  00037000
         USING @DATD,REG10             PROVIDE ADDRESSABILITY TO ALL    00038000
*                                      AUTOMATIC DATA                   00039000
*   RSAVE=ADDR(OPCSAVE);            /* ESTABLISH ADDRESSABILITY TO      00040000
*                                      THE OPERATOR CONTROL SAVE AREA*/ 00041000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          02S0437 00042000
*   RFY                                                         02S0438 00043000
*     REG15 UNRSTD;                 /* RELEASE THE REGISTER     02S0438 00044000
*                                      RESTRICTED AT ENTRY TO THE       00045000
*                                      MODULE THAT WAS USED BY THE      00046000
*                                      XCTL MACRO TO CONTAIN THE        00047000
*                                      POINTER TO THE ENTRY POINT OF    00048000
*                                      THIS MODULE                   */ 00049000
*                                                               02S0439 00050000
*   /*****************************************************************/ 00051000
*   /*                                                               */ 00052000
*   /* PROCESS: THIS SEGMENT DOES THE PROCESSING THAT IS NECESSARY TO*/ 00053000
*   /* PERFORM THE FUNCTION OF THE MODULE.                           */ 00054000
*   /*                                                               */ 00055000
*   /*****************************************************************/ 00056000
*                                                               02S0439 00057000
*                                                               03S0439 00058000
*   /*****************************************************************/ 00059000
*   /*                                                               */ 00060000
*   /* PROCESS.INITIAL: THIS SEGMENT DOES THE INITIAL PROCESSING.    */ 00061000
*   /*                                                               */ 00062000
*   /*****************************************************************/ 00063000
*                                                               03S0439 00064000
*   RAVT=OPCAVTPT;                  /* ESTABLISH ADDRESSABILITY TO      00065000
*                                      THE TCAM ADDRESS VECTOR TABLE */ 00066000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0439 00067000
*   ROPCE=OPCCOPCE;                 /* ESTABLISH ADDRESSABILITY TO      00068000
*                                      THE INPUT OPERATOR CONTROL       00069000
*                                      ELEMENT                       */ 00070000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0440 00071000
*   IF OCRESP=OFF                   /* TEST FOR A NEW "DEACTIVATE       00072000
*                                      LOGICAL UNIT" REQUEST         */ 00073000
*     THEN                          /* PROCESS THE "DEACTIVATE  02S0441 00074000
*                                      LOGICAL UNIT" REQUEST         */ 00075000
         TM    OCRESP(ROPCE),B'00000001'                        02S0441 00076000
         BNZ   @RF00441                                         02S0441 00077000
*                                                               03S0442 00078000
*     /***************************************************************/ 00079000
*     /*                                                             */ 00080000
*     /* PROCESS.REQUEST: THIS SEGMENT DOES THE PROCESSING OF A      */ 00081000
*     /* "DEACTIVATE LOGICAL UNIT" REQUEST.                          */ 00082000
*     /*                                                             */ 00083000
*     /***************************************************************/ 00084000
*                                                               03S0442 00085000
*     DO;                                                       03S0442 00086000
*       OCWTGB=OCWTG;               /* SAVE THE OPERATOR CONTROL        00087000
*                                      ELEMENT "WHERE TO GO" FIELD IN   00088000
*                                      THE OPERATOR CONTROL ELEMENT     00089000
*                                      "WHERE TO GO BACK-UP" FIELD   */ 00090000
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                     03S0443 00091000
*       RPARM=1;                    /* SET THE NUMBER OF BUFFER UNITS   00092000
*                                      DESIRED TO ONE (1) BUFFER UNIT*/ 00093000
         LA    RPARM,1                                          03S0444 00094000
*       CALL ALLOCBUF;              /* CALL TO GET A BUFFER UNIT TO     00095000
*                                      BE USED TO BUILD THE     03S0445 00096000
*                                      "DEACTIVATE LOGICAL UNIT"        00097000
*                                      REQUEST                       */ 00098000
         L     @15,OPCGETBF(,ROPCAVT)                           03S0445 00099000
         BALR  @14,@15                                          03S0445 00100000
*       OCUNIT=RPARM;               /* ATTACH THE BUFFER UNIT TO THE    00101000
*                                      OPERATOR CONTROL ELEMENT      */ 00102000
         ST    RPARM,OCUNIT(,ROPCE)                             03S0446 00103000
*       PRURHTH=RHPACKTH;           /* SET THE REQUEST HEADER AND THE   00104000
*                                      PACKED TRANSMISSION HEADER    */ 00105000
         L     @11,OCUNIT(,ROPCE)                               03S0447 00106000
         LR    @09,@11                                          03S0447 00107000
         AL    @09,@CF01613                                     03S0447 00108000
         MVC   PRURHTH(4,@09),@CB01605                          03S0447 00109000
*       PRUTTCIN=OCTRMTBL;          /* SET THE DESTINATION TERMINAL     00110000
*                                      TABLE CURRENT INDEX           */ 00111000
         LH    @09,OCTRMTBL(,ROPCE)                             03S0448 00112000
         N     @09,@CF01614                                     03S0448 00113000
         STH   @09,PRUTTCIN(,@11)                               03S0448 00114000
*       PRUDATCT=LENGTH(DLUREQ);    /* SET THE DATA COUNT FIELD TO      00115000
*                                      THE NUMBER OF BYTES IN THE       00116000
*                                      REQUEST UNIT DATA             */ 00117000
         MVC   PRUDATCT(2,@11),@CH00061                         03S0449 00118000
*       PRUDATA(1:LENGTH(DLUREQ))=DLUREQ;/* BUILD THE REQUEST UNIT      00119000
*                                      DATA                          */ 00120000
         MVC   PRUDATA(1,@11),DLUREQ                            03S0450 00121000
*       OCWTG='A8';                 /* SET THE OPERATOR CONTROL 03S0451 00122000
*                                      "WHERE TO GO" FIELD TO   03S0451 00123000
*                                      INDICATE THAT THE RESPONSE TO    00124000
*                                      THE REQUEST IS TO BE SENT BACK   00125000
*                                      TO THIS MODULE                */ 00126000
         MVC   OCWTG(2,ROPCE),@CC01611                          03S0451 00127000
*       OPCMODID='02';              /* SET THE MODULE IDENTIFICATION    00128000
*                                      IN PREPARATION TO SENDING THE    00129000
*                                      REQUEST OUT AND TRANSFERRING     00130000
*                                      CONTROL VIA THE XCTL MACRO    */ 00131000
         MVC   OPCMODID(2,ROPCAVT),@CC01612                     03S0452 00132000
*     END;                                                      03S0453 00133000
*   ELSE                            /* PROCESS THE "DEACTIVATE  02S0454 00134000
*                                      LOGICAL UNIT" RESPONSE        */ 00135000
*                                                               03S0454 00136000
*     /***************************************************************/ 00137000
*     /*                                                             */ 00138000
*     /* PROCESS.RESPONSE: THIS SEGMENT PROCESSES THE "DEACTIVATE    */ 00139000
*     /* LOGICAL UNIT" RESPONSE.                                     */ 00140000
*     /*                                                             */ 00141000
*     /***************************************************************/ 00142000
*                                                               03S0454 00143000
*     DO;                                                       03S0454 00144000
         B     @RC00441                                         03S0454 00145000
@RF00441 DS    0H                                               03S0455 00146000
*       RPARM=OCTRMTBL;             /* SET UP THE PARAMETER REGISTER    00147000
*                                      WITH THE TERMINAL NAME TABLE     00148000
*                                      INDEX OF THE RESOURCE         */ 00149000
         LH    RPARM,OCTRMTBL(,ROPCE)                           03S0455 00150000
         N     RPARM,@CF01614                                   03S0455 00151000
*       CALL IEDQTNT;               /* OBTAIN THE POINTER TO THE        00152000
*                                      TERMINAL TABLE ENTRY FOR THE     00153000
*                                      RESOURCE BEING ACTED UPON     */ 00154000
         L     @15,AVTRNMPT(,RAVT)                              03S0456 00155000
         BALR  @14,@15                                          03S0456 00156000
*       RTRM=RPARM;                 /* ESTABLISH ADDRESSABILITY TO      00157000
*                                      THE TERMINAL TABLE ENTRY BY      00158000
*                                      USING THE RESULT FROM THE        00159000
*                                      IEDQTNT ROUTINE               */ 00160000
         LR    RTRM,RPARM                                       03S0457 00161000
*                                                               04S0458 00162000
*       /*************************************************************/ 00163000
*       /*                                                           */ 00164000
*       /* PROCESS.RESPONSE.FREESIB: THIS SEGMENT FREES THE SESSION  */ 00165000
*       /* INFORMATION CONTROL BLOCK FOR THE SYSTEM SERVICES CONTROL */ 00166000
*       /* POINT TO LOGICAL UNIT SESSION. THIS SEGMENT USES THE      */ 00167000
*       /* POSTWAIT EXTERNAL ROUTINE.                                */ 00168000
*       /*                                                           */ 00169000
*       /*************************************************************/ 00170000
*                                                               04S0458 00171000
*       REQAREA(1:REQSLEN)=''B;     /* CLEAR THE INTERTASK REQUEST      00172000
*                                      ELEMENT WITH ZEROS            */ 00173000
         XC    REQAREA(26),REQAREA                              04S0458 00174000
*       REQTYPE=REQSFREE;           /* SET THE REQUEST TYPE TO  04S0459 00175000
*                                      INDICATE THAT A SESSION  04S0459 00176000
*                                      INFORMATION CONTROL BLOCK IS     00177000
*                                      TO BE FREED                   */ 00178000
         LA    @11,REQAREA                                      04S0459 00179000
         MVI   REQTYPE(@11),X'04'                               04S0459 00180000
*       REQQCBA=SAVTXTRQ;           /* SET THE QUEUE CONTROL BLOCK      00181000
*                                      POINTER TO THE POINTER TO THE    00182000
*                                      QUEUE CONTROL BLOCK FOR THE      00183000
*                                      POSTWAIT ROUTINE              */ 00184000
         L     @09,AVTSAVTP(,RAVT)                              04S0460 00185000
         MVC   REQQCBA(3,@11),SAVTXTRQ+1(@09)                   04S0460 00186000
*       REQPRI=PRISIBRQ;            /* SET THE REQUEST PRIORITY FROM    00187000
*                                      THE SIB REQUEST PRIORITY 04S0461 00188000
*                                      CONSTANT                      */ 00189000
         MVI   REQPRI(@11),X'E5'                                04S0461 00190000
*       REQRPRI=PRISIBRQ;           /* SET THE REQUEST RETURN   04S0462 00191000
*                                      PRIORITY FROM THE SIB REQUEST    00192000
*                                      PRIORITY CONSTANT             */ 00193000
         MVI   REQRPRI(@11),X'E5'                               04S0462 00194000
*       REQRQCBA=ADDR(OPCPWQCB);    /* SET THE RETURN QUEUE CONTROL     00195000
*                                      BLOCK POINTER TO THE POINTER     00196000
*                                      TO THE OPERATOR CONTROL QUEUE    00197000
*                                                            @YM08403*/ 00198000
         LA    @05,OPCPWQCB(,ROPCAVT)                           04S0463 00199000
         STCM  @05,7,REQRQCBA(@11)                              04S0463 00200000
*       REQSTTE=RTRM;               /* SET THE REQUEST TERMINAL TABLE   00201000
*                                      ENTRY ADDRESS TO THE POINTER     00202000
*                                      TO THE TERMINAL TABLE ENTRY      00203000
*                                      FOR THE RESOURCE WHOSE SIB       00204000
*                                      CHAIN WILL BE CHANGED         */ 00205000
         ST    RTRM,REQSTTE(,@11)                               04S0464 00206000
*       REQSTNT=SAVTSCPT;           /* SPECIFY THE SSCP TERMINAL NAME   00207000
*                                      TABLE INDEX AS THE TNT INDEX     00208000
*                                      TO BE PLACED IN THE SIB TO       00209000
*                                      INDICATE A SSCP TO RESOURCE      00210000
*                                      SESSION                       */ 00211000
         LH    @09,SAVTSCPT(,@09)                               04S0465 00212000
         N     @09,@CF01614                                     04S0465 00213000
         STH   @09,REQSTNT(,@11)                                04S0465 00214000
*       RPARM=ADDR(REQAREA);        /* SET THE PARAMETER REGISTER       00215000
*                                      WITH THE POINTER TO THE  04S0466 00216000
*                                      REQUEST ELEMENT               */ 00217000
         LR    RPARM,@11                                        04S0466 00218000
*       CALL POSTWAIT;              /* CALL THE POSTWAIT INTERTASK      00219000
*                                      REQUEST ROUTINE               */ 00220000
         L     @15,OPCPSTWT(,ROPCAVT)                           04S0467 00221000
         BALR  @14,@15                                          04S0467 00222000
*       IF PRURHSDI=OFF             /* TEST FOR THE ABSENCE OF THE      00223000
*                                      SENSE DATA IN THE RESPONSE       00224000
*                                      UNIT                          */ 00225000
*         THEN                      /* SET THE RETURN CODE FIELD IN     00226000
*                                      THE OPERATOR CONTROL ELEMENT  */ 00227000
         L     @11,OCUNIT(,ROPCE)                               03S0468 00228000
         AL    @11,@CF01613                                     03S0468 00229000
         TM    PRURHSDI(@11),B'00000100'                        03S0468 00230000
         BNZ   @RF00468                                         03S0468 00231000
*         OCPARM=OCRCGPOS;          /* INDICATE A GOOD RESPONSE AND     00232000
*                                      THAT NO SENSE IS INCLUDED IN     00233000
*                                      THE RESPONSE UNIT DATA        */ 00234000
         MVC   OCPARM(2,ROPCE),@CH00061                         03S0469 00235000
*       ELSE                        /* SET THE RETURN CODE FIELD IN     00236000
*                                      THE OPERATOR CONTROL ELEMENT  */ 00237000
*         OCPARM=OCRCGNEG;          /* INDICATE A GOOD RESPONSE AND     00238000
*                                      THAT SENSE DATA IS INCLUDED IN   00239000
*                                      THE RESPONSE UNIT DATA        */ 00240000
         B     @RC00468                                         03S0470 00241000
@RF00468 MVC   OCPARM(2,ROPCE),@CH00128                         03S0470 00242000
*       OPCMODID=OCWTGB;            /* SET THE MODULE IDENTIFICATION    00243000
*                                      FOR THE XCTL MACRO FROM THE      00244000
*                                      OPERATOR CONTROL "WHERE TO GO    00245000
*                                      BACK-UP" FIELD                */ 00246000
@RC00468 MVC   OPCMODID(2,ROPCAVT),OCWTGB(ROPCE)                03S0471 00247000
*     END;                                                      03S0472 00248000
*                                                               02S0473 00249000
*   /*****************************************************************/ 00250000
*   /*                                                               */ 00251000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00252000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT. THE XCTL SYSTEM    */ 00253000
*   /* MACRO INSTRUCTION IS USED BY THIS SEGMENT TO TRANSFER CONTROL */ 00254000
*   /* TO THE NEXT MODULE THAT IS TO BE EXECUTED.                    */ 00255000
*   /*                                                               */ 00256000
*   /*****************************************************************/ 00257000
*                                                               02S0473 00258000
*   RPARM=ROPCAVT;                  /* SET THE PARAMETER REGISTER       00259000
*                                      WITH THE POINTER TO THE  02S0473 00260000
*                                      OPERATOR CONTROL ADDRESS 02S0473 00261000
*                                      VECTOR TABLE IN PREPARATION TO   00262000
*                                      TRANSFERRING CONTROL TO  02S0473 00263000
*                                      ANOTHER MODULE                */ 00264000
@RC00441 LR    RPARM,ROPCAVT                                    02S0473 00265000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0474 00266000
*                                   /*                                  00267000
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO           00268000
*   END IGCA810D                                                01S0475 00269000
*                                                               01S0475 00270000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00271000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00272000
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */ 00273000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00274000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00275000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00276000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 00277000
*/*%INCLUDE SYSLIB  (TREQD   )                                       */ 00278000
*/*%INCLUDE SYSLIB  (TSIBD   )                                       */ 00279000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00280000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 00281000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 00282000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 00283000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 00284000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 00285000
*/*%INCLUDE SYSUT5  (REQUEST )                                       */ 00286000
*/*%INCLUDE SYSUT5  (RESPONSE)                                       */ 00287000
*/*%INCLUDE SYSUT5  (FREESIB )                                       */ 00288000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 00289000
*                                                               01S0475 00290000
*       ;                                                       01S0475 00291000
@DATA    DS    0H                                                       00292000
@CH00061 DC    H'1'                                                     00293000
@CH00128 DC    H'2'                                                     00294000
@DATD    DSECT                                                          00295000
         DS    0F                                                       00296000
IGCA810D CSECT                                                          00297000
         DS    0F                                                       00298000
@CF01613 DC    F'-8'                                                    00299000
@CF01614 DC    XL4'0000FFFF'                                            00300000
@DATD    DSECT                                                          00301000
         DS    0D                                                       00302000
REQAREA  DS    CL26                                                     00303000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00304000
@ENDDATD EQU   *                                                        00305000
IGCA810D CSECT                                                          00306000
         NOPR  ((@ENDDATD-@DATD)/561*16)                                00307000
         DS    0F                                                       00308000
@SIZDATD DC    AL1(0)                                                   00309000
         DC    AL3(@ENDDATD-@DATD)                                      00310000
         DS    0D                                                       00311000
@CC01611 DC    C'A8'                                                    00312000
@CC01612 DC    C'02'                                                    00313000
@CB01605 DC    X'6B80001D'                                              00314000
PATCH    DC    XL104'0'                                                 00315000
DLUREQ   DS    CL1                                                      00316000
         ORG   DLUREQ                                                   00317000
DLUCODE  DC    X'0E'                                                    00318000
         ORG   DLUREQ+1                                                 00319000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00320000
@01      EQU   01                                                       00321000
@02      EQU   02                                                       00322000
@03      EQU   03                                                       00323000
@04      EQU   04                                                       00324000
@05      EQU   05                                                       00325000
@06      EQU   06                                                       00326000
@07      EQU   07                                                       00327000
@08      EQU   08                                                       00328000
@09      EQU   09                                                       00329000
@10      EQU   10                                                       00330000
@11      EQU   11                                                       00331000
@12      EQU   12                                                       00332000
@13      EQU   13                                                       00333000
@14      EQU   14                                                       00334000
@15      EQU   15                                                       00335000
ROPCE    EQU   @03                                                      00336000
ROPCAVT  EQU   @02                                                      00337000
RAVT     EQU   @04                                                      00338000
RTRM     EQU   @08                                                      00339000
REG00    EQU   @00                                                      00340000
RPARM    EQU   @01                                                      00341000
REG10    EQU   @10                                                      00342000
RBASE    EQU   @12                                                      00343000
RSAVE    EQU   @13                                                      00344000
REG15    EQU   @15                                                      00345000
IEDQAVTD EQU   0                                                        00346000
AVTSAVEX EQU   IEDQAVTD+288                                             00347000
@NM00003 EQU   IEDQAVTD+388                                             00348000
AVTCKFLG EQU   @NM00003                                                 00349000
AVTBASE  EQU   IEDQAVTD+412                                             00350000
AVTPKF   EQU   AVTBASE                                                  00351000
AVTRNMPT EQU   IEDQAVTD+424                                             00352000
AVTHG02  EQU   IEDQAVTD+528                                             00353000
AVTDISP  EQU   IEDQAVTD+552                                             00354000
AVTHD    EQU   IEDQAVTD+556                                             00355000
AVTSCOPT EQU   AVTHD                                                    00356000
AVTSAVTP EQU   IEDQAVTD+612                                             00357000
AVTSAVTF EQU   AVTSAVTP                                                 00358000
AVTCKPEL EQU   IEDQAVTD+652                                             00359000
AVTCKRMV EQU   AVTCKPEL                                                 00360000
AVTCKELF EQU   IEDQAVTD+680                                             00361000
AVTCKBYT EQU   IEDQAVTD+691                                             00362000
AVTHG01  EQU   IEDQAVTD+692                                             00363000
AVTCKLNK EQU   IEDQAVTD+696                                             00364000
AVTCRELE EQU   IEDQAVTD+708                                             00365000
AVTCCELE EQU   AVTCRELE                                                 00366000
AVTCLRHI EQU   IEDQAVTD+716                                             00367000
AVTADBUF EQU   IEDQAVTD+720                                             00368000
AVTSYSER EQU   IEDQAVTD+728                                             00369000
AVTCKPQB EQU   IEDQAVTD+804                                             00370000
AVTCKPTB EQU   AVTCKPQB                                                 00371000
AVTCKPEC EQU   AVTCKPQB+4                                               00372000
AVTCKPCC EQU   AVTCKPEC                                                 00373000
AVTOPCQB EQU   IEDQAVTD+816                                             00374000
AVTOPCOB EQU   AVTOPCQB                                                 00375000
AVTOPCEC EQU   AVTOPCQB+4                                               00376000
AVTOPCCC EQU   AVTOPCEC                                                 00377000
AVTOLTQB EQU   IEDQAVTD+828                                             00378000
AVTCWFL1 EQU   IEDQAVTD+924                                             00379000
AVTCWFL2 EQU   IEDQAVTD+925                                             00380000
AVTSUBT  EQU   IEDQAVTD+948                                             00381000
AVTIOTR  EQU   IEDQAVTD+949                                             00382000
AVTBIT1  EQU   IEDQAVTD+1050                                            00383000
AVTBIT2  EQU   IEDQAVTD+1051                                            00384000
AVTBIT3  EQU   IEDQAVTD+1052                                            00385000
AVTBIT4  EQU   IEDQAVTD+1136                                            00386000
@NM00083 EQU   IEDQAVTD+1232                                            00387000
IEDQAPTR EQU   0                                                        00388000
IEDNSVTD EQU   0                                                        00389000
SAVTDIAG EQU   IEDNSVTD                                                 00390000
SAVTDIAF EQU   SAVTDIAG                                                 00391000
SAVTLUSQ EQU   IEDNSVTD+88                                              00392000
SAVTXTRQ EQU   IEDNSVTD+164                                             00393000
SAVTTCPU EQU   IEDNSVTD+238                                             00394000
SAVTSCPT EQU   SAVTTCPU                                                 00395000
SAVTZELM EQU   IEDNSVTD+270                                             00396000
SAVTRDRV EQU   IEDNSVTD+284                                             00397000
SAVTCKQB EQU   IEDNSVTD+300                                             00398000
SAVTCKTB EQU   SAVTCKQB                                                 00399000
SAVTCKEC EQU   SAVTCKQB+4                                               00400000
SAVTCKCC EQU   SAVTCKEC                                                 00401000
IEDQOPCE EQU   0                                                        00402000
OCELEM   EQU   IEDQOPCE+4                                               00403000
OCUNIT   EQU   IEDQOPCE+8                                               00404000
OCRUDEST EQU   OCUNIT                                                   00405000
OCCKPKEY EQU   OCRUDEST                                                 00406000
OCSCAN   EQU   OCCKPKEY                                                 00407000
OCOPTCDE EQU   IEDQOPCE+12                                              00408000
OCSWITCH EQU   IEDQOPCE+13                                              00409000
OCFLAG   EQU   IEDQOPCE+14                                              00410000
OCRESP   EQU   OCFLAG                                                   00411000
@NM00106 EQU   IEDQOPCE+16                                              00412000
OCDEST   EQU   @NM00106                                                 00413000
OCREQVAL EQU   OCDEST+1                                                 00414000
OCTRMTBL EQU   IEDQOPCE+20                                              00415000
OCLINENO EQU   IEDQOPCE+22                                              00416000
OCTIOT   EQU   OCLINENO                                                 00417000
OCWTGB   EQU   OCTIOT                                                   00418000
OCTRUNIT EQU   IEDQOPCE+24                                              00419000
OCRSID   EQU   OCTRUNIT                                                 00420000
OCALSTAT EQU   OCRSID                                                   00421000
OCPARM   EQU   IEDQOPCE+28                                              00422000
OCWTG    EQU   IEDQOPCE+30                                              00423000
OCBACKUP EQU   IEDQOPCE+32                                              00424000
OCMODNME EQU   IEDQOPCE+40                                              00425000
OCIPLWA  EQU   OCMODNME                                                 00426000
OCCKDATA EQU   IEDQOPCE+48                                              00427000
OCRSTGTM EQU   OCCKDATA                                                 00428000
IEDQOPCN EQU   0                                                        00429000
OCLDNME  EQU   IEDQOPCN                                                 00430000
OCLINTTE EQU   OCLDNME                                                  00431000
OCREQFLG EQU   OCLINTTE+2                                               00432000
OCPREFLG EQU   OCLINTTE+3                                               00433000
IEDQOPCD EQU   0                                                        00434000
OPCAVTPT EQU   IEDQOPCD+8                                               00435000
OPCCOPCE EQU   IEDQOPCD+12                                              00436000
OPCPSTWT EQU   IEDQOPCD+48                                              00437000
OPCSAVE  EQU   IEDQOPCD+56                                              00438000
OPCWORK  EQU   IEDQOPCD+140                                             00439000
OPCAQCTL EQU   IEDQOPCD+180                                             00440000
OPCXCTL  EQU   IEDQOPCD+204                                             00441000
OPCLDNME EQU   IEDQOPCD+212                                             00442000
OPCMODID EQU   OPCLDNME+3                                               00443000
OPCGETBF EQU   IEDQOPCD+276                                             00444000
OPCSPEC  EQU   IEDQOPCD+300                                             00445000
OPCPWCOB EQU   IEDQOPCD+368                                             00446000
OPCPWQCB EQU   OPCPWCOB                                                 00447000
OPCPWECB EQU   OPCPWCOB+4                                               00448000
IEDPRUQD EQU   0                                                        00449000
PRUTTCIN EQU   IEDPRUQD                                                 00450000
PRUDATCT EQU   IEDPRUQD+2                                               00451000
PRUTIC   EQU   IEDPRUQD+8                                               00452000
PRUDATA  EQU   IEDPRUQD+12                                              00453000
IEDPRUQP EQU   0                                                        00454000
IEDPRUND EQU   0                                                        00455000
PRURHTH  EQU   IEDPRUND                                                 00456000
PRURH    EQU   PRURHTH                                                  00457000
PRURHFG0 EQU   PRURH                                                    00458000
PRURHSDI EQU   PRURHFG0                                                 00459000
PRURHFG1 EQU   PRURH+1                                                  00460000
PRURHFG2 EQU   PRURH+2                                                  00461000
PRUTH    EQU   PRURHTH+3                                                00462000
PRUFIDN  EQU   PRUTH                                                    00463000
IEDREQD  EQU   0                                                        00464000
REQTYPE  EQU   IEDREQD                                                  00465000
REQQCBA  EQU   IEDREQD+1                                                00466000
REQPRI   EQU   IEDREQD+4                                                00467000
REQRPRI  EQU   IEDREQD+8                                                00468000
REQRQCBA EQU   IEDREQD+9                                                00469000
REQROUTE EQU   IEDREQD+12                                               00470000
REQRCDS  EQU   IEDREQD+14                                               00471000
REQDATA  EQU   IEDREQD+16                                               00472000
IEDSIBD  EQU   0                                                        00473000
SIBSESSN EQU   IEDSIBD+10                                               00474000
SIBPACIN EQU   IEDSIBD+11                                               00475000
SIBSEQN  EQU   IEDSIBD+12                                               00476000
SIBSTAT1 EQU   IEDSIBD+16                                               00477000
SIBSTAT2 EQU   IEDSIBD+17                                               00478000
SIBBIND  EQU   IEDSIBD+20                                               00479000
SIBBIND1 EQU   SIBBIND                                                  00480000
SIBBIND2 EQU   SIBBIND+1                                                00481000
SIBBIND3 EQU   SIBBIND+2                                                00482000
SIBSTAT0 EQU   IEDSIBD+23                                               00483000
IEDQTRM  EQU   0                                                        00484000
TRMSTATE EQU   IEDQTRM                                                  00485000
TRMLOG   EQU   TRMSTATE                                                 00486000
TRMINSEQ EQU   IEDQTRM+4                                                00487000
TLISTCNT EQU   TRMINSEQ                                                 00488000
TRMOUTSQ EQU   IEDQTRM+6                                                00489000
TLISTEN  EQU   TRMOUTSQ                                                 00490000
TRMDSORG EQU   TLISTEN                                                  00491000
TRMALTD  EQU   IEDQTRM+8                                                00492000
TRMDEVFL EQU   IEDQTRM+10                                               00493000
TRMSTAT  EQU   IEDQTRM+12                                               00494000
IEDQTPTR EQU   0                                                        00495000
IEDNTRM  EQU   0                                                        00496000
TRMBYTE4 EQU   IEDNTRM                                                  00497000
TRMBYTE3 EQU   IEDNTRM+1                                                00498000
TRMBYTE2 EQU   IEDNTRM+2                                                00499000
TRMINPG  EQU   TRMBYTE2                                                 00500000
TRMBYTE1 EQU   IEDNTRM+3                                                00501000
TRMSCPRQ EQU   TRMBYTE1                                                 00502000
TRMBYTE0 EQU   IEDNTRM+6                                                00503000
TRMSIBPT EQU   IEDNTRM+7                                                00504000
ALLOCBUF EQU   0                                                        00505000
IEDQTNT  EQU   0                                                        00506000
POSTWAIT EQU   0                                                        00507000
OCCKPKY1 EQU   OCCKPKEY                                                 00508000
OCCKPTYP EQU   OCCKPKY1                                                 00509000
OCICACTN EQU   OCMODNME                                                 00510000
OCICDADR EQU   OCICACTN                                                 00511000
OCICSW   EQU   OCICDADR+3                                               00512000
OPCAQWD  EQU   OPCAQCTL                                                 00513000
OPCAQWD1 EQU   OPCAQWD                                                  00514000
OPCAQWD2 EQU   OPCAQWD+4                                                00515000
OPCAQWD3 EQU   OPCAQWD+8                                                00516000
REQLDATA EQU   REQDATA                                                  00517000
REQSDATA EQU   REQDATA                                                  00518000
REQSTTE  EQU   REQSDATA                                                 00519000
REQSTNT  EQU   REQSDATA+4                                               00520000
TRMPRE1  EQU   TRMBYTE4                                                 00521000
TRMNCP1  EQU   TRMBYTE4                                                 00522000
TRMPRE   EQU   TRMBYTE3                                                 00523000
TRMNCP   EQU   TRMBYTE3                                                 00524000
TRMPU    EQU   TRMBYTE3                                                 00525000
TRMLU    EQU   TRMBYTE3                                                 00526000
TRMLINK  EQU   TRMBYTE3                                                 00527000
OCCIB    EQU   OCREQVAL                                                 00528000
TRMOPT   EQU   IEDQTRM+20                                               00529000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00530000
@NM00146 EQU   TRMLINK                                                  00531000
TRMLSTAT EQU   TRMLINK                                                  00532000
TRMLINT  EQU   TRMLINK                                                  00533000
TRMEPMOD EQU   TRMLINK                                                  00534000
TRMLULOG EQU   TRMLU                                                    00535000
TRMINERR EQU   TRMLU                                                    00536000
TRMLUREQ EQU   TRMLU                                                    00537000
TRMSESRQ EQU   TRMLU                                                    00538000
TRMTDIFF EQU   TRMLU                                                    00539000
TRMLUTM  EQU   TRMLU                                                    00540000
TRMLUIT  EQU   TRMLU                                                    00541000
TRMAUTO  EQU   TRMLU                                                    00542000
TRMPCONT EQU   TRMPU                                                    00543000
@NM00145 EQU   TRMPU                                                    00544000
TRMNCONT EQU   TRMNCP                                                   00545000
TRMQUCKN EQU   TRMNCP                                                   00546000
TRMSLOWN EQU   TRMNCP                                                   00547000
TRMSYGEN EQU   TRMNCP                                                   00548000
TRMNCPCL EQU   TRMNCP                                                   00549000
TRMIPLDM EQU   TRMNCP                                                   00550000
TRMINOUT EQU   TRMPRE                                                   00551000
TRMRDOUT EQU   TRMPRE                                                   00552000
TRMNLOUT EQU   TRMPRE                                                   00553000
TRMWROUT EQU   TRMPRE                                                   00554000
TRMASNXI EQU   TRMPRE                                                   00555000
TRMSTMM  EQU   TRMPRE                                                   00556000
TRMCMODE EQU   TRMPRE                                                   00557000
TRMSTPND EQU   TRMPRE                                                   00558000
@NM00144 EQU   TRMNCP1                                                  00559000
TRMINOP  EQU   TRMNCP1                                                  00560000
TRMLYNCH EQU   TRMPRE1                                                  00561000
TRMSPOUT EQU   TRMPRE1                                                  00562000
TRMERLCK EQU   TRMPRE1                                                  00563000
TRMQNPL  EQU   TRMPRE1                                                  00564000
TRMSPACT EQU   TRMPRE1                                                  00565000
TRMOCNI  EQU   TRMPRE1                                                  00566000
TRMSESSN EQU   TRMPRE1                                                  00567000
TRMCONT  EQU   TRMPRE1                                                  00568000
REQLTNT  EQU   REQLDATA                                                 00569000
OPCAQLST EQU   OPCAQWD3+1                                               00570000
OPCAQRQ3 EQU   OPCAQWD3                                                 00571000
OPCAQSEC EQU   OPCAQWD2+1                                               00572000
OPCAQRQ2 EQU   OPCAQWD2                                                 00573000
OPCAQFST EQU   OPCAQWD1+1                                               00574000
OPCAQREQ EQU   OPCAQWD1                                                 00575000
OCICINAC EQU   OCICSW                                                   00576000
@NM00112 EQU   OCICSW                                                   00577000
OCICATST EQU   OCICDADR+1                                               00578000
OCICTYPE EQU   OCICDADR                                                 00579000
@NM00111 EQU   OCCKPKY1                                                 00580000
OCCKPENV EQU   OCCKPKY1                                                 00581000
OCCKPRST EQU   OCCKPTYP                                                 00582000
OCCKPNCP EQU   OCCKPTYP                                                 00583000
OCCKPINC EQU   OCCKPTYP                                                 00584000
TRMSUBST EQU   IEDNTRM+12                                               00585000
TRMTYPE  EQU   IEDNTRM+11                                               00586000
TRMRLMCT EQU   IEDNTRM+10                                               00587000
TRMCOHTG EQU   TRMSIBPT+1                                               00588000
TRMGPCNT EQU   TRMSIBPT                                                 00589000
TRMBUFRD EQU   TRMBYTE0                                                 00590000
TRMSNA   EQU   TRMBYTE0                                                 00591000
TRMGP    EQU   TRMBYTE0                                                 00592000
TRMDIAL  EQU   TRMBYTE0                                                 00593000
@NM00143 EQU   TRMBYTE0                                                 00594000
TRMOUTPT EQU   TRMBYTE0                                                 00595000
TRMINPUT EQU   TRMBYTE0                                                 00596000
TRMUDEF  EQU   TRMBYTE0                                                 00597000
TRMCOHRT EQU   IEDNTRM+4                                                00598000
TRMSTOTE EQU   TRMBYTE1                                                 00599000
TRMCKPRN EQU   TRMBYTE1                                                 00600000
TRMTSATN EQU   TRMBYTE1                                                 00601000
TRMTRACE EQU   TRMBYTE1                                                 00602000
TRMSWBCK EQU   TRMBYTE1                                                 00603000
TRMAUTOC EQU   TRMBYTE1                                                 00604000
TRMINPTP EQU   TRMBYTE1                                                 00605000
TRMWTNEG EQU   TRMSCPRQ                                                 00606000
TRMWRBRK EQU   TRMBYTE2                                                 00607000
TRMNOSND EQU   TRMBYTE2                                                 00608000
TRMPREP  EQU   TRMBYTE2                                                 00609000
TRMGPACT EQU   TRMBYTE2                                                 00610000
TRMANDL  EQU   TRMBYTE2                                                 00611000
TRMCLOSN EQU   TRMINPG                                                  00612000
TRMREMB  EQU   TRMBYTE2                                                 00613000
TRMRSACT EQU   TRMBYTE2                                                 00614000
TRMOPTBL EQU   IEDQTRM+18                                               00615000
TRMOPNO  EQU   IEDQTRM+17                                               00616000
TRMCHCIN EQU   IEDQTRM+16                                               00617000
TRMSENSE EQU   TRMSTAT+3                                                00618000
TRMTEMPR EQU   TRMSTAT+2                                                00619000
TRMSIO   EQU   TRMSTAT                                                  00620000
@NM00142 EQU   TRMDEVFL+1                                               00621000
TRMTPIN  EQU   TRMDEVFL+1                                               00622000
TRMNCPI  EQU   TRMDEVFL+1                                               00623000
TRMRNTRM EQU   TRMDEVFL+1                                               00624000
@NM00141 EQU   TRMDEVFL+1                                               00625000
TRMLMD   EQU   TRMDEVFL+1                                               00626000
TRMCONC  EQU   TRMDEVFL+1                                               00627000
TRMTSOB  EQU   TRMDEVFL                                                 00628000
TRMBFDY  EQU   TRMDEVFL                                                 00629000
TRMTBLK  EQU   TRMDEVFL                                                 00630000
TRMSBLK  EQU   TRMDEVFL                                                 00631000
TRMBLKS  EQU   TRMDEVFL                                                 00632000
TRMADDC  EQU   TRMDEVFL                                                 00633000
TRMDDIG  EQU   TRMDEVFL                                                 00634000
TRMBUFS  EQU   TRMDEVFL                                                 00635000
TRMPRILK EQU   TRMALTD                                                  00636000
TRMLGB   EQU   TRMDSORG                                                 00637000
TRMUTERM EQU   TLISTCNT                                                 00638000
TRMDESTQ EQU   IEDQTRM+1                                                00639000
TRMSCNYN EQU   TRMSTATE                                                 00640000
TRMOPTFN EQU   TRMSTATE                                                 00641000
TRMHELDN EQU   TRMSTATE                                                 00642000
TRMACPTN EQU   TRMSTATE                                                 00643000
TRMPREF  EQU   TRMSTATE                                                 00644000
TRMPROC  EQU   TRMLOG                                                   00645000
TRMLIST  EQU   TRMLOG                                                   00646000
TRMLINE  EQU   TRMSTATE                                                 00647000
SIBLUTYP EQU   SIBSTAT0                                                 00648000
SIBCD    EQU   SIBSTAT0                                                 00649000
@NM00140 EQU   SIBBIND3                                                 00650000
SIBCRES  EQU   SIBBIND3                                                 00651000
SIBSPKR  EQU   SIBBIND3                                                 00652000
SIBRECOV EQU   SIBBIND3                                                 00653000
SIBFMODE EQU   SIBBIND3                                                 00654000
SIBALT   EQU   SIBBIND2                                                 00655000
SIBBTERM EQU   SIBBIND2                                                 00656000
SIBBRACK EQU   SIBBIND2                                                 00657000
SIBFMUSE EQU   SIBBIND2                                                 00658000
SIBSEBI  EQU   SIBBIND2                                                 00659000
SIBSCMP  EQU   SIBBIND2                                                 00660000
SIBSEXC  EQU   SIBBIND2                                                 00661000
SIBSDEF  EQU   SIBBIND2                                                 00662000
SIBSRQM  EQU   SIBBIND1                                                 00663000
SIBSCHNG EQU   SIBBIND1                                                 00664000
SIBPEBI  EQU   SIBBIND1                                                 00665000
SIBPCMP  EQU   SIBBIND1                                                 00666000
SIBPEXC  EQU   SIBBIND1                                                 00667000
SIBPDEF  EQU   SIBBIND1                                                 00668000
SIBPRQM  EQU   SIBBIND1                                                 00669000
SIBPCHN  EQU   SIBBIND1                                                 00670000
SIBFMPRO EQU   IEDSIBD+19                                               00671000
SIBTSPRO EQU   IEDSIBD+18                                               00672000
@NM00139 EQU   SIBSTAT2                                                 00673000
SIBDACLU EQU   SIBSTAT2                                                 00674000
SIBRDSCN EQU   SIBSTAT2                                                 00675000
SIBTERM  EQU   SIBSTAT2                                                 00676000
SIBUSS   EQU   SIBSTAT2                                                 00677000
SIBBSTAT EQU   SIBSTAT1                                                 00678000
SIBRTRP  EQU   SIBSTAT1                                                 00679000
@NM00138 EQU   SIBSTAT1                                                 00680000
SIBRQEND EQU   SIBSTAT1                                                 00681000
SIBRQSHT EQU   SIBSTAT1                                                 00682000
SIBSEQO  EQU   SIBSEQN+2                                                00683000
SIBSEQI  EQU   SIBSEQN                                                  00684000
SIBNCNT  EQU   SIBPACIN                                                 00685000
SIBMCNT  EQU   SIBPACIN                                                 00686000
SIBDSTAT EQU   SIBSESSN                                                 00687000
SIBSSTAT EQU   SIBSESSN                                                 00688000
SIBINBIU EQU   SIBSESSN                                                 00689000
SIBSHUTC EQU   SIBSESSN                                                 00690000
SIBLGOFF EQU   SIBSESSN                                                 00691000
SIBINDEX EQU   IEDSIBD+8                                                00692000
SIBCHAIN EQU   IEDSIBD+4                                                00693000
SIBRUSEG EQU   IEDSIBD                                                  00694000
REQRCD2  EQU   REQRCDS+1                                                00695000
REQRCD1  EQU   REQRCDS                                                  00696000
REQSWTCH EQU   REQROUTE+1                                               00697000
REQFLAG  EQU   REQROUTE                                                 00698000
REQLINK  EQU   IEDREQD+5                                                00699000
@NM00137 EQU   IEDPRUND+4                                               00700000
PRUTHEFI EQU   PRUFIDN                                                  00701000
PRUTHUSS EQU   PRUFIDN                                                  00702000
PRUTHEIU EQU   PRUFIDN                                                  00703000
PRUTHBIU EQU   PRUFIDN                                                  00704000
PRUTHTYE EQU   PRUFIDN                                                  00705000
@NM00136 EQU   PRURHFG2                                                 00706000
PRURHCSI EQU   PRURHFG2                                                 00707000
@NM00135 EQU   PRURHFG2                                                 00708000
PRURHCDI EQU   PRURHFG2                                                 00709000
PRURHEB  EQU   PRURHFG2                                                 00710000
PRURHBB  EQU   PRURHFG2                                                 00711000
PRURHPI  EQU   PRURHFG1                                                 00712000
@NM00134 EQU   PRURHFG1                                                 00713000
PRURHER  EQU   PRURHFG1                                                 00714000
PRURHDR2 EQU   PRURHFG1                                                 00715000
@NM00133 EQU   PRURHFG1                                                 00716000
PRURHDR1 EQU   PRURHFG1                                                 00717000
PRURHEC  EQU   PRURHFG0                                                 00718000
PRURHBC  EQU   PRURHFG0                                                 00719000
PRURHFI  EQU   PRURHFG0                                                 00720000
@NM00132 EQU   PRURHFG0                                                 00721000
PRURUCAT EQU   PRURHFG0                                                 00722000
PRURHTYP EQU   PRURHFG0                                                 00723000
PRUNUNIT EQU   PRUTIC+1                                                 00724000
@NM00131 EQU   PRUTIC                                                   00725000
@NM00130 EQU   IEDPRUQD+4                                               00726000
OPCBOTTM EQU   IEDQOPCD+1184                                            00727000
@NM00129 EQU   IEDQOPCD+1100                                            00728000
@NM00128 EQU   IEDQOPCD+948                                             00729000
@NM00127 EQU   IEDQOPCD+940                                             00730000
@NM00126 EQU   IEDQOPCD+380                                             00731000
@NM00125 EQU   OPCPWCOB+8                                               00732000
@NM00124 EQU   OPCPWECB+1                                               00733000
OPCPWCCC EQU   OPCPWECB                                                 00734000
OPCPWCHN EQU   OPCPWQCB+1                                               00735000
OPCPWVTO EQU   OPCPWQCB                                                 00736000
OPCWAITV EQU   IEDQOPCD+364                                             00737000
OPCTOTCK EQU   IEDQOPCD+360                                             00738000
OPCAPXTL EQU   IEDQOPCD+356                                             00739000
OPCDECR  EQU   IEDQOPCD+352                                             00740000
OPCBUFWT EQU   IEDQOPCD+348                                             00741000
OPCWRKSP EQU   IEDQOPCD+320                                             00742000
OPCADGOT EQU   IEDQOPCD+318                                             00743000
OPCRQCNT EQU   IEDQOPCD+316                                             00744000
OPPOLSTP EQU   IEDQOPCD+312                                             00745000
OPCCKCIB EQU   IEDQOPCD+308                                             00746000
OPCEND   EQU   IEDQOPCD+307                                             00747000
OPCSTCBS EQU   IEDQOPCD+306                                             00748000
OPCHNEND EQU   IEDQOPCD+302                                             00749000
OPCOQSW  EQU   IEDQOPCD+301                                             00750000
@NM00123 EQU   OPCSPEC                                                  00751000
@NM00122 EQU   OPCSPEC                                                  00752000
@NM00121 EQU   OPCSPEC                                                  00753000
@NM00120 EQU   OPCSPEC                                                  00754000
OPCFRMCA EQU   OPCSPEC                                                  00755000
OPCRSTRT EQU   OPCSPEC                                                  00756000
OPCPART  EQU   OPCSPEC                                                  00757000
OPCALTD  EQU   OPCSPEC                                                  00758000
OPCBFEND EQU   IEDQOPCD+296                                             00759000
OPCBFIRS EQU   IEDQOPCD+292                                             00760000
OPCAVBUF EQU   IEDQOPCD+290                                             00761000
OPCIPLCT EQU   IEDQOPCD+289                                             00762000
OPCCLNTS EQU   IEDQOPCD+288                                             00763000
OPCHA8   EQU   IEDQOPCD+286                                             00764000
OPCBFREQ EQU   IEDQOPCD+284                                             00765000
OPCFREBF EQU   IEDQOPCD+280                                             00766000
OPCNEXT  EQU   IEDQOPCD+272                                             00767000
OPCFMDFC EQU   IEDQOPCD+268                                             00768000
OPCSCNC  EQU   IEDQOPCD+264                                             00769000
OPCHORTG EQU   IEDQOPCD+260                                             00770000
OPCHORT  EQU   IEDQOPCD+256                                             00771000
OPCCKPTL EQU   IEDQOPCD+252                                             00772000
OPCCKPTF EQU   IEDQOPCD+248                                             00773000
OPCWAITA EQU   IEDQOPCD+244                                             00774000
OPCWAITR EQU   IEDQOPCD+240                                             00775000
OPCWAITP EQU   IEDQOPCD+236                                             00776000
OPCWAITO EQU   IEDQOPCD+232                                             00777000
OPCWAITN EQU   IEDQOPCD+228                                             00778000
OPCWAITL EQU   IEDQOPCD+224                                             00779000
OPCWAITC EQU   IEDQOPCD+220                                             00780000
@NM00119 EQU   OPCLDNME+5                                               00781000
@NM00118 EQU   OPCLDNME                                                 00782000
OPCWAIT  EQU   IEDQOPCD+192                                             00783000
OPCCKERB EQU   IEDQOPCD+164                                             00784000
OPCBFERB EQU   IEDQOPCD+148                                             00785000
OPCFLAG2 EQU   IEDQOPCD+147                                             00786000
OPCFLAG1 EQU   IEDQOPCD+146                                             00787000
OPCWRKSZ EQU   IEDQOPCD+144                                             00788000
OPCRSAVE EQU   IEDQOPCD+132                                             00789000
OPCQCBAD EQU   IEDQOPCD+128                                             00790000
OPCTRMWA EQU   IEDQOPCD+52                                              00791000
OPCTNTEA EQU   IEDQOPCD+44                                              00792000
OPCPGCK  EQU   IEDQOPCD+40                                              00793000
OPCLCB   EQU   IEDQOPCD+36                                              00794000
@NM00117 EQU   IEDQOPCD+32                                              00795000
OPCIPLAD EQU   IEDQOPCD+28                                              00796000
OPCTOFLK EQU   IEDQOPCD+24                                              00797000
OPCOPTLK EQU   IEDQOPCD+20                                              00798000
OPCDCBLK EQU   IEDQOPCD+16                                              00799000
OPCDOUBL EQU   IEDQOPCD                                                 00800000
@NM00116 EQU   OCLDNME+4                                                00801000
@NM00115 EQU   OCPREFLG                                                 00802000
OCTOTEP  EQU   OCPREFLG                                                 00803000
OCREPOST EQU   OCPREFLG                                                 00804000
OCRSPSNT EQU   OCPREFLG                                                 00805000
OCBFREQ  EQU   OCPREFLG                                                 00806000
OCIDLE   EQU   OCREQFLG                                                 00807000
OCFORCE  EQU   OCREQFLG                                                 00808000
OCDCARD  EQU   OCREQFLG                                                 00809000
OCPARTAL EQU   OCREQFLG                                                 00810000
OCADNCP  EQU   OCREQFLG                                                 00811000
@NM00114 EQU   OCREQFLG                                                 00812000
@NM00113 EQU   OCREQFLG                                                 00813000
OCFLUSHZ EQU   OCREQFLG                                                 00814000
OCRESPCT EQU   OCLINTTE                                                 00815000
OCCKPTWA EQU   OCCKDATA+4                                               00816000
@NM00110 EQU   OCRSTGTM+2                                               00817000
OCCKDAT2 EQU   OCRSTGTM+1                                               00818000
OCCKDAT1 EQU   OCRSTGTM                                                 00819000
OCPTRSAV EQU   OCMODNME+4                                               00820000
OCPUADR  EQU   OCIPLWA+2                                                00821000
OCWTGSAV EQU   OCIPLWA                                                  00822000
OCDVRDCT EQU   OCBACKUP+6                                               00823000
OCNCP    EQU   OCBACKUP+4                                               00824000
OCBUFGOT EQU   OCBACKUP+2                                               00825000
OCBUFNED EQU   OCBACKUP                                                 00826000
OCRESNUM EQU   OCPARM                                                   00827000
OCSEQ    EQU   OCTRUNIT+2                                               00828000
@NM00109 EQU   OCRSID+1                                                 00829000
OCNONE   EQU   OCALSTAT                                                 00830000
OCSOME   EQU   OCALSTAT                                                 00831000
OCALLFLG EQU   OCALSTAT                                                 00832000
OCACTREQ EQU   OCALSTAT                                                 00833000
OCREDRVE EQU   OCALSTAT                                                 00834000
OCSEQIND EQU   OCALSTAT                                                 00835000
@NM00108 EQU   OCALSTAT                                                 00836000
OCRENTRD EQU   OCALSTAT                                                 00837000
@NM00107 EQU   @NM00106+2                                               00838000
OCCONID  EQU   OCDEST                                                   00839000
OCRLN    EQU   IEDQOPCE+15                                              00840000
OCATTACH EQU   OCFLAG                                                   00841000
OCSSCP   EQU   OCFLAG                                                   00842000
OCOUTPUT EQU   OCFLAG                                                   00843000
OCLINE   EQU   OCFLAG                                                   00844000
OCMPP    EQU   OCFLAG                                                   00845000
OCTOTE   EQU   OCFLAG                                                   00846000
OCCONSOL EQU   OCFLAG                                                   00847000
@NM00105 EQU   OCSWITCH                                                 00848000
OCQUCKN  EQU   OCSWITCH                                                 00849000
OCPRIFLG EQU   OCOPTCDE                                                 00850000
@NM00104 EQU   OCRUDEST+1                                               00851000
@NM00103 EQU   OCSCAN                                                   00852000
OCNOTUCB EQU   OCSCAN                                                   00853000
OCNONAME EQU   OCSCAN                                                   00854000
OCALLRLN EQU   OCSCAN                                                   00855000
OCDDNAME EQU   OCSCAN                                                   00856000
OCDDNRLN EQU   OCSCAN                                                   00857000
OCADDR   EQU   OCSCAN                                                   00858000
OCELMPTR EQU   OCELEM+1                                                 00859000
OCELMPRI EQU   OCELEM                                                   00860000
OCLINK   EQU   IEDQOPCE                                                 00861000
SAVTBITN EQU   IEDNSVTD+312                                             00862000
@NM00102 EQU   SAVTCKQB+8                                               00863000
@NM00101 EQU   SAVTCKEC+1                                               00864000
@NM00100 EQU   SAVTCKCC                                                 00865000
SAVTCKPO EQU   SAVTCKCC                                                 00866000
SAVTCKWA EQU   SAVTCKCC                                                 00867000
SAVTCKCH EQU   SAVTCKTB+1                                               00868000
SAVTCKVT EQU   SAVTCKTB                                                 00869000
@NM00099 EQU   IEDNSVTD+297                                             00870000
SAVTRDFG EQU   SAVTRDRV+12                                              00871000
@NM00098 EQU   SAVTRDRV+5                                               00872000
SAVTRDPY EQU   SAVTRDRV+4                                               00873000
SAVTRDQB EQU   SAVTRDRV+1                                               00874000
SAVTRDKY EQU   SAVTRDRV                                                 00875000
SAVTNID  EQU   IEDNSVTD+280                                             00876000
SAVTDVAS EQU   IEDNSVTD+276                                             00877000
SAVTPLSZ EQU   IEDNSVTD+274                                             00878000
@NM00097 EQU   IEDNSVTD+273                                             00879000
SAVTSUBL EQU   IEDNSVTD+272                                             00880000
@NM00096 EQU   SAVTZELM+1                                               00881000
SAVTSUBM EQU   SAVTZELM                                                 00882000
SAVTMHDX EQU   IEDNSVTD+268                                             00883000
SAVTNAT1 EQU   IEDNSVTD+266                                             00884000
SAVTSH20 EQU   IEDNSVTD+264                                             00885000
SAVTLCBS EQU   IEDNSVTD+260                                             00886000
SAVTRNMP EQU   IEDNSVTD+256                                             00887000
SAVTTNTX EQU   IEDNSVTD+252                                             00888000
SAVTNAX  EQU   IEDNSVTD+248                                             00889000
SAVTSUBV EQU   IEDNSVTD+247                                             00890000
SAVTSUBA EQU   IEDNSVTD+246                                             00891000
SAVTSIBC EQU   IEDNSVTD+244                                             00892000
SAVTBSM  EQU   IEDNSVTD+240                                             00893000
SAVTRQTG EQU   IEDNSVTD+236                                             00894000
SAVTRQCH EQU   IEDNSVTD+232                                             00895000
SAVTMAND EQU   IEDNSVTD+228                                             00896000
SAVTSPLN EQU   IEDNSVTD+224                                             00897000
SAVTNADL EQU   IEDNSVTD+222                                             00898000
SAVTNATL EQU   IEDNSVTD+220                                             00899000
SAVTMHTB EQU   IEDNSVTD+216                                             00900000
SAVTSSMH EQU   IEDNSVTD+212                                             00901000
SAVTQRS  EQU   IEDNSVTD+208                                             00902000
SAVTRQIN EQU   IEDNSVTD+204                                             00903000
SAVTDFCO EQU   IEDNSVTD+200                                             00904000
SAVTSAO  EQU   IEDNSVTD+196                                             00905000
SAVTSARI EQU   IEDNSVTD+192                                             00906000
SAVTSAC  EQU   IEDNSVTD+188                                             00907000
SAVTSAI  EQU   IEDNSVTD+184                                             00908000
SAVTCSCI EQU   IEDNSVTD+180                                             00909000
SAVTSSRP EQU   IEDNSVTD+176                                             00910000
SAVTSSRQ EQU   IEDNSVTD+172                                             00911000
SAVTSCLU EQU   IEDNSVTD+168                                             00912000
SAVTMVBF EQU   IEDNSVTD+160                                             00913000
@NM00095 EQU   IEDNSVTD+148                                             00914000
SAVTIPCQ EQU   IEDNSVTD+144                                             00915000
@NM00094 EQU   IEDNSVTD+136                                             00916000
SAVTXFMI EQU   IEDNSVTD+132                                             00917000
@NM00093 EQU   IEDNSVTD+124                                             00918000
SAVTXFMO EQU   IEDNSVTD+120                                             00919000
@NM00092 EQU   IEDNSVTD+116                                             00920000
SAVTSSSR EQU   IEDNSVTD+112                                             00921000
SAVTSCPQ EQU   IEDNSVTD+108                                             00922000
SAVTSLCB EQU   IEDNSVTD+104                                             00923000
SAVTLUSR EQU   IEDNSVTD+100                                             00924000
@NM00091 EQU   SAVTLUSQ+8                                               00925000
SAVTLUSP EQU   SAVTLUSQ+4                                               00926000
SAVTLUSB EQU   SAVTLUSQ                                                 00927000
@NM00090 EQU   IEDNSVTD+84                                              00928000
SAVTSAT  EQU   IEDNSVTD+80                                              00929000
SAVTNAT  EQU   IEDNSVTD+76                                              00930000
SAVTCLUP EQU   IEDNSVTD+72                                              00931000
SAVTPIUT EQU   IEDNSVTD+68                                              00932000
SAVTRNTA EQU   IEDNSVTD+64                                              00933000
SAVTDNIR EQU   IEDNSVTD+60                                              00934000
SAVTCNIR EQU   IEDNSVTD+56                                              00935000
SAVTFLDH EQU   IEDNSVTD+52                                              00936000
SAVTSRTN EQU   IEDNSVTD+48                                              00937000
SAVTSREQ EQU   IEDNSVTD+44                                              00938000
SAVTFAIL EQU   IEDNSVTD+42                                              00939000
SAVTSUSE EQU   IEDNSVTD+40                                              00940000
SAVTSIB  EQU   IEDNSVTD+36                                              00941000
SAVTPRTN EQU   IEDNSVTD+32                                              00942000
@NM00089 EQU   IEDNSVTD+28                                              00943000
SAVTWH20 EQU   IEDNSVTD+26                                              00944000
SAVTPWT  EQU   IEDNSVTD+24                                              00945000
SAVTPRTQ EQU   IEDNSVTD+20                                              00946000
SAVTPREQ EQU   IEDNSVTD+16                                              00947000
SAVTPH20 EQU   IEDNSVTD+14                                              00948000
SAVTPUSE EQU   IEDNSVTD+12                                              00949000
SAVTPLCB EQU   IEDNSVTD+8                                               00950000
SAVTPOOL EQU   IEDNSVTD+4                                               00951000
SAVTPRMT EQU   SAVTDIAF                                                 00952000
SAVTVIRT EQU   SAVTDIAF                                                 00953000
AVTCPBNO EQU   IEDQAVTD+1244                                            00954000
AVTHRESS EQU   IEDQAVTD+1243                                            00955000
@NM00088 EQU   IEDQAVTD+1242                                            00956000
@NM00087 EQU   IEDQAVTD+1241                                            00957000
@NM00086 EQU   IEDQAVTD+1240                                            00958000
@NM00085 EQU   IEDQAVTD+1237                                            00959000
@NM00084 EQU   IEDQAVTD+1236                                            00960000
AVTHRESE EQU   @NM00083                                                 00961000
AVTRADDR EQU   IEDQAVTD+1228                                            00962000
AVTNADDR EQU   IEDQAVTD+1224                                            00963000
AVTHRESN EQU   IEDQAVTD+1220                                            00964000
AVTVOLRN EQU   IEDQAVTD+1216                                            00965000
AVTTOTNN EQU   IEDQAVTD+1212                                            00966000
AVTTRCYN EQU   IEDQAVTD+1208                                            00967000
AVTRCTRN EQU   IEDQAVTD+1204                                            00968000
AVTNOVON EQU   IEDQAVTD+1200                                            00969000
AVTADEBN EQU   IEDQAVTD+1196                                            00970000
AVTVOLRR EQU   IEDQAVTD+1192                                            00971000
AVTTOTNR EQU   IEDQAVTD+1188                                            00972000
AVTTRCYR EQU   IEDQAVTD+1184                                            00973000
AVTRCTRR EQU   IEDQAVTD+1180                                            00974000
AVTNOVOR EQU   IEDQAVTD+1176                                            00975000
AVTADEBR EQU   IEDQAVTD+1172                                            00976000
AVTLODPT EQU   IEDQAVTD+1168                                            00977000
AVTIOBN  EQU   IEDQAVTD+1164                                            00978000
AVTIOBR  EQU   IEDQAVTD+1160                                            00979000
AVTCPBPT EQU   IEDQAVTD+1156                                            00980000
AVTFCPB  EQU   IEDQAVTD+1152                                            00981000
@NM00082 EQU   IEDQAVTD+1148                                            00982000
AVTINCPQ EQU   IEDQAVTD+1144                                            00983000
@NM00081 EQU   IEDQAVTD+1140                                            00984000
@NM00080 EQU   IEDQAVTD+1137                                            00985000
@NM00079 EQU   AVTBIT4                                                  00986000
@NM00078 EQU   AVTBIT4                                                  00987000
@NM00077 EQU   AVTBIT4                                                  00988000
@NM00076 EQU   AVTBIT4                                                  00989000
@NM00075 EQU   AVTBIT4                                                  00990000
@NM00074 EQU   AVTBIT4                                                  00991000
@NM00073 EQU   AVTBIT4                                                  00992000
AVTRUFTN EQU   AVTBIT4                                                  00993000
@NM00072 EQU   IEDQAVTD+1132                                            00994000
AVTNOBFQ EQU   IEDQAVTD+1128                                            00995000
@NM00071 EQU   IEDQAVTD+1124                                            00996000
AVTDKENQ EQU   IEDQAVTD+1120                                            00997000
@NM00070 EQU   IEDQAVTD+1116                                            00998000
AVTDKAPQ EQU   IEDQAVTD+1112                                            00999000
AVTCOPY  EQU   IEDQAVTD+1108                                            01000000
AVTIA    EQU   IEDQAVTD+1104                                            01001000
AVTFL    EQU   IEDQAVTD+1100                                            01002000
@NM00069 EQU   IEDQAVTD+1096                                            01003000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01004000
AVTTOTNC EQU   IEDQAVTD+1088                                            01005000
AVTCMAX  EQU   IEDQAVTD+1084                                            01006000
AVTCMIN  EQU   IEDQAVTD+1080                                            01007000
AVTHM02  EQU   IEDQAVTD+1076                                            01008000
AVTOPCIN EQU   IEDQAVTD+1074                                            01009000
AVTDCTLN EQU   IEDQAVTD+1072                                            01010000
AVTOPMSK EQU   IEDQAVTD+1068                                            01011000
AVTDDFT  EQU   IEDQAVTD+1064                                            01012000
AVTSTEAL EQU   IEDQAVTD+1060                                            01013000
AVTOPTN  EQU   IEDQAVTD+1056                                            01014000
AVTDSKCT EQU   IEDQAVTD+1054                                            01015000
AVTCKRST EQU   IEDQAVTD+1053                                            01016000
AVTSTAN  EQU   AVTBIT3                                                  01017000
AVTSTACN EQU   AVTBIT3                                                  01018000
AVTSTAIN EQU   AVTBIT3                                                  01019000
AVTSTAYN EQU   AVTBIT3                                                  01020000
AVTOLTBN EQU   AVTBIT3                                                  01021000
AVTTSAB  EQU   AVTBIT3                                                  01022000
AVTRFULN EQU   AVTBIT3                                                  01023000
AVTRECVN EQU   AVTBIT3                                                  01024000
@NM00068 EQU   AVTBIT2                                                  01025000
@NM00067 EQU   AVTBIT2                                                  01026000
AVTOPEIN EQU   AVTBIT2                                                  01027000
AVTSTRTN EQU   AVTBIT2                                                  01028000
AVTTOPOL EQU   AVTBIT2                                                  01029000
AVTCOPYN EQU   AVTBIT2                                                  01030000
AVTREUSN EQU   AVTBIT2                                                  01031000
AVTEXTSC EQU   AVTBIT2                                                  01032000
AVTDISKN EQU   AVTBIT1                                                  01033000
AVTQUCKN EQU   AVTBIT1                                                  01034000
AVTCLOSN EQU   AVTBIT1                                                  01035000
AVTREADN EQU   AVTBIT1                                                  01036000
AVTDLAYN EQU   AVTBIT1                                                  01037000
AVTAQTAN EQU   AVTBIT1                                                  01038000
AVTTSON  EQU   AVTBIT1                                                  01039000
AVTAPLKN EQU   AVTBIT1                                                  01040000
AVTDUMBR EQU   IEDQAVTD+1048                                            01041000
AVTDLQX  EQU   IEDQAVTD+1046                                            01042000
AVTINTLV EQU   IEDQAVTD+1044                                            01043000
AVTSMCNT EQU   IEDQAVTD+1042                                            01044000
AVTAVFCT EQU   IEDQAVTD+1040                                            01045000
AVTOPCON EQU   IEDQAVTD+1038                                            01046000
AVTOPCNT EQU   IEDQAVTD+1036                                            01047000
AVTLNCNT EQU   IEDQAVTD+1034                                            01048000
AVTKEYLE EQU   IEDQAVTD+1032                                            01049000
AVTHA16  EQU   IEDQAVTD+1030                                            01050000
AVTHA7   EQU   IEDQAVTD+1028                                            01051000
AVTHA4   EQU   IEDQAVTD+1026                                            01052000
AVTHA3   EQU   IEDQAVTD+1024                                            01053000
AVTHA2   EQU   IEDQAVTD+1022                                            01054000
AVTGETMS EQU   IEDQAVTD+1021                                            01055000
@NM00066 EQU   IEDQAVTD+1020                                            01056000
AVTGETMD EQU   IEDQAVTD+1016                                            01057000
AVTGETMN EQU   IEDQAVTD+1012                                            01058000
AVTCWTOT EQU   IEDQAVTD+1008                                            01059000
AVTCWINT EQU   IEDQAVTD+956                                             01060000
AVTDTRAP EQU   IEDQAVTD+952                                             01061000
@NM00065 EQU   IEDQAVTD+950                                             01062000
@NM00064 EQU   AVTIOTR                                                  01063000
AVTIOTRH EQU   AVTIOTR                                                  01064000
AVTIOTRE EQU   AVTIOTR                                                  01065000
@NM00063 EQU   AVTSUBT                                                  01066000
AVTSUBPT EQU   AVTSUBT                                                  01067000
AVTSUBON EQU   AVTSUBT                                                  01068000
AVTAFE30 EQU   IEDQAVTD+944                                             01069000
AVTAFE20 EQU   IEDQAVTD+940                                             01070000
AVTAFE10 EQU   IEDQAVTD+936                                             01071000
AVTCWEC2 EQU   IEDQAVTD+932                                             01072000
AVTCWPM2 EQU   IEDQAVTD+928                                             01073000
AVTCWTS2 EQU   IEDQAVTD+927                                             01074000
AVTCWTS1 EQU   IEDQAVTD+926                                             01075000
AVTCWCLD EQU   AVTCWFL2                                                 01076000
AVTCWRAP EQU   AVTCWFL2                                                 01077000
@NM00062 EQU   AVTCWFL2                                                 01078000
@NM00061 EQU   AVTCWFL2                                                 01079000
@NM00060 EQU   AVTCWFL2                                                 01080000
@NM00059 EQU   AVTCWFL2                                                 01081000
@NM00058 EQU   AVTCWFL2                                                 01082000
AVTCWACT EQU   AVTCWFL2                                                 01083000
@NM00057 EQU   AVTCWFL1                                                 01084000
@NM00056 EQU   AVTCWFL1                                                 01085000
@NM00055 EQU   AVTCWFL1                                                 01086000
@NM00054 EQU   AVTCWFL1                                                 01087000
@NM00053 EQU   AVTCWFL1                                                 01088000
@NM00052 EQU   AVTCWFL1                                                 01089000
@NM00051 EQU   AVTCWFL1                                                 01090000
AVTCOMWN EQU   AVTCWFL1                                                 01091000
AVTCWEC1 EQU   IEDQAVTD+920                                             01092000
AVTCWPM1 EQU   IEDQAVTD+916                                             01093000
AVTCAREA EQU   IEDQAVTD+912                                             01094000
AVTFZERO EQU   IEDQAVTD+908                                             01095000
AVTCADDR EQU   IEDQAVTD+904                                             01096000
AVTCOREC EQU   IEDQAVTD+900                                             01097000
@NM00050 EQU   IEDQAVTD+892                                             01098000
AVTCPBCB EQU   IEDQAVTD+888                                             01099000
@NM00049 EQU   IEDQAVTD+880                                             01100000
AVTDSIOB EQU   IEDQAVTD+876                                             01101000
@NM00048 EQU   IEDQAVTD+868                                             01102000
AVTCPRMB EQU   IEDQAVTD+864                                             01103000
@NM00047 EQU   IEDQAVTD+856                                             01104000
AVTCLOSB EQU   IEDQAVTD+852                                             01105000
@NM00046 EQU   IEDQAVTD+844                                             01106000
AVTACTIB EQU   IEDQAVTD+840                                             01107000
@NM00045 EQU   IEDQAVTD+836                                             01108000
AVTOLTEB EQU   IEDQAVTD+832                                             01109000
AVTOLTCH EQU   AVTOLTQB+1                                               01110000
AVTOLTVT EQU   AVTOLTQB                                                 01111000
@NM00044 EQU   AVTOPCQB+8                                               01112000
@NM00043 EQU   AVTOPCEC+1                                               01113000
@NM00042 EQU   AVTOPCCC                                                 01114000
AVTOPCPO EQU   AVTOPCCC                                                 01115000
AVTOPCWA EQU   AVTOPCCC                                                 01116000
AVTOPCCH EQU   AVTOPCOB+1                                               01117000
AVTOPCVT EQU   AVTOPCOB                                                 01118000
@NM00041 EQU   AVTCKPQB+9                                               01119000
AVTCKPTS EQU   AVTCKPQB+8                                               01120000
@NM00040 EQU   AVTCKPEC+1                                               01121000
@NM00039 EQU   AVTCKPCC                                                 01122000
AVTCKPPO EQU   AVTCKPCC                                                 01123000
AVTCKPWA EQU   AVTCKPCC                                                 01124000
AVTCKPCH EQU   AVTCKPTB+1                                               01125000
AVTCKPVT EQU   AVTCKPTB                                                 01126000
@NM00038 EQU   IEDQAVTD+796                                             01127000
AVTBFRTB EQU   IEDQAVTD+792                                             01128000
@NM00037 EQU   IEDQAVTD+784                                             01129000
AVTBFREB EQU   IEDQAVTD+780                                             01130000
AVTTIMQ  EQU   IEDQAVTD+776                                             01131000
@NM00036 EQU   IEDQAVTD+772                                             01132000
AVTIMQPS EQU   IEDQAVTD+768                                             01133000
AVTINOUT EQU   IEDQAVTD+766                                             01134000
AVTREFTM EQU   IEDQAVTD+764                                             01135000
@NM00035 EQU   IEDQAVTD+752                                             01136000
AVTDELYB EQU   IEDQAVTD+748                                             01137000
AVTOCQPT EQU   IEDQAVTD+744                                             01138000
AVTTSOPT EQU   IEDQAVTD+740                                             01139000
AVTSUPPT EQU   IEDQAVTD+736                                             01140000
AVTCBQCB EQU   IEDQAVTD+732                                             01141000
AVTMSGS  EQU   IEDQAVTD+729                                             01142000
@NM00034 EQU   AVTSYSER                                                 01143000
@NM00033 EQU   AVTSYSER                                                 01144000
@NM00032 EQU   AVTSYSER                                                 01145000
@NM00031 EQU   AVTSYSER                                                 01146000
@NM00030 EQU   AVTSYSER                                                 01147000
@NM00029 EQU   AVTSYSER                                                 01148000
AVTCMAXN EQU   AVTSYSER                                                 01149000
AVTCMINN EQU   AVTSYSER                                                 01150000
AVT2260L EQU   IEDQAVTD+724                                             01151000
AVTABEPL EQU   AVTADBUF                                                 01152000
AVTHFF   EQU   AVTCLRHI+2                                               01153000
@NM00028 EQU   AVTCLRHI                                                 01154000
AVTCCLNK EQU   AVTCRELE+5                                               01155000
AVTCCPRI EQU   AVTCRELE+4                                               01156000
AVTCCQCB EQU   AVTCCELE+1                                               01157000
AVTCCKEY EQU   AVTCCELE                                                 01158000
AVTDELAD EQU   IEDQAVTD+704                                             01159000
AVTDELEM EQU   IEDQAVTD+700                                             01160000
AVTBSX   EQU   AVTCKLNK                                                 01161000
AVTOPETR EQU   AVTHG01                                                  01162000
@NM00027 EQU   AVTCKBYT                                                 01163000
AVTCKONQ EQU   AVTCKBYT                                                 01164000
@NM00026 EQU   AVTCKBYT                                                 01165000
@NM00025 EQU   AVTCKBYT                                                 01166000
@NM00024 EQU   AVTCKBYT                                                 01167000
@NM00023 EQU   AVTCKBYT                                                 01168000
@NM00022 EQU   AVTCKBYT                                                 01169000
@NM00021 EQU   AVTCKBYT                                                 01170000
AVTOPERT EQU   IEDQAVTD+690                                             01171000
AVTOPXCL EQU   IEDQAVTD+688                                             01172000
AVTOPERL EQU   IEDQAVTD+687                                             01173000
@NM00020 EQU   IEDQAVTD+686                                             01174000
AVTCKTIM EQU   IEDQAVTD+684                                             01175000
AVTCKELV EQU   IEDQAVTD+682                                             01176000
AVTCPRCD EQU   IEDQAVTD+681                                             01177000
AVTWARMN EQU   AVTCKELF                                                 01178000
AVTCRTLN EQU   AVTCKELF                                                 01179000
AVTCPIPN EQU   AVTCKELF                                                 01180000
AVTCCLCN EQU   AVTCKELF                                                 01181000
AVTCINCN EQU   AVTCKELF                                                 01182000
@NM00019 EQU   AVTCKELF                                                 01183000
AVTCMCPN EQU   AVTCKELF                                                 01184000
AVTCRDYN EQU   AVTCKELF                                                 01185000
AVTCKQAD EQU   IEDQAVTD+677                                             01186000
AVTSCBSZ EQU   IEDQAVTD+676                                             01187000
@NM00018 EQU   IEDQAVTD+672                                             01188000
AVTCKELE EQU   IEDQAVTD+668                                             01189000
@NM00017 EQU   AVTCKPEL+8                                               01190000
AVTCKRLK EQU   AVTCKPEL+5                                               01191000
AVTCKRPR EQU   AVTCKPEL+4                                               01192000
AVTCKRMQ EQU   AVTCKRMV+1                                               01193000
AVTCKRKY EQU   AVTCKRMV                                                 01194000
AVTHK    EQU   IEDQAVTD+648                                             01195000
AVTHI    EQU   IEDQAVTD+644                                             01196000
AVTIOT   EQU   IEDQAVTD+640                                             01197000
AVTNX    EQU   IEDQAVTD+636                                             01198000
AVTTONE  EQU   IEDQAVTD+632                                             01199000
AVTA3TL  EQU   IEDQAVTD+628                                             01200000
AVTDMECB EQU   IEDQAVTD+624                                             01201000
AVTABEND EQU   IEDQAVTD+618                                             01202000
AVTPLCBN EQU   IEDQAVTD+616                                             01203000
@NM00016 EQU   AVTSAVTP+1                                               01204000
@NM00015 EQU   AVTSAVTF                                                 01205000
AVTSNA   EQU   AVTSAVTF                                                 01206000
AVTONSNA EQU   AVTSAVTF                                                 01207000
AVTVTMCP EQU   AVTSAVTF                                                 01208000
@NM00014 EQU   IEDQAVTD+608                                             01209000
AVTCMBSS EQU   IEDQAVTD+604                                             01210000
AVTRCV   EQU   IEDQAVTD+600                                             01211000
AVTSEND  EQU   IEDQAVTD+596                                             01212000
AVTCSCH  EQU   IEDQAVTD+592                                             01213000
AVTQ1    EQU   IEDQAVTD+588                                             01214000
AVTE7    EQU   IEDQAVTD+584                                             01215000
AVTHB    EQU   IEDQAVTD+580                                             01216000
AVTR1    EQU   IEDQAVTD+576                                             01217000
AVTBZ    EQU   IEDQAVTD+572                                             01218000
AVTEZ    EQU   IEDQAVTD+568                                             01219000
AVTEC    EQU   IEDQAVTD+564                                             01220000
AVTEW    EQU   IEDQAVTD+560                                             01221000
AVTNDIAL EQU   AVTSCOPT                                                 01222000
AVTN2741 EQU   AVTSCOPT                                                 01223000
AVTCONCO EQU   AVTSCOPT                                                 01224000
AVTCONC  EQU   AVTSCOPT                                                 01225000
AVTCMBUF EQU   AVTSCOPT                                                 01226000
AVTAPDMP EQU   AVTSCOPT                                                 01227000
@NM00013 EQU   AVTSCOPT                                                 01228000
AVTHA    EQU   AVTDISP                                                  01229000
AVTEA    EQU   IEDQAVTD+548                                             01230000
AVTAX    EQU   IEDQAVTD+544                                             01231000
AVTA3    EQU   IEDQAVTD+540                                             01232000
AVTGD    EQU   IEDQAVTD+536                                             01233000
AVTAL    EQU   IEDQAVTD+532                                             01234000
AVTOLTST EQU   AVTHG02                                                  01235000
AVTE8    EQU   IEDQAVTD+524                                             01236000
AVTUI    EQU   IEDQAVTD+520                                             01237000
AVTCOMPT EQU   IEDQAVTD+516                                             01238000
AVTCRSRF EQU   IEDQAVTD+512                                             01239000
@NM00012 EQU   IEDQAVTD+508                                             01240000
AVTKA02  EQU   IEDQAVTD+504                                             01241000
AVTOPTPT EQU   IEDQAVTD+500                                             01242000
AVTPCBPT EQU   IEDQAVTD+496                                             01243000
AVTOSECB EQU   IEDQAVTD+492                                             01244000
AVTOPECA EQU   IEDQAVTD+488                                             01245000
AVTOLECA EQU   IEDQAVTD+484                                             01246000
AVTCKECA EQU   IEDQAVTD+480                                             01247000
AVTCWECA EQU   IEDQAVTD+476                                             01248000
AVTCWTCB EQU   IEDQAVTD+472                                             01249000
AVTOLTCB EQU   IEDQAVTD+468                                             01250000
AVTOCTCB EQU   IEDQAVTD+464                                             01251000
AVTCKTCB EQU   IEDQAVTD+460                                             01252000
AVTAS    EQU   IEDQAVTD+456                                             01253000
AVTNOLBF EQU   IEDQAVTD+454                                             01254000
AVTNCKPR EQU   IEDQAVTD+453                                             01255000
AVTCIB   EQU   IEDQAVTD+452                                             01256000
AVTSPLPT EQU   IEDQAVTD+448                                             01257000
AVTMVBFR EQU   IEDQAVTD+444                                             01258000
AVTSBTA  EQU   IEDQAVTD+440                                             01259000
AVTRARTN EQU   IEDQAVTD+436                                             01260000
AVTBSCAN EQU   IEDQAVTD+432                                             01261000
AVTRDYA  EQU   IEDQAVTD+428                                             01262000
AVTDISTR EQU   IEDQAVTD+420                                             01263000
AVTPARM3 EQU   IEDQAVTD+416                                             01264000
@NM00011 EQU   AVTPKF                                                   01265000
@NM00010 EQU   AVTPKF                                                   01266000
@NM00009 EQU   AVTPKF                                                   01267000
AVTFTCHF EQU   AVTPKF                                                   01268000
@NM00008 EQU   AVTPKF                                                   01269000
@NM00007 EQU   AVTPKF                                                   01270000
@NM00006 EQU   AVTPKF                                                   01271000
@NM00005 EQU   AVTPKF                                                   01272000
AVTPARM  EQU   IEDQAVTD+408                                             01273000
AVTEXS2A EQU   IEDQAVTD+402                                             01274000
AVTEXA2S EQU   IEDQAVTD+396                                             01275000
AVTOCGET EQU   IEDQAVTD+392                                             01276000
AVTCKAVT EQU   @NM00003+1                                               01277000
@NM00004 EQU   AVTCKFLG                                                 01278000
AVTCKHLT EQU   AVTCKFLG                                                 01279000
AVTCKREQ EQU   AVTCKFLG                                                 01280000
AVTCKENV EQU   AVTCKFLG                                                 01281000
AVTCKNAC EQU   AVTCKFLG                                                 01282000
AVTCKTAC EQU   AVTCKFLG                                                 01283000
@NM00002 EQU   IEDQAVTD+384                                             01284000
AVTREADD EQU   IEDQAVTD+380                                             01285000
AVTREADY EQU   IEDQAVTD+376                                             01286000
AVTRACE  EQU   IEDQAVTD+372                                             01287000
AVTTCB   EQU   IEDQAVTD+368                                             01288000
AVTPASWD EQU   IEDQAVTD+360                                             01289000
AVTCTLCH EQU   IEDQAVTD+352                                             01290000
AVTDOUBL EQU   IEDQAVTD+344                                             01291000
AVTDOUBX EQU   IEDQAVTD+336                                             01292000
AVTDPARM EQU   IEDQAVTD+332                                             01293000
AVTCSTCS EQU   IEDQAVTD+328                                             01294000
AVTDLQ   EQU   AVTSAVEX+32                                              01295000
@NM00001 EQU   AVTSAVEX                                                 01296000
AVTSAVE4 EQU   IEDQAVTD+216                                             01297000
AVTSAVE3 EQU   IEDQAVTD+144                                             01298000
AVTSAVE2 EQU   IEDQAVTD+72                                              01299000
AVTSAVE1 EQU   IEDQAVTD                                                 01300000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01301000
@ENDDATA EQU   *                                                        01302000
         END   IGCA810D,(C'PLS0041',0701,77013)                         01303000
