         TITLE 'IGCV810D, STOPLINE FOR 3705 LINES                      *00001000
                        '                                               00002000
IGCV810D CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
         USING *,RBASE                  ESTABLISH A BASE REGISTER       00005000
         LR    RBASE,REG15              SETUP BASE REG                  00006000
IGCV810D IEDHJN AFTERHJN,HJN            MODULE IDENTIFICATION MACRO     00007000
*   ROPCAVT=RPARM;                  /* SET BASE POINTER FOR OP  03S0398 00008000
*                                      CONTROL AVT                   */ 00009000
         LR    ROPCAVT,RPARM                                    03S0398 00010000
*   RAVT=OPCAVTPT;                  /* SET THE BASE POINTER FOR THE     00011000
*                                      TCAM ADDRESS VECTOR TABLE     */ 00012000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0399 00013000
*   ROPCE=OPCCOPCE;                 /* SET THE BASE POINTER FOR THE     00014000
*                                      OPERATOR CONTROL ELEMENT      */ 00015000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0400 00016000
*   OPCFLAG1=ZERO;                  /* CLEAR CONTROL SWITCHES        */ 00017000
         MVI   OPCFLAG1(ROPCAVT),X'00'                          03S0401 00018000
*   IF OCRESP=ON THEN                                           02S0402 00019000
         TM    OCRESP(ROPCE),B'00000001'                        02S0402 00020000
         BNO   @RF00402                                         02S0402 00021000
*     DO;                           /* IF THIS IS AN OPCE WITH A        00022000
*                                      NON-SNA RESPONSE, PROCESS THE    00023000
*                                      RESPONSE                      */ 00024000
*                                                               03S0404 00025000
*       /*************************************************************/ 00026000
*       /*                                                           */ 00027000
*       /* PROCESS.RESPROC: THIS ROUTINE WILL PROCESS A NON-SNA      */ 00028000
*       /* RESPONSE                                                  */ 00029000
*       /*                                                           */ 00030000
*       /*************************************************************/ 00031000
*                                                               03S0404 00032000
*       RFY                                                     03S0404 00033000
*        (RWORK5,                                               03S0404 00034000
*         RWORK6,                                               03S0404 00035000
*         RWORK7,                                               03S0404 00036000
*         RWORKA) RSTD;                                         03S0404 00037000
*       CALL IPWLSRCH;              /* SEARCH WAITV CHAIN FOR   03S0405 00038000
*                                      MATCHING OPCE                 */ 00039000
         BAL   @14,IPWLSRCH                                     03S0405 00040000
*       RZERO->OCLINK=RPARM->OCLINK;/* UNLINK OPCE FROM CHAIN        */ 00041000
         L     @11,OCLINK(,RPARM)                               03S0406 00042000
         LR    @09,RZERO                                        03S0406 00043000
         ST    @11,OCLINK(,@09)                                 03S0406 00044000
*       RWORK6=RPARM;               /* SAVE ADDRESS OF REAL OPCE     */ 00045000
         LR    RWORK6,RPARM                                     03S0407 00046000
*       RWORKA=0;                   /* CLEAR OUT WORK REGISTER  03S0408 00047000
*                                                            @OY19465*/ 00048000
         SLR   RWORKA,RWORKA                                    03S0408 00049000
*       WAITFLG=ON;                 /* TURN WAITFLG ON       @OY19465*/ 00050000
         OI    WAITFLG(ROPCAVT),B'00100000'                     03S0409 00051000
*       RPARM=RZERO->OCLINK;        /* SET RPARM TO NEXT ELEMENT        00052000
*                                                            @OY19465*/ 00053000
         LR    RPARM,@11                                        03S0410 00054000
*       DO WHILE(WAITFLG=ON);       /* CONTINUE UNITL WAITFLG IS        00055000
*                                      TURNED OFF            @OY19465*/ 00056000
         B     @DE00411                                         03S0411 00057000
@DL00411 DS    0H                                               03S0412 00058000
*         IF RPARM=ZERO THEN                                    03S0412 00059000
         LTR   RPARM,RPARM                                      03S0412 00060000
         BNZ   @RF00412                                         03S0412 00061000
*           WAITFLG=OFF;            /* END OF WAITV CHAIN    @OY19465*/ 00062000
         NI    WAITFLG(ROPCAVT),B'11011111'                     03S0413 00063000
*         ELSE                                                  03S0414 00064000
*           DO;                     /* CONTINUE SEARCHING    @OY19465*/ 00065000
         B     @RC00412                                         03S0414 00066000
@RF00412 DS    0H                                               03S0415 00067000
*             IF OCTRMTBL=RPARM->OCTRMTBL&RPARM->OCDACTIP=OFF THEN      00068000
         CLC   OCTRMTBL(2,ROPCE),OCTRMTBL(RPARM)                03S0415 00069000
         BNE   @RF00415                                         03S0415 00070000
         TM    OCDACTIP(RPARM),B'01000000'                      03S0415 00071000
         BNZ   @RF00415                                         03S0415 00072000
*               DO;                 /* IF THE TTCIN OF THE ELEMENT IS   00073000
*                                      EQUAL TO THAT OF THE CURRENT     00074000
*                                      OPCE AND A DEACT HAS NOT BEEN    00075000
*                                      SENT OUT FOR THE LINE THEN       00076000
*                                      DELINK THE ELEMENT OFF OF        00077000
*                                      OPCWAITV AND ATTACH IT TO THE    00078000
*                                      CURRENT ELEMENT       @OY19465*/ 00079000
*                 CALL DLKATT;      /* CALL THE DELINK AND ATTACH       00080000
*                                      ROUTINE               @OY19465*/ 00081000
         BAL   @14,DLKATT                                       03S0417 00082000
*                 RPARM=RZERO->OCLINK;/* SET REGISTER RPARM UP FOR      00083000
*                                      REST OF SEARCH OF THE CHAIN      00084000
*                                                            @OY19465*/ 00085000
         LR    @11,RZERO                                        03S0418 00086000
         L     RPARM,OCLINK(,@11)                               03S0418 00087000
*               END;                /*                       @OY19465*/ 00088000
*             ELSE                                              03S0420 00089000
*               DO;                 /* MUST SEARCH CHAIN FOR ANY        00090000
*                                      STOPTERMS THAT ARE IN PROGRESS   00091000
*                                      ON THIS LINE          @OY19465*/ 00092000
         B     @RC00415                                         03S0420 00093000
@RF00415 DS    0H                                               03S0421 00094000
*                 IF RPARM->OCWTG=MODVF&OCBACKUP=RPARM->OCBACKUP THEN   00095000
         CLC   OCWTG(2,RPARM),MODVF                             03S0421 00096000
         BNE   @RF00421                                         03S0421 00097000
         CLC   OCBACKUP(8,ROPCE),OCBACKUP(RPARM)                03S0421 00098000
         BNE   @RF00421                                         03S0421 00099000
*                   DO;             /* THIS IS A STOPTERM FOR A 03S0422 00100000
*                                      TERMINAL ON A LINE IN THIS       00101000
*                                      GROUP                 @OY19465*/ 00102000
*                     WAITFLG=OFF;  /* ONCE WE FIND A STOPTERM FOR A    00103000
*                                      TERMINAL IN THIS GROUP, THEN     00104000
*                                      WE KNOW THAT THERE WILL BE NO    00105000
*                                      MORE OPCE'S ON THIS CHAIN        00106000
*                                      WHICH NEED TO BE ATTACHED        00107000
*                                                            @OY19465*/ 00108000
         NI    WAITFLG(ROPCAVT),B'11011111'                     03S0423 00109000
*                     RWORK5=RZERO; /* SAVE RZERO            @OY19465*/ 00110000
         LR    RWORK5,RZERO                                     03S0424 00111000
*                     RWORK7=RPARM; /* SAVE RPARM            @OY19465*/ 00112000
         LR    RWORK7,RPARM                                     03S0425 00113000
*                     RPARM=RPARM->OCTRMTBL;/* GET TTCIN OF TERMINAL    00114000
*                                                            @OY19465*/ 00115000
         SLR   @11,@11                                          03S0426 00116000
         ICM   @11,3,OCTRMTBL(RPARM)                            03S0426 00117000
         LR    RPARM,@11                                        03S0426 00118000
*                     CALL IEDQTNT; /* GET TRM ENTRY         @OY19465*/ 00119000
         L     @15,AVTRNMPT(,RAVT)                              03S0427 00120000
         BALR  @14,@15                                          03S0427 00121000
*                     RTRM=RPARM;   /* SET UP TERMINAL BASE  @OY19465*/ 00122000
         LR    RTRM,RPARM                                       03S0428 00123000
*                     RPARM=OCTRMTBL;/* RESET RPARM FOR REST OF 03S0429 00124000
*                                      SEARCH                @OY19465*/ 00125000
         SLR   RPARM,RPARM                                      03S0429 00126000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0429 00127000
*                     DO WHILE(TRMTYPE^=TRMNSDLC);/* LOOP UNTIL FIND    00128000
*                                      LINE                  @OY19465*/ 00129000
         B     @DE00430                                         03S0430 00130000
@DL00430 DS    0H                                               03S0431 00131000
*                       CALL IEDQTNT;/* GET TTE              @OY19465*/ 00132000
         L     @15,AVTRNMPT(,RAVT)                              03S0431 00133000
         BALR  @14,@15                                          03S0431 00134000
*                       CALL COHORTLK;/* GET NEXT RES        @OY19465*/ 00135000
         L     @15,OPCHORT(,ROPCAVT)                            03S0432 00136000
         BALR  @14,@15                                          03S0432 00137000
*                       RTRM=RPARM; /* EST ADDRESSABILITY    @OY19465*/ 00138000
         LR    RTRM,RPARM                                       03S0433 00139000
*                       RPARM=RZERO;/* SET UP INTERFACE TO TNT CODE     00140000
*                                                            @OY19465*/ 00141000
         LR    RPARM,RZERO                                      03S0434 00142000
*                     END;          /* END OF LOOP TO FIND LINE 03S0435 00143000
*                                                            @OY19465*/ 00144000
@DE00430 LR    @11,RTRM                                         03S0435 00145000
         AL    @11,@CF01505                                     03S0435 00146000
         CLI   TRMTYPE-11(@11),X'20'                            03S0435 00147000
         BNE   @DL00430                                         03S0435 00148000
*                     IF RPARM=OCTRMTBL THEN                    03S0436 00149000
         SLR   @11,@11                                          03S0436 00150000
         ICM   @11,3,OCTRMTBL(ROPCE)                            03S0436 00151000
         CR    RPARM,@11                                        03S0436 00152000
         BNE   @RF00436                                         03S0436 00153000
*                       DO;         /* TERMINAL IS ON CURRENT LINE      00154000
*                                                            @OY19465*/ 00155000
*                         RZERO=RWORK5;/* RESTORE RZERO      @OY19465*/ 00156000
         LR    RZERO,RWORK5                                     03S0438 00157000
*                         RPARM=RWORK7;/* RESTORE RPARM      @OY19465*/ 00158000
         LR    RPARM,RWORK7                                     03S0439 00159000
*                         CALL DLKATT;/* DELINK THE STOPTERM ELEMENT    00160000
*                                      AND ATTACH TO CURRENT ELEMENT    00161000
*                                                            @OY19465*/ 00162000
         BAL   @14,DLKATT                                       03S0440 00163000
*                       END;        /*                       @OY19465*/ 00164000
*                     ELSE                                      03S0442 00165000
*                       ;           /*                       @OY19465*/ 00166000
@RF00436 DS    0H                                               03S0443 00167000
*                   END;            /*                       @OY19465*/ 00168000
*                 ELSE                                          03S0444 00169000
*                   DO;             /* THIS ELEMENT ON WAITCHN DOES     00170000
*                                      NOT NEED TO BE ATTACHED TO THE   00171000
*                                      CURRENT ELEMENT THEREFORE THE    00172000
*                                      CHAIN POINTERS WILL BE   03S0444 00173000
*                                      INCREMENTED IN ORDER TO  03S0444 00174000
*                                      CONTINUE THE SEARCH   @OY19465*/ 00175000
         B     @RC00421                                         03S0444 00176000
@RF00421 DS    0H                                               03S0445 00177000
*                     RZERO=RPARM;  /* SAVE CURRENT POINTER  @OY19465*/ 00178000
         LR    RZERO,RPARM                                      03S0445 00179000
*                     RPARM=RPARM->OCLINK;/* NEXT ELEMENT TO BE 03S0446 00180000
*                                      COMPARED WITH CURRENT OPCE       00181000
*                                                            @OY19465*/ 00182000
         L     RPARM,OCLINK(,RPARM)                             03S0446 00183000
*                   END;                                        03S0447 00184000
*               END;                                            03S0448 00185000
@RC00421 DS    0H                                               03S0449 00186000
*           END;                                                03S0449 00187000
@RC00415 DS    0H                                               03S0450 00188000
*       END;                                                    03S0450 00189000
@RC00412 DS    0H                                               03S0450 00190000
@DE00411 TM    WAITFLG(ROPCAVT),B'00100000'                     03S0450 00191000
         BO    @DL00411                                         03S0450 00192000
*       IF RWORKA^=0 THEN                                       03S0451 00193000
         LTR   RWORKA,RWORKA                                    03S0451 00194000
         BZ    @RF00451                                         03S0451 00195000
*         RWORK6=RWORKA;            /* IF RWORKA IS NOT 0 THEN RWORK6   00196000
*                                      MUST BE RESTORED BECAUSE 03S0452 00197000
*                                      RWORK6 WAS CHANGED BECAUSE       00198000
*                                      MORE THAN ONE ELEMENT ON THE     00199000
*                                      WAIT CHAIN MAY BE DELINKED AND   00200000
*                                      ATTACHED TO THE CURRENT OPCE     00201000
*                                                            @OY19465*/ 00202000
         LR    RWORK6,RWORKA                                    03S0452 00203000
*       RWORK7=OCPARM;              /* SAVE RETURN CODE              */ 00204000
@RF00451 LH    @11,OCPARM(,ROPCE)                               03S0453 00205000
         LR    RWORK7,@11                                       03S0453 00206000
*       RWORK6->OCUNIT=INVALTIC;    /* INDICATE OPCE ONLY UNIT TO BE    00207000
*                                      FREED                         */ 00208000
         MVC   OCUNIT(4,RWORK6),@CF01775                        03S0454 00209000
*       IF OCPARM^=ONE&RWORK6->OCALLFLG=OFF THEN                03S0455 00210000
         CH    @11,@CH00061                                     03S0455 00211000
         BE    @RF00455                                         03S0455 00212000
         TM    OCALLFLG(RWORK6),B'00000100'                     03S0455 00213000
         BNZ   @RF00455                                         03S0455 00214000
*         DO;                       /* IF NOT A GOOD RESPONSE AND NOT   00215000
*                                      AN 'ALL' REQUEST THEN @YM06145*/ 00216000
*           IF OCPARM=TWO THEN                                  03S0457 00217000
         CH    @11,@CH00065                                     03S0457 00218000
         BNE   @RF00457                                         03S0457 00219000
*             DO;                   /* IF LINE ALREADY STOPPED THEN  */ 00220000
*               IF RWORK6->OCTOTE=ON THEN                       03S0459 00221000
         TM    OCTOTE(RWORK6),B'01000000'                       03S0459 00222000
         BNO   @RF00459                                         03S0459 00223000
*                 TRMSTOTE=ON;      /* INDICATE TOTE OWN     @YM06145*/ 00224000
         LR    @11,RTRM                                         03S0460 00225000
         AL    @11,@CF02313                                     03S0460 00226000
         OI    TRMSTOTE-3(@11),B'00000001'                      03S0460 00227000
*               OPCWRKSP(1)=MSG25;  /* SETUP MSG NUMBER              */ 00228000
@RF00459 MVC   OPCWRKSP(4,ROPCAVT),@CF02218                     03S0461 00229000
*               OPCWRKSP(2)=EIGHT;  /* SETUP RETURN CODE             */ 00230000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00045                   03S0462 00231000
*             END;                                              03S0463 00232000
*           ELSE                                                03S0464 00233000
*             DO;                                               03S0464 00234000
         B     @RC00457                                         03S0464 00235000
@RF00457 DS    0H                                               03S0465 00236000
*               OPCWRKSP(1)=MSG199; /* BAD RESPONSE                  */ 00237000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02224                     03S0465 00238000
*               OPCWRKSP(2)=FOUR;   /* SETUP RETURN CODE             */ 00239000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   03S0466 00240000
*               RWORK6->OCUNIT=OCUNIT;/* ATTACH UNIT FROM INPUT OPCE    00241000
*                                      TO REAL OPCE                  */ 00242000
         MVC   OCUNIT(4,RWORK6),OCUNIT(ROPCE)                   03S0467 00243000
*               OCUNIT=INVALTIC;    /* INDICATE LAST UNIT    @OY20509*/ 00244000
         MVC   OCUNIT(4,ROPCE),@CF01775                         03S0468 00245000
*             END;                                              03S0469 00246000
*         END;                                                  03S0470 00247000
@RC00457 DS    0H                                               03S0471 00248000
*       RPARM=ROPCE;                /* SETUP INPUT OPCE TO BE FREED  */ 00249000
@RF00455 LR    RPARM,ROPCE                                      03S0471 00250000
*       RFY                                                     03S0472 00251000
*         RSAVE RSTD;                                           03S0472 00252000
*       RSAVE=ADDR(OPCSAVE);        /* SETUP SAVEAREA                */ 00253000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0473 00254000
*       CALL FREEBUFF;              /* FREE INPUT OPCE AND ATTACHED     00255000
*                                      UNIT                          */ 00256000
         L     @15,OPCFREBF(,ROPCAVT)                           03S0474 00257000
         BALR  @14,@15                                          03S0474 00258000
*       RFY                                                     03S0475 00259000
*         RSAVE UNRSTD;                                         03S0475 00260000
*       ROPCE=RWORK6;               /* SETUP ADDRESS OF REAL OPCE    */ 00261000
         LR    ROPCE,RWORK6                                     03S0476 00262000
*       OPCCOPCE=RWORK6;            /* SAVE OPCE ADDR IN OP CONTROL     00263000
*                                      AVT                           */ 00264000
         ST    RWORK6,OPCCOPCE(,ROPCAVT)                        03S0477 00265000
*       RPARM=OCTRMTBL;             /* GET TTCIN OF LINE TTE         */ 00266000
         SLR   RPARM,RPARM                                      03S0478 00267000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0478 00268000
*       CALL IEDQTNT;               /* GET LINE TTE                  */ 00269000
         L     @15,AVTRNMPT(,RAVT)                              03S0479 00270000
         BALR  @14,@15                                          03S0479 00271000
*       RTRM=RPARM;                 /* SETUP TERM BASE               */ 00272000
         LR    RTRM,RPARM                                       03S0480 00273000
*       OCWTG=OCWTGB;               /* SETUP WHERE-TO-GO FIELD       */ 00274000
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                     03S0481 00275000
*       IF RWORK7=ONE THEN                                      03S0482 00276000
         CH    RWORK7,@CH00061                                  03S0482 00277000
         BNE   @RF00482                                         03S0482 00278000
*         DO;                       /* WAS IT A GOOD RESPONSE?       */ 00279000
*           OPCWRKSP(1)=MSG26;      /* SETUP GOOD RESPONSE           */ 00280000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02220                     03S0484 00281000
*           OPCWRKSP(2)=ZERO;       /* SETUP GOOD RETURN CODE        */ 00282000
         SLR   @11,@11                                          03S0485 00283000
         ST    @11,OPCWRKSP+4(,ROPCAVT)                         03S0485 00284000
*           IF OCTOTE=ON THEN                                   03S0486 00285000
         TM    OCTOTE(ROPCE),B'01000000'                        03S0486 00286000
         BNO   @RF00486                                         03S0486 00287000
*             TRMSTOTE=ON;          /* INDICATE TOTE OWNERSHIP       */ 00288000
         LR    @11,RTRM                                         03S0487 00289000
         AL    @11,@CF02313                                     03S0487 00290000
         OI    TRMSTOTE-3(@11),B'00000001'                      03S0487 00291000
*           CALL IPEXIT;            /* PERFORM NORMAL EXIT PROCESSING*/ 00292000
@RF00486 BAL   @14,IPEXIT                                       03S0488 00293000
*         END;                                                  03S0489 00294000
*       ELSE                        /* EITHER A BAD RESPONSE OR LINE    00295000
*                                      ALREADY STOPPED               */ 00296000
*         CALL IPERROR;             /* PERFORM ERROR PROCESSING      */ 00297000
         B     @RC00482                                         03S0490 00298000
@RF00482 BAL   @14,IPERROR                                      03S0490 00299000
*       RFY                                                     03S0491 00300000
*        (RWORK6,                                               03S0491 00301000
*         RWORK7) UNRSTD;                                       03S0491 00302000
@RC00482 DS    0H                                               03S0492 00303000
*     END;                                                      02S0492 00304000
*   ELSE                                                        02S0493 00305000
*     IF OCPARM^=ZERO THEN                                      02S0493 00306000
         B     @RC00402                                         02S0493 00307000
@RF00402 LH    @11,OCPARM(,ROPCE)                               02S0493 00308000
         LTR   @11,@11                                          02S0493 00309000
         BZ    @RF00493                                         02S0493 00310000
*       DO;                         /* IF THIS IS AN OPCE WITH A SNA    00311000
*                                      RESPONSE, PROCESS IT          */ 00312000
*                                                               03S0495 00313000
*         /***********************************************************/ 00314000
*         /*                                                         */ 00315000
*         /* PROCESS.SNAPROC: THIS SEGMENT PROCESSES SNA RESPONSES   */ 00316000
*         /*                                                         */ 00317000
*         /***********************************************************/ 00318000
*                                                               03S0495 00319000
*         OCWTG=OCWTGB;             /* SETUP WHERE-TO-GO FIELD       */ 00320000
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                     03S0495 00321000
*         OPCWRKSP(1)=OCPARM;       /* SETUP MESSAGE NUMBER          */ 00322000
         ST    @11,OPCWRKSP(,ROPCAVT)                           03S0496 00323000
*         RPARM=OCTRMTBL;           /* SETUP TTCIN OF SNA LINE       */ 00324000
         SLR   RPARM,RPARM                                      03S0497 00325000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0497 00326000
*         CALL IEDQTNT;             /* GET LINE TTE                  */ 00327000
         L     @15,AVTRNMPT(,RAVT)                              03S0498 00328000
         BALR  @14,@15                                          03S0498 00329000
*         RTRM=RPARM;               /* SETUP TERM BASE               */ 00330000
         LR    RTRM,RPARM                                       03S0499 00331000
*         IF OCPARM=MSG401 THEN                                 03S0500 00332000
         CLC   OCPARM(2,ROPCE),@CH02230                         03S0500 00333000
         BNE   @RF00500                                         03S0500 00334000
*           DO;                     /* IF SNA LINE DEACTIVATED, 03S0501 00335000
*                                      PROCESS NORMALLY              */ 00336000
*             OPCWRKSP(2)=ZERO;     /* SETUP RETURN CODE             */ 00337000
         SLR   @11,@11                                          03S0502 00338000
         ST    @11,OPCWRKSP+4(,ROPCAVT)                         03S0502 00339000
*             CALL IPEXIT;          /* DO NORMAL EXIT PROCESSING     */ 00340000
         BAL   @14,IPEXIT                                       03S0503 00341000
*           END;                                                03S0504 00342000
*         ELSE                                                  03S0505 00343000
*           DO;                                                 03S0505 00344000
         B     @RC00500                                         03S0505 00345000
@RF00500 DS    0H                                               03S0506 00346000
*             IF OCPARM=MSG539 THEN                             03S0506 00347000
         CLC   OCPARM(2,ROPCE),@CH02232                         03S0506 00348000
         BNE   @RF00506                                         03S0506 00349000
*               OPCWRKSP(2)=EIGHT;  /* LINE ALREADY DEACTIVATED      */ 00350000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00045                   03S0507 00351000
*             ELSE                                              03S0508 00352000
*               OPCWRKSP(2)=FOUR;   /* ELSE SETUP ERROR RETURN CODE  */ 00353000
         B     @RC00506                                         03S0508 00354000
@RF00506 MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   03S0508 00355000
*             CALL IPERROR;         /* DO ERROR PROCESSING           */ 00356000
@RC00506 BAL   @14,IPERROR                                      03S0509 00357000
*           END;                                                03S0510 00358000
*       END;                                                    02S0511 00359000
*     ELSE                                                      02S0512 00360000
*       FIRSTREQ=ON;                /* ELSE INDICATE ITS A FIRST        00361000
*                                      REQUEST                       */ 00362000
         B     @RC00493                                         02S0512 00363000
@RF00493 OI    FIRSTREQ(ROPCAVT),B'10000000'                    02S0512 00364000
*   DO WHILE(FIRSTREQ=ON|MORLINES=ON);/* IF THIS IS A FIRST REQUEST     00365000
*                                      OR MORE LINES ARE LEFT TO        00366000
*                                      PROCESS, PROCESS STOPLINE        00367000
*                                      REQUEST                       */ 00368000
@RC00493 DS    0H                                               02S0513 00369000
@RC00402 B     @DE00513                                         02S0513 00370000
@DL00513 DS    0H                                               02S0514 00371000
*                                                               03S0514 00372000
*     /***************************************************************/ 00373000
*     /*                                                             */ 00374000
*     /* PROCESS.STPLPROC: THIS SEGMENT PROCESSES STOPLINE REQUESTS  */ 00375000
*     /*                                                             */ 00376000
*     /***************************************************************/ 00377000
*                                                               03S0514 00378000
*     MORLINES=OFF;                 /* RESET LINE INDICATOR          */ 00379000
         NI    MORLINES(ROPCAVT),B'10111111'                    03S0514 00380000
*     IF FIRSTREQ=ON THEN                                       03S0515 00381000
         TM    FIRSTREQ(ROPCAVT),B'10000000'                    03S0515 00382000
         BNO   @RF00515                                         03S0515 00383000
*       DO;                         /* IF THIS REQUEST IS FIRST ONE,    00384000
*                                      SETUP TO ESTABLISH FIRST LINE */ 00385000
*         FIRSTREQ=OFF;             /* TURN OFF FIRST REQUEST FLAG   */ 00386000
         NI    FIRSTREQ(ROPCAVT),B'01111111'                    03S0517 00387000
*                                                               04S0518 00388000
*         /***********************************************************/ 00389000
*         /*                                                         */ 00390000
*         /* PROCESS.STPLPROC.FIRSTLN: THIS SEGMENT ESTABLISHES THE  */ 00391000
*         /* FIRST LINE TO BE STOPPED                                */ 00392000
*         /*                                                         */ 00393000
*         /***********************************************************/ 00394000
*                                                               04S0518 00395000
*         IF OCRENTRD=ON THEN                                   04S0518 00396000
         TM    OCRENTRD(ROPCE),B'10000000'                      04S0518 00397000
         BNO   @RF00518                                         04S0518 00398000
*           DO;                     /* IS THIS A RE-ENTRY?           */ 00399000
*             OCRENTRD=OFF;         /* RE-SET 'RE-ENTERED' INDICATOR */ 00400000
         NI    OCRENTRD(ROPCE),B'01111111'                      04S0520 00401000
*             OCWTG=OCWTGB;         /* SETUP WHERE-TO-GO FIELD       */ 00402000
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                     04S0521 00403000
*           END;                                                04S0522 00404000
*         RPARM=OCTRMTBL;           /* GET TTCIN OF RESOURCE         */ 00405000
@RF00518 SLR   RPARM,RPARM                                      04S0523 00406000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          04S0523 00407000
*         CALL IEDQTNT;             /* FIND TTE OF RESOURCE          */ 00408000
         L     @15,AVTRNMPT(,RAVT)                              04S0524 00409000
         BALR  @14,@15                                          04S0524 00410000
*         RTRM=RPARM;               /* SETUP TERM BASE               */ 00411000
         LR    RTRM,RPARM                                       04S0525 00412000
*         IF TRMTYPE=TRMGRP THEN                                04S0526 00413000
         LR    @11,RTRM                                         04S0526 00414000
         SH    @11,@CH01234                                     04S0526 00415000
         CLI   TRMTYPE(@11),X'00'                               04S0526 00416000
         BNE   @RF00526                                         04S0526 00417000
*           DO;                     /* IS THIS A GROUP TTE           */ 00418000
*             IF TRMSUBST^=ZERO THEN                            04S0528 00419000
         ICM   @09,3,TRMSUBST(@11)                              04S0528 00420000
         BZ    @RF00528                                         04S0528 00421000
*               DO;                                             04S0529 00422000
*                 OCTRMTBL=TRMSUBST;/* SAVE TTCIN OF LINE            */ 00423000
         SLR   @09,@09                                          04S0530 00424000
         ICM   @09,3,TRMSUBST(@11)                              04S0530 00425000
         STH   @09,OCTRMTBL(,ROPCE)                             04S0530 00426000
*                 RPARM=OCTRMTBL;   /* GET TTCIN FROM OPCE           */ 00427000
         LR    RPARM,@09                                        04S0531 00428000
*                 CALL IEDQTNT;     /* FIND LINE TTE                 */ 00429000
         L     @15,AVTRNMPT(,RAVT)                              04S0532 00430000
         BALR  @14,@15                                          04S0532 00431000
*                 RTRM=RPARM;       /* SETUP LINE TTE ADDRESS        */ 00432000
         LR    RTRM,RPARM                                       04S0533 00433000
*               END;                                            04S0534 00434000
*             ELSE                                              04S0535 00435000
*               DO;                                             04S0535 00436000
         B     @RC00528                                         04S0535 00437000
@RF00528 DS    0H                                               04S0536 00438000
*                 EXITFLG=ON;       /* PREPARE TO EXIT               */ 00439000
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0536 00440000
*                 OPCMODID=MOD03;   /* SETUP MOD ID                  */ 00441000
         MVC   OPCMODID(2,ROPCAVT),MOD03                        04S0537 00442000
*                 RZERO=MSG541;     /* GROUP HAS NO LINES ATTACHED   */ 00443000
         LA    RZERO,541                                        04S0538 00444000
*                 RPARM=FOUR;       /* SETUP RETURN CODE             */ 00445000
         LA    RPARM,4                                          04S0539 00446000
*               END;                                            04S0540 00447000
*           END;                                                04S0541 00448000
@RC00528 DS    0H                                               04S0542 00449000
*         IF EXITFLG=OFF THEN                                   04S0542 00450000
@RF00526 TM    EXITFLG(ROPCAVT),B'00010000'                     04S0542 00451000
         BNZ   @RF00542                                         04S0542 00452000
*           DO;                                                 04S0543 00453000
*             IF OCSWITCH^=OCSTPLNI THEN/* STOPLINE,C OY14092        */ 00454000
         CLI   OCSWITCH(ROPCE),X'12'                            04S0544 00455000
         BE    @RF00544                                         04S0544 00456000
*               DO;                 /* YES OY14092                   */ 00457000
*                 CALL IPWLSRCH;    /* SEARCH WAITV CHAIN    @OY19465*/ 00458000
         BAL   @14,IPWLSRCH                                     04S0546 00459000
*                 IF RPARM=ZERO THEN                            04S0547 00460000
         LTR   RPARM,RPARM                                      04S0547 00461000
         BNZ   @RF00547                                         04S0547 00462000
*                   DO;             /* IF A MATCH WAS NOT FOUND      */ 00463000
*                     IF OCALLFLG=ON THEN                       04S0549 00464000
         TM    OCALLFLG(ROPCE),B'00000100'                      04S0549 00465000
         BNO   @RF00549                                         04S0549 00466000
*                       DO;         /* CHECK 'ALL' STATUS            */ 00467000
*                         OCSOME=OFF;/* INDICATE AN UNSET STATUS     */ 00468000
*                         OCNONE=OFF;                           04S0552 00469000
         NI    OCSOME(ROPCE),B'11111100'                        04S0552 00470000
*                       END;                                    04S0553 00471000
*                   END;                                        04S0554 00472000
*                 ELSE                                          04S0555 00473000
*                   DO;                                         04S0555 00474000
         B     @RC00547                                         04S0555 00475000
@RF00547 DS    0H                                               04S0556 00476000
*                     IF RPARM->OCSWITCH=OCSTPLNI THEN/* STOPLINE,I     00477000
*                                      OY14092                       */ 00478000
         CLI   OCSWITCH(RPARM),X'12'                            04S0556 00479000
         BNE   @RF00556                                         04S0556 00480000
*                       DO;         /* YES OY14092                   */ 00481000
*                         OCELEM=RPARM;/* ATTACH THE WAITING OPCE       00482000
*                                      OY14092                       */ 00483000
         ST    RPARM,OCELEM(,ROPCE)                             04S0558 00484000
*                         RZERO->OCLINK=RPARM->OCLINK;/* DELINK OPCE    00485000
*                                      OY14092                       */ 00486000
         L     @11,OCLINK(,RPARM)                               04S0559 00487000
         LR    @09,RZERO                                        04S0559 00488000
         ST    @11,OCLINK(,@09)                                 04S0559 00489000
*                         RPARM->OCLINK=RPARM->OCLINK&&RPARM->OCLINK;   00490000
         LR    @09,@11                                          04S0560 00491000
         XR    @09,@11                                          04S0560 00492000
         ST    @09,OCLINK(,RPARM)                               04S0560 00493000
*                                   /* CLEAROY14092                  */ 00494000
*                         OCATTACH=ON;/* INDICATE OPCE IS ATTACHED      00495000
*                                      OY14092                       */ 00496000
         OI    OCATTACH(ROPCE),B'00000010'                      04S0561 00497000
*                       END;        /* OY14092                       */ 00498000
*                     ELSE          /* STOPLINE,C OY14092            */ 00499000
*                       DO;         /* YES OY14092                   */ 00500000
         B     @RC00556                                         04S0563 00501000
@RF00556 DS    0H                                               04S0564 00502000
*                         OCWTGB=OCWTG;/* SETUP BACKUP WHERE-TO-GO   */ 00503000
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                     04S0564 00504000
*                         OCRENTRD=ON;/* SETUP RE-ENTERED FLAG       */ 00505000
         OI    OCRENTRD(ROPCE),B'10000000'                      04S0565 00506000
*                         OCWTG=MODV8;/* SETUP TO RETURN TO THIS        00507000
*                                      MODULE                        */ 00508000
         MVC   OCWTG(2,ROPCE),MODV8                             04S0566 00509000
*                         RZERO=ZERO;/* SETUP INTERFACE TO NEXT MOD  */ 00510000
         SLR   RZERO,RZERO                                      04S0567 00511000
*                         OPCMODID=MOD00;/* SETUP FOR XCTL TO NEXT      00512000
*                                      MODULE                        */ 00513000
         MVC   OPCMODID(2,ROPCAVT),MOD00                        04S0568 00514000
*                         EXITFLG=ON;/* SETUP TO EXIT                */ 00515000
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0569 00516000
*                                                               05S0570 00517000
*                         /*******************************************/ 00518000
*                         /*                                         */ 00519000
*                         /* PROCESS.STPLPROC.WLATTACH: THIS SEGMENT */ 00520000
*                         /* ATTACHES THE INPUT OPCE TO AN OPCE ON   */ 00521000
*                         /* THE WAITV CHAIN WITH THE SAME GROUPNAME */ 00522000
*                         /*                                         */ 00523000
*                         /*******************************************/ 00524000
*                                                               05S0570 00525000
*                         DO WHILE(RPARM->OCATTACH=ON);/* SEARCH FOR    00526000
*                                      LAST OPCE ATTACHED            */ 00527000
         B     @DE00570                                         05S0570 00528000
@DL00570 DS    0H                                               05S0571 00529000
*                           RPARM=RPARM->OCELMPTR;/* GOTO NEXT OPCE  */ 00530000
         SLR   @11,@11                                          05S0571 00531000
         ICM   @11,7,OCELMPTR(RPARM)                            05S0571 00532000
         LR    RPARM,@11                                        05S0571 00533000
*                         END;                                  05S0572 00534000
@DE00570 TM    OCATTACH(RPARM),B'00000010'                      05S0572 00535000
         BO    @DL00570                                         05S0572 00536000
*                         RPARM->OCELMPTR=ROPCE;/* ATTACH INPUT OPCE    00537000
*                                      TO WAIT CHAIN                 */ 00538000
         STCM  ROPCE,7,OCELMPTR(RPARM)                          05S0573 00539000
*                         RPARM->OCATTACH=ON;/* INDICATE OPCE IS        00540000
*                                      ATTACHED                      */ 00541000
         OI    OCATTACH(RPARM),B'00000010'                      05S0574 00542000
*                       END;                                    04S0575 00543000
*                   END;            /* OY14092                       */ 00544000
*               END;                /* OY14092                       */ 00545000
*           END;                                                04S0578 00546000
*       END;                                                    03S0579 00547000
*     ELSE                                                      03S0580 00548000
*       DO;                                                     03S0580 00549000
         B     @RC00515                                         03S0580 00550000
@RF00515 DS    0H                                               03S0581 00551000
*         RPARM=OCTRMTBL;           /* GET TTCIN OF FIRST LINE       */ 00552000
         SLR   RPARM,RPARM                                      03S0581 00553000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0581 00554000
*         CALL IEDQTNT;             /* FIND LINE TTE                 */ 00555000
         L     @15,AVTRNMPT(,RAVT)                              03S0582 00556000
         BALR  @14,@15                                          03S0582 00557000
*         RTRM=RPARM;               /* SETUP TERM BASE               */ 00558000
         LR    RTRM,RPARM                                       03S0583 00559000
*       END;                                                    03S0584 00560000
*     IF TRMSTOTE=ON&OCTOTE=OFF THEN                            03S0585 00561000
@RC00515 LR    @11,RTRM                                         03S0585 00562000
         AL    @11,@CF02313                                     03S0585 00563000
         TM    TRMSTOTE-3(@11),B'00000001'                      03S0585 00564000
         BNO   @RF00585                                         03S0585 00565000
         TM    OCTOTE(ROPCE),B'01000000'                        03S0585 00566000
         BNZ   @RF00585                                         03S0585 00567000
*       DO;                         /* TOTE IN CONTROL       @YM08560*/ 00568000
*         OPCWRKSP(1)=MSG49;        /* SET UP FOR MSG 49     @YM08560*/ 00569000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02222                     03S0587 00570000
*         OPCWRKSP(2)=FOUR;         /* SET                   @YM08560*/ 00571000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   03S0588 00572000
*         EXITFLG=ON;               /* SET UP TO EXIT        @YM08560*/ 00573000
         OI    EXITFLG(ROPCAVT),B'00010000'                     03S0589 00574000
*         CALL IPERROR;             /* DO ERROR PROCESSINF   @YM08560*/ 00575000
         BAL   @14,IPERROR                                      03S0590 00576000
*       END;                                                    03S0591 00577000
*     IF EXITFLG=OFF THEN                                       03S0592 00578000
@RF00585 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0592 00579000
         BNZ   @RF00592                                         03S0592 00580000
*       DO;                         /* IF NOT DONE PROCESSING CHECK     00581000
*                                      FOR SNA REQUEST               */ 00582000
*                                                               04S0594 00583000
*         /***********************************************************/ 00584000
*         /*                                                         */ 00585000
*         /* PROCESS.STPLPROC.SNACHK: CHECK FOR SNA LINE PROCESSING  */ 00586000
*         /*                                                         */ 00587000
*         /***********************************************************/ 00588000
*                                                               04S0594 00589000
*         IF TRMTYPE=TRMSDLC THEN                               04S0594 00590000
         LR    @11,RTRM                                         04S0594 00591000
         AL    @11,@CF01505                                     04S0594 00592000
         CLI   TRMTYPE-11(@11),X'21'                            04S0594 00593000
         BNE   @RF00594                                         04S0594 00594000
*           DO;                     /* IF ITS A SNA LINE SETUP TO       00595000
*                                      EXIT                          */ 00596000
*             OCIPLWA=ZERO;         /* CLEAR OUT FOR ACT/DEACT       */ 00597000
         SLR   @11,@11                                          04S0596 00598000
         ST    @11,OCIPLWA(,ROPCE)                              04S0596 00599000
*             OCPTRSAV=ZERO;        /* CLEAR OUT FOR ACT/DEACT       */ 00600000
         ST    @11,OCPTRSAV(,ROPCE)                             04S0597 00601000
*             OCWTGB=OCWTG;         /* SETUP BACKUP WHERE-TO-GO      */ 00602000
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                     04S0598 00603000
*             OCWTG=MODV8;          /* SETUP TO RETURN TO THIS MODULE*/ 00604000
         MVC   OCWTG(2,ROPCE),MODV8                             04S0599 00605000
*             OPCMODID=MODFC;       /* SETUP TO PROCESS SNA LINE     */ 00606000
         MVC   OPCMODID(2,ROPCAVT),MODFC                        04S0600 00607000
*             IEDQOPCN(1:8)=IEDQOPCN(1:8)&&IEDQOPCN(1:8);/* CLEAR       00608000
*                                      NEGATIVE PREFIX               */ 00609000
         LR    @11,ROPCE                                        04S0601 00610000
         AL    @11,@CF02320                                     04S0601 00611000
         XC    IEDQOPCN(8,@11),IEDQOPCN(@11)                    04S0601 00612000
*             EXITFLG=ON;           /* SETUP TO EXIT                 */ 00613000
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0602 00614000
*           END;                                                04S0603 00615000
*         IF EXITFLG=OFF THEN                                   03S0604 00616000
@RF00594 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0604 00617000
         BNZ   @RF00604                                         03S0604 00618000
*           DO;                     /* IF NOT DONE PROCESSING THEN      00619000
*                                      VERIFY NCP STATUS             */ 00620000
*                                                               04S0606 00621000
*             /*******************************************************/ 00622000
*             /*                                                     */ 00623000
*             /* PROCESS.STPLPROC.NCPCHK: THIS SEGMENT CHECKS FOR    */ 00624000
*             /* STATUS OF NCP                                       */ 00625000
*             /*                                                     */ 00626000
*             /*******************************************************/ 00627000
*                                                               04S0606 00628000
*             IF TRMCOHRT^=ZERO THEN                            04S0606 00629000
         LR    @11,RTRM                                         04S0606 00630000
         AL    @11,@CF02321                                     04S0606 00631000
         ICM   @09,3,TRMCOHRT-4(@11)                            04S0606 00632000
         BZ    @RF00606                                         04S0606 00633000
*               DO;                 /* IF MORE TTES EXIST, CONTINUE     00634000
*                                      PROCESSING                    */ 00635000
*                 RPARM=RTRM;       /* SETUP TTE ADDRESS             */ 00636000
         LR    RPARM,RTRM                                       04S0608 00637000
*                 RFY                                           04S0609 00638000
*                   RSAVE RSTD;                                 04S0609 00639000
*                 RSAVE=ADDR(OPCSAVE);/* SETUP A SAVEAREA            */ 00640000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          04S0610 00641000
*                 CALL COHORTLK;    /* FIND NEXT HIGHER RESOURCE     */ 00642000
         L     @15,OPCHORT(,ROPCAVT)                            04S0611 00643000
         BALR  @14,@15                                          04S0611 00644000
*                 RFY                                           04S0612 00645000
*                   RSAVE UNRSTD;                               04S0612 00646000
*                 RPARM=RPARM-LENGTH(IEDNTRM);/* POINT TO NEGATIVE      00647000
*                                      PREFIX                        */ 00648000
         LA    @11,14                                           04S0613 00649000
         SLR   RPARM,@11                                        04S0613 00650000
*                 RFY                                           04S0614 00651000
*                   REG09 RSTD;                                 04S0614 00652000
*                 REG09=RPARM;      /* SAVE NCP TTE FOR SETUP OF NSL    00653000
*                                      BUFER                         */ 00654000
         LR    REG09,RPARM                                      04S0615 00655000
*                 IF OCACTREQ=OFF&RPARM->TRMINPG=ON THEN        04S0616 00656000
         TM    OCACTREQ(ROPCE),B'00001000'                      04S0616 00657000
         BNZ   @RF00616                                         04S0616 00658000
         TM    TRMINPG(RPARM),B'00100000'                       04S0616 00659000
         BNO   @RF00616                                         04S0616 00660000
*                   DO;             /* IF THIS NOT AN ACT/DEACT RQST    00661000
*                                      AND TERM IS IN PROGRESS       */ 00662000
*                     OPCWRKSP(7)=RPARM;/* SAVE THE NCP ADDR         */ 00663000
         ST    RPARM,OPCWRKSP+24(,ROPCAVT)                      04S0618 00664000
*                     OCBACKUP=''B; /* CLEAR TO INSERT THE UCB  04S0619 00665000
*                                      ADDRESS                       */ 00666000
         XC    OCBACKUP(8,ROPCE),OCBACKUP(ROPCE)                04S0619 00667000
*                     RFY                                       04S0620 00668000
*                       IHADCB BASED(RPARM);/* BASE FOR DCB  @XM05704*/ 00669000
*                     RPARM=RPARM+LENGTH(IEDNTRM);/* BACK TO TTE        00670000
*                                                            @XM05704*/ 00671000
         ALR   RPARM,@11                                        04S0621 00672000
*                     RPARM=RPARM->TRMDESTQ->QCBDCBAD;/* GET DEB ADDR*/ 00673000
         ICM   @11,7,TRMDESTQ(RPARM)                            04S0622 00674000
         SLR   @07,@07                                          04S0622 00675000
         ICM   @07,7,QCBDCBAD(@11)                              04S0622 00676000
         LR    RPARM,@07                                        04S0622 00677000
*                     RPARM=DCBDEBAD;/* GET DEB ADDR         @XM05704*/ 00678000
         L     @11,DCBDEBAD+40(,RPARM)                          04S0623 00679000
         LR    RPARM,@11                                        04S0623 00680000
*                     RFY                                       04S0624 00681000
*                       IHADCB BASED;/*                      @XM05704*/ 00682000
*                     RFY                                       04S0625 00683000
*                       IEDQDEB BASED(RPARM);                   04S0625 00684000
*                     RPARM=RPARM-(ADDR(DEBNMSUB)-ADDR(IEDQDEB));       00685000
         SH    RPARM,@CH00776                                   04S0626 00686000
*                     OCBACKUP(1:3)=DEBUCBAD->UCBNAME;/* INSERT THE     00687000
*                                      UCB ADDRESS                   */ 00688000
         ICM   @11,7,DEBUCBAD(RPARM)                            04S0627 00689000
         MVC   OCBACKUP(3,ROPCE),UCBNAME(@11)                   04S0627 00690000
*                     RPARM=OPCWRKSP(7);/* RESTORE NCP ADDR          */ 00691000
         L     @11,OPCWRKSP+24(,ROPCAVT)                        04S0628 00692000
         LR    RPARM,@11                                        04S0628 00693000
*                     OPCWRKSP(1)=MSG210;/* SETUP ERR MSG NUMBER     */ 00694000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02226                     04S0629 00695000
*                     OPCWRKSP(2)=FOUR;/* SETUP RETURN CODE          */ 00696000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   04S0630 00697000
*                     EXITFLG=ON;   /* PREPARE TO EXIT               */ 00698000
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0631 00699000
*                     CALL IPERROR; /* PROCESS ERROR                 */ 00700000
         BAL   @14,IPERROR                                      04S0632 00701000
*                   END;                                        04S0633 00702000
*               END;                                            04S0634 00703000
*             ELSE                                              04S0635 00704000
*               DO;                                             04S0635 00705000
         B     @RC00606                                         04S0635 00706000
@RF00606 DS    0H                                               04S0636 00707000
*                 OPCWRKSP(1)=MSG400;/* SETUP MSG NUMBER             */ 00708000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02228                     04S0636 00709000
*                 OPCWRKSP(2)=FOUR; /* SETUP ERROR MSG CODE          */ 00710000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00256                   04S0637 00711000
*                 EXITFLG=ON;       /* PREPARE TO EXIT               */ 00712000
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0638 00713000
*                 CALL IPERROR;     /* PROCESS ERRORS                */ 00714000
         BAL   @14,IPERROR                                      04S0639 00715000
*               END;                                            04S0640 00716000
*             IF EXITFLG=OFF THEN                               03S0641 00717000
@RC00606 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0641 00718000
         BNZ   @RF00641                                         03S0641 00719000
*               DO;                 /* IF NOT DONE PROCESSING, VERIFY   00720000
*                                      LINE STATUS                   */ 00721000
*                                                               04S0643 00722000
*                 /***************************************************/ 00723000
*                 /*                                                 */ 00724000
*                 /* PROCESS.STPLPROC.LNCHK: THIS SEGMENT CHECKS     */ 00725000
*                 /* STATUS OF LINE                                  */ 00726000
*                 /*                                                 */ 00727000
*                 /***************************************************/ 00728000
*                                                               04S0643 00729000
*                 IF TRMRSACT=OFF THEN                          04S0643 00730000
         LR    @11,RTRM                                         04S0643 00731000
         SH    @11,@CH01234                                     04S0643 00732000
         TM    TRMRSACT(@11),B'10000000'                        04S0643 00733000
         BNZ   @RF00643                                         04S0643 00734000
*                   DO;             /* IF LINE IS NOT ACTIVE         */ 00735000
*                     IF OCTOTE=ON THEN                         04S0645 00736000
         TM    OCTOTE(ROPCE),B'01000000'                        04S0645 00737000
         BNO   @RF00645                                         04S0645 00738000
*                       TRMSTOTE=ON;/* CHECK FOR TOTE REQUEST        */ 00739000
         OI    TRMSTOTE(@11),B'00000001'                        04S0646 00740000
*                     OPCWRKSP(1)=MSG25;/* SETUP MSG NUMBER          */ 00741000
@RF00645 MVC   OPCWRKSP(4,ROPCAVT),@CF02218                     04S0647 00742000
*                     OPCWRKSP(2)=EIGHT;/* SETUP ERROR MSG CODE      */ 00743000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00045                   04S0648 00744000
*                     EXITFLG=ON;   /* INDICATE EXIT                 */ 00745000
         OI    EXITFLG(ROPCAVT),B'00010000'                     04S0649 00746000
*                     CALL IPERROR; /* PROCESS ERRORS                */ 00747000
         BAL   @14,IPERROR                                      04S0650 00748000
*                   END;                                        04S0651 00749000
*                 IF EXITFLG=OFF THEN                           03S0652 00750000
@RF00643 TM    EXITFLG(ROPCAVT),B'00010000'                     03S0652 00751000
         BNZ   @RF00652                                         03S0652 00752000
*                   DO;             /* IF NOT DONE PROCESSING PREPARE   00753000
*                                      TO BUILD STOPLINE REQUEST     */ 00754000
*                     OCWTGB=OCWTG; /* SETUP BACKUP FIELD TO    03S0654 00755000
*                                      WHERE-TO-GO                   */ 00756000
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                     03S0654 00757000
*                     RPARM=ONE;    /* GET ONE BUFFER UNIT           */ 00758000
         LA    RPARM,1                                          03S0655 00759000
*                     RFY                                       03S0656 00760000
*                       RSAVE RSTD;                             03S0656 00761000
*                     RSAVE=ADDR(OPCSAVE);/* SETUP ADDRESS OF   03S0657 00762000
*                                      SAVEAREA                      */ 00763000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0657 00764000
*                     CALL ALLOCBUF;/* GET A BUFFER UNIT, THEN BUILD    00765000
*                                      STOPLINE REQUEST              */ 00766000
         L     @15,OPCGETBF(,ROPCAVT)                           03S0658 00767000
         BALR  @14,@15                                          03S0658 00768000
*                     RFY                                       03S0659 00769000
*                       RSAVE UNRSTD;                           03S0659 00770000
*                                                               04S0660 00771000
*                     /***********************************************/ 00772000
*                     /*                                             */ 00773000
*                     /* PROCESS.STPLPROC.BLDACT: BUILD A STOPLINE   */ 00774000
*                     /* REQUEST                                     */ 00775000
*                     /*                                             */ 00776000
*                     /***********************************************/ 00777000
*                                                               04S0660 00778000
*                     IEDNSLD(1:LENGTH(IEDNSLD))=''B;/* CLEAR BUFFER */ 00779000
         XC    IEDNSLD(48,RPARM),IEDNSLD(RPARM)                 04S0660 00780000
*/* SETUP NSL BUFFER                                                 */ 00781000
*                                                               04S0661 00782000
*                     IF OCACTREQ=ON THEN                       04S0661 00783000
         TM    OCACTREQ(ROPCE),B'00001000'                      04S0661 00784000
         BNO   @RF00661                                         04S0661 00785000
*                       DO;         /* IF THIS IS RQST FROM     04S0662 00786000
*                                      ACT/DEACT, CHECK FOR TYPE OF     00787000
*                                      RQST                          */ 00788000
*                         IF OCFLUSHZ=ON THEN                   04S0663 00789000
         LR    @11,ROPCE                                        04S0663 00790000
         AL    @11,@CF02322                                     04S0663 00791000
         TM    OCFLUSHZ-2(@11),B'10000000'                      04S0663 00792000
         BNO   @RF00663                                         04S0663 00793000
*                           NSLREQTY=NSLCLOSN;/* IF THIS IS FLUSH       00794000
*                                      CLOSEDOWN, INDICATE FLUSH TO     00795000
*                                      NSL                           */ 00796000
         MVI   NSLREQTY(RPARM),X'0B'                            04S0664 00797000
*                         ELSE                                  04S0665 00798000
*                           IF REG09->TRMNCPCL=ON THEN          04S0665 00799000
         B     @RC00663                                         04S0665 00800000
@RF00663 TM    TRMNCPCL(REG09),B'01000000'                      04S0665 00801000
         BNO   @RF00665                                         04S0665 00802000
*                             NSLREQTY=NSLSTOPL;/* IF CLOSEDOWN IN      00803000
*                                      PROGRESS, PROCESS STOPLINE,C  */ 00804000
         MVI   NSLREQTY(RPARM),X'02'                            04S0666 00805000
*                           ELSE                                04S0667 00806000
*                             NSLREQTY=NSLSTPLI;/* ELSE IT'S 'F 04S0667 00807000
*                                      DEACT' RQST                   */ 00808000
         B     @RC00665                                         04S0667 00809000
@RF00665 MVI   NSLREQTY(RPARM),X'09'                            04S0667 00810000
*                         RFY                                   04S0668 00811000
*                           REG09 UNRSTD;                       04S0668 00812000
@RC00665 DS    0H                                               04S0668 00813000
@RC00663 DS    0H                                               04S0669 00814000
*                       END;                                    04S0669 00815000
*                     ELSE                                      04S0670 00816000
*                       DO;                                     04S0670 00817000
         B     @RC00661                                         04S0670 00818000
@RF00661 DS    0H                                               04S0671 00819000
*                         IF OCSWITCH=OCSTPLNI THEN             04S0671 00820000
         CLI   OCSWITCH(ROPCE),X'12'                            04S0671 00821000
         BNE   @RF00671                                         04S0671 00822000
*                           NSLREQTY=NSLSTPLI;/* IF THIS IS A   04S0672 00823000
*                                      STOPLINE,I CMD, INDICATE FOR     00824000
*                                      NSL                           */ 00825000
         MVI   NSLREQTY(RPARM),X'09'                            04S0672 00826000
*                         ELSE                                  04S0673 00827000
*                           NSLREQTY=NSLSTOPL;/* ELSE THIS IS A 04S0673 00828000
*                                      STOPLINE,C CMD                */ 00829000
         B     @RC00671                                         04S0673 00830000
@RF00671 MVI   NSLREQTY(RPARM),X'02'                            04S0673 00831000
*                       END;                                    04S0674 00832000
@RC00671 DS    0H                                               04S0675 00833000
*                     NSLFLGBK=OPRVE;/* SETUP MOD NAME               */ 00834000
@RC00661 MVI   NSLFLGBK(RPARM),X'05'                            04S0675 00835000
*                     NSLPRIBK=PRIMEDFG;/* SETUP PRIORITY            */ 00836000
         MVI   NSLPRIBK(RPARM),X'DF'                            04S0676 00837000
*                     NSLGRPNM=OCBACKUP;/* SETUP GROUP NAME          */ 00838000
         MVC   NSLGRPNM(8,RPARM),OCBACKUP(ROPCE)                04S0677 00839000
*                     NSLTTEPT=RTRM;/* SETUP LINE TTE ADDRESS        */ 00840000
         ST    RTRM,NSLTTEPT(,RPARM)                            04S0678 00841000
*/* SETUP OPRE FIELDS                                                */ 00842000
*                                                               04S0679 00843000
*                     OPREPRI=PRIOPCTL;/* SETUP POST PRIORITY        */ 00844000
         MVI   OPREPRI(RPARM),X'DC'                             04S0679 00845000
*                     OPREQCB=SAVTSPLN;/* SETUP STOPLINE QCB ADDR    */ 00846000
         L     @11,AVTSAVTP(,RAVT)                              04S0680 00847000
         MVC   OPREQCB(3,RPARM),SAVTSPLN+1(@11)                 04S0680 00848000
*/* SETUP SVC 102 PAREMETER LIST AND ISSUE SVC 102                   */ 00849000
*                                                               04S0681 00850000
*                     OPCAQWD1=RPARM;/* SETUP BUFF ADDR              */ 00851000
         ST    RPARM,OPCAQWD1(,ROPCAVT)                         04S0681 00852000
*                     OPCAQWD2=RPARM;/* SETUP BUFF ADDR              */ 00853000
         ST    RPARM,OPCAQWD2(,ROPCAVT)                         04S0682 00854000
*                     OPCAQREQ=OPRQST;/* TPOST REQUEST               */ 00855000
         MVC   OPCAQREQ(1,ROPCAVT),OPRQST                       04S0683 00856000
*                     OPCAQRQ2=OPEND;/* END OF LIST                  */ 00857000
         MVC   OPCAQRQ2(1,ROPCAVT),OPEND                        04S0684 00858000
*                     RPARM=ADDR(OPCAQCTL);/* SETUP ADDRESS OF PLIST */ 00859000
         LA    RPARM,OPCAQCTL(,ROPCAVT)                         04S0685 00860000
*                     GEN(SVC 102); /* POST ELEM TO IEDNSL           */ 00861000
         SVC 102                                                        00862000
*/* SETUP TO EXIT TO NEXT MODULE                                     */ 00863000
*                                                               04S0687 00864000
*                     OCWTG=MODVE;  /* SETUP WHERE-TO-GO FIELD       */ 00865000
         MVC   OCWTG(2,ROPCE),MODVE                             04S0687 00866000
*                     OCDACTIP=OFF; /* TURN DEACT-IN-PROG FLAG OFF      00867000
*                                                            @OY19465*/ 00868000
         NI    OCDACTIP(ROPCE),B'10111111'                      04S0688 00869000
*                     OCLINK=OPCWAITV;/* GET FIRST OPCE              */ 00870000
         MVC   OCLINK(4,ROPCE),OPCWAITV(ROPCAVT)                04S0689 00871000
*                     OPCWAITV=ROPCE;/* LINK THIS OPCE TO THE   04S0690 00872000
*                                      BEGINNING OF THE OPCWAITV        00873000
*                                      CHAIN                         */ 00874000
         ST    ROPCE,OPCWAITV(,ROPCAVT)                         04S0690 00875000
*                     RZERO=ZERO;   /* SETUP INTERFACE TO NEXT MOD   */ 00876000
         SLR   RZERO,RZERO                                      04S0691 00877000
*                     OPCMODID=MOD00;/* SETUP TO XCTL TO NEXT MODULE */ 00878000
         MVC   OPCMODID(2,ROPCAVT),MOD00                        04S0692 00879000
*                   END;                                        03S0693 00880000
*               END;                                            03S0694 00881000
@RF00652 DS    0H                                               03S0695 00882000
*           END;                                                03S0695 00883000
@RF00641 DS    0H                                               03S0696 00884000
*       END;                                                    03S0696 00885000
@RF00604 DS    0H                                               03S0697 00886000
*   END;                                                        02S0697 00887000
@RF00592 DS    0H                                               02S0697 00888000
@DE00513 TM    FIRSTREQ(ROPCAVT),B'11000000'                    02S0697 00889000
         BNZ   @DL00513                                         02S0697 00890000
*                                                               02S0698 00891000
*   /*****************************************************************/ 00892000
*   /*                                                               */ 00893000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00894000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT.                    */ 00895000
*   /*                                                               */ 00896000
*   /*****************************************************************/ 00897000
*                                                               02S0698 00898000
*   OPCFLAG1=ZERO;                  /* CLEAR FLAG FIELDS             */ 00899000
         MVI   OPCFLAG1(ROPCAVT),X'00'                          02S0698 00900000
*   RPARM=ROPCAVT;                  /* SET THE ARGUMENT REGISTER IN     00901000
*                                      PREPARATION TO TRANSFERRING      00902000
*                                      CONTROL TO THE NEXT MODULE    */ 00903000
         LR    RPARM,ROPCAVT                                    02S0699 00904000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0700 00905000
*                                   /*                                  00906000
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO           00907000
*                                                               02S0701 00908000
*   /*****************************************************************/ 00909000
*   /*                                                               */ 00910000
*   /* IPERROR: THIS SEGMENT PERFORMS FINAL ERROR PROCESSING         */ 00911000
*   /*                                                               */ 00912000
*   /*****************************************************************/ 00913000
*                                                               02S0701 00914000
*IPERROR:                                                       02S0701 00915000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0701 00916000
@EL00001 DS    0H                                               02S0701 00917000
@EF00001 DS    0H                                               02S0701 00918000
@ER00001 BR    @14                                              02S0701 00919000
IPERROR  DS    0H                                               02S0702 00920000
*   OPCWRKSP(3)=REG14;              /* SAVE RETURN ADDRESS           */ 00921000
         ST    REG14,OPCWRKSP+8(,ROPCAVT)                       02S0702 00922000
*                                                               03S0703 00923000
*   /*****************************************************************/ 00924000
*   /*                                                               */ 00925000
*   /* PROCESS.IPERROR.UPDSTATE: THIS SEGMENT UPDATES STATUS FOR ALL */ 00926000
*   /* ERROR PROCESSING                                              */ 00927000
*   /*                                                               */ 00928000
*   /*****************************************************************/ 00929000
*                                                               03S0703 00930000
*   IF OCALLFLG=ON THEN                                         03S0703 00931000
         TM    OCALLFLG(ROPCE),B'00000100'                      03S0703 00932000
         BNO   @RF00703                                         03S0703 00933000
*     DO;                           /* CHECK FOR STOPLINE,ALL REQUEST*/ 00934000
*       IF OCSOME=OFF THEN                                      03S0705 00935000
         TM    OCSOME(ROPCE),B'00000010'                        03S0705 00936000
         BNZ   @RF00705                                         03S0705 00937000
*         DO;                       /* IF STATUS IS UNSET OR NO LINES   00938000
*                                      STOPPED                       */ 00939000
*           OCNONE=ON;              /* INDICATE NO LINES STOPPED     */ 00940000
         OI    OCNONE(ROPCE),B'00000001'                        03S0707 00941000
*           OPCWRKSP(1)=MSG544;     /* SETUP MSG NUMBER              */ 00942000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02240                     03S0708 00943000
*         END;                                                  03S0709 00944000
*       ELSE                                                    03S0710 00945000
*         DO;                                                   03S0710 00946000
         B     @RC00705                                         03S0710 00947000
@RF00705 DS    0H                                               03S0711 00948000
*           OCNONE=OFF;             /* INDICATE SOME LINES STOPPED   */ 00949000
         NI    OCNONE(ROPCE),B'11111110'                        03S0711 00950000
*           OPCWRKSP(1)=MSG545;     /* SETUP MSG NUMBER              */ 00951000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02242                     03S0712 00952000
*         END;                                                  03S0713 00953000
*       CALL IPMLNCHK;              /* CHECK FOR MORE LINES          */ 00954000
@RC00705 BAL   @14,IPMLNCHK                                     03S0714 00955000
*     END;                                                      03S0715 00956000
*   IF MORLINES=OFF THEN                                        02S0716 00957000
@RF00703 TM    MORLINES(ROPCAVT),B'01000000'                    02S0716 00958000
         BNZ   @RF00716                                         02S0716 00959000
*     DO;                           /* IF NO MORE LINES TO PROCESS,     00960000
*                                      EXIT                          */ 00961000
*       IF OCWTG=ZERO THEN                                      02S0718 00962000
         ICM   @11,3,OCWTG(ROPCE)                               02S0718 00963000
         BNZ   @RF00718                                         02S0718 00964000
*         DO;                       /* IF THIS IS AN EXTERNAL CALLER,   00965000
*                                      SETUP FOR EXIT                */ 00966000
*           RZERO=OPCWRKSP(1);      /* SETUP MSG NUMBER              */ 00967000
         L     RZERO,OPCWRKSP(,ROPCAVT)                         02S0720 00968000
*           RPARM=OPCWRKSP(2);      /* SETUP MSG CODE                */ 00969000
         L     RPARM,OPCWRKSP+4(,ROPCAVT)                       02S0721 00970000
*           OPCMODID=MOD03;         /* SETUP NEXT MODULE TO GET 02S0722 00971000
*                                      CONTROL                       */ 00972000
         MVC   OPCMODID(2,ROPCAVT),MOD03                        02S0722 00973000
*           IF OCSOME=ON THEN                                   02S0723 00974000
         TM    OCSOME(ROPCE),B'00000010'                        02S0723 00975000
         BNO   @RF00723                                         02S0723 00976000
*             DO;                   /* IF SOME LINES HAVE BEEN  02S0724 00977000
*                                      STOPPED SUCCESSFULLY THEN        00978000
*                                      CHKPT THEM                    */ 00979000
*               OCPARM=RZERO;       /* SAVE MSG NUMBER       @YM06145*/ 00980000
         STH   RZERO,OCPARM(,ROPCE)                             02S0725 00981000
*               OCWTG=MOD03;        /* SETUP WHERE-TO-GO             */ 00982000
         MVC   OCWTG(2,ROPCE),MOD03                             02S0726 00983000
*               OPCMODID=MOD06;     /* SETUP EXIT TO CHKPOINT        */ 00984000
         MVC   OPCMODID(2,ROPCAVT),MOD06                        02S0727 00985000
*             END;                                              02S0728 00986000
*           CALL IPEXTERN;          /* PERFORM NON-INTERNAL     02S0729 00987000
*                                      INVOCATION PROCESSING         */ 00988000
@RF00723 BAL   @14,IPEXTERN                                     02S0729 00989000
*         END;                                                  02S0730 00990000
*       ELSE                                                    02S0731 00991000
*         CALL IPINTERN;            /* PERFORM INTERNAL INVOCATION      00992000
*                                      PROCESSING                    */ 00993000
         B     @RC00718                                         02S0731 00994000
@RF00718 BAL   @14,IPINTERN                                     02S0731 00995000
*     END;                                                      02S0732 00996000
@RC00718 DS    0H                                               02S0733 00997000
*   REG14=OPCWRKSP(3);              /* RESTORE RETURN ADDRESS        */ 00998000
@RF00716 L     REG14,OPCWRKSP+8(,ROPCAVT)                       02S0733 00999000
*   END;                                                        02S0734 01000000
@EL00002 DS    0H                                               02S0734 01001000
@EF00002 DS    0H                                               02S0734 01002000
@ER00002 BR    @14                                              02S0734 01003000
*                                                               02S0735 01004000
*   /*****************************************************************/ 01005000
*   /*                                                               */ 01006000
*   /* IPEXTERN: THIS INTERNAL PROCEDURE PROCESSES ALL EXTERNAL      */ 01007000
*   /* INVOCATIONS TO STOPLINE                                       */ 01008000
*   /*                                                               */ 01009000
*   /*****************************************************************/ 01010000
*                                                               02S0735 01011000
*IPEXTERN:                                                      02S0735 01012000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0735 01013000
IPEXTERN DS    0H                                               02S0736 01014000
*   IF OCTOTE=ON THEN                                           02S0736 01015000
         TM    OCTOTE(ROPCE),B'01000000'                        02S0736 01016000
         BNO   @RF00736                                         02S0736 01017000
*     DO;                           /* IF THIS IS TOTE INPUT         */ 01018000
*       OCWTG=MOD07;                /* SETUP WHERE-TO-GO-FIELD       */ 01019000
         MVC   OCWTG(2,ROPCE),MOD07                             02S0738 01020000
*       OCPARM=RPARM;               /* SETUP INTERFACE TO NEXT MODULE*/ 01021000
         STH   RPARM,OCPARM(,ROPCE)                             02S0739 01022000
*       RZERO=RPARM;                                            02S0740 01023000
         LR    RZERO,RPARM                                      02S0740 01024000
*       IF OPCMODID=MOD03 THEN                                  02S0741 01025000
         CLC   OPCMODID(2,ROPCAVT),MOD03                        02S0741 01026000
         BNE   @RF00741                                         02S0741 01027000
*         DO;                       /* IF NEXT MOD IS MSG MOD        */ 01028000
*           OPCMODID=MOD07;         /* RESET NEXT MOD ID             */ 01029000
         MVC   OPCMODID(2,ROPCAVT),MOD07                        02S0743 01030000
*           OCWTG=ZERO;             /* INITIALIZE WHERE-TO-GO FIELD  */ 01031000
         SLR   @11,@11                                          02S0744 01032000
         STH   @11,OCWTG(,ROPCE)                                02S0744 01033000
*         END;                                                  02S0745 01034000
*     END;                                                      02S0746 01035000
*   END;                                                        02S0747 01036000
@EL00003 DS    0H                                               02S0747 01037000
@EF00003 DS    0H                                               02S0747 01038000
@ER00003 BR    @14                                              02S0747 01039000
*                                                               02S0748 01040000
*   /*****************************************************************/ 01041000
*   /*                                                               */ 01042000
*   /* IPEXIT: THIS INTERNAL PROCEDURE PERFORMS ALL NORMAL EXIT      */ 01043000
*   /* PROCESSING                                                    */ 01044000
*   /*                                                               */ 01045000
*   /*****************************************************************/ 01046000
*                                                               02S0748 01047000
*IPEXIT:                                                        02S0748 01048000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0748 01049000
IPEXIT   DS    0H                                               02S0749 01050000
*   OPCWRKSP(5)=REG14;              /* SAVE RETURN ADDRESS           */ 01051000
         ST    REG14,OPCWRKSP+16(,ROPCAVT)                      02S0749 01052000
*                                                               03S0750 01053000
*   /*****************************************************************/ 01054000
*   /*                                                               */ 01055000
*   /* PROCESS.IPEXIT.UPDSTATN: THIS SEGMENT UPDATES ALL STATUS FOR  */ 01056000
*   /* NORMAL PROCESSING                                             */ 01057000
*   /*                                                               */ 01058000
*   /*****************************************************************/ 01059000
*                                                               03S0750 01060000
*   IF OCALLFLG=ON THEN                                         03S0750 01061000
         TM    OCALLFLG(ROPCE),B'00000100'                      03S0750 01062000
         BNO   @RF00750                                         03S0750 01063000
*     DO;                           /* CHECK FOR A STOPLINE,ALL 03S0751 01064000
*                                      REQUEST                       */ 01065000
*       IF(OCSOME=OFF&OCNONE=OFF)|(OCSOME=ON&OCNONE=ON) THEN    03S0752 01066000
         TM    OCSOME(ROPCE),B'00000011'                        03S0752 01067000
         BZ    @RT00752                                         03S0752 01068000
         TM    OCSOME(ROPCE),B'00000011'                        03S0752 01069000
         BNO   @RF00752                                         03S0752 01070000
@RT00752 DS    0H                                               03S0753 01071000
*         DO;                       /* IF ALL LINES HAVE BEEN STOPPED   01072000
*                                      OR STATUS IS UNSET            */ 01073000
*           OCSOME=ON;              /* INDICATE ALL LINES HAVE       */ 01074000
*           OCNONE=ON;              /* BEEN STOPPED                  */ 01075000
         OI    OCSOME(ROPCE),B'00000011'                        03S0755 01076000
*           OPCWRKSP(1)=MSG543;     /* SETUP MSG NUMBER              */ 01077000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02238                     03S0756 01078000
*         END;                                                  03S0757 01079000
*       ELSE                                                    03S0758 01080000
*         DO;                                                   03S0758 01081000
         B     @RC00752                                         03S0758 01082000
@RF00752 DS    0H                                               03S0759 01083000
*           OCSOME=ON;              /* INDICATE SOME LINES HAVE      */ 01084000
*           OCNONE=OFF;             /* BEEN STOPPED                  */ 01085000
         OI    OCSOME(ROPCE),B'00000010'                        03S0760 01086000
         NI    OCNONE(ROPCE),B'11111110'                        03S0760 01087000
*           OPCWRKSP(1)=MSG545;     /* SETUP MSG NUMBER              */ 01088000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02242                     03S0761 01089000
*         END;                                                  03S0762 01090000
*       CALL IPMLNCHK;              /* CHECK FOR MORE LINES          */ 01091000
@RC00752 BAL   @14,IPMLNCHK                                     03S0763 01092000
*     END;                                                      03S0764 01093000
*   IF MORLINES=OFF THEN                                        02S0765 01094000
@RF00750 TM    MORLINES(ROPCAVT),B'01000000'                    02S0765 01095000
         BNZ   @RF00765                                         02S0765 01096000
*     DO;                           /* IF NO MORE LINES TO PROCESS      01097000
*                                      THEN                          */ 01098000
*       IF OCWTG=ZERO THEN                                      02S0767 01099000
         ICM   @11,3,OCWTG(ROPCE)                               02S0767 01100000
         BNZ   @RF00767                                         02S0767 01101000
*         DO;                       /* IF THIS IS AN EXTERNAL CALL      01102000
*                                      THEN PROCESS CALL             */ 01103000
*           RZERO=OPCWRKSP(1);      /* SETUP INTERFACE TO NEXT MOD   */ 01104000
         L     RZERO,OPCWRKSP(,ROPCAVT)                         02S0769 01105000
*           RPARM=OPCWRKSP(2);                                  02S0770 01106000
         L     RPARM,OPCWRKSP+4(,ROPCAVT)                       02S0770 01107000
*           OCPARM=RZERO;                                       02S0771 01108000
         STH   RZERO,OCPARM(,ROPCE)                             02S0771 01109000
*           OPCMODID=MOD06;         /* SETUP NEXT MOD ID             */ 01110000
         MVC   OPCMODID(2,ROPCAVT),MOD06                        02S0772 01111000
*           OCWTG=MOD09;            /* SETUP WHERE-TO-GO FIELD       */ 01112000
         MVC   OCWTG(2,ROPCE),MOD09                             02S0773 01113000
*           CALL IPEXTERN;          /* PROCESS EXTERNAL INVOCATION   */ 01114000
         BAL   @14,IPEXTERN                                     02S0774 01115000
*         END;                                                  02S0775 01116000
*       ELSE                                                    02S0776 01117000
*         CALL IPINTERN;            /* ELSE PROCESS INTERNAL    02S0776 01118000
*                                      INVOCATION                    */ 01119000
         B     @RC00767                                         02S0776 01120000
@RF00767 BAL   @14,IPINTERN                                     02S0776 01121000
*     END;                                                      02S0777 01122000
@RC00767 DS    0H                                               02S0778 01123000
*   REG14=OPCWRKSP(5);              /* RESTORE RETURN ADDRESS        */ 01124000
@RF00765 L     REG14,OPCWRKSP+16(,ROPCAVT)                      02S0778 01125000
*   END;                                                        02S0779 01126000
@EL00004 DS    0H                                               02S0779 01127000
@EF00004 DS    0H                                               02S0779 01128000
@ER00004 BR    @14                                              02S0779 01129000
*                                                               02S0780 01130000
*   /*****************************************************************/ 01131000
*   /*                                                               */ 01132000
*   /* IPINTERN: THIS INTERNAL PROCEDURE PROCESSES INTERNAL          */ 01133000
*   /* INVOCATIONS FOR STOPLINE                                      */ 01134000
*   /*                                                               */ 01135000
*   /*****************************************************************/ 01136000
*                                                               02S0780 01137000
*IPINTERN:                                                      02S0780 01138000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0780 01139000
IPINTERN DS    0H                                               02S0781 01140000
*   RFY                                                         02S0781 01141000
*     RSAVE RSTD;                                               02S0781 01142000
*   OPCWRKSP(4)=REG14;              /* SAVE RETURN REGISTER  @YM07370*/ 01143000
         ST    REG14,OPCWRKSP+12(,ROPCAVT)                      02S0782 01144000
*   OCPARM=OPCWRKSP(1);             /* SETUP MSG NUMBER              */ 01145000
         L     @11,OPCWRKSP(,ROPCAVT)                           02S0783 01146000
         STH   @11,OCPARM(,ROPCE)                               02S0783 01147000
*   RZERO=OPCWRKSP(1);              /* SETUP FOR NEXT MODULE         */ 01148000
         LR    RZERO,@11                                        02S0784 01149000
*   OPCMODID=OCWTG;                 /* SETUP FOR NEXT MODULE         */ 01150000
         MVC   OPCMODID(2,ROPCAVT),OCWTG(ROPCE)                 02S0785 01151000
*   OCWTG=ZERO;                     /* CLEAR WHERE-TO-GO FIELD       */ 01152000
         SLR   @09,@09                                          02S0786 01153000
         STH   @09,OCWTG(,ROPCE)                                02S0786 01154000
*   IF OPCMODID=MODFG&OCPARM=MSG199 THEN                        02S0787 01155000
         CLC   OPCMODID(2,ROPCAVT),MODFG                        02S0787 01156000
         BNE   @RF00787                                         02S0787 01157000
         CH    @11,@CH02224                                     02S0787 01158000
         BNE   @RF00787                                         02S0787 01159000
*     DO;                           /* IF EXIT IS TO DEACT           */ 01160000
*       RPARM=OCUNIT;               /* SETUP TO FREE UNIT            */ 01161000
         L     RPARM,OCUNIT(,ROPCE)                             02S0789 01162000
*       RSAVE=ADDR(OPCSAVE);        /* SETUP ADDRESS OF SAVE AREA    */ 01163000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          02S0790 01164000
*       CALL FREEBUFF;              /* FREE UNIT                     */ 01165000
         L     @15,OPCFREBF(,ROPCAVT)                           02S0791 01166000
         BALR  @14,@15                                          02S0791 01167000
*       OCUNIT=INVALTIC;            /* SETUP INVALID TIC             */ 01168000
         MVC   OCUNIT(4,ROPCE),@CF01775                         02S0792 01169000
*     END;                                                      02S0793 01170000
*   ELSE                                                        02S0794 01171000
*     IF OPCMODID=MOD07 THEN                                    02S0794 01172000
         B     @RC00787                                         02S0794 01173000
@RF00787 CLC   OPCMODID(2,ROPCAVT),MOD07                        02S0794 01174000
         BNE   @RF00794                                         02S0794 01175000
*       DO;                         /* IF WRITE MODULE IS NEXT MODULE   01176000
*                                      TO GET CONTROL                */ 01177000
*         OCPARM=ZERO;              /* RESET MSG NUMBER              */ 01178000
         SLR   @11,@11                                          02S0796 01179000
         STH   @11,OCPARM(,ROPCE)                               02S0796 01180000
*         RZERO=ZERO;               /* RESET MSG NUMBER              */ 01181000
         SLR   RZERO,RZERO                                      02S0797 01182000
*       END;                                                    02S0798 01183000
*   REG14=OPCWRKSP(4);              /* RESTORE RETURN ADDRESS   02S0799 01184000
*                                                            @YM07370*/ 01185000
@RF00794 DS    0H                                               02S0799 01186000
@RC00787 L     REG14,OPCWRKSP+12(,ROPCAVT)                      02S0799 01187000
*   END;                                                        02S0800 01188000
@EL00005 DS    0H                                               02S0800 01189000
@EF00005 DS    0H                                               02S0800 01190000
@ER00005 BR    @14                                              02S0800 01191000
*   RFY                                                         02S0801 01192000
*     RSAVE UNRSTD;                                             02S0801 01193000
*                                                               02S0802 01194000
*   /*****************************************************************/ 01195000
*   /*                                                               */ 01196000
*   /* IPMLNCHK: THIS INTERNAL PROCEDURE CHECKS FOR MORE LINES TO    */ 01197000
*   /* PROCESS                                                       */ 01198000
*   /*                                                               */ 01199000
*   /*****************************************************************/ 01200000
*                                                               02S0802 01201000
*IPMLNCHK:                                                      02S0802 01202000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0802 01203000
IPMLNCHK DS    0H                                               02S0803 01204000
*   OPCWRKSP(4)=REG14;              /* SAVE RETURN ADDRESS           */ 01205000
         ST    REG14,OPCWRKSP+12(,ROPCAVT)                      02S0803 01206000
*   RPARM=TRMCOHTG;                 /* GET TTCIN OF LINE             */ 01207000
         LR    @11,RTRM                                         02S0804 01208000
         AL    @11,@CF02322                                     02S0804 01209000
         SLR   RPARM,RPARM                                      02S0804 01210000
         ICM   RPARM,3,TRMCOHTG-8(@11)                          02S0804 01211000
*   CALL IEDQTNT;                   /* GET LINE TTE                  */ 01212000
         L     @15,AVTRNMPT(,RAVT)                              02S0805 01213000
         BALR  @14,@15                                          02S0805 01214000
*   RPARM=RPARM-LENGTH(IEDNTRM);    /* BACKUP TO NEGATIVE PREFIX     */ 01215000
         SH    RPARM,@CH01234                                   02S0806 01216000
*   IF RPARM->TRMTYPE=TRMGRP THEN                               02S0807 01217000
         CLI   TRMTYPE(RPARM),X'00'                             02S0807 01218000
         BNE   @RF00807                                         02S0807 01219000
*     MORLINES=OFF;                 /* IF GROUP TTE, INDICATE NO MORE   01220000
*                                      LINES TO PROCESS              */ 01221000
         NI    MORLINES(ROPCAVT),B'10111111'                    02S0808 01222000
*   ELSE                                                        02S0809 01223000
*     DO;                           /* IF IT'S A LINE TTE CONTINUE      01224000
*                                      PROCESSING                    */ 01225000
         B     @RC00807                                         02S0809 01226000
@RF00807 DS    0H                                               02S0810 01227000
*       MORLINES=ON;                /* INDICATE MORLINES TO PROCESS  */ 01228000
         OI    MORLINES(ROPCAVT),B'01000000'                    02S0810 01229000
*       OCTRMTBL=TRMCOHTG;          /* SETUP TTCIN OF NEW LINE TO       01230000
*                                      PROCESS                       */ 01231000
         LR    @11,RTRM                                         02S0811 01232000
         AL    @11,@CF02322                                     02S0811 01233000
         MVC   OCTRMTBL(2,ROPCE),TRMCOHTG-8(@11)                02S0811 01234000
*     END;                                                      02S0812 01235000
*   REG14=OPCWRKSP(4);              /* RESTORE RETURN ADDRESS        */ 01236000
@RC00807 L     REG14,OPCWRKSP+12(,ROPCAVT)                      02S0813 01237000
*   END;                                                        02S0814 01238000
@EL00006 DS    0H                                               02S0814 01239000
@EF00006 DS    0H                                               02S0814 01240000
@ER00006 BR    @14                                              02S0814 01241000
*                                                               02S0815 01242000
*   /*****************************************************************/ 01243000
*   /*                                                               */ 01244000
*   /* IPWLSRCH: THIS INTERNAL PROCEDURE SEARCHES THE OPCWAITV CHAIN */ 01245000
*   /* FOR AN OPCE WITH THE SAME GROUPNAME AS THE INPUT OPCE         */ 01246000
*   /*                                                               */ 01247000
*   /*****************************************************************/ 01248000
*                                                               02S0815 01249000
*IPWLSRCH:                                                      02S0815 01250000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0815 01251000
IPWLSRCH DS    0H                                               02S0816 01252000
*   RZERO=ADDR(OPCWAITV);           /* SETUP ADDR OF OPCWAITV        */ 01253000
         LA    RZERO,OPCWAITV(,ROPCAVT)                         02S0816 01254000
*   RPARM=OPCWAITV;                 /* GET FIRST ELEMENT ON THE CHAIN*/ 01255000
         L     RPARM,OPCWAITV(,ROPCAVT)                         02S0817 01256000
*   RPARM=RPARM&MASKBYTE;           /* CLEAR HI BYTE         @YM06061*/ 01257000
         N     RPARM,@CF02216                                   02S0818 01258000
*   WAITFLG=ON;                     /* INITIALIZE WAIT INDICATOR     */ 01259000
         OI    WAITFLG(ROPCAVT),B'00100000'                     02S0819 01260000
*   DO WHILE(WAITFLG=ON);           /* SEARCH CHAIN FOR MATCHING        01261000
*                                      GROUPNAME                     */ 01262000
         B     @DE00820                                         02S0820 01263000
@DL00820 DS    0H                                               02S0821 01264000
*     IF RPARM=ZERO THEN            /* IF THIS IS END OF CHAIN, SETUP   01265000
*                                      TO EXIT                       */ 01266000
         LTR   RPARM,RPARM                                      02S0821 01267000
         BNZ   @RF00821                                         02S0821 01268000
*       WAITFLG=OFF;                /* INDICATE SEARCH ENDED         */ 01269000
         NI    WAITFLG(ROPCAVT),B'11011111'                     02S0822 01270000
*     ELSE                                                      02S0823 01271000
*       DO;                                                     02S0823 01272000
         B     @RC00821                                         02S0823 01273000
@RF00821 DS    0H                                               02S0824 01274000
*         IF OCBACKUP=RPARM->OCBACKUP THEN                      02S0824 01275000
         CLC   OCBACKUP(8,ROPCE),OCBACKUP(RPARM)                02S0824 01276000
         BNE   @RF00824                                         02S0824 01277000
*           DO;                     /* GROUPS MATCH          @OY19465*/ 01278000
*             IF OCRESP^=ON THEN                                02S0826 01279000
         TM    OCRESP(ROPCE),B'00000001'                        02S0826 01280000
         BO    @RF00826                                         02S0826 01281000
*               WAITFLG=OFF;        /* IF THIS IS A REQUEST THEN TURN   01282000
*                                      WAITFLG OFF BECAUSE ALL WE       01283000
*                                      NEED TO MATCH ARE GROUPS 02S0827 01284000
*                                                            @OY19465*/ 01285000
         NI    WAITFLG(ROPCAVT),B'11011111'                     02S0827 01286000
*             ELSE                                              02S0828 01287000
*               IF OCTRMTBL=RPARM->OCTRMTBL&RPARM->OCDACTIP=ON THEN     01288000
         B     @RC00826                                         02S0828 01289000
@RF00826 CLC   OCTRMTBL(2,ROPCE),OCTRMTBL(RPARM)                02S0828 01290000
         BNE   @RF00828                                         02S0828 01291000
         TM    OCDACTIP(RPARM),B'01000000'                      02S0828 01292000
         BNO   @RF00828                                         02S0828 01293000
*                 WAITFLG=OFF;      /* ENSURE ON A RESPONSE THAT THIS   01294000
*                                      IS THE CORRECT OPCE BY   02S0829 01295000
*                                      MATCHING TTCINS       @OY19465*/ 01296000
         NI    WAITFLG(ROPCAVT),B'11011111'                     02S0829 01297000
*               ELSE                                            02S0830 01298000
*                 DO;               /* NOT CORRECT OPCE      @OY19465*/ 01299000
         B     @RC00828                                         02S0830 01300000
@RF00828 DS    0H                                               02S0831 01301000
*                   RZERO=RPARM;    /* SAVE PREVIOUS OPCE ADDRESS       01302000
*                                                            @OY19465*/ 01303000
         LR    RZERO,RPARM                                      02S0831 01304000
*                   RPARM=RPARM->OCLINK;/* SETUP ADDRESS OF NEXT OPCE   01305000
*                                      ON CHAIN              @OY19465*/ 01306000
         L     RPARM,OCLINK(,RPARM)                             02S0832 01307000
*                 END;              /*                       @OY19465*/ 01308000
*           END;                                                02S0834 01309000
*         ELSE                                                  02S0835 01310000
*           DO;                                                 02S0835 01311000
         B     @RC00824                                         02S0835 01312000
@RF00824 DS    0H                                               02S0836 01313000
*             RZERO=RPARM;          /* SAVE PREVIOUS OPCE ADDRESS    */ 01314000
         LR    RZERO,RPARM                                      02S0836 01315000
*             RPARM=RPARM->OCLINK;  /* SETUP ADDRESS OF NEXT OPCE ON    01316000
*                                      CHAIN                         */ 01317000
         L     RPARM,OCLINK(,RPARM)                             02S0837 01318000
*           END;                                                02S0838 01319000
*       END;                                                    02S0839 01320000
@RC00824 DS    0H                                               02S0840 01321000
*   END;                                                        02S0840 01322000
@RC00821 DS    0H                                               02S0840 01323000
@DE00820 TM    WAITFLG(ROPCAVT),B'00100000'                     02S0840 01324000
         BO    @DL00820                                         02S0840 01325000
*   END;                                                        02S0841 01326000
@EL00007 DS    0H                                               02S0841 01327000
@EF00007 DS    0H                                               02S0841 01328000
@ER00007 BR    @14                                              02S0841 01329000
*                                                               02S0842 01330000
*   /*****************************************************************/ 01331000
*   /*                                                               */ 01332000
*   /* DLKATT: THIS INTERNAL PROCEDURE DELINKS AN ELEMENT AND ITS    */ 01333000
*   /* ATTACHED CHAIN. IT THEN ATTACHES THE ELEMENT TO AN ELEMENT    */ 01334000
*   /* POINTED TO BY RWORK6. IT ALSO MERGES THE ATTACHED CHAINS OF   */ 01335000
*   /* THE ELEMENTS                                                  */ 01336000
*   /*                                                               */ 01337000
*   /*****************************************************************/ 01338000
*                                                               02S0842 01339000
*DLKATT:                                                        02S0842 01340000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0842 01341000
DLKATT   DS    0H                                               02S0843 01342000
*   RFY                                                         02S0843 01343000
*    (RWORK6,                                                   02S0843 01344000
*     RWORK7) RSTD;                                             02S0843 01345000
*   RZERO->OCLINK=RPARM->OCLINK;    /* TAKE THE ELEMENT OUT OF THE      01346000
*                                      CHAIN                 @OY19465*/ 01347000
         LR    @11,RZERO                                        02S0844 01348000
         MVC   OCLINK(4,@11),OCLINK(RPARM)                      02S0844 01349000
*   IF RWORK6->OCATTACH=ON THEN                                 02S0845 01350000
         TM    OCATTACH(RWORK6),B'00000010'                     02S0845 01351000
         BNO   @RF00845                                         02S0845 01352000
*     DO;                           /* FIRST ELEMENT HAS ATTACHED       01353000
*                                      CHAIN                 @OY19465*/ 01354000
*       RWORK5=RWORK6->OCELEM;      /* SAVE THE ATTACHED CHAIN  02S0847 01355000
*                                                            @OY19465*/ 01356000
         L     RWORK5,OCELEM(,RWORK6)                           02S0847 01357000
*       RWORK6->OCELEM=RPARM;       /* ATTACH ELEMENT TO FIRST  02S0848 01358000
*                                      ELEMENT               @OY19465*/ 01359000
         ST    RPARM,OCELEM(,RWORK6)                            02S0848 01360000
*       IF RPARM->OCATTACH^=ON THEN                             02S0849 01361000
         TM    OCATTACH(RPARM),B'00000010'                      02S0849 01362000
         BO    @RF00849                                         02S0849 01363000
*         DO;                       /* SECOND ELEMENT DOES NOT HAVE     01364000
*                                      ATTACHED CHAIN        @OY19465*/ 01365000
*           RPARM->OCELEM=RWORK5;   /* ATTACH FIRST'S CHAIN TO SECOND   01366000
*                                      ELEMENT               @OY19465*/ 01367000
         ST    RWORK5,OCELEM(,RPARM)                            02S0851 01368000
*           RPARM->OCATTACH=ON;     /* TURN ON OCATTACH      @OY19465*/ 01369000
         OI    OCATTACH(RPARM),B'00000010'                      02S0852 01370000
*         END;                                                  02S0853 01371000
*       ELSE                                                    02S0854 01372000
*         DO;                       /* RPARM AND RWORK6 HAVE ATTACHED   01373000
*                                      CHAINS                @OY19465*/ 01374000
         B     @RC00849                                         02S0854 01375000
@RF00849 DS    0H                                               02S0855 01376000
*           RWORK7=RPARM;           /* SAVE RPARM            @OY19465*/ 01377000
         LR    RWORK7,RPARM                                     02S0855 01378000
*           DO WHILE(RWORK7->OCATTACH=ON);/* SEARCH FOR END OF CHAIN    01379000
*                                                            @OY19465*/ 01380000
         B     @DE00856                                         02S0856 01381000
@DL00856 DS    0H                                               02S0857 01382000
*             RWORK7=RWORK7->OCELEM;/* GO DOWN ATTACHED CHAIN   02S0857 01383000
*                                                            @OY19465*/ 01384000
         L     RWORK7,OCELEM(,RWORK7)                           02S0857 01385000
*           END;                                                02S0858 01386000
@DE00856 TM    OCATTACH(RWORK7),B'00000010'                     02S0858 01387000
         BO    @DL00856                                         02S0858 01388000
*           RWORK7->OCELEM=RWORK5;  /* ATTACH SECOND CHAIN TO END OF    01389000
*                                      FIRST CHAIN           @OY19465*/ 01390000
         ST    RWORK5,OCELEM(,RWORK7)                           02S0859 01391000
*           RWORK7->OCATTACH=ON;    /* TURN ON OCATTACH      @OY19465*/ 01392000
         OI    OCATTACH(RWORK7),B'00000010'                     02S0860 01393000
*         END;                                                  02S0861 01394000
*     END;                                                      02S0862 01395000
*   ELSE                                                        02S0863 01396000
*     DO;                                                       02S0863 01397000
         B     @RC00845                                         02S0863 01398000
@RF00845 DS    0H                                               02S0864 01399000
*       RWORK6->OCATTACH=ON;        /* TURN ON OCATTACH      @OY19465*/ 01400000
         OI    OCATTACH(RWORK6),B'00000010'                     02S0864 01401000
*       RWORK6->OCELEM=RPARM;       /* ATTACH SECOND CHAIN   @OY19465*/ 01402000
         ST    RPARM,OCELEM(,RWORK6)                            02S0865 01403000
*     END;                                                      02S0866 01404000
*   RPARM->OCLINK=RPARM->OCLINK&&RPARM->OCLINK;/* OY14092            */ 01405000
@RC00845 L     @11,OCLINK(,RPARM)                               02S0867 01406000
         LR    @09,@11                                          02S0867 01407000
         XR    @09,@11                                          02S0867 01408000
         ST    @09,OCLINK(,RPARM)                               02S0867 01409000
*   IF RPARM->OCWTG=MODVE THEN      /* PARTIALLY DONE OY14092        */ 01410000
         CLC   OCWTG(2,RPARM),MODVE                             02S0868 01411000
         BNE   @RF00868                                         02S0868 01412000
*     RPARM->OCWTG=MODV8;           /* RESTART OY14092               */ 01413000
         MVC   OCWTG(2,RPARM),MODV8                             02S0869 01414000
*   ELSE                            /* NOT STOPLINE OY14092          */ 01415000
*     IF RPARM->OCWTG=MODVF THEN    /* PARTIALLY DONE OY14092        */ 01416000
         B     @RC00868                                         02S0870 01417000
@RF00868 CLC   OCWTG(2,RPARM),MODVF                             02S0870 01418000
         BNE   @RF00870                                         02S0870 01419000
*       RPARM->OCWTG=MODV9;         /* RESTART OY14092               */ 01420000
         MVC   OCWTG(2,RPARM),MODV9                             02S0871 01421000
*     ELSE                          /* OY14092                       */ 01422000
*       IF RPARM->OCWTG^=MODVG&(RPARM->OCWTG^=MODV8&RPARM->OCWTG^=MODV9 01423000
*           ) THEN                  /* ALL STARTED OY14092           */ 01424000
         B     @RC00870                                         02S0872 01425000
@RF00870 CLC   OCWTG(2,RPARM),MODVG                             02S0872 01426000
         BE    @RF00872                                         02S0872 01427000
         CLC   OCWTG(2,RPARM),MODV8                             02S0872 01428000
         BE    @RF00872                                         02S0872 01429000
         CLC   OCWTG(2,RPARM),MODV9                             02S0872 01430000
         BE    @RF00872                                         02S0872 01431000
*         RPARM->OCWTG=MODV8;       /* RESTART OY14092               */ 01432000
         MVC   OCWTG(2,RPARM),MODV8                             02S0873 01433000
*   IF WAITFLG=ON THEN                                          02S0874 01434000
@RF00872 DS    0H                                               02S0874 01435000
@RC00870 DS    0H                                               02S0874 01436000
@RC00868 TM    WAITFLG(ROPCAVT),B'00100000'                     02S0874 01437000
         BNO   @RF00874                                         02S0874 01438000
*     DO;                           /* AT THIS POINT WE MUST STILL      01439000
*                                      CONTINUE TO SEARCH THE WAITV     01440000
*                                      CHAIN. THEREFORE, RWORK6 MUST    01441000
*                                      BE SET EQUAL TO RPARM IN ORDER   01442000
*                                      TO ATTACH THE NEXT ELEMENT IF    01443000
*                                      NECESSARY             @OY19465*/ 01444000
*       RWORKA=RWORK6;                                          02S0876 01445000
         LR    RWORKA,RWORK6                                    02S0876 01446000
*       RWORK6=RPARM;                                           02S0877 01447000
         LR    RWORK6,RPARM                                     02S0877 01448000
*     END;                                                      02S0878 01449000
*   END;                                                        02S0879 01450000
@EL00008 DS    0H                                               02S0879 01451000
@EF00008 DS    0H                                               02S0879 01452000
@ER00008 BR    @14                                              02S0879 01453000
*   RFY                                                         02S0880 01454000
*    (RWORK6,                                                   02S0880 01455000
*     RWORK7) UNRSTD;                                           02S0880 01456000
*   END IGCV810D                                                01S0881 01457000
*                                                               01S0881 01458000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01459000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 01460000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 01461000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 01462000
*/*%INCLUDE SYSLIB  (TDEBD   )                                       */ 01463000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 01464000
*/*%INCLUDE SYSLIB  (TNSLD   )                                       */ 01465000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 01466000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 01467000
*/*%INCLUDE SYSLIB  (TOPRED  )                                       */ 01468000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 01469000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01470000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 01471000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01472000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 01473000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 01474000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 01475000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 01476000
*/*%INCLUDE SYSUT5  (RESPROC )                                       */ 01477000
*/*%INCLUDE SYSUT5  (SNAPROC )                                       */ 01478000
*/*%INCLUDE SYSUT5  (STPLPROC)                                       */ 01479000
*/*%INCLUDE SYSUT5  (FIRSTLN )                                       */ 01480000
*/*%INCLUDE SYSUT5  (WLATTACH)                                       */ 01481000
*/*%INCLUDE SYSUT5  (SNACHK  )                                       */ 01482000
*/*%INCLUDE SYSUT5  (NCPCHK  )                                       */ 01483000
*/*%INCLUDE SYSUT5  (LNCHK   )                                       */ 01484000
*/*%INCLUDE SYSUT5  (BLDACT  )                                       */ 01485000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 01486000
*/*%INCLUDE SYSUT5  (IPERROR )                                       */ 01487000
*/*%INCLUDE SYSUT5  (UPDSTATE)                                       */ 01488000
*/*%INCLUDE SYSUT5  (IPEXTERN)                                       */ 01489000
*/*%INCLUDE SYSUT5  (IPEXIT  )                                       */ 01490000
*/*%INCLUDE SYSUT5  (UPDSTATN)                                       */ 01491000
*/*%INCLUDE SYSUT5  (IPINTERN)                                       */ 01492000
*/*%INCLUDE SYSUT5  (IPMLNCHK)                                       */ 01493000
*/*%INCLUDE SYSUT5  (IPWLSRCH)                                       */ 01494000
*/*%INCLUDE SYSUT5  (DLKATT  )                                       */ 01495000
*                                                               01S0881 01496000
*       ;                                                       01S0881 01497000
@DATA    DS    0H                                                       01498000
@CH00061 DC    H'1'                                                     01499000
@CH00065 DC    H'2'                                                     01500000
@CH01234 DC    H'14'                                                    01501000
@CH00776 DC    H'36'                                                    01502000
@CH02230 DC    H'401'                                                   01503000
@CH02232 DC    H'539'                                                   01504000
         DS    0F                                                       01505000
         DS    0F                                                       01506000
@CF00256 DC    F'4'                                                     01507000
@CF00045 DC    F'8'                                                     01508000
@CF02218 DC    F'25'                                                    01509000
@CF02220 DC    F'26'                                                    01510000
@CF02222 DC    F'49'                                                    01511000
@CF02224 DC    F'199'                                                   01512000
@CH02224 EQU   @CF02224+2                                               01513000
@CF02226 DC    F'210'                                                   01514000
@CF02228 DC    F'400'                                                   01515000
@CF02238 DC    F'543'                                                   01516000
@CF02240 DC    F'544'                                                   01517000
@CF02242 DC    F'545'                                                   01518000
@CF02313 DC    F'-11'                                                   01519000
@CF02321 DC    F'-10'                                                   01520000
@CF02320 DC    F'-8'                                                    01521000
@CF02322 DC    F'-6'                                                    01522000
@CF01505 DC    F'-3'                                                    01523000
@CF01775 DC    XL4'08000002'                                            01524000
@CF02216 DC    XL4'00FFFFFF'                                            01525000
         DS    0D                                                       01526000
OPRQST   DC    X'0C'                                                    01527000
OPEND    DC    X'80'                                                    01528000
MOD00    DC    CL2'00'                                                  01529000
MOD03    DC    CL2'03'                                                  01530000
MOD06    DC    CL2'06'                                                  01531000
MOD07    DC    CL2'07'                                                  01532000
MOD09    DC    CL2'09'                                                  01533000
MODFC    DC    CL2'FC'                                                  01534000
MODFG    DC    CL2'FG'                                                  01535000
MODVE    DC    CL2'VE'                                                  01536000
MODV8    DC    CL2'V8'                                                  01537000
MODV9    DC    CL2'V9'                                                  01538000
MODVG    DC    CL2'VG'                                                  01539000
MODVF    DC    CL2'VF'                                                  01540000
ZAPAREA  DC    XL104'0'                                                 01541000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01542000
@01      EQU   01                                                       01543000
@02      EQU   02                                                       01544000
@03      EQU   03                                                       01545000
@04      EQU   04                                                       01546000
@05      EQU   05                                                       01547000
@06      EQU   06                                                       01548000
@07      EQU   07                                                       01549000
@08      EQU   08                                                       01550000
@09      EQU   09                                                       01551000
@10      EQU   10                                                       01552000
@11      EQU   11                                                       01553000
@12      EQU   12                                                       01554000
@13      EQU   13                                                       01555000
@14      EQU   14                                                       01556000
@15      EQU   15                                                       01557000
ROPCE    EQU   @03                                                      01558000
ROPCAVT  EQU   @02                                                      01559000
RAVT     EQU   @04                                                      01560000
RPARM    EQU   @01                                                      01561000
RTRM     EQU   @08                                                      01562000
RZERO    EQU   @00                                                      01563000
RWORK5   EQU   @05                                                      01564000
RWORKA   EQU   @10                                                      01565000
RWORK6   EQU   @06                                                      01566000
RWORK7   EQU   @07                                                      01567000
REG09    EQU   @09                                                      01568000
RBASE    EQU   @12                                                      01569000
RSAVE    EQU   @13                                                      01570000
REG14    EQU   @14                                                      01571000
REG15    EQU   @15                                                      01572000
IEDQAVTD EQU   0                                                        01573000
AVTSAVEX EQU   IEDQAVTD+288                                             01574000
AVTREADD EQU   IEDQAVTD+380                                             01575000
AVTBUFSW EQU   IEDQAVTD+384                                             01576000
@NM00004 EQU   IEDQAVTD+388                                             01577000
AVTCKFLG EQU   @NM00004                                                 01578000
AVTBASE  EQU   IEDQAVTD+412                                             01579000
AVTPKF   EQU   AVTBASE                                                  01580000
AVTRNMPT EQU   IEDQAVTD+424                                             01581000
AVTOSECB EQU   IEDQAVTD+492                                             01582000
AVTECB1  EQU   AVTOSECB                                                 01583000
AVTHG02  EQU   IEDQAVTD+528                                             01584000
AVTDISP  EQU   IEDQAVTD+552                                             01585000
AVTHD    EQU   IEDQAVTD+556                                             01586000
AVTSCOPT EQU   AVTHD                                                    01587000
AVTSAVTP EQU   IEDQAVTD+612                                             01588000
AVTSAVTF EQU   AVTSAVTP                                                 01589000
AVTCKPEL EQU   IEDQAVTD+652                                             01590000
AVTCKRMV EQU   AVTCKPEL                                                 01591000
AVTCKELF EQU   IEDQAVTD+680                                             01592000
AVTCKBYT EQU   IEDQAVTD+691                                             01593000
AVTHG01  EQU   IEDQAVTD+692                                             01594000
AVTCKLNK EQU   IEDQAVTD+696                                             01595000
AVTCRELE EQU   IEDQAVTD+708                                             01596000
AVTCCELE EQU   AVTCRELE                                                 01597000
AVTCLRHI EQU   IEDQAVTD+716                                             01598000
AVTADBUF EQU   IEDQAVTD+720                                             01599000
AVTSYSER EQU   IEDQAVTD+728                                             01600000
AVTBFRFG EQU   IEDQAVTD+784                                             01601000
AVTCKPQB EQU   IEDQAVTD+804                                             01602000
AVTCKPTB EQU   AVTCKPQB                                                 01603000
AVTCKPEC EQU   AVTCKPQB+4                                               01604000
AVTCKPCC EQU   AVTCKPEC                                                 01605000
AVTOPCQB EQU   IEDQAVTD+816                                             01606000
AVTOPCOB EQU   AVTOPCQB                                                 01607000
AVTOPCEC EQU   AVTOPCQB+4                                               01608000
AVTOPCCC EQU   AVTOPCEC                                                 01609000
AVTOLTQB EQU   IEDQAVTD+828                                             01610000
AVTCWFL1 EQU   IEDQAVTD+924                                             01611000
AVTCWFL2 EQU   IEDQAVTD+925                                             01612000
AVTSUBT  EQU   IEDQAVTD+948                                             01613000
AVTIOTR  EQU   IEDQAVTD+949                                             01614000
AVTBIT1  EQU   IEDQAVTD+1050                                            01615000
AVTBIT2  EQU   IEDQAVTD+1051                                            01616000
AVTBIT3  EQU   IEDQAVTD+1052                                            01617000
AVTBIT4  EQU   IEDQAVTD+1136                                            01618000
@NM00086 EQU   IEDQAVTD+1232                                            01619000
IEDQAPTR EQU   0                                                        01620000
IEDNSVTD EQU   0                                                        01621000
SAVTDIAG EQU   IEDNSVTD                                                 01622000
SAVTDIAF EQU   SAVTDIAG                                                 01623000
SAVTLUSQ EQU   IEDNSVTD+88                                              01624000
SAVTSPLN EQU   IEDNSVTD+224                                             01625000
SAVTTCPU EQU   IEDNSVTD+238                                             01626000
SAVTZELM EQU   IEDNSVTD+270                                             01627000
SAVTRDRV EQU   IEDNSVTD+284                                             01628000
SAVTCKQB EQU   IEDNSVTD+300                                             01629000
SAVTCKTB EQU   SAVTCKQB                                                 01630000
SAVTCKEC EQU   SAVTCKQB+4                                               01631000
SAVTCKCC EQU   SAVTCKEC                                                 01632000
IHADCB   EQU   0                                                        01633000
IHADCS1A EQU   0                                                        01634000
DCBBCKUP EQU   IHADCS1A+8                                               01635000
IHADCS2K EQU   0                                                        01636000
DCBDUMPD EQU   IHADCS2K                                                 01637000
DCBTRSTA EQU   IHADCS2K+5                                               01638000
DCBDSORG EQU   IHADCS2K+6                                               01639000
DCBDSRG2 EQU   DCBDSORG+1                                               01640000
DCBRNCKD EQU   IHADCS2K+12                                              01641000
DCBEXLST EQU   IHADCS2K+16                                              01642000
IHADCS24 EQU   0                                                        01643000
DCBOFLGS EQU   IHADCS24+8                                               01644000
DCBOFLWR EQU   DCBOFLGS                                                 01645000
DCBIFLG  EQU   IHADCS24+9                                               01646000
DCBIBPCT EQU   DCBIFLG                                                  01647000
DCBMACR  EQU   IHADCS24+10                                              01648000
DCBMACR1 EQU   DCBMACR                                                  01649000
DCBMRFE  EQU   DCBMACR1                                                 01650000
DCBMRGET EQU   DCBMRFE                                                  01651000
DCBMRAPG EQU   DCBMACR1                                                 01652000
DCBMRRD  EQU   DCBMRAPG                                                 01653000
DCBMRCI  EQU   DCBMACR1                                                 01654000
DCBMRMVG EQU   DCBMRCI                                                  01655000
DCBMRLCG EQU   DCBMACR1                                                 01656000
DCBMRABC EQU   DCBMACR1                                                 01657000
DCBMRPT1 EQU   DCBMRABC                                                 01658000
DCBMRSBG EQU   DCBMRPT1                                                 01659000
DCBMRCRL EQU   DCBMACR1                                                 01660000
DCBMRCHK EQU   DCBMRCRL                                                 01661000
DCBMRRDX EQU   DCBMRCHK                                                 01662000
DCBMRDMG EQU   DCBMACR1                                                 01663000
DCBMACR2 EQU   DCBMACR+1                                                01664000
DCBMRPUT EQU   DCBMACR2                                                 01665000
DCBMRWRT EQU   DCBMACR2                                                 01666000
DCBMRMVP EQU   DCBMACR2                                                 01667000
DCBMR5WD EQU   DCBMACR2                                                 01668000
DCBMRLDM EQU   DCBMR5WD                                                 01669000
DCBMRLCP EQU   DCBMRLDM                                                 01670000
DCBMR4WD EQU   DCBMACR2                                                 01671000
DCBMRPT2 EQU   DCBMR4WD                                                 01672000
DCBMRTMD EQU   DCBMRPT2                                                 01673000
DCBMR3WD EQU   DCBMACR2                                                 01674000
DCBMRCTL EQU   DCBMR3WD                                                 01675000
DCBMRSTK EQU   DCBMRCTL                                                 01676000
DCBMR1WD EQU   DCBMACR2                                                 01677000
DCBMRSWA EQU   DCBMR1WD                                                 01678000
DCBMRDMD EQU   DCBMRSWA                                                 01679000
IHADCS25 EQU   0                                                        01680000
DCBMACRF EQU   IHADCS25+2                                               01681000
DCBMACF1 EQU   DCBMACRF                                                 01682000
DCBMFFE  EQU   DCBMACF1                                                 01683000
DCBMFGET EQU   DCBMFFE                                                  01684000
DCBMFAPG EQU   DCBMACF1                                                 01685000
DCBMFRD  EQU   DCBMFAPG                                                 01686000
DCBMFCI  EQU   DCBMACF1                                                 01687000
DCBMFMVG EQU   DCBMFCI                                                  01688000
DCBMFLCG EQU   DCBMACF1                                                 01689000
DCBMFABC EQU   DCBMACF1                                                 01690000
DCBMFPT1 EQU   DCBMFABC                                                 01691000
DCBMFSBG EQU   DCBMFPT1                                                 01692000
DCBMFCRL EQU   DCBMACF1                                                 01693000
DCBMFCHK EQU   DCBMFCRL                                                 01694000
DCBMFDMG EQU   DCBMACF1                                                 01695000
DCBMACF2 EQU   DCBMACRF+1                                               01696000
DCBMFPUT EQU   DCBMACF2                                                 01697000
DCBMFWRT EQU   DCBMACF2                                                 01698000
DCBMFMVP EQU   DCBMACF2                                                 01699000
DCBMF5WD EQU   DCBMACF2                                                 01700000
DCBMFLDM EQU   DCBMF5WD                                                 01701000
DCBMFLCP EQU   DCBMFLDM                                                 01702000
DCBMF4WD EQU   DCBMACF2                                                 01703000
DCBMFPT2 EQU   DCBMF4WD                                                 01704000
DCBMFTMD EQU   DCBMFPT2                                                 01705000
DCBMF3WD EQU   DCBMACF2                                                 01706000
DCBMFCTL EQU   DCBMF3WD                                                 01707000
DCBMFSTK EQU   DCBMFCTL                                                 01708000
DCBMF1WD EQU   DCBMACF2                                                 01709000
DCBMFSWA EQU   DCBMF1WD                                                 01710000
DCBMFDMD EQU   DCBMFSWA                                                 01711000
DCBDEBAD EQU   IHADCS25+4                                               01712000
DCBIFLGS EQU   DCBDEBAD                                                 01713000
DCBIFPCT EQU   DCBIFLGS                                                 01714000
IHADCS27 EQU   0                                                        01715000
DCBGET   EQU   IHADCS27                                                 01716000
DCBPUT   EQU   DCBGET                                                   01717000
DCBGETA  EQU   DCBPUT+1                                                 01718000
IHADCS43 EQU   0                                                        01719000
DCBSCTAB EQU   IHADCS43                                                 01720000
IEDQDEB  EQU   0                                                        01721000
DEBPRF   EQU   IEDQDEB                                                  01722000
DEBAPVT  EQU   DEBPRF                                                   01723000
DEBNMSUB EQU   IEDQDEB+36                                               01724000
DEBNMEXT EQU   IEDQDEB+52                                               01725000
DEBUCBS  EQU   IEDQDEB+68                                               01726000
IEDQDPTR EQU   0                                                        01727000
UCB      EQU   0                                                        01728000
UCBOB    EQU   0                                                        01729000
UCBJBNR  EQU   UCBOB                                                    01730000
UCBFL5   EQU   UCBOB+1                                                  01731000
UCBAF    EQU   UCBFL5                                                   01732000
UCBSTAT  EQU   UCBOB+3                                                  01733000
UCBCHAN  EQU   UCBOB+4                                                  01734000
UCBSFLS  EQU   UCBOB+6                                                  01735000
UCBFLA   EQU   UCBSFLS                                                  01736000
UCBFL1   EQU   UCBFLA                                                   01737000
UCBBSY   EQU   UCBFL1                                                   01738000
UCBNRY   EQU   UCBFL1                                                   01739000
UCBPST   EQU   UCBFL1                                                   01740000
UCBCUB   EQU   UCBFL1                                                   01741000
UCBFLB   EQU   UCBSFLS+1                                                01742000
UCBCHM   EQU   UCBOB+8                                                  01743000
UCBCHM1  EQU   UCBCHM                                                   01744000
UCBPTH0  EQU   UCBCHM1                                                  01745000
UCBPTH1  EQU   UCBCHM1                                                  01746000
UCBWGT   EQU   UCBOB+12                                                 01747000
UCBNAME  EQU   UCBOB+13                                                 01748000
UCBTYP   EQU   UCBOB+16                                                 01749000
UCBTBYT1 EQU   UCBTYP                                                   01750000
UCB1FEA5 EQU   UCBTBYT1                                                 01751000
UCB1FEA6 EQU   UCBTBYT1                                                 01752000
UCBTBYT2 EQU   UCBTYP+1                                                 01753000
UCB2OPT2 EQU   UCBTBYT2                                                 01754000
UCBDUDN1 EQU   UCB2OPT2                                                 01755000
UCB2OPT3 EQU   UCBTBYT2                                                 01756000
UCBDUDN2 EQU   UCB2OPT3                                                 01757000
UCB2OPT4 EQU   UCBTBYT2                                                 01758000
UCBRWTAU EQU   UCB2OPT4                                                 01759000
UCB2OPT6 EQU   UCBTBYT2                                                 01760000
UCB2OPT7 EQU   UCBTBYT2                                                 01761000
UCBTBYT3 EQU   UCBTYP+2                                                 01762000
UCBDVCLS EQU   UCBTBYT3                                                 01763000
UCBTBYT4 EQU   UCBTYP+3                                                 01764000
UCBEXTPT EQU   UCBOB+20                                                 01765000
UCBFLC   EQU   UCBEXTPT                                                 01766000
UCBDEV   EQU   UCBOB+24                                                 01767000
UCBCMEXT EQU   0                                                        01768000
UCBATI   EQU   UCBCMEXT+3                                               01769000
@NM00119 EQU   UCBATI                                                   01770000
UCBFLP1  EQU   UCBCMEXT+5                                               01771000
UCBMT    EQU   0                                                        01772000
UCBOCR   EQU   0                                                        01773000
UCB3540X EQU   0                                                        01774000
UCBDKBYT EQU   UCB3540X+6                                               01775000
UCB3800X EQU   0                                                        01776000
UCBOPTNS EQU   UCB3800X                                                 01777000
UCBACTIV EQU   UCB3800X+3                                               01778000
UCBMDRBF EQU   UCB3800X+36                                              01779000
UCBUCS   EQU   0                                                        01780000
UCBUCSOP EQU   UCBUCS+4                                                 01781000
UCBFCBOP EQU   UCBUCS+5                                                 01782000
IEDNNSLD EQU   0                                                        01783000
IEDNSLD  EQU   0                                                        01784000
NSLPLCB  EQU   IEDNSLD+8                                                01785000
NSLGPCUS EQU   IEDNSLD+12                                               01786000
NSLPRIBK EQU   IEDNSLD+18                                               01787000
NSLFLGBK EQU   IEDNSLD+19                                               01788000
NSLERB   EQU   IEDNSLD+20                                               01789000
NSLESTAT EQU   NSLERB+8                                                 01790000
NSLREQTY EQU   IEDNSLD+35                                               01791000
NSLGRPNM EQU   IEDNSLD+36                                               01792000
NSLTTEPT EQU   IEDNSLD+44                                               01793000
IEDNSLP  EQU   0                                                        01794000
IEDQOPCE EQU   0                                                        01795000
OCLINK   EQU   IEDQOPCE                                                 01796000
OCELEM   EQU   IEDQOPCE+4                                               01797000
OCELMPTR EQU   OCELEM+1                                                 01798000
OCUNIT   EQU   IEDQOPCE+8                                               01799000
OCRUDEST EQU   OCUNIT                                                   01800000
OCCKPKEY EQU   OCRUDEST                                                 01801000
OCSCAN   EQU   OCCKPKEY                                                 01802000
OCOPTCDE EQU   IEDQOPCE+12                                              01803000
OCSWITCH EQU   IEDQOPCE+13                                              01804000
OCFLAG   EQU   IEDQOPCE+14                                              01805000
OCTOTE   EQU   OCFLAG                                                   01806000
OCATTACH EQU   OCFLAG                                                   01807000
OCRESP   EQU   OCFLAG                                                   01808000
@NM00129 EQU   IEDQOPCE+16                                              01809000
OCDEST   EQU   @NM00129                                                 01810000
OCREQVAL EQU   OCDEST+1                                                 01811000
OCTRMTBL EQU   IEDQOPCE+20                                              01812000
OCLINENO EQU   IEDQOPCE+22                                              01813000
OCTIOT   EQU   OCLINENO                                                 01814000
OCWTGB   EQU   OCTIOT                                                   01815000
OCTRUNIT EQU   IEDQOPCE+24                                              01816000
OCRSID   EQU   OCTRUNIT                                                 01817000
OCALSTAT EQU   OCRSID                                                   01818000
OCRENTRD EQU   OCALSTAT                                                 01819000
OCDACTIP EQU   OCALSTAT                                                 01820000
OCACTREQ EQU   OCALSTAT                                                 01821000
OCALLFLG EQU   OCALSTAT                                                 01822000
OCSOME   EQU   OCALSTAT                                                 01823000
OCNONE   EQU   OCALSTAT                                                 01824000
OCPARM   EQU   IEDQOPCE+28                                              01825000
OCWTG    EQU   IEDQOPCE+30                                              01826000
OCBACKUP EQU   IEDQOPCE+32                                              01827000
OCMODNME EQU   IEDQOPCE+40                                              01828000
OCIPLWA  EQU   OCMODNME                                                 01829000
OCPTRSAV EQU   OCMODNME+4                                               01830000
OCCKDATA EQU   IEDQOPCE+48                                              01831000
OCRSTGTM EQU   OCCKDATA                                                 01832000
IEDQOPCN EQU   0                                                        01833000
OCLDNME  EQU   IEDQOPCN                                                 01834000
OCLINTTE EQU   OCLDNME                                                  01835000
OCREQFLG EQU   OCLINTTE+2                                               01836000
OCFLUSHZ EQU   OCREQFLG                                                 01837000
OCPREFLG EQU   OCLINTTE+3                                               01838000
IEDQOPCD EQU   0                                                        01839000
OPCAVTPT EQU   IEDQOPCD+8                                               01840000
OPCCOPCE EQU   IEDQOPCD+12                                              01841000
OPCSAVE  EQU   IEDQOPCD+56                                              01842000
OPCFLAG1 EQU   IEDQOPCD+146                                             01843000
OPCAQCTL EQU   IEDQOPCD+180                                             01844000
OPCXCTL  EQU   IEDQOPCD+204                                             01845000
OPCLDNME EQU   IEDQOPCD+212                                             01846000
OPCMODID EQU   OPCLDNME+3                                               01847000
OPCHORT  EQU   IEDQOPCD+256                                             01848000
OPCGETBF EQU   IEDQOPCD+276                                             01849000
OPCFREBF EQU   IEDQOPCD+280                                             01850000
OPCSPEC  EQU   IEDQOPCD+300                                             01851000
OPCWRKSP EQU   IEDQOPCD+320                                             01852000
OPCWAITV EQU   IEDQOPCD+364                                             01853000
OPCPWCOB EQU   IEDQOPCD+368                                             01854000
OPCPWQCB EQU   OPCPWCOB                                                 01855000
OPCPWECB EQU   OPCPWCOB+4                                               01856000
IEDOPRED EQU   0                                                        01857000
OPREQCB  EQU   IEDOPRED+1                                               01858000
OPREPRI  EQU   IEDOPRED+4                                               01859000
OPRESAVE EQU   IEDOPRED+8                                               01860000
OPREFLG3 EQU   IEDOPRED+14                                              01861000
IEDQPRF  EQU   0                                                        01862000
PRFRCB   EQU   IEDQPRF                                                  01863000
PRFKEY   EQU   PRFRCB                                                   01864000
PRFQCBA  EQU   PRFRCB+1                                                 01865000
PRFPRI   EQU   PRFRCB+4                                                 01866000
PRFLINK  EQU   PRFRCB+5                                                 01867000
PRFTIC   EQU   IEDQPRF+8                                                01868000
PRFTICC  EQU   PRFTIC                                                   01869000
PRFNBUNT EQU   IEDQPRF+12                                               01870000
PRFSUNIT EQU   PRFNBUNT                                                 01871000
PRFPLQCB EQU   PRFSUNIT                                                 01872000
@NM00161 EQU   IEDQPRF+16                                               01873000
PRFSVFFO EQU   @NM00161                                                 01874000
PRFSTAT1 EQU   IEDQPRF+20                                               01875000
PRFEOFN  EQU   PRFSTAT1                                                 01876000
PRFCORE  EQU   IEDQPRF+21                                               01877000
PRFXTRA  EQU   PRFCORE                                                  01878000
PRFSCAN  EQU   IEDQPRF+24                                               01879000
PRFTQBCK EQU   IEDQPRF+26                                               01880000
PRFNTXT  EQU   PRFTQBCK                                                 01881000
PRFEOBOF EQU   PRFNTXT                                                  01882000
PRFCHDR  EQU   IEDQPRF+32                                               01883000
PRFHQBCK EQU   IEDQPRF+35                                               01884000
IEDQPPTR EQU   0                                                        01885000
IEDPF1   EQU   0                                                        01886000
PRF1FLG1 EQU   IEDPF1+3                                                 01887000
PRF1WD2  EQU   IEDPF1+4                                                 01888000
PRF1SEQP EQU   PRF1WD2                                                  01889000
PRF1SQID EQU   PRF1SEQP                                                 01890000
PRF1TAG1 EQU   PRF1SQID                                                 01891000
IEDPF2   EQU   0                                                        01892000
PRF2FLG2 EQU   IEDPF2                                                   01893000
PRF2WD2  EQU   IEDPF2+4                                                 01894000
IEDQQCB  EQU   0                                                        01895000
QCBDSFLG EQU   IEDQQCB                                                  01896000
QCBDISK  EQU   QCBDSFLG                                                 01897000
QCBELCHN EQU   IEDQQCB+1                                                01898000
QCBEOLDT EQU   IEDQQCB+16                                               01899000
QCBBYTE1 EQU   QCBEOLDT+1                                               01900000
QCBLKRLN EQU   IEDQQCB+18                                               01901000
QCBRETCT EQU   QCBLKRLN                                                 01902000
QCBSTAT  EQU   IEDQQCB+19                                               01903000
QCBINSRC EQU   IEDQQCB+21                                               01904000
@NM00171 EQU   QCBINSRC                                                 01905000
QCBTSOF2 EQU   @NM00171+1                                               01906000
QCBTSOF1 EQU   @NM00171+2                                               01907000
QCBINTVL EQU   IEDQQCB+24                                               01908000
QCBPREN  EQU   IEDQQCB+28                                               01909000
QCBLKRRN EQU   QCBPREN+1                                                01910000
QCBDCBAD EQU   IEDQQCB+33                                               01911000
QCBFLAG  EQU   IEDQQCB+36                                               01912000
IEDQQPTR EQU   0                                                        01913000
IEDQPQCB EQU   0                                                        01914000
QCBFHDLZ EQU   IEDQPQCB+3                                               01915000
QCBPFEFO EQU   QCBFHDLZ+1                                               01916000
QCBFHDTZ EQU   IEDQPQCB+6                                               01917000
QCBINTLF EQU   IEDQPQCB+12                                              01918000
IEDNQCB  EQU   0                                                        01919000
QCBSTAT1 EQU   IEDNQCB+4                                                01920000
QCBPLCBA EQU   IEDNQCB+5                                                01921000
IEDQTRM  EQU   0                                                        01922000
TRMSTATE EQU   IEDQTRM                                                  01923000
TRMLOG   EQU   TRMSTATE                                                 01924000
TRMDESTQ EQU   IEDQTRM+1                                                01925000
TRMINSEQ EQU   IEDQTRM+4                                                01926000
TLISTCNT EQU   TRMINSEQ                                                 01927000
TRMOUTSQ EQU   IEDQTRM+6                                                01928000
TLISTEN  EQU   TRMOUTSQ                                                 01929000
TRMDSORG EQU   TLISTEN                                                  01930000
TRMALTD  EQU   IEDQTRM+8                                                01931000
TRMDEVFL EQU   IEDQTRM+10                                               01932000
TRMSTAT  EQU   IEDQTRM+12                                               01933000
IEDQTPTR EQU   0                                                        01934000
IEDNTRM  EQU   0                                                        01935000
TRMBYTE4 EQU   IEDNTRM                                                  01936000
TRMBYTE3 EQU   IEDNTRM+1                                                01937000
TRMBYTE2 EQU   IEDNTRM+2                                                01938000
TRMRSACT EQU   TRMBYTE2                                                 01939000
TRMINPG  EQU   TRMBYTE2                                                 01940000
TRMBYTE1 EQU   IEDNTRM+3                                                01941000
TRMSCPRQ EQU   TRMBYTE1                                                 01942000
TRMSTOTE EQU   TRMBYTE1                                                 01943000
TRMCOHRT EQU   IEDNTRM+4                                                01944000
TRMBYTE0 EQU   IEDNTRM+6                                                01945000
TRMSIBPT EQU   IEDNTRM+7                                                01946000
TRMCOHTG EQU   TRMSIBPT+1                                               01947000
TRMTYPE  EQU   IEDNTRM+11                                               01948000
TRMSUBST EQU   IEDNTRM+12                                               01949000
IEDQTNT  EQU   0                                                        01950000
COHORTLK EQU   0                                                        01951000
FREEBUFF EQU   0                                                        01952000
ALLOCBUF EQU   0                                                        01953000
DEBSUBR  EQU   0                                                        01954000
QCBLDCB  EQU   0                                                        01955000
UCBBGN   EQU   0                                                        01956000
UCBDCPTR EQU   0                                                        01957000
DCBPTR   EQU   QCBDCBAD                                                 01958000
DEBUCB   EQU   DEBUCBS                                                  01959000
DEBDVMOD EQU   DEBUCB                                                   01960000
DEBUCBAD EQU   DEBUCB+1                                                 01961000
UCBPTR   EQU   DEBUCBAD                                                 01962000
UCBOBS01 EQU   UCBDEV                                                   01963000
UCBSTAB  EQU   UCBOBS01+10                                              01964000
UCBBSVL  EQU   UCBSTAB                                                  01965000
UCBPRSRS EQU   UCBSTAB                                                  01966000
UCBDMCT  EQU   UCBOBS01+11                                              01967000
UCBFL4   EQU   UCBOBS01+13                                              01968000
UCBOBS02 EQU   UCBDEV                                                   01969000
UCBTFL1  EQU   UCBOBS02+19                                              01970000
UCBXTN   EQU   UCBOBS02+20                                              01971000
UCBVOPT  EQU   UCBXTN                                                   01972000
UCBOBS03 EQU   UCBDEV                                                   01973000
UCBXTADR EQU   UCBOBS03                                                 01974000
UCBOBS04 EQU   UCBDEV                                                   01975000
UCBBTA   EQU   UCBOBS04+12                                              01976000
UCBOBS06 EQU   UCBDEV                                                   01977000
UCBAOF   EQU   UCBOBS06                                                 01978000
UCBAOF1  EQU   UCBAOF                                                   01979000
UCBAOF2  EQU   UCBAOF+1                                                 01980000
@NM00118 EQU   UCBOBS06+3                                               01981000
UCBIRB   EQU   UCBOBS06+4                                               01982000
UCBGRAF  EQU   UCBIRB                                                   01983000
UCBLDNCA EQU   UCBOBS06+8                                               01984000
UCBRDYQ  EQU   UCBLDNCA                                                 01985000
UCBIRLN  EQU   UCBRDYQ                                                  01986000
UCBLDNCB EQU   UCBRDYQ+1                                                01987000
UCBCTLNK EQU   UCBOBS06+12                                              01988000
UCBOBS07 EQU   UCBDEV                                                   01989000
UCBOBS08 EQU   UCBDEV                                                   01990000
UCBCTCAD EQU   UCBOBS08                                                 01991000
UCBCTCF1 EQU   UCBOBS08+4                                               01992000
UCBOBS09 EQU   UCBDEV                                                   01993000
OCCKPKY1 EQU   OCCKPKEY                                                 01994000
OCCKPTYP EQU   OCCKPKY1                                                 01995000
OCICACTN EQU   OCMODNME                                                 01996000
OCICDADR EQU   OCICACTN                                                 01997000
OCICSW   EQU   OCICDADR+3                                               01998000
OPCAQWD  EQU   OPCAQCTL                                                 01999000
OPCAQWD1 EQU   OPCAQWD                                                  02000000
OPCAQREQ EQU   OPCAQWD1                                                 02001000
OPCAQWD2 EQU   OPCAQWD+4                                                02002000
OPCAQRQ2 EQU   OPCAQWD2                                                 02003000
OPCAQWD3 EQU   OPCAQWD+8                                                02004000
TRMPRE1  EQU   TRMBYTE4                                                 02005000
TRMNCP1  EQU   TRMBYTE4                                                 02006000
TRMPRE   EQU   TRMBYTE3                                                 02007000
TRMNCP   EQU   TRMBYTE3                                                 02008000
TRMNCPCL EQU   TRMNCP                                                   02009000
TRMPU    EQU   TRMBYTE3                                                 02010000
TRMLU    EQU   TRMBYTE3                                                 02011000
TRMLINK  EQU   TRMBYTE3                                                 02012000
FLAGS    EQU   OPCFLAG1                                                 02013000
FIRSTREQ EQU   FLAGS                                                    02014000
MORLINES EQU   FLAGS                                                    02015000
WAITFLG  EQU   FLAGS                                                    02016000
EXITFLG  EQU   FLAGS                                                    02017000
OCCIB    EQU   OCREQVAL                                                 02018000
PRFSHDR  EQU   IEDQPRF+42                                               02019000
TRMOPT   EQU   IEDQTRM+20                                               02020000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02021000
ERRFLG   EQU   FLAGS                                                    02022000
@NM00181 EQU   TRMLINK                                                  02023000
TRMLSTAT EQU   TRMLINK                                                  02024000
TRMLINT  EQU   TRMLINK                                                  02025000
TRMEPMOD EQU   TRMLINK                                                  02026000
TRMLULOG EQU   TRMLU                                                    02027000
TRMINERR EQU   TRMLU                                                    02028000
TRMLUREQ EQU   TRMLU                                                    02029000
TRMSESRQ EQU   TRMLU                                                    02030000
TRMTDIFF EQU   TRMLU                                                    02031000
TRMLUTM  EQU   TRMLU                                                    02032000
TRMLUIT  EQU   TRMLU                                                    02033000
TRMAUTO  EQU   TRMLU                                                    02034000
TRMPCONT EQU   TRMPU                                                    02035000
@NM00180 EQU   TRMPU                                                    02036000
TRMNCONT EQU   TRMNCP                                                   02037000
TRMQUCKN EQU   TRMNCP                                                   02038000
TRMSLOWN EQU   TRMNCP                                                   02039000
TRMSYGEN EQU   TRMNCP                                                   02040000
TRMIPLDM EQU   TRMNCP                                                   02041000
TRMINOUT EQU   TRMPRE                                                   02042000
TRMRDOUT EQU   TRMPRE                                                   02043000
TRMNLOUT EQU   TRMPRE                                                   02044000
TRMWROUT EQU   TRMPRE                                                   02045000
TRMASNXI EQU   TRMPRE                                                   02046000
TRMSTMM  EQU   TRMPRE                                                   02047000
TRMCMODE EQU   TRMPRE                                                   02048000
TRMSTPND EQU   TRMPRE                                                   02049000
@NM00179 EQU   TRMNCP1                                                  02050000
TRMINOP  EQU   TRMNCP1                                                  02051000
TRMLYNCH EQU   TRMPRE1                                                  02052000
TRMSPOUT EQU   TRMPRE1                                                  02053000
TRMERLCK EQU   TRMPRE1                                                  02054000
TRMQNPL  EQU   TRMPRE1                                                  02055000
TRMSPACT EQU   TRMPRE1                                                  02056000
TRMOCNI  EQU   TRMPRE1                                                  02057000
TRMSESSN EQU   TRMPRE1                                                  02058000
TRMCONT  EQU   TRMPRE1                                                  02059000
OPCAQLST EQU   OPCAQWD3+1                                               02060000
OPCAQRQ3 EQU   OPCAQWD3                                                 02061000
OPCAQSEC EQU   OPCAQWD2+1                                               02062000
OPCAQFST EQU   OPCAQWD1+1                                               02063000
OCICINAC EQU   OCICSW                                                   02064000
@NM00134 EQU   OCICSW                                                   02065000
OCICATST EQU   OCICDADR+1                                               02066000
OCICTYPE EQU   OCICDADR                                                 02067000
@NM00133 EQU   OCCKPKY1                                                 02068000
OCCKPENV EQU   OCCKPKY1                                                 02069000
OCCKPRST EQU   OCCKPTYP                                                 02070000
OCCKPNCP EQU   OCCKPTYP                                                 02071000
OCCKPINC EQU   OCCKPTYP                                                 02072000
UCBRV066 EQU   UCBOBS09+4                                               02073000
UCBIOSBA EQU   UCBOBS09                                                 02074000
UCBRV042 EQU   UCBOBS08+5                                               02075000
UCBRV082 EQU   UCBCTCF1                                                 02076000
UCBRV081 EQU   UCBCTCF1                                                 02077000
UCBRV080 EQU   UCBCTCF1                                                 02078000
UCBRV079 EQU   UCBCTCF1                                                 02079000
UCBRV078 EQU   UCBCTCF1                                                 02080000
UCBRV077 EQU   UCBCTCF1                                                 02081000
UCBRV076 EQU   UCBCTCF1                                                 02082000
UCBCTC80 EQU   UCBCTCF1                                                 02083000
UCBCTCAL EQU   UCBCTCAD                                                 02084000
UCBICNCB EQU   UCBOBS07+4                                               02085000
UCBRV040 EQU   UCBOBS07                                                 02086000
UCBCTLNA EQU   UCBCTLNK+1                                               02087000
UCBRLN   EQU   UCBCTLNK                                                 02088000
UCBRDYQA EQU   UCBLDNCB                                                 02089000
UCBINRLN EQU   UCBIRLN                                                  02090000
UCBIRBA  EQU   UCBIRB+1                                                 02091000
UCBRV039 EQU   UCBGRAF                                                  02092000
UCBDWNR  EQU   UCBGRAF                                                  02093000
UCBRPND  EQU   UCBGRAF                                                  02094000
UCBUPM   EQU   UCBGRAF                                                  02095000
UCBBTAM  EQU   UCBGRAF                                                  02096000
UCBDRNO  EQU   UCBGRAF                                                  02097000
UCBDRO   EQU   UCBGRAF                                                  02098000
UCBOIP   EQU   UCBGRAF                                                  02099000
UCBATRCD EQU   @NM00118                                                 02100000
UCBSKPFG EQU   @NM00118                                                 02101000
UCBRIPND EQU   @NM00118                                                 02102000
UCBRTIAC EQU   @NM00118                                                 02103000
UCBRSV79 EQU   @NM00118                                                 02104000
UCBRSV78 EQU   @NM00118                                                 02105000
UCBRSV77 EQU   @NM00118                                                 02106000
UCBOLTEP EQU   @NM00118                                                 02107000
UCBATNCT EQU   UCBOBS06+2                                               02108000
UCBRSV76 EQU   UCBAOF2                                                  02109000
UCBRSV75 EQU   UCBAOF2                                                  02110000
UCBRSV74 EQU   UCBAOF2                                                  02111000
UCBRSV73 EQU   UCBAOF2                                                  02112000
UCBRSV72 EQU   UCBAOF2                                                  02113000
UCBRSV71 EQU   UCBAOF2                                                  02114000
UCBRSV70 EQU   UCBAOF2                                                  02115000
UCBRSV69 EQU   UCBAOF2                                                  02116000
UCBRSV68 EQU   UCBAOF1                                                  02117000
UCBRSV67 EQU   UCBAOF1                                                  02118000
UCBRSV66 EQU   UCBAOF1                                                  02119000
UCBRSV65 EQU   UCBAOF1                                                  02120000
UCBRSV64 EQU   UCBAOF1                                                  02121000
UCBOFNL  EQU   UCBAOF1                                                  02122000
UCBOFSP  EQU   UCBAOF1                                                  02123000
UCBOFMCR EQU   UCBAOF1                                                  02124000
UCBBTB   EQU   UCBBTA+1                                                 02125000
UCBDI    EQU   UCBBTA                                                   02126000
UCBSNS   EQU   UCBOBS04+8                                               02127000
UCBTEB   EQU   UCBOBS04+4                                               02128000
UCBGCB   EQU   UCBOBS04+3                                               02129000
UCBOPEN  EQU   UCBOBS04+2                                               02130000
UCBSTART EQU   UCBOBS04                                                 02131000
UCBXTNB  EQU   UCBXTN+1                                                 02132000
UCBRSV22 EQU   UCBVOPT                                                  02133000
UCBRSV21 EQU   UCBVOPT                                                  02134000
UCBRSV20 EQU   UCBVOPT                                                  02135000
UCBESVE  EQU   UCBVOPT                                                  02136000
UCBERPC  EQU   UCBVOPT                                                  02137000
UCBESVC  EQU   UCBVOPT                                                  02138000
UCBEVA   EQU   UCBVOPT                                                  02139000
UCBESV   EQU   UCBVOPT                                                  02140000
UCBRV009 EQU   UCBTFL1                                                  02141000
UCBRV008 EQU   UCBTFL1                                                  02142000
UCBRV007 EQU   UCBTFL1                                                  02143000
UCBRV006 EQU   UCBTFL1                                                  02144000
UCBRV005 EQU   UCBTFL1                                                  02145000
UCBRV038 EQU   UCBTFL1                                                  02146000
UCBNSLTP EQU   UCBTFL1                                                  02147000
UCBNLTP  EQU   UCBTFL1                                                  02148000
UCBRES1B EQU   UCBOBS02+18                                              02149000
UCBFSER  EQU   UCBOBS02+12                                              02150000
@NM00117 EQU   UCBOBS02+4                                               02151000
UCBFSEQ  EQU   UCBOBS02+2                                               02152000
UCBFSCT  EQU   UCBOBS02                                                 02153000
UCBNEXP  EQU   UCBOBS01+20                                              02154000
UCBBASE  EQU   UCBOBS01+16                                              02155000
UCBRES1A EQU   UCBOBS01+15                                              02156000
UCBUSER  EQU   UCBOBS01+14                                              02157000
UCBFL47  EQU   UCBFL4                                                   02158000
UCBFL46  EQU   UCBFL4                                                   02159000
UCBFL45  EQU   UCBFL4                                                   02160000
UCBRV065 EQU   UCBFL4                                                   02161000
UCBDSS   EQU   UCBFL4                                                   02162000
UCBRV028 EQU   UCBFL4                                                   02163000
UCBWDAV  EQU   UCBFL4                                                   02164000
UCBDAVV  EQU   UCBFL4                                                   02165000
UCBSQC   EQU   UCBOBS01+12                                              02166000
UCBDATP  EQU   UCBOBS01+12                                              02167000
UCBDMC   EQU   UCBDMCT                                                  02168000
UCBMOUNT EQU   UCBDMCT                                                  02169000
UCBBNUL  EQU   UCBSTAB                                                  02170000
UCBSHAR  EQU   UCBSTAB                                                  02171000
UCBBSTR  EQU   UCBSTAB                                                  02172000
UCBBPUB  EQU   UCBSTAB                                                  02173000
UCBBPRV  EQU   UCBSTAB                                                  02174000
UCBBALB  EQU   UCBPRSRS                                                 02175000
UCBPGFL  EQU   UCBSTAB                                                  02176000
UCBDVSHR EQU   UCBBSVL                                                  02177000
UCBVOLI  EQU   UCBOBS01+4                                               02178000
UCBVTOC  EQU   UCBOBS01                                                 02179000
TRMRLMCT EQU   IEDNTRM+10                                               02180000
TRMGPCNT EQU   TRMSIBPT                                                 02181000
TRMBUFRD EQU   TRMBYTE0                                                 02182000
TRMSNA   EQU   TRMBYTE0                                                 02183000
TRMGP    EQU   TRMBYTE0                                                 02184000
TRMDIAL  EQU   TRMBYTE0                                                 02185000
@NM00178 EQU   TRMBYTE0                                                 02186000
TRMOUTPT EQU   TRMBYTE0                                                 02187000
TRMINPUT EQU   TRMBYTE0                                                 02188000
TRMUDEF  EQU   TRMBYTE0                                                 02189000
TRMCKPRN EQU   TRMBYTE1                                                 02190000
TRMTSATN EQU   TRMBYTE1                                                 02191000
TRMTRACE EQU   TRMBYTE1                                                 02192000
TRMSWBCK EQU   TRMBYTE1                                                 02193000
TRMAUTOC EQU   TRMBYTE1                                                 02194000
TRMINPTP EQU   TRMBYTE1                                                 02195000
TRMWTNEG EQU   TRMSCPRQ                                                 02196000
TRMWRBRK EQU   TRMBYTE2                                                 02197000
TRMNOSND EQU   TRMBYTE2                                                 02198000
TRMPREP  EQU   TRMBYTE2                                                 02199000
TRMGPACT EQU   TRMBYTE2                                                 02200000
TRMANDL  EQU   TRMBYTE2                                                 02201000
TRMCLOSN EQU   TRMINPG                                                  02202000
TRMREMB  EQU   TRMBYTE2                                                 02203000
TRMOPTBL EQU   IEDQTRM+18                                               02204000
TRMOPNO  EQU   IEDQTRM+17                                               02205000
TRMCHCIN EQU   IEDQTRM+16                                               02206000
TRMSENSE EQU   TRMSTAT+3                                                02207000
TRMTEMPR EQU   TRMSTAT+2                                                02208000
TRMSIO   EQU   TRMSTAT                                                  02209000
@NM00177 EQU   TRMDEVFL+1                                               02210000
TRMTPIN  EQU   TRMDEVFL+1                                               02211000
TRMNCPI  EQU   TRMDEVFL+1                                               02212000
TRMRNTRM EQU   TRMDEVFL+1                                               02213000
@NM00176 EQU   TRMDEVFL+1                                               02214000
TRMLMD   EQU   TRMDEVFL+1                                               02215000
TRMCONC  EQU   TRMDEVFL+1                                               02216000
TRMTSOB  EQU   TRMDEVFL                                                 02217000
TRMBFDY  EQU   TRMDEVFL                                                 02218000
TRMTBLK  EQU   TRMDEVFL                                                 02219000
TRMSBLK  EQU   TRMDEVFL                                                 02220000
TRMBLKS  EQU   TRMDEVFL                                                 02221000
TRMADDC  EQU   TRMDEVFL                                                 02222000
TRMDDIG  EQU   TRMDEVFL                                                 02223000
TRMBUFS  EQU   TRMDEVFL                                                 02224000
TRMPRILK EQU   TRMALTD                                                  02225000
TRMLGB   EQU   TRMDSORG                                                 02226000
TRMUTERM EQU   TLISTCNT                                                 02227000
TRMSCNYN EQU   TRMSTATE                                                 02228000
TRMOPTFN EQU   TRMSTATE                                                 02229000
TRMHELDN EQU   TRMSTATE                                                 02230000
TRMACPTN EQU   TRMSTATE                                                 02231000
TRMPREF  EQU   TRMSTATE                                                 02232000
TRMPROC  EQU   TRMLOG                                                   02233000
TRMLIST  EQU   TRMLOG                                                   02234000
TRMLINE  EQU   TRMSTATE                                                 02235000
QCBTTCIN EQU   QCBPLCBA+1                                               02236000
@NM00175 EQU   QCBPLCBA                                                 02237000
@NM00174 EQU   QCBSTAT1                                                 02238000
QCBFLUSH EQU   QCBSTAT1                                                 02239000
QCBNDXRQ EQU   QCBSTAT1                                                 02240000
QCBESIG  EQU   QCBSTAT1                                                 02241000
QCBRCVRQ EQU   QCBSTAT1                                                 02242000
QCBSNDRQ EQU   QCBSTAT1                                                 02243000
QCBWAITC EQU   QCBSTAT1                                                 02244000
QCBPLCBN EQU   QCBSTAT1                                                 02245000
QCBCHAIN EQU   IEDNQCB                                                  02246000
QCBPQBCK EQU   IEDQPQCB+25                                              02247000
QCBPRIPQ EQU   IEDQPQCB+24                                              02248000
QCBCFHDR EQU   IEDQPQCB+21                                              02249000
QCBLFEFO EQU   IEDQPQCB+18                                              02250000
QCBFFEFO EQU   IEDQPQCB+15                                              02251000
QCBPREVF EQU   QCBINTLF                                                 02252000
QCBINTFF EQU   IEDQPQCB+9                                               02253000
QCBDATSQ EQU   QCBFHDTZ+1                                               02254000
@NM00173 EQU   QCBFHDTZ                                                 02255000
@NM00172 EQU   QCBPFEFO                                                 02256000
QCBDATFL EQU   QCBFHDLZ                                                 02257000
QCBDNHDR EQU   IEDQPQCB                                                 02258000
QCBQBACK EQU   IEDQQCB+37                                               02259000
QCBCKPT  EQU   QCBFLAG                                                  02260000
QCBPROC  EQU   QCBFLAG                                                  02261000
QCBSDFFO EQU   QCBFLAG                                                  02262000
QCBTERMQ EQU   QCBFLAG                                                  02263000
QCBRSRV  EQU   QCBFLAG                                                  02264000
QCBREAD  EQU   QCBFLAG                                                  02265000
QCBNOBRK EQU   QCBFLAG                                                  02266000
QCBTSSES EQU   QCBFLAG                                                  02267000
QCBLGBAD EQU   QCBDCBAD                                                 02268000
QCBRELLN EQU   IEDQQCB+32                                               02269000
QCBTJID  EQU   QCBLKRRN+1                                               02270000
QCBCARCT EQU   QCBLKRRN                                                 02271000
QCBPRLVL EQU   QCBPREN                                                  02272000
QCBMSGCT EQU   IEDQQCB+26                                               02273000
QCBEXTO  EQU   QCBINTVL                                                 02274000
QCBDISC  EQU   QCBTSOF1                                                 02275000
QCBDELAY EQU   QCBTSOF1                                                 02276000
QCBPARTO EQU   QCBTSOF1                                                 02277000
QCBSATRD EQU   QCBTSOF1                                                 02278000
QCBNOBUF EQU   QCBTSOF1                                                 02279000
QCBTPUT  EQU   QCBTSOF1                                                 02280000
QCBTGET  EQU   QCBTSOF1                                                 02281000
QCBWRBRK EQU   QCBTSOF1                                                 02282000
QCBSATLC EQU   QCBTSOF2                                                 02283000
QCBSATTI EQU   QCBTSOF2                                                 02284000
QCBSATCH EQU   QCBTSOF2                                                 02285000
QCBSIMRD EQU   QCBTSOF2                                                 02286000
QCBDSSMI EQU   QCBTSOF2                                                 02287000
QCBPOSTO EQU   QCBTSOF2                                                 02288000
QCBBUFQ  EQU   QCBTSOF2                                                 02289000
QCBINHBN EQU   QCBTSOF2                                                 02290000
QCBSATCT EQU   @NM00171                                                 02291000
QCBSCBOF EQU   IEDQQCB+20                                               02292000
QCBTIME  EQU   QCBSTAT                                                  02293000
QCBCLOCK EQU   QCBSTAT                                                  02294000
QCBSCHDL EQU   QCBSTAT                                                  02295000
QCBSMODE EQU   QCBSTAT                                                  02296000
QCBSEND  EQU   QCBSTAT                                                  02297000
QCBBUFRD EQU   QCBSTAT                                                  02298000
QCBTRMHO EQU   QCBSTAT                                                  02299000
QCBEOM   EQU   QCBSTAT                                                  02300000
QCBHUCT  EQU   QCBRETCT                                                 02301000
QCBIEND  EQU   QCBRETCT                                                 02302000
QCBEND   EQU   QCBRETCT                                                 02303000
QCBNL    EQU   QCBRETCT                                                 02304000
QCBLOGCT EQU   QCBRETCT                                                 02305000
@NM00170 EQU   QCBBYTE1                                                 02306000
QCBRITRM EQU   QCBBYTE1                                                 02307000
@NM00169 EQU   QCBEOLDT                                                 02308000
QCBSLINK EQU   IEDQQCB+13                                               02309000
QCBSTPRI EQU   IEDQQCB+12                                               02310000
QCBSTCHN EQU   IEDQQCB+9                                                02311000
QCBSTVTO EQU   IEDQQCB+8                                                02312000
QCBLINK  EQU   IEDQQCB+5                                                02313000
QCBPRI   EQU   IEDQQCB+4                                                02314000
QCBCNTEN EQU   QCBELCHN+2                                               02315000
@NM00168 EQU   QCBELCHN+2                                               02316000
@NM00167 EQU   QCBELCHN                                                 02317000
QCBHELD  EQU   QCBDSFLG                                                 02318000
QCBFQCB  EQU   QCBDSFLG                                                 02319000
QCBDRQQ  EQU   QCBDSFLG                                                 02320000
QCBALTMH EQU   QCBDSFLG                                                 02321000
QCBREUS  EQU   QCBDISK                                                  02322000
QCBNREUS EQU   QCBDISK                                                  02323000
QCBCORE  EQU   QCBDSFLG                                                 02324000
QCBTSQ   EQU   QCBDSFLG                                                 02325000
PRF2SEQP EQU   PRF2WD2                                                  02326000
@NM00166 EQU   IEDPF2+1                                                 02327000
@NM00165 EQU   PRF2FLG2                                                 02328000
PRF2TERM EQU   PRF2FLG2                                                 02329000
PRF2SMI  EQU   PRF2FLG2                                                 02330000
PRF2FORM EQU   PRF2FLG2                                                 02331000
PRF2TNTI EQU   PRF2FLG2                                                 02332000
PRF1RULN EQU   PRF1SEQP+2                                               02333000
PRF1TAG2 EQU   PRF1SQID+1                                               02334000
@NM00164 EQU   PRF1TAG1                                                 02335000
PRF1TAGS EQU   PRF1TAG1                                                 02336000
@NM00163 EQU   PRF1FLG1                                                 02337000
PRF1LOGD EQU   PRF1FLG1                                                 02338000
PRF1USS  EQU   PRF1FLG1                                                 02339000
PRF1FORM EQU   PRF1FLG1                                                 02340000
PRF1EXPI EQU   PRF1FLG1                                                 02341000
PRF1FIDI EQU   PRF1FLG1                                                 02342000
PRF1RH   EQU   IEDPF1                                                   02343000
PRFDEST  EQU   IEDQPRF+40                                               02344000
PRFISEQ  EQU   IEDQPRF+38                                               02345000
PRFSTXT  EQU   PRFHQBCK                                                 02346000
PRFNHDR  EQU   PRFCHDR                                                  02347000
PRFCRCD  EQU   IEDQPRF+29                                               02348000
PRFSVSEQ EQU   PRFNTXT+1                                                02349000
PRFSVPRI EQU   PRFEOBOF                                                 02350000
PRFISIZE EQU   PRFSCAN+1                                                02351000
@NM00162 EQU   PRFSCAN                                                  02352000
PRFEOB   EQU   PRFXTRA+1                                                02353000
PRFSTSO  EQU   PRFXTRA                                                  02354000
PRFNHDRN EQU   PRFSTAT1                                                 02355000
PRFNLSTN EQU   PRFSTAT1                                                 02356000
PRFLOCK  EQU   PRFEOFN                                                  02357000
PRFDUPLN EQU   PRFSTAT1                                                 02358000
PRFTSMSG EQU   PRFSTAT1                                                 02359000
PRFITCPN EQU   PRFSTAT1                                                 02360000
PRFERMGN EQU   PRFSTAT1                                                 02361000
PRFCNCLN EQU   PRFSTAT1                                                 02362000
PRFSVFLG EQU   @NM00161+3                                               02363000
PRFSIZE  EQU   PRFSVFFO+2                                               02364000
PRFSRCE  EQU   PRFSVFFO                                                 02365000
PRFLCB   EQU   IEDQPRF+13                                               02366000
PRFPIUO  EQU   PRFPLQCB                                                 02367000
PRFTI0   EQU   PRFTIC+1                                                 02368000
@NM00160 EQU   PRFTICC                                                  02369000
@NM00159 EQU   PRFTICC                                                  02370000
@NM00158 EQU   PRFTICC                                                  02371000
PRFTICON EQU   PRFTICC                                                  02372000
@NM00157 EQU   PRFTICC                                                  02373000
@NM00156 EQU   PRFTICC                                                  02374000
PRFBFMM  EQU   PRFTICC                                                  02375000
PRFEOMSG EQU   PRFTICC                                                  02376000
PRFCOUNT EQU   PRFLINK+1                                                02377000
@NM00155 EQU   PRFLINK                                                  02378000
PRFFLAGS EQU   PRFPRI                                                   02379000
PRFIOADR EQU   PRFQCBA                                                  02380000
PRFOPCDE EQU   PRFKEY                                                   02381000
@NM00154 EQU   OPREFLG3                                                 02382000
OPREATCH EQU   OPREFLG3                                                 02383000
@NM00153 EQU   OPREFLG3                                                 02384000
OPREFLG2 EQU   IEDOPRED+13                                              02385000
OPREFLG1 EQU   IEDOPRED+12                                              02386000
OPRETIC  EQU   OPRESAVE                                                 02387000
OPRELINK EQU   IEDOPRED+5                                               02388000
OPREKEY  EQU   IEDOPRED                                                 02389000
OPCBOTTM EQU   IEDQOPCD+1188                                            02390000
OPCDSRWT EQU   IEDQOPCD+1184                                            02391000
@NM00152 EQU   IEDQOPCD+1100                                            02392000
@NM00151 EQU   IEDQOPCD+948                                             02393000
@NM00150 EQU   IEDQOPCD+940                                             02394000
@NM00149 EQU   IEDQOPCD+380                                             02395000
@NM00148 EQU   OPCPWCOB+9                                               02396000
@NM00147 EQU   OPCPWCOB+8                                               02397000
@NM00146 EQU   OPCPWECB+1                                               02398000
OPCPWCCC EQU   OPCPWECB                                                 02399000
OPCPWCHN EQU   OPCPWQCB+1                                               02400000
OPCPWVTO EQU   OPCPWQCB                                                 02401000
OPCTOTCK EQU   IEDQOPCD+360                                             02402000
OPCAPXTL EQU   IEDQOPCD+356                                             02403000
OPCDECR  EQU   IEDQOPCD+352                                             02404000
OPCBUFWT EQU   IEDQOPCD+348                                             02405000
OPCADGOT EQU   IEDQOPCD+318                                             02406000
OPCRQCNT EQU   IEDQOPCD+316                                             02407000
OPPOLSTP EQU   IEDQOPCD+312                                             02408000
OPCCKCIB EQU   IEDQOPCD+308                                             02409000
OPCEND   EQU   IEDQOPCD+307                                             02410000
OPCSTCBS EQU   IEDQOPCD+306                                             02411000
OPCHNEND EQU   IEDQOPCD+302                                             02412000
OPCOQSW  EQU   IEDQOPCD+301                                             02413000
@NM00145 EQU   OPCSPEC                                                  02414000
@NM00144 EQU   OPCSPEC                                                  02415000
@NM00143 EQU   OPCSPEC                                                  02416000
@NM00142 EQU   OPCSPEC                                                  02417000
OPCFRMCA EQU   OPCSPEC                                                  02418000
OPCRSTRT EQU   OPCSPEC                                                  02419000
OPCPART  EQU   OPCSPEC                                                  02420000
OPCALTD  EQU   OPCSPEC                                                  02421000
OPCBFEND EQU   IEDQOPCD+296                                             02422000
OPCBFIRS EQU   IEDQOPCD+292                                             02423000
OPCAVBUF EQU   IEDQOPCD+290                                             02424000
OPCIPLCT EQU   IEDQOPCD+289                                             02425000
OPCCLNTS EQU   IEDQOPCD+288                                             02426000
OPCHA8   EQU   IEDQOPCD+286                                             02427000
OPCBFREQ EQU   IEDQOPCD+284                                             02428000
OPCNEXT  EQU   IEDQOPCD+272                                             02429000
OPCFMDFC EQU   IEDQOPCD+268                                             02430000
OPCSCNC  EQU   IEDQOPCD+264                                             02431000
OPCHORTG EQU   IEDQOPCD+260                                             02432000
OPCCKPTL EQU   IEDQOPCD+252                                             02433000
OPCCKPTF EQU   IEDQOPCD+248                                             02434000
OPCWAITA EQU   IEDQOPCD+244                                             02435000
OPCWAITR EQU   IEDQOPCD+240                                             02436000
OPCWAITP EQU   IEDQOPCD+236                                             02437000
OPCWAITO EQU   IEDQOPCD+232                                             02438000
OPCWAITN EQU   IEDQOPCD+228                                             02439000
OPCWAITL EQU   IEDQOPCD+224                                             02440000
OPCWAITC EQU   IEDQOPCD+220                                             02441000
@NM00141 EQU   OPCLDNME+5                                               02442000
@NM00140 EQU   OPCLDNME                                                 02443000
OPCWAIT  EQU   IEDQOPCD+192                                             02444000
OPCCKERB EQU   IEDQOPCD+164                                             02445000
OPCBFERB EQU   IEDQOPCD+148                                             02446000
OPCFLAG2 EQU   IEDQOPCD+147                                             02447000
OPCWRKSZ EQU   IEDQOPCD+144                                             02448000
OPCWORK  EQU   IEDQOPCD+140                                             02449000
OPCRSAVE EQU   IEDQOPCD+132                                             02450000
OPCQCBAD EQU   IEDQOPCD+128                                             02451000
OPCTRMWA EQU   IEDQOPCD+52                                              02452000
OPCPSTWT EQU   IEDQOPCD+48                                              02453000
OPCTNTEA EQU   IEDQOPCD+44                                              02454000
OPCPGCK  EQU   IEDQOPCD+40                                              02455000
OPCLCB   EQU   IEDQOPCD+36                                              02456000
@NM00139 EQU   IEDQOPCD+32                                              02457000
OPCIPLAD EQU   IEDQOPCD+28                                              02458000
OPCTOFLK EQU   IEDQOPCD+24                                              02459000
OPCOPTLK EQU   IEDQOPCD+20                                              02460000
OPCDCBLK EQU   IEDQOPCD+16                                              02461000
OPCDOUBL EQU   IEDQOPCD                                                 02462000
@NM00138 EQU   OCLDNME+4                                                02463000
@NM00137 EQU   OCPREFLG                                                 02464000
OCTOTEP  EQU   OCPREFLG                                                 02465000
OCREPOST EQU   OCPREFLG                                                 02466000
OCRSPSNT EQU   OCPREFLG                                                 02467000
OCBFREQ  EQU   OCPREFLG                                                 02468000
OCIDLE   EQU   OCREQFLG                                                 02469000
OCFORCE  EQU   OCREQFLG                                                 02470000
OCDCARD  EQU   OCREQFLG                                                 02471000
OCPARTAL EQU   OCREQFLG                                                 02472000
OCADNCP  EQU   OCREQFLG                                                 02473000
@NM00136 EQU   OCREQFLG                                                 02474000
@NM00135 EQU   OCREQFLG                                                 02475000
OCRESPCT EQU   OCLINTTE                                                 02476000
OCCKPTWA EQU   OCCKDATA+4                                               02477000
@NM00132 EQU   OCRSTGTM+2                                               02478000
OCCKDAT2 EQU   OCRSTGTM+1                                               02479000
OCCKDAT1 EQU   OCRSTGTM                                                 02480000
OCPUADR  EQU   OCIPLWA+2                                                02481000
OCWTGSAV EQU   OCIPLWA                                                  02482000
OCDVRDCT EQU   OCBACKUP+6                                               02483000
OCNCP    EQU   OCBACKUP+4                                               02484000
OCBUFGOT EQU   OCBACKUP+2                                               02485000
OCBUFNED EQU   OCBACKUP                                                 02486000
OCRESNUM EQU   OCPARM                                                   02487000
OCSEQ    EQU   OCTRUNIT+2                                               02488000
@NM00131 EQU   OCRSID+1                                                 02489000
OCREDRVE EQU   OCALSTAT                                                 02490000
OCSEQIND EQU   OCALSTAT                                                 02491000
@NM00130 EQU   @NM00129+2                                               02492000
OCCONID  EQU   OCDEST                                                   02493000
OCRLN    EQU   IEDQOPCE+15                                              02494000
OCSSCP   EQU   OCFLAG                                                   02495000
OCOUTPUT EQU   OCFLAG                                                   02496000
OCLINE   EQU   OCFLAG                                                   02497000
OCMPP    EQU   OCFLAG                                                   02498000
OCCONSOL EQU   OCFLAG                                                   02499000
@NM00128 EQU   OCSWITCH                                                 02500000
OCQUCKN  EQU   OCSWITCH                                                 02501000
OCPRIFLG EQU   OCOPTCDE                                                 02502000
@NM00127 EQU   OCRUDEST+1                                               02503000
@NM00126 EQU   OCSCAN                                                   02504000
OCNOTUCB EQU   OCSCAN                                                   02505000
OCNONAME EQU   OCSCAN                                                   02506000
OCALLRLN EQU   OCSCAN                                                   02507000
OCDDNAME EQU   OCSCAN                                                   02508000
OCDDNRLN EQU   OCSCAN                                                   02509000
OCADDR   EQU   OCSCAN                                                   02510000
OCELMPRI EQU   OCELEM                                                   02511000
@NM00125 EQU   NSLGRPNM+4                                               02512000
NSLOPCEP EQU   NSLGRPNM                                                 02513000
@NM00124 EQU   IEDNSLD+34                                               02514000
NSLUNCNT EQU   NSLERB+12                                                02515000
NSLBUFFR EQU   NSLERB+9                                                 02516000
@NM00123 EQU   NSLESTAT                                                 02517000
NSLMPPI  EQU   NSLESTAT                                                 02518000
@NM00122 EQU   NSLESTAT                                                 02519000
NSLELINK EQU   NSLERB+5                                                 02520000
NSLERBPR EQU   NSLERB+4                                                 02521000
NSLERQCB EQU   NSLERB                                                   02522000
NSLTTCIN EQU   IEDNSLD+16                                               02523000
NSLCTTRM EQU   IEDNSLD+13                                               02524000
@NM00121 EQU   NSLGPCUS                                                 02525000
NSLDRDRV EQU   NSLGPCUS                                                 02526000
NSLSDIAL EQU   NSLGPCUS                                                 02527000
NSLNGPSL EQU   NSLGPCUS                                                 02528000
NSLGPTSP EQU   NSLGPCUS                                                 02529000
NSLNGPST EQU   NSLGPCUS                                                 02530000
NSLSAVE  EQU   IEDNSLD+9                                                02531000
@NM00120 EQU   NSLPLCB                                                  02532000
NSLPLCBR EQU   NSLPLCB                                                  02533000
NSLOPRE  EQU   IEDNSLD                                                  02534000
NSLSAVE2 EQU   IEDNNSLD+4                                               02535000
NSLSAVE1 EQU   IEDNNSLD                                                 02536000
UCBERADR EQU   UCBUCS+12                                                02537000
UCBFCBID EQU   UCBUCS+8                                                 02538000
UCBERCNT EQU   UCBUCS+7                                                 02539000
UCBRSV51 EQU   UCBUCS+6                                                 02540000
UCBRSV50 EQU   UCBFCBOP                                                 02541000
UCBRSV49 EQU   UCBFCBOP                                                 02542000
UCBRSV48 EQU   UCBFCBOP                                                 02543000
UCBRSV47 EQU   UCBFCBOP                                                 02544000
UCBRSV46 EQU   UCBFCBOP                                                 02545000
UCBRSV45 EQU   UCBFCBOP                                                 02546000
UCBRSV44 EQU   UCBFCBOP                                                 02547000
UCBFCBO1 EQU   UCBFCBOP                                                 02548000
UCBUCSPE EQU   UCBUCSOP                                                 02549000
UCBRSV43 EQU   UCBUCSOP                                                 02550000
UCBRSV42 EQU   UCBUCSOP                                                 02551000
UCBRSV41 EQU   UCBUCSOP                                                 02552000
UCBRSV40 EQU   UCBUCSOP                                                 02553000
UCBRSV39 EQU   UCBUCSOP                                                 02554000
UCBUCSO2 EQU   UCBUCSOP                                                 02555000
UCBUCSO1 EQU   UCBUCSOP                                                 02556000
UCBUCSID EQU   UCBUCS                                                   02557000
UCBMDRBA EQU   UCBMDRBF+1                                               02558000
UCBRV075 EQU   UCBMDRBF                                                 02559000
UCBRV074 EQU   UCB3800X+32                                              02560000
UCBIMAGE EQU   UCB3800X+28                                              02561000
UCBFCBNM EQU   UCB3800X+24                                              02562000
UCBCHAR4 EQU   UCB3800X+20                                              02563000
UCBCHAR3 EQU   UCB3800X+16                                              02564000
UCBCHAR2 EQU   UCB3800X+12                                              02565000
UCBCHAR1 EQU   UCB3800X+8                                               02566000
UCBCGMID EQU   UCB3800X+4                                               02567000
UCBBRSTA EQU   UCBACTIV                                                 02568000
UCBRV063 EQU   UCBACTIV                                                 02569000
UCBRV062 EQU   UCBACTIV                                                 02570000
UCBRV061 EQU   UCBACTIV                                                 02571000
UCBRV060 EQU   UCBACTIV                                                 02572000
UCBRV059 EQU   UCBACTIV                                                 02573000
UCBRV058 EQU   UCBACTIV                                                 02574000
UCBRV057 EQU   UCBACTIV                                                 02575000
UCBRV050 EQU   UCB3800X+2                                               02576000
UCBCGMNO EQU   UCB3800X+1                                               02577000
UCBRV083 EQU   UCBOPTNS                                                 02578000
UCBBRSTR EQU   UCBOPTNS                                                 02579000
UCBRV056 EQU   UCBOPTNS                                                 02580000
UCBRV055 EQU   UCBOPTNS                                                 02581000
UCBRV054 EQU   UCBOPTNS                                                 02582000
UCBRV053 EQU   UCBOPTNS                                                 02583000
UCBRV052 EQU   UCBOPTNS                                                 02584000
UCBRV051 EQU   UCBOPTNS                                                 02585000
UCBRV073 EQU   UCB3540X+7                                               02586000
UCBRV072 EQU   UCBDKBYT                                                 02587000
UCBRV071 EQU   UCBDKBYT                                                 02588000
UCBRV070 EQU   UCBDKBYT                                                 02589000
UCBRV069 EQU   UCBDKBYT                                                 02590000
UCBRV068 EQU   UCBDKBYT                                                 02591000
UCBRV067 EQU   UCBDKBYT                                                 02592000
UCBVLVER EQU   UCBDKBYT                                                 02593000
UCBDKAMX EQU   UCBDKBYT                                                 02594000
UCBVLSER EQU   UCB3540X                                                 02595000
UCBRDATA EQU   UCBOCR+4                                                 02596000
UCBFRID  EQU   UCBOCR                                                   02597000
UCBCLN   EQU   UCBMT+14                                                 02598000
UCBERG   EQU   UCBMT+12                                                 02599000
UCBMS    EQU   UCBMT+11                                                 02600000
UCBNB    EQU   UCBMT+10                                                 02601000
UCBPW    EQU   UCBMT+9                                                  02602000
UCBPR    EQU   UCBMT+8                                                  02603000
UCBSIO   EQU   UCBMT+6                                                  02604000
UCBTW    EQU   UCBMT+5                                                  02605000
UCBTR    EQU   UCBMT+4                                                  02606000
UCBTWT   EQU   UCBMT+3                                                  02607000
UCBTRT   EQU   UCBMT+2                                                  02608000
UCBCTD   EQU   UCBMT                                                    02609000
UCBWTOID EQU   UCBCMEXT+17                                              02610000
UCBRV043 EQU   UCBCMEXT+16                                              02611000
UCBASID  EQU   UCBCMEXT+14                                              02612000
UCBMFCNT EQU   UCBCMEXT+12                                              02613000
UCBPMSK  EQU   UCBCMEXT+10                                              02614000
UCBCCWOF EQU   UCBCMEXT+8                                               02615000
UCBRV041 EQU   UCBCMEXT+6                                               02616000
UCBRV036 EQU   UCBFLP1                                                  02617000
UCBRV035 EQU   UCBFLP1                                                  02618000
UCBERLOG EQU   UCBFLP1                                                  02619000
UCBRV033 EQU   UCBFLP1                                                  02620000
UCBRV032 EQU   UCBFLP1                                                  02621000
UCBRV031 EQU   UCBFLP1                                                  02622000
UCBSHRUP EQU   UCBFLP1                                                  02623000
UCBNSRCH EQU   UCBFLP1                                                  02624000
UCBSNSCT EQU   UCBCMEXT+4                                               02625000
UCBHPDV  EQU   @NM00119                                                 02626000
UCBHALI  EQU   @NM00119                                                 02627000
UCBRSV09 EQU   @NM00119                                                 02628000
UCBRSV08 EQU   @NM00119                                                 02629000
UCBRSV07 EQU   @NM00119                                                 02630000
UCBRSV06 EQU   @NM00119                                                 02631000
UCBRSV05 EQU   @NM00119                                                 02632000
UCBRSV04 EQU   @NM00119                                                 02633000
UCBDTI   EQU   UCBCMEXT+2                                               02634000
UCBSTI   EQU   UCBCMEXT+1                                               02635000
UCBETI   EQU   UCBCMEXT                                                 02636000
UCBEXTP  EQU   UCBEXTPT+1                                               02637000
UCBDDRSW EQU   UCBFLC                                                   02638000
UCBTICBT EQU   UCBFLC                                                   02639000
UCBIVRR  EQU   UCBFLC                                                   02640000
UCBIVRS  EQU   UCBFLC                                                   02641000
UCBITF   EQU   UCBFLC                                                   02642000
UCBUDE   EQU   UCBFLC                                                   02643000
UCBWAA   EQU   UCBFLC                                                   02644000
UCBATTP  EQU   UCBFLC                                                   02645000
UCBUNTYP EQU   UCBTBYT4                                                 02646000
UCBRSV11 EQU   UCBDVCLS                                                 02647000
UCBRSV10 EQU   UCBDVCLS                                                 02648000
UCB3CHAR EQU   UCBDVCLS                                                 02649000
UCB3UREC EQU   UCBDVCLS                                                 02650000
UCB3DISP EQU   UCBDVCLS                                                 02651000
UCB3DACC EQU   UCBDVCLS                                                 02652000
UCB3COMM EQU   UCBDVCLS                                                 02653000
UCB3TAPE EQU   UCBDVCLS                                                 02654000
UCBDVPWR EQU   UCB2OPT7                                                 02655000
UCBVLPWR EQU   UCB2OPT6                                                 02656000
UCB2OPT5 EQU   UCBTBYT2                                                 02657000
UCBRVDEV EQU   UCBRWTAU                                                 02658000
UCBRPS   EQU   UCBDUDN2                                                 02659000
UCBRR    EQU   UCBDUDN1                                                 02660000
UCB2OPT1 EQU   UCBTBYT2                                                 02661000
UCB2OPT0 EQU   UCBTBYT2                                                 02662000
UCB1FEA7 EQU   UCBTBYT1                                                 02663000
UCBD6250 EQU   UCB1FEA6                                                 02664000
UCBD1600 EQU   UCB1FEA5                                                 02665000
UCB1FEA4 EQU   UCBTBYT1                                                 02666000
UCB1FEA3 EQU   UCBTBYT1                                                 02667000
UCB1FEA2 EQU   UCBTBYT1                                                 02668000
UCB1FEA1 EQU   UCBTBYT1                                                 02669000
UCB1FEA0 EQU   UCBTBYT1                                                 02670000
UCBRV029 EQU   UCBWGT                                                   02671000
UCBVHRSN EQU   UCBWGT                                                   02672000
UCBVORSN EQU   UCBWGT                                                   02673000
UCBMTPXP EQU   UCBWGT                                                   02674000
UCBREW   EQU   UCBWGT                                                   02675000
UCBPUB   EQU   UCBWGT                                                   02676000
UCBOUT   EQU   UCBWGT                                                   02677000
UCBIN    EQU   UCBWGT                                                   02678000
UCBCPU   EQU   UCBOB+11                                                 02679000
UCBLCI   EQU   UCBOB+10                                                 02680000
UCBCNT   EQU   UCBOB+9                                                  02681000
UCBRV017 EQU   UCBCHM1                                                  02682000
UCBRV016 EQU   UCBCHM1                                                  02683000
UCBRV015 EQU   UCBCHM1                                                  02684000
UCBRV014 EQU   UCBCHM1                                                  02685000
UCBSPB   EQU   UCBPTH1                                                  02686000
UCBPPB   EQU   UCBPTH1                                                  02687000
UCBSPA   EQU   UCBPTH0                                                  02688000
UCBPPA   EQU   UCBPTH0                                                  02689000
UCBSIGP  EQU   UCBFLB                                                   02690000
UCBVALPH EQU   UCBFLB                                                   02691000
UCBCRHSN EQU   UCBFLB                                                   02692000
UCBCRHRV EQU   UCBFLB                                                   02693000
UCBRESVH EQU   UCBFLB                                                   02694000
UCBSPST  EQU   UCBFLB                                                   02695000
UCBASNS  EQU   UCBFLB                                                   02696000
UCBIORST EQU   UCBFLB                                                   02697000
UCBQISCE EQU   UCBFL1                                                   02698000
UCBACTV  EQU   UCBFL1                                                   02699000
UCBSAP   EQU   UCBFL1                                                   02700000
UCBNOTRC EQU   UCBCUB                                                   02701000
UCBPSNS  EQU   UCBFL1                                                   02702000
UCBUSING EQU   UCBPST                                                   02703000
UCBNOTRD EQU   UCBNRY                                                   02704000
UCBBUSYD EQU   UCBBSY                                                   02705000
UCBUA    EQU   UCBCHAN+1                                                02706000
UCBCHA   EQU   UCBCHAN                                                  02707000
UCBDADI  EQU   UCBSTAT                                                  02708000
UCBSYSR  EQU   UCBSTAT                                                  02709000
UCBPRES  EQU   UCBSTAT                                                  02710000
UCBALOC  EQU   UCBSTAT                                                  02711000
UCBUNLD  EQU   UCBSTAT                                                  02712000
UCBRESV  EQU   UCBSTAT                                                  02713000
UCBCHGS  EQU   UCBSTAT                                                  02714000
UCBONLI  EQU   UCBSTAT                                                  02715000
UCBID    EQU   UCBOB+2                                                  02716000
UCBALTPH EQU   UCBFL5                                                   02717000
UCBALTCU EQU   UCBFL5                                                   02718000
UCBNALOC EQU   UCBFL5                                                   02719000
UCBENVRD EQU   UCBFL5                                                   02720000
UCBVSDR  EQU   UCBFL5                                                   02721000
UCBSASK  EQU   UCBFL5                                                   02722000
UCBAMV   EQU   UCBAF                                                    02723000
UCBDCC   EQU   UCBFL5                                                   02724000
UCBMONT  EQU   UCBJBNR                                                  02725000
UCBRV011 EQU   UCBJBNR                                                  02726000
UCBRSV02 EQU   UCBJBNR                                                  02727000
UCBOLDSM EQU   UCBJBNR                                                  02728000
UCBRV003 EQU   UCBJBNR                                                  02729000
UCBDUC   EQU   UCBJBNR                                                  02730000
UCBJES3  EQU   UCBJBNR                                                  02731000
UCBVRDEV EQU   UCBJBNR                                                  02732000
UCBCMSEG EQU   UCBOB                                                    02733000
UCBPFXND EQU   UCB+512                                                  02734000
UCBIOQ   EQU   UCB+508                                                  02735000
UCBLOCK  EQU   UCB+504                                                  02736000
UCBPXST  EQU   UCB+504                                                  02737000
@NM00116 EQU   UCB                                                      02738000
DEBAPPAD EQU   IEDQDEB+65                                               02739000
DEBEXSCL EQU   IEDQDEB+64                                               02740000
DEBDCBAD EQU   IEDQDEB+61                                               02741000
DEBPROTG EQU   IEDQDEB+60                                               02742000
DEBECBAD EQU   IEDQDEB+57                                               02743000
DEBPRIOR EQU   IEDQDEB+56                                               02744000
DEBUSRPG EQU   IEDQDEB+53                                               02745000
DEBSYSPG EQU   IEDQDEB+49                                               02746000
DEBOPATB EQU   IEDQDEB+48                                               02747000
DEBIRBAD EQU   IEDQDEB+45                                               02748000
DEBOFLGS EQU   IEDQDEB+44                                               02749000
DEBDEBAD EQU   IEDQDEB+41                                               02750000
DEBAMLNG EQU   IEDQDEB+40                                               02751000
DEBTCBAD EQU   IEDQDEB+37                                               02752000
@NM00115 EQU   DEBPRF+33                                                02753000
DEBLNGTH EQU   DEBPRF+32                                                02754000
DEBDCBMK EQU   DEBPRF+28                                                02755000
DEBDSCBA EQU   DEBPRF+21                                                02756000
DEBWKARA EQU   DEBPRF+20                                                02757000
DEBXCEA  EQU   DEBAPVT+16                                               02758000
DEBCEA   EQU   DEBAPVT+12                                               02759000
DEBPCIA  EQU   DEBAPVT+8                                                02760000
DEBSIOA  EQU   DEBAPVT+4                                                02761000
DEBEOEA  EQU   DEBAPVT                                                  02762000
DCBBUFSI EQU   IHADCS43+6                                               02763000
DCBUNTCT EQU   IHADCS43+5                                               02764000
DCBILCT  EQU   IHADCS43+4                                               02765000
DCBSCTAD EQU   DCBSCTAB+1                                               02766000
@NM00114 EQU   DCBSCTAB                                                 02767000
DCBPUTA  EQU   DCBGETA                                                  02768000
@NM00113 EQU   DCBPUT                                                   02769000
DCBDEBA  EQU   DCBDEBAD+1                                               02770000
@NM00112 EQU   DCBIFLGS                                                 02771000
DCBIFIOE EQU   DCBIFLGS                                                 02772000
DCBCH12  EQU   DCBIFPCT                                                 02773000
DCBCH9   EQU   DCBIFPCT                                                 02774000
DCBIFEC  EQU   DCBIFLGS                                                 02775000
DCBMFSTI EQU   DCBMFDMD                                                 02776000
DCBMFAWR EQU   DCBMFSTK                                                 02777000
DCBMFUIP EQU   DCBMFTMD                                                 02778000
DCBMFIDW EQU   DCBMFLCP                                                 02779000
DCBMFWRK EQU   DCBMFMVP                                                 02780000
DCBMFRDQ EQU   DCBMFWRT                                                 02781000
DCBMFGTQ EQU   DCBMFPUT                                                 02782000
DCBMFSTL EQU   DCBMACF2                                                 02783000
DCBMFCK  EQU   DCBMFDMG                                                 02784000
DCBMFRDX EQU   DCBMFCHK                                                 02785000
DCBMFDBF EQU   DCBMFSBG                                                 02786000
DCBMFRDI EQU   DCBMFLCG                                                 02787000
DCBMFRDK EQU   DCBMFMVG                                                 02788000
DCBMFWRQ EQU   DCBMFRD                                                  02789000
DCBMFPTQ EQU   DCBMFGET                                                 02790000
DCBMFECP EQU   DCBMACF1                                                 02791000
DCBTIOT  EQU   IHADCS25                                                 02792000
DCBMRSTI EQU   DCBMRDMD                                                 02793000
DCBMRAWR EQU   DCBMRSTK                                                 02794000
DCBMRUIP EQU   DCBMRTMD                                                 02795000
DCBMRIDW EQU   DCBMRLCP                                                 02796000
DCBMRWRK EQU   DCBMRMVP                                                 02797000
DCBMRRDQ EQU   DCBMRWRT                                                 02798000
DCBMRGTQ EQU   DCBMRPUT                                                 02799000
DCBMRSTL EQU   DCBMACR2                                                 02800000
DCBMRCK  EQU   DCBMRDMG                                                 02801000
DCBPGFXA EQU   DCBMRRDX                                                 02802000
DCBMRDBF EQU   DCBMRSBG                                                 02803000
DCBMRRDI EQU   DCBMRLCG                                                 02804000
DCBMRRDK EQU   DCBMRMVG                                                 02805000
DCBMRWRQ EQU   DCBMRRD                                                  02806000
DCBMRPTQ EQU   DCBMRGET                                                 02807000
DCBMRECP EQU   DCBMACR1                                                 02808000
@NM00111 EQU   DCBIFLG                                                  02809000
DCBIBIOE EQU   DCBIFLG                                                  02810000
DCBICH12 EQU   DCBIBPCT                                                 02811000
DCBICH9  EQU   DCBIBPCT                                                 02812000
DCBIBEC  EQU   DCBIFLG                                                  02813000
DCBOFIOF EQU   DCBOFLGS                                                 02814000
DCBOFUEX EQU   DCBOFLGS                                                 02815000
DCBOFTM  EQU   DCBOFLGS                                                 02816000
DCBOFPPC EQU   DCBOFLGS                                                 02817000
DCBOFOPN EQU   DCBOFLGS                                                 02818000
DCBOFEOV EQU   DCBOFLGS                                                 02819000
DCBOFLRB EQU   DCBOFLGS                                                 02820000
DCBOFIOD EQU   DCBOFLWR                                                 02821000
DCBDDNAM EQU   IHADCS24                                                 02822000
DCBEXLSA EQU   DCBEXLST+1                                               02823000
DCBEIOBX EQU   DCBEXLST                                                 02824000
DCBRNCKA EQU   DCBRNCKD+1                                               02825000
@NM00110 EQU   DCBRNCKD                                                 02826000
DCBIOBAD EQU   IHADCS2K+8                                               02827000
DCBDSGTR EQU   DCBDSRG2                                                 02828000
@NM00109 EQU   DCBDSRG2                                                 02829000
DCBDSRG1 EQU   DCBDSORG                                                 02830000
DCBCHNGL EQU   DCBTRSTA                                                 02831000
DCBNIDLE EQU   DCBTRSTA                                                 02832000
DCBBAKUP EQU   DCBTRSTA                                                 02833000
DCBIPLED EQU   DCBTRSTA                                                 02834000
DCBRSTRT EQU   DCBTRSTA                                                 02835000
DCBINITL EQU   DCBTRSTA                                                 02836000
DCBAUTOD EQU   DCBTRSTA                                                 02837000
DCBAUTOI EQU   DCBTRSTA                                                 02838000
@NM00108 EQU   IHADCS2K+4                                               02839000
DCBDUMPA EQU   DCBDUMPD+1                                               02840000
DCBUNITN EQU   DCBDUMPD                                                 02841000
DCBBCKUA EQU   DCBBCKUP+1                                               02842000
@NM00107 EQU   DCBBCKUP                                                 02843000
DCBIPLTX EQU   IHADCS1A                                                 02844000
@NM00106 EQU   IHADCB                                                   02845000
SAVTLLCB EQU   IEDNSVTD+316                                             02846000
SAVTBITN EQU   IEDNSVTD+312                                             02847000
@NM00105 EQU   SAVTCKQB+8                                               02848000
@NM00104 EQU   SAVTCKEC+1                                               02849000
@NM00103 EQU   SAVTCKCC                                                 02850000
SAVTCKPO EQU   SAVTCKCC                                                 02851000
SAVTCKWA EQU   SAVTCKCC                                                 02852000
SAVTCKCH EQU   SAVTCKTB+1                                               02853000
SAVTCKVT EQU   SAVTCKTB                                                 02854000
@NM00102 EQU   IEDNSVTD+297                                             02855000
SAVTRDFG EQU   SAVTRDRV+12                                              02856000
@NM00101 EQU   SAVTRDRV+5                                               02857000
SAVTRDPY EQU   SAVTRDRV+4                                               02858000
SAVTRDQB EQU   SAVTRDRV+1                                               02859000
SAVTRDKY EQU   SAVTRDRV                                                 02860000
SAVTNID  EQU   IEDNSVTD+280                                             02861000
SAVTDVAS EQU   IEDNSVTD+276                                             02862000
SAVTPLSZ EQU   IEDNSVTD+274                                             02863000
@NM00100 EQU   IEDNSVTD+273                                             02864000
SAVTSUBL EQU   IEDNSVTD+272                                             02865000
@NM00099 EQU   SAVTZELM+1                                               02866000
SAVTSUBM EQU   SAVTZELM                                                 02867000
SAVTMHDX EQU   IEDNSVTD+268                                             02868000
SAVTNAT1 EQU   IEDNSVTD+266                                             02869000
SAVTSH20 EQU   IEDNSVTD+264                                             02870000
SAVTLCBS EQU   IEDNSVTD+260                                             02871000
SAVTRNMP EQU   IEDNSVTD+256                                             02872000
SAVTTNTX EQU   IEDNSVTD+252                                             02873000
SAVTNAX  EQU   IEDNSVTD+248                                             02874000
SAVTSUBV EQU   IEDNSVTD+247                                             02875000
SAVTSUBA EQU   IEDNSVTD+246                                             02876000
SAVTSIBC EQU   IEDNSVTD+244                                             02877000
SAVTBSM  EQU   IEDNSVTD+240                                             02878000
SAVTSCPT EQU   SAVTTCPU                                                 02879000
SAVTRQTG EQU   IEDNSVTD+236                                             02880000
SAVTRQCH EQU   IEDNSVTD+232                                             02881000
SAVTMAND EQU   IEDNSVTD+228                                             02882000
SAVTNADL EQU   IEDNSVTD+222                                             02883000
SAVTNATL EQU   IEDNSVTD+220                                             02884000
SAVTMHTB EQU   IEDNSVTD+216                                             02885000
SAVTSSMH EQU   IEDNSVTD+212                                             02886000
SAVTQRS  EQU   IEDNSVTD+208                                             02887000
SAVTRQIN EQU   IEDNSVTD+204                                             02888000
SAVTDFCO EQU   IEDNSVTD+200                                             02889000
SAVTSAO  EQU   IEDNSVTD+196                                             02890000
SAVTSARI EQU   IEDNSVTD+192                                             02891000
SAVTSAC  EQU   IEDNSVTD+188                                             02892000
SAVTSAI  EQU   IEDNSVTD+184                                             02893000
SAVTCSCI EQU   IEDNSVTD+180                                             02894000
SAVTSSRP EQU   IEDNSVTD+176                                             02895000
SAVTSSRQ EQU   IEDNSVTD+172                                             02896000
SAVTSCLU EQU   IEDNSVTD+168                                             02897000
SAVTXTRQ EQU   IEDNSVTD+164                                             02898000
SAVTMVBF EQU   IEDNSVTD+160                                             02899000
@NM00098 EQU   IEDNSVTD+148                                             02900000
SAVTIPCQ EQU   IEDNSVTD+144                                             02901000
@NM00097 EQU   IEDNSVTD+136                                             02902000
SAVTXFMI EQU   IEDNSVTD+132                                             02903000
@NM00096 EQU   IEDNSVTD+124                                             02904000
SAVTXFMO EQU   IEDNSVTD+120                                             02905000
@NM00095 EQU   IEDNSVTD+116                                             02906000
SAVTSSSR EQU   IEDNSVTD+112                                             02907000
SAVTSCPQ EQU   IEDNSVTD+108                                             02908000
SAVTSLCB EQU   IEDNSVTD+104                                             02909000
SAVTLUSR EQU   IEDNSVTD+100                                             02910000
@NM00094 EQU   SAVTLUSQ+8                                               02911000
SAVTLUSP EQU   SAVTLUSQ+4                                               02912000
SAVTLUSB EQU   SAVTLUSQ                                                 02913000
@NM00093 EQU   IEDNSVTD+84                                              02914000
SAVTSAT  EQU   IEDNSVTD+80                                              02915000
SAVTNAT  EQU   IEDNSVTD+76                                              02916000
SAVTCLUP EQU   IEDNSVTD+72                                              02917000
SAVTPIUT EQU   IEDNSVTD+68                                              02918000
SAVTRNTA EQU   IEDNSVTD+64                                              02919000
SAVTDNIR EQU   IEDNSVTD+60                                              02920000
SAVTCNIR EQU   IEDNSVTD+56                                              02921000
SAVTFLDH EQU   IEDNSVTD+52                                              02922000
SAVTSRTN EQU   IEDNSVTD+48                                              02923000
SAVTSREQ EQU   IEDNSVTD+44                                              02924000
SAVTFAIL EQU   IEDNSVTD+42                                              02925000
SAVTSUSE EQU   IEDNSVTD+40                                              02926000
SAVTSIB  EQU   IEDNSVTD+36                                              02927000
SAVTPRTN EQU   IEDNSVTD+32                                              02928000
@NM00092 EQU   IEDNSVTD+28                                              02929000
SAVTWH20 EQU   IEDNSVTD+26                                              02930000
SAVTPWT  EQU   IEDNSVTD+24                                              02931000
SAVTPRTQ EQU   IEDNSVTD+20                                              02932000
SAVTPREQ EQU   IEDNSVTD+16                                              02933000
SAVTPH20 EQU   IEDNSVTD+14                                              02934000
SAVTPUSE EQU   IEDNSVTD+12                                              02935000
SAVTPLCB EQU   IEDNSVTD+8                                               02936000
SAVTPOOL EQU   IEDNSVTD+4                                               02937000
SAVTPRMT EQU   SAVTDIAF                                                 02938000
SAVTVIRT EQU   SAVTDIAF                                                 02939000
AVTCPBNO EQU   IEDQAVTD+1244                                            02940000
AVTHRESS EQU   IEDQAVTD+1243                                            02941000
@NM00091 EQU   IEDQAVTD+1242                                            02942000
@NM00090 EQU   IEDQAVTD+1241                                            02943000
@NM00089 EQU   IEDQAVTD+1240                                            02944000
@NM00088 EQU   IEDQAVTD+1237                                            02945000
@NM00087 EQU   IEDQAVTD+1236                                            02946000
AVTHRESE EQU   @NM00086                                                 02947000
AVTRADDR EQU   IEDQAVTD+1228                                            02948000
AVTNADDR EQU   IEDQAVTD+1224                                            02949000
AVTHRESN EQU   IEDQAVTD+1220                                            02950000
AVTVOLRN EQU   IEDQAVTD+1216                                            02951000
AVTTOTNN EQU   IEDQAVTD+1212                                            02952000
AVTTRCYN EQU   IEDQAVTD+1208                                            02953000
AVTRCTRN EQU   IEDQAVTD+1204                                            02954000
AVTNOVON EQU   IEDQAVTD+1200                                            02955000
AVTADEBN EQU   IEDQAVTD+1196                                            02956000
AVTVOLRR EQU   IEDQAVTD+1192                                            02957000
AVTTOTNR EQU   IEDQAVTD+1188                                            02958000
AVTTRCYR EQU   IEDQAVTD+1184                                            02959000
AVTRCTRR EQU   IEDQAVTD+1180                                            02960000
AVTNOVOR EQU   IEDQAVTD+1176                                            02961000
AVTADEBR EQU   IEDQAVTD+1172                                            02962000
AVTLODPT EQU   IEDQAVTD+1168                                            02963000
AVTIOBN  EQU   IEDQAVTD+1164                                            02964000
AVTIOBR  EQU   IEDQAVTD+1160                                            02965000
AVTCPBPT EQU   IEDQAVTD+1156                                            02966000
AVTFCPB  EQU   IEDQAVTD+1152                                            02967000
@NM00085 EQU   IEDQAVTD+1148                                            02968000
AVTINCPQ EQU   IEDQAVTD+1144                                            02969000
@NM00084 EQU   IEDQAVTD+1140                                            02970000
@NM00083 EQU   IEDQAVTD+1137                                            02971000
@NM00082 EQU   AVTBIT4                                                  02972000
@NM00081 EQU   AVTBIT4                                                  02973000
@NM00080 EQU   AVTBIT4                                                  02974000
@NM00079 EQU   AVTBIT4                                                  02975000
@NM00078 EQU   AVTBIT4                                                  02976000
@NM00077 EQU   AVTBIT4                                                  02977000
@NM00076 EQU   AVTBIT4                                                  02978000
AVTRUFTN EQU   AVTBIT4                                                  02979000
@NM00075 EQU   IEDQAVTD+1132                                            02980000
AVTNOBFQ EQU   IEDQAVTD+1128                                            02981000
@NM00074 EQU   IEDQAVTD+1124                                            02982000
AVTDKENQ EQU   IEDQAVTD+1120                                            02983000
@NM00073 EQU   IEDQAVTD+1116                                            02984000
AVTDKAPQ EQU   IEDQAVTD+1112                                            02985000
AVTCOPY  EQU   IEDQAVTD+1108                                            02986000
AVTIA    EQU   IEDQAVTD+1104                                            02987000
AVTFL    EQU   IEDQAVTD+1100                                            02988000
@NM00072 EQU   IEDQAVTD+1096                                            02989000
AVTNCPBQ EQU   IEDQAVTD+1092                                            02990000
AVTTOTNC EQU   IEDQAVTD+1088                                            02991000
AVTCMAX  EQU   IEDQAVTD+1084                                            02992000
AVTCMIN  EQU   IEDQAVTD+1080                                            02993000
AVTHM02  EQU   IEDQAVTD+1076                                            02994000
AVTOPCIN EQU   IEDQAVTD+1074                                            02995000
AVTDCTLN EQU   IEDQAVTD+1072                                            02996000
AVTOPMSK EQU   IEDQAVTD+1068                                            02997000
AVTDDFT  EQU   IEDQAVTD+1064                                            02998000
AVTSTEAL EQU   IEDQAVTD+1060                                            02999000
AVTOPTN  EQU   IEDQAVTD+1056                                            03000000
AVTDSKCT EQU   IEDQAVTD+1054                                            03001000
AVTCKRST EQU   IEDQAVTD+1053                                            03002000
AVTSTAN  EQU   AVTBIT3                                                  03003000
AVTSTACN EQU   AVTBIT3                                                  03004000
AVTSTAIN EQU   AVTBIT3                                                  03005000
AVTSTAYN EQU   AVTBIT3                                                  03006000
AVTOLTBN EQU   AVTBIT3                                                  03007000
AVTTSAB  EQU   AVTBIT3                                                  03008000
AVTRFULN EQU   AVTBIT3                                                  03009000
AVTRECVN EQU   AVTBIT3                                                  03010000
@NM00071 EQU   AVTBIT2                                                  03011000
@NM00070 EQU   AVTBIT2                                                  03012000
AVTOPEIN EQU   AVTBIT2                                                  03013000
AVTSTRTN EQU   AVTBIT2                                                  03014000
AVTTOPOL EQU   AVTBIT2                                                  03015000
AVTCOPYN EQU   AVTBIT2                                                  03016000
AVTREUSN EQU   AVTBIT2                                                  03017000
AVTEXTSC EQU   AVTBIT2                                                  03018000
AVTDISKN EQU   AVTBIT1                                                  03019000
AVTQUCKN EQU   AVTBIT1                                                  03020000
AVTCLOSN EQU   AVTBIT1                                                  03021000
AVTREADN EQU   AVTBIT1                                                  03022000
AVTDLAYN EQU   AVTBIT1                                                  03023000
AVTAQTAN EQU   AVTBIT1                                                  03024000
AVTTSON  EQU   AVTBIT1                                                  03025000
AVTAPLKN EQU   AVTBIT1                                                  03026000
AVTDUMBR EQU   IEDQAVTD+1048                                            03027000
AVTDLQX  EQU   IEDQAVTD+1046                                            03028000
AVTINTLV EQU   IEDQAVTD+1044                                            03029000
AVTSMCNT EQU   IEDQAVTD+1042                                            03030000
AVTAVFCT EQU   IEDQAVTD+1040                                            03031000
AVTOPCON EQU   IEDQAVTD+1038                                            03032000
AVTOPCNT EQU   IEDQAVTD+1036                                            03033000
AVTLNCNT EQU   IEDQAVTD+1034                                            03034000
AVTKEYLE EQU   IEDQAVTD+1032                                            03035000
AVTHA16  EQU   IEDQAVTD+1030                                            03036000
AVTHA7   EQU   IEDQAVTD+1028                                            03037000
AVTHA4   EQU   IEDQAVTD+1026                                            03038000
AVTHA3   EQU   IEDQAVTD+1024                                            03039000
AVTHA2   EQU   IEDQAVTD+1022                                            03040000
AVTGETMS EQU   IEDQAVTD+1021                                            03041000
@NM00069 EQU   IEDQAVTD+1020                                            03042000
AVTGETMD EQU   IEDQAVTD+1016                                            03043000
AVTGETMN EQU   IEDQAVTD+1012                                            03044000
AVTCWTOT EQU   IEDQAVTD+1008                                            03045000
AVTCWINT EQU   IEDQAVTD+956                                             03046000
AVTDTRAP EQU   IEDQAVTD+952                                             03047000
@NM00068 EQU   IEDQAVTD+950                                             03048000
@NM00067 EQU   AVTIOTR                                                  03049000
AVTIOTRH EQU   AVTIOTR                                                  03050000
AVTIOTRE EQU   AVTIOTR                                                  03051000
@NM00066 EQU   AVTSUBT                                                  03052000
AVTSUBPT EQU   AVTSUBT                                                  03053000
AVTSUBON EQU   AVTSUBT                                                  03054000
AVTAFE30 EQU   IEDQAVTD+944                                             03055000
AVTAFE20 EQU   IEDQAVTD+940                                             03056000
AVTAFE10 EQU   IEDQAVTD+936                                             03057000
AVTCWEC2 EQU   IEDQAVTD+932                                             03058000
AVTCWPM2 EQU   IEDQAVTD+928                                             03059000
AVTCWTS2 EQU   IEDQAVTD+927                                             03060000
AVTCWTS1 EQU   IEDQAVTD+926                                             03061000
AVTCWCLD EQU   AVTCWFL2                                                 03062000
AVTCWRAP EQU   AVTCWFL2                                                 03063000
@NM00065 EQU   AVTCWFL2                                                 03064000
@NM00064 EQU   AVTCWFL2                                                 03065000
@NM00063 EQU   AVTCWFL2                                                 03066000
@NM00062 EQU   AVTCWFL2                                                 03067000
@NM00061 EQU   AVTCWFL2                                                 03068000
AVTCWACT EQU   AVTCWFL2                                                 03069000
@NM00060 EQU   AVTCWFL1                                                 03070000
@NM00059 EQU   AVTCWFL1                                                 03071000
@NM00058 EQU   AVTCWFL1                                                 03072000
@NM00057 EQU   AVTCWFL1                                                 03073000
@NM00056 EQU   AVTCWFL1                                                 03074000
@NM00055 EQU   AVTCWFL1                                                 03075000
@NM00054 EQU   AVTCWFL1                                                 03076000
AVTCOMWN EQU   AVTCWFL1                                                 03077000
AVTCWEC1 EQU   IEDQAVTD+920                                             03078000
AVTCWPM1 EQU   IEDQAVTD+916                                             03079000
AVTCAREA EQU   IEDQAVTD+912                                             03080000
AVTFZERO EQU   IEDQAVTD+908                                             03081000
AVTCADDR EQU   IEDQAVTD+904                                             03082000
AVTCOREC EQU   IEDQAVTD+900                                             03083000
@NM00053 EQU   IEDQAVTD+892                                             03084000
AVTCPBCB EQU   IEDQAVTD+888                                             03085000
@NM00052 EQU   IEDQAVTD+880                                             03086000
AVTDSIOB EQU   IEDQAVTD+876                                             03087000
@NM00051 EQU   IEDQAVTD+868                                             03088000
AVTCPRMB EQU   IEDQAVTD+864                                             03089000
@NM00050 EQU   IEDQAVTD+856                                             03090000
AVTCLOSB EQU   IEDQAVTD+852                                             03091000
@NM00049 EQU   IEDQAVTD+844                                             03092000
AVTACTIB EQU   IEDQAVTD+840                                             03093000
@NM00048 EQU   IEDQAVTD+836                                             03094000
AVTOLTEB EQU   IEDQAVTD+832                                             03095000
AVTOLTCH EQU   AVTOLTQB+1                                               03096000
AVTOLTVT EQU   AVTOLTQB                                                 03097000
@NM00047 EQU   AVTOPCQB+8                                               03098000
@NM00046 EQU   AVTOPCEC+1                                               03099000
@NM00045 EQU   AVTOPCCC                                                 03100000
AVTOPCPO EQU   AVTOPCCC                                                 03101000
AVTOPCWA EQU   AVTOPCCC                                                 03102000
AVTOPCCH EQU   AVTOPCOB+1                                               03103000
AVTOPCVT EQU   AVTOPCOB                                                 03104000
@NM00044 EQU   AVTCKPQB+9                                               03105000
AVTCKPTS EQU   AVTCKPQB+8                                               03106000
@NM00043 EQU   AVTCKPEC+1                                               03107000
@NM00042 EQU   AVTCKPCC                                                 03108000
AVTCKPPO EQU   AVTCKPCC                                                 03109000
AVTCKPWA EQU   AVTCKPCC                                                 03110000
AVTCKPCH EQU   AVTCKPTB+1                                               03111000
AVTCKPVT EQU   AVTCKPTB                                                 03112000
@NM00041 EQU   IEDQAVTD+796                                             03113000
AVTBFRTB EQU   IEDQAVTD+792                                             03114000
@NM00040 EQU   IEDQAVTD+788                                             03115000
AVTSELCH EQU   IEDQAVTD+785                                             03116000
AVTBFRTN EQU   AVTBFRFG                                                 03117000
AVTBFREB EQU   IEDQAVTD+780                                             03118000
AVTTIMQ  EQU   IEDQAVTD+776                                             03119000
@NM00039 EQU   IEDQAVTD+772                                             03120000
AVTIMQPS EQU   IEDQAVTD+768                                             03121000
AVTINOUT EQU   IEDQAVTD+766                                             03122000
AVTREFTM EQU   IEDQAVTD+764                                             03123000
@NM00038 EQU   IEDQAVTD+752                                             03124000
AVTDELYB EQU   IEDQAVTD+748                                             03125000
AVTOCQPT EQU   IEDQAVTD+744                                             03126000
AVTTSOPT EQU   IEDQAVTD+740                                             03127000
AVTSUPPT EQU   IEDQAVTD+736                                             03128000
AVTCBQCB EQU   IEDQAVTD+732                                             03129000
AVTMSGS  EQU   IEDQAVTD+729                                             03130000
@NM00037 EQU   AVTSYSER                                                 03131000
@NM00036 EQU   AVTSYSER                                                 03132000
@NM00035 EQU   AVTSYSER                                                 03133000
@NM00034 EQU   AVTSYSER                                                 03134000
@NM00033 EQU   AVTSYSER                                                 03135000
@NM00032 EQU   AVTSYSER                                                 03136000
AVTCMAXN EQU   AVTSYSER                                                 03137000
AVTCMINN EQU   AVTSYSER                                                 03138000
AVT2260L EQU   IEDQAVTD+724                                             03139000
AVTABEPL EQU   AVTADBUF                                                 03140000
AVTHFF   EQU   AVTCLRHI+2                                               03141000
@NM00031 EQU   AVTCLRHI                                                 03142000
AVTCCLNK EQU   AVTCRELE+5                                               03143000
AVTCCPRI EQU   AVTCRELE+4                                               03144000
AVTCCQCB EQU   AVTCCELE+1                                               03145000
AVTCCKEY EQU   AVTCCELE                                                 03146000
AVTDELAD EQU   IEDQAVTD+704                                             03147000
AVTDELEM EQU   IEDQAVTD+700                                             03148000
AVTBSX   EQU   AVTCKLNK                                                 03149000
AVTOPETR EQU   AVTHG01                                                  03150000
@NM00030 EQU   AVTCKBYT                                                 03151000
AVTCKONQ EQU   AVTCKBYT                                                 03152000
@NM00029 EQU   AVTCKBYT                                                 03153000
@NM00028 EQU   AVTCKBYT                                                 03154000
@NM00027 EQU   AVTCKBYT                                                 03155000
@NM00026 EQU   AVTCKBYT                                                 03156000
@NM00025 EQU   AVTCKBYT                                                 03157000
@NM00024 EQU   AVTCKBYT                                                 03158000
AVTOPERT EQU   IEDQAVTD+690                                             03159000
AVTOPXCL EQU   IEDQAVTD+688                                             03160000
AVTOPERL EQU   IEDQAVTD+687                                             03161000
@NM00023 EQU   IEDQAVTD+686                                             03162000
AVTCKTIM EQU   IEDQAVTD+684                                             03163000
AVTCKELV EQU   IEDQAVTD+682                                             03164000
AVTCPRCD EQU   IEDQAVTD+681                                             03165000
AVTWARMN EQU   AVTCKELF                                                 03166000
AVTCRTLN EQU   AVTCKELF                                                 03167000
AVTCPIPN EQU   AVTCKELF                                                 03168000
AVTCCLCN EQU   AVTCKELF                                                 03169000
AVTCINCN EQU   AVTCKELF                                                 03170000
@NM00022 EQU   AVTCKELF                                                 03171000
AVTCMCPN EQU   AVTCKELF                                                 03172000
AVTNQBCK EQU   AVTCKELF                                                 03173000
AVTCKQAD EQU   IEDQAVTD+677                                             03174000
AVTSCBSZ EQU   IEDQAVTD+676                                             03175000
@NM00021 EQU   IEDQAVTD+672                                             03176000
AVTCKELE EQU   IEDQAVTD+668                                             03177000
@NM00020 EQU   AVTCKPEL+8                                               03178000
AVTCKRLK EQU   AVTCKPEL+5                                               03179000
AVTCKRPR EQU   AVTCKPEL+4                                               03180000
AVTCKRMQ EQU   AVTCKRMV+1                                               03181000
AVTCKRKY EQU   AVTCKRMV                                                 03182000
AVTHK    EQU   IEDQAVTD+648                                             03183000
AVTHI    EQU   IEDQAVTD+644                                             03184000
AVTIOT   EQU   IEDQAVTD+640                                             03185000
AVTNX    EQU   IEDQAVTD+636                                             03186000
AVTTONE  EQU   IEDQAVTD+632                                             03187000
AVTA3TL  EQU   IEDQAVTD+628                                             03188000
AVTDMECB EQU   IEDQAVTD+624                                             03189000
AVTABEND EQU   IEDQAVTD+618                                             03190000
AVTPLCBN EQU   IEDQAVTD+616                                             03191000
@NM00019 EQU   AVTSAVTP+1                                               03192000
@NM00018 EQU   AVTSAVTF                                                 03193000
AVTSNA   EQU   AVTSAVTF                                                 03194000
AVTONSNA EQU   AVTSAVTF                                                 03195000
AVTVTMCP EQU   AVTSAVTF                                                 03196000
@NM00017 EQU   IEDQAVTD+608                                             03197000
AVTCMBSS EQU   IEDQAVTD+604                                             03198000
AVTRCV   EQU   IEDQAVTD+600                                             03199000
AVTSEND  EQU   IEDQAVTD+596                                             03200000
AVTCSCH  EQU   IEDQAVTD+592                                             03201000
AVTQ1    EQU   IEDQAVTD+588                                             03202000
AVTE7    EQU   IEDQAVTD+584                                             03203000
AVTHB    EQU   IEDQAVTD+580                                             03204000
AVTR1    EQU   IEDQAVTD+576                                             03205000
AVTBZ    EQU   IEDQAVTD+572                                             03206000
AVTEZ    EQU   IEDQAVTD+568                                             03207000
AVTEC    EQU   IEDQAVTD+564                                             03208000
AVTEW    EQU   IEDQAVTD+560                                             03209000
AVTNDIAL EQU   AVTSCOPT                                                 03210000
AVTN2741 EQU   AVTSCOPT                                                 03211000
AVTCONCO EQU   AVTSCOPT                                                 03212000
AVTCONC  EQU   AVTSCOPT                                                 03213000
AVTCMBUF EQU   AVTSCOPT                                                 03214000
AVTAPDMP EQU   AVTSCOPT                                                 03215000
@NM00016 EQU   AVTSCOPT                                                 03216000
AVTHA    EQU   AVTDISP                                                  03217000
AVTEA    EQU   IEDQAVTD+548                                             03218000
AVTAX    EQU   IEDQAVTD+544                                             03219000
AVTA3    EQU   IEDQAVTD+540                                             03220000
AVTGD    EQU   IEDQAVTD+536                                             03221000
AVTAL    EQU   IEDQAVTD+532                                             03222000
AVTOLTST EQU   AVTHG02                                                  03223000
AVTE8    EQU   IEDQAVTD+524                                             03224000
AVTUI    EQU   IEDQAVTD+520                                             03225000
AVTCOMPT EQU   IEDQAVTD+516                                             03226000
AVTCRSRF EQU   IEDQAVTD+512                                             03227000
@NM00015 EQU   IEDQAVTD+508                                             03228000
AVTKA02  EQU   IEDQAVTD+504                                             03229000
AVTOPTPT EQU   IEDQAVTD+500                                             03230000
AVTPCBPT EQU   IEDQAVTD+496                                             03231000
@NM00014 EQU   AVTECB1                                                  03232000
AVTCOMP  EQU   AVTECB1                                                  03233000
@NM00013 EQU   AVTECB1                                                  03234000
AVTOPECA EQU   IEDQAVTD+488                                             03235000
AVTOLECA EQU   IEDQAVTD+484                                             03236000
AVTCKECA EQU   IEDQAVTD+480                                             03237000
AVTCWECA EQU   IEDQAVTD+476                                             03238000
AVTCWTCB EQU   IEDQAVTD+472                                             03239000
AVTOLTCB EQU   IEDQAVTD+468                                             03240000
AVTOCTCB EQU   IEDQAVTD+464                                             03241000
AVTCKTCB EQU   IEDQAVTD+460                                             03242000
AVTAS    EQU   IEDQAVTD+456                                             03243000
AVTNOLBF EQU   IEDQAVTD+454                                             03244000
AVTNCKPR EQU   IEDQAVTD+453                                             03245000
AVTCIB   EQU   IEDQAVTD+452                                             03246000
AVTSPLPT EQU   IEDQAVTD+448                                             03247000
AVTMVBFR EQU   IEDQAVTD+444                                             03248000
AVTSBTA  EQU   IEDQAVTD+440                                             03249000
AVTRARTN EQU   IEDQAVTD+436                                             03250000
AVTBSCAN EQU   IEDQAVTD+432                                             03251000
AVTRDYA  EQU   IEDQAVTD+428                                             03252000
AVTDISTR EQU   IEDQAVTD+420                                             03253000
AVTPARM3 EQU   IEDQAVTD+416                                             03254000
@NM00012 EQU   AVTPKF                                                   03255000
@NM00011 EQU   AVTPKF                                                   03256000
@NM00010 EQU   AVTPKF                                                   03257000
AVTFTCHF EQU   AVTPKF                                                   03258000
@NM00009 EQU   AVTPKF                                                   03259000
@NM00008 EQU   AVTPKF                                                   03260000
@NM00007 EQU   AVTPKF                                                   03261000
@NM00006 EQU   AVTPKF                                                   03262000
AVTPARM  EQU   IEDQAVTD+408                                             03263000
AVTEXS2A EQU   IEDQAVTD+402                                             03264000
AVTEXA2S EQU   IEDQAVTD+396                                             03265000
AVTOCGET EQU   IEDQAVTD+392                                             03266000
AVTCKAVT EQU   @NM00004+1                                               03267000
@NM00005 EQU   AVTCKFLG                                                 03268000
AVTCKHLT EQU   AVTCKFLG                                                 03269000
AVTCKREQ EQU   AVTCKFLG                                                 03270000
AVTCKENV EQU   AVTCKFLG                                                 03271000
AVTCKNAC EQU   AVTCKFLG                                                 03272000
AVTCKTAC EQU   AVTCKFLG                                                 03273000
AVTBUENT EQU   IEDQAVTD+386                                             03274000
@NM00003 EQU   IEDQAVTD+385                                             03275000
AVTFULLT EQU   AVTBUFSW                                                 03276000
AVTUNCON EQU   AVTBUFSW                                                 03277000
@NM00002 EQU   AVTBUFSW                                                 03278000
AVTBUFTR EQU   AVTREADD                                                 03279000
AVTREADY EQU   IEDQAVTD+376                                             03280000
AVTRACE  EQU   IEDQAVTD+372                                             03281000
AVTTCB   EQU   IEDQAVTD+368                                             03282000
AVTPASWD EQU   IEDQAVTD+360                                             03283000
AVTCTLCH EQU   IEDQAVTD+352                                             03284000
AVTDOUBL EQU   IEDQAVTD+344                                             03285000
AVTDOUBX EQU   IEDQAVTD+336                                             03286000
AVTDPARM EQU   IEDQAVTD+332                                             03287000
AVTCSTCS EQU   IEDQAVTD+328                                             03288000
AVTDLQ   EQU   AVTSAVEX+32                                              03289000
@NM00001 EQU   AVTSAVEX                                                 03290000
AVTSAVE4 EQU   IEDQAVTD+216                                             03291000
AVTSAVE3 EQU   IEDQAVTD+144                                             03292000
AVTSAVE2 EQU   IEDQAVTD+72                                              03293000
AVTSAVE1 EQU   IEDQAVTD                                                 03294000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03295000
@RC00500 EQU   @RC00493                                                 03296000
@RF00542 EQU   @RC00515                                                 03297000
@RF00544 EQU   @RC00515                                                 03298000
@RC00547 EQU   @RC00515                                                 03299000
@RC00556 EQU   @RC00515                                                 03300000
@RF00616 EQU   @RC00606                                                 03301000
@RF00736 EQU   @EL00003                                                 03302000
@RF00741 EQU   @EL00003                                                 03303000
@RC00828 EQU   @RC00824                                                 03304000
@RC00826 EQU   @RC00824                                                 03305000
@RC00849 EQU   @RC00845                                                 03306000
@RF00874 EQU   @EL00008                                                 03307000
@RF00549 EQU   @RC00547                                                 03308000
@ENDDATA EQU   *                                                        03309000
         END   IGCV810D,(C'PLS1407',0701,78073)                         03310000
