         TITLE 'IGCVG10D, STOPLINE FOR 3705 LINES                      *00001000
                        '                                               00002000
IGCVG10D CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
         USING *,RBASE                 ESTABLISH A BASE REG             00005000
         LR    RBASE,REG15             SETUP BASE REG                   00006000
IGCVG10D IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO      00007000
*   ROPCAVT=RPARM;                  /* SET THE BASE POINTER FOR THE     00008000
*                                      OP CONTROL AVT                */ 00009000
         LR    ROPCAVT,RPARM                                    03S0200 00010000
*   RSAVE=ADDR(OPCSAVE);            /* SET THE SAVE AREA ADDRESS REG    00011000
*                                      WITH THE ADDRESS OF THE OP       00012000
*                                      CONTROL SAVE AREA             */ 00013000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0201 00014000
*   RAVT=OPCAVTPT;                  /* SET THE BASE POINTER FOR THE     00015000
*                                      TCAM ADDRESS VECTOR TABLE     */ 00016000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0202 00017000
*   ROPCE=OPCCOPCE;                 /* SET THE BASE POINTER FOR THE     00018000
*                                      OPERATOR CONTROL ELEMENT      */ 00019000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0203 00020000
*   RPARM=OCTRMTBL;                 /* SET TO GET TTE ADDR   @YM08560*/ 00021000
         LH    RPARM,OCTRMTBL(,ROPCE)                           03S0204 00022000
         N     RPARM,@CF01335                                   03S0204 00023000
*   CALL IEDQTNT;                   /* GET TTE ADDRESS       @YM08560*/ 00024000
         L     @15,AVTRNMPT(,RAVT)                              03S0205 00025000
         BALR  @14,@15                                          03S0205 00026000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SET UP LINE TTE ADDRESS  03S0206 00027000
*                                                            @YM08560*/ 00028000
         LR    RTRM,RPARM                                       03S0206 00029000
         SL    RTRM,@CF01116                                    03S0206 00030000
*   OPCFLAG1=ZERO;                  /* CLEAR CONTROL SWITCHES        */ 00031000
         MVI   OPCFLAG1(ROPCAVT),X'00'                          03S0207 00032000
*                                                               03S0208 00033000
*   /*****************************************************************/ 00034000
*   /*                                                               */ 00035000
*   /* PROCESS.RENTRY: TO RE-INTIALIZE IF SECOND ENTRY.              */ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                               03S0208 00039000
*   IF OCRENTRD=ON THEN             /* SECOND ENTRY?                 */ 00040000
         TM    OCRENTRD(ROPCE),B'10000000'                      03S0208 00041000
         BNO   @RF00208                                         03S0208 00042000
*     DO;                           /* YES                           */ 00043000
*       RZERO=ADDR(OPCWAITV);       /* INTIALIZE FOR SCAN            */ 00044000
         LA    RZERO,OPCWAITV(,ROPCAVT)                         03S0210 00045000
*       RPARM=OPCWAITV;             /* GET THE FIRST ELEM ON QUE     */ 00046000
         L     RPARM,OPCWAITV(,ROPCAVT)                         03S0211 00047000
*       DO WHILE ROPCE^=RPARM;                                  03S0212 00048000
         B     @DE00212                                         03S0212 00049000
@DL00212 DS    0H                                               03S0213 00050000
*         RZERO=RPARM;              /* LAST OPCE NOT A MATCH         */ 00051000
         LR    RZERO,RPARM                                      03S0213 00052000
*         RPARM=RPARM->OCLINK;      /* GET NEXT TO MATCH             */ 00053000
         L     RPARM,OCLINK(,RPARM)                             03S0214 00054000
*       END;                                                    03S0215 00055000
@DE00212 CR    ROPCE,RPARM                                      03S0215 00056000
         BNE   @DL00212                                         03S0215 00057000
*       RZERO->OCLINK=RPARM->OCLINK;/* DELINK FROM THE CHAIN         */ 00058000
         L     @14,OCLINK(,RPARM)                               03S0216 00059000
         LR    @09,RZERO                                        03S0216 00060000
         ST    @14,OCLINK(,@09)                                 03S0216 00061000
*       OCLINK=''B;                                             03S0217 00062000
         SLR   @14,@14                                          03S0217 00063000
         ST    @14,OCLINK(,ROPCE)                               03S0217 00064000
*       OCRENTRD=OFF;               /* RESET SWITCH                  */ 00065000
         NI    OCRENTRD(ROPCE),B'01111111'                      03S0218 00066000
*     END;                                                      03S0219 00067000
*   ELSE                                                        03S0220 00068000
*     ;                             /* FIRST TIME IN GO AHEAD AND       00069000
*                                      PROCESS                       */ 00070000
@RF00208 DS    0H                                               03S0221 00071000
*   IF ERRFLG=OFF THEN                                          02S0221 00072000
         TM    ERRFLG(ROPCAVT),B'10000000'                      02S0221 00073000
         BNZ   @RF00221                                         02S0221 00074000
*     DO;                           /* IF NO TOTE ERRORS, CONTINUE   */ 00075000
*                                                               03S0223 00076000
*       /*************************************************************/ 00077000
*       /*                                                           */ 00078000
*       /* PROCESS.SRCECHK: IF NOT A CONSOLE OR TOTE REQUEST, CHECK  */ 00079000
*       /* TO SEE IF SOURCE TERMINAL IS ON LINE BEING STOPPED        */ 00080000
*       /*                                                           */ 00081000
*       /*************************************************************/ 00082000
*                                                               03S0223 00083000
*       IF OCCONSOL=OFF&OCTOTE=OFF THEN                         03S0223 00084000
         TM    OCCONSOL(ROPCE),B'11000000'                      03S0223 00085000
         BNZ   @RF00223                                         03S0223 00086000
*         DO;                       /* IF THIS IS NOT A CONSOLE OR      00087000
*                                      TOTE REQUEST CONTINUE VALIDITY   00088000
*                                      CHECK                         */ 00089000
*           RPARM=OCDEST;           /* GET TTCIN OF SOURCE TERMINAL  */ 00090000
         LH    RPARM,OCDEST(,ROPCE)                             03S0225 00091000
         N     RPARM,@CF01335                                   03S0225 00092000
*           IF RPARM^=ZERO THEN                                 03S0226 00093000
         LTR   RPARM,RPARM                                      03S0226 00094000
         BZ    @RF00226                                         03S0226 00095000
*             DO;                   /* IF THIS IS A VALID       03S0227 00096000
*                                      DESTINATION, CONTINUE VALIDITY   00097000
*                                      CHECKING                      */ 00098000
*               CALL IPCHEK;        /* CHECK OUT SOURCE TERMINAL     */ 00099000
         BAL   @14,IPCHEK                                       03S0228 00100000
*               IF ERRFLG=ON THEN                               03S0229 00101000
         TM    ERRFLG(ROPCAVT),B'10000000'                      03S0229 00102000
         BNO   @RF00229                                         03S0229 00103000
*                 DO;               /* IF AN ERROR HAS OCCURRED,        00104000
*                                      PROCESS ERROR                 */ 00105000
*                   RPARM=FOUR;     /* SETUP ERROR RETURN CODE       */ 00106000
         LA    RPARM,4                                          03S0231 00107000
*                   RZERO=MSG13;    /* SETUP MSG ID                  */ 00108000
         LA    RZERO,13                                         03S0232 00109000
*                 END;                                          03S0233 00110000
*             END;                                              03S0234 00111000
@RF00229 DS    0H                                               03S0235 00112000
*         END;                                                  03S0235 00113000
@RF00226 DS    0H                                               03S0236 00114000
*       IF ERRFLG=OFF THEN                                      02S0236 00115000
@RF00223 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0236 00116000
         BNZ   @RF00236                                         02S0236 00117000
*         DO;                       /* IF NO ERRORS ON SOURCE   02S0237 00118000
*                                      TERMINALS, CONTINUE CHECK        00119000
*                                      PRIMARY OP CONTROL TERMINAL   */ 00120000
*                                                               03S0238 00121000
*           /*********************************************************/ 00122000
*           /*                                                       */ 00123000
*           /* PROCESS.PRIMCHK: VERFIFY THAT THE PRIMARY OP CONTROL  */ 00124000
*           /* TERM IS NOT ATTACHED IS NOT ATTACHED TO THE LINE BEING*/ 00125000
*           /* STOPPED                                               */ 00126000
*           /*                                                       */ 00127000
*           /*********************************************************/ 00128000
*                                                               03S0238 00129000
*           RPARM=AVTOPCIN;         /* GET TTCIN OF PRIMARY OP  03S0238 00130000
*                                      CONTROL TERMINAL      @YM06161*/ 00131000
         LH    RPARM,AVTOPCIN(,RAVT)                            03S0238 00132000
         N     RPARM,@CF01335                                   03S0238 00133000
*           IF RPARM^=ZERO THEN                                 03S0239 00134000
         LTR   RPARM,RPARM                                      03S0239 00135000
         BZ    @RF00239                                         03S0239 00136000
*             DO;                   /* IF THERE IS A TTCIN, CONTINUE    00137000
*                                      CHECKING TERMINAL             */ 00138000
*               CALL IPCHEK;        /* CHECK OUT PRIMARY OP CONTROL     00139000
*                                      TERMINAL                      */ 00140000
         BAL   @14,IPCHEK                                       03S0241 00141000
*               IF ERRFLG=ON THEN                               03S0242 00142000
         TM    ERRFLG(ROPCAVT),B'10000000'                      03S0242 00143000
         BNO   @RF00242                                         03S0242 00144000
*                 DO;               /* IF ERROR HAS OCCURRED THEN       00145000
*                                      PROCESS ERROR                 */ 00146000
*                   RPARM=FOUR;     /* SETUP ERROR RETURN CODE       */ 00147000
         LA    RPARM,4                                          03S0244 00148000
*                   RZERO=MSG542;   /* SETUP MSG NUMBER              */ 00149000
         LA    RZERO,542                                        03S0245 00150000
*                 END;                                          03S0246 00151000
*             END;                                              03S0247 00152000
@RF00242 DS    0H                                               03S0248 00153000
*         END;                                                  02S0248 00154000
@RF00239 DS    0H                                               02S0249 00155000
*     END;                                                      02S0249 00156000
@RF00236 DS    0H                                               02S0250 00157000
*   IF ERRFLG=OFF THEN                                          02S0250 00158000
@RF00221 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0250 00159000
         BNZ   @RF00250                                         02S0250 00160000
*     DO;                           /* NO ERRORS OCCURRED    @YM08560*/ 00161000
*                                                               03S0252 00162000
*       /*************************************************************/ 00163000
*       /*                                                           */ 00164000
*       /* PROCESS.TOTECHK: MAKE TOTE CHECKS FOR LINE                */ 00165000
*       /*                                                           */ 00166000
*       /*************************************************************/ 00167000
*                                                               03S0252 00168000
*       IF OCTOTE=OFF THEN          /* IF CMD NOT ISSUED BY TOTE        00169000
*                                                            @ZM46755*/ 00170000
         TM    OCTOTE(ROPCE),B'01000000'                        03S0252 00171000
         BNZ   @RF00252                                         03S0252 00172000
*         DO;                       /* CHECK IF TOTE CONTROLS LINE OR   00173000
*                                      SUBORDINATE RESOURCES @ZM46744*/ 00174000
*           IF OCRLN^=0&TRMSTOTE=ON THEN                        03S0254 00175000
         CLI   OCRLN(ROPCE),0                                   03S0254 00176000
         BE    @RF00254                                         03S0254 00177000
         TM    TRMSTOTE(RTRM),B'00000001'                       03S0254 00178000
         BNO   @RF00254                                         03S0254 00179000
*             DO;                   /* TOTE CONTROL LINE     @YM08560*/ 00180000
*               RPARM=FOUR;         /* SETUP ERROR RETURN CODE       */ 00181000
         LA    RPARM,4                                          03S0256 00182000
*               RZERO=MSG49;        /* SETUP ERROR MSG ID            */ 00183000
         LA    RZERO,49                                         03S0257 00184000
*               IF AVTOLTCB=ZERO THEN                           03S0258 00185000
         L     @14,AVTOLTCB(,RAVT)                              03S0258 00186000
         LTR   @14,@14                                          03S0258 00187000
         BNZ   @RF00258                                         03S0258 00188000
*                 ERRFLG=ON;        /* IF TOTE ISN'T ACTIVE THEN SET    00189000
*                                      ERROR FLAG                    */ 00190000
         OI    ERRFLG(ROPCAVT),B'10000000'                      03S0259 00191000
*             END;                                              03S0260 00192000
*           ELSE                    /* CHECK FOR TOTE OWNED     03S0261 00193000
*                                      SUBORDINATE RESOURCE          */ 00194000
*             DO;                   /* BEFORE CONTINUING THE STOPLINE*/ 00195000
         B     @RC00254                                         03S0261 00196000
@RF00254 DS    0H                                               03S0262 00197000
*               OCPARM=OCTRMTBL;    /* SAVE ORIGINAL TTCIN   @YM08560*/ 00198000
         LH    @14,OCTRMTBL(,ROPCE)                             03S0262 00199000
         N     @14,@CF01335                                     03S0262 00200000
         STH   @14,OCPARM(,ROPCE)                               03S0262 00201000
*               DO UNTIL TRMTYPE=TRMGRP|OCRLN^=ZERO;/* FIND GROUP OF    00202000
*                                      FIRST LINE            @YM08560*/ 00203000
@DL00263 DS    0H                                               03S0264 00204000
*                 RPARM=IGCVG;      /* ID TO RETURN TO AFTER TOTE       00205000
*                                      COMPLETES                     */ 00206000
         L     RPARM,@CF01321                                   03S0264 00207000
*                 CALL CHCKTOTE;    /* VERIFY BEFORE CONTINUING      */ 00208000
         L     @15,OPCTOTCK(,ROPCAVT)                           03S0265 00209000
         BALR  @14,@15                                          03S0265 00210000
*                 IF RZERO=SUSPEND THEN/* TOTE OWNERSHIP?            */ 00211000
         C     RZERO,@CF00061                                   03S0266 00212000
         BNE   @RF00266                                         03S0266 00213000
*                   DO;             /* YES                           */ 00214000
*                     OCRENTRD=ON;  /* SET RENTRY FLAG               */ 00215000
         OI    OCRENTRD(ROPCE),B'10000000'                      03S0268 00216000
*                     OCLINK=OPCWAITV;/* LINK TOP ELEM TO OPCE       */ 00217000
         L     @14,OPCWAITV(,ROPCAVT)                           03S0269 00218000
         ST    @14,OCLINK(,ROPCE)                               03S0269 00219000
*                     OPCWAITV=ROPCE;/* PUT OPCE ON WAIT CHAIN       */ 00220000
         ST    ROPCE,OPCWAITV(,ROPCAVT)                         03S0270 00221000
*                     OPCMODID=IGC00;/* GIVE CONTROL TO 00           */ 00222000
         MVC   OPCMODID(2,ROPCAVT),@CC01323                     03S0271 00223000
*                   END;                                        03S0272 00224000
*                 ELSE                                          03S0273 00225000
*                   ;               /* NO TOTE OWNERSHIP CONTINUE    */ 00226000
@RF00266 DS    0H                                               03S0274 00227000
*                 RPARM=TRMCOHTG;   /* GET COHORTG           @YM08560*/ 00228000
         LH    @14,TRMCOHTG(,RTRM)                              03S0274 00229000
         N     @14,@CF01335                                     03S0274 00230000
         LR    RPARM,@14                                        03S0274 00231000
*                 OCTRMTBL=TRMCOHTG;/* SET OCTRMTBL          @YM08560*/ 00232000
         STH   @14,OCTRMTBL(,ROPCE)                             03S0275 00233000
*                 CALL IEDQTNT;     /* GET TTE ADDRESS       @YM08560*/ 00234000
         L     @15,AVTRNMPT(,RAVT)                              03S0276 00235000
         BALR  @14,@15                                          03S0276 00236000
*                 RTRM=RPARM-LENGTH(IEDNTRM);/* SET UP TERM     03S0277 00237000
*                                      ADDRESSIBILTY         @YM08560*/ 00238000
         LR    RTRM,RPARM                                       03S0277 00239000
         SL    RTRM,@CF01116                                    03S0277 00240000
*               END;                                            03S0278 00241000
@DE00263 CLI   TRMTYPE(RTRM),X'00'                              03S0278 00242000
         BE    @DC00263                                         03S0278 00243000
         CLI   OCRLN(ROPCE),0                                   03S0278 00244000
         BE    @DL00263                                         03S0278 00245000
@DC00263 DS    0H                                               03S0279 00246000
*               OCTRMTBL=OCPARM;    /* RESTORE OCTRMTBL      @YM08560*/ 00247000
         LH    @14,OCPARM(,ROPCE)                               03S0279 00248000
         STH   @14,OCTRMTBL(,ROPCE)                             03S0279 00249000
*               OCPARM=ZERO;        /* CLEAR OCPARM          @YM08560*/ 00250000
         SLR   @14,@14                                          03S0280 00251000
         STH   @14,OCPARM(,ROPCE)                               03S0280 00252000
*               RZERO=''B;          /* CLEAR REG 0 FOR IGC0010D 03S0281 00253000
*                                                            @YM08560*/ 00254000
         SLR   RZERO,RZERO                                      03S0281 00255000
*             END;                                              03S0282 00256000
*         END;                      /*                       @ZM46755*/ 00257000
*       ELSE                                                    03S0284 00258000
*         ;                         /*                       @ZM46755*/ 00259000
@RF00252 DS    0H                                               03S0285 00260000
*     END;                          /*                       @YM08560*/ 00261000
@RC00252 DS    0H                                               02S0286 00262000
*   IF ERRFLG=ON THEN                                           02S0286 00263000
@RF00250 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0286 00264000
         BNO   @RF00286                                         02S0286 00265000
*     DO;                           /* IF ANY ERRORS HAVE OCCURRED,     00266000
*                                      DO ERROR PROCESSING           */ 00267000
*                                                               03S0288 00268000
*       /*************************************************************/ 00269000
*       /*                                                           */ 00270000
*       /* PROCESS.ERRPROC: THIS SEGMENT PERFORMS FINAL ERROR        */ 00271000
*       /* PROCESSING                                                */ 00272000
*       /*                                                           */ 00273000
*       /*************************************************************/ 00274000
*                                                               03S0288 00275000
*       EXITFLG=ON;                 /* INDICATE EXIT                 */ 00276000
         OI    EXITFLG(ROPCAVT),B'01000000'                     03S0288 00277000
*       IF OCTOTE=ON THEN                                       03S0289 00278000
         TM    OCTOTE(ROPCE),B'01000000'                        03S0289 00279000
         BNO   @RF00289                                         03S0289 00280000
*         DO;                       /* IF THIS IS A TOTE REQUEST,    */ 00281000
*           RZERO=RPARM;            /* SETUP ERR RETURN CODE         */ 00282000
         LR    RZERO,RPARM                                      03S0291 00283000
*           OPCMODID=MOD07;         /* SETUP EXIT MODULE             */ 00284000
         MVC   OPCMODID(2,ROPCAVT),MOD07                        03S0292 00285000
*         END;                                                  03S0293 00286000
*       ELSE                                                    03S0294 00287000
*         DO;                       /* IF NOT TOTE REQUEST           */ 00288000
         B     @RC00289                                         03S0294 00289000
@RF00289 DS    0H                                               03S0295 00290000
*           OCUNIT=INVALTIC;        /* INDICATE INVALID TIC          */ 00291000
         MVC   OCUNIT(4,ROPCE),@CF01308                         03S0295 00292000
*           OPCMODID=MOD03;         /* SETUP EXIT MODULE             */ 00293000
         MVC   OPCMODID(2,ROPCAVT),MOD03                        03S0296 00294000
*         END;                                                  03S0297 00295000
*     END;                                                      02S0298 00296000
@RC00289 DS    0H                                               02S0299 00297000
*   IF EXITFLG=OFF THEN                                         02S0299 00298000
@RF00286 TM    EXITFLG(ROPCAVT),B'01000000'                     02S0299 00299000
         BNZ   @RF00299                                         02S0299 00300000
*     DO;                           /* MORE PROCESSING LEFT?         */ 00301000
*                                                               03S0301 00302000
*       /*************************************************************/ 00303000
*       /*                                                           */ 00304000
*       /* PROCESS.EXITPROC: THIS SEGMENT PERFORMS FINAL PROCESSING  */ 00305000
*       /*                                                           */ 00306000
*       /*************************************************************/ 00307000
*                                                               03S0301 00308000
*       OPCMODID=MODV8;             /* SETUP EXIT MODULE             */ 00309000
         MVC   OPCMODID(2,ROPCAVT),MODV8                        03S0301 00310000
*       OCPARM=ZERO;                /* RESET RETURN CODE             */ 00311000
         SLR   @14,@14                                          03S0302 00312000
         STH   @14,OCPARM(,ROPCE)                               03S0302 00313000
*       OCRESP=OFF;                 /* SETUP REST OF INTERFACE TO       00314000
*                                      IGCV810D                      */ 00315000
         NI    OCRESP(ROPCE),B'11111110'                        03S0303 00316000
*       OCALSTAT=ZERO;                                          03S0304 00317000
         MVI   OCALSTAT(ROPCE),X'00'                            03S0304 00318000
*       IF OCRLN=ZERO THEN                                      03S0305 00319000
         CLI   OCRLN(ROPCE),0                                   03S0305 00320000
         BNE   @RF00305                                         03S0305 00321000
*         OCALLFLG=ON;              /* IF THIS IS A STOPLINE,ALL        00322000
*                                      REQUEST THEN INDICATE IN OPCE */ 00323000
         OI    OCALLFLG(ROPCE),B'00000100'                      03S0306 00324000
*     END;                                                      02S0307 00325000
@RF00305 DS    0H                                               02S0308 00326000
*                                                               02S0308 00327000
*   /*****************************************************************/ 00328000
*   /*                                                               */ 00329000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00330000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT. THE XCTL ASSEMBLER */ 00331000
*   /* MACRO INSTRUCTION IS USED BY THIS SEGMENT TO TRANSFER CONTROL */ 00332000
*   /* TO THE NEXT MODULE THAT IS TO BE EXECUTED.                    */ 00333000
*   /*                                                               */ 00334000
*   /*****************************************************************/ 00335000
*                                                               02S0308 00336000
*   OPCFLAG1=ZERO;                  /* CLEAR FLAG FIELD              */ 00337000
@RF00299 MVI   OPCFLAG1(ROPCAVT),X'00'                          02S0308 00338000
*   RPARM=ROPCAVT;                  /* SET THE ARGUMENT REGISTER IN     00339000
*                                      PREPARATION TO TRANSFERRING      00340000
*                                      CONTROL TO THE NEXT MODULE    */ 00341000
         LR    RPARM,ROPCAVT                                    02S0309 00342000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0310 00343000
*                                   /*                                  00344000
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO           00345000
*                                                               02S0311 00346000
*   /*****************************************************************/ 00347000
*   /*                                                               */ 00348000
*   /* IPCHEK: THIS INTERNAL PROCEDURE ASSURES THAT THE SOURCE       */ 00349000
*   /* TERMINAL AND THE PRIMARY OP CONTROL TERMINAL ARE NOT ON THE   */ 00350000
*   /* SAME LINE AS THE LINE TO BE STOPPED.                          */ 00351000
*   /*                                                               */ 00352000
*   /*****************************************************************/ 00353000
*                                                               02S0311 00354000
*IPCHEK:                                                        02S0311 00355000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0311 00356000
IPCHEK   DS    0H                                               02S0312 00357000
*   RFY                                                         02S0312 00358000
*    (RQCB,                                                     02S0312 00359000
*     REG14) RSTD;                                              02S0312 00360000
*   OPCWRKSP(1)=REG14;              /* SAVE RETURN REG               */ 00361000
         ST    REG14,OPCWRKSP(,ROPCAVT)                         02S0313 00362000
*   CALL IEDQTNT;                   /* FIND TTE ADDRESS              */ 00363000
         L     @15,AVTRNMPT(,RAVT)                              02S0314 00364000
         BALR  @14,@15                                          02S0314 00365000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SETUP TERM BASE               */ 00366000
         LR    RTRM,RPARM                                       02S0315 00367000
         SL    RTRM,@CF01116                                    02S0315 00368000
*   IF TRMPREF=ON THEN                                          02S0316 00369000
         TM    TRMPREF(RTRM),B'00010000'                        02S0316 00370000
         BNO   @RF00316                                         02S0316 00371000
*     DO;                           /* IF THIS IS A 3705 RESOURCE,      00372000
*                                      CONTINUE CHECKING             */ 00373000
*       DO UNTIL(RZERO=ZERO|TRMLINE=ON);/* IF RESOURCE IN HIERARCHY     00374000
*                                      FIND LINE ASSOCIATED WITH IT  */ 00375000
@DL00318 DS    0H                                               02S0319 00376000
*         CALL COHORTLK;            /* FIND NXT HIGHER RESOURCE      */ 00377000
         L     @15,OPCHORT(,ROPCAVT)                            02S0319 00378000
         BALR  @14,@15                                          02S0319 00379000
*         RTRM=RPARM-LENGTH(IEDNTRM);/* SETUP TERM BASE              */ 00380000
         LR    RTRM,RPARM                                       02S0320 00381000
         SL    RTRM,@CF01116                                    02S0320 00382000
*       END;                                                    02S0321 00383000
@DE00318 LTR   RZERO,RZERO                                      02S0321 00384000
         BZ    @DC00318                                         02S0321 00385000
         TM    TRMLINE(RTRM),B'10000000'                        02S0321 00386000
         BNO   @DL00318                                         02S0321 00387000
@DC00318 DS    0H                                               02S0322 00388000
*       IF RZERO^=ZERO THEN                                     02S0322 00389000
         LTR   RZERO,RZERO                                      02S0322 00390000
         BZ    @RF00322                                         02S0322 00391000
*         DO;                       /* IF RESOURCE IS IN THE    02S0323 00392000
*                                      HIERARCHY THEN CHECK IT       */ 00393000
*           RQCB=TRMDESTQ;          /* GET QCB ADDRESS OF SOURCE     */ 00394000
         SLR   RQCB,RQCB                                        02S0324 00395000
         ICM   RQCB,7,TRMDESTQ(RTRM)                            02S0324 00396000
*           IF QCBLGBAD=LGBADDR THEN                            02S0325 00397000
         CLC   QCBLGBAD(3,RQCB),LGBADDR+40(ROPCE)               02S0325 00398000
         BNE   @RF00325                                         02S0325 00399000
*             DO;                   /* IF GROUP OF INPUT TTCIN IS       00400000
*                                      SAME AS GROUP BEING STOPPED      00401000
*                                      THEN CHECK RLN                */ 00402000
*               IF OCRLN=ZERO|OCRLN=QCBRELLN THEN               02S0327 00403000
         CLI   OCRLN(ROPCE),0                                   02S0327 00404000
         BE    @RT00327                                         02S0327 00405000
         CLC   OCRLN(1,ROPCE),QCBRELLN(RQCB)                    02S0327 00406000
         BNE   @RF00327                                         02S0327 00407000
@RT00327 DS    0H                                               02S0328 00408000
*                 ERRFLG=ON;        /* CHECK FOR RLN OF 'ALL' OR FOR    00409000
*                                      SAME RLN                      */ 00410000
         OI    ERRFLG(ROPCAVT),B'10000000'                      02S0328 00411000
*             END;                                              02S0329 00412000
*         END;                                                  02S0330 00413000
*     END;                                                      02S0331 00414000
*   ELSE                                                        02S0332 00415000
*     ;                                                         02S0332 00416000
@RF00316 DS    0H                                               02S0333 00417000
*   RPARM=OCTRMTBL;                 /* SET TO GET TTE ADDR   @OY19593*/ 00418000
@RC00316 LH    RPARM,OCTRMTBL(,ROPCE)                           02S0333 00419000
         N     RPARM,@CF01335                                   02S0333 00420000
*   CALL IEDQTNT;                   /* GET TTE ADDRESS       @OY19593*/ 00421000
         L     @15,AVTRNMPT(,RAVT)                              02S0334 00422000
         BALR  @14,@15                                          02S0334 00423000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SET UP LINE TTE ADDRESS  02S0335 00424000
*                                                            @OY19593*/ 00425000
         LR    RTRM,RPARM                                       02S0335 00426000
         SL    RTRM,@CF01116                                    02S0335 00427000
*   REG14=OPCWRKSP(1);              /* RESTORE RETURN ADDRESS        */ 00428000
         L     REG14,OPCWRKSP(,ROPCAVT)                         02S0336 00429000
*   RFY                                                         02S0337 00430000
*    (RQCB,                                                     02S0337 00431000
*     REG14) UNRSTD;                                            02S0337 00432000
*   END;                                                        02S0338 00433000
@EL00002 DS    0H                                               02S0338 00434000
@EF00002 DS    0H                                               02S0338 00435000
@ER00002 BR    @14                                              02S0338 00436000
*   END IGCVG10D                                                01S0339 00437000
*                                                               01S0339 00438000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00439000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00440000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00441000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00442000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 00443000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00444000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 00445000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 00446000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 00447000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 00448000
*/*%INCLUDE SYSUT5  (RENTRY  )                                       */ 00449000
*/*%INCLUDE SYSUT5  (SRCECHK )                                       */ 00450000
*/*%INCLUDE SYSUT5  (PRIMCHK )                                       */ 00451000
*/*%INCLUDE SYSUT5  (TOTECHK )                                       */ 00452000
*/*%INCLUDE SYSUT5  (ERRPROC )                                       */ 00453000
*/*%INCLUDE SYSUT5  (EXITPROC)                                       */ 00454000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 00455000
*/*%INCLUDE SYSUT5  (IPCHEK  )                                       */ 00456000
*                                                               01S0339 00457000
*       ;                                                       01S0339 00458000
@DATA    DS    0H                                                       00459000
         DS    0F                                                       00460000
         DS    0F                                                       00461000
@CF00061 DC    F'1'                                                     00462000
@CF01116 DC    F'14'                                                    00463000
@CF01308 DC    XL4'08000002'                                            00464000
@CF01335 DC    XL4'0000FFFF'                                            00465000
@CF01321 DC    XL2'0'                                                   00466000
         DC    C'VG'                                                    00467000
         DS    0D                                                       00468000
@CC01323 DC    C'00'                                                    00469000
MOD03    DC    CL2'03'                                                  00470000
MOD07    DC    CL2'07'                                                  00471000
MODV8    DC    CL2'V8'                                                  00472000
ZAPAREA  DC    XL104'0'                                                 00473000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00474000
@01      EQU   01                                                       00475000
@02      EQU   02                                                       00476000
@03      EQU   03                                                       00477000
@04      EQU   04                                                       00478000
@05      EQU   05                                                       00479000
@06      EQU   06                                                       00480000
@07      EQU   07                                                       00481000
@08      EQU   08                                                       00482000
@09      EQU   09                                                       00483000
@10      EQU   10                                                       00484000
@11      EQU   11                                                       00485000
@12      EQU   12                                                       00486000
@13      EQU   13                                                       00487000
@14      EQU   14                                                       00488000
@15      EQU   15                                                       00489000
ROPCE    EQU   @03                                                      00490000
ROPCAVT  EQU   @02                                                      00491000
RTRM     EQU   @08                                                      00492000
RAVT     EQU   @04                                                      00493000
RQCB     EQU   @06                                                      00494000
RZERO    EQU   @00                                                      00495000
RPARM    EQU   @01                                                      00496000
RBASE    EQU   @12                                                      00497000
RSAVE    EQU   @13                                                      00498000
REG14    EQU   @14                                                      00499000
REG15    EQU   @15                                                      00500000
IEDQAVTD EQU   0                                                        00501000
AVTSAVEX EQU   IEDQAVTD+288                                             00502000
AVTREADD EQU   IEDQAVTD+380                                             00503000
AVTBUFSW EQU   IEDQAVTD+384                                             00504000
@NM00004 EQU   IEDQAVTD+388                                             00505000
AVTCKFLG EQU   @NM00004                                                 00506000
AVTBASE  EQU   IEDQAVTD+412                                             00507000
AVTPKF   EQU   AVTBASE                                                  00508000
AVTRNMPT EQU   IEDQAVTD+424                                             00509000
AVTOLTCB EQU   IEDQAVTD+468                                             00510000
AVTOSECB EQU   IEDQAVTD+492                                             00511000
AVTECB1  EQU   AVTOSECB                                                 00512000
AVTHG02  EQU   IEDQAVTD+528                                             00513000
AVTDISP  EQU   IEDQAVTD+552                                             00514000
AVTHD    EQU   IEDQAVTD+556                                             00515000
AVTSCOPT EQU   AVTHD                                                    00516000
AVTSAVTP EQU   IEDQAVTD+612                                             00517000
AVTSAVTF EQU   AVTSAVTP                                                 00518000
AVTCKPEL EQU   IEDQAVTD+652                                             00519000
AVTCKRMV EQU   AVTCKPEL                                                 00520000
AVTCKELF EQU   IEDQAVTD+680                                             00521000
AVTCKBYT EQU   IEDQAVTD+691                                             00522000
AVTHG01  EQU   IEDQAVTD+692                                             00523000
AVTCKLNK EQU   IEDQAVTD+696                                             00524000
AVTCRELE EQU   IEDQAVTD+708                                             00525000
AVTCCELE EQU   AVTCRELE                                                 00526000
AVTCLRHI EQU   IEDQAVTD+716                                             00527000
AVTADBUF EQU   IEDQAVTD+720                                             00528000
AVTSYSER EQU   IEDQAVTD+728                                             00529000
AVTBFRFG EQU   IEDQAVTD+784                                             00530000
AVTCKPQB EQU   IEDQAVTD+804                                             00531000
AVTCKPTB EQU   AVTCKPQB                                                 00532000
AVTCKPEC EQU   AVTCKPQB+4                                               00533000
AVTCKPCC EQU   AVTCKPEC                                                 00534000
AVTOPCQB EQU   IEDQAVTD+816                                             00535000
AVTOPCOB EQU   AVTOPCQB                                                 00536000
AVTOPCEC EQU   AVTOPCQB+4                                               00537000
AVTOPCCC EQU   AVTOPCEC                                                 00538000
AVTOLTQB EQU   IEDQAVTD+828                                             00539000
AVTCWFL1 EQU   IEDQAVTD+924                                             00540000
AVTCWFL2 EQU   IEDQAVTD+925                                             00541000
AVTSUBT  EQU   IEDQAVTD+948                                             00542000
AVTIOTR  EQU   IEDQAVTD+949                                             00543000
AVTBIT1  EQU   IEDQAVTD+1050                                            00544000
AVTBIT2  EQU   IEDQAVTD+1051                                            00545000
AVTBIT3  EQU   IEDQAVTD+1052                                            00546000
AVTOPCIN EQU   IEDQAVTD+1074                                            00547000
AVTBIT4  EQU   IEDQAVTD+1136                                            00548000
@NM00086 EQU   IEDQAVTD+1232                                            00549000
IEDQAPTR EQU   0                                                        00550000
IEDNSVTD EQU   0                                                        00551000
SAVTDIAG EQU   IEDNSVTD                                                 00552000
SAVTDIAF EQU   SAVTDIAG                                                 00553000
SAVTLUSQ EQU   IEDNSVTD+88                                              00554000
SAVTTCPU EQU   IEDNSVTD+238                                             00555000
SAVTZELM EQU   IEDNSVTD+270                                             00556000
SAVTRDRV EQU   IEDNSVTD+284                                             00557000
SAVTCKQB EQU   IEDNSVTD+300                                             00558000
SAVTCKTB EQU   SAVTCKQB                                                 00559000
SAVTCKEC EQU   SAVTCKQB+4                                               00560000
SAVTCKCC EQU   SAVTCKEC                                                 00561000
IEDQOPCE EQU   0                                                        00562000
OCLINK   EQU   IEDQOPCE                                                 00563000
OCELEM   EQU   IEDQOPCE+4                                               00564000
OCUNIT   EQU   IEDQOPCE+8                                               00565000
OCRUDEST EQU   OCUNIT                                                   00566000
OCCKPKEY EQU   OCRUDEST                                                 00567000
OCSCAN   EQU   OCCKPKEY                                                 00568000
OCOPTCDE EQU   IEDQOPCE+12                                              00569000
OCSWITCH EQU   IEDQOPCE+13                                              00570000
OCFLAG   EQU   IEDQOPCE+14                                              00571000
OCCONSOL EQU   OCFLAG                                                   00572000
OCTOTE   EQU   OCFLAG                                                   00573000
OCRESP   EQU   OCFLAG                                                   00574000
OCRLN    EQU   IEDQOPCE+15                                              00575000
@NM00109 EQU   IEDQOPCE+16                                              00576000
OCDEST   EQU   @NM00109                                                 00577000
OCREQVAL EQU   OCDEST+1                                                 00578000
OCTRMTBL EQU   IEDQOPCE+20                                              00579000
OCLINENO EQU   IEDQOPCE+22                                              00580000
OCTIOT   EQU   OCLINENO                                                 00581000
OCTRUNIT EQU   IEDQOPCE+24                                              00582000
OCRSID   EQU   OCTRUNIT                                                 00583000
OCALSTAT EQU   OCRSID                                                   00584000
OCRENTRD EQU   OCALSTAT                                                 00585000
OCALLFLG EQU   OCALSTAT                                                 00586000
OCPARM   EQU   IEDQOPCE+28                                              00587000
OCBACKUP EQU   IEDQOPCE+32                                              00588000
OCMODNME EQU   IEDQOPCE+40                                              00589000
OCIPLWA  EQU   OCMODNME                                                 00590000
OCCKDATA EQU   IEDQOPCE+48                                              00591000
OCRSTGTM EQU   OCCKDATA                                                 00592000
IEDQOPCN EQU   0                                                        00593000
OCLDNME  EQU   IEDQOPCN                                                 00594000
OCLINTTE EQU   OCLDNME                                                  00595000
OCREQFLG EQU   OCLINTTE+2                                               00596000
OCPREFLG EQU   OCLINTTE+3                                               00597000
IEDQOPCD EQU   0                                                        00598000
OPCAVTPT EQU   IEDQOPCD+8                                               00599000
OPCCOPCE EQU   IEDQOPCD+12                                              00600000
OPCSAVE  EQU   IEDQOPCD+56                                              00601000
OPCFLAG1 EQU   IEDQOPCD+146                                             00602000
OPCAQCTL EQU   IEDQOPCD+180                                             00603000
OPCXCTL  EQU   IEDQOPCD+204                                             00604000
OPCLDNME EQU   IEDQOPCD+212                                             00605000
OPCMODID EQU   OPCLDNME+3                                               00606000
OPCHORT  EQU   IEDQOPCD+256                                             00607000
OPCSPEC  EQU   IEDQOPCD+300                                             00608000
OPCWRKSP EQU   IEDQOPCD+320                                             00609000
OPCTOTCK EQU   IEDQOPCD+360                                             00610000
OPCWAITV EQU   IEDQOPCD+364                                             00611000
OPCPWCOB EQU   IEDQOPCD+368                                             00612000
OPCPWQCB EQU   OPCPWCOB                                                 00613000
OPCPWECB EQU   OPCPWCOB+4                                               00614000
IEDQQCB  EQU   0                                                        00615000
QCBDSFLG EQU   IEDQQCB                                                  00616000
QCBDISK  EQU   QCBDSFLG                                                 00617000
QCBELCHN EQU   IEDQQCB+1                                                00618000
QCBEOLDT EQU   IEDQQCB+16                                               00619000
QCBBYTE1 EQU   QCBEOLDT+1                                               00620000
QCBLKRLN EQU   IEDQQCB+18                                               00621000
QCBRETCT EQU   QCBLKRLN                                                 00622000
QCBSTAT  EQU   IEDQQCB+19                                               00623000
QCBINSRC EQU   IEDQQCB+21                                               00624000
@NM00138 EQU   QCBINSRC                                                 00625000
QCBTSOF2 EQU   @NM00138+1                                               00626000
QCBTSOF1 EQU   @NM00138+2                                               00627000
QCBINTVL EQU   IEDQQCB+24                                               00628000
QCBPREN  EQU   IEDQQCB+28                                               00629000
QCBLKRRN EQU   QCBPREN+1                                                00630000
QCBRELLN EQU   IEDQQCB+32                                               00631000
QCBDCBAD EQU   IEDQQCB+33                                               00632000
QCBLGBAD EQU   QCBDCBAD                                                 00633000
QCBFLAG  EQU   IEDQQCB+36                                               00634000
IEDQQPTR EQU   0                                                        00635000
IEDQPQCB EQU   0                                                        00636000
QCBFHDLZ EQU   IEDQPQCB+3                                               00637000
QCBPFEFO EQU   QCBFHDLZ+1                                               00638000
QCBFHDTZ EQU   IEDQPQCB+6                                               00639000
QCBINTLF EQU   IEDQPQCB+12                                              00640000
IEDNQCB  EQU   0                                                        00641000
QCBSTAT1 EQU   IEDNQCB+4                                                00642000
QCBPLCBA EQU   IEDNQCB+5                                                00643000
IEDTRM   EQU   0                                                        00644000
IEDNTRM  EQU   IEDTRM                                                   00645000
TRMBYTE4 EQU   IEDNTRM                                                  00646000
TRMBYTE3 EQU   IEDNTRM+1                                                00647000
TRMBYTE2 EQU   IEDNTRM+2                                                00648000
TRMINPG  EQU   TRMBYTE2                                                 00649000
TRMBYTE1 EQU   IEDNTRM+3                                                00650000
TRMSCPRQ EQU   TRMBYTE1                                                 00651000
TRMSTOTE EQU   TRMBYTE1                                                 00652000
TRMBYTE0 EQU   IEDNTRM+6                                                00653000
TRMSIBPT EQU   IEDNTRM+7                                                00654000
TRMCOHTG EQU   TRMSIBPT+1                                               00655000
TRMTYPE  EQU   IEDNTRM+11                                               00656000
IEDQTRM  EQU   IEDTRM+14                                                00657000
TRMSTATE EQU   IEDQTRM                                                  00658000
TRMLINE  EQU   TRMSTATE                                                 00659000
TRMLOG   EQU   TRMSTATE                                                 00660000
TRMPREF  EQU   TRMSTATE                                                 00661000
TRMDESTQ EQU   IEDQTRM+1                                                00662000
TRMINSEQ EQU   IEDQTRM+4                                                00663000
TLISTCNT EQU   TRMINSEQ                                                 00664000
TRMOUTSQ EQU   IEDQTRM+6                                                00665000
TLISTEN  EQU   TRMOUTSQ                                                 00666000
TRMDSORG EQU   TLISTEN                                                  00667000
TRMALTD  EQU   IEDQTRM+8                                                00668000
TRMDEVFL EQU   IEDQTRM+10                                               00669000
TRMSTAT  EQU   IEDQTRM+12                                               00670000
LGBLINE  EQU   0                                                        00671000
LGBADDR  EQU   LGBLINE+5                                                00672000
IEDQTNT  EQU   0                                                        00673000
COHORTLK EQU   0                                                        00674000
CHCKTOTE EQU   0                                                        00675000
QCBLDCB  EQU   0                                                        00676000
OCCKPKY1 EQU   OCCKPKEY                                                 00677000
OCCKPTYP EQU   OCCKPKY1                                                 00678000
OCICACTN EQU   OCMODNME                                                 00679000
OCICDADR EQU   OCICACTN                                                 00680000
OCICSW   EQU   OCICDADR+3                                               00681000
OPCAQWD  EQU   OPCAQCTL                                                 00682000
OPCAQWD1 EQU   OPCAQWD                                                  00683000
OPCAQWD2 EQU   OPCAQWD+4                                                00684000
OPCAQWD3 EQU   OPCAQWD+8                                                00685000
TRMPRE1  EQU   TRMBYTE4                                                 00686000
TRMNCP1  EQU   TRMBYTE4                                                 00687000
TRMPRE   EQU   TRMBYTE3                                                 00688000
TRMNCP   EQU   TRMBYTE3                                                 00689000
TRMPU    EQU   TRMBYTE3                                                 00690000
TRMLU    EQU   TRMBYTE3                                                 00691000
TRMLINK  EQU   TRMBYTE3                                                 00692000
FLAGS    EQU   OPCFLAG1                                                 00693000
ERRFLG   EQU   FLAGS                                                    00694000
EXITFLG  EQU   FLAGS                                                    00695000
OCCIB    EQU   OCREQVAL                                                 00696000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00697000
@NM00148 EQU   TRMLINK                                                  00698000
TRMLSTAT EQU   TRMLINK                                                  00699000
TRMLINT  EQU   TRMLINK                                                  00700000
TRMEPMOD EQU   TRMLINK                                                  00701000
TRMLULOG EQU   TRMLU                                                    00702000
TRMINERR EQU   TRMLU                                                    00703000
TRMLUREQ EQU   TRMLU                                                    00704000
TRMSESRQ EQU   TRMLU                                                    00705000
TRMTDIFF EQU   TRMLU                                                    00706000
TRMLUTM  EQU   TRMLU                                                    00707000
TRMLUIT  EQU   TRMLU                                                    00708000
TRMAUTO  EQU   TRMLU                                                    00709000
TRMPCONT EQU   TRMPU                                                    00710000
@NM00147 EQU   TRMPU                                                    00711000
TRMNCONT EQU   TRMNCP                                                   00712000
TRMQUCKN EQU   TRMNCP                                                   00713000
TRMSLOWN EQU   TRMNCP                                                   00714000
TRMSYGEN EQU   TRMNCP                                                   00715000
TRMNCPCL EQU   TRMNCP                                                   00716000
TRMIPLDM EQU   TRMNCP                                                   00717000
TRMINOUT EQU   TRMPRE                                                   00718000
TRMRDOUT EQU   TRMPRE                                                   00719000
TRMNLOUT EQU   TRMPRE                                                   00720000
TRMWROUT EQU   TRMPRE                                                   00721000
TRMASNXI EQU   TRMPRE                                                   00722000
TRMSTMM  EQU   TRMPRE                                                   00723000
TRMCMODE EQU   TRMPRE                                                   00724000
TRMSTPND EQU   TRMPRE                                                   00725000
@NM00146 EQU   TRMNCP1                                                  00726000
TRMINOP  EQU   TRMNCP1                                                  00727000
TRMLYNCH EQU   TRMPRE1                                                  00728000
TRMSPOUT EQU   TRMPRE1                                                  00729000
TRMERLCK EQU   TRMPRE1                                                  00730000
TRMQNPL  EQU   TRMPRE1                                                  00731000
TRMSPACT EQU   TRMPRE1                                                  00732000
TRMOCNI  EQU   TRMPRE1                                                  00733000
TRMSESSN EQU   TRMPRE1                                                  00734000
TRMCONT  EQU   TRMPRE1                                                  00735000
OPCAQLST EQU   OPCAQWD3+1                                               00736000
OPCAQRQ3 EQU   OPCAQWD3                                                 00737000
OPCAQSEC EQU   OPCAQWD2+1                                               00738000
OPCAQRQ2 EQU   OPCAQWD2                                                 00739000
OPCAQFST EQU   OPCAQWD1+1                                               00740000
OPCAQREQ EQU   OPCAQWD1                                                 00741000
OCICINAC EQU   OCICSW                                                   00742000
@NM00115 EQU   OCICSW                                                   00743000
OCICATST EQU   OCICDADR+1                                               00744000
OCICTYPE EQU   OCICDADR                                                 00745000
@NM00114 EQU   OCCKPKY1                                                 00746000
OCCKPENV EQU   OCCKPKY1                                                 00747000
OCCKPRST EQU   OCCKPTYP                                                 00748000
OCCKPNCP EQU   OCCKPTYP                                                 00749000
OCCKPINC EQU   OCCKPTYP                                                 00750000
@NM00149 EQU   LGBLINE+4                                                00751000
LINEADDR EQU   LGBLINE                                                  00752000
TRMOPT   EQU   IEDTRM+34                                                00753000
TRMOPTBL EQU   IEDQTRM+18                                               00754000
TRMOPNO  EQU   IEDQTRM+17                                               00755000
TRMCHCIN EQU   IEDQTRM+16                                               00756000
TRMSENSE EQU   TRMSTAT+3                                                00757000
TRMTEMPR EQU   TRMSTAT+2                                                00758000
TRMSIO   EQU   TRMSTAT                                                  00759000
@NM00145 EQU   TRMDEVFL+1                                               00760000
TRMTPIN  EQU   TRMDEVFL+1                                               00761000
TRMNCPI  EQU   TRMDEVFL+1                                               00762000
TRMRNTRM EQU   TRMDEVFL+1                                               00763000
@NM00144 EQU   TRMDEVFL+1                                               00764000
TRMLMD   EQU   TRMDEVFL+1                                               00765000
TRMCONC  EQU   TRMDEVFL+1                                               00766000
TRMTSOB  EQU   TRMDEVFL                                                 00767000
TRMBFDY  EQU   TRMDEVFL                                                 00768000
TRMTBLK  EQU   TRMDEVFL                                                 00769000
TRMSBLK  EQU   TRMDEVFL                                                 00770000
TRMBLKS  EQU   TRMDEVFL                                                 00771000
TRMADDC  EQU   TRMDEVFL                                                 00772000
TRMDDIG  EQU   TRMDEVFL                                                 00773000
TRMBUFS  EQU   TRMDEVFL                                                 00774000
TRMPRILK EQU   TRMALTD                                                  00775000
TRMLGB   EQU   TRMDSORG                                                 00776000
TRMUTERM EQU   TLISTCNT                                                 00777000
TRMSCNYN EQU   TRMSTATE                                                 00778000
TRMOPTFN EQU   TRMSTATE                                                 00779000
TRMHELDN EQU   TRMSTATE                                                 00780000
TRMACPTN EQU   TRMSTATE                                                 00781000
TRMPROC  EQU   TRMLOG                                                   00782000
TRMLIST  EQU   TRMLOG                                                   00783000
TRMSUBST EQU   IEDNTRM+12                                               00784000
TRMRLMCT EQU   IEDNTRM+10                                               00785000
TRMGPCNT EQU   TRMSIBPT                                                 00786000
TRMBUFRD EQU   TRMBYTE0                                                 00787000
TRMSNA   EQU   TRMBYTE0                                                 00788000
TRMGP    EQU   TRMBYTE0                                                 00789000
TRMDIAL  EQU   TRMBYTE0                                                 00790000
@NM00143 EQU   TRMBYTE0                                                 00791000
TRMOUTPT EQU   TRMBYTE0                                                 00792000
TRMINPUT EQU   TRMBYTE0                                                 00793000
TRMUDEF  EQU   TRMBYTE0                                                 00794000
TRMCOHRT EQU   IEDNTRM+4                                                00795000
TRMCKPRN EQU   TRMBYTE1                                                 00796000
TRMTSATN EQU   TRMBYTE1                                                 00797000
TRMTRACE EQU   TRMBYTE1                                                 00798000
TRMSWBCK EQU   TRMBYTE1                                                 00799000
TRMAUTOC EQU   TRMBYTE1                                                 00800000
TRMINPTP EQU   TRMBYTE1                                                 00801000
TRMWTNEG EQU   TRMSCPRQ                                                 00802000
TRMWRBRK EQU   TRMBYTE2                                                 00803000
TRMNOSND EQU   TRMBYTE2                                                 00804000
TRMPREP  EQU   TRMBYTE2                                                 00805000
TRMGPACT EQU   TRMBYTE2                                                 00806000
TRMANDL  EQU   TRMBYTE2                                                 00807000
TRMCLOSN EQU   TRMINPG                                                  00808000
TRMREMB  EQU   TRMBYTE2                                                 00809000
TRMRSACT EQU   TRMBYTE2                                                 00810000
QCBTTCIN EQU   QCBPLCBA+1                                               00811000
@NM00142 EQU   QCBPLCBA                                                 00812000
@NM00141 EQU   QCBSTAT1                                                 00813000
QCBFLUSH EQU   QCBSTAT1                                                 00814000
QCBNDXRQ EQU   QCBSTAT1                                                 00815000
QCBESIG  EQU   QCBSTAT1                                                 00816000
QCBRCVRQ EQU   QCBSTAT1                                                 00817000
QCBSNDRQ EQU   QCBSTAT1                                                 00818000
QCBWAITC EQU   QCBSTAT1                                                 00819000
QCBPLCBN EQU   QCBSTAT1                                                 00820000
QCBCHAIN EQU   IEDNQCB                                                  00821000
QCBPQBCK EQU   IEDQPQCB+25                                              00822000
QCBPRIPQ EQU   IEDQPQCB+24                                              00823000
QCBCFHDR EQU   IEDQPQCB+21                                              00824000
QCBLFEFO EQU   IEDQPQCB+18                                              00825000
QCBFFEFO EQU   IEDQPQCB+15                                              00826000
QCBPREVF EQU   QCBINTLF                                                 00827000
QCBINTFF EQU   IEDQPQCB+9                                               00828000
QCBDATSQ EQU   QCBFHDTZ+1                                               00829000
@NM00140 EQU   QCBFHDTZ                                                 00830000
@NM00139 EQU   QCBPFEFO                                                 00831000
QCBDATFL EQU   QCBFHDLZ                                                 00832000
QCBDNHDR EQU   IEDQPQCB                                                 00833000
QCBQBACK EQU   IEDQQCB+37                                               00834000
QCBCKPT  EQU   QCBFLAG                                                  00835000
QCBPROC  EQU   QCBFLAG                                                  00836000
QCBSDFFO EQU   QCBFLAG                                                  00837000
QCBTERMQ EQU   QCBFLAG                                                  00838000
QCBRSRV  EQU   QCBFLAG                                                  00839000
QCBREAD  EQU   QCBFLAG                                                  00840000
QCBNOBRK EQU   QCBFLAG                                                  00841000
QCBTSSES EQU   QCBFLAG                                                  00842000
QCBTJID  EQU   QCBLKRRN+1                                               00843000
QCBCARCT EQU   QCBLKRRN                                                 00844000
QCBPRLVL EQU   QCBPREN                                                  00845000
QCBMSGCT EQU   IEDQQCB+26                                               00846000
QCBEXTO  EQU   QCBINTVL                                                 00847000
QCBDISC  EQU   QCBTSOF1                                                 00848000
QCBDELAY EQU   QCBTSOF1                                                 00849000
QCBPARTO EQU   QCBTSOF1                                                 00850000
QCBSATRD EQU   QCBTSOF1                                                 00851000
QCBNOBUF EQU   QCBTSOF1                                                 00852000
QCBTPUT  EQU   QCBTSOF1                                                 00853000
QCBTGET  EQU   QCBTSOF1                                                 00854000
QCBWRBRK EQU   QCBTSOF1                                                 00855000
QCBSATLC EQU   QCBTSOF2                                                 00856000
QCBSATTI EQU   QCBTSOF2                                                 00857000
QCBSATCH EQU   QCBTSOF2                                                 00858000
QCBSIMRD EQU   QCBTSOF2                                                 00859000
QCBDSSMI EQU   QCBTSOF2                                                 00860000
QCBPOSTO EQU   QCBTSOF2                                                 00861000
QCBBUFQ  EQU   QCBTSOF2                                                 00862000
QCBINHBN EQU   QCBTSOF2                                                 00863000
QCBSATCT EQU   @NM00138                                                 00864000
QCBSCBOF EQU   IEDQQCB+20                                               00865000
QCBTIME  EQU   QCBSTAT                                                  00866000
QCBCLOCK EQU   QCBSTAT                                                  00867000
QCBSCHDL EQU   QCBSTAT                                                  00868000
QCBSMODE EQU   QCBSTAT                                                  00869000
QCBSEND  EQU   QCBSTAT                                                  00870000
QCBBUFRD EQU   QCBSTAT                                                  00871000
QCBTRMHO EQU   QCBSTAT                                                  00872000
QCBEOM   EQU   QCBSTAT                                                  00873000
QCBHUCT  EQU   QCBRETCT                                                 00874000
QCBIEND  EQU   QCBRETCT                                                 00875000
QCBEND   EQU   QCBRETCT                                                 00876000
QCBNL    EQU   QCBRETCT                                                 00877000
QCBLOGCT EQU   QCBRETCT                                                 00878000
@NM00137 EQU   QCBBYTE1                                                 00879000
QCBRITRM EQU   QCBBYTE1                                                 00880000
@NM00136 EQU   QCBEOLDT                                                 00881000
QCBSLINK EQU   IEDQQCB+13                                               00882000
QCBSTPRI EQU   IEDQQCB+12                                               00883000
QCBSTCHN EQU   IEDQQCB+9                                                00884000
QCBSTVTO EQU   IEDQQCB+8                                                00885000
QCBLINK  EQU   IEDQQCB+5                                                00886000
QCBPRI   EQU   IEDQQCB+4                                                00887000
QCBCNTEN EQU   QCBELCHN+2                                               00888000
@NM00135 EQU   QCBELCHN+2                                               00889000
@NM00134 EQU   QCBELCHN                                                 00890000
QCBHELD  EQU   QCBDSFLG                                                 00891000
QCBFQCB  EQU   QCBDSFLG                                                 00892000
QCBDRQQ  EQU   QCBDSFLG                                                 00893000
QCBALTMH EQU   QCBDSFLG                                                 00894000
QCBREUS  EQU   QCBDISK                                                  00895000
QCBNREUS EQU   QCBDISK                                                  00896000
QCBCORE  EQU   QCBDSFLG                                                 00897000
QCBTSQ   EQU   QCBDSFLG                                                 00898000
OPCBOTTM EQU   IEDQOPCD+1188                                            00899000
OPCDSRWT EQU   IEDQOPCD+1184                                            00900000
@NM00133 EQU   IEDQOPCD+1100                                            00901000
@NM00132 EQU   IEDQOPCD+948                                             00902000
@NM00131 EQU   IEDQOPCD+940                                             00903000
@NM00130 EQU   IEDQOPCD+380                                             00904000
@NM00129 EQU   OPCPWCOB+9                                               00905000
@NM00128 EQU   OPCPWCOB+8                                               00906000
@NM00127 EQU   OPCPWECB+1                                               00907000
OPCPWCCC EQU   OPCPWECB                                                 00908000
OPCPWCHN EQU   OPCPWQCB+1                                               00909000
OPCPWVTO EQU   OPCPWQCB                                                 00910000
OPCAPXTL EQU   IEDQOPCD+356                                             00911000
OPCDECR  EQU   IEDQOPCD+352                                             00912000
OPCBUFWT EQU   IEDQOPCD+348                                             00913000
OPCADGOT EQU   IEDQOPCD+318                                             00914000
OPCRQCNT EQU   IEDQOPCD+316                                             00915000
OPPOLSTP EQU   IEDQOPCD+312                                             00916000
OPCCKCIB EQU   IEDQOPCD+308                                             00917000
OPCEND   EQU   IEDQOPCD+307                                             00918000
OPCSTCBS EQU   IEDQOPCD+306                                             00919000
OPCHNEND EQU   IEDQOPCD+302                                             00920000
OPCOQSW  EQU   IEDQOPCD+301                                             00921000
@NM00126 EQU   OPCSPEC                                                  00922000
@NM00125 EQU   OPCSPEC                                                  00923000
@NM00124 EQU   OPCSPEC                                                  00924000
@NM00123 EQU   OPCSPEC                                                  00925000
OPCFRMCA EQU   OPCSPEC                                                  00926000
OPCRSTRT EQU   OPCSPEC                                                  00927000
OPCPART  EQU   OPCSPEC                                                  00928000
OPCALTD  EQU   OPCSPEC                                                  00929000
OPCBFEND EQU   IEDQOPCD+296                                             00930000
OPCBFIRS EQU   IEDQOPCD+292                                             00931000
OPCAVBUF EQU   IEDQOPCD+290                                             00932000
OPCIPLCT EQU   IEDQOPCD+289                                             00933000
OPCCLNTS EQU   IEDQOPCD+288                                             00934000
OPCHA8   EQU   IEDQOPCD+286                                             00935000
OPCBFREQ EQU   IEDQOPCD+284                                             00936000
OPCFREBF EQU   IEDQOPCD+280                                             00937000
OPCGETBF EQU   IEDQOPCD+276                                             00938000
OPCNEXT  EQU   IEDQOPCD+272                                             00939000
OPCFMDFC EQU   IEDQOPCD+268                                             00940000
OPCSCNC  EQU   IEDQOPCD+264                                             00941000
OPCHORTG EQU   IEDQOPCD+260                                             00942000
OPCCKPTL EQU   IEDQOPCD+252                                             00943000
OPCCKPTF EQU   IEDQOPCD+248                                             00944000
OPCWAITA EQU   IEDQOPCD+244                                             00945000
OPCWAITR EQU   IEDQOPCD+240                                             00946000
OPCWAITP EQU   IEDQOPCD+236                                             00947000
OPCWAITO EQU   IEDQOPCD+232                                             00948000
OPCWAITN EQU   IEDQOPCD+228                                             00949000
OPCWAITL EQU   IEDQOPCD+224                                             00950000
OPCWAITC EQU   IEDQOPCD+220                                             00951000
@NM00122 EQU   OPCLDNME+5                                               00952000
@NM00121 EQU   OPCLDNME                                                 00953000
OPCWAIT  EQU   IEDQOPCD+192                                             00954000
OPCCKERB EQU   IEDQOPCD+164                                             00955000
OPCBFERB EQU   IEDQOPCD+148                                             00956000
OPCFLAG2 EQU   IEDQOPCD+147                                             00957000
OPCWRKSZ EQU   IEDQOPCD+144                                             00958000
OPCWORK  EQU   IEDQOPCD+140                                             00959000
OPCRSAVE EQU   IEDQOPCD+132                                             00960000
OPCQCBAD EQU   IEDQOPCD+128                                             00961000
OPCTRMWA EQU   IEDQOPCD+52                                              00962000
OPCPSTWT EQU   IEDQOPCD+48                                              00963000
OPCTNTEA EQU   IEDQOPCD+44                                              00964000
OPCPGCK  EQU   IEDQOPCD+40                                              00965000
OPCLCB   EQU   IEDQOPCD+36                                              00966000
@NM00120 EQU   IEDQOPCD+32                                              00967000
OPCIPLAD EQU   IEDQOPCD+28                                              00968000
OPCTOFLK EQU   IEDQOPCD+24                                              00969000
OPCOPTLK EQU   IEDQOPCD+20                                              00970000
OPCDCBLK EQU   IEDQOPCD+16                                              00971000
OPCDOUBL EQU   IEDQOPCD                                                 00972000
@NM00119 EQU   OCLDNME+4                                                00973000
@NM00118 EQU   OCPREFLG                                                 00974000
OCTOTEP  EQU   OCPREFLG                                                 00975000
OCREPOST EQU   OCPREFLG                                                 00976000
OCRSPSNT EQU   OCPREFLG                                                 00977000
OCBFREQ  EQU   OCPREFLG                                                 00978000
OCIDLE   EQU   OCREQFLG                                                 00979000
OCFORCE  EQU   OCREQFLG                                                 00980000
OCDCARD  EQU   OCREQFLG                                                 00981000
OCPARTAL EQU   OCREQFLG                                                 00982000
OCADNCP  EQU   OCREQFLG                                                 00983000
@NM00117 EQU   OCREQFLG                                                 00984000
@NM00116 EQU   OCREQFLG                                                 00985000
OCFLUSHZ EQU   OCREQFLG                                                 00986000
OCRESPCT EQU   OCLINTTE                                                 00987000
OCCKPTWA EQU   OCCKDATA+4                                               00988000
@NM00113 EQU   OCRSTGTM+2                                               00989000
OCCKDAT2 EQU   OCRSTGTM+1                                               00990000
OCCKDAT1 EQU   OCRSTGTM                                                 00991000
OCPTRSAV EQU   OCMODNME+4                                               00992000
OCPUADR  EQU   OCIPLWA+2                                                00993000
OCWTGSAV EQU   OCIPLWA                                                  00994000
OCDVRDCT EQU   OCBACKUP+6                                               00995000
OCNCP    EQU   OCBACKUP+4                                               00996000
OCBUFGOT EQU   OCBACKUP+2                                               00997000
OCBUFNED EQU   OCBACKUP                                                 00998000
OCWTG    EQU   IEDQOPCE+30                                              00999000
OCRESNUM EQU   OCPARM                                                   01000000
OCSEQ    EQU   OCTRUNIT+2                                               01001000
@NM00112 EQU   OCRSID+1                                                 01002000
OCNONE   EQU   OCALSTAT                                                 01003000
OCSOME   EQU   OCALSTAT                                                 01004000
OCACTREQ EQU   OCALSTAT                                                 01005000
OCREDRVE EQU   OCALSTAT                                                 01006000
OCSEQIND EQU   OCALSTAT                                                 01007000
@NM00111 EQU   OCALSTAT                                                 01008000
OCWTGB   EQU   OCTIOT                                                   01009000
@NM00110 EQU   @NM00109+2                                               01010000
OCCONID  EQU   OCDEST                                                   01011000
OCATTACH EQU   OCFLAG                                                   01012000
OCSSCP   EQU   OCFLAG                                                   01013000
OCOUTPUT EQU   OCFLAG                                                   01014000
OCLINE   EQU   OCFLAG                                                   01015000
OCMPP    EQU   OCFLAG                                                   01016000
@NM00108 EQU   OCSWITCH                                                 01017000
OCQUCKN  EQU   OCSWITCH                                                 01018000
OCPRIFLG EQU   OCOPTCDE                                                 01019000
@NM00107 EQU   OCRUDEST+1                                               01020000
@NM00106 EQU   OCSCAN                                                   01021000
OCNOTUCB EQU   OCSCAN                                                   01022000
OCNONAME EQU   OCSCAN                                                   01023000
OCALLRLN EQU   OCSCAN                                                   01024000
OCDDNAME EQU   OCSCAN                                                   01025000
OCDDNRLN EQU   OCSCAN                                                   01026000
OCADDR   EQU   OCSCAN                                                   01027000
OCELMPTR EQU   OCELEM+1                                                 01028000
OCELMPRI EQU   OCELEM                                                   01029000
SAVTLLCB EQU   IEDNSVTD+316                                             01030000
SAVTBITN EQU   IEDNSVTD+312                                             01031000
@NM00105 EQU   SAVTCKQB+8                                               01032000
@NM00104 EQU   SAVTCKEC+1                                               01033000
@NM00103 EQU   SAVTCKCC                                                 01034000
SAVTCKPO EQU   SAVTCKCC                                                 01035000
SAVTCKWA EQU   SAVTCKCC                                                 01036000
SAVTCKCH EQU   SAVTCKTB+1                                               01037000
SAVTCKVT EQU   SAVTCKTB                                                 01038000
@NM00102 EQU   IEDNSVTD+297                                             01039000
SAVTRDFG EQU   SAVTRDRV+12                                              01040000
@NM00101 EQU   SAVTRDRV+5                                               01041000
SAVTRDPY EQU   SAVTRDRV+4                                               01042000
SAVTRDQB EQU   SAVTRDRV+1                                               01043000
SAVTRDKY EQU   SAVTRDRV                                                 01044000
SAVTNID  EQU   IEDNSVTD+280                                             01045000
SAVTDVAS EQU   IEDNSVTD+276                                             01046000
SAVTPLSZ EQU   IEDNSVTD+274                                             01047000
@NM00100 EQU   IEDNSVTD+273                                             01048000
SAVTSUBL EQU   IEDNSVTD+272                                             01049000
@NM00099 EQU   SAVTZELM+1                                               01050000
SAVTSUBM EQU   SAVTZELM                                                 01051000
SAVTMHDX EQU   IEDNSVTD+268                                             01052000
SAVTNAT1 EQU   IEDNSVTD+266                                             01053000
SAVTSH20 EQU   IEDNSVTD+264                                             01054000
SAVTLCBS EQU   IEDNSVTD+260                                             01055000
SAVTRNMP EQU   IEDNSVTD+256                                             01056000
SAVTTNTX EQU   IEDNSVTD+252                                             01057000
SAVTNAX  EQU   IEDNSVTD+248                                             01058000
SAVTSUBV EQU   IEDNSVTD+247                                             01059000
SAVTSUBA EQU   IEDNSVTD+246                                             01060000
SAVTSIBC EQU   IEDNSVTD+244                                             01061000
SAVTBSM  EQU   IEDNSVTD+240                                             01062000
SAVTSCPT EQU   SAVTTCPU                                                 01063000
SAVTRQTG EQU   IEDNSVTD+236                                             01064000
SAVTRQCH EQU   IEDNSVTD+232                                             01065000
SAVTMAND EQU   IEDNSVTD+228                                             01066000
SAVTSPLN EQU   IEDNSVTD+224                                             01067000
SAVTNADL EQU   IEDNSVTD+222                                             01068000
SAVTNATL EQU   IEDNSVTD+220                                             01069000
SAVTMHTB EQU   IEDNSVTD+216                                             01070000
SAVTSSMH EQU   IEDNSVTD+212                                             01071000
SAVTQRS  EQU   IEDNSVTD+208                                             01072000
SAVTRQIN EQU   IEDNSVTD+204                                             01073000
SAVTDFCO EQU   IEDNSVTD+200                                             01074000
SAVTSAO  EQU   IEDNSVTD+196                                             01075000
SAVTSARI EQU   IEDNSVTD+192                                             01076000
SAVTSAC  EQU   IEDNSVTD+188                                             01077000
SAVTSAI  EQU   IEDNSVTD+184                                             01078000
SAVTCSCI EQU   IEDNSVTD+180                                             01079000
SAVTSSRP EQU   IEDNSVTD+176                                             01080000
SAVTSSRQ EQU   IEDNSVTD+172                                             01081000
SAVTSCLU EQU   IEDNSVTD+168                                             01082000
SAVTXTRQ EQU   IEDNSVTD+164                                             01083000
SAVTMVBF EQU   IEDNSVTD+160                                             01084000
@NM00098 EQU   IEDNSVTD+148                                             01085000
SAVTIPCQ EQU   IEDNSVTD+144                                             01086000
@NM00097 EQU   IEDNSVTD+136                                             01087000
SAVTXFMI EQU   IEDNSVTD+132                                             01088000
@NM00096 EQU   IEDNSVTD+124                                             01089000
SAVTXFMO EQU   IEDNSVTD+120                                             01090000
@NM00095 EQU   IEDNSVTD+116                                             01091000
SAVTSSSR EQU   IEDNSVTD+112                                             01092000
SAVTSCPQ EQU   IEDNSVTD+108                                             01093000
SAVTSLCB EQU   IEDNSVTD+104                                             01094000
SAVTLUSR EQU   IEDNSVTD+100                                             01095000
@NM00094 EQU   SAVTLUSQ+8                                               01096000
SAVTLUSP EQU   SAVTLUSQ+4                                               01097000
SAVTLUSB EQU   SAVTLUSQ                                                 01098000
@NM00093 EQU   IEDNSVTD+84                                              01099000
SAVTSAT  EQU   IEDNSVTD+80                                              01100000
SAVTNAT  EQU   IEDNSVTD+76                                              01101000
SAVTCLUP EQU   IEDNSVTD+72                                              01102000
SAVTPIUT EQU   IEDNSVTD+68                                              01103000
SAVTRNTA EQU   IEDNSVTD+64                                              01104000
SAVTDNIR EQU   IEDNSVTD+60                                              01105000
SAVTCNIR EQU   IEDNSVTD+56                                              01106000
SAVTFLDH EQU   IEDNSVTD+52                                              01107000
SAVTSRTN EQU   IEDNSVTD+48                                              01108000
SAVTSREQ EQU   IEDNSVTD+44                                              01109000
SAVTFAIL EQU   IEDNSVTD+42                                              01110000
SAVTSUSE EQU   IEDNSVTD+40                                              01111000
SAVTSIB  EQU   IEDNSVTD+36                                              01112000
SAVTPRTN EQU   IEDNSVTD+32                                              01113000
@NM00092 EQU   IEDNSVTD+28                                              01114000
SAVTWH20 EQU   IEDNSVTD+26                                              01115000
SAVTPWT  EQU   IEDNSVTD+24                                              01116000
SAVTPRTQ EQU   IEDNSVTD+20                                              01117000
SAVTPREQ EQU   IEDNSVTD+16                                              01118000
SAVTPH20 EQU   IEDNSVTD+14                                              01119000
SAVTPUSE EQU   IEDNSVTD+12                                              01120000
SAVTPLCB EQU   IEDNSVTD+8                                               01121000
SAVTPOOL EQU   IEDNSVTD+4                                               01122000
SAVTPRMT EQU   SAVTDIAF                                                 01123000
SAVTVIRT EQU   SAVTDIAF                                                 01124000
AVTCPBNO EQU   IEDQAVTD+1244                                            01125000
AVTHRESS EQU   IEDQAVTD+1243                                            01126000
@NM00091 EQU   IEDQAVTD+1242                                            01127000
@NM00090 EQU   IEDQAVTD+1241                                            01128000
@NM00089 EQU   IEDQAVTD+1240                                            01129000
@NM00088 EQU   IEDQAVTD+1237                                            01130000
@NM00087 EQU   IEDQAVTD+1236                                            01131000
AVTHRESE EQU   @NM00086                                                 01132000
AVTRADDR EQU   IEDQAVTD+1228                                            01133000
AVTNADDR EQU   IEDQAVTD+1224                                            01134000
AVTHRESN EQU   IEDQAVTD+1220                                            01135000
AVTVOLRN EQU   IEDQAVTD+1216                                            01136000
AVTTOTNN EQU   IEDQAVTD+1212                                            01137000
AVTTRCYN EQU   IEDQAVTD+1208                                            01138000
AVTRCTRN EQU   IEDQAVTD+1204                                            01139000
AVTNOVON EQU   IEDQAVTD+1200                                            01140000
AVTADEBN EQU   IEDQAVTD+1196                                            01141000
AVTVOLRR EQU   IEDQAVTD+1192                                            01142000
AVTTOTNR EQU   IEDQAVTD+1188                                            01143000
AVTTRCYR EQU   IEDQAVTD+1184                                            01144000
AVTRCTRR EQU   IEDQAVTD+1180                                            01145000
AVTNOVOR EQU   IEDQAVTD+1176                                            01146000
AVTADEBR EQU   IEDQAVTD+1172                                            01147000
AVTLODPT EQU   IEDQAVTD+1168                                            01148000
AVTIOBN  EQU   IEDQAVTD+1164                                            01149000
AVTIOBR  EQU   IEDQAVTD+1160                                            01150000
AVTCPBPT EQU   IEDQAVTD+1156                                            01151000
AVTFCPB  EQU   IEDQAVTD+1152                                            01152000
@NM00085 EQU   IEDQAVTD+1148                                            01153000
AVTINCPQ EQU   IEDQAVTD+1144                                            01154000
@NM00084 EQU   IEDQAVTD+1140                                            01155000
@NM00083 EQU   IEDQAVTD+1137                                            01156000
@NM00082 EQU   AVTBIT4                                                  01157000
@NM00081 EQU   AVTBIT4                                                  01158000
@NM00080 EQU   AVTBIT4                                                  01159000
@NM00079 EQU   AVTBIT4                                                  01160000
@NM00078 EQU   AVTBIT4                                                  01161000
@NM00077 EQU   AVTBIT4                                                  01162000
@NM00076 EQU   AVTBIT4                                                  01163000
AVTRUFTN EQU   AVTBIT4                                                  01164000
@NM00075 EQU   IEDQAVTD+1132                                            01165000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01166000
@NM00074 EQU   IEDQAVTD+1124                                            01167000
AVTDKENQ EQU   IEDQAVTD+1120                                            01168000
@NM00073 EQU   IEDQAVTD+1116                                            01169000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01170000
AVTCOPY  EQU   IEDQAVTD+1108                                            01171000
AVTIA    EQU   IEDQAVTD+1104                                            01172000
AVTFL    EQU   IEDQAVTD+1100                                            01173000
@NM00072 EQU   IEDQAVTD+1096                                            01174000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01175000
AVTTOTNC EQU   IEDQAVTD+1088                                            01176000
AVTCMAX  EQU   IEDQAVTD+1084                                            01177000
AVTCMIN  EQU   IEDQAVTD+1080                                            01178000
AVTHM02  EQU   IEDQAVTD+1076                                            01179000
AVTDCTLN EQU   IEDQAVTD+1072                                            01180000
AVTOPMSK EQU   IEDQAVTD+1068                                            01181000
AVTDDFT  EQU   IEDQAVTD+1064                                            01182000
AVTSTEAL EQU   IEDQAVTD+1060                                            01183000
AVTOPTN  EQU   IEDQAVTD+1056                                            01184000
AVTDSKCT EQU   IEDQAVTD+1054                                            01185000
AVTCKRST EQU   IEDQAVTD+1053                                            01186000
AVTSTAN  EQU   AVTBIT3                                                  01187000
AVTSTACN EQU   AVTBIT3                                                  01188000
AVTSTAIN EQU   AVTBIT3                                                  01189000
AVTSTAYN EQU   AVTBIT3                                                  01190000
AVTOLTBN EQU   AVTBIT3                                                  01191000
AVTTSAB  EQU   AVTBIT3                                                  01192000
AVTRFULN EQU   AVTBIT3                                                  01193000
AVTRECVN EQU   AVTBIT3                                                  01194000
@NM00071 EQU   AVTBIT2                                                  01195000
@NM00070 EQU   AVTBIT2                                                  01196000
AVTOPEIN EQU   AVTBIT2                                                  01197000
AVTSTRTN EQU   AVTBIT2                                                  01198000
AVTTOPOL EQU   AVTBIT2                                                  01199000
AVTCOPYN EQU   AVTBIT2                                                  01200000
AVTREUSN EQU   AVTBIT2                                                  01201000
AVTEXTSC EQU   AVTBIT2                                                  01202000
AVTDISKN EQU   AVTBIT1                                                  01203000
AVTQUCKN EQU   AVTBIT1                                                  01204000
AVTCLOSN EQU   AVTBIT1                                                  01205000
AVTREADN EQU   AVTBIT1                                                  01206000
AVTDLAYN EQU   AVTBIT1                                                  01207000
AVTAQTAN EQU   AVTBIT1                                                  01208000
AVTTSON  EQU   AVTBIT1                                                  01209000
AVTAPLKN EQU   AVTBIT1                                                  01210000
AVTDUMBR EQU   IEDQAVTD+1048                                            01211000
AVTDLQX  EQU   IEDQAVTD+1046                                            01212000
AVTINTLV EQU   IEDQAVTD+1044                                            01213000
AVTSMCNT EQU   IEDQAVTD+1042                                            01214000
AVTAVFCT EQU   IEDQAVTD+1040                                            01215000
AVTOPCON EQU   IEDQAVTD+1038                                            01216000
AVTOPCNT EQU   IEDQAVTD+1036                                            01217000
AVTLNCNT EQU   IEDQAVTD+1034                                            01218000
AVTKEYLE EQU   IEDQAVTD+1032                                            01219000
AVTHA16  EQU   IEDQAVTD+1030                                            01220000
AVTHA7   EQU   IEDQAVTD+1028                                            01221000
AVTHA4   EQU   IEDQAVTD+1026                                            01222000
AVTHA3   EQU   IEDQAVTD+1024                                            01223000
AVTHA2   EQU   IEDQAVTD+1022                                            01224000
AVTGETMS EQU   IEDQAVTD+1021                                            01225000
@NM00069 EQU   IEDQAVTD+1020                                            01226000
AVTGETMD EQU   IEDQAVTD+1016                                            01227000
AVTGETMN EQU   IEDQAVTD+1012                                            01228000
AVTCWTOT EQU   IEDQAVTD+1008                                            01229000
AVTCWINT EQU   IEDQAVTD+956                                             01230000
AVTDTRAP EQU   IEDQAVTD+952                                             01231000
@NM00068 EQU   IEDQAVTD+950                                             01232000
@NM00067 EQU   AVTIOTR                                                  01233000
AVTIOTRH EQU   AVTIOTR                                                  01234000
AVTIOTRE EQU   AVTIOTR                                                  01235000
@NM00066 EQU   AVTSUBT                                                  01236000
AVTSUBPT EQU   AVTSUBT                                                  01237000
AVTSUBON EQU   AVTSUBT                                                  01238000
AVTAFE30 EQU   IEDQAVTD+944                                             01239000
AVTAFE20 EQU   IEDQAVTD+940                                             01240000
AVTAFE10 EQU   IEDQAVTD+936                                             01241000
AVTCWEC2 EQU   IEDQAVTD+932                                             01242000
AVTCWPM2 EQU   IEDQAVTD+928                                             01243000
AVTCWTS2 EQU   IEDQAVTD+927                                             01244000
AVTCWTS1 EQU   IEDQAVTD+926                                             01245000
AVTCWCLD EQU   AVTCWFL2                                                 01246000
AVTCWRAP EQU   AVTCWFL2                                                 01247000
@NM00065 EQU   AVTCWFL2                                                 01248000
@NM00064 EQU   AVTCWFL2                                                 01249000
@NM00063 EQU   AVTCWFL2                                                 01250000
@NM00062 EQU   AVTCWFL2                                                 01251000
@NM00061 EQU   AVTCWFL2                                                 01252000
AVTCWACT EQU   AVTCWFL2                                                 01253000
@NM00060 EQU   AVTCWFL1                                                 01254000
@NM00059 EQU   AVTCWFL1                                                 01255000
@NM00058 EQU   AVTCWFL1                                                 01256000
@NM00057 EQU   AVTCWFL1                                                 01257000
@NM00056 EQU   AVTCWFL1                                                 01258000
@NM00055 EQU   AVTCWFL1                                                 01259000
@NM00054 EQU   AVTCWFL1                                                 01260000
AVTCOMWN EQU   AVTCWFL1                                                 01261000
AVTCWEC1 EQU   IEDQAVTD+920                                             01262000
AVTCWPM1 EQU   IEDQAVTD+916                                             01263000
AVTCAREA EQU   IEDQAVTD+912                                             01264000
AVTFZERO EQU   IEDQAVTD+908                                             01265000
AVTCADDR EQU   IEDQAVTD+904                                             01266000
AVTCOREC EQU   IEDQAVTD+900                                             01267000
@NM00053 EQU   IEDQAVTD+892                                             01268000
AVTCPBCB EQU   IEDQAVTD+888                                             01269000
@NM00052 EQU   IEDQAVTD+880                                             01270000
AVTDSIOB EQU   IEDQAVTD+876                                             01271000
@NM00051 EQU   IEDQAVTD+868                                             01272000
AVTCPRMB EQU   IEDQAVTD+864                                             01273000
@NM00050 EQU   IEDQAVTD+856                                             01274000
AVTCLOSB EQU   IEDQAVTD+852                                             01275000
@NM00049 EQU   IEDQAVTD+844                                             01276000
AVTACTIB EQU   IEDQAVTD+840                                             01277000
@NM00048 EQU   IEDQAVTD+836                                             01278000
AVTOLTEB EQU   IEDQAVTD+832                                             01279000
AVTOLTCH EQU   AVTOLTQB+1                                               01280000
AVTOLTVT EQU   AVTOLTQB                                                 01281000
@NM00047 EQU   AVTOPCQB+8                                               01282000
@NM00046 EQU   AVTOPCEC+1                                               01283000
@NM00045 EQU   AVTOPCCC                                                 01284000
AVTOPCPO EQU   AVTOPCCC                                                 01285000
AVTOPCWA EQU   AVTOPCCC                                                 01286000
AVTOPCCH EQU   AVTOPCOB+1                                               01287000
AVTOPCVT EQU   AVTOPCOB                                                 01288000
@NM00044 EQU   AVTCKPQB+9                                               01289000
AVTCKPTS EQU   AVTCKPQB+8                                               01290000
@NM00043 EQU   AVTCKPEC+1                                               01291000
@NM00042 EQU   AVTCKPCC                                                 01292000
AVTCKPPO EQU   AVTCKPCC                                                 01293000
AVTCKPWA EQU   AVTCKPCC                                                 01294000
AVTCKPCH EQU   AVTCKPTB+1                                               01295000
AVTCKPVT EQU   AVTCKPTB                                                 01296000
@NM00041 EQU   IEDQAVTD+796                                             01297000
AVTBFRTB EQU   IEDQAVTD+792                                             01298000
@NM00040 EQU   IEDQAVTD+788                                             01299000
AVTSELCH EQU   IEDQAVTD+785                                             01300000
AVTBFRTN EQU   AVTBFRFG                                                 01301000
AVTBFREB EQU   IEDQAVTD+780                                             01302000
AVTTIMQ  EQU   IEDQAVTD+776                                             01303000
@NM00039 EQU   IEDQAVTD+772                                             01304000
AVTIMQPS EQU   IEDQAVTD+768                                             01305000
AVTINOUT EQU   IEDQAVTD+766                                             01306000
AVTREFTM EQU   IEDQAVTD+764                                             01307000
@NM00038 EQU   IEDQAVTD+752                                             01308000
AVTDELYB EQU   IEDQAVTD+748                                             01309000
AVTOCQPT EQU   IEDQAVTD+744                                             01310000
AVTTSOPT EQU   IEDQAVTD+740                                             01311000
AVTSUPPT EQU   IEDQAVTD+736                                             01312000
AVTCBQCB EQU   IEDQAVTD+732                                             01313000
AVTMSGS  EQU   IEDQAVTD+729                                             01314000
@NM00037 EQU   AVTSYSER                                                 01315000
@NM00036 EQU   AVTSYSER                                                 01316000
@NM00035 EQU   AVTSYSER                                                 01317000
@NM00034 EQU   AVTSYSER                                                 01318000
@NM00033 EQU   AVTSYSER                                                 01319000
@NM00032 EQU   AVTSYSER                                                 01320000
AVTCMAXN EQU   AVTSYSER                                                 01321000
AVTCMINN EQU   AVTSYSER                                                 01322000
AVT2260L EQU   IEDQAVTD+724                                             01323000
AVTABEPL EQU   AVTADBUF                                                 01324000
AVTHFF   EQU   AVTCLRHI+2                                               01325000
@NM00031 EQU   AVTCLRHI                                                 01326000
AVTCCLNK EQU   AVTCRELE+5                                               01327000
AVTCCPRI EQU   AVTCRELE+4                                               01328000
AVTCCQCB EQU   AVTCCELE+1                                               01329000
AVTCCKEY EQU   AVTCCELE                                                 01330000
AVTDELAD EQU   IEDQAVTD+704                                             01331000
AVTDELEM EQU   IEDQAVTD+700                                             01332000
AVTBSX   EQU   AVTCKLNK                                                 01333000
AVTOPETR EQU   AVTHG01                                                  01334000
@NM00030 EQU   AVTCKBYT                                                 01335000
AVTCKONQ EQU   AVTCKBYT                                                 01336000
@NM00029 EQU   AVTCKBYT                                                 01337000
@NM00028 EQU   AVTCKBYT                                                 01338000
@NM00027 EQU   AVTCKBYT                                                 01339000
@NM00026 EQU   AVTCKBYT                                                 01340000
@NM00025 EQU   AVTCKBYT                                                 01341000
@NM00024 EQU   AVTCKBYT                                                 01342000
AVTOPERT EQU   IEDQAVTD+690                                             01343000
AVTOPXCL EQU   IEDQAVTD+688                                             01344000
AVTOPERL EQU   IEDQAVTD+687                                             01345000
@NM00023 EQU   IEDQAVTD+686                                             01346000
AVTCKTIM EQU   IEDQAVTD+684                                             01347000
AVTCKELV EQU   IEDQAVTD+682                                             01348000
AVTCPRCD EQU   IEDQAVTD+681                                             01349000
AVTWARMN EQU   AVTCKELF                                                 01350000
AVTCRTLN EQU   AVTCKELF                                                 01351000
AVTCPIPN EQU   AVTCKELF                                                 01352000
AVTCCLCN EQU   AVTCKELF                                                 01353000
AVTCINCN EQU   AVTCKELF                                                 01354000
@NM00022 EQU   AVTCKELF                                                 01355000
AVTCMCPN EQU   AVTCKELF                                                 01356000
AVTNQBCK EQU   AVTCKELF                                                 01357000
AVTCKQAD EQU   IEDQAVTD+677                                             01358000
AVTSCBSZ EQU   IEDQAVTD+676                                             01359000
@NM00021 EQU   IEDQAVTD+672                                             01360000
AVTCKELE EQU   IEDQAVTD+668                                             01361000
@NM00020 EQU   AVTCKPEL+8                                               01362000
AVTCKRLK EQU   AVTCKPEL+5                                               01363000
AVTCKRPR EQU   AVTCKPEL+4                                               01364000
AVTCKRMQ EQU   AVTCKRMV+1                                               01365000
AVTCKRKY EQU   AVTCKRMV                                                 01366000
AVTHK    EQU   IEDQAVTD+648                                             01367000
AVTHI    EQU   IEDQAVTD+644                                             01368000
AVTIOT   EQU   IEDQAVTD+640                                             01369000
AVTNX    EQU   IEDQAVTD+636                                             01370000
AVTTONE  EQU   IEDQAVTD+632                                             01371000
AVTA3TL  EQU   IEDQAVTD+628                                             01372000
AVTDMECB EQU   IEDQAVTD+624                                             01373000
AVTABEND EQU   IEDQAVTD+618                                             01374000
AVTPLCBN EQU   IEDQAVTD+616                                             01375000
@NM00019 EQU   AVTSAVTP+1                                               01376000
@NM00018 EQU   AVTSAVTF                                                 01377000
AVTSNA   EQU   AVTSAVTF                                                 01378000
AVTONSNA EQU   AVTSAVTF                                                 01379000
AVTVTMCP EQU   AVTSAVTF                                                 01380000
@NM00017 EQU   IEDQAVTD+608                                             01381000
AVTCMBSS EQU   IEDQAVTD+604                                             01382000
AVTRCV   EQU   IEDQAVTD+600                                             01383000
AVTSEND  EQU   IEDQAVTD+596                                             01384000
AVTCSCH  EQU   IEDQAVTD+592                                             01385000
AVTQ1    EQU   IEDQAVTD+588                                             01386000
AVTE7    EQU   IEDQAVTD+584                                             01387000
AVTHB    EQU   IEDQAVTD+580                                             01388000
AVTR1    EQU   IEDQAVTD+576                                             01389000
AVTBZ    EQU   IEDQAVTD+572                                             01390000
AVTEZ    EQU   IEDQAVTD+568                                             01391000
AVTEC    EQU   IEDQAVTD+564                                             01392000
AVTEW    EQU   IEDQAVTD+560                                             01393000
AVTNDIAL EQU   AVTSCOPT                                                 01394000
AVTN2741 EQU   AVTSCOPT                                                 01395000
AVTCONCO EQU   AVTSCOPT                                                 01396000
AVTCONC  EQU   AVTSCOPT                                                 01397000
AVTCMBUF EQU   AVTSCOPT                                                 01398000
AVTAPDMP EQU   AVTSCOPT                                                 01399000
@NM00016 EQU   AVTSCOPT                                                 01400000
AVTHA    EQU   AVTDISP                                                  01401000
AVTEA    EQU   IEDQAVTD+548                                             01402000
AVTAX    EQU   IEDQAVTD+544                                             01403000
AVTA3    EQU   IEDQAVTD+540                                             01404000
AVTGD    EQU   IEDQAVTD+536                                             01405000
AVTAL    EQU   IEDQAVTD+532                                             01406000
AVTOLTST EQU   AVTHG02                                                  01407000
AVTE8    EQU   IEDQAVTD+524                                             01408000
AVTUI    EQU   IEDQAVTD+520                                             01409000
AVTCOMPT EQU   IEDQAVTD+516                                             01410000
AVTCRSRF EQU   IEDQAVTD+512                                             01411000
@NM00015 EQU   IEDQAVTD+508                                             01412000
AVTKA02  EQU   IEDQAVTD+504                                             01413000
AVTOPTPT EQU   IEDQAVTD+500                                             01414000
AVTPCBPT EQU   IEDQAVTD+496                                             01415000
@NM00014 EQU   AVTECB1                                                  01416000
AVTCOMP  EQU   AVTECB1                                                  01417000
@NM00013 EQU   AVTECB1                                                  01418000
AVTOPECA EQU   IEDQAVTD+488                                             01419000
AVTOLECA EQU   IEDQAVTD+484                                             01420000
AVTCKECA EQU   IEDQAVTD+480                                             01421000
AVTCWECA EQU   IEDQAVTD+476                                             01422000
AVTCWTCB EQU   IEDQAVTD+472                                             01423000
AVTOCTCB EQU   IEDQAVTD+464                                             01424000
AVTCKTCB EQU   IEDQAVTD+460                                             01425000
AVTAS    EQU   IEDQAVTD+456                                             01426000
AVTNOLBF EQU   IEDQAVTD+454                                             01427000
AVTNCKPR EQU   IEDQAVTD+453                                             01428000
AVTCIB   EQU   IEDQAVTD+452                                             01429000
AVTSPLPT EQU   IEDQAVTD+448                                             01430000
AVTMVBFR EQU   IEDQAVTD+444                                             01431000
AVTSBTA  EQU   IEDQAVTD+440                                             01432000
AVTRARTN EQU   IEDQAVTD+436                                             01433000
AVTBSCAN EQU   IEDQAVTD+432                                             01434000
AVTRDYA  EQU   IEDQAVTD+428                                             01435000
AVTDISTR EQU   IEDQAVTD+420                                             01436000
AVTPARM3 EQU   IEDQAVTD+416                                             01437000
@NM00012 EQU   AVTPKF                                                   01438000
@NM00011 EQU   AVTPKF                                                   01439000
@NM00010 EQU   AVTPKF                                                   01440000
AVTFTCHF EQU   AVTPKF                                                   01441000
@NM00009 EQU   AVTPKF                                                   01442000
@NM00008 EQU   AVTPKF                                                   01443000
@NM00007 EQU   AVTPKF                                                   01444000
@NM00006 EQU   AVTPKF                                                   01445000
AVTPARM  EQU   IEDQAVTD+408                                             01446000
AVTEXS2A EQU   IEDQAVTD+402                                             01447000
AVTEXA2S EQU   IEDQAVTD+396                                             01448000
AVTOCGET EQU   IEDQAVTD+392                                             01449000
AVTCKAVT EQU   @NM00004+1                                               01450000
@NM00005 EQU   AVTCKFLG                                                 01451000
AVTCKHLT EQU   AVTCKFLG                                                 01452000
AVTCKREQ EQU   AVTCKFLG                                                 01453000
AVTCKENV EQU   AVTCKFLG                                                 01454000
AVTCKNAC EQU   AVTCKFLG                                                 01455000
AVTCKTAC EQU   AVTCKFLG                                                 01456000
AVTBUENT EQU   IEDQAVTD+386                                             01457000
@NM00003 EQU   IEDQAVTD+385                                             01458000
AVTFULLT EQU   AVTBUFSW                                                 01459000
AVTUNCON EQU   AVTBUFSW                                                 01460000
@NM00002 EQU   AVTBUFSW                                                 01461000
AVTBUFTR EQU   AVTREADD                                                 01462000
AVTREADY EQU   IEDQAVTD+376                                             01463000
AVTRACE  EQU   IEDQAVTD+372                                             01464000
AVTTCB   EQU   IEDQAVTD+368                                             01465000
AVTPASWD EQU   IEDQAVTD+360                                             01466000
AVTCTLCH EQU   IEDQAVTD+352                                             01467000
AVTDOUBL EQU   IEDQAVTD+344                                             01468000
AVTDOUBX EQU   IEDQAVTD+336                                             01469000
AVTDPARM EQU   IEDQAVTD+332                                             01470000
AVTCSTCS EQU   IEDQAVTD+328                                             01471000
AVTDLQ   EQU   AVTSAVEX+32                                              01472000
@NM00001 EQU   AVTSAVEX                                                 01473000
AVTSAVE4 EQU   IEDQAVTD+216                                             01474000
AVTSAVE3 EQU   IEDQAVTD+144                                             01475000
AVTSAVE2 EQU   IEDQAVTD+72                                              01476000
AVTSAVE1 EQU   IEDQAVTD                                                 01477000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01478000
@RC00254 EQU   @RC00252                                                 01479000
@RF00322 EQU   @RC00316                                                 01480000
@RF00325 EQU   @RC00316                                                 01481000
@RF00327 EQU   @RC00316                                                 01482000
@RF00258 EQU   @RC00254                                                 01483000
@ENDDATA EQU   *                                                        01484000
         END   IGCVG10D,(C'PLS1801',0701,77353)                         01485000
