         TITLE 'IGE0004I, 370X CHANNEL ERP                             *00001000
                        '                                               00002000
IGE0004I CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
*                                                               02S0260 00005000
*   /*****************************************************************/ 00006000
*   /*                                                               */ 00007000
*   /* PROLOGUE: THIS SEGMENT COMPLETES THE MODULE PROLOGUE CODE     */ 00008000
*   /*                                                               */ 00009000
*   /*****************************************************************/ 00010000
*                                                               02S0260 00011000
*   RBASE=REG15;                    /* ASSIGN TO THE BASE REGISTER      00012000
*                                      THE ENTRY POINT ADDRESS OF THE   00013000
*                                      MODULE                        */ 00014000
         LR    RBASE,REG15                                      02S0260 00015000
*   RFY                                                         02S0261 00016000
*     REG15 UNRSTD;                                             02S0261 00017000
*   GEN CODE NODEFS NOEXIT NOFLOWS REFS(RBASE) SEQFLOW NOSETS;  02S0262 00018000
*                                                          /*           00019000
         USING IGE0004I,RBASE          INFORM THE ASSEMBLER OF THE      00020000
*                                      BASE REGISTER TO BE USED FOR     00021000
*                                      ADDRESSING CODE                  00022000
IGE0004I IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO      00023000
*                                                               02S0263 00024000
*   /*****************************************************************/ 00025000
*   /*                                                               */ 00026000
*   /* GPROCESS: THIS IS THE TOP LEVEL SEGMENT OF THE MODULE. IT IS  */ 00027000
*   /* COMPOSED OF SEGMENTS CONDTEST, PROCCASE, EXITCASE, AND        */ 00028000
*   /* INTF025C. CONDTEST EVALUATES ERROR CONDITIONS AND DETERMINES  */ 00029000
*   /* APPROPRIATE ACTION. PROCCASE IS A CASE MACRO WHOSE SUBCASES   */ 00030000
*   /* SETUP APPROPRIATE ACTION FOR THE VARIOUS ERROR CONDITIONS AND */ 00031000
*   /* DETERMINE HOW TO EXIT FROM THE MODULE. EXITCASE IS A CASE     */ 00032000
*   /* MACRO WHOSE SUBCASES EXIT FROM THE MODULE. INTF025C IS A      */ 00033000
*   /* SUBROUTINE WHICH SETS UP A PERMANENT ERROR EXIT TO IGE0025C   */ 00034000
*   /* FOR MESSAGE IEA000I AND OBR RECORDING FOR SUBCASES CRETRY AND */ 00035000
*   /* CPET3 OF PROCCASE.                                            */ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                               02S0263 00039000
*   IOSBPTR=RPARM;                  /* REG 1 CONTAINS IOSB ADDRESS      00040000
*                                                            @G36XREB*/ 00041000
         LR    IOSBPTR,RPARM                                    03S0263 00042000
*   RLCB=IOSUSE;                    /* GET LCB ADDRESS FROM IOSB        00043000
*                                                            @G36XREB*/ 00044000
         L     RLCB,IOSUSE(,IOSBPTR)                            03S0264 00045000
*/* MAP I/O STATUS FIELDS FROM IOSB INTO LCB(IOB)            @G36XRIB*/ 00046000
*                                                               03S0265 00047000
*   LCBFLAG1=IOSFLA;                /* STATUS BITS           @G36XRIB*/ 00048000
         MVC   LCBFLAG1(1,RLCB),IOSFLA(IOSBPTR)                 03S0265 00049000
*   LCBFLAG2=IOSFLB;                /* STATUS BITS           @G36XRIB*/ 00050000
         MVC   LCBFLAG2(1,RLCB),IOSFLB(IOSBPTR)                 03S0266 00051000
*   LCBECBCC=IOSCOD;                /* ECB COMPLETION CODE   @G36XRIB*/ 00052000
         MVC   LCBECBCC(1,RLCB),IOSCOD(IOSBPTR)                 03S0267 00053000
*   LCBSIOCC=IOSCC;                 /* SIO COMPLETION CODE   @G36XRIB*/ 00054000
         MVC   LCBSIOCC(1,RLCB),IOSCC(IOSBPTR)                  03S0268 00055000
*   LCBCSW=IOSCSW;                  /* CSW                   @G36XRIB*/ 00056000
         MVC   LCBCSW(7,RLCB),IOSCSW(IOSBPTR)                   03S0269 00057000
*   LCBSNS=IOSSNS;                  /* SENSE BYTES           @G36XRIB*/ 00058000
         MVC   LCBSNS(2,RLCB),IOSSNS(IOSBPTR)                   03S0270 00059000
*   IF(LCBSIOC1=RESET&LCBSIOC2=SET) THEN/* SIO COND.CODE 1   @G36XREB*/ 00060000
         TM    LCBSIOC2(RLCB),B'00010000'                       03S0271 00061000
         BNO   @RF00271                                         03S0271 00062000
         TM    LCBSIOC1(RLCB),B'00100000'                       03S0271 00063000
         BNZ   @RF00271                                         03S0271 00064000
*     DO;                           /* YES                   @G36XREB*/ 00065000
*       LCBCSWCA=LCBSTART+LENGTH(IEDQCCW);/* ..THEN SETUP DUMMY 03S0273 00066000
*                                      INTERRUPT ADDRESS     @YM06897*/ 00067000
         LA    @10,8                                            03S0273 00068000
         L     @09,LCBSTART-1(,RLCB)                            03S0273 00069000
         LA    @09,0(,@09)                                      03S0273 00070000
         ALR   @10,@09                                          03S0273 00071000
         STCM  @10,7,LCBCSWCA(RLCB)                             03S0273 00072000
*       IOSCSWCA=LCBCSWCA;          /* PUT DUMMY ADDR IN IOSB ALSO      00073000
*                                                            @G36XREB*/ 00074000
         STCM  @10,7,IOSCSWCA(IOSBPTR)                          03S0274 00075000
*     END;                          /*                       @G36XREB*/ 00076000
*   ELSE                                                        03S0276 00077000
*     ;                             /*                       @YM06897*/ 00078000
@RF00271 DS    0H                                               03S0277 00079000
*   RPARM=LCBTTCIN;                 /* SETUP PARAMETER FOR IEDQTNT   */ 00080000
         LH    RPARM,LCBTTCIN(,RLCB)                            03S0277 00081000
         N     RPARM,@CF03224                                   03S0277 00082000
*   RAVT=TCXAVT;                    /* SET UP AVT POINTER    @YM05691*/ 00083000
         L     @10,CVTPTR                                       03S0278 00084000
         L     @10,TCXPTR(,@10)                                 03S0278 00085000
         L     RAVT,TCXAVT(,@10)                                03S0278 00086000
*   CALL IEDQTNT;                   /* LINK TO IEDQTNT TO GET NCP TTE   00087000
*                                      ADDRESS                       */ 00088000
         L     @15,AVTRNMPT(,RAVT)                              03S0279 00089000
         BALR  @14,@15                                          03S0279 00090000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* BACKUP TTE ADDRESS TO PREFIX     00091000
*                                                            @YM04622*/ 00092000
         LR    RTRM,RPARM                                       03S0280 00093000
         SL    RTRM,@CF02512                                    03S0280 00094000
*                                                               03S0281 00095000
*   /*****************************************************************/ 00096000
*   /*                                                               */ 00097000
*   /* GPROCESS.CONDTEST: EVALUATES ERROR CONDITIONS AND DETERMINES  */ 00098000
*   /* APPROPRIATE ACTION. ASSIGNS AN INDEX TO RPROC FOR CASE        */ 00099000
*   /* PROCCASE. COMPOSED OF SEGMENTS CONVRV, INITPROC, CONDSIO3, AND*/ 00100000
*   /* CONDOTHR. CONVRV CONVERTS REAL DATA ADDRESSES TO VIRTUAL ONES */ 00101000
*   /* IN THE CCWS IN THE CHANNEL PROGRAM. INITPROC DOES INITIAL     */ 00102000
*   /* PROCESSING-CALLING CHANNEL I/O TRACE OR SAVING ORIGINAL       */ 00103000
*   /* STATUS. CONDSIO3 HANDLES SIOCC3 STATUS. CONDOTHR HANDLES ALL  */ 00104000
*   /* OTHER STATUS.                                                 */ 00105000
*   /*                                                               */ 00106000
*   /*****************************************************************/ 00107000
*                                                               03S0281 00108000
*                                                               04S0281 00109000
*   /*****************************************************************/ 00110000
*   /*                                                               */ 00111000
*   /* GPROCESS.CONDTEST.CONVRV: CONVERTS REAL DATA ADDRESSES TO     */ 00112000
*   /* VIRTUAL ADDRESSES IN THE CCWS IN THE INVOKING CHANNEL PROGRAM.*/ 00113000
*   /*                                                               */ 00114000
*   /*****************************************************************/ 00115000
*                                                               04S0281 00116000
*   RFY                                                         04S0281 00117000
*    (RINT,                                                     04S0281 00118000
*     REG10) RSTD;                  /*                       @YM04622*/ 00119000
*   IF LCBRLAD=SET THEN             /* IF VIRTUAL CHAN PROG THEN        00120000
*                                                            @YM04622*/ 00121000
         TM    LCBRLAD(RLCB),B'00010000'                        04S0282 00122000
         BNO   @RF00282                                         04S0282 00123000
*     DO;                           /* TRANSLATE REAL TO VIRTUAL        00124000
*                                                            @YM04622*/ 00125000
*       REG10=CVTPTRV;              /* GET ADDRESS OF REAL TO VIRTUAL   00126000
*                                      TRANSLATE ROUTINE     @YM04622*/ 00127000
         L     @07,CVTPTR                                       04S0284 00128000
         L     REG10,CVTPTRV(,@07)                              04S0284 00129000
*       RINT=LCBCSWCA-LENGTH(IEDQCCW);/* INTERRUPT CCW ADDRESS  04S0285 00130000
*                                                            @YM04622*/ 00131000
         L     RINT,LCBCSWCA-1(,RLCB)                           04S0285 00132000
         LA    RINT,0(,RINT)                                    04S0285 00133000
         SL    RINT,@CF00045                                    04S0285 00134000
*       IF TRMIPLDM=SET|            /* IF IPL/DUMP IN PROGRESS ...      00135000
*                                                            @YM04622*/ 00136000
*           LCBSTAT1=AVTEFF THEN    /* ... OR CLOSE CHAN PROG THEN      00137000
*                                                            @YM04622*/ 00138000
         TM    TRMIPLDM(RTRM),B'10000000'                       04S0286 00139000
         BO    @RT00286                                         04S0286 00140000
         CLI   LCBSTAT1(RLCB),X'FF'                             04S0286 00141000
         BNE   @RF00286                                         04S0286 00142000
@RT00286 DS    0H                                               04S0287 00143000
*         RCCW=LCBSTART;            /* BEGIN TRANSLATION WITH FIRST     00144000
*                                      CCW                   @YM04622*/ 00145000
         L     RCCW,LCBSTART-1(,RLCB)                           04S0287 00146000
         LA    RCCW,0(,RCCW)                                    04S0287 00147000
*       ELSE                        /*                       @YM04622*/ 00148000
*         DO;                       /* ELSE DETERMINE WHICH CCWS NEED   00149000
*                                      TRANSLATION           @YM04622*/ 00150000
         B     @RC00286                                         04S0288 00151000
@RF00286 DS    0H                                               04S0289 00152000
*           RPARM=RLCB+DCBEIOBX;    /* POINT TO END OF LCB   @YM04622*/ 00153000
         L     @07,LCBDCBPT(,RLCB)                              04S0289 00154000
         LR    RPARM,RLCB                                       04S0289 00155000
         SLR   @05,@05                                          04S0289 00156000
         IC    @05,DCBEIOBX+20(,@07)                            04S0289 00157000
         ALR   RPARM,@05                                        04S0289 00158000
*           IF RINT>=RLCB&          /* IF INTERRUPT CCW IS IN THE LCB   00159000
*                                                            @YM04622*/ 00160000
*               RINT<RPARM&         /*                       @YM04622*/ 00161000
*               RINT^=ADDR(LCBCCW7) THEN/* BUT NOT NOP CCW AFTER        00162000
*                                      READS THEN            @YM04622*/ 00163000
         CR    RINT,RLCB                                        04S0290 00164000
         BL    @RF00290                                         04S0290 00165000
         CR    RINT,RPARM                                       04S0290 00166000
         BNL   @RF00290                                         04S0290 00167000
         LA    @07,LCBCCW7(,RLCB)                               04S0290 00168000
         CR    RINT,@07                                         04S0290 00169000
         BE    @RF00290                                         04S0290 00170000
*             RINT=ZERO;            /* THEN INDICATE NO READ CCW        00171000
*                                      TRANSLATION           @YM04622*/ 00172000
         SLR   RINT,RINT                                        04S0291 00173000
*           RCCW=ADDR(LCBCCW2);     /* ASSUME SENDING        @YM04622*/ 00174000
@RF00290 LA    RCCW,LCBCCW2(,RLCB)                              04S0292 00175000
*           IF LCBSENDN=RESET THEN  /* IF NOT SENDING THEN ...  04S0293 00176000
*                                                            @YM04622*/ 00177000
         TM    LCBSENDN(RLCB),B'00000001'                       04S0293 00178000
         BNZ   @RF00293                                         04S0293 00179000
*             RCCW=ADDR(LCBCCW4);   /* ... ASSUME READING    @YM04622*/ 00180000
         LA    RCCW,LCBCCW4(,RLCB)                              04S0294 00181000
*         END;                      /*                       @YM04622*/ 00182000
@RF00293 DS    0H                                               04S0296 00183000
*       DO WHILE LCBRLAD=SET;       /* TRANSLATE CCWS WHILE ANY ARE     00184000
*                                      REAL                          */ 00185000
@RC00286 B     @DE00296                                         04S0296 00186000
@DL00296 DS    0H                                               04S0297 00187000
*         RPARM=CCWADDR;            /* GET CCW DATA ADDRESS          */ 00188000
         SLR   RPARM,RPARM                                      04S0297 00189000
         ICM   RPARM,7,CCWADDR(RCCW)                            04S0297 00190000
*         CALL CONVRV;              /* CALL CONVERT ROUTINE          */ 00191000
         LR    @15,REG10                                        04S0298 00192000
         BALR  @14,@15                                          04S0298 00193000
*         RFY                                                   04S0299 00194000
*           REG15 RSTD;                                         04S0299 00195000
*         IF REG15^=ZERO            /* IF ERROR ON CONVERSION        */ 00196000
*           THEN                                                04S0300 00197000
         LTR   REG15,REG15                                      04S0300 00198000
         BZ    @RF00300                                         04S0300 00199000
*           GEN CODE( DC    H'0')                               04S0301 00200000
*           NODEFS EXIT NOFLOWS NOREFS NOSEQFLOW NOSETS;/*      04S0301 00201000
*                                      INTENTIONAL PROGRAM CHECK     */ 00202000
          DC    H'0'                                                    00203000
*         ELSE                                                  04S0302 00204000
*           ;                                                   04S0302 00205000
@RF00300 DS    0H                                               04S0303 00206000
*         RFY                                                   04S0303 00207000
*           REG15 UNRSTD;                                       04S0303 00208000
*         CCWADDR=RPARM;            /* UPDATE CCW DATA ADDRESS WITH     00209000
*                                      VIRTUAL ADDR                  */ 00210000
         STCM  RPARM,7,CCWADDR(RCCW)                            04S0304 00211000
*         IF RCCW=RINT&             /* IF THIS IS THE INTERRUPT CCW     00212000
*                                      ...                   @YM04622*/ 00213000
*             TRMIPLDM^=SET THEN    /* AND NOT IN IPL/DUMP PROCESS      00214000
*                                                            @YM04622*/ 00215000
         CR    RCCW,RINT                                        04S0305 00216000
         BNE   @RF00305                                         04S0305 00217000
         TM    TRMIPLDM(RTRM),B'10000000'                       04S0305 00218000
         BO    @RF00305                                         04S0305 00219000
*           RINT=ZERO;              /* SET INDICATION THAT INTERRUPT    00220000
*                                      CCW HAS BEEN TRANSLATED  04S0306 00221000
*                                                            @YM04622*/ 00222000
         SLR   RINT,RINT                                        04S0306 00223000
*         IF NOTTIC1=RESET&         /* IS COMMAND ...        @YM04622*/ 00224000
*             NOTTIC2=RESET&        /* ... A ...             @YM04622*/ 00225000
*             NOTTIC3=RESET THEN    /* ... TIC               @YM04622*/ 00226000
@RF00305 TM    NOTTIC1(RCCW),B'00000111'                        04S0307 00227000
         BNZ   @RF00307                                         04S0307 00228000
*           DO;                     /*                       @YM04622*/ 00229000
*             CCWOPCDE=CCWTIC;      /* INDICATE CCW CONTAINS VIRTUAL    00230000
*                                      ADDRESSES             @YM04622*/ 00231000
         MVI   CCWOPCDE(RCCW),X'08'                             04S0309 00232000
*             RCCW=RPARM;           /* THEN GET ADDR OF CCW THAT IS     00233000
*                                      TIC'ED TO                     */ 00234000
         LR    RCCW,RPARM                                       04S0310 00235000
*             IF CCWOPCDE=CCWREAD THEN/* IF THIS IS A READ CCW ...      00236000
*                                                            @YM04622*/ 00237000
         CLI   CCWOPCDE(RCCW),X'02'                             04S0311 00238000
         BNE   @RF00311                                         04S0311 00239000
*               IF RINT=ZERO THEN   /* ... AND THE INTERRUPT CCW HAS    00240000
*                                      BEEN TRANSLATED       @YM04622*/ 00241000
         LTR   RINT,RINT                                        04S0312 00242000
         BNZ   @RF00312                                         04S0312 00243000
*                 LCBRLAD=RESET;    /* INDICATE TRANSLATION COMPLETE    00244000
*                                                            @YM04622*/ 00245000
         NI    LCBRLAD(RLCB),B'11101111'                        04S0313 00246000
*               ELSE                                            04S0314 00247000
*                 ;                 /*                       @YM04622*/ 00248000
@RF00312 DS    0H                                               04S0315 00249000
*             ELSE                  /*                       @YM04622*/ 00250000
*               IF RCCW=ADDR(LCBCCW3) THEN/* IF TIC TO READ START ...   00251000
*                                                            @YM06637*/ 00252000
         B     @RC00311                                         04S0315 00253000
@RF00311 LA    @07,LCBCCW3(,RLCB)                               04S0315 00254000
         CR    RCCW,@07                                         04S0315 00255000
         BNE   @RF00315                                         04S0315 00256000
*                 RCCW=ADDR(LCBCCW4);/* ... TRANSLATE TIC TO READ       00257000
*                                      BUFFER                @YM06637*/ 00258000
         LA    RCCW,LCBCCW4(,RLCB)                              04S0316 00259000
*               ELSE                /*                       @YM06637*/ 00260000
*                 IF CCWOPCDE=CCWNOP THEN/* IF TIC TO A NOP, FINISHED   00261000
*                                                            @YM04622*/ 00262000
         B     @RC00315                                         04S0317 00263000
@RF00315 CLI   CCWOPCDE(RCCW),X'03'                             04S0317 00264000
         BNE   @RF00317                                         04S0317 00265000
*                   LCBRLAD=RESET;  /* END OF TRANSLATION    @YM04622*/ 00266000
         NI    LCBRLAD(RLCB),B'11101111'                        04S0318 00267000
*           END;                    /*                       @YM04622*/ 00268000
*         ELSE                      /*                       @YM06637*/ 00269000
*           RCCW=RCCW+LENGTH(IEDQCCW);/* NEXT CCW FOLLOWS THIS CCW   */ 00270000
         B     @RC00307                                         04S0320 00271000
@RF00307 AL    RCCW,@CF00045                                    04S0320 00272000
*         IF CCWCC=SET|             /* IF COMMAND CHAINING ...  04S0321 00273000
*                                                            @YM06637*/ 00274000
*             CCWCD=SET THEN                                    04S0321 00275000
@RC00307 TM    CCWCC(RCCW),B'11000000'                          04S0321 00276000
         BNZ   @RT00321                                         04S0321 00277000
*           ;                       /* ... OR DATA CHAINING THEN        00278000
*                                      TRANSLATE             @YM06637*/ 00279000
*         ELSE                      /*                       @YM06637*/ 00280000
*           IF TRMIPLDM=SET|        /* IF IPL/DUMP IN PROGRESS ...      00281000
*                                                            @YM06637*/ 00282000
*               LCBSTAT1=AVTEFF THEN/* ... OR TCAM CLOSEDOWN @YM06637*/ 00283000
         TM    TRMIPLDM(RTRM),B'10000000'                       04S0323 00284000
         BO    @RT00323                                         04S0323 00285000
         CLI   LCBSTAT1(RLCB),X'FF'                             04S0323 00286000
         BNE   @RF00323                                         04S0323 00287000
@RT00323 DS    0H                                               04S0324 00288000
*             LCBRLAD=RESET;        /* THEN TRANSLATION IS COMPLETE     00289000
*                                                            @YM06637*/ 00290000
         NI    LCBRLAD(RLCB),B'11101111'                        04S0324 00291000
*       END;                                                    04S0325 00292000
@RF00323 DS    0H                                               04S0325 00293000
@RT00321 DS    0H                                               04S0325 00294000
@DE00296 TM    LCBRLAD(RLCB),B'00010000'                        04S0325 00295000
         BO    @DL00296                                         04S0325 00296000
*     END;                          /*                       @YM04622*/ 00297000
*                                                               04S0327 00298000
*   /*****************************************************************/ 00299000
*   /*                                                               */ 00300000
*   /* GPROCESS.CONDTEST.INITPROC: IF SUBSEQUENT ENTRY FOR A CHANNEL */ 00301000
*   /* PROGRAM, INVOKES CHANNEL I/O TRACE--OTHERWISE SAVES ORIGINAL  */ 00302000
*   /* STATUS.                                                       */ 00303000
*   /*                                                               */ 00304000
*   /*****************************************************************/ 00305000
*                                                               04S0327 00306000
*   RPROC=ZERO;                     /* INITIALIZE PROCESS VARIABLE   */ 00307000
@RF00282 SLR   RPROC,RPROC                                      04S0327 00308000
*   IF IOSERR=SET                   /* IS THIS SUBSEQUENT ENTRY FOR     00309000
*                                      THE SAME CHANNEL PROGRAM?        00310000
*                                                            @G36XREB*/ 00311000
*     THEN                                                      04S0328 00312000
         TM    IOSERR(IOSBPTR),B'00100000'                      04S0328 00313000
         BNO   @RF00328                                         04S0328 00314000
*     IF AVTIOT^=ZERO               /* IS CHANNEL I/O TRACE IN THE      00315000
*                                      SYSTEM?                       */ 00316000
*       THEN                                                    04S0329 00317000
         L     @07,AVTIOT(,RAVT)                                04S0329 00318000
         LTR   @07,@07                                          04S0329 00319000
         BZ    @RF00329                                         04S0329 00320000
*       DO;                         /* YES                   @G36XREB*/ 00321000
*         IEDRQE=''B;               /* CLEAR DUMMY RQE       @ZM47653*/ 00322000
         LA    @07,32                                           04S0331 00323000
         L     @05,EWAPTR(,IOSBPTR)                             04S0331 00324000
         ALR   @05,@07                                          04S0331 00325000
         XC    IEDRQE(20,@05),IEDRQE(@05)                       04S0331 00326000
*         RQEUCB=DIOSUCBP;          /* GET UCB ADDRESS FROM IOSB        00327000
*                                                            @G36XREB*/ 00328000
         LH    @00,DIOSUCBP(,IOSBPTR)                           04S0332 00329000
         N     @00,@CF03224                                     04S0332 00330000
         STH   @00,RQEUCB(,@05)                                 04S0332 00331000
*         RQEIOB=RLCB+(ADDR(LCBFLAG1)-ADDR(IEDQLCB));/* CALCULATE IOB   00332000
*                                      ADDRESS               @G36XREB*/ 00333000
         ALR   @07,RLCB                                         04S0333 00334000
         STCM  @07,7,RQEIOB(@05)                                04S0333 00335000
*         GEN REFS(PSALITA,FLC) SETS(REG00,REG01,REG15);        04S0334 00336000
*                                   /*                                  00337000
SETERP   SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,       @ZM47653C00338000
               RELATED=CHANNEL-PROGRAM-IGE0004G(SETERP)-       @ZM47653C00339000
               IGE0004H(SETERP)-IGG019QE(SETERP)-              @ZM47653C00340000
               IEDQGT(SETTRAN)-IEDQGA(SETASSC-SETCONC)-        @ZM47653C00341000
               'PCI,CHANNELEND,AND STARTIO APPENDAGES ARE      @ZM47653C00342000
               LOCKED ON THIS RESOURCE VIA EXCP(270X) OR       @ZM47653C00343000
               IOS(370X) (ERP,BUFFER ASSOCIATION AND CCW BUILD @ZM47653C00344000
               MUST ISSUE OWN SETLOCK)'                        @ZM47653 00345000
*         RPARM=ADDR(IEDRQE);       /* ADDRESS OF RQE IN REG 1  04S0335 00346000
*                                                            @G36XREB*/ 00347000
         LA    RPARM,32                                         04S0335 00348000
         AL    RPARM,EWAPTR(,IOSBPTR)                           04S0335 00349000
*         CALL IGG019Q0;            /* GO DO CHANNEL I/O TRACE  04S0336 00350000
*                                                            @G36XREB*/ 00351000
         L     @15,AVTIOT(,RAVT)                                04S0336 00352000
         BALR  @14,@15                                          04S0336 00353000
*         GEN REFS(PSALITA,FLC) SETS(REG00,REG01,REG15);        04S0337 00354000
*                                   /*                                  00355000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                  @ZM47653C00356000
               RELATED=CHANNEL-PROGRAM-IGE0004I(SETERP)        @ZM47653 00357000
*         IEDRQE=''B;               /* DUMMY RQE IN ERP WORKAREA        00358000
*                                                            @ZM47653*/ 00359000
         L     @07,EWAPTR(,IOSBPTR)                             04S0338 00360000
         XC    IEDRQE+32(20,@07),IEDRQE+32(@07)                 04S0338 00361000
*       END;                        /*                       @G36XREB*/ 00362000
*     ELSE                                                      04S0340 00363000
*       ;                                                       04S0340 00364000
@RF00329 DS    0H                                               04S0341 00365000
*   ELSE                                                        04S0341 00366000
*     DO;                           /* FIRST ENTRY INTO ERP FOR THIS    00367000
*                                      CHANNEL PROGRAM               */ 00368000
         B     @RC00328                                         04S0341 00369000
@RF00328 DS    0H                                               04S0342 00370000
*       LCBSTSAV=LCBSTART;          /* SAVE CP START ADDRESS         */ 00371000
         MVC   LCBSTSAV(3,RLCB),LCBSTART(RLCB)                  04S0342 00372000
*       LCBSNSV=LCBSENS0;           /* SAVE ORIGINAL SENSE           */ 00373000
         MVC   LCBSNSV(1,RLCB),LCBSENS0(RLCB)                   04S0343 00374000
*       LCBCSWSV=LCBCSW;            /* SAVE ORIGINAL CSW             */ 00375000
         MVC   LCBCSWSV(7,RLCB),LCBCSW(RLCB)                    04S0344 00376000
*       OPCDESAV=(LCBCSWCA-LENGTH(IEDQCCW))->CCWOPCDE;/* SAVE COMMAND   00377000
*                                      ON WHICH ERROR OCCURRED  04S0345 00378000
*                                                            @YM08537*/ 00379000
         L     @07,LCBCSWCA-1(,RLCB)                            04S0345 00380000
         AL    @07,@CF03226                                     04S0345 00381000
         MVC   OPCDESAV(1,RLCB),CCWOPCDE(@07)                   04S0345 00382000
*     END;                                                      04S0346 00383000
*   IF LCBSTAT1=AVTEFF THEN         /* IF TCAM CLOSEDOWN ... @YM07000*/ 00384000
@RC00328 CLI   LCBSTAT1(RLCB),X'FF'                             03S0347 00385000
         BNE   @RF00347                                         03S0347 00386000
*     RPROC=GRETRY;                 /* ... IGNORE ANY ERRORS, DO MDR    00387000
*                                      PROCESSING            @YM07000*/ 00388000
         LA    RPROC,5                                          03S0348 00389000
*   ELSE                            /*                       @YM07000*/ 00390000
*     IF LCBSIOC1=SET&LCBSIOC2=SET  /* IF SIOCC3                     */ 00391000
*       THEN                                                    03S0349 00392000
         B     @RC00347                                         03S0349 00393000
@RF00347 TM    LCBSIOC1(RLCB),B'00110000'                       03S0349 00394000
         BNO   @RF00349                                         03S0349 00395000
*                                                               04S0350 00396000
*       /*************************************************************/ 00397000
*       /*                                                           */ 00398000
*       /* GPROCESS.CONDTEST.CONDSIO3: DOES INITIAL PROCESSING FOR   */ 00399000
*       /* SIO CONDITION CODE 3 STATUS.                              */ 00400000
*       /*                                                           */ 00401000
*       /*************************************************************/ 00402000
*                                                               04S0350 00403000
*       DO;                                                     04S0350 00404000
*         RTCX=CVTAQAVT;            /* TCX ADDRESS           @G36XREB*/ 00405000
         L     @07,CVTPTR                                       04S0351 00406000
         L     RTCX,CVTAQAVT(,@07)                              04S0351 00407000
*         GEN REFS(TCXCC3TS,RTCX,REG13,TCXESAVE,IOSUCB,IOSBPTR,RPARM,   00408000
*             TCXERPPM);                                        04S0352 00409000
*                       /*                                   @G36XREB*/ 00410000
CC3LOOP  EQU   *                                               @G36XREB 00411000
         TS    TCXCC3TS(RTCX)      RESERVE SAVE AREA IN TCX    @G36XREB 00412000
         BNZ   CC3LOOP             LOOP TILL TCX AVAILABLE     @G36XREB 00413000
         LA    REG13,TCXESAVE(RTCX) SAVE AREA FOR IECVIOPM     @G36XREB 00414000
         L     RPARM,IOSUCB(IOSBPTR) UCB ADDRESS               @G36XREB 00415000
         LA    RPARM,0(RPARM)      CLEAR HO BYTE               @G36XREB 00416000
         ST    RPARM,TCXERPPM(RTCX) SET PARM LIST              @G36XREB 00417000
         LA    RPARM,TCXERPPM(RTCX) PARM LIST ADDR             @G36XREB 00418000
         LINK  EP=IECVIOPM,MF=(E,(1)) CHECK AVAIL PATHS        @G36XREB 00419000
         MVI   TCXCC3TS(RTCX),0    CLEAR TS LOCK               @G36XREB 00420000
*         IF REG15=0 THEN           /* ALTERNATE PATH AVAILABLE 04S0353 00421000
*                                                            @G36XREB*/ 00422000
         LTR   REG15,REG15                                      04S0353 00423000
         BNZ   @RF00353                                         04S0353 00424000
*           RPROC=RETRY;            /* YES, RETRY I/O        @G36XREB*/ 00425000
         LA    RPROC,1                                          04S0354 00426000
*         ELSE                      /* ALTERNATE PATH NOT AVAILABLE     00427000
*                                                            @G36XREB*/ 00428000
*           DO;                     /*                       @G36XREB*/ 00429000
         B     @RC00353                                         04S0355 00430000
@RF00353 DS    0H                                               04S0356 00431000
*             LCBNX064=SET;         /* TELL QNX TO PRINT IED064 MSG     00432000
*                                                            @G36XREB*/ 00433000
         OI    LCBNX064(RLCB),B'10000000'                       04S0356 00434000
*             MSG064=MSG064L;       /* MOVE WTO LIST TO WORK AREA TO    00435000
*                                      MAKE REENTRENT        @ZM47653*/ 00436000
         L     @07,EWAPTR(,IOSBPTR)                             04S0357 00437000
         MVC   MSG064(49,@07),MSG064L                           04S0357 00438000
*             M064CUA=UCBNAME;      /* INSERT UCB NAME IN MSG   04S0358 00439000
*                                                            @G36XREB*/ 00440000
         L     @05,UCBPTR(,IOSBPTR)                             04S0358 00441000
         MVC   M064CUA(3,@07),UCBNAME(@05)                      04S0358 00442000
*             RPARM=ADDR(MSG064);   /* MSG ADDRESS           @G36XREB*/ 00443000
         LA    RPARM,MSG064(,@07)                               04S0359 00444000
*             GEN(WTO  MF=(E,(1))); /* WRITE MSG IED064 TO SYSTEM       00445000
*                                      OPERATOR              @G36XREB*/ 00446000
         WTO  MF=(E,(1))                                                00447000
*             MSG064=''B;           /* CLEAR WTO IN WORKAREA @ZM47653*/ 00448000
         L     @07,EWAPTR(,IOSBPTR)                             04S0361 00449000
         XC    MSG064(49,@07),MSG064(@07)                       04S0361 00450000
*             RPROC=PET2;           /* PERMANENT ERROR PROCESSING       00451000
*                                                            @G36XREB*/ 00452000
         LA    RPROC,3                                          04S0362 00453000
*           END;                    /*                       @G36XREB*/ 00454000
*       END;                                                    04S0364 00455000
*     ELSE                                                      03S0365 00456000
*                                                               04S0365 00457000
*       /*************************************************************/ 00458000
*       /*                                                           */ 00459000
*       /* GPROCESS.CONDTEST.CONDOTHR: DOES INITIAL PROCESSING FOR   */ 00460000
*       /* ALL CONDITIONS EXCEPT SIOCC3.                             */ 00461000
*       /*                                                           */ 00462000
*       /*************************************************************/ 00463000
*                                                               04S0365 00464000
*       DO;                                                     04S0365 00465000
         B     @RC00349                                         04S0365 00466000
@RF00349 DS    0H                                               04S0366 00467000
*         IF(LCBSIOC1=RESET&LCBSIOC2=SET&LCBUSUC=SET)|(LCBSIOC1=RESET&  00468000
*             LCBSIOC2=RESET)       /* IF SIO CONDITION CODE 1 AND      00469000
*                                      UNIT CHECK OR SIO CONDITION      00470000
*                                      CODE 0                @YM06897*/ 00471000
*           THEN                                                04S0366 00472000
         TM    LCBSIOC2(RLCB),B'00010000'                       04S0366 00473000
         BNO   @GL00006                                         04S0366 00474000
         TM    LCBSIOC1(RLCB),B'00100000'                       04S0366 00475000
         BNZ   @GL00006                                         04S0366 00476000
         TM    LCBUSUC(RLCB),B'00000010'                        04S0366 00477000
         BO    @RT00366                                         04S0366 00478000
@GL00006 TM    LCBSIOC1(RLCB),B'00110000'                       04S0366 00479000
         BNZ   @RF00366                                         04S0366 00480000
@RT00366 DS    0H                                               04S0367 00481000
*           DO;                     /* ..THEN PROCESS POSSIBLY  04S0367 00482000
*                                      RECOVERABLE ERRORS    @YM06897*/ 00483000
*             IF LCBCSCDC=SET|LCBCSCCC=SET|LCBCSICC=SET/* IF CHANNEL    00484000
*                                      DATA CHECK OR CHANNEL CONTROL    00485000
*                                      CHECK OR INTERFACE CONTROL       00486000
*                                      CHECK                         */ 00487000
*               THEN                                            04S0368 00488000
         TM    LCBCSCDC(RLCB),B'00001110'                       04S0368 00489000
         BZ    @RF00368                                         04S0368 00490000
*               RPROC=RETRY;        /* SETUP RETRY PROCESSING        */ 00491000
         LA    RPROC,1                                          04S0369 00492000
*             ELSE                                              04S0370 00493000
*               IF LCBUSUC=SET      /* IF UNIT CHECK                 */ 00494000
*                 THEN                                          04S0370 00495000
         B     @RC00368                                         04S0370 00496000
@RF00368 TM    LCBUSUC(RLCB),B'00000010'                        04S0370 00497000
         BNO   @RF00370                                         04S0370 00498000
*                 DO;                                           04S0371 00499000
*                   IF LCBINTRQ=SET|LCBNOTIN=SET/* IF INTERVENTION      00500000
*                                      REQUIRED OR NOT INITIALIZED   */ 00501000
*                     THEN                                      04S0372 00502000
         TM    LCBINTRQ(RLCB),B'01000010'                       04S0372 00503000
         BZ    @RF00372                                         04S0372 00504000
*                     DO;                                       04S0373 00505000
*                       LCBNX142=SET;/* TELL IEDQNX TO WRITE MESSAGE    00506000
*                                      IED142                        */ 00507000
         OI    LCBNX142(RLCB),B'01000000'                       04S0374 00508000
*                       RPROC=PET3; /* SETUP PERMANENT ERROR    04S0375 00509000
*                                      PROCESSING(TYPE 3)            */ 00510000
         LA    RPROC,4                                          04S0375 00511000
*                     END;                                      04S0376 00512000
*                   ELSE                                        04S0377 00513000
*                     IF LCBEQUCK=SET|LCBBUSCK=SET|LCBDATCK=SET|        00514000
*                         LCBOVRUN=SET|LCBCMDRJ=SET/* IF EQUIPMENT      00515000
*                                      CHECK OR BUSOUT CHECK OR DATA    00516000
*                                      CHECK OR OVERRUN OR COMMAND      00517000
*                                      REJECT                        */ 00518000
*                       THEN                                    04S0377 00519000
         B     @RC00372                                         04S0377 00520000
@RF00372 TM    LCBEQUCK(RLCB),B'10111100'                       04S0377 00521000
         BZ    @RF00377                                         04S0377 00522000
*                       RPROC=RETRY;/* SETUP RETRY PROCESSING        */ 00523000
         LA    RPROC,1                                          04S0378 00524000
*                     ELSE                                      04S0379 00525000
*                       RPROC=GRETRY;/* MUST BE UC(ABORT) STATUS-EXIT   00526000
*                                      TO IGG019TH WITH NORMAL  04S0379 00527000
*                                      COMPLETION INDICATED          */ 00528000
         B     @RC00377                                         04S0379 00529000
@RF00377 LA    RPROC,5                                          04S0379 00530000
*                 END;                                          04S0380 00531000
*               ELSE                                            04S0381 00532000
*                 IF LCBCSPGC=SET|LCBCSPTC=SET|LCBCSCHC=SET|LCBCSPCI=   00533000
*                     SET|LCBCSIL=SET/* IF PROGRAM CHECK OR     04S0381 00534000
*                                      PROTECTION CHECK OR CHAINING     00535000
*                                      CHECK OR PROGRAM-CONTROLLED      00536000
*                                      INTERRUPTION OR INCORRECT        00537000
*                                      LENGTH                        */ 00538000
*                   THEN                                        04S0381 00539000
         B     @RC00370                                         04S0381 00540000
@RF00370 TM    LCBCSPGC(RLCB),B'11110001'                       04S0381 00541000
         BZ    @RF00381                                         04S0381 00542000
*                   RPROC=RETRY;    /* SETUP RETRY PROCESSING        */ 00543000
         LA    RPROC,1                                          04S0382 00544000
*                 ELSE                                          04S0383 00545000
*                   IF IOSERR=SET   /* THERE ARE NO ERRORS ACCORDING    00546000
*                                      TO THE VARIOUS STATUS    04S0383 00547000
*                                      INDICATORS-IF THIS IS    04S0383 00548000
*                                      SUBSEQUENT ENTRY FOR SAME CP     00549000
*                                                            @G36XREB*/ 00550000
*                     THEN                                      04S0383 00551000
         B     @RC00381                                         04S0383 00552000
@RF00381 TM    IOSERR(IOSBPTR),B'00100000'                      04S0383 00553000
         BNO   @RF00383                                         04S0383 00554000
*                     RPROC=GRETRY; /* SETUP GOOD RETRY PROCESSING   */ 00555000
         LA    RPROC,5                                          04S0384 00556000
*                   ELSE                                        04S0385 00557000
*                     RPROC=MDREXIT;/* BY DEFAULT 4I WAS INVOKED TO     00558000
*                                      INVOKE 904I(MDR PROCESSOR) SO    00559000
*                                      SETUP MDR EXIT PROCESSING     */ 00560000
         B     @RC00383                                         04S0385 00561000
@RF00383 LA    RPROC,6                                          04S0385 00562000
*           END;                    /*                       @YM06897*/ 00563000
*         ELSE                                                  04S0387 00564000
*           DO;                     /* ..ELSE DECLARE PERMANENT ERROR   00565000
*                                      BECAUSE THERE MUST HAVE BEEN A   00566000
*                                      SOFTWARE ERROR SOMEWHERE 04S0387 00567000
*                                                            @YM06897*/ 00568000
         B     @RC00366                                         04S0387 00569000
@RF00366 DS    0H                                               04S0388 00570000
*             LCBNX162=SET;         /* TELL IEDQNX THAT WE WANT MSG     00571000
*                                      IED162I WRITTEN       @YM06897*/ 00572000
         OI    LCBNX162(RLCB),B'00100000'                       04S0388 00573000
*             RPROC=PET3;           /* SETUP PERMANENT ERROR TYPE 3     00574000
*                                      PROCESSING            @YM06897*/ 00575000
         LA    RPROC,4                                          04S0389 00576000
*           END;                    /*                       @YM06897*/ 00577000
*       END;                                                    04S0391 00578000
@RC00366 DS    0H                                               04S0392 00579000
*                                                               03S0392 00580000
*   /*****************************************************************/ 00581000
*   /*                                                               */ 00582000
*   /* GPROCESS.PROCCASE: A CASE MACRO WHOSE SUBCASES SETUP          */ 00583000
*   /* APPROPRIATE ACTION FOR THE VARIOUS ERROR CONDITIONS AND       */ 00584000
*   /* DETERMINE HOW TO EXIT FROM THE MODULE. THE SEGMENT IS COMPOSED*/ 00585000
*   /* OF SUBCASE SEGMENTS. THE SUBCASES ASSIGN AN INDEX TO REXIT FOR*/ 00586000
*   /* CASE EXITCASE.                                                */ 00587000
*   /*                                                               */ 00588000
*   /*****************************************************************/ 00589000
*                                                               03S0392 00590000
*   DO;                             /* CASE(RPROC)NAMES(CRETRY,CPET1,   00591000
*                                      CPET2,CPET3,CGRETRY,CMDREXIT) */ 00592000
@RC00349 DS    0H                                               03S0392 00593000
@RC00347 DS    0H                                               03S0393 00594000
*     DCL                                                       03S0393 00595000
*       CL0001@ LABEL BASED(CP0001@(RPROC)) VALUERANGE(CRETRY,CPET1,    00596000
*           CPET2,CPET3,CGRETRY,CMDREXIT);/* BRANCH TARGET           */ 00597000
*     DCL                                                       03S0394 00598000
*       CP0001@(6) PTR(31) INIT(ADDR(CRETRY),ADDR(CPET1),ADDR(CPET2),   00599000
*           ADDR(CPET3),ADDR(CGRETRY),ADDR(CMDREXIT));          03S0394 00600000
*     GOTO CL0001@;                 /* BRANCH TO SELECTED CASE  03S0395 00601000
*                                      PROCESSING CASE               */ 00602000
         LR    @07,RPROC                                        03S0395 00603000
         SLA   @07,2                                            03S0395 00604000
         L     @07,CP0001@-4(@07)                               03S0395 00605000
         BR    @07                                              03S0395 00606000
*                                                               04S0396 00607000
*     /***************************************************************/ 00608000
*     /*                                                             */ 00609000
*     /* GPROCESS.PROCCASE.CRETRY: SETS UP RETRY ACTION(EXIT VIA     */ 00610000
*     /* ERROR EXCP) OR PERMANENT ERROR ACTION(EXIT TO IGE0025C FOR  */ 00611000
*     /* MESSAGE IEA000I AND OBR RECORDING) IF RETRY LIMIT EXCEEDED. */ 00612000
*     /*                                                             */ 00613000
*     /***************************************************************/ 00614000
*                                                               04S0396 00615000
*CRETRY:                                                        04S0396 00616000
*     DO;                           /* SUBCASE RETRY PROCESSING      */ 00617000
CRETRY   DS    0H                                               04S0397 00618000
*       LCBINCAM=LCBINCAM+1;        /* INCREMENT RETRY COUNTER       */ 00619000
         LA    @07,1                                            04S0397 00620000
         AH    @07,LCBINCAM(,RLCB)                              04S0397 00621000
         STH   @07,LCBINCAM(,RLCB)                              04S0397 00622000
*       IF LCBINCAM>RETRYLIM        /* IF RETRY HAS BEEN PERFORMED      00623000
*                                      THE MAXIMUM NUMBER OF TIMES   */ 00624000
*         THEN                                                  04S0398 00625000
         C     @07,@CF00074                                     04S0398 00626000
         BNH   @RF00398                                         04S0398 00627000
*         DO;                                                   04S0399 00628000
*           LCBNX162=SET;           /* TELL IEDQNX TO WRITE MESSAGE     00629000
*                                      IED162                        */ 00630000
         OI    LCBNX162(RLCB),B'00100000'                       04S0400 00631000
*           CALL INTF025C;          /* SETUP PARAMETERS FOR EXIT TO     00632000
*                                      IGE0025C                      */ 00633000
         LA    @15,INTF025C                                     04S0401 00634000
         BALR  @14,@15                                          04S0401 00635000
*           IOSERR=OFF;             /* INDICATE PERMANENT... @G36XREB*/ 00636000
*           IOSEX=ON;               /* ...ERROR              @G36XREB*/ 00637000
         OI    IOSEX(IOSBPTR),B'00000100'                       04S0403 00638000
         NI    IOSERR(IOSBPTR),B'11011111'                      04S0403 00639000
*           RPARM=IOSBPTR;          /* IOSB ADDRESS          @G36XREB*/ 00640000
         LR    RPARM,IOSBPTR                                    04S0404 00641000
*           REG13=XCTL025C;         /* IGE0025C ID           @G36XREB*/ 00642000
         LA    REG13,253                                        04S0405 00643000
*           REG14=CVTXTLER;         /* XCTL ROUTINE ADDRESS  @G36XREB*/ 00644000
         L     @07,CVTPTR                                       04S0406 00645000
         L     REG14,CVTXTLER(,@07)                             04S0406 00646000
*           GEN(BR REG14);          /* XCTL TO MESSAGE WRITER   04S0407 00647000
*                                                            @G36XREB*/ 00648000
         BR REG14                                                       00649000
*         END;                                                  04S0408 00650000
*       ELSE                                                    04S0409 00651000
*         DO;                       /* RETRY LIMIT HAS NOT BEEN 04S0409 00652000
*                                      EXCEEDED-RETRY AGAIN          */ 00653000
         B     @RC00398                                         04S0409 00654000
@RF00398 DS    0H                                               04S0410 00655000
*           RCCW=LCBCSWCA-LENGTH(IEDQCCW);/* GET ADDRESS OF INTERRUPT   00656000
*                                      CCW                           */ 00657000
         L     RCCW,LCBCSWCA-1(,RLCB)                           04S0410 00658000
         LA    RCCW,0(,RCCW)                                    04S0410 00659000
         SL    RCCW,@CF00045                                    04S0410 00660000
*           IF CCWOPCDE=CCWREAD|CCWOPCDE=CCWRS0|CCWOPCDE=CCWRS1/* IF    00661000
*                                      INTERRUPT CCW WAS READ START     00662000
*                                      OR READ                       */ 00663000
*             THEN                                              04S0411 00664000
         CLI   CCWOPCDE(RCCW),X'02'                             04S0411 00665000
         BE    @RT00411                                         04S0411 00666000
         CLI   CCWOPCDE(RCCW),X'32'                             04S0411 00667000
         BE    @RT00411                                         04S0411 00668000
         CLI   CCWOPCDE(RCCW),X'52'                             04S0411 00669000
         BNE   @RF00411                                         04S0411 00670000
@RT00411 DS    0H                                               04S0412 00671000
*             DO;                                               04S0412 00672000
*               IF TRMIPLDM=RESET   /* IF IPL AND DUMP ARE NOT IN       00673000
*                                      PROGRESS                      */ 00674000
*                 THEN                                          04S0413 00675000
         TM    TRMIPLDM(RTRM),B'10000000'                       04S0413 00676000
         BNZ   @RF00413                                         04S0413 00677000
*                 LCBSTART=ADDR(LCBCCW3);/* RESTART ON READ START    */ 00678000
         LA    @07,LCBCCW3(,RLCB)                               04S0414 00679000
         STCM  @07,7,LCBSTART(RLCB)                             04S0414 00680000
*               ELSE                                            04S0415 00681000
*                 ;                 /* RESTART ON WRITE START        */ 00682000
@RF00413 DS    0H                                               04S0416 00683000
*             END;                                              04S0416 00684000
*           ELSE                                                04S0417 00685000
*             ;                                                 04S0417 00686000
@RF00411 DS    0H                                               04S0418 00687000
*           IOSVST=LCBSTART;        /* START OF RETRY CHANNEL PROGRAM   00688000
*                                                            @G36XREB*/ 00689000
         L     @07,LCBSTART-1(,RLCB)                            04S0418 00690000
         LA    @07,0(,@07)                                      04S0418 00691000
         ST    @07,IOSVST(,IOSBPTR)                             04S0418 00692000
*           RPARM=IOSVST;           /* GET REAL ADDRESS OF...   04S0419 00693000
*                                                            @ZM47867*/ 00694000
         LR    RPARM,@07                                        04S0419 00695000
*           GEN(LRA   RPARM,0(RPARM));/* ...CHANNEL PROGRAM  @G36XREB*/ 00696000
         LRA   RPARM,0(RPARM)                                           00697000
*           IOSRST=RPARM;           /* PUT REAL ADDR IN IOSB @G36XREB*/ 00698000
         ST    RPARM,IOSRST(,IOSBPTR)                           04S0421 00699000
*           RPARM=IOSBPTR;          /* IOSB ADDRESS          @G36XREB*/ 00700000
         LR    RPARM,IOSBPTR                                    04S0422 00701000
*           CALL SIOAPNG;           /* CALL START I/O APPENDAGE TO      00702000
*                                      CONVERT CHANNEL PROGRAM FROM     00703000
*                                      VIETUAL TO REAL       @G36XREB*/ 00704000
         L     @07,IEDQDPTR(,IOSBPTR)                           04S0423 00705000
         L     @15,DEBSIOA(,@07)                                04S0423 00706000
         BALR  @14,@15                                          04S0423 00707000
*           IOSERR=ON;              /* INDICATE RETRY...     @G36XREB*/ 00708000
*           IOSEX=ON;               /* ...SITUATION          @G36XREB*/ 00709000
         OI    IOSERR(IOSBPTR),B'00100100'                      04S0425 00710000
*           SVC(15);                /* ISSUE ERROR EXCP      @G36XREB*/ 00711000
         SVC   15                                               04S0426 00712000
*           SVC(3);                 /* EXIT SVC              @G36XREB*/ 00713000
         SVC   3                                                04S0427 00714000
*         END;                                                  04S0428 00715000
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */ 00716000
         B     CE0001@                                          04S0429 00717000
*     END CRETRY;                   /* END OF SUBCASE                */ 00718000
*                                                               04S0431 00719000
*     /***************************************************************/ 00720000
*     /*                                                             */ 00721000
*     /* GPROCESS.PROCCASE.CPET1: SETS UP PERMANENT ERROR TYPE 1     */ 00722000
*     /* ACTION-EXIT TO IGE0025C FOR ALTERNATE PATH RETRY.           */ 00723000
*     /*                                                             */ 00724000
*     /***************************************************************/ 00725000
*                                                               04S0431 00726000
*CPET1:                                                         04S0431 00727000
*     DO;                           /* SUBCASE PERMANENT ERROR TYPE 1   00728000
*                                      PROCESSING                    */ 00729000
CPET1    DS    0H                                               04S0432 00730000
*/*   NO ACTION, CURRENTLY NOT BEING USED                    @G36XREB*/ 00731000
*                                                               04S0432 00732000
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */ 00733000
         B     CE0001@                                          04S0432 00734000
*     END CPET1;                    /* END OF SUBCASE                */ 00735000
*                                                               04S0434 00736000
*     /***************************************************************/ 00737000
*     /*                                                             */ 00738000
*     /* GPROCESS.PROCCASE.CPET2: SETS UP PERMANENT ERROR PROCESSING */ 00739000
*     /* TYPE 2-EXIT TO IGG019TH VIA ERROR EXCP.                     */ 00740000
*     /*                                                             */ 00741000
*     /***************************************************************/ 00742000
*                                                               04S0434 00743000
*CPET2:                                                         04S0434 00744000
*     DO;                           /* SUBCASE PERMANENT ERROR TYPE 2   00745000
*                                      PROCESSING                    */ 00746000
CPET2    DS    0H                                               04S0435 00747000
*       LCBSENS0=LCBSNSV;           /* RESTORE ORIGINAL SENSE        */ 00748000
         MVC   LCBSENS0(1,RLCB),LCBSNSV(RLCB)                   04S0435 00749000
*       LCBCSW=LCBCSWSV;            /* RESTORE ORIGINAL CSW          */ 00750000
         MVC   LCBCSW(7,RLCB),LCBCSWSV(RLCB)                    04S0436 00751000
*       LCBUNADD=ADDR(UCBNAME);     /* SETUP PARAMETER FOR IGE0025C  */ 00752000
         L     @07,UCBPTR(,IOSBPTR)                             04S0437 00753000
         LA    @07,UCBNAME(,@07)                                04S0437 00754000
         STCM  @07,7,LCBUNADD(RLCB)                             04S0437 00755000
*       LCBSTART=LCBSTSAV;          /* RESTORE ORIGINAL CP START        00756000
*                                      ADDRESS                       */ 00757000
         MVC   LCBSTART(3,RLCB),LCBSTSAV(RLCB)                  04S0438 00758000
*       LCBINCAM=ZERO;              /* RESET RETRY COUNTER           */ 00759000
         SLR   @07,@07                                          04S0439 00760000
         STH   @07,LCBINCAM(,RLCB)                              04S0439 00761000
*       LCBECBCC=LCBECB41;          /* SET TCAM PERMANENT ERROR SO      00762000
*                                      THAT IGG019TH WILL DETECT IT     00763000
*                                                            @OY20613*/ 00764000
         MVI   LCBECBCC(RLCB),X'41'                             04S0440 00765000
*       IOSERR=OFF;                 /* INDICATE PERMANENT... @G36XREB*/ 00766000
*       IOSEX=ON;                   /* ...ERROR              @G36XREB*/ 00767000
         OI    IOSEX(IOSBPTR),B'00000100'                       04S0442 00768000
         NI    IOSERR(IOSBPTR),B'11011111'                      04S0442 00769000
*       RPARM=IOSBPTR;              /* IOSB ADDRESS          @G36XREB*/ 00770000
         LR    RPARM,IOSBPTR                                    04S0443 00771000
*       SVC(15);                    /* ISSUE ERROR EXCP TO RETURN TO    00772000
*                                      CHANNEL END APPENDAGE @G36XREB*/ 00773000
         SVC   15                                               04S0444 00774000
*       SVC(3);                     /* EXIT SVC              @G36XREB*/ 00775000
         SVC   3                                                04S0445 00776000
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */ 00777000
         B     CE0001@                                          04S0446 00778000
*     END CPET2;                    /* END OF SUBCASE                */ 00779000
*                                                               04S0448 00780000
*     /***************************************************************/ 00781000
*     /*                                                             */ 00782000
*     /* GPROCESS.PROCCASE.CPET3: SETS UP PERMANENT ERROR TYPE 3     */ 00783000
*     /* PROCESSING-EXIT TO IGE0025C FOR MESSAGE IEA000I AND OBR     */ 00784000
*     /* RECORDING.                                                  */ 00785000
*     /*                                                             */ 00786000
*     /***************************************************************/ 00787000
*                                                               04S0448 00788000
*CPET3:                                                         04S0448 00789000
*     DO;                           /* SUBCASE PERMANENT ERROR TYPE 3   00790000
*                                      PROCESSING                    */ 00791000
CPET3    DS    0H                                               04S0449 00792000
*       CALL INTF025C;              /* SETUP PARAMETERS FOR IGE0025C    00793000
*                                      INVOCATION                    */ 00794000
         LA    @15,INTF025C                                     04S0449 00795000
         BALR  @14,@15                                          04S0449 00796000
*       IOSERR=OFF;                 /* INDICATE PERMANENT... @G36XREB*/ 00797000
*       IOSEX=ON;                   /* ...ERROR              @G36XREB*/ 00798000
         OI    IOSEX(IOSBPTR),B'00000100'                       04S0451 00799000
         NI    IOSERR(IOSBPTR),B'11011111'                      04S0451 00800000
*       RPARM=IOSBPTR;              /* IOSB ADDRESS          @G36XREB*/ 00801000
         LR    RPARM,IOSBPTR                                    04S0452 00802000
*       REG13=XCTL025C;             /* SYSTEM MSG WRITER ID  @G36XREB*/ 00803000
         LA    REG13,253                                        04S0453 00804000
*       REG14=CVTXTLER;             /* SYSTEM XCTL ROUTINE   @G36XREB*/ 00805000
         L     @07,CVTPTR                                       04S0454 00806000
         L     REG14,CVTXTLER(,@07)                             04S0454 00807000
*       GEN(BR    REG14);           /* XCTL TO MESSAGE WRITER   04S0455 00808000
*                                                            @G36XREB*/ 00809000
         BR    REG14                                                    00810000
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */ 00811000
         B     CE0001@                                          04S0456 00812000
*     END CPET3;                    /* END OF SUBCASE                */ 00813000
*                                                               04S0458 00814000
*     /***************************************************************/ 00815000
*     /*                                                             */ 00816000
*     /* GPROCESS.PROCCASE.CGRETRY: SETS UP GOOD RETRY               */ 00817000
*     /* PROCESSING-EXIT TO IGG019TH VIA ERRROR EXCP WITH ERROR      */ 00818000
*     /* CLEARED--OR EXIT TO IGE0904I FOR MDR PROCESSING WITH ERROR  */ 00819000
*     /* CLEARED.                                                    */ 00820000
*     /*                                                             */ 00821000
*     /***************************************************************/ 00822000
*                                                               04S0458 00823000
*CGRETRY:                                                       04S0458 00824000
*     DO;                           /* SUBCASE GOOD RETRY PROCESSING */ 00825000
CGRETRY  DS    0H                                               04S0459 00826000
*       LCBINCAM=ZERO;              /* RESET RETRY COUNTER           */ 00827000
         SLR   @07,@07                                          04S0459 00828000
         STH   @07,LCBINCAM(,RLCB)                              04S0459 00829000
*       LCBSTART=LCBSTSAV;          /* RESTORE ORIGINAL CP START        00830000
*                                      ADDRESS                       */ 00831000
         MVC   LCBSTART(3,RLCB),LCBSTSAV(RLCB)                  04S0460 00832000
*       IOSERR=RESET;               /* RESET ERP IN CONTROL  @G36XREB*/ 00833000
*       IOSEX=RESET;                /* RESET EXCEPTIONAL CONDITION      00834000
*                                                            @G36XREB*/ 00835000
         NI    IOSERR(IOSBPTR),B'11011011'                      04S0462 00836000
*       RPARM=IOSBPTR;              /* IOSB ADDRESS          @G36XREB*/ 00837000
         LR    RPARM,IOSBPTR                                    04S0463 00838000
*       IF LCBOBRCH^=ZERO           /* IF THERE ARE PIUS ON THE OBR     00839000
*                                      QUEUE                         */ 00840000
*         THEN                                                  04S0464 00841000
         C     @07,LCBOBRCH(,RLCB)                              04S0464 00842000
         BE    @RF00464                                         04S0464 00843000
*         DO;                       /* THEN SETUP PROCESSING OF THEM */ 00844000
*           REG13=XCTL904I;         /* SETUP XCTL TO IGE0904I        */ 00845000
         L     REG13,@CF03160                                   04S0466 00846000
*           REG14=CVTXTLER;         /* SYSTEM XCTL ROUTINE   @G36XREB*/ 00847000
         L     @07,CVTPTR                                       04S0467 00848000
         L     REG14,CVTXTLER(,@07)                             04S0467 00849000
*           GEN(BR    REG14);       /* XCTL TO IGE0904I      @G36XREB*/ 00850000
         BR    REG14                                                    00851000
*         END;                                                  04S0469 00852000
*       ELSE                                                    04S0470 00853000
*         DO;                       /*                       @G36XREB*/ 00854000
         B     @RC00464                                         04S0470 00855000
@RF00464 DS    0H                                               04S0471 00856000
*           SVC(15);                /* ERROR EXCP(RETURNS TO CHANNEL    00857000
*                                      END WITH ERROR CLEARED)  04S0471 00858000
*                                                            @G36XREB*/ 00859000
         SVC   15                                               04S0471 00860000
*           SVC(3);                 /* EXIT SVC              @G36XREB*/ 00861000
         SVC   3                                                04S0472 00862000
*         END;                      /*                       @G36XREB*/ 00863000
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */ 00864000
         B     CE0001@                                          04S0474 00865000
*     END CGRETRY;                  /* END OF SUBCASE                */ 00866000
*                                                               04S0476 00867000
*     /***************************************************************/ 00868000
*     /*                                                             */ 00869000
*     /* GPROCESS.PROCCASE.CMDREXIT: SETS UP MDR EXIT PROCESSING-EXIT*/ 00870000
*     /* TO IGE0904I FOR MDR PROCESSING.                             */ 00871000
*     /*                                                             */ 00872000
*     /***************************************************************/ 00873000
*                                                               04S0476 00874000
*CMDREXIT:                                                      04S0476 00875000
*     DO;                           /* SUBCASE MDR EXIT PROCESSING   */ 00876000
CMDREXIT DS    0H                                               04S0477 00877000
*       IOSEX=RESET;                /* SETUP GOOD RETURN TO IGG019TH    00878000
*                                                            @G36XREB*/ 00879000
         NI    IOSEX(IOSBPTR),B'11111011'                       04S0477 00880000
*       REG13=XCTL904I;             /* SETUP XCTL TO IGE0904I        */ 00881000
         L     REG13,@CF03160                                   04S0478 00882000
*       RPARM=IOSBPTR;              /* IOSB ADDRESS          @G36XREB*/ 00883000
         LR    RPARM,IOSBPTR                                    04S0479 00884000
*       REG14=CVTXTLER;             /* SYSTEM XCTL ROUTINE   @G36XREB*/ 00885000
         L     @07,CVTPTR                                       04S0480 00886000
         L     REG14,CVTXTLER(,@07)                             04S0480 00887000
*       GEN(BR    REG14);           /* XCTL TO IGE0904I      @G36XREB*/ 00888000
         BR    REG14                                                    00889000
*       GOTO CE0001@;               /* BRANCH TO END OF CASE         */ 00890000
         B     CE0001@                                          04S0482 00891000
*     END CMDREXIT;                 /* END OF SUBCASE                */ 00892000
*CE0001@:                                                       03S0484 00893000
*   END;                            /* END OF CASE                   */ 00894000
*                                                               03S0485 00895000
*   /*****************************************************************/ 00896000
*   /*                                                               */ 00897000
*   /* GPROCESS.INTF025C: A SUBROUTINE WHICH SETS UP A PERMANENT     */ 00898000
*   /* ERROR EXIT TO IGE0025C FOR MESSAGE IEA000I AND OBR RECORDING  */ 00899000
*   /* FOR SUBCASES CRETRY AND CPET3.                                */ 00900000
*   /*                                                               */ 00901000
*   /*****************************************************************/ 00902000
*                                                               03S0485 00903000
*INTF025C:                                                      03S0485 00904000
*   PROC OPTIONS(ENTREG,NOPARMREG,RETREG,NOSAVE,NOSAVEAREA);/*  03S0485 00905000
*                                      PROCEDURE TO SETUP PARAMETERS    00906000
*                                      FOR EXIT TO IGE0025C FOR 03S0485 00907000
*                                      MESSAGE IEA000I AND OBR  03S0485 00908000
*                                      RECORDING                     */ 00909000
@EL00001 DS    0H                                               03S0485 00910000
@EF00001 DS    0H                                               03S0485 00911000
@ER00001 BR    @14                                              03S0485 00912000
INTF025C DS    0H                                               03S0486 00913000
*   RFY                                                         03S0486 00914000
*     DSTINDX RSTD;                 /* DEVICE STATISTICS TABLE INDEX    00915000
*                                                            @ZM47653*/ 00916000
*   LCBUNADD=ADDR(UCBNAME);         /* USED BY IEDQNX FOR MESSAGE       00917000
*                                                            @ZM47653*/ 00918000
         L     @07,UCBPTR(,IOSBPTR)                             03S0487 00919000
         LA    @00,UCBNAME(,@07)                                03S0487 00920000
         STCM  @00,7,LCBUNADD(RLCB)                             03S0487 00921000
*   LCBUASZE=LENGTH(UCBNAME);       /* USED BY IEDQNX        @ZM47653*/ 00922000
         MVI   LCBUASZE(RLCB),X'03'                             03S0488 00923000
*   LCBINCAM=ZERO;                  /* RESET RETRY COUNTER           */ 00924000
         SLR   @00,@00                                          03S0489 00925000
         STH   @00,LCBINCAM(,RLCB)                              03S0489 00926000
*   LCBSENS0=LCBSNSV;               /* RESTORE ORIGINAL SENSE DATA   */ 00927000
         MVC   LCBSENS0(1,RLCB),LCBSNSV(RLCB)                   03S0490 00928000
*   LCBCSW=LCBCSWSV;                /* RESTORE ORIGINAL CSW          */ 00929000
         MVC   LCBCSW(7,RLCB),LCBCSWSV(RLCB)                    03S0491 00930000
*   LCBSTART=LCBSTSAV;              /* RESTORE ORIGINAL CP START        00931000
*                                      ADDRESS                       */ 00932000
         MVC   LCBSTART(3,RLCB),LCBSTSAV(RLCB)                  03S0492 00933000
*   LCBECBCC=LCBECB41;              /* SET TCAM PERMANENT ERROR SO      00934000
*                                      THAT IGG019TH WILL DETECT IT     00935000
*                                                            @OY20613*/ 00936000
         MVI   LCBECBCC(RLCB),X'41'                             03S0493 00937000
*   DSTPTR=CVTSTB;                  /* DEVICE STATISTICS TABLE  03S0494 00938000
*                                      ADDRESS               @G36XREB*/ 00939000
         L     @15,CVTPTR                                       03S0494 00940000
         L     DSTPTR,CVTSTB(,@15)                              03S0494 00941000
*   DSTINDX=UCBETI;                 /* DEVICE STAT TABLE INDEX  03S0495 00942000
*                                                            @G36XREB*/ 00943000
         L     @07,UCBEXTPT(,@07)                               03S0495 00944000
         SLR   DSTINDX,DSTINDX                                  03S0495 00945000
         IC    DSTINDX,UCBETI(,@07)                             03S0495 00946000
*   DO WHILE(UCBPTR<DSTPTR->FIXED15);/* FIND DEVICE STAT TABLE ENTRY    00947000
*                                      FOR THIS UCB          @G36XREB*/ 00948000
         B     @DE00496                                         03S0496 00949000
@DL00496 DS    0H                                               03S0497 00950000
*     DSTPTR=DSTPTR+2;              /* INCREMENT POINTER     @G36XREB*/ 00951000
         AL    DSTPTR,@CF00065                                  03S0497 00952000
*     DSTINDX=DSTINDX+256;          /* INCREMENT ENTRY INDEX @G36XREB*/ 00953000
         AL    DSTINDX,@CF01296                                 03S0498 00954000
*   END;                            /*                       @G36XREB*/ 00955000
@DE00496 L     @07,UCBPTR(,IOSBPTR)                             03S0499 00956000
         CH    @07,FIXED15(,DSTPTR)                             03S0499 00957000
         BL    @DL00496                                         03S0499 00958000
*   DSTPTR=DSTPTR+DSTINDX*10;       /* MULTIPLY TO GET ENTRY ADDRESS    00959000
*                                                            @G36XREB*/ 00960000
         LR    @07,DSTINDX                                      03S0500 00961000
         MH    @07,@CH03149                                     03S0500 00962000
         ALR   DSTPTR,@07                                       03S0500 00963000
*   EWTCSIO=DSTPTR->FIXED15;        /* SIO COUNTERS FOR OBR  @G36XREB*/ 00964000
         L     @07,EWAPTR(,IOSBPTR)                             03S0501 00965000
         LH    @00,FIXED15(,DSTPTR)                             03S0501 00966000
         STH   @00,EWTCSIO(,@07)                                03S0501 00967000
*   EWTCSNL=IOSSNS;                 /* SENSE INFO FOR OBR    @G36XREB*/ 00968000
         MVC   EWTCSNL(1,@07),IOSSNS(IOSBPTR)                   03S0502 00969000
*   EWTCCSW=IOSCSW;                 /* CSW TO OBR            @G36XREB*/ 00970000
         MVC   EWTCCSW(7,@07),IOSCSW(IOSBPTR)                   03S0503 00971000
*   EWTCCCW=LCBCSWCA->CCW;          /* INTERRUPTED CCW       @G36XREB*/ 00972000
         L     @15,LCBCSWCA-1(,RLCB)                            03S0504 00973000
         MVC   EWTCCCW(8,@07),CCW(@15)                          03S0504 00974000
*   EWADDISP=ADDR(EWTCSIO);         /* DATA ADDR             @G36XREB*/ 00975000
         LA    @00,EWTCSIO(,@07)                                03S0505 00976000
         STCM  @00,7,EWADDISP(@07)                              03S0505 00977000
*   EWADCNT='1C'X;                  /* DATA SIZE TO OBR      @G36XREB*/ 00978000
         MVI   EWADCNT(@07),X'1C'                               03S0506 00979000
*   IOSLOG=ON;                      /* WRITE OBR RECORD      @G36XREB*/ 00980000
*   IOSMSG=ON;                      /* WRITE I/O ERROR MESSAGE  03S0508 00981000
*                                                            @G36XREB*/ 00982000
         OI    IOSLOG(IOSBPTR),B'00000101'                      03S0508 00983000
*   RFY                                                         03S0509 00984000
*     DSTINDX UNRSTD;               /*                       @ZM47653*/ 00985000
*   END INTF025C;                                               03S0510 00986000
@EL00002 DS    0H                                               03S0510 00987000
@EF00002 DS    0H                                               03S0510 00988000
@ER00002 BR    @14                                              03S0510 00989000
*   END IGE0004I                                                01S0511 00990000
*                                                               01S0511 00991000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00992000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00993000
*/*%INCLUDE SYSLIB  (TCCWD   )                                       */ 00994000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00995000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00996000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00997000
*/*%INCLUDE SYSLIB  (TDEBD   )                                       */ 00998000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00999000
*/*%INCLUDE SYSLIB  (EWAMAP  )                                       */ 01000000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 01001000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01002000
*/*%INCLUDE SYSLIB  (TRQED   )                                       */ 01003000
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */ 01004000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01005000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 01006000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 01007000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 01008000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 01009000
*/*%INCLUDE SYSUT5  (GPROCESS)                                       */ 01010000
*/*%INCLUDE SYSUT5  (GETTTE  )                                       */ 01011000
*/*%INCLUDE SYSUT5  (CONDTEST)                                       */ 01012000
*/*%INCLUDE SYSUT5  (CONVRV  )                                       */ 01013000
*/*%INCLUDE SYSUT5  (INITPROC)                                       */ 01014000
*/*%INCLUDE SYSUT5  (CONDSIO3)                                       */ 01015000
*/*%INCLUDE SYSUT5  (CONDOTHR)                                       */ 01016000
*/*%INCLUDE SYSUT5  (PROCCASE)                                       */ 01017000
*/*%INCLUDE SYSUT5  (CRETRY  )                                       */ 01018000
*/*%INCLUDE SYSUT5  (CPET1   )                                       */ 01019000
*/*%INCLUDE SYSUT5  (CPET2   )                                       */ 01020000
*/*%INCLUDE SYSUT5  (CPET3   )                                       */ 01021000
*/*%INCLUDE SYSUT5  (CGRETRY )                                       */ 01022000
*/*%INCLUDE SYSUT5  (CMDREXIT)                                       */ 01023000
*/*%INCLUDE SYSUT5  (INTF025C)                                       */ 01024000
*                                                               01S0511 01025000
*       ;                                                       01S0511 01026000
@DATA    DS    0H                                                       01027000
@CH03149 DC    H'10'                                                    01028000
@DATD    DSECT                                                          01029000
         DS    0F                                                       01030000
IGE0004I CSECT                                                          01031000
         DS    0F                                                       01032000
@CF00065 DC    F'2'                                                     01033000
@CF00074 DC    F'3'                                                     01034000
@CF00045 DC    F'8'                                                     01035000
@CF02512 DC    F'14'                                                    01036000
@CF01296 DC    F'256'                                                   01037000
@CF03160 DC    F'9049'                                                  01038000
@CF03226 DC    F'-8'                                                    01039000
@CF03224 DC    XL4'0000FFFF'                                            01040000
@DATD    DSECT                                                          01041000
         DS    0D                                                       01042000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01043000
@ENDDATD EQU   *                                                        01044000
IGE0004I CSECT                                                          01045000
         DS    0F                                                       01046000
@SIZDATD DC    AL1(0)                                                   01047000
         DC    AL3(@ENDDATD-@DATD)                                      01048000
         DS    0D                                                       01049000
MSG064L  DS    CL49                                                     01050000
         ORG   MSG064L                                                  01051000
M064LENL DC    AL2(49)                                                  01052000
M064FLGL DC    AL2(0)                                                   01053000
M064TXTL DC    CL45'IED064I LINE XXX CONTROL UNIT NOT OPERATIONAL'      01054000
         ORG   MSG064L+49                                               01055000
         DS    CL3                                                      01056000
CP0001@  DC    AL4(CRETRY)                                              01057000
         DC    AL4(CPET1)                                               01058000
         DC    AL4(CPET2)                                               01059000
         DC    AL4(CPET3)                                               01060000
         DC    AL4(CGRETRY)                                             01061000
         DC    AL4(CMDREXIT)                                            01062000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01063000
@01      EQU   01                                                       01064000
@02      EQU   02                                                       01065000
@03      EQU   03                                                       01066000
@04      EQU   04                                                       01067000
@05      EQU   05                                                       01068000
@06      EQU   06                                                       01069000
@07      EQU   07                                                       01070000
@08      EQU   08                                                       01071000
@09      EQU   09                                                       01072000
@10      EQU   10                                                       01073000
@11      EQU   11                                                       01074000
@12      EQU   12                                                       01075000
@13      EQU   13                                                       01076000
@14      EQU   14                                                       01077000
@15      EQU   15                                                       01078000
IEDQAPTR EQU   @01                                                      01079000
DCBPTR   EQU   @02                                                      01080000
IOSBPTR  EQU   @06                                                      01081000
IEDQLPTR EQU   @01                                                      01082000
LCBXPTR  EQU   @05                                                      01083000
RTRM     EQU   @08                                                      01084000
RAVT     EQU   @13                                                      01085000
RLCB     EQU   @04                                                      01086000
RCCW     EQU   @11                                                      01087000
REG00    EQU   @00                                                      01088000
REG01    EQU   @01                                                      01089000
RPARM    EQU   @01                                                      01090000
RPROC    EQU   @02                                                      01091000
DSTPTR   EQU   @02                                                      01092000
RTCX     EQU   @03                                                      01093000
DSTINDX  EQU   @05                                                      01094000
RINT     EQU   @09                                                      01095000
REG10    EQU   @10                                                      01096000
RBASE    EQU   @12                                                      01097000
REG13    EQU   @13                                                      01098000
REG14    EQU   @14                                                      01099000
REG15    EQU   @15                                                      01100000
IEDQTPTR EQU   @01                                                      01101000
REG02    EQU   @02                                                      01102000
REG03    EQU   @03                                                      01103000
REG04    EQU   @04                                                      01104000
REG05    EQU   @05                                                      01105000
REG06    EQU   @06                                                      01106000
REG07    EQU   @07                                                      01107000
REG08    EQU   @08                                                      01108000
REG09    EQU   @09                                                      01109000
REG11    EQU   @11                                                      01110000
REG12    EQU   @12                                                      01111000
UCBDCPTR EQU   @01                                                      01112000
CVTPTR   EQU   16                                                       01113000
PSA      EQU   0                                                        01114000
FLCRNPSW EQU   PSA                                                      01115000
FLCROPSW EQU   PSA+8                                                    01116000
FLCICCW2 EQU   PSA+16                                                   01117000
PSAEEPSW EQU   PSA+132                                                  01118000
PSAESPSW EQU   PSA+136                                                  01119000
FLCSVILC EQU   PSAESPSW+1                                               01120000
PSAEPPSW EQU   PSA+140                                                  01121000
FLCPIILC EQU   PSAEPPSW+1                                               01122000
FLCPICOD EQU   PSAEPPSW+2                                               01123000
PSAPICOD EQU   FLCPICOD+1                                               01124000
FLCTEA   EQU   PSAEPPSW+4                                               01125000
FLCPER   EQU   PSA+152                                                  01126000
FLCMCLA  EQU   PSA+168                                                  01127000
FLCIOEL  EQU   FLCMCLA+4                                                01128000
FLCIOA   EQU   FLCMCLA+16                                               01129000
FLCFSA   EQU   FLCMCLA+80                                               01130000
PSASUPER EQU   PSA+552                                                  01131000
PSASUP1  EQU   PSASUPER                                                 01132000
PSASUP2  EQU   PSASUPER+1                                               01133000
PSASUP3  EQU   PSASUPER+2                                               01134000
PSASUP4  EQU   PSASUPER+3                                               01135000
PSACLHT  EQU   PSA+640                                                  01136000
PSALKSA  EQU   PSA+696                                                  01137000
PSAHLHI  EQU   PSA+760                                                  01138000
PSALITA  EQU   PSA+764                                                  01139000
PSADSSFL EQU   PSA+836                                                  01140000
PSADSSF1 EQU   PSADSSFL                                                 01141000
PSADSSF3 EQU   PSADSSFL+2                                               01142000
PSADSSF4 EQU   PSADSSFL+3                                               01143000
PSARSVT  EQU   PSA+896                                                  01144000
IEDQAVTD EQU   0                                                        01145000
AVTSAVEX EQU   IEDQAVTD+288                                             01146000
AVTREADD EQU   IEDQAVTD+380                                             01147000
AVTBUFSW EQU   IEDQAVTD+384                                             01148000
@NM00004 EQU   IEDQAVTD+388                                             01149000
AVTCKFLG EQU   @NM00004                                                 01150000
AVTBASE  EQU   IEDQAVTD+412                                             01151000
AVTPKF   EQU   AVTBASE                                                  01152000
AVTRNMPT EQU   IEDQAVTD+424                                             01153000
AVTOSECB EQU   IEDQAVTD+492                                             01154000
AVTECB1  EQU   AVTOSECB                                                 01155000
AVTHG02  EQU   IEDQAVTD+528                                             01156000
AVTDISP  EQU   IEDQAVTD+552                                             01157000
AVTHD    EQU   IEDQAVTD+556                                             01158000
AVTSCOPT EQU   AVTHD                                                    01159000
AVTSAVTP EQU   IEDQAVTD+612                                             01160000
AVTSAVTF EQU   AVTSAVTP                                                 01161000
AVTIOT   EQU   IEDQAVTD+640                                             01162000
AVTCKPEL EQU   IEDQAVTD+652                                             01163000
AVTCKRMV EQU   AVTCKPEL                                                 01164000
AVTCKELF EQU   IEDQAVTD+680                                             01165000
AVTCKBYT EQU   IEDQAVTD+691                                             01166000
AVTHG01  EQU   IEDQAVTD+692                                             01167000
AVTCKLNK EQU   IEDQAVTD+696                                             01168000
AVTCRELE EQU   IEDQAVTD+708                                             01169000
AVTCCELE EQU   AVTCRELE                                                 01170000
AVTCLRHI EQU   IEDQAVTD+716                                             01171000
AVTADBUF EQU   IEDQAVTD+720                                             01172000
AVTSYSER EQU   IEDQAVTD+728                                             01173000
AVTBFRFG EQU   IEDQAVTD+784                                             01174000
AVTCKPQB EQU   IEDQAVTD+804                                             01175000
AVTCKPTB EQU   AVTCKPQB                                                 01176000
AVTCKPEC EQU   AVTCKPQB+4                                               01177000
AVTCKPCC EQU   AVTCKPEC                                                 01178000
AVTOPCQB EQU   IEDQAVTD+816                                             01179000
AVTOPCOB EQU   AVTOPCQB                                                 01180000
AVTOPCEC EQU   AVTOPCQB+4                                               01181000
AVTOPCCC EQU   AVTOPCEC                                                 01182000
AVTOLTQB EQU   IEDQAVTD+828                                             01183000
AVTCWFL1 EQU   IEDQAVTD+924                                             01184000
AVTCWFL2 EQU   IEDQAVTD+925                                             01185000
AVTSUBT  EQU   IEDQAVTD+948                                             01186000
AVTIOTR  EQU   IEDQAVTD+949                                             01187000
AVTBIT1  EQU   IEDQAVTD+1050                                            01188000
AVTBIT2  EQU   IEDQAVTD+1051                                            01189000
AVTBIT3  EQU   IEDQAVTD+1052                                            01190000
AVTBIT4  EQU   IEDQAVTD+1136                                            01191000
@NM00086 EQU   IEDQAVTD+1232                                            01192000
IEDNSVTD EQU   0                                                        01193000
SAVTDIAG EQU   IEDNSVTD                                                 01194000
SAVTDIAF EQU   SAVTDIAG                                                 01195000
SAVTLUSQ EQU   IEDNSVTD+88                                              01196000
SAVTTCPU EQU   IEDNSVTD+238                                             01197000
SAVTZELM EQU   IEDNSVTD+270                                             01198000
SAVTRDRV EQU   IEDNSVTD+284                                             01199000
SAVTCKQB EQU   IEDNSVTD+300                                             01200000
SAVTCKTB EQU   SAVTCKQB                                                 01201000
SAVTCKEC EQU   SAVTCKQB+4                                               01202000
SAVTCKCC EQU   SAVTCKEC                                                 01203000
IEDQCCW  EQU   0                                                        01204000
CCW      EQU   IEDQCCW                                                  01205000
CCWOPCDE EQU   CCW                                                      01206000
CCWADDR  EQU   CCW+1                                                    01207000
CCWFLAGS EQU   CCW+4                                                    01208000
CCWCD    EQU   CCWFLAGS                                                 01209000
CCWCC    EQU   CCWFLAGS                                                 01210000
CVTMAP   EQU   0                                                        01211000
CVTXTLER EQU   CVTMAP+44                                                01212000
CVTDAR   EQU   CVTMAP+72                                                01213000
CVTFLGS1 EQU   CVTDAR                                                   01214000
CVTSTB   EQU   CVTMAP+112                                               01215000
CVTDCB   EQU   CVTMAP+116                                               01216000
CVTIOQET EQU   CVTMAP+120                                               01217000
CVTIERLC EQU   CVTMAP+144                                               01218000
CVTHEAD  EQU   CVTMAP+160                                               01219000
CVTSV76C EQU   CVTHEAD                                                  01220000
CVTOPTA  EQU   CVTMAP+182                                               01221000
CVTOPTB  EQU   CVTMAP+183                                               01222000
CVTGTF   EQU   CVTMAP+236                                               01223000
CVTGTFST EQU   CVTGTF                                                   01224000
CVTGTFS  EQU   CVTGTFST                                                 01225000
CVTSTATE EQU   CVTGTFST                                                 01226000
CVTTMODE EQU   CVTGTFST                                                 01227000
CVTFORM  EQU   CVTGTFST                                                 01228000
CVTAQAVT EQU   CVTMAP+240                                               01229000
CVTTCMFG EQU   CVTAQAVT                                                 01230000
CVTVOLM2 EQU   CVTMAP+244                                               01231000
CVTTATA  EQU   CVTVOLM2                                                 01232000
CVTTSKS  EQU   CVTTATA                                                  01233000
CVTVOLF2 EQU   CVTTSKS                                                  01234000
CVTTAT   EQU   CVTTATA+1                                                01235000
CVTATER  EQU   CVTMAP+248                                               01236000
CVTEXT1  EQU   CVTMAP+252                                               01237000
CVTPURG  EQU   CVTMAP+260                                               01238000
CVTQMSG  EQU   CVTMAP+268                                               01239000
CVTDMSR  EQU   CVTMAP+272                                               01240000
CVTRSV37 EQU   CVTDMSR                                                  01241000
CVTDMSRF EQU   CVTRSV37                                                 01242000
CVTPTRV  EQU   CVTMAP+288                                               01243000
CVTERPV  EQU   CVTMAP+316                                               01244000
CVTINTLA EQU   CVTMAP+320                                               01245000
CVTAPF   EQU   CVTMAP+324                                               01246000
CVTEXT2  EQU   CVTMAP+328                                               01247000
CVTHJES  EQU   CVTMAP+332                                               01248000
CVTPGSIA EQU   CVTMAP+348                                               01249000
CVTA1F1  EQU   CVTMAP+356                                               01250000
CVTSYSK  EQU   CVTMAP+357                                               01251000
CVTVOLM1 EQU   CVTMAP+380                                               01252000
CVTVOLF1 EQU   CVTVOLM1                                                 01253000
CVTATMCT EQU   CVTMAP+388                                               01254000
CVTXTNT1 EQU   0                                                        01255000
CVTXTNT2 EQU   0                                                        01256000
CVTDSSV  EQU   CVTXTNT2                                                 01257000
CVTFLGBT EQU   CVTXTNT2+5                                               01258000
CVTQID   EQU   CVTXTNT2+24                                              01259000
CVTRV400 EQU   CVTXTNT2+52                                              01260000
CVTRV409 EQU   CVTXTNT2+53                                              01261000
CVTATCVT EQU   CVTXTNT2+64                                              01262000
CVTRV429 EQU   CVTXTNT2+84                                              01263000
CVTRV438 EQU   CVTXTNT2+85                                              01264000
CVTRV457 EQU   CVTXTNT2+112                                             01265000
CVTRV466 EQU   CVTXTNT2+113                                             01266000
CVTFIX   EQU   0                                                        01267000
CVTRELNO EQU   CVTFIX+252                                               01268000
IHADCB   EQU   0                                                        01269000
IHADCS1A EQU   0                                                        01270000
DCBBCKUP EQU   IHADCS1A+8                                               01271000
IHADCS2K EQU   0                                                        01272000
DCBDUMPD EQU   IHADCS2K                                                 01273000
DCBTRSTA EQU   IHADCS2K+5                                               01274000
DCBDSORG EQU   IHADCS2K+6                                               01275000
DCBDSRG2 EQU   DCBDSORG+1                                               01276000
DCBRNCKD EQU   IHADCS2K+12                                              01277000
DCBEXLST EQU   IHADCS2K+16                                              01278000
DCBEIOBX EQU   DCBEXLST                                                 01279000
IHADCS24 EQU   0                                                        01280000
DCBOFLGS EQU   IHADCS24+8                                               01281000
DCBOFLWR EQU   DCBOFLGS                                                 01282000
DCBIFLG  EQU   IHADCS24+9                                               01283000
DCBIBPCT EQU   DCBIFLG                                                  01284000
DCBMACR  EQU   IHADCS24+10                                              01285000
DCBMACR1 EQU   DCBMACR                                                  01286000
DCBMRFE  EQU   DCBMACR1                                                 01287000
DCBMRGET EQU   DCBMRFE                                                  01288000
DCBMRAPG EQU   DCBMACR1                                                 01289000
DCBMRRD  EQU   DCBMRAPG                                                 01290000
DCBMRCI  EQU   DCBMACR1                                                 01291000
DCBMRMVG EQU   DCBMRCI                                                  01292000
DCBMRLCG EQU   DCBMACR1                                                 01293000
DCBMRABC EQU   DCBMACR1                                                 01294000
DCBMRPT1 EQU   DCBMRABC                                                 01295000
DCBMRSBG EQU   DCBMRPT1                                                 01296000
DCBMRCRL EQU   DCBMACR1                                                 01297000
DCBMRCHK EQU   DCBMRCRL                                                 01298000
DCBMRRDX EQU   DCBMRCHK                                                 01299000
DCBMRDMG EQU   DCBMACR1                                                 01300000
DCBMACR2 EQU   DCBMACR+1                                                01301000
DCBMRPUT EQU   DCBMACR2                                                 01302000
DCBMRWRT EQU   DCBMACR2                                                 01303000
DCBMRMVP EQU   DCBMACR2                                                 01304000
DCBMR5WD EQU   DCBMACR2                                                 01305000
DCBMRLDM EQU   DCBMR5WD                                                 01306000
DCBMRLCP EQU   DCBMRLDM                                                 01307000
DCBMR4WD EQU   DCBMACR2                                                 01308000
DCBMRPT2 EQU   DCBMR4WD                                                 01309000
DCBMRTMD EQU   DCBMRPT2                                                 01310000
DCBMR3WD EQU   DCBMACR2                                                 01311000
DCBMRCTL EQU   DCBMR3WD                                                 01312000
DCBMRSTK EQU   DCBMRCTL                                                 01313000
DCBMR1WD EQU   DCBMACR2                                                 01314000
DCBMRSWA EQU   DCBMR1WD                                                 01315000
DCBMRDMD EQU   DCBMRSWA                                                 01316000
IHADCS25 EQU   0                                                        01317000
DCBMACRF EQU   IHADCS25+2                                               01318000
DCBMACF1 EQU   DCBMACRF                                                 01319000
DCBMFFE  EQU   DCBMACF1                                                 01320000
DCBMFGET EQU   DCBMFFE                                                  01321000
DCBMFAPG EQU   DCBMACF1                                                 01322000
DCBMFRD  EQU   DCBMFAPG                                                 01323000
DCBMFCI  EQU   DCBMACF1                                                 01324000
DCBMFMVG EQU   DCBMFCI                                                  01325000
DCBMFLCG EQU   DCBMACF1                                                 01326000
DCBMFABC EQU   DCBMACF1                                                 01327000
DCBMFPT1 EQU   DCBMFABC                                                 01328000
DCBMFSBG EQU   DCBMFPT1                                                 01329000
DCBMFCRL EQU   DCBMACF1                                                 01330000
DCBMFCHK EQU   DCBMFCRL                                                 01331000
DCBMFDMG EQU   DCBMACF1                                                 01332000
DCBMACF2 EQU   DCBMACRF+1                                               01333000
DCBMFPUT EQU   DCBMACF2                                                 01334000
DCBMFWRT EQU   DCBMACF2                                                 01335000
DCBMFMVP EQU   DCBMACF2                                                 01336000
DCBMF5WD EQU   DCBMACF2                                                 01337000
DCBMFLDM EQU   DCBMF5WD                                                 01338000
DCBMFLCP EQU   DCBMFLDM                                                 01339000
DCBMF4WD EQU   DCBMACF2                                                 01340000
DCBMFPT2 EQU   DCBMF4WD                                                 01341000
DCBMFTMD EQU   DCBMFPT2                                                 01342000
DCBMF3WD EQU   DCBMACF2                                                 01343000
DCBMFCTL EQU   DCBMF3WD                                                 01344000
DCBMFSTK EQU   DCBMFCTL                                                 01345000
DCBMF1WD EQU   DCBMACF2                                                 01346000
DCBMFSWA EQU   DCBMF1WD                                                 01347000
DCBMFDMD EQU   DCBMFSWA                                                 01348000
DCBDEBAD EQU   IHADCS25+4                                               01349000
DCBIFLGS EQU   DCBDEBAD                                                 01350000
DCBIFPCT EQU   DCBIFLGS                                                 01351000
IHADCS27 EQU   0                                                        01352000
DCBGET   EQU   IHADCS27                                                 01353000
DCBPUT   EQU   DCBGET                                                   01354000
DCBGETA  EQU   DCBPUT+1                                                 01355000
IHADCS43 EQU   0                                                        01356000
DCBSCTAB EQU   IHADCS43                                                 01357000
IEDQDEB  EQU   0                                                        01358000
DEBPRF   EQU   IEDQDEB                                                  01359000
DEBAPVT  EQU   DEBPRF                                                   01360000
DEBSIOA  EQU   DEBAPVT+4                                                01361000
DEBNMEXT EQU   IEDQDEB+52                                               01362000
DEBUCBS  EQU   IEDQDEB+68                                               01363000
IOSB     EQU   0                                                        01364000
IOSFLA   EQU   IOSB                                                     01365000
IOSACHN  EQU   IOSFLA                                                   01366000
IOSERR   EQU   IOSFLA                                                   01367000
IOSEX    EQU   IOSFLA                                                   01368000
IOSFLB   EQU   IOSB+1                                                   01369000
IOSMSG   EQU   IOSFLB                                                   01370000
IOSLOG   EQU   IOSFLB                                                   01371000
IOSFLC   EQU   IOSB+2                                                   01372000
IOSDVALT EQU   IOSFLC                                                   01373000
IOSPKEY  EQU   IOSB+12                                                  01374000
IOSCOD   EQU   IOSB+13                                                  01375000
IOSOPT   EQU   IOSB+14                                                  01376000
IOSOPT2  EQU   IOSB+15                                                  01377000
IOSUCB   EQU   IOSB+16                                                  01378000
@NM00120 EQU   IOSB+20                                                  01379000
IOSCC    EQU   @NM00120                                                 01380000
IOSCSW   EQU   @NM00120+1                                               01381000
IOSCSWCA EQU   IOSCSW                                                   01382000
IOSTATUS EQU   IOSCSW+3                                                 01383000
IOSUSE   EQU   IOSB+32                                                  01384000
IOSSNS   EQU   IOSB+42                                                  01385000
IOSIPIB  EQU   IOSB+44                                                  01386000
IOSERP   EQU   IOSB+52                                                  01387000
IOSRST   EQU   IOSB+72                                                  01388000
IOSVST   EQU   IOSB+76                                                  01389000
IOSDSID  EQU   IOSB+80                                                  01390000
IOSPATH  EQU   IOSB+86                                                  01391000
IOSCHN   EQU   IOSPATH                                                  01392000
IOSCKEY  EQU   IOSB+89                                                  01393000
IOSEEKA  EQU   IOSB+100                                                 01394000
IOSCCHH  EQU   IOSEEKA+3                                                01395000
IOSSKHH  EQU   IOSCCHH+2                                                01396000
EWA      EQU   0                                                        01397000
EWAHDR   EQU   EWA                                                      01398000
EWAFLAGS EQU   EWA+4                                                    01399000
EWAFLG1  EQU   EWAFLAGS                                                 01400000
EWASCCD  EQU   EWAFLG1                                                  01401000
EWASCC3  EQU   EWASCCD                                                  01402000
EWAFLG2  EQU   EWAFLAGS+1                                               01403000
EWAFLG3  EQU   EWAFLAGS+2                                               01404000
EWASNSCT EQU   EWAFLAGS+3                                               01405000
EWACNTRS EQU   EWA+10                                                   01406000
EWAERPIB EQU   EWA+16                                                   01407000
EWARGFG1 EQU   EWAERPIB+4                                               01408000
EWARGFG2 EQU   EWAERPIB+5                                               01409000
EWAXCSW1 EQU   EWAERPIB+6                                               01410000
EWAXCSW2 EQU   EWAERPIB+7                                               01411000
EWADCNT  EQU   EWA+28                                                   01412000
EWADDISP EQU   EWA+29                                                   01413000
EWAIERP  EQU   EWA+32                                                   01414000
IEDQLCB  EQU   0                                                        01415000
LCBRCB   EQU   IEDQLCB                                                  01416000
LCBTSOB  EQU   IEDQLCB+19                                               01417000
LCBCHAIN EQU   IEDQLCB+20                                               01418000
LCBSCRNN EQU   LCBCHAIN                                                 01419000
LCBTETEN EQU   LCBCHAIN                                                 01420000
LCBINSRC EQU   IEDQLCB+21                                               01421000
LCBLKMDE EQU   LCBINSRC+2                                               01422000
LCBNTXT  EQU   IEDQLCB+24                                               01423000
LCBSTAT4 EQU   LCBNTXT                                                  01424000
LCBPHASE EQU   LCBSTAT4                                                 01425000
LCBSCBDA EQU   IEDQLCB+25                                               01426000
LCBMHA   EQU   IEDQLCB+29                                               01427000
LCBFLAG1 EQU   IEDQLCB+32                                               01428000
LCBIOBSN EQU   IEDQLCB+33                                               01429000
LCBFLAG2 EQU   LCBIOBSN                                                 01430000
LCBSNS   EQU   LCBIOBSN+1                                               01431000
LCBSENS0 EQU   LCBSNS                                                   01432000
LCBCMDRJ EQU   LCBSENS0                                                 01433000
LCBINTRQ EQU   LCBSENS0                                                 01434000
LCBBUSCK EQU   LCBSENS0                                                 01435000
LCBEQUCK EQU   LCBSENS0                                                 01436000
LCBDATCK EQU   LCBSENS0                                                 01437000
LCBOVRUN EQU   LCBSENS0                                                 01438000
LCBLOSDT EQU   LCBSENS0                                                 01439000
LCBNOTIN EQU   LCBLOSDT                                                 01440000
LCBTMOUT EQU   LCBSENS0                                                 01441000
LCBECBCC EQU   LCBIOBSN+3                                               01442000
LCBFLAG3 EQU   LCBIOBSN+7                                               01443000
LCBRLAD  EQU   LCBFLAG3                                                 01444000
LCBCSW   EQU   LCBIOBSN+8                                               01445000
LCBCSWCA EQU   LCBCSW                                                   01446000
LCBCSWST EQU   LCBCSW+3                                                 01447000
LCBCSWUS EQU   LCBCSWST                                                 01448000
LCBUSUC  EQU   LCBCSWUS                                                 01449000
LCBCSWCS EQU   LCBCSWST+1                                               01450000
LCBCSPCI EQU   LCBCSWCS                                                 01451000
LCBCSIL  EQU   LCBCSWCS                                                 01452000
LCBCSPGC EQU   LCBCSWCS                                                 01453000
LCBCSPTC EQU   LCBCSWCS                                                 01454000
LCBCSCDC EQU   LCBCSWCS                                                 01455000
LCBCSCCC EQU   LCBCSWCS                                                 01456000
LCBCSICC EQU   LCBCSWCS                                                 01457000
LCBCSCHC EQU   LCBCSWCS                                                 01458000
LCBSIOCC EQU   LCBIOBSN+15                                              01459000
LCBSIOC1 EQU   LCBSIOCC                                                 01460000
LCBSIOC2 EQU   LCBSIOCC                                                 01461000
LCBSTART EQU   LCBIOBSN+16                                              01462000
LCBDCBPT EQU   IEDQLCB+52                                               01463000
LCBRCQCB EQU   IEDQLCB+56                                               01464000
LCBRESTR EQU   LCBRCQCB                                                 01465000
LCBTHSQ  EQU   IEDQLCB+60                                               01466000
LCBINCAM EQU   LCBTHSQ                                                  01467000
LCBERRCT EQU   IEDQLCB+62                                               01468000
LCBLSPCI EQU   IEDQLCB+65                                               01469000
LCBRCBFR EQU   LCBLSPCI                                                 01470000
LCBSTATE EQU   IEDQLCB+70                                               01471000
LCBSTAT1 EQU   LCBSTATE                                                 01472000
LCBSENDN EQU   LCBSTAT1                                                 01473000
LCBSTAT2 EQU   LCBSTATE+1                                               01474000
LCBBEOTN EQU   LCBSTAT2                                                 01475000
LCBSYNC  EQU   LCBSTAT2                                                 01476000
LCBDIAL  EQU   LCBSTAT2                                                 01477000
LCBTSTSW EQU   IEDQLCB+72                                               01478000
LCBERB   EQU   IEDQLCB+76                                               01479000
LCBERBST EQU   IEDQLCB+84                                               01480000
LCBDLNKN EQU   LCBERBST                                                 01481000
LCBERBCT EQU   IEDQLCB+88                                               01482000
LCBRBCT2 EQU   LCBERBCT+1                                               01483000
LCBTTCIN EQU   IEDQLCB+90                                               01484000
LCBMSGFM EQU   IEDQLCB+92                                               01485000
LCBOBRCH EQU   IEDQLCB+96                                               01486000
LCBINVPT EQU   LCBOBRCH+1                                               01487000
LCBBFRW  EQU   LCBINVPT                                                 01488000
LCBTPCD  EQU   IEDQLCB+100                                              01489000
LCBSTAT5 EQU   LCBTPCD                                                  01490000
LCBSTAT6 EQU   LCBTPCD+4                                                01491000
LCBRSPSV EQU   LCBTPCD+8                                                01492000
LCBSAVSN EQU   IEDQLCB+112                                              01493000
LCBSNSV  EQU   LCBSAVSN                                                 01494000
LCBCSWSV EQU   LCBSAVSN+1                                               01495000
LCBERCCW EQU   IEDQLCB+120                                              01496000
LCBCPA   EQU   IEDQLCB+144                                              01497000
LCBCCW2  EQU   LCBCPA+8                                                 01498000
LCBCCW3  EQU   LCBCPA+16                                                01499000
LCBCCW4  EQU   LCBCPA+24                                                01500000
LCBCCW5  EQU   LCBCPA+32                                                01501000
LCBATTEL EQU   LCBCCW5                                                  01502000
LCBQEBPL EQU   LCBATTEL                                                 01503000
LCBCCW7  EQU   LCBCPA+48                                                01504000
IEDQLCBX EQU   0                                                        01505000
LCBXCON  EQU   IEDQLCBX                                                 01506000
LCBXFLAG EQU   LCBXCON                                                  01507000
LCBXDCT  EQU   LCBXCON+1                                                01508000
LCBXRADR EQU   LCBXCON+4                                                01509000
IEDRQE   EQU   0                                                        01510000
RQEUCB   EQU   IEDRQE+2                                                 01511000
RQEIOB   EQU   IEDRQE+5                                                 01512000
RRQE     EQU   0                                                        01513000
IEDQTCXD EQU   0                                                        01514000
TCXAVT   EQU   IEDQTCXD                                                 01515000
TCXATTEN EQU   IEDQTCXD+4                                               01516000
TCXFLAG1 EQU   IEDQTCXD+34                                              01517000
TCXCC3TS EQU   IEDQTCXD+35                                              01518000
TCXBUFA  EQU   IEDQTCXD+80                                              01519000
TCXDSAVE EQU   IEDQTCXD+104                                             01520000
TCXERPPM EQU   IEDQTCXD+128                                             01521000
TCXESAVE EQU   IEDQTCXD+132                                             01522000
TCXQE8   EQU   IEDQTCXD+216                                             01523000
IEDTRM   EQU   0                                                        01524000
IEDNTRM  EQU   IEDTRM                                                   01525000
TRMBYTE4 EQU   IEDNTRM                                                  01526000
TRMBYTE3 EQU   IEDNTRM+1                                                01527000
TRMBYTE2 EQU   IEDNTRM+2                                                01528000
TRMINPG  EQU   TRMBYTE2                                                 01529000
TRMBYTE1 EQU   IEDNTRM+3                                                01530000
TRMSCPRQ EQU   TRMBYTE1                                                 01531000
TRMBYTE0 EQU   IEDNTRM+6                                                01532000
TRMSIBPT EQU   IEDNTRM+7                                                01533000
IEDQTRM  EQU   IEDTRM+14                                                01534000
TRMSTATE EQU   IEDQTRM                                                  01535000
TRMLOG   EQU   TRMSTATE                                                 01536000
TRMINSEQ EQU   IEDQTRM+4                                                01537000
TLISTCNT EQU   TRMINSEQ                                                 01538000
TRMOUTSQ EQU   IEDQTRM+6                                                01539000
TLISTEN  EQU   TRMOUTSQ                                                 01540000
TRMDSORG EQU   TLISTEN                                                  01541000
TRMALTD  EQU   IEDQTRM+8                                                01542000
TRMDEVFL EQU   IEDQTRM+10                                               01543000
TRMSTAT  EQU   IEDQTRM+12                                               01544000
UCB      EQU   0                                                        01545000
UCBOB    EQU   0                                                        01546000
UCBJBNR  EQU   UCBOB                                                    01547000
UCBFL5   EQU   UCBOB+1                                                  01548000
UCBAF    EQU   UCBFL5                                                   01549000
UCBSTAT  EQU   UCBOB+3                                                  01550000
UCBCHAN  EQU   UCBOB+4                                                  01551000
UCBSFLS  EQU   UCBOB+6                                                  01552000
UCBFLA   EQU   UCBSFLS                                                  01553000
UCBFL1   EQU   UCBFLA                                                   01554000
UCBBSY   EQU   UCBFL1                                                   01555000
UCBNRY   EQU   UCBFL1                                                   01556000
UCBPST   EQU   UCBFL1                                                   01557000
UCBCUB   EQU   UCBFL1                                                   01558000
UCBFLB   EQU   UCBSFLS+1                                                01559000
UCBCHM   EQU   UCBOB+8                                                  01560000
UCBCHM1  EQU   UCBCHM                                                   01561000
UCBPTH0  EQU   UCBCHM1                                                  01562000
UCBPTH1  EQU   UCBCHM1                                                  01563000
UCBWGT   EQU   UCBOB+12                                                 01564000
UCBNAME  EQU   UCBOB+13                                                 01565000
UCBTYP   EQU   UCBOB+16                                                 01566000
UCBTBYT1 EQU   UCBTYP                                                   01567000
UCB1FEA5 EQU   UCBTBYT1                                                 01568000
UCB1FEA6 EQU   UCBTBYT1                                                 01569000
UCBTBYT2 EQU   UCBTYP+1                                                 01570000
UCB2OPT2 EQU   UCBTBYT2                                                 01571000
UCBDUDN1 EQU   UCB2OPT2                                                 01572000
UCB2OPT3 EQU   UCBTBYT2                                                 01573000
UCBDUDN2 EQU   UCB2OPT3                                                 01574000
UCB2OPT4 EQU   UCBTBYT2                                                 01575000
UCBRWTAU EQU   UCB2OPT4                                                 01576000
UCB2OPT6 EQU   UCBTBYT2                                                 01577000
UCB2OPT7 EQU   UCBTBYT2                                                 01578000
UCBTBYT3 EQU   UCBTYP+2                                                 01579000
UCBDVCLS EQU   UCBTBYT3                                                 01580000
UCBTBYT4 EQU   UCBTYP+3                                                 01581000
UCBEXTPT EQU   UCBOB+20                                                 01582000
UCBFLC   EQU   UCBEXTPT                                                 01583000
UCBDEV   EQU   UCBOB+24                                                 01584000
UCBCMEXT EQU   0                                                        01585000
UCBETI   EQU   UCBCMEXT                                                 01586000
UCBATI   EQU   UCBCMEXT+3                                               01587000
@NM00211 EQU   UCBATI                                                   01588000
UCBFLP1  EQU   UCBCMEXT+5                                               01589000
UCBMT    EQU   0                                                        01590000
UCBOCR   EQU   0                                                        01591000
UCB3540X EQU   0                                                        01592000
UCBDKBYT EQU   UCB3540X+6                                               01593000
UCB3800X EQU   0                                                        01594000
UCBOPTNS EQU   UCB3800X                                                 01595000
UCBACTIV EQU   UCB3800X+3                                               01596000
UCBMDRBF EQU   UCB3800X+36                                              01597000
UCBUCS   EQU   0                                                        01598000
UCBUCSOP EQU   UCBUCS+4                                                 01599000
UCBFCBOP EQU   UCBUCS+5                                                 01600000
FIXED15  EQU   0                                                        01601000
IGG019Q0 EQU   0                                                        01602000
IEDQTNT  EQU   0                                                        01603000
CONVRV   EQU   0                                                        01604000
SIOAPNG  EQU   0                                                        01605000
CL0001@  EQU   0                                                        01606000
DEBSUBR  EQU   0                                                        01607000
DSTSGBEG EQU   0                                                        01608000
UCBBGN   EQU   0                                                        01609000
CVTS01   EQU   CVTPGSIA                                                 01610000
CVTLPDIA EQU   CVTS01+12                                                01611000
CVTDIRST EQU   CVTLPDIA                                                 01612000
CVTSLIDA EQU   CVTS01+24                                                01613000
CVTCTLFG EQU   CVTS01+50                                                01614000
CVTRV210 EQU   CVTS01+424                                               01615000
CVTRV219 EQU   CVTS01+425                                               01616000
CVTRV228 EQU   CVTS01+426                                               01617000
CVTRV237 EQU   CVTS01+427                                               01618000
CVTMFRTR EQU   CVTS01+452                                               01619000
CVTRV262 EQU   CVTS01+468                                               01620000
CVTRV271 EQU   CVTS01+469                                               01621000
CVTRV280 EQU   CVTS01+470                                               01622000
CVTRV289 EQU   CVTS01+471                                               01623000
CVTGSDA  EQU   CVTS01+600                                               01624000
IEDQDPTR EQU   IOSDSID                                                  01625000
DEBUCB   EQU   DEBUCBS                                                  01626000
DEBDVMOD EQU   DEBUCB                                                   01627000
DEBUCBAD EQU   DEBUCB+1                                                 01628000
IOSATTSC EQU   IOSIPIB                                                  01629000
IOSWTOWA EQU   IOSIPIB                                                  01630000
IOSPCISC EQU   IOSIPIB                                                  01631000
EWAPTR   EQU   IOSERP                                                   01632000
EWADDIOS EQU   EWAIERP                                                  01633000
LCBRSPIN EQU   LCBIOBSN                                                 01634000
LCBLUSNS EQU   LCBRSPIN+5                                               01635000
LCBSCPRS EQU   LCBRSPIN+9                                               01636000
LCBCSWU1 EQU   LCBSCPRS+2                                               01637000
LCBRSPFG EQU   LCBRSPIN+15                                              01638000
LCBCOREQ EQU   LCBTPCD                                                  01639000
@NM00162 EQU   LCBCPA+40                                                01640000
LCBQNX   EQU   LCBERCCW                                                 01641000
LCBQNXMN EQU   LCBQNX                                                   01642000
LCBNX064 EQU   LCBQNXMN                                                 01643000
LCBNX142 EQU   LCBQNXMN                                                 01644000
LCBNX162 EQU   LCBQNXMN                                                 01645000
LCBSTSAV EQU   LCBQNX+1                                                 01646000
LCBUASZE EQU   LCBQNX+20                                                01647000
LCBUNADD EQU   LCBQNX+21                                                01648000
LCBCANCL EQU   LCBSAVSN                                                 01649000
LCBCANFG EQU   LCBCANCL                                                 01650000
FLC      EQU   PSA                                                      01651000
PSARSVTE EQU   PSARSVT                                                  01652000
TCXPTR   EQU   CVTAQAVT                                                 01653000
TRMPRE1  EQU   TRMBYTE4                                                 01654000
TRMNCP1  EQU   TRMBYTE4                                                 01655000
TRMPRE   EQU   TRMBYTE3                                                 01656000
TRMNCP   EQU   TRMBYTE3                                                 01657000
TRMIPLDM EQU   TRMNCP                                                   01658000
TRMPU    EQU   TRMBYTE3                                                 01659000
TRMLU    EQU   TRMBYTE3                                                 01660000
TRMLINK  EQU   TRMBYTE3                                                 01661000
UCBPTR   EQU   IOSUCB                                                   01662000
UCBOBS01 EQU   UCBDEV                                                   01663000
UCBSTAB  EQU   UCBOBS01+10                                              01664000
UCBBSVL  EQU   UCBSTAB                                                  01665000
UCBPRSRS EQU   UCBSTAB                                                  01666000
UCBDMCT  EQU   UCBOBS01+11                                              01667000
UCBFL4   EQU   UCBOBS01+13                                              01668000
UCBOBS02 EQU   UCBDEV                                                   01669000
UCBTFL1  EQU   UCBOBS02+19                                              01670000
UCBXTN   EQU   UCBOBS02+20                                              01671000
UCBVOPT  EQU   UCBXTN                                                   01672000
UCBOBS03 EQU   UCBDEV                                                   01673000
UCBXTADR EQU   UCBOBS03                                                 01674000
UCBOBS04 EQU   UCBDEV                                                   01675000
UCBBTA   EQU   UCBOBS04+12                                              01676000
UCBOBS06 EQU   UCBDEV                                                   01677000
UCBAOF   EQU   UCBOBS06                                                 01678000
UCBAOF1  EQU   UCBAOF                                                   01679000
UCBAOF2  EQU   UCBAOF+1                                                 01680000
@NM00210 EQU   UCBOBS06+3                                               01681000
UCBIRB   EQU   UCBOBS06+4                                               01682000
UCBGRAF  EQU   UCBIRB                                                   01683000
UCBLDNCA EQU   UCBOBS06+8                                               01684000
UCBRDYQ  EQU   UCBLDNCA                                                 01685000
UCBIRLN  EQU   UCBRDYQ                                                  01686000
UCBLDNCB EQU   UCBRDYQ+1                                                01687000
UCBCTLNK EQU   UCBOBS06+12                                              01688000
UCBOBS07 EQU   UCBDEV                                                   01689000
UCBOBS08 EQU   UCBDEV                                                   01690000
UCBCTCAD EQU   UCBOBS08                                                 01691000
UCBCTCF1 EQU   UCBOBS08+4                                               01692000
UCBOBS09 EQU   UCBDEV                                                   01693000
MSG064   EQU   EWAIERP                                                  01694000
M064TXT  EQU   MSG064+4                                                 01695000
M064CUA  EQU   M064TXT+13                                               01696000
ETW      EQU   EWAIERP                                                  01697000
EWTCSIO  EQU   ETW+4                                                    01698000
EWTCFLG  EQU   ETW+10                                                   01699000
EWTCSNL  EQU   ETW+20                                                   01700000
EWTCCSW  EQU   ETW+25                                                   01701000
EWTCCCW  EQU   ETW+32                                                   01702000
TICCHK   EQU   CCWOPCDE                                                 01703000
NOTTIC1  EQU   TICCHK                                                   01704000
NOTTIC2  EQU   TICCHK                                                   01705000
NOTTIC3  EQU   TICCHK                                                   01706000
OPCDESAV EQU   LCBRESTR                                                 01707000
DIOSUCB  EQU   IOSUCB                                                   01708000
DIOSUCBP EQU   DIOSUCB+2                                                01709000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01710000
@NM00214 EQU   DIOSUCB                                                  01711000
@NM00213 EQU   TICCHK                                                   01712000
EWTCSAV2 EQU   ETW+48                                                   01713000
EWTCSAV1 EQU   ETW+44                                                   01714000
EWTCBUFF EQU   ETW+40                                                   01715000
EWTCRSV2 EQU   ETW+24                                                   01716000
EWTCRSV1 EQU   ETW+22                                                   01717000
EWTCSNF  EQU   ETW+21                                                   01718000
EWTCTRM  EQU   ETW+12                                                   01719000
EWTCGRA  EQU   ETW+11                                                   01720000
@NM00212 EQU   EWTCFLG                                                  01721000
EWTCSEL  EQU   EWTCFLG                                                  01722000
EWTCEOD  EQU   EWTCFLG                                                  01723000
EWTCOVF  EQU   EWTCFLG                                                  01724000
EWTCTEM  EQU   EWTCFLG                                                  01725000
EWTCTPF  EQU   ETW+9                                                    01726000
EWTCTPL  EQU   ETW+8                                                    01727000
EWTCMSK  EQU   ETW+7                                                    01728000
EWTCTMP  EQU   ETW+6                                                    01729000
EWTCTID  EQU   ETW+2                                                    01730000
EWTCSNS  EQU   ETW                                                      01731000
M064FLG  EQU   MSG064+2                                                 01732000
M064LEN  EQU   MSG064                                                   01733000
UCBRV066 EQU   UCBOBS09+4                                               01734000
UCBIOSBA EQU   UCBOBS09                                                 01735000
UCBRV042 EQU   UCBOBS08+5                                               01736000
UCBRV082 EQU   UCBCTCF1                                                 01737000
UCBRV081 EQU   UCBCTCF1                                                 01738000
UCBRV080 EQU   UCBCTCF1                                                 01739000
UCBRV079 EQU   UCBCTCF1                                                 01740000
UCBRV078 EQU   UCBCTCF1                                                 01741000
UCBRV077 EQU   UCBCTCF1                                                 01742000
UCBRV076 EQU   UCBCTCF1                                                 01743000
UCBCTC80 EQU   UCBCTCF1                                                 01744000
UCBCTCAL EQU   UCBCTCAD                                                 01745000
UCBICNCB EQU   UCBOBS07+4                                               01746000
UCBRV040 EQU   UCBOBS07                                                 01747000
UCBCTLNA EQU   UCBCTLNK+1                                               01748000
UCBRLN   EQU   UCBCTLNK                                                 01749000
UCBRDYQA EQU   UCBLDNCB                                                 01750000
UCBINRLN EQU   UCBIRLN                                                  01751000
UCBIRBA  EQU   UCBIRB+1                                                 01752000
UCBRV039 EQU   UCBGRAF                                                  01753000
UCBDWNR  EQU   UCBGRAF                                                  01754000
UCBRPND  EQU   UCBGRAF                                                  01755000
UCBUPM   EQU   UCBGRAF                                                  01756000
UCBBTAM  EQU   UCBGRAF                                                  01757000
UCBDRNO  EQU   UCBGRAF                                                  01758000
UCBDRO   EQU   UCBGRAF                                                  01759000
UCBOIP   EQU   UCBGRAF                                                  01760000
UCBATRCD EQU   @NM00210                                                 01761000
UCBSKPFG EQU   @NM00210                                                 01762000
UCBRIPND EQU   @NM00210                                                 01763000
UCBRTIAC EQU   @NM00210                                                 01764000
UCBRSV79 EQU   @NM00210                                                 01765000
UCBRSV78 EQU   @NM00210                                                 01766000
UCBRSV77 EQU   @NM00210                                                 01767000
UCBOLTEP EQU   @NM00210                                                 01768000
UCBATNCT EQU   UCBOBS06+2                                               01769000
UCBRSV76 EQU   UCBAOF2                                                  01770000
UCBRSV75 EQU   UCBAOF2                                                  01771000
UCBRSV74 EQU   UCBAOF2                                                  01772000
UCBRSV73 EQU   UCBAOF2                                                  01773000
UCBRSV72 EQU   UCBAOF2                                                  01774000
UCBRSV71 EQU   UCBAOF2                                                  01775000
UCBRSV70 EQU   UCBAOF2                                                  01776000
UCBRSV69 EQU   UCBAOF2                                                  01777000
UCBRSV68 EQU   UCBAOF1                                                  01778000
UCBRSV67 EQU   UCBAOF1                                                  01779000
UCBRSV66 EQU   UCBAOF1                                                  01780000
UCBRSV65 EQU   UCBAOF1                                                  01781000
UCBRSV64 EQU   UCBAOF1                                                  01782000
UCBOFNL  EQU   UCBAOF1                                                  01783000
UCBOFSP  EQU   UCBAOF1                                                  01784000
UCBOFMCR EQU   UCBAOF1                                                  01785000
UCBBTB   EQU   UCBBTA+1                                                 01786000
UCBDI    EQU   UCBBTA                                                   01787000
UCBSNS   EQU   UCBOBS04+8                                               01788000
UCBTEB   EQU   UCBOBS04+4                                               01789000
UCBGCB   EQU   UCBOBS04+3                                               01790000
UCBOPEN  EQU   UCBOBS04+2                                               01791000
UCBSTART EQU   UCBOBS04                                                 01792000
UCBXTNB  EQU   UCBXTN+1                                                 01793000
UCBRSV22 EQU   UCBVOPT                                                  01794000
UCBRSV21 EQU   UCBVOPT                                                  01795000
UCBRSV20 EQU   UCBVOPT                                                  01796000
UCBESVE  EQU   UCBVOPT                                                  01797000
UCBERPC  EQU   UCBVOPT                                                  01798000
UCBESVC  EQU   UCBVOPT                                                  01799000
UCBEVA   EQU   UCBVOPT                                                  01800000
UCBESV   EQU   UCBVOPT                                                  01801000
UCBRV009 EQU   UCBTFL1                                                  01802000
UCBRV008 EQU   UCBTFL1                                                  01803000
UCBRV007 EQU   UCBTFL1                                                  01804000
UCBRV006 EQU   UCBTFL1                                                  01805000
UCBRV005 EQU   UCBTFL1                                                  01806000
UCBDQDSP EQU   UCBTFL1                                                  01807000
UCBNSLTP EQU   UCBTFL1                                                  01808000
UCBNLTP  EQU   UCBTFL1                                                  01809000
UCBRES1B EQU   UCBOBS02+18                                              01810000
UCBFSER  EQU   UCBOBS02+12                                              01811000
@NM00209 EQU   UCBOBS02+4                                               01812000
UCBFSEQ  EQU   UCBOBS02+2                                               01813000
UCBFSCT  EQU   UCBOBS02                                                 01814000
UCBNEXP  EQU   UCBOBS01+20                                              01815000
UCBBASE  EQU   UCBOBS01+16                                              01816000
UCBRES1A EQU   UCBOBS01+15                                              01817000
UCBUSER  EQU   UCBOBS01+14                                              01818000
UCBFL47  EQU   UCBFL4                                                   01819000
UCBFL46  EQU   UCBFL4                                                   01820000
UCBFL45  EQU   UCBFL4                                                   01821000
UCBRV065 EQU   UCBFL4                                                   01822000
UCBDSS   EQU   UCBFL4                                                   01823000
UCBRESVP EQU   UCBFL4                                                   01824000
UCBWDAV  EQU   UCBFL4                                                   01825000
UCBDAVV  EQU   UCBFL4                                                   01826000
UCBSQC   EQU   UCBOBS01+12                                              01827000
UCBDATP  EQU   UCBOBS01+12                                              01828000
UCBDMC   EQU   UCBDMCT                                                  01829000
UCBMOUNT EQU   UCBDMCT                                                  01830000
UCBBNUL  EQU   UCBSTAB                                                  01831000
UCBSHAR  EQU   UCBSTAB                                                  01832000
UCBBSTR  EQU   UCBSTAB                                                  01833000
UCBBPUB  EQU   UCBSTAB                                                  01834000
UCBBPRV  EQU   UCBSTAB                                                  01835000
UCBBALB  EQU   UCBPRSRS                                                 01836000
UCBPGFL  EQU   UCBSTAB                                                  01837000
UCBDVSHR EQU   UCBBSVL                                                  01838000
UCBVOLI  EQU   UCBOBS01+4                                               01839000
UCBVTOC  EQU   UCBOBS01                                                 01840000
@NM00207 EQU   TRMLINK                                                  01841000
TRMLSTAT EQU   TRMLINK                                                  01842000
TRMLINT  EQU   TRMLINK                                                  01843000
TRMEPMOD EQU   TRMLINK                                                  01844000
TRMLULOG EQU   TRMLU                                                    01845000
TRMINERR EQU   TRMLU                                                    01846000
TRMLUREQ EQU   TRMLU                                                    01847000
TRMSESRQ EQU   TRMLU                                                    01848000
TRMTDIFF EQU   TRMLU                                                    01849000
TRMLUTM  EQU   TRMLU                                                    01850000
TRMLUIT  EQU   TRMLU                                                    01851000
TRMAUTO  EQU   TRMLU                                                    01852000
TRMPCONT EQU   TRMPU                                                    01853000
@NM00206 EQU   TRMPU                                                    01854000
TRMNCONT EQU   TRMNCP                                                   01855000
TRMQUCKN EQU   TRMNCP                                                   01856000
TRMSLOWN EQU   TRMNCP                                                   01857000
TRMSYGEN EQU   TRMNCP                                                   01858000
TRMNCPCL EQU   TRMNCP                                                   01859000
TRMINOUT EQU   TRMPRE                                                   01860000
TRMRDOUT EQU   TRMPRE                                                   01861000
TRMNLOUT EQU   TRMPRE                                                   01862000
TRMWROUT EQU   TRMPRE                                                   01863000
TRMASNXI EQU   TRMPRE                                                   01864000
TRMSTMM  EQU   TRMPRE                                                   01865000
TRMCMODE EQU   TRMPRE                                                   01866000
TRMSTPND EQU   TRMPRE                                                   01867000
@NM00205 EQU   TRMNCP1                                                  01868000
TRMINOP  EQU   TRMNCP1                                                  01869000
TRMLYNCH EQU   TRMPRE1                                                  01870000
TRMSPOUT EQU   TRMPRE1                                                  01871000
TRMERLCK EQU   TRMPRE1                                                  01872000
TRMQNPL  EQU   TRMPRE1                                                  01873000
TRMSPACT EQU   TRMPRE1                                                  01874000
TRMOCNI  EQU   TRMPRE1                                                  01875000
TRMSESSN EQU   TRMPRE1                                                  01876000
TRMCONT  EQU   TRMPRE1                                                  01877000
PSARSAV  EQU   PSARSVTE+60                                              01878000
PSARSTK  EQU   PSARSVTE+56                                              01879000
PSAESAV3 EQU   PSARSVTE+52                                              01880000
PSAESTK3 EQU   PSARSVTE+48                                              01881000
PSAESAV2 EQU   PSARSVTE+44                                              01882000
PSAESTK2 EQU   PSARSVTE+40                                              01883000
PSAESAV1 EQU   PSARSVTE+36                                              01884000
PSAESTK1 EQU   PSARSVTE+32                                              01885000
PSAPSAV  EQU   PSARSVTE+28                                              01886000
PSAPSTK  EQU   PSARSVTE+24                                              01887000
PSAMSAV  EQU   PSARSVTE+20                                              01888000
PSAMSTK  EQU   PSARSVTE+16                                              01889000
PSASSAV  EQU   PSARSVTE+12                                              01890000
PSASSTK  EQU   PSARSVTE+8                                               01891000
PSANSTK  EQU   PSARSVTE+4                                               01892000
PSACSTK  EQU   PSARSVTE                                                 01893000
@NM00170 EQU   LCBCANCL+3                                               01894000
LCBCANTH EQU   LCBCANCL+1                                               01895000
@NM00169 EQU   LCBCANFG                                                 01896000
LCBCANCD EQU   LCBCANFG                                                 01897000
@NM00168 EQU   LCBCANFG                                                 01898000
LCBCANEB EQU   LCBCANFG                                                 01899000
LCBCANXT EQU   LCBCANFG                                                 01900000
LCBDSTEA EQU   LCBQNX+16                                                01901000
@NM00167 EQU   LCBQNX+8                                                 01902000
LCBIOSBS EQU   LCBQNX+5                                                 01903000
@NM00166 EQU   LCBQNX+4                                                 01904000
@NM00165 EQU   LCBQNXMN                                                 01905000
LCBNX509 EQU   LCBQNXMN                                                 01906000
@NM00164 EQU   @NM00162+4                                               01907000
LCBNCPPT EQU   @NM00162+1                                               01908000
@NM00163 EQU   @NM00162                                                 01909000
LCBWRSCH EQU   LCBCOREQ+8                                               01910000
LCBCQLNK EQU   LCBCOREQ+4                                               01911000
LCBCQELE EQU   LCBCOREQ                                                 01912000
LCBPAKCH EQU   LCBRSPIN+16                                              01913000
@NM00161 EQU   LCBRSPFG                                                 01914000
LCBRSRH  EQU   LCBRSPFG                                                 01915000
LCBEXPI  EQU   LCBRSPFG                                                 01916000
@NM00160 EQU   LCBRSPIN+12                                              01917000
LCBUSUE1 EQU   LCBCSWU1                                                 01918000
@NM00159 EQU   LCBCSWU1                                                 01919000
@NM00158 EQU   LCBSCPRS+1                                               01920000
LCBDFCMD EQU   LCBSCPRS                                                 01921000
LCBUSER  EQU   LCBLUSNS+2                                               01922000
LCBSMIN  EQU   LCBLUSNS+1                                               01923000
LCBSMAJ  EQU   LCBLUSNS                                                 01924000
LCBRHSV  EQU   LCBRSPIN+2                                               01925000
LCBSNS0  EQU   LCBRSPIN+1                                               01926000
@NM00157 EQU   LCBRSPIN                                                 01927000
EWAEND   EQU   EWADDIOS+71                                              01928000
EWASCSW  EQU   EWADDIOS+64                                              01929000
EWASNS   EQU   EWADDIOS                                                 01930000
IOSPCIWA EQU   IOSPCISC+44                                              01931000
IOSPCIRS EQU   IOSPCISC+8                                               01932000
@NM00125 EQU   IOSPCISC+4                                               01933000
@NM00124 EQU   IOSPCISC                                                 01934000
IOSWRNDR EQU   IOSWTOWA+4                                               01935000
IOSWTOPT EQU   IOSWTOWA+3                                               01936000
IOSWTOCP EQU   IOSWTOWA+2                                               01937000
IOSWTOCH EQU   IOSWTOWA                                                 01938000
IOSATTWA EQU   IOSATTSC+40                                              01939000
@NM00123 EQU   IOSATTSC+24                                              01940000
IOSATTSN EQU   IOSATTSC                                                 01941000
CVTRV628 EQU   CVTS01+728                                               01942000
CVTRV627 EQU   CVTS01+724                                               01943000
CVTRV626 EQU   CVTS01+720                                               01944000
CVTRV625 EQU   CVTS01+716                                               01945000
CVTRV624 EQU   CVTS01+712                                               01946000
CVTRV623 EQU   CVTS01+708                                               01947000
CVTRV622 EQU   CVTS01+704                                               01948000
CVTRV621 EQU   CVTS01+700                                               01949000
CVTIHASU EQU   CVTS01+696                                               01950000
CVTRV619 EQU   CVTS01+692                                               01951000
CVTRV618 EQU   CVTS01+688                                               01952000
CVTRV617 EQU   CVTS01+684                                               01953000
CVTRV616 EQU   CVTS01+680                                               01954000
CVTRV615 EQU   CVTS01+676                                               01955000
CVTRV614 EQU   CVTS01+672                                               01956000
CVTRV613 EQU   CVTS01+668                                               01957000
CVTTCASP EQU   CVTS01+664                                               01958000
CVT0PT03 EQU   CVTS01+660                                               01959000
CVT0PT0E EQU   CVTS01+656                                               01960000
CVTRV609 EQU   CVTS01+652                                               01961000
CVTCGK   EQU   CVTS01+648                                               01962000
CVTRAC   EQU   CVTS01+644                                               01963000
CVTHSM   EQU   CVTS01+640                                               01964000
CVTRV605 EQU   CVTS01+636                                               01965000
CVTRV604 EQU   CVTS01+632                                               01966000
CVTEFF02 EQU   CVTS01+628                                               01967000
CVTCBBR  EQU   CVTS01+624                                               01968000
CVTSSCR  EQU   CVTS01+620                                               01969000
CVTEVENT EQU   CVTS01+616                                               01970000
CVTCRCA  EQU   CVTS01+612                                               01971000
CVTTPIO  EQU   CVTS01+608                                               01972000
CVTADV   EQU   CVTS01+604                                               01973000
CVTGSDAB EQU   CVTGSDA                                                  01974000
CVTQV3   EQU   CVTS01+596                                               01975000
CVTQV2   EQU   CVTS01+592                                               01976000
CVTQV1   EQU   CVTS01+588                                               01977000
CVTRPT   EQU   CVTS01+584                                               01978000
CVTSSRB  EQU   CVTS01+580                                               01979000
CVTCSDRL EQU   CVTS01+576                                               01980000
CVTEXP1  EQU   CVTS01+572                                               01981000
CVTRMPMT EQU   CVTS01+568                                               01982000
CVTRMPTT EQU   CVTS01+564                                               01983000
CVTVPSA  EQU   CVTS01+560                                               01984000
CVTVSTOP EQU   CVTS01+556                                               01985000
CVTGTFR8 EQU   CVTS01+552                                               01986000
CVTQUIT  EQU   CVTS01+548                                               01987000
CVTVACR  EQU   CVTS01+544                                               01988000
CVTWTCB  EQU   CVTS01+540                                               01989000
CVTSTPRS EQU   CVTS01+536                                               01990000
CVT0PT02 EQU   CVTS01+532                                               01991000
CVTDARCM EQU   CVTS01+528                                               01992000
CVTIRECM EQU   CVTS01+524                                               01993000
CVTJRECM EQU   CVTS01+520                                               01994000
CVTVEMS0 EQU   CVTS01+516                                               01995000
CVTSPFRR EQU   CVTS01+512                                               01996000
CVTRLSTG EQU   CVTS01+508                                               01997000
CVT0TC0A EQU   CVTS01+504                                               01998000
CVTGMBR  EQU   CVTS01+500                                               01999000
CVTLFRM  EQU   CVTS01+496                                               02000000
CVTRMBR  EQU   CVTS01+492                                               02001000
CVTVIOP  EQU   CVTS01+488                                               02002000
CVTRV307 EQU   CVTS01+486                                               02003000
CVTRV306 EQU   CVTS01+484                                               02004000
CVTRV305 EQU   CVTS01+482                                               02005000
CVTRV304 EQU   CVTS01+480                                               02006000
CVTRV303 EQU   CVTS01+478                                               02007000
CVTRV302 EQU   CVTS01+476                                               02008000
CVTTRCA  EQU   CVTS01+472                                               02009000
CVTRV297 EQU   CVTRV289                                                 02010000
CVTRV296 EQU   CVTRV289                                                 02011000
CVTRV295 EQU   CVTRV289                                                 02012000
CVTRV294 EQU   CVTRV289                                                 02013000
CVTRV293 EQU   CVTRV289                                                 02014000
CVTRV292 EQU   CVTRV289                                                 02015000
CVTRV291 EQU   CVTRV289                                                 02016000
CVTRV290 EQU   CVTRV289                                                 02017000
CVTRV288 EQU   CVTRV280                                                 02018000
CVTRV287 EQU   CVTRV280                                                 02019000
CVTRV286 EQU   CVTRV280                                                 02020000
CVTRV285 EQU   CVTRV280                                                 02021000
CVTRV284 EQU   CVTRV280                                                 02022000
CVTRV283 EQU   CVTRV280                                                 02023000
CVTRV282 EQU   CVTRV280                                                 02024000
CVTRV281 EQU   CVTRV280                                                 02025000
CVTRV279 EQU   CVTRV271                                                 02026000
CVTRV278 EQU   CVTRV271                                                 02027000
CVTRV277 EQU   CVTRV271                                                 02028000
CVTRV276 EQU   CVTRV271                                                 02029000
CVTRV275 EQU   CVTRV271                                                 02030000
CVTRV274 EQU   CVTRV271                                                 02031000
CVTRV273 EQU   CVTRV271                                                 02032000
CVTRV272 EQU   CVTRV271                                                 02033000
CVTRV270 EQU   CVTRV262                                                 02034000
CVTRV269 EQU   CVTRV262                                                 02035000
CVTRV268 EQU   CVTRV262                                                 02036000
CVTRV267 EQU   CVTRV262                                                 02037000
CVTRV266 EQU   CVTRV262                                                 02038000
CVTRV265 EQU   CVTRV262                                                 02039000
CVTRV264 EQU   CVTRV262                                                 02040000
CVTRV263 EQU   CVTRV262                                                 02041000
CVTVFP   EQU   CVTS01+464                                               02042000
CVTVSI   EQU   CVTS01+460                                               02043000
CVTVPSIB EQU   CVTS01+456                                               02044000
CVTMFACT EQU   CVTMFRTR                                                 02045000
CVTMFCTL EQU   CVTS01+448                                               02046000
CVTPVBP  EQU   CVTS01+444                                               02047000
CVTPWI   EQU   CVTS01+440                                               02048000
CVTRV254 EQU   CVTS01+438                                               02049000
CVTRV253 EQU   CVTS01+436                                               02050000
CVTRV252 EQU   CVTS01+434                                               02051000
CVTRV251 EQU   CVTS01+433                                               02052000
CVTRV250 EQU   CVTS01+432                                               02053000
CVTRV249 EQU   CVTS01+431                                               02054000
CVTRV248 EQU   CVTS01+430                                               02055000
CVTRV247 EQU   CVTS01+429                                               02056000
CVTRV246 EQU   CVTS01+428                                               02057000
CVTRV245 EQU   CVTRV237                                                 02058000
CVTRV244 EQU   CVTRV237                                                 02059000
CVTRV243 EQU   CVTRV237                                                 02060000
CVTRV242 EQU   CVTRV237                                                 02061000
CVTRV241 EQU   CVTRV237                                                 02062000
CVTRV240 EQU   CVTRV237                                                 02063000
CVTRV239 EQU   CVTRV237                                                 02064000
CVTRV238 EQU   CVTRV237                                                 02065000
CVTRV236 EQU   CVTRV228                                                 02066000
CVTRV235 EQU   CVTRV228                                                 02067000
CVTRV234 EQU   CVTRV228                                                 02068000
CVTRV233 EQU   CVTRV228                                                 02069000
CVTRV232 EQU   CVTRV228                                                 02070000
CVTRV231 EQU   CVTRV228                                                 02071000
CVTRV230 EQU   CVTRV228                                                 02072000
CVTRV229 EQU   CVTRV228                                                 02073000
CVTRV227 EQU   CVTRV219                                                 02074000
CVTRV226 EQU   CVTRV219                                                 02075000
CVTRV225 EQU   CVTRV219                                                 02076000
CVTRV224 EQU   CVTRV219                                                 02077000
CVTRV223 EQU   CVTRV219                                                 02078000
CVTRV222 EQU   CVTRV219                                                 02079000
CVTRV221 EQU   CVTRV219                                                 02080000
CVTRV220 EQU   CVTRV219                                                 02081000
CVTRV218 EQU   CVTRV210                                                 02082000
CVTRV217 EQU   CVTRV210                                                 02083000
CVTRV216 EQU   CVTRV210                                                 02084000
CVTRV215 EQU   CVTRV210                                                 02085000
CVTRV214 EQU   CVTRV210                                                 02086000
CVTRV213 EQU   CVTRV210                                                 02087000
CVTRV212 EQU   CVTRV210                                                 02088000
CVTRV211 EQU   CVTRV210                                                 02089000
CVTLCCAT EQU   CVTS01+420                                               02090000
CVTPCCAT EQU   CVTS01+416                                               02091000
CVTIPCRP EQU   CVTS01+412                                               02092000
CVTIPCRI EQU   CVTS01+408                                               02093000
CVTIPCDS EQU   CVTS01+404                                               02094000
CVTAIDVT EQU   CVTS01+400                                               02095000
CVTSSAP  EQU   CVTS01+396                                               02096000
CVTEHCIR EQU   CVTS01+392                                               02097000
CVTEHDEF EQU   CVTS01+388                                               02098000
CVTDAIR  EQU   CVTS01+384                                               02099000
CVTPERFM EQU   CVTS01+380                                               02100000
CVT044R2 EQU   CVTS01+376                                               02101000
CVTFETCH EQU   CVTS01+372                                               02102000
CVTRSTWD EQU   CVTS01+368                                               02103000
CVTSPOST EQU   CVTS01+364                                               02104000
CVTIOBP  EQU   CVTS01+360                                               02105000
CVTASMVT EQU   CVTS01+356                                               02106000
CVTRECRQ EQU   CVTS01+352                                               02107000
CVTWSAC  EQU   CVTS01+348                                               02108000
CVTRV149 EQU   CVTS01+344                                               02109000
CVTWSAL  EQU   CVTS01+340                                               02110000
CVTSPSA  EQU   CVTS01+336                                               02111000
CVTGLMN  EQU   CVTS01+332                                               02112000
CVTVEAC0 EQU   CVTS01+328                                               02113000
CVT062R1 EQU   CVTS01+324                                               02114000
CVTRPOST EQU   CVTS01+320                                               02115000
CVTDQIQE EQU   CVTS01+316                                               02116000
CVTCSD   EQU   CVTS01+312                                               02117000
CVTLKRMA EQU   CVTS01+308                                               02118000
CVTRSPIE EQU   CVTS01+304                                               02119000
CVTRENQ  EQU   CVTS01+300                                               02120000
CVTLQCB  EQU   CVTS01+296                                               02121000
CVTFQCB  EQU   CVTS01+292                                               02122000
CVTQCS01 EQU   CVTS01+288                                               02123000
CVTAPFT  EQU   CVTS01+284                                               02124000
CVTPARRL EQU   CVTS01+280                                               02125000
CVTVWAIT EQU   CVTS01+276                                               02126000
CVTGSPL  EQU   CVTS01+272                                               02127000
CVTLSMQ  EQU   CVTS01+268                                               02128000
CVTGSMQ  EQU   CVTS01+264                                               02129000
CVTEXPRO EQU   CVTS01+260                                               02130000
CVTOPCTP EQU   CVTS01+256                                               02131000
CVTSIC   EQU   CVTS01+252                                               02132000
CVTTPIOS EQU   CVTS01+248                                               02133000
CVTRTMS  EQU   CVTS01+244                                               02134000
CVTSDBF  EQU   CVTS01+240                                               02135000
CVTSCBP  EQU   CVTS01+236                                               02136000
CVTSDMP  EQU   CVTS01+232                                               02137000
CVTSV60  EQU   CVTS01+228                                               02138000
CVTRTMCT EQU   CVTS01+224                                               02139000
CVTASCBL EQU   CVTS01+220                                               02140000
CVTASCBH EQU   CVTS01+216                                               02141000
CVTGDA   EQU   CVTS01+212                                               02142000
CVTASVT  EQU   CVTS01+208                                               02143000
CVTVVMDI EQU   CVTS01+204                                               02144000
CVTAQTOP EQU   CVTS01+200                                               02145000
CVTIOSCS EQU   CVTS01+196                                               02146000
CVTSDRM  EQU   CVTS01+192                                               02147000
CVTOPTE  EQU   CVTS01+188                                               02148000
CVTSTXU  EQU   CVTS01+184                                               02149000
CVTQUIS  EQU   CVTS01+180                                               02150000
CVTPARS  EQU   CVTS01+176                                               02151000
CVTS1EE  EQU   CVTS01+172                                               02152000
CVTFRAS  EQU   CVTS01+168                                               02153000
CVTQSAS  EQU   CVTS01+164                                               02154000
CVTCRAS  EQU   CVTS01+160                                               02155000
CVTCRMN  EQU   CVTS01+156                                               02156000
CVTDELCP EQU   CVTS01+152                                               02157000
CVTFRECL EQU   CVTS01+148                                               02158000
CVTGETCL EQU   CVTS01+144                                               02159000
CVTBLDCP EQU   CVTS01+140                                               02160000
CVTAUTHL EQU   CVTS01+136                                               02161000
CVTSCAN  EQU   CVTS01+132                                               02162000
CVTRV144 EQU   CVTS01+130                                               02163000
CVTMAXMP EQU   CVTS01+128                                               02164000
CVTSTCK  EQU   CVTS01+124                                               02165000
CVTRV139 EQU   CVTS01+123                                               02166000
CVTDSSAC EQU   CVTS01+122                                               02167000
CVTRV513 EQU   CVTS01+121                                               02168000
CVTIOSPL EQU   CVTS01+120                                               02169000
CVTPTGT  EQU   CVTS01+116                                               02170000
CVTCSPIE EQU   CVTS01+112                                               02171000
CVTSMFEX EQU   CVTS01+108                                               02172000
CVTOLT0A EQU   CVTS01+104                                               02173000
CVTSRBRT EQU   CVTS01+100                                               02174000
CVTPUTL  EQU   CVTS01+96                                                02175000
CVTASCRL EQU   CVTS01+92                                                02176000
CVTASCRF EQU   CVTS01+88                                                02177000
CVTRV326 EQU   CVTS01+84                                                02178000
CVTRV325 EQU   CVTS01+80                                                02179000
CVTRV324 EQU   CVTS01+76                                                02180000
CVT0VL01 EQU   CVTS01+72                                                02181000
CVTSHRVM EQU   CVTS01+68                                                02182000
CVTRV332 EQU   CVTS01+64                                                02183000
CVTTAS   EQU   CVTS01+60                                                02184000
CVTRSCN  EQU   CVTS01+56                                                02185000
CVTTRAC2 EQU   CVTS01+54                                                02186000
CVTTRACE EQU   CVTS01+52                                                02187000
CVTAPG   EQU   CVTS01+51                                                02188000
CVTSDTRC EQU   CVTCTLFG                                                 02189000
CVTGTRCE EQU   CVTCTLFG                                                 02190000
CVTNOMP  EQU   CVTCTLFG                                                 02191000
CVTRSV79 EQU   CVTCTLFG                                                 02192000
CVTDSTAT EQU   CVTCTLFG                                                 02193000
CVTRSV78 EQU   CVTCTLFG                                                 02194000
CVTRV333 EQU   CVTCTLFG                                                 02195000
CVTRV323 EQU   CVTCTLFG                                                 02196000
CVTSPVLK EQU   CVTS01+49                                                02197000
CVTRSV77 EQU   CVTS01+48                                                02198000
CVTRV331 EQU   CVTS01+44                                                02199000
CVTRV330 EQU   CVTS01+40                                                02200000
CVTRV329 EQU   CVTS01+36                                                02201000
CVTRV328 EQU   CVTS01+32                                                02202000
CVTRV322 EQU   CVTS01+28                                                02203000
CVTSLID  EQU   CVTSLIDA+1                                               02204000
CVTSYLK  EQU   CVTSLIDA                                                 02205000
CVTRV321 EQU   CVTS01+20                                                02206000
CVTRV320 EQU   CVTS01+16                                                02207000
CVTLPDIR EQU   CVTLPDIA+1                                               02208000
CVTRSV69 EQU   CVTDIRST                                                 02209000
CVTRSV68 EQU   CVTDIRST                                                 02210000
CVTRSV67 EQU   CVTDIRST                                                 02211000
CVTRSV66 EQU   CVTDIRST                                                 02212000
CVTRSV65 EQU   CVTDIRST                                                 02213000
CVTRSV64 EQU   CVTDIRST                                                 02214000
CVTRSV63 EQU   CVTDIRST                                                 02215000
CVTDICOM EQU   CVTDIRST                                                 02216000
CVTPVTP  EQU   CVTS01+8                                                 02217000
CVTLPDSR EQU   CVTS01+4                                                 02218000
CVTGETL  EQU   CVTS01                                                   02219000
UCBERADR EQU   UCBUCS+12                                                02220000
UCBFCBID EQU   UCBUCS+8                                                 02221000
UCBERCNT EQU   UCBUCS+7                                                 02222000
UCBRSV51 EQU   UCBUCS+6                                                 02223000
UCBFCBPE EQU   UCBFCBOP                                                 02224000
UCBRSV49 EQU   UCBFCBOP                                                 02225000
UCBRSV48 EQU   UCBFCBOP                                                 02226000
UCBRSV47 EQU   UCBFCBOP                                                 02227000
UCBRSV46 EQU   UCBFCBOP                                                 02228000
UCBRSV45 EQU   UCBFCBOP                                                 02229000
UCBRSV44 EQU   UCBFCBOP                                                 02230000
UCBFCBO1 EQU   UCBFCBOP                                                 02231000
UCBUCSPE EQU   UCBUCSOP                                                 02232000
UCBRSV43 EQU   UCBUCSOP                                                 02233000
UCBRSV42 EQU   UCBUCSOP                                                 02234000
UCBRSV41 EQU   UCBUCSOP                                                 02235000
UCBRSV40 EQU   UCBUCSOP                                                 02236000
UCBRSV39 EQU   UCBUCSOP                                                 02237000
UCBUCSO2 EQU   UCBUCSOP                                                 02238000
UCBUCSO1 EQU   UCBUCSOP                                                 02239000
UCBUCSID EQU   UCBUCS                                                   02240000
UCBMDRBA EQU   UCBMDRBF+1                                               02241000
UCBRV075 EQU   UCBMDRBF                                                 02242000
UCBRV074 EQU   UCB3800X+32                                              02243000
UCBIMAGE EQU   UCB3800X+28                                              02244000
UCBFCBNM EQU   UCB3800X+24                                              02245000
UCBCHAR4 EQU   UCB3800X+20                                              02246000
UCBCHAR3 EQU   UCB3800X+16                                              02247000
UCBCHAR2 EQU   UCB3800X+12                                              02248000
UCBCHAR1 EQU   UCB3800X+8                                               02249000
UCBCGMID EQU   UCB3800X+4                                               02250000
UCBBRSTA EQU   UCBACTIV                                                 02251000
UCBRV063 EQU   UCBACTIV                                                 02252000
UCBRV062 EQU   UCBACTIV                                                 02253000
UCBRV061 EQU   UCBACTIV                                                 02254000
UCBRV060 EQU   UCBACTIV                                                 02255000
UCBRV059 EQU   UCBACTIV                                                 02256000
UCBRV058 EQU   UCBACTIV                                                 02257000
UCBRV057 EQU   UCBACTIV                                                 02258000
UCBRV050 EQU   UCB3800X+2                                               02259000
UCBCGMNO EQU   UCB3800X+1                                               02260000
UCBRV083 EQU   UCBOPTNS                                                 02261000
UCBBRSTR EQU   UCBOPTNS                                                 02262000
UCBRV056 EQU   UCBOPTNS                                                 02263000
UCBRV055 EQU   UCBOPTNS                                                 02264000
UCBRV054 EQU   UCBOPTNS                                                 02265000
UCBRV053 EQU   UCBOPTNS                                                 02266000
UCBRV052 EQU   UCBOPTNS                                                 02267000
UCBRV051 EQU   UCBOPTNS                                                 02268000
UCBRV073 EQU   UCB3540X+7                                               02269000
UCBRV072 EQU   UCBDKBYT                                                 02270000
UCBRV071 EQU   UCBDKBYT                                                 02271000
UCBRV070 EQU   UCBDKBYT                                                 02272000
UCBRV069 EQU   UCBDKBYT                                                 02273000
UCBRV068 EQU   UCBDKBYT                                                 02274000
UCBRV067 EQU   UCBDKBYT                                                 02275000
UCBVLVER EQU   UCBDKBYT                                                 02276000
UCBDKAMX EQU   UCBDKBYT                                                 02277000
UCBVLSER EQU   UCB3540X                                                 02278000
UCBRDATA EQU   UCBOCR+4                                                 02279000
UCBFRID  EQU   UCBOCR                                                   02280000
UCBCLN   EQU   UCBMT+14                                                 02281000
UCBERG   EQU   UCBMT+12                                                 02282000
UCBMS    EQU   UCBMT+11                                                 02283000
UCBNB    EQU   UCBMT+10                                                 02284000
UCBPW    EQU   UCBMT+9                                                  02285000
UCBPR    EQU   UCBMT+8                                                  02286000
UCBSIO   EQU   UCBMT+6                                                  02287000
UCBTW    EQU   UCBMT+5                                                  02288000
UCBTR    EQU   UCBMT+4                                                  02289000
UCBTWT   EQU   UCBMT+3                                                  02290000
UCBTRT   EQU   UCBMT+2                                                  02291000
UCBCTD   EQU   UCBMT                                                    02292000
UCBWTOID EQU   UCBCMEXT+17                                              02293000
UCBRV043 EQU   UCBCMEXT+16                                              02294000
UCBASID  EQU   UCBCMEXT+14                                              02295000
UCBMFCNT EQU   UCBCMEXT+12                                              02296000
UCBPMSK  EQU   UCBCMEXT+10                                              02297000
UCBCCWOF EQU   UCBCMEXT+8                                               02298000
UCBRV041 EQU   UCBCMEXT+6                                               02299000
UCBRV036 EQU   UCBFLP1                                                  02300000
UCBRV035 EQU   UCBFLP1                                                  02301000
UCBERLOG EQU   UCBFLP1                                                  02302000
UCBRV033 EQU   UCBFLP1                                                  02303000
UCBINHIO EQU   UCBFLP1                                                  02304000
UCBNSWAP EQU   UCBFLP1                                                  02305000
UCBSHRUP EQU   UCBFLP1                                                  02306000
UCBNSRCH EQU   UCBFLP1                                                  02307000
UCBSNSCT EQU   UCBCMEXT+4                                               02308000
UCBHPDV  EQU   @NM00211                                                 02309000
UCBHALI  EQU   @NM00211                                                 02310000
UCBRSV09 EQU   @NM00211                                                 02311000
UCBRSV08 EQU   @NM00211                                                 02312000
UCBRSV07 EQU   @NM00211                                                 02313000
UCBRSV06 EQU   @NM00211                                                 02314000
UCBRSV05 EQU   @NM00211                                                 02315000
UCBRSV04 EQU   @NM00211                                                 02316000
UCBDTI   EQU   UCBCMEXT+2                                               02317000
UCBSTI   EQU   UCBCMEXT+1                                               02318000
UCBEXTP  EQU   UCBEXTPT+1                                               02319000
UCBDDRSW EQU   UCBFLC                                                   02320000
UCBTICBT EQU   UCBFLC                                                   02321000
UCBIVRR  EQU   UCBFLC                                                   02322000
UCBIVRS  EQU   UCBFLC                                                   02323000
UCBITF   EQU   UCBFLC                                                   02324000
UCBUDE   EQU   UCBFLC                                                   02325000
UCBWAA   EQU   UCBFLC                                                   02326000
UCBATTP  EQU   UCBFLC                                                   02327000
UCBUNTYP EQU   UCBTBYT4                                                 02328000
UCBRSV11 EQU   UCBDVCLS                                                 02329000
UCBRSV10 EQU   UCBDVCLS                                                 02330000
UCB3CHAR EQU   UCBDVCLS                                                 02331000
UCB3UREC EQU   UCBDVCLS                                                 02332000
UCB3DISP EQU   UCBDVCLS                                                 02333000
UCB3DACC EQU   UCBDVCLS                                                 02334000
UCB3COMM EQU   UCBDVCLS                                                 02335000
UCB3TAPE EQU   UCBDVCLS                                                 02336000
UCBDVPWR EQU   UCB2OPT7                                                 02337000
UCBVLPWR EQU   UCB2OPT6                                                 02338000
UCB2OPT5 EQU   UCBTBYT2                                                 02339000
UCBRVDEV EQU   UCBRWTAU                                                 02340000
UCBRPS   EQU   UCBDUDN2                                                 02341000
UCBRR    EQU   UCBDUDN1                                                 02342000
UCB2OPT1 EQU   UCBTBYT2                                                 02343000
UCB2OPT0 EQU   UCBTBYT2                                                 02344000
UCB1FEA7 EQU   UCBTBYT1                                                 02345000
UCBD6250 EQU   UCB1FEA6                                                 02346000
UCBD1600 EQU   UCB1FEA5                                                 02347000
UCB1FEA4 EQU   UCBTBYT1                                                 02348000
UCB1FEA3 EQU   UCBTBYT1                                                 02349000
UCB1FEA2 EQU   UCBTBYT1                                                 02350000
UCB1FEA1 EQU   UCBTBYT1                                                 02351000
UCB1FEA0 EQU   UCBTBYT1                                                 02352000
UCBRV029 EQU   UCBWGT                                                   02353000
UCBVHRSN EQU   UCBWGT                                                   02354000
UCBVORSN EQU   UCBWGT                                                   02355000
UCBMTPXP EQU   UCBWGT                                                   02356000
UCBREW   EQU   UCBWGT                                                   02357000
UCBPUB   EQU   UCBWGT                                                   02358000
UCBOUT   EQU   UCBWGT                                                   02359000
UCBIN    EQU   UCBWGT                                                   02360000
UCBCPU   EQU   UCBOB+11                                                 02361000
UCBLCI   EQU   UCBOB+10                                                 02362000
UCBCNT   EQU   UCBOB+9                                                  02363000
UCBRV017 EQU   UCBCHM1                                                  02364000
UCBRV016 EQU   UCBCHM1                                                  02365000
UCBRV015 EQU   UCBCHM1                                                  02366000
UCBRV014 EQU   UCBCHM1                                                  02367000
UCBSPB   EQU   UCBPTH1                                                  02368000
UCBPPB   EQU   UCBPTH1                                                  02369000
UCBSPA   EQU   UCBPTH0                                                  02370000
UCBPPA   EQU   UCBPTH0                                                  02371000
UCBSIGP  EQU   UCBFLB                                                   02372000
UCBVALPH EQU   UCBFLB                                                   02373000
UCBCRHSN EQU   UCBFLB                                                   02374000
UCBCRHRV EQU   UCBFLB                                                   02375000
UCBRESVH EQU   UCBFLB                                                   02376000
UCBSPST  EQU   UCBFLB                                                   02377000
UCBASNS  EQU   UCBFLB                                                   02378000
UCBIORST EQU   UCBFLB                                                   02379000
UCBQISCE EQU   UCBFL1                                                   02380000
UCBACTV  EQU   UCBFL1                                                   02381000
UCBSAP   EQU   UCBFL1                                                   02382000
UCBNOTRC EQU   UCBCUB                                                   02383000
UCBPSNS  EQU   UCBFL1                                                   02384000
UCBUSING EQU   UCBPST                                                   02385000
UCBNOTRD EQU   UCBNRY                                                   02386000
UCBBUSYD EQU   UCBBSY                                                   02387000
UCBUA    EQU   UCBCHAN+1                                                02388000
UCBCHA   EQU   UCBCHAN                                                  02389000
UCBDADI  EQU   UCBSTAT                                                  02390000
UCBSYSR  EQU   UCBSTAT                                                  02391000
UCBPRES  EQU   UCBSTAT                                                  02392000
UCBALOC  EQU   UCBSTAT                                                  02393000
UCBUNLD  EQU   UCBSTAT                                                  02394000
UCBRESV  EQU   UCBSTAT                                                  02395000
UCBCHGS  EQU   UCBSTAT                                                  02396000
UCBONLI  EQU   UCBSTAT                                                  02397000
UCBID    EQU   UCBOB+2                                                  02398000
UCBALTPH EQU   UCBFL5                                                   02399000
UCBALTCU EQU   UCBFL5                                                   02400000
UCBNALOC EQU   UCBFL5                                                   02401000
UCBENVRD EQU   UCBFL5                                                   02402000
UCBVSDR  EQU   UCBFL5                                                   02403000
UCBSASK  EQU   UCBFL5                                                   02404000
UCBAMV   EQU   UCBAF                                                    02405000
UCBDCC   EQU   UCBFL5                                                   02406000
UCBMONT  EQU   UCBJBNR                                                  02407000
UCBRV011 EQU   UCBJBNR                                                  02408000
UCBMMSGP EQU   UCBJBNR                                                  02409000
UCBOLDSM EQU   UCBJBNR                                                  02410000
UCBRV003 EQU   UCBJBNR                                                  02411000
UCBDUC   EQU   UCBJBNR                                                  02412000
UCBJES3  EQU   UCBJBNR                                                  02413000
UCBVRDEV EQU   UCBJBNR                                                  02414000
UCBCMSEG EQU   UCBOB                                                    02415000
UCBPFXND EQU   UCB+512                                                  02416000
UCBIOQ   EQU   UCB+508                                                  02417000
UCBLOCK  EQU   UCB+504                                                  02418000
UCBPXST  EQU   UCB+504                                                  02419000
@NM00208 EQU   UCB                                                      02420000
TRMOPT   EQU   IEDTRM+34                                                02421000
TRMOPTBL EQU   IEDQTRM+18                                               02422000
TRMOPNO  EQU   IEDQTRM+17                                               02423000
TRMCHCIN EQU   IEDQTRM+16                                               02424000
TRMSENSE EQU   TRMSTAT+3                                                02425000
TRMTEMPR EQU   TRMSTAT+2                                                02426000
TRMSIO   EQU   TRMSTAT                                                  02427000
@NM00204 EQU   TRMDEVFL+1                                               02428000
TRMTPIN  EQU   TRMDEVFL+1                                               02429000
TRMNCPI  EQU   TRMDEVFL+1                                               02430000
TRMRNTRM EQU   TRMDEVFL+1                                               02431000
@NM00203 EQU   TRMDEVFL+1                                               02432000
TRMLMD   EQU   TRMDEVFL+1                                               02433000
TRMCONC  EQU   TRMDEVFL+1                                               02434000
TRMTSOB  EQU   TRMDEVFL                                                 02435000
TRMBFDY  EQU   TRMDEVFL                                                 02436000
TRMTBLK  EQU   TRMDEVFL                                                 02437000
TRMSBLK  EQU   TRMDEVFL                                                 02438000
TRMBLKS  EQU   TRMDEVFL                                                 02439000
TRMADDC  EQU   TRMDEVFL                                                 02440000
TRMDDIG  EQU   TRMDEVFL                                                 02441000
TRMBUFS  EQU   TRMDEVFL                                                 02442000
TRMPRILK EQU   TRMALTD                                                  02443000
TRMLGB   EQU   TRMDSORG                                                 02444000
TRMUTERM EQU   TLISTCNT                                                 02445000
TRMDESTQ EQU   IEDQTRM+1                                                02446000
TRMSCNYN EQU   TRMSTATE                                                 02447000
TRMOPTFN EQU   TRMSTATE                                                 02448000
TRMHELDN EQU   TRMSTATE                                                 02449000
TRMACPTN EQU   TRMSTATE                                                 02450000
TRMPREF  EQU   TRMSTATE                                                 02451000
TRMPROC  EQU   TRMLOG                                                   02452000
TRMLIST  EQU   TRMLOG                                                   02453000
TRMLINE  EQU   TRMSTATE                                                 02454000
TRMSUBST EQU   IEDNTRM+12                                               02455000
TRMTYPE  EQU   IEDNTRM+11                                               02456000
TRMRLMCT EQU   IEDNTRM+10                                               02457000
TRMCOHTG EQU   TRMSIBPT+1                                               02458000
TRMGPCNT EQU   TRMSIBPT                                                 02459000
TRMBUFRD EQU   TRMBYTE0                                                 02460000
TRMSNA   EQU   TRMBYTE0                                                 02461000
TRMGP    EQU   TRMBYTE0                                                 02462000
TRMDIAL  EQU   TRMBYTE0                                                 02463000
@NM00202 EQU   TRMBYTE0                                                 02464000
TRMOUTPT EQU   TRMBYTE0                                                 02465000
TRMINPUT EQU   TRMBYTE0                                                 02466000
TRMUDEF  EQU   TRMBYTE0                                                 02467000
TRMCOHRT EQU   IEDNTRM+4                                                02468000
TRMSTOTE EQU   TRMBYTE1                                                 02469000
TRMCKPRN EQU   TRMBYTE1                                                 02470000
TRMTSATN EQU   TRMBYTE1                                                 02471000
TRMTRACE EQU   TRMBYTE1                                                 02472000
TRMSWBCK EQU   TRMBYTE1                                                 02473000
TRMAUTOC EQU   TRMBYTE1                                                 02474000
TRMINPTP EQU   TRMBYTE1                                                 02475000
TRMWTNEG EQU   TRMSCPRQ                                                 02476000
TRMWRBRK EQU   TRMBYTE2                                                 02477000
TRMNOSND EQU   TRMBYTE2                                                 02478000
TRMPREP  EQU   TRMBYTE2                                                 02479000
TRMGPACT EQU   TRMBYTE2                                                 02480000
TRMANDL  EQU   TRMBYTE2                                                 02481000
TRMCLOSN EQU   TRMINPG                                                  02482000
TRMREMB  EQU   TRMBYTE2                                                 02483000
TRMRSACT EQU   TRMBYTE2                                                 02484000
TCXEND   EQU   IEDQTCXD+224                                             02485000
TCXNCPIO EQU   IEDQTCXD+220                                             02486000
TCXACTE8 EQU   TCXQE8                                                   02487000
TCXABEPL EQU   IEDQTCXD+212                                             02488000
TCXSRBS  EQU   IEDQTCXD+208                                             02489000
TCXSIOSB EQU   IEDQTCXD+204                                             02490000
TCXERPSV EQU   IEDQTCXD+116                                             02491000
TCXSATTN EQU   IEDQTCXD+112                                             02492000
@NM00201 EQU   TCXDSAVE+4                                               02493000
@NM00200 EQU   TCXDSAVE                                                 02494000
TCXPLCB  EQU   IEDQTCXD+100                                             02495000
TCXBITS  EQU   IEDQTCXD+98                                              02496000
TCXSCBSZ EQU   IEDQTCXD+97                                              02497000
TCXBIT1  EQU   IEDQTCXD+96                                              02498000
TCXCOMPT EQU   IEDQTCXD+92                                              02499000
TCXAVAIL EQU   IEDQTCXD+88                                              02500000
TCXBUFL  EQU   IEDQTCXD+84                                              02501000
TCXTOTE  EQU   TCXBUFA                                                  02502000
TCXCKPM  EQU   IEDQTCXD+79                                              02503000
TCXNCKPR EQU   IEDQTCXD+78                                              02504000
TCXSZAIB EQU   IEDQTCXD+76                                              02505000
TCXAIBC  EQU   IEDQTCXD+72                                              02506000
TCXPEBC  EQU   IEDQTCXD+68                                              02507000
TCXPEWAC EQU   IEDQTCXD+64                                              02508000
TCXQRQ   EQU   IEDQTCXD+60                                              02509000
TCXOCQ   EQU   IEDQTCXD+56                                              02510000
TCXPNTQ  EQU   IEDQTCXD+52                                              02511000
TCXPUTQ  EQU   IEDQTCXD+48                                              02512000
TCXGETQ  EQU   IEDQTCXD+44                                              02513000
TCXTSI   EQU   IEDQTCXD+40                                              02514000
TCXRPT   EQU   IEDQTCXD+36                                              02515000
TCXAPDMP EQU   TCXFLAG1                                                 02516000
TCXAPPL  EQU   TCXFLAG1                                                 02517000
TCXRTM   EQU   TCXFLAG1                                                 02518000
TCXMCPCD EQU   TCXFLAG1                                                 02519000
TCXAUTH  EQU   TCXFLAG1                                                 02520000
TCXASID  EQU   IEDQTCXD+32                                              02521000
TCXASCB  EQU   IEDQTCXD+28                                              02522000
TCXREADY EQU   IEDQTCXD+24                                              02523000
TCXPASWD EQU   IEDQTCXD+16                                              02524000
TCXDISP  EQU   IEDQTCXD+12                                              02525000
TCXTCB   EQU   IEDQTCXD+8                                               02526000
TCXATTLN EQU   TCXATTEN                                                 02527000
RQEHDR   EQU   IEDRQE+16                                                02528000
RQETCBAD EQU   IEDRQE+13                                                02529000
RQEKEY   EQU   IEDRQE+12                                                02530000
RQEDEB   EQU   IEDRQE+9                                                 02531000
RQEPR    EQU   IEDRQE+8                                                 02532000
RQETCB   EQU   IEDRQE+4                                                 02533000
RQELNK   EQU   IEDRQE                                                   02534000
LCBERADR EQU   LCBXRADR+1                                               02535000
LCBPCIRC EQU   LCBXRADR                                                 02536000
LCBDCT3  EQU   LCBXDCT+2                                                02537000
LCBDCT2  EQU   LCBXDCT+1                                                02538000
LCBDCT1  EQU   LCBXDCT                                                  02539000
@NM00175 EQU   LCBXFLAG                                                 02540000
LCBERPND EQU   LCBXFLAG                                                 02541000
LCBSRCPF EQU   LCBXFLAG                                                 02542000
LCBGPCTV EQU   LCBXFLAG                                                 02543000
@NM00174 EQU   LCBXFLAG                                                 02544000
@NM00173 EQU   LCBXFLAG                                                 02545000
@NM00172 EQU   LCBXFLAG                                                 02546000
@NM00171 EQU   LCBXFLAG                                                 02547000
LCBCCW10 EQU   LCBCPA+72                                                02548000
LCBCCW9  EQU   LCBCPA+64                                                02549000
LCBCCW8  EQU   LCBCPA+56                                                02550000
LCBCCW6  EQU   LCBCPA+40                                                02551000
LCBCP    EQU   LCBQEBPL+4                                               02552000
LCBIOSB  EQU   LCBQEBPL+1                                               02553000
LCBSIO   EQU   LCBQEBPL                                                 02554000
LCBCCW1  EQU   LCBCPA                                                   02555000
@NM00156 EQU   LCBERCCW+16                                              02556000
LCBATL05 EQU   LCBERCCW+8                                               02557000
@NM00155 EQU   LCBERCCW                                                 02558000
LCBBFSNS EQU   LCBRSPSV                                                 02559000
LCBWAITC EQU   LCBTPCD+5                                                02560000
LCBINPAK EQU   LCBSTAT6                                                 02561000
LCBMHBID EQU   LCBSTAT6                                                 02562000
LCBRTRRO EQU   LCBSTAT6                                                 02563000
LCBHDRPD EQU   LCBSTAT6                                                 02564000
LCBCHN   EQU   LCBSTAT6                                                 02565000
LCBBFRSV EQU   LCBTPCD+1                                                02566000
@NM00154 EQU   LCBSTAT5                                                 02567000
LCBLUS   EQU   LCBSTAT5                                                 02568000
LCBLUNIT EQU   LCBSTAT5                                                 02569000
LCBPERM  EQU   LCBSTAT5                                                 02570000
LCBNXCMD EQU   LCBBFRW                                                  02571000
LCBERMSK EQU   LCBOBRCH                                                 02572000
LCBSCBA  EQU   IEDQLCB+93                                               02573000
LCBOLT   EQU   LCBMSGFM                                                 02574000
LCBEOT   EQU   LCBMSGFM                                                 02575000
LCBENQ   EQU   LCBMSGFM                                                 02576000
LCBTTD   EQU   LCBMSGFM                                                 02577000
LCBRSTRT EQU   LCBMSGFM                                                 02578000
LCBVSTRT EQU   LCBMSGFM                                                 02579000
LCBACKI  EQU   LCBMSGFM                                                 02580000
LCBNAK   EQU   LCBMSGFM                                                 02581000
@NM00153 EQU   LCBRBCT2                                                 02582000
LCBDCNT  EQU   LCBRBCT2                                                 02583000
LCBRBCT1 EQU   LCBERBCT                                                 02584000
LCBERBCH EQU   IEDQLCB+85                                               02585000
LCBCOMPL EQU   LCBDLNKN                                                 02586000
LCBPRCPG EQU   LCBERBST                                                 02587000
LCBERROR EQU   LCBERBST                                                 02588000
LCBLOGDV EQU   LCBERBST                                                 02589000
LCBINQ   EQU   LCBERBST                                                 02590000
LCBRDERR EQU   LCBERBST                                                 02591000
LCBEOMSG EQU   LCBERBST                                                 02592000
LCBMSG   EQU   LCBERBST                                                 02593000
LCBERBLK EQU   IEDQLCB+81                                               02594000
LCBERBPY EQU   IEDQLCB+80                                               02595000
LCBERBQB EQU   LCBERB+1                                                 02596000
LCBERBKY EQU   LCBERB                                                   02597000
LCBRECAD EQU   IEDQLCB+73                                               02598000
@NM00152 EQU   LCBTSTSW                                                 02599000
@NM00151 EQU   LCBTSTSW                                                 02600000
@NM00150 EQU   LCBTSTSW                                                 02601000
@NM00149 EQU   LCBTSTSW                                                 02602000
@NM00148 EQU   LCBTSTSW                                                 02603000
@NM00147 EQU   LCBTSTSW                                                 02604000
@NM00146 EQU   LCBTSTSW                                                 02605000
LCBCONCT EQU   LCBTSTSW                                                 02606000
LCBRESP  EQU   LCBSTAT2                                                 02607000
LCBBFRAV EQU   LCBDIAL                                                  02608000
LCBATTN  EQU   LCBSYNC                                                  02609000
LCBNEGRP EQU   LCBSTAT2                                                 02610000
LCBSNDPR EQU   LCBSTAT2                                                 02611000
LCBCONNN EQU   LCBBEOTN                                                 02612000
LCBMSGNN EQU   LCBSTAT2                                                 02613000
LCBTRACE EQU   LCBSTAT2                                                 02614000
LCBRECVN EQU   LCBSTAT1                                                 02615000
LCBFREEN EQU   LCBSTAT1                                                 02616000
LCBCONT  EQU   LCBSTAT1                                                 02617000
LCBINITN EQU   LCBSTAT1                                                 02618000
LCBOCNI  EQU   LCBSTAT1                                                 02619000
LCBOCWTN EQU   LCBSTAT1                                                 02620000
LCBRCLLN EQU   LCBSTAT1                                                 02621000
LCBRECOF EQU   IEDQLCB+68                                               02622000
LCBRDBFR EQU   LCBRCBFR                                                 02623000
LCBUCBX  EQU   IEDQLCB+64                                               02624000
LCBTTBIN EQU   LCBERRCT                                                 02625000
@NM00145 EQU   LCBINCAM                                                 02626000
LCBGETMN EQU   LCBINCAM                                                 02627000
@NM00144 EQU   LCBRESTR+1                                               02628000
LCBCMDSV EQU   LCBRESTR                                                 02629000
LCBPCILK EQU   LCBDCBPT                                                 02630000
LCBAP4OL EQU   LCBSIOCC                                                 02631000
LCBAP3OL EQU   LCBSIOCC                                                 02632000
LCBAP2OL EQU   LCBSIOCC                                                 02633000
LCBAP1OL EQU   LCBSIOCC                                                 02634000
@NM00143 EQU   LCBSIOCC                                                 02635000
LCBCSWRC EQU   LCBCSW+5                                                 02636000
LCBUSUE  EQU   LCBCSWUS                                                 02637000
LCBUSDE  EQU   LCBCSWUS                                                 02638000
LCBUSCE  EQU   LCBCSWUS                                                 02639000
LCBUSBSY EQU   LCBCSWUS                                                 02640000
LCBUSCUE EQU   LCBCSWUS                                                 02641000
LCBUSSM  EQU   LCBCSWUS                                                 02642000
LCBUSAT  EQU   LCBCSWUS                                                 02643000
LCBOBR   EQU   LCBFLAG3                                                 02644000
LCBOBRRD EQU   LCBFLAG3                                                 02645000
LCBIOMSG EQU   LCBFLAG3                                                 02646000
LCBSOHC  EQU   LCBFLAG3                                                 02647000
LCBSOHR  EQU   LCBFLAG3                                                 02648000
@NM00142 EQU   LCBFLAG3                                                 02649000
LCBECBPT EQU   LCBIOBSN+4                                               02650000
LCBSENS1 EQU   LCBSNS+1                                                 02651000
LCBABORT EQU   LCBTMOUT                                                 02652000
@NM00141 EQU   LCBFLAG1                                                 02653000
LCBUNREL EQU   LCBFLAG1                                                 02654000
LCBEXCPN EQU   LCBFLAG1                                                 02655000
@NM00140 EQU   LCBFLAG1                                                 02656000
LCBERPIN EQU   LCBFLAG1                                                 02657000
@NM00139 EQU   LCBFLAG1                                                 02658000
LCBFSBFR EQU   LCBMHA                                                   02659000
LCBISZE  EQU   IEDQLCB+28                                               02660000
LCBLNENT EQU   LCBSCBDA+1                                               02661000
@NM00138 EQU   LCBSCBDA                                                 02662000
LCBCPGMH EQU   LCBSTAT4                                                 02663000
LCBREAL  EQU   LCBPHASE                                                 02664000
@NM00137 EQU   LCBSTAT4                                                 02665000
LCBACTRQ EQU   LCBSTAT4                                                 02666000
LCBIPLRQ EQU   LCBSTAT4                                                 02667000
LCBDACRQ EQU   LCBSTAT4                                                 02668000
LCBDMPRQ EQU   LCBSTAT4                                                 02669000
@NM00136 EQU   LCBLKMDE                                                 02670000
LCBLOCKI EQU   LCBLKMDE                                                 02671000
LCBLOCKR EQU   LCBLKMDE                                                 02672000
LCBHMFLG EQU   LCBLKMDE                                                 02673000
LCBBDFLG EQU   LCBLKMDE                                                 02674000
@NM00135 EQU   LCBINSRC                                                 02675000
LCBABRTN EQU   LCBCHAIN                                                 02676000
LCBCTLMD EQU   LCBTETEN                                                 02677000
LCBBFRSZ EQU   LCBCHAIN                                                 02678000
LCBUREQN EQU   LCBCHAIN                                                 02679000
LCBNORTY EQU   LCBCHAIN                                                 02680000
LCBERMSG EQU   LCBCHAIN                                                 02681000
LCBEXCP  EQU   LCBCHAIN                                                 02682000
LCBINVRQ EQU   LCBSCRNN                                                 02683000
LCB2741N EQU   LCBTSOB                                                  02684000
LCBINHBN EQU   LCBTSOB                                                  02685000
LCBCIRCD EQU   LCBTSOB                                                  02686000
LCBPREP  EQU   LCBTSOB                                                  02687000
LCBSOPL  EQU   LCBTSOB                                                  02688000
LCBSATRD EQU   LCBTSOB                                                  02689000
LCBTSBUF EQU   LCBTSOB                                                  02690000
LCBWRBRK EQU   LCBTSOB                                                  02691000
LCBTDL   EQU   IEDQLCB+18                                               02692000
LCBEOLTD EQU   IEDQLCB+16                                               02693000
LCBRSLNK EQU   IEDQLCB+13                                               02694000
LCBRSPRI EQU   IEDQLCB+12                                               02695000
LCBSTCBA EQU   IEDQLCB+9                                                02696000
LCBRSKEY EQU   IEDQLCB+8                                                02697000
LCBLINK  EQU   LCBRCB+5                                                 02698000
LCBPRI   EQU   LCBRCB+4                                                 02699000
LCBQCBA  EQU   LCBRCB+1                                                 02700000
LCBKEY   EQU   LCBRCB                                                   02701000
EWACPU   EQU   EWA+27                                                   02702000
@NM00134 EQU   EWA+26                                                   02703000
EWACHA   EQU   EWA+24                                                   02704000
EWACSEQ  EQU   EWAXCSW2                                                 02705000
EWACDIN  EQU   EWAXCSW2                                                 02706000
@NM00133 EQU   EWAXCSW2                                                 02707000
EWACTEC  EQU   EWAXCSW2                                                 02708000
EWACDAV  EQU   EWAXCSW1                                                 02709000
EWACCHV  EQU   EWAXCSW1                                                 02710000
EWACCMD  EQU   EWAXCSW1                                                 02711000
EWACUNS  EQU   EWAXCSW1                                                 02712000
EWACSQV  EQU   EWAXCSW1                                                 02713000
@NM00132 EQU   EWAXCSW1                                                 02714000
EWACITF  EQU   EWAXCSW1                                                 02715000
@NM00131 EQU   EWARGFG2                                                 02716000
EWACCUE  EQU   EWARGFG2                                                 02717000
EWACSTG  EQU   EWARGFG2                                                 02718000
EWACSCU  EQU   EWARGFG2                                                 02719000
EWACCHA  EQU   EWARGFG2                                                 02720000
EWACCPU  EQU   EWARGFG2                                                 02721000
EWANORTY EQU   EWARGFG1                                                 02722000
EWACCNT  EQU   EWARGFG1                                                 02723000
EWACSNS  EQU   EWARGFG1                                                 02724000
@NM00130 EQU   EWARGFG1                                                 02725000
EWACHIO  EQU   EWARGFG1                                                 02726000
EWACTIO  EQU   EWARGFG1                                                 02727000
EWACINT  EQU   EWARGFG1                                                 02728000
EWACSIO  EQU   EWARGFG1                                                 02729000
EWAUCB   EQU   EWAERPIB+1                                               02730000
@NM00129 EQU   EWAERPIB                                                 02731000
EWASTUP  EQU   EWA+14                                                   02732000
EWACNTR4 EQU   EWACNTRS+3                                               02733000
EWACNTR3 EQU   EWACNTRS+2                                               02734000
EWACNTR2 EQU   EWACNTRS+1                                               02735000
EWACNTR1 EQU   EWACNTRS                                                 02736000
EWASSTAT EQU   EWA+8                                                    02737000
EWASCTMX EQU   EWASNSCT                                                 02738000
@NM00128 EQU   EWASNSCT                                                 02739000
EWAJAM   EQU   EWAFLG3                                                  02740000
@NM00127 EQU   EWAFLG2                                                  02741000
EWADIR   EQU   EWAFLG2                                                  02742000
EWACOVF  EQU   EWAFLG2                                                  02743000
EWAWTEMP EQU   EWAFLG2                                                  02744000
EWAMDR   EQU   EWAFLG2                                                  02745000
EWABDSNS EQU   EWAFLG1                                                  02746000
EWADDMSG EQU   EWAFLG1                                                  02747000
EWASCC1  EQU   EWASCC3                                                  02748000
EWASCC2  EQU   EWASCC3                                                  02749000
@NM00126 EQU   EWAFLG1                                                  02750000
EWASLIS  EQU   EWAFLG1                                                  02751000
EWAEXT   EQU   EWAHDR                                                   02752000
IOSEND   EQU   IOSB+108                                                 02753000
IOSSKR   EQU   IOSEEKA+7                                                02754000
IOSSKH2  EQU   IOSSKHH+1                                                02755000
IOSSKH1  EQU   IOSSKHH                                                  02756000
IOSSKCC  EQU   IOSCCHH                                                  02757000
IOSSKBB  EQU   IOSEEKA+1                                                02758000
IOSSKM   EQU   IOSEEKA                                                  02759000
IOSEEK   EQU   IOSB+92                                                  02760000
IOSMDM   EQU   IOSB+91                                                  02761000
IOSMDB   EQU   IOSB+90                                                  02762000
IOSCKEY7 EQU   IOSCKEY                                                  02763000
IOSCKEY6 EQU   IOSCKEY                                                  02764000
IOSCKEY5 EQU   IOSCKEY                                                  02765000
IOSCKEY4 EQU   IOSCKEY                                                  02766000
@NM00122 EQU   IOSCKEY                                                  02767000
IOSFMSK  EQU   IOSB+88                                                  02768000
IOSCUDEV EQU   IOSPATH+1                                                02769000
@NM00121 EQU   IOSCHN                                                   02770000
IOSPATH3 EQU   IOSCHN                                                   02771000
IOSPATH2 EQU   IOSCHN                                                   02772000
IOSEXP   EQU   IOSCHN                                                   02773000
IOSGDP   EQU   IOSCHN                                                   02774000
IOSAFF   EQU   IOSB+85                                                  02775000
IOSRSS1B EQU   IOSB+84                                                  02776000
IOSDIE   EQU   IOSB+68                                                  02777000
IOSABN   EQU   IOSB+64                                                  02778000
IOSNRM   EQU   IOSB+60                                                  02779000
IOSPCI   EQU   IOSB+56                                                  02780000
IOSPCHN  EQU   IOSB+48                                                  02781000
IOSAPMSK EQU   IOSB+40                                                  02782000
IOSRES4A EQU   IOSB+36                                                  02783000
IOSSRB   EQU   IOSB+28                                                  02784000
IOSCSWRC EQU   IOSCSW+5                                                 02785000
IOSTSB   EQU   IOSTATUS+1                                               02786000
IOSTSA   EQU   IOSTATUS                                                 02787000
IOSOPT2X EQU   IOSOPT2                                                  02788000
IOSIGP   EQU   IOSOPT2                                                  02789000
IOSHTP   EQU   IOSOPT2                                                  02790000
IOSRELSE EQU   IOSOPT                                                   02791000
IOSAPR   EQU   IOSOPT                                                   02792000
IOSTSLL  EQU   IOSOPT                                                   02793000
IOSNERP  EQU   IOSOPT                                                   02794000
IOSPSLL  EQU   IOSOPT                                                   02795000
IOSQISCE EQU   IOSOPT                                                   02796000
IOSDEP   EQU   IOSOPT                                                   02797000
IOSBYP   EQU   IOSOPT                                                   02798000
IOSPKY7  EQU   IOSPKEY                                                  02799000
IOSPGDPX EQU   IOSPKEY                                                  02800000
IOSIDR   EQU   IOSPKEY                                                  02801000
IOSLCL   EQU   IOSPKEY                                                  02802000
@NM00119 EQU   IOSPKEY                                                  02803000
IOSPGAD  EQU   IOSB+8                                                   02804000
IOSASID  EQU   IOSB+6                                                   02805000
IOSPRLVL EQU   IOSB+5                                                   02806000
IOSDVRID EQU   IOSB+4                                                   02807000
IOSPROC  EQU   IOSB+3                                                   02808000
IOSFLC7  EQU   IOSFLC                                                   02809000
IOSCTCNR EQU   IOSFLC                                                   02810000
IOSRWAIT EQU   IOSFLC                                                   02811000
IOSTP    EQU   IOSFLC                                                   02812000
IOSCC3WE EQU   IOSFLC                                                   02813000
IOSVERIF EQU   IOSDVALT                                                 02814000
IOSDVMNT EQU   IOSFLC                                                   02815000
IOSBDCST EQU   IOSFLB                                                   02816000
IOSFLB4  EQU   IOSFLB                                                   02817000
IOSFLB3  EQU   IOSFLB                                                   02818000
IOSNOTRS EQU   IOSFLB                                                   02819000
IOSSDR   EQU   IOSFLB                                                   02820000
IOSDIESE EQU   IOSFLB                                                   02821000
IOSIOSB  EQU   IOSFLA                                                   02822000
IOSDOM   EQU   IOSFLA                                                   02823000
IOSSMDB  EQU   IOSFLA                                                   02824000
IOSSMDA  EQU   IOSFLA                                                   02825000
IOSCCHN  EQU   IOSACHN                                                  02826000
IOSDCHN  EQU   IOSACHN                                                  02827000
DEBAPPAD EQU   IEDQDEB+65                                               02828000
DEBEXSCL EQU   IEDQDEB+64                                               02829000
DEBDCBAD EQU   IEDQDEB+61                                               02830000
DEBPROTG EQU   IEDQDEB+60                                               02831000
DEBECBAD EQU   IEDQDEB+57                                               02832000
DEBPRIOR EQU   IEDQDEB+56                                               02833000
DEBUSRPG EQU   IEDQDEB+53                                               02834000
DEBSYSPG EQU   IEDQDEB+49                                               02835000
DEBOPATB EQU   IEDQDEB+48                                               02836000
DEBIRBAD EQU   IEDQDEB+45                                               02837000
DEBOFLGS EQU   IEDQDEB+44                                               02838000
DEBDEBAD EQU   IEDQDEB+41                                               02839000
DEBAMLNG EQU   IEDQDEB+40                                               02840000
DEBTCBAD EQU   IEDQDEB+37                                               02841000
DEBNMSUB EQU   IEDQDEB+36                                               02842000
@NM00118 EQU   DEBPRF+33                                                02843000
DEBLNGTH EQU   DEBPRF+32                                                02844000
DEBDCBMK EQU   DEBPRF+28                                                02845000
DEBDSCBA EQU   DEBPRF+21                                                02846000
DEBWKARA EQU   DEBPRF+20                                                02847000
DEBXCEA  EQU   DEBAPVT+16                                               02848000
DEBCEA   EQU   DEBAPVT+12                                               02849000
DEBPCIA  EQU   DEBAPVT+8                                                02850000
DEBEOEA  EQU   DEBAPVT                                                  02851000
DCBBUFSI EQU   IHADCS43+6                                               02852000
DCBUNTCT EQU   IHADCS43+5                                               02853000
DCBILCT  EQU   IHADCS43+4                                               02854000
DCBSCTAD EQU   DCBSCTAB+1                                               02855000
@NM00117 EQU   DCBSCTAB                                                 02856000
DCBPUTA  EQU   DCBGETA                                                  02857000
@NM00116 EQU   DCBPUT                                                   02858000
DCBDEBA  EQU   DCBDEBAD+1                                               02859000
@NM00115 EQU   DCBIFLGS                                                 02860000
DCBIFIOE EQU   DCBIFLGS                                                 02861000
DCBCH12  EQU   DCBIFPCT                                                 02862000
DCBCH9   EQU   DCBIFPCT                                                 02863000
DCBIFEC  EQU   DCBIFLGS                                                 02864000
DCBMFSTI EQU   DCBMFDMD                                                 02865000
DCBMFAWR EQU   DCBMFSTK                                                 02866000
DCBMFUIP EQU   DCBMFTMD                                                 02867000
DCBMFIDW EQU   DCBMFLCP                                                 02868000
DCBMFWRK EQU   DCBMFMVP                                                 02869000
DCBMFRDQ EQU   DCBMFWRT                                                 02870000
DCBMFGTQ EQU   DCBMFPUT                                                 02871000
DCBMFSTL EQU   DCBMACF2                                                 02872000
DCBMFCK  EQU   DCBMFDMG                                                 02873000
DCBMFRDX EQU   DCBMFCHK                                                 02874000
DCBMFDBF EQU   DCBMFSBG                                                 02875000
DCBMFRDI EQU   DCBMFLCG                                                 02876000
DCBMFRDK EQU   DCBMFMVG                                                 02877000
DCBMFWRQ EQU   DCBMFRD                                                  02878000
DCBMFPTQ EQU   DCBMFGET                                                 02879000
DCBMFECP EQU   DCBMACF1                                                 02880000
DCBTIOT  EQU   IHADCS25                                                 02881000
DCBMRSTI EQU   DCBMRDMD                                                 02882000
DCBMRAWR EQU   DCBMRSTK                                                 02883000
DCBMRUIP EQU   DCBMRTMD                                                 02884000
DCBMRIDW EQU   DCBMRLCP                                                 02885000
DCBMRWRK EQU   DCBMRMVP                                                 02886000
DCBMRRDQ EQU   DCBMRWRT                                                 02887000
DCBMRGTQ EQU   DCBMRPUT                                                 02888000
DCBMRSTL EQU   DCBMACR2                                                 02889000
DCBMRCK  EQU   DCBMRDMG                                                 02890000
DCBPGFXA EQU   DCBMRRDX                                                 02891000
DCBMRDBF EQU   DCBMRSBG                                                 02892000
DCBMRRDI EQU   DCBMRLCG                                                 02893000
DCBMRRDK EQU   DCBMRMVG                                                 02894000
DCBMRWRQ EQU   DCBMRRD                                                  02895000
DCBMRPTQ EQU   DCBMRGET                                                 02896000
DCBMRECP EQU   DCBMACR1                                                 02897000
@NM00114 EQU   DCBIFLG                                                  02898000
DCBIBIOE EQU   DCBIFLG                                                  02899000
DCBICH12 EQU   DCBIBPCT                                                 02900000
DCBICH9  EQU   DCBIBPCT                                                 02901000
DCBIBEC  EQU   DCBIFLG                                                  02902000
DCBOFIOF EQU   DCBOFLGS                                                 02903000
DCBOFUEX EQU   DCBOFLGS                                                 02904000
DCBOFTM  EQU   DCBOFLGS                                                 02905000
DCBOFPPC EQU   DCBOFLGS                                                 02906000
DCBOFOPN EQU   DCBOFLGS                                                 02907000
DCBOFEOV EQU   DCBOFLGS                                                 02908000
DCBOFLRB EQU   DCBOFLGS                                                 02909000
DCBOFIOD EQU   DCBOFLWR                                                 02910000
DCBDDNAM EQU   IHADCS24                                                 02911000
DCBEXLSA EQU   DCBEXLST+1                                               02912000
DCBRNCKA EQU   DCBRNCKD+1                                               02913000
@NM00113 EQU   DCBRNCKD                                                 02914000
DCBIOBAD EQU   IHADCS2K+8                                               02915000
DCBDSGTR EQU   DCBDSRG2                                                 02916000
@NM00112 EQU   DCBDSRG2                                                 02917000
DCBDSRG1 EQU   DCBDSORG                                                 02918000
DCBCHNGL EQU   DCBTRSTA                                                 02919000
DCBNIDLE EQU   DCBTRSTA                                                 02920000
DCBBAKUP EQU   DCBTRSTA                                                 02921000
DCBIPLED EQU   DCBTRSTA                                                 02922000
DCBRSTRT EQU   DCBTRSTA                                                 02923000
DCBINITL EQU   DCBTRSTA                                                 02924000
DCBAUTOD EQU   DCBTRSTA                                                 02925000
DCBAUTOI EQU   DCBTRSTA                                                 02926000
@NM00111 EQU   IHADCS2K+4                                               02927000
DCBDUMPA EQU   DCBDUMPD+1                                               02928000
DCBUNITN EQU   DCBDUMPD                                                 02929000
DCBBCKUA EQU   DCBBCKUP+1                                               02930000
@NM00110 EQU   DCBBCKUP                                                 02931000
DCBIPLTX EQU   IHADCS1A                                                 02932000
@NM00109 EQU   IHADCB                                                   02933000
CVTLEVL  EQU   CVTRELNO+2                                               02934000
CVTNUMB  EQU   CVTRELNO                                                 02935000
CVTMDL   EQU   CVTFIX+250                                               02936000
@NM00108 EQU   CVTFIX+248                                               02937000
@NM00107 EQU   CVTFIX                                                   02938000
CVTRV482 EQU   CVTXTNT2+128                                             02939000
CVTRV481 EQU   CVTXTNT2+124                                             02940000
CVTRV480 EQU   CVTXTNT2+120                                             02941000
CVTRV479 EQU   CVTXTNT2+118                                             02942000
CVTRV478 EQU   CVTXTNT2+117                                             02943000
CVTRV477 EQU   CVTXTNT2+116                                             02944000
CVTRV476 EQU   CVTXTNT2+115                                             02945000
CVTRV475 EQU   CVTXTNT2+114                                             02946000
CVTRV474 EQU   CVTRV466                                                 02947000
CVTRV473 EQU   CVTRV466                                                 02948000
CVTRV472 EQU   CVTRV466                                                 02949000
CVTRV471 EQU   CVTRV466                                                 02950000
CVTRV470 EQU   CVTRV466                                                 02951000
CVTRV469 EQU   CVTRV466                                                 02952000
CVTRV468 EQU   CVTRV466                                                 02953000
CVTRV467 EQU   CVTRV466                                                 02954000
CVTRV465 EQU   CVTRV457                                                 02955000
CVTRV464 EQU   CVTRV457                                                 02956000
CVTRV463 EQU   CVTRV457                                                 02957000
CVTRV462 EQU   CVTRV457                                                 02958000
CVTRV461 EQU   CVTRV457                                                 02959000
CVTRV460 EQU   CVTRV457                                                 02960000
CVTRV459 EQU   CVTRV457                                                 02961000
CVTRV458 EQU   CVTRV457                                                 02962000
CVTRV456 EQU   CVTXTNT2+108                                             02963000
CVTRV455 EQU   CVTXTNT2+104                                             02964000
CVTRV454 EQU   CVTXTNT2+100                                             02965000
CVTRV453 EQU   CVTXTNT2+96                                              02966000
CVTRV452 EQU   CVTXTNT2+94                                              02967000
CVTRV451 EQU   CVTXTNT2+92                                              02968000
CVTRV450 EQU   CVTXTNT2+90                                              02969000
CVTRV449 EQU   CVTXTNT2+88                                              02970000
CVTRV448 EQU   CVTXTNT2+87                                              02971000
CVTRV447 EQU   CVTXTNT2+86                                              02972000
CVTRV446 EQU   CVTRV438                                                 02973000
CVTRV445 EQU   CVTRV438                                                 02974000
CVTRV444 EQU   CVTRV438                                                 02975000
CVTRV443 EQU   CVTRV438                                                 02976000
CVTRV442 EQU   CVTRV438                                                 02977000
CVTRV441 EQU   CVTRV438                                                 02978000
CVTRV440 EQU   CVTRV438                                                 02979000
CVTRV439 EQU   CVTRV438                                                 02980000
CVTRV437 EQU   CVTRV429                                                 02981000
CVTRV436 EQU   CVTRV429                                                 02982000
CVTRV435 EQU   CVTRV429                                                 02983000
CVTRV434 EQU   CVTRV429                                                 02984000
CVTRV433 EQU   CVTRV429                                                 02985000
CVTRV432 EQU   CVTRV429                                                 02986000
CVTRV431 EQU   CVTRV429                                                 02987000
CVTRV430 EQU   CVTRV429                                                 02988000
CVTRV428 EQU   CVTXTNT2+80                                              02989000
CVTRV427 EQU   CVTXTNT2+76                                              02990000
CVTRV426 EQU   CVTXTNT2+72                                              02991000
CVTRV425 EQU   CVTXTNT2+68                                              02992000
CVTATACT EQU   CVTATCVT                                                 02993000
CVTRV423 EQU   CVTXTNT2+62                                              02994000
CVTRV422 EQU   CVTXTNT2+60                                              02995000
CVTRV421 EQU   CVTXTNT2+58                                              02996000
CVTRV420 EQU   CVTXTNT2+56                                              02997000
CVTRV419 EQU   CVTXTNT2+55                                              02998000
CVTRV418 EQU   CVTXTNT2+54                                              02999000
CVTRV417 EQU   CVTRV409                                                 03000000
CVTRV416 EQU   CVTRV409                                                 03001000
CVTRV415 EQU   CVTRV409                                                 03002000
CVTRV414 EQU   CVTRV409                                                 03003000
CVTRV413 EQU   CVTRV409                                                 03004000
CVTRV412 EQU   CVTRV409                                                 03005000
CVTRV411 EQU   CVTRV409                                                 03006000
CVTRV410 EQU   CVTRV409                                                 03007000
CVTRV408 EQU   CVTRV400                                                 03008000
CVTRV407 EQU   CVTRV400                                                 03009000
CVTRV406 EQU   CVTRV400                                                 03010000
CVTRV405 EQU   CVTRV400                                                 03011000
CVTRV404 EQU   CVTRV400                                                 03012000
CVTRV403 EQU   CVTRV400                                                 03013000
CVTRV402 EQU   CVTRV400                                                 03014000
CVTRV401 EQU   CVTRV400                                                 03015000
CVTICB   EQU   CVTXTNT2+48                                              03016000
CVTSKTA  EQU   CVTXTNT2+44                                              03017000
CVTCCVT  EQU   CVTXTNT2+40                                              03018000
CVTRSV98 EQU   CVTXTNT2+36                                              03019000
CVTRSV97 EQU   CVTXTNT2+34                                              03020000
CVTRSV96 EQU   CVTXTNT2+32                                              03021000
CVTOLTEP EQU   CVTXTNT2+28                                              03022000
CVTQIDA  EQU   CVTQID+1                                                 03023000
CVTRSV95 EQU   CVTQID                                                   03024000
CVTRSV94 EQU   CVTXTNT2+20                                              03025000
CVTRSV93 EQU   CVTXTNT2+16                                              03026000
CVTRSV92 EQU   CVTXTNT2+12                                              03027000
CVTDEBVR EQU   CVTXTNT2+8                                               03028000
CVTRSV91 EQU   CVTXTNT2+6                                               03029000
CVTRSV9H EQU   CVTFLGBT                                                 03030000
CVTRSV9G EQU   CVTFLGBT                                                 03031000
CVTRSV9F EQU   CVTFLGBT                                                 03032000
CVTRSV9E EQU   CVTFLGBT                                                 03033000
CVTRSV9D EQU   CVTFLGBT                                                 03034000
CVTRSV9C EQU   CVTFLGBT                                                 03035000
CVTVME   EQU   CVTFLGBT                                                 03036000
CVTNPE   EQU   CVTFLGBT                                                 03037000
CVTNUCLS EQU   CVTXTNT2+4                                               03038000
CVTDSSVA EQU   CVTDSSV+1                                                03039000
CVTRSV89 EQU   CVTDSSV                                                  03040000
CVTRSV88 EQU   CVTXTNT1+8                                               03041000
CVTRSV87 EQU   CVTXTNT1+4                                               03042000
CVTFACHN EQU   CVTXTNT1                                                 03043000
CVTRV488 EQU   CVTMAP+412                                               03044000
CVTRV487 EQU   CVTMAP+408                                               03045000
CVTRV486 EQU   CVTMAP+404                                               03046000
CVTRV485 EQU   CVTMAP+400                                               03047000
CVTACTAP EQU   CVTMAP+396                                               03048000
CVTAUTH  EQU   CVTMAP+392                                               03049000
CVTATMCA EQU   CVTATMCT+1                                               03050000
CVTATMST EQU   CVTATMCT                                                 03051000
CVTRSV61 EQU   CVTMAP+384                                               03052000
CVTVOLT1 EQU   CVTVOLM1+1                                               03053000
CVTVOLI1 EQU   CVTVOLF1                                                 03054000
CVTSTOA  EQU   CVTMAP+376                                               03055000
CVTRSV58 EQU   CVTMAP+374                                               03056000
CVTRSV57 EQU   CVTMAP+372                                               03057000
CVTDDCE  EQU   CVTMAP+368                                               03058000
CVTPNWFR EQU   CVTMAP+364                                               03059000
CVTSMF   EQU   CVTMAP+360                                               03060000
CVTSULK  EQU   CVTMAP+358                                               03061000
CVTSLKO  EQU   CVTSYSK                                                  03062000
CVTSLKP  EQU   CVTSYSK                                                  03063000
CVTSLKQ  EQU   CVTSYSK                                                  03064000
CVTSLKR  EQU   CVTSYSK                                                  03065000
CVTRSV56 EQU   CVTSYSK                                                  03066000
CVTRSV55 EQU   CVTSYSK                                                  03067000
CVTRSV54 EQU   CVTSYSK                                                  03068000
CVTRSV53 EQU   CVTSYSK                                                  03069000
CVTRSV52 EQU   CVTA1F1                                                  03070000
CVTRSV51 EQU   CVTA1F1                                                  03071000
CVTRSV50 EQU   CVTA1F1                                                  03072000
CVTRSV49 EQU   CVTA1F1                                                  03073000
CVTRSV48 EQU   CVTA1F1                                                  03074000
CVTRSV47 EQU   CVTA1F1                                                  03075000
CVTSRSW  EQU   CVTA1F1                                                  03076000
CVTPFSW  EQU   CVTA1F1                                                  03077000
CVTPCVT  EQU   CVTMAP+352                                               03078000
CVTRSV46 EQU   CVTMAP+344                                               03079000
CVTRSV45 EQU   CVTMAP+340                                               03080000
CVTRSV44 EQU   CVTMAP+338                                               03081000
CVTRSV43 EQU   CVTMAP+336                                               03082000
CVTHJESA EQU   CVTHJES+1                                                03083000
CVTRSV42 EQU   CVTHJES                                                  03084000
CVTEXT2A EQU   CVTEXT2+1                                                03085000
CVTRSV41 EQU   CVTEXT2                                                  03086000
CVTAPFA  EQU   CVTAPF+1                                                 03087000
CVTRSV40 EQU   CVTAPF                                                   03088000
CVTRV518 EQU   CVTINTLA                                                 03089000
CVTRV517 EQU   CVTERPV                                                  03090000
CVTEORM  EQU   CVTMAP+312                                               03091000
CVTMCHPR EQU   CVTMAP+308                                               03092000
CVTTZ    EQU   CVTMAP+304                                               03093000
CVTJEPS  EQU   CVTMAP+300                                               03094000
CVTJESCT EQU   CVTMAP+296                                               03095000
CVTMODE  EQU   CVTMAP+292                                               03096000
CVTREAL  EQU   CVTMAP+284                                               03097000
CVTRSV39 EQU   CVTMAP+280                                               03098000
CVTRSV38 EQU   CVTMAP+276                                               03099000
CVTDMSRA EQU   CVTDMSR+1                                                03100000
CVTRV634 EQU   CVTDMSRF                                                 03101000
CVTRV633 EQU   CVTDMSRF                                                 03102000
CVTRV632 EQU   CVTDMSRF                                                 03103000
CVTRV631 EQU   CVTDMSRF                                                 03104000
CVTRV630 EQU   CVTDMSRF                                                 03105000
CVTRV629 EQU   CVTDMSRF                                                 03106000
CVTUDUMP EQU   CVTDMSRF                                                 03107000
CVTSDUMP EQU   CVTDMSRF                                                 03108000
CVTQMSGA EQU   CVTQMSG+1                                                03109000
CVTRSV36 EQU   CVTQMSG                                                  03110000
CVTAMFF  EQU   CVTMAP+264                                               03111000
CVTPURGA EQU   CVTPURG+1                                                03112000
CVTRSV35 EQU   CVTPURG                                                  03113000
CVTCBSP  EQU   CVTMAP+256                                               03114000
CVTATERA EQU   CVTATER+1                                                03115000
CVTSYST  EQU   CVTATER                                                  03116000
CVTVOLT2 EQU   CVTTAT                                                   03117000
CVTVOLI2 EQU   CVTVOLF2                                                 03118000
CVTAQAVB EQU   CVTAQAVT+1                                               03119000
CVTRSV34 EQU   CVTTCMFG                                                 03120000
CVTRSV33 EQU   CVTTCMFG                                                 03121000
CVTRSV32 EQU   CVTTCMFG                                                 03122000
CVTRSV31 EQU   CVTTCMFG                                                 03123000
CVTRSV30 EQU   CVTTCMFG                                                 03124000
CVTRSV29 EQU   CVTTCMFG                                                 03125000
CVTRSV28 EQU   CVTTCMFG                                                 03126000
CVTTCRDY EQU   CVTTCMFG                                                 03127000
CVTGTFA  EQU   CVTGTF+1                                                 03128000
CVTRSV27 EQU   CVTGTFST                                                 03129000
CVTRNIO  EQU   CVTGTFST                                                 03130000
CVTUSR   EQU   CVTGTFST                                                 03131000
CVTRV318 EQU   CVTFORM                                                  03132000
CVTRV317 EQU   CVTTMODE                                                 03133000
CVTRV316 EQU   CVTSTATE                                                 03134000
CVTRV315 EQU   CVTGTFS                                                  03135000
CVTGTFAV EQU   CVTGTFS                                                  03136000
CVT0SCR1 EQU   CVTMAP+232                                               03137000
CVTRV515 EQU   CVTMAP+228                                               03138000
CVTRMS   EQU   CVTMAP+224                                               03139000
CVTPATCH EQU   CVTMAP+220                                               03140000
CVTTSCE  EQU   CVTMAP+216                                               03141000
CVTLNKSC EQU   CVTMAP+214                                               03142000
CVTQABST EQU   CVTMAP+212                                               03143000
CVTMDLDS EQU   CVTMAP+208                                               03144000
CVTUSER  EQU   CVTMAP+204                                               03145000
CVTABEND EQU   CVTMAP+200                                               03146000
CVTSMCA  EQU   CVTMAP+196                                               03147000
CVTRSV18 EQU   CVTMAP+192                                               03148000
CVTQLPAQ EQU   CVTMAP+188                                               03149000
CVTQCDSR EQU   CVTMAP+184                                               03150000
CVTRSV17 EQU   CVTOPTB                                                  03151000
CVTRSV16 EQU   CVTOPTB                                                  03152000
CVTFP    EQU   CVTOPTB                                                  03153000
CVTAPTHR EQU   CVTOPTB                                                  03154000
CVTNLOG  EQU   CVTOPTB                                                  03155000
CVTTOD   EQU   CVTOPTB                                                  03156000
CVTCTIMS EQU   CVTOPTB                                                  03157000
CVTPROT  EQU   CVTOPTB                                                  03158000
CVTXPFP  EQU   CVTOPTA                                                  03159000
CVTASCII EQU   CVTOPTA                                                  03160000
CVTRSV13 EQU   CVTOPTA                                                  03161000
CVTRSV12 EQU   CVTOPTA                                                  03162000
CVTNIP   EQU   CVTOPTA                                                  03163000
CVTDDR   EQU   CVTOPTA                                                  03164000
CVTAPR   EQU   CVTOPTA                                                  03165000
CVTCCH   EQU   CVTOPTA                                                  03166000
CVTSNCTR EQU   CVTMAP+180                                               03167000
CVTQMWR  EQU   CVTMAP+176                                               03168000
CVTQOCR  EQU   CVTMAP+172                                               03169000
CVT1EF00 EQU   CVTMAP+168                                               03170000
CVTMZ00  EQU   CVTMAP+164                                               03171000
CVTSV76Q EQU   CVTSV76C                                                 03172000
CVTRSV11 EQU   CVTMAP+156                                               03173000
CVT0PT01 EQU   CVTMAP+152                                               03174000
CVTMSER  EQU   CVTMAP+148                                               03175000
CVTRV516 EQU   CVTIERLC                                                 03176000
CVTILCH  EQU   CVTMAP+140                                               03177000
CVT0DS   EQU   CVTMAP+136                                               03178000
CVTFBOSV EQU   CVTMAP+132                                               03179000
CVTNUCB  EQU   CVTMAP+128                                               03180000
CVTIXAVL EQU   CVTMAP+124                                               03181000
CVTSV76M EQU   CVTIOQET                                                 03182000
CVTDCBA  EQU   CVTMAP+117                                               03183000
CVTMVS2  EQU   CVTDCB                                                   03184000
CVT6DAT  EQU   CVTDCB                                                   03185000
CVT4MPS  EQU   CVTDCB                                                   03186000
CVTRSV09 EQU   CVTDCB                                                   03187000
CVT4MS1  EQU   CVTDCB                                                   03188000
CVT2SPS  EQU   CVTDCB                                                   03189000
CVT1SSS  EQU   CVTDCB                                                   03190000
CVTRSV08 EQU   CVTDCB                                                   03191000
CVTQTD00 EQU   CVTMAP+108                                               03192000
CVTQTE00 EQU   CVTMAP+104                                               03193000
CVTCUCB  EQU   CVTMAP+100                                               03194000
CVTSJQ   EQU   CVTMAP+96                                                03195000
CVTPBLDL EQU   CVTMAP+92                                                03196000
CVTTPC   EQU   CVTMAP+88                                                03197000
CVTSVDCB EQU   CVTMAP+84                                                03198000
CVTBRET  EQU   CVTMAP+82                                                03199000
CVTEXIT  EQU   CVTMAP+80                                                03200000
CVT0FN00 EQU   CVTMAP+76                                                03201000
CVTDARA  EQU   CVTDAR+1                                                 03202000
CVTRSV07 EQU   CVTFLGS1                                                 03203000
CVTRSV06 EQU   CVTFLGS1                                                 03204000
CVTRSV05 EQU   CVTFLGS1                                                 03205000
CVTRSV04 EQU   CVTFLGS1                                                 03206000
CVTRSV03 EQU   CVTFLGS1                                                 03207000
CVTRSV02 EQU   CVTFLGS1                                                 03208000
CVTRSV01 EQU   CVTFLGS1                                                 03209000
CVTDMPLK EQU   CVTFLGS1                                                 03210000
CVTXITP  EQU   CVTMAP+68                                                03211000
CVTZDTAB EQU   CVTMAP+64                                                03212000
CVTMSLT  EQU   CVTMAP+60                                                03213000
CVTDATE  EQU   CVTMAP+56                                                03214000
CVTBTERM EQU   CVTMAP+52                                                03215000
CVTSYSAD EQU   CVTMAP+48                                                03216000
CVTILK2  EQU   CVTMAP+40                                                03217000
CVTILK1  EQU   CVTMAP+36                                                03218000
CVTPRLTV EQU   CVTMAP+32                                                03219000
CVTPCNVT EQU   CVTMAP+28                                                03220000
CVT0VL00 EQU   CVTMAP+24                                                03221000
CVTXAPG  EQU   CVTMAP+20                                                03222000
CVTBUF   EQU   CVTMAP+16                                                03223000
CVTJOB   EQU   CVTMAP+12                                                03224000
CVTLINK  EQU   CVTMAP+8                                                 03225000
CVT0EF00 EQU   CVTMAP+4                                                 03226000
CVTTCBP  EQU   CVTMAP                                                   03227000
CVT      EQU   CVTMAP                                                   03228000
CCWCOUNT EQU   CCW+6                                                    03229000
CCWRSV   EQU   CCW+5                                                    03230000
@NM00106 EQU   CCWFLAGS                                                 03231000
CCWIDA   EQU   CCWFLAGS                                                 03232000
CCWPCI   EQU   CCWFLAGS                                                 03233000
CCWSKIP  EQU   CCWFLAGS                                                 03234000
CCWSLI   EQU   CCWFLAGS                                                 03235000
SAVTLLCB EQU   IEDNSVTD+316                                             03236000
SAVTBITN EQU   IEDNSVTD+312                                             03237000
@NM00105 EQU   SAVTCKQB+8                                               03238000
@NM00104 EQU   SAVTCKEC+1                                               03239000
@NM00103 EQU   SAVTCKCC                                                 03240000
SAVTCKPO EQU   SAVTCKCC                                                 03241000
SAVTCKWA EQU   SAVTCKCC                                                 03242000
SAVTCKCH EQU   SAVTCKTB+1                                               03243000
SAVTCKVT EQU   SAVTCKTB                                                 03244000
@NM00102 EQU   IEDNSVTD+297                                             03245000
SAVTRDFG EQU   SAVTRDRV+12                                              03246000
@NM00101 EQU   SAVTRDRV+5                                               03247000
SAVTRDPY EQU   SAVTRDRV+4                                               03248000
SAVTRDQB EQU   SAVTRDRV+1                                               03249000
SAVTRDKY EQU   SAVTRDRV                                                 03250000
SAVTNID  EQU   IEDNSVTD+280                                             03251000
SAVTDVAS EQU   IEDNSVTD+276                                             03252000
SAVTPLSZ EQU   IEDNSVTD+274                                             03253000
@NM00100 EQU   IEDNSVTD+273                                             03254000
SAVTSUBL EQU   IEDNSVTD+272                                             03255000
@NM00099 EQU   SAVTZELM+1                                               03256000
SAVTSUBM EQU   SAVTZELM                                                 03257000
SAVTMHDX EQU   IEDNSVTD+268                                             03258000
SAVTNAT1 EQU   IEDNSVTD+266                                             03259000
SAVTSH20 EQU   IEDNSVTD+264                                             03260000
SAVTLCBS EQU   IEDNSVTD+260                                             03261000
SAVTRNMP EQU   IEDNSVTD+256                                             03262000
SAVTTNTX EQU   IEDNSVTD+252                                             03263000
SAVTNAX  EQU   IEDNSVTD+248                                             03264000
SAVTSUBV EQU   IEDNSVTD+247                                             03265000
SAVTSUBA EQU   IEDNSVTD+246                                             03266000
SAVTSIBC EQU   IEDNSVTD+244                                             03267000
SAVTBSM  EQU   IEDNSVTD+240                                             03268000
SAVTSCPT EQU   SAVTTCPU                                                 03269000
SAVTRQTG EQU   IEDNSVTD+236                                             03270000
SAVTRQCH EQU   IEDNSVTD+232                                             03271000
SAVTMAND EQU   IEDNSVTD+228                                             03272000
SAVTSPLN EQU   IEDNSVTD+224                                             03273000
SAVTNADL EQU   IEDNSVTD+222                                             03274000
SAVTNATL EQU   IEDNSVTD+220                                             03275000
SAVTMHTB EQU   IEDNSVTD+216                                             03276000
SAVTSSMH EQU   IEDNSVTD+212                                             03277000
SAVTQRS  EQU   IEDNSVTD+208                                             03278000
SAVTRQIN EQU   IEDNSVTD+204                                             03279000
SAVTDFCO EQU   IEDNSVTD+200                                             03280000
SAVTSAO  EQU   IEDNSVTD+196                                             03281000
SAVTSARI EQU   IEDNSVTD+192                                             03282000
SAVTSAC  EQU   IEDNSVTD+188                                             03283000
SAVTSAI  EQU   IEDNSVTD+184                                             03284000
SAVTCSCI EQU   IEDNSVTD+180                                             03285000
SAVTSSRP EQU   IEDNSVTD+176                                             03286000
SAVTSSRQ EQU   IEDNSVTD+172                                             03287000
SAVTSCLU EQU   IEDNSVTD+168                                             03288000
SAVTXTRQ EQU   IEDNSVTD+164                                             03289000
SAVTMVBF EQU   IEDNSVTD+160                                             03290000
@NM00098 EQU   IEDNSVTD+148                                             03291000
SAVTIPCQ EQU   IEDNSVTD+144                                             03292000
@NM00097 EQU   IEDNSVTD+136                                             03293000
SAVTXFMI EQU   IEDNSVTD+132                                             03294000
@NM00096 EQU   IEDNSVTD+124                                             03295000
SAVTXFMO EQU   IEDNSVTD+120                                             03296000
@NM00095 EQU   IEDNSVTD+116                                             03297000
SAVTSSSR EQU   IEDNSVTD+112                                             03298000
SAVTSCPQ EQU   IEDNSVTD+108                                             03299000
SAVTSLCB EQU   IEDNSVTD+104                                             03300000
SAVTLUSR EQU   IEDNSVTD+100                                             03301000
@NM00094 EQU   SAVTLUSQ+8                                               03302000
SAVTLUSP EQU   SAVTLUSQ+4                                               03303000
SAVTLUSB EQU   SAVTLUSQ                                                 03304000
@NM00093 EQU   IEDNSVTD+84                                              03305000
SAVTSAT  EQU   IEDNSVTD+80                                              03306000
SAVTNAT  EQU   IEDNSVTD+76                                              03307000
SAVTCLUP EQU   IEDNSVTD+72                                              03308000
SAVTPIUT EQU   IEDNSVTD+68                                              03309000
SAVTRNTA EQU   IEDNSVTD+64                                              03310000
SAVTDNIR EQU   IEDNSVTD+60                                              03311000
SAVTCNIR EQU   IEDNSVTD+56                                              03312000
SAVTFLDH EQU   IEDNSVTD+52                                              03313000
SAVTSRTN EQU   IEDNSVTD+48                                              03314000
SAVTSREQ EQU   IEDNSVTD+44                                              03315000
SAVTFAIL EQU   IEDNSVTD+42                                              03316000
SAVTSUSE EQU   IEDNSVTD+40                                              03317000
SAVTSIB  EQU   IEDNSVTD+36                                              03318000
SAVTPRTN EQU   IEDNSVTD+32                                              03319000
@NM00092 EQU   IEDNSVTD+28                                              03320000
SAVTWH20 EQU   IEDNSVTD+26                                              03321000
SAVTPWT  EQU   IEDNSVTD+24                                              03322000
SAVTPRTQ EQU   IEDNSVTD+20                                              03323000
SAVTPREQ EQU   IEDNSVTD+16                                              03324000
SAVTPH20 EQU   IEDNSVTD+14                                              03325000
SAVTPUSE EQU   IEDNSVTD+12                                              03326000
SAVTPLCB EQU   IEDNSVTD+8                                               03327000
SAVTPOOL EQU   IEDNSVTD+4                                               03328000
SAVTPRMT EQU   SAVTDIAF                                                 03329000
SAVTVIRT EQU   SAVTDIAF                                                 03330000
AVTCPBNO EQU   IEDQAVTD+1244                                            03331000
AVTHRESS EQU   IEDQAVTD+1243                                            03332000
@NM00091 EQU   IEDQAVTD+1242                                            03333000
@NM00090 EQU   IEDQAVTD+1241                                            03334000
@NM00089 EQU   IEDQAVTD+1240                                            03335000
@NM00088 EQU   IEDQAVTD+1237                                            03336000
@NM00087 EQU   IEDQAVTD+1236                                            03337000
AVTHRESE EQU   @NM00086                                                 03338000
AVTRADDR EQU   IEDQAVTD+1228                                            03339000
AVTNADDR EQU   IEDQAVTD+1224                                            03340000
AVTHRESN EQU   IEDQAVTD+1220                                            03341000
AVTVOLRN EQU   IEDQAVTD+1216                                            03342000
AVTTOTNN EQU   IEDQAVTD+1212                                            03343000
AVTTRCYN EQU   IEDQAVTD+1208                                            03344000
AVTRCTRN EQU   IEDQAVTD+1204                                            03345000
AVTNOVON EQU   IEDQAVTD+1200                                            03346000
AVTADEBN EQU   IEDQAVTD+1196                                            03347000
AVTVOLRR EQU   IEDQAVTD+1192                                            03348000
AVTTOTNR EQU   IEDQAVTD+1188                                            03349000
AVTTRCYR EQU   IEDQAVTD+1184                                            03350000
AVTRCTRR EQU   IEDQAVTD+1180                                            03351000
AVTNOVOR EQU   IEDQAVTD+1176                                            03352000
AVTADEBR EQU   IEDQAVTD+1172                                            03353000
AVTLODPT EQU   IEDQAVTD+1168                                            03354000
AVTIOBN  EQU   IEDQAVTD+1164                                            03355000
AVTIOBR  EQU   IEDQAVTD+1160                                            03356000
AVTCPBPT EQU   IEDQAVTD+1156                                            03357000
AVTFCPB  EQU   IEDQAVTD+1152                                            03358000
@NM00085 EQU   IEDQAVTD+1148                                            03359000
AVTINCPQ EQU   IEDQAVTD+1144                                            03360000
@NM00084 EQU   IEDQAVTD+1140                                            03361000
@NM00083 EQU   IEDQAVTD+1137                                            03362000
@NM00082 EQU   AVTBIT4                                                  03363000
@NM00081 EQU   AVTBIT4                                                  03364000
@NM00080 EQU   AVTBIT4                                                  03365000
@NM00079 EQU   AVTBIT4                                                  03366000
@NM00078 EQU   AVTBIT4                                                  03367000
@NM00077 EQU   AVTBIT4                                                  03368000
@NM00076 EQU   AVTBIT4                                                  03369000
AVTRUFTN EQU   AVTBIT4                                                  03370000
@NM00075 EQU   IEDQAVTD+1132                                            03371000
AVTNOBFQ EQU   IEDQAVTD+1128                                            03372000
@NM00074 EQU   IEDQAVTD+1124                                            03373000
AVTDKENQ EQU   IEDQAVTD+1120                                            03374000
@NM00073 EQU   IEDQAVTD+1116                                            03375000
AVTDKAPQ EQU   IEDQAVTD+1112                                            03376000
AVTCOPY  EQU   IEDQAVTD+1108                                            03377000
AVTIA    EQU   IEDQAVTD+1104                                            03378000
AVTFL    EQU   IEDQAVTD+1100                                            03379000
@NM00072 EQU   IEDQAVTD+1096                                            03380000
AVTNCPBQ EQU   IEDQAVTD+1092                                            03381000
AVTTOTNC EQU   IEDQAVTD+1088                                            03382000
AVTCMAX  EQU   IEDQAVTD+1084                                            03383000
AVTCMIN  EQU   IEDQAVTD+1080                                            03384000
AVTHM02  EQU   IEDQAVTD+1076                                            03385000
AVTOPCIN EQU   IEDQAVTD+1074                                            03386000
AVTDCTLN EQU   IEDQAVTD+1072                                            03387000
AVTOPMSK EQU   IEDQAVTD+1068                                            03388000
AVTDDFT  EQU   IEDQAVTD+1064                                            03389000
AVTSTEAL EQU   IEDQAVTD+1060                                            03390000
AVTOPTN  EQU   IEDQAVTD+1056                                            03391000
AVTDSKCT EQU   IEDQAVTD+1054                                            03392000
AVTCKRST EQU   IEDQAVTD+1053                                            03393000
AVTSTAN  EQU   AVTBIT3                                                  03394000
AVTSTACN EQU   AVTBIT3                                                  03395000
AVTSTAIN EQU   AVTBIT3                                                  03396000
AVTSTAYN EQU   AVTBIT3                                                  03397000
AVTOLTBN EQU   AVTBIT3                                                  03398000
AVTTSAB  EQU   AVTBIT3                                                  03399000
AVTRFULN EQU   AVTBIT3                                                  03400000
AVTRECVN EQU   AVTBIT3                                                  03401000
@NM00071 EQU   AVTBIT2                                                  03402000
@NM00070 EQU   AVTBIT2                                                  03403000
AVTOPEIN EQU   AVTBIT2                                                  03404000
AVTSTRTN EQU   AVTBIT2                                                  03405000
AVTTOPOL EQU   AVTBIT2                                                  03406000
AVTCOPYN EQU   AVTBIT2                                                  03407000
AVTREUSN EQU   AVTBIT2                                                  03408000
AVTEXTSC EQU   AVTBIT2                                                  03409000
AVTDISKN EQU   AVTBIT1                                                  03410000
AVTQUCKN EQU   AVTBIT1                                                  03411000
AVTCLOSN EQU   AVTBIT1                                                  03412000
AVTREADN EQU   AVTBIT1                                                  03413000
AVTDLAYN EQU   AVTBIT1                                                  03414000
AVTAQTAN EQU   AVTBIT1                                                  03415000
AVTTSON  EQU   AVTBIT1                                                  03416000
AVTAPLKN EQU   AVTBIT1                                                  03417000
AVTDUMBR EQU   IEDQAVTD+1048                                            03418000
AVTDLQX  EQU   IEDQAVTD+1046                                            03419000
AVTINTLV EQU   IEDQAVTD+1044                                            03420000
AVTSMCNT EQU   IEDQAVTD+1042                                            03421000
AVTAVFCT EQU   IEDQAVTD+1040                                            03422000
AVTOPCON EQU   IEDQAVTD+1038                                            03423000
AVTOPCNT EQU   IEDQAVTD+1036                                            03424000
AVTLNCNT EQU   IEDQAVTD+1034                                            03425000
AVTKEYLE EQU   IEDQAVTD+1032                                            03426000
AVTHA16  EQU   IEDQAVTD+1030                                            03427000
AVTHA7   EQU   IEDQAVTD+1028                                            03428000
AVTHA4   EQU   IEDQAVTD+1026                                            03429000
AVTHA3   EQU   IEDQAVTD+1024                                            03430000
AVTHA2   EQU   IEDQAVTD+1022                                            03431000
AVTGETMS EQU   IEDQAVTD+1021                                            03432000
@NM00069 EQU   IEDQAVTD+1020                                            03433000
AVTGETMD EQU   IEDQAVTD+1016                                            03434000
AVTGETMN EQU   IEDQAVTD+1012                                            03435000
AVTCWTOT EQU   IEDQAVTD+1008                                            03436000
AVTCWINT EQU   IEDQAVTD+956                                             03437000
AVTDTRAP EQU   IEDQAVTD+952                                             03438000
@NM00068 EQU   IEDQAVTD+950                                             03439000
@NM00067 EQU   AVTIOTR                                                  03440000
AVTIOTRH EQU   AVTIOTR                                                  03441000
AVTIOTRE EQU   AVTIOTR                                                  03442000
@NM00066 EQU   AVTSUBT                                                  03443000
AVTSUBPT EQU   AVTSUBT                                                  03444000
AVTSUBON EQU   AVTSUBT                                                  03445000
AVTAFE30 EQU   IEDQAVTD+944                                             03446000
AVTAFE20 EQU   IEDQAVTD+940                                             03447000
AVTAFE10 EQU   IEDQAVTD+936                                             03448000
AVTCWEC2 EQU   IEDQAVTD+932                                             03449000
AVTCWPM2 EQU   IEDQAVTD+928                                             03450000
AVTCWTS2 EQU   IEDQAVTD+927                                             03451000
AVTCWTS1 EQU   IEDQAVTD+926                                             03452000
AVTCWCLD EQU   AVTCWFL2                                                 03453000
AVTCWRAP EQU   AVTCWFL2                                                 03454000
@NM00065 EQU   AVTCWFL2                                                 03455000
@NM00064 EQU   AVTCWFL2                                                 03456000
@NM00063 EQU   AVTCWFL2                                                 03457000
@NM00062 EQU   AVTCWFL2                                                 03458000
@NM00061 EQU   AVTCWFL2                                                 03459000
AVTCWACT EQU   AVTCWFL2                                                 03460000
@NM00060 EQU   AVTCWFL1                                                 03461000
@NM00059 EQU   AVTCWFL1                                                 03462000
@NM00058 EQU   AVTCWFL1                                                 03463000
@NM00057 EQU   AVTCWFL1                                                 03464000
@NM00056 EQU   AVTCWFL1                                                 03465000
@NM00055 EQU   AVTCWFL1                                                 03466000
@NM00054 EQU   AVTCWFL1                                                 03467000
AVTCOMWN EQU   AVTCWFL1                                                 03468000
AVTCWEC1 EQU   IEDQAVTD+920                                             03469000
AVTCWPM1 EQU   IEDQAVTD+916                                             03470000
AVTCAREA EQU   IEDQAVTD+912                                             03471000
AVTFZERO EQU   IEDQAVTD+908                                             03472000
AVTCADDR EQU   IEDQAVTD+904                                             03473000
AVTCOREC EQU   IEDQAVTD+900                                             03474000
@NM00053 EQU   IEDQAVTD+892                                             03475000
AVTCPBCB EQU   IEDQAVTD+888                                             03476000
@NM00052 EQU   IEDQAVTD+880                                             03477000
AVTDSIOB EQU   IEDQAVTD+876                                             03478000
@NM00051 EQU   IEDQAVTD+868                                             03479000
AVTCPRMB EQU   IEDQAVTD+864                                             03480000
@NM00050 EQU   IEDQAVTD+856                                             03481000
AVTCLOSB EQU   IEDQAVTD+852                                             03482000
@NM00049 EQU   IEDQAVTD+844                                             03483000
AVTACTIB EQU   IEDQAVTD+840                                             03484000
@NM00048 EQU   IEDQAVTD+836                                             03485000
AVTOLTEB EQU   IEDQAVTD+832                                             03486000
AVTOLTCH EQU   AVTOLTQB+1                                               03487000
AVTOLTVT EQU   AVTOLTQB                                                 03488000
@NM00047 EQU   AVTOPCQB+8                                               03489000
@NM00046 EQU   AVTOPCEC+1                                               03490000
@NM00045 EQU   AVTOPCCC                                                 03491000
AVTOPCPO EQU   AVTOPCCC                                                 03492000
AVTOPCWA EQU   AVTOPCCC                                                 03493000
AVTOPCCH EQU   AVTOPCOB+1                                               03494000
AVTOPCVT EQU   AVTOPCOB                                                 03495000
@NM00044 EQU   AVTCKPQB+9                                               03496000
AVTCKPTS EQU   AVTCKPQB+8                                               03497000
@NM00043 EQU   AVTCKPEC+1                                               03498000
@NM00042 EQU   AVTCKPCC                                                 03499000
AVTCKPPO EQU   AVTCKPCC                                                 03500000
AVTCKPWA EQU   AVTCKPCC                                                 03501000
AVTCKPCH EQU   AVTCKPTB+1                                               03502000
AVTCKPVT EQU   AVTCKPTB                                                 03503000
@NM00041 EQU   IEDQAVTD+796                                             03504000
AVTBFRTB EQU   IEDQAVTD+792                                             03505000
@NM00040 EQU   IEDQAVTD+788                                             03506000
AVTSELCH EQU   IEDQAVTD+785                                             03507000
AVTBFRTN EQU   AVTBFRFG                                                 03508000
AVTBFREB EQU   IEDQAVTD+780                                             03509000
AVTTIMQ  EQU   IEDQAVTD+776                                             03510000
@NM00039 EQU   IEDQAVTD+772                                             03511000
AVTIMQPS EQU   IEDQAVTD+768                                             03512000
AVTINOUT EQU   IEDQAVTD+766                                             03513000
AVTREFTM EQU   IEDQAVTD+764                                             03514000
@NM00038 EQU   IEDQAVTD+752                                             03515000
AVTDELYB EQU   IEDQAVTD+748                                             03516000
AVTOCQPT EQU   IEDQAVTD+744                                             03517000
AVTTSOPT EQU   IEDQAVTD+740                                             03518000
AVTSUPPT EQU   IEDQAVTD+736                                             03519000
AVTCBQCB EQU   IEDQAVTD+732                                             03520000
AVTMSGS  EQU   IEDQAVTD+729                                             03521000
@NM00037 EQU   AVTSYSER                                                 03522000
@NM00036 EQU   AVTSYSER                                                 03523000
@NM00035 EQU   AVTSYSER                                                 03524000
@NM00034 EQU   AVTSYSER                                                 03525000
@NM00033 EQU   AVTSYSER                                                 03526000
@NM00032 EQU   AVTSYSER                                                 03527000
AVTCMAXN EQU   AVTSYSER                                                 03528000
AVTCMINN EQU   AVTSYSER                                                 03529000
AVT2260L EQU   IEDQAVTD+724                                             03530000
AVTABEPL EQU   AVTADBUF                                                 03531000
AVTHFF   EQU   AVTCLRHI+2                                               03532000
@NM00031 EQU   AVTCLRHI                                                 03533000
AVTCCLNK EQU   AVTCRELE+5                                               03534000
AVTCCPRI EQU   AVTCRELE+4                                               03535000
AVTCCQCB EQU   AVTCCELE+1                                               03536000
AVTCCKEY EQU   AVTCCELE                                                 03537000
AVTDELAD EQU   IEDQAVTD+704                                             03538000
AVTDELEM EQU   IEDQAVTD+700                                             03539000
AVTBSX   EQU   AVTCKLNK                                                 03540000
AVTOPETR EQU   AVTHG01                                                  03541000
@NM00030 EQU   AVTCKBYT                                                 03542000
AVTCKONQ EQU   AVTCKBYT                                                 03543000
@NM00029 EQU   AVTCKBYT                                                 03544000
@NM00028 EQU   AVTCKBYT                                                 03545000
@NM00027 EQU   AVTCKBYT                                                 03546000
@NM00026 EQU   AVTCKBYT                                                 03547000
@NM00025 EQU   AVTCKBYT                                                 03548000
@NM00024 EQU   AVTCKBYT                                                 03549000
AVTOPERT EQU   IEDQAVTD+690                                             03550000
AVTOPXCL EQU   IEDQAVTD+688                                             03551000
AVTOPERL EQU   IEDQAVTD+687                                             03552000
@NM00023 EQU   IEDQAVTD+686                                             03553000
AVTCKTIM EQU   IEDQAVTD+684                                             03554000
AVTCKELV EQU   IEDQAVTD+682                                             03555000
AVTCPRCD EQU   IEDQAVTD+681                                             03556000
AVTWARMN EQU   AVTCKELF                                                 03557000
AVTCRTLN EQU   AVTCKELF                                                 03558000
AVTCPIPN EQU   AVTCKELF                                                 03559000
AVTCCLCN EQU   AVTCKELF                                                 03560000
AVTCINCN EQU   AVTCKELF                                                 03561000
@NM00022 EQU   AVTCKELF                                                 03562000
AVTCMCPN EQU   AVTCKELF                                                 03563000
AVTNQBCK EQU   AVTCKELF                                                 03564000
AVTCKQAD EQU   IEDQAVTD+677                                             03565000
AVTSCBSZ EQU   IEDQAVTD+676                                             03566000
@NM00021 EQU   IEDQAVTD+672                                             03567000
AVTCKELE EQU   IEDQAVTD+668                                             03568000
@NM00020 EQU   AVTCKPEL+8                                               03569000
AVTCKRLK EQU   AVTCKPEL+5                                               03570000
AVTCKRPR EQU   AVTCKPEL+4                                               03571000
AVTCKRMQ EQU   AVTCKRMV+1                                               03572000
AVTCKRKY EQU   AVTCKRMV                                                 03573000
AVTHK    EQU   IEDQAVTD+648                                             03574000
AVTHI    EQU   IEDQAVTD+644                                             03575000
AVTNX    EQU   IEDQAVTD+636                                             03576000
AVTTONE  EQU   IEDQAVTD+632                                             03577000
AVTA3TL  EQU   IEDQAVTD+628                                             03578000
AVTDMECB EQU   IEDQAVTD+624                                             03579000
AVTABEND EQU   IEDQAVTD+618                                             03580000
AVTPLCBN EQU   IEDQAVTD+616                                             03581000
@NM00019 EQU   AVTSAVTP+1                                               03582000
@NM00018 EQU   AVTSAVTF                                                 03583000
AVTSNA   EQU   AVTSAVTF                                                 03584000
AVTONSNA EQU   AVTSAVTF                                                 03585000
AVTVTMCP EQU   AVTSAVTF                                                 03586000
@NM00017 EQU   IEDQAVTD+608                                             03587000
AVTCMBSS EQU   IEDQAVTD+604                                             03588000
AVTRCV   EQU   IEDQAVTD+600                                             03589000
AVTSEND  EQU   IEDQAVTD+596                                             03590000
AVTCSCH  EQU   IEDQAVTD+592                                             03591000
AVTQ1    EQU   IEDQAVTD+588                                             03592000
AVTE7    EQU   IEDQAVTD+584                                             03593000
AVTHB    EQU   IEDQAVTD+580                                             03594000
AVTR1    EQU   IEDQAVTD+576                                             03595000
AVTBZ    EQU   IEDQAVTD+572                                             03596000
AVTEZ    EQU   IEDQAVTD+568                                             03597000
AVTEC    EQU   IEDQAVTD+564                                             03598000
AVTEW    EQU   IEDQAVTD+560                                             03599000
AVTNDIAL EQU   AVTSCOPT                                                 03600000
AVTN2741 EQU   AVTSCOPT                                                 03601000
AVTCONCO EQU   AVTSCOPT                                                 03602000
AVTCONC  EQU   AVTSCOPT                                                 03603000
AVTCMBUF EQU   AVTSCOPT                                                 03604000
AVTAPDMP EQU   AVTSCOPT                                                 03605000
@NM00016 EQU   AVTSCOPT                                                 03606000
AVTHA    EQU   AVTDISP                                                  03607000
AVTEA    EQU   IEDQAVTD+548                                             03608000
AVTAX    EQU   IEDQAVTD+544                                             03609000
AVTA3    EQU   IEDQAVTD+540                                             03610000
AVTGD    EQU   IEDQAVTD+536                                             03611000
AVTAL    EQU   IEDQAVTD+532                                             03612000
AVTOLTST EQU   AVTHG02                                                  03613000
AVTE8    EQU   IEDQAVTD+524                                             03614000
AVTUI    EQU   IEDQAVTD+520                                             03615000
AVTCOMPT EQU   IEDQAVTD+516                                             03616000
AVTCRSRF EQU   IEDQAVTD+512                                             03617000
@NM00015 EQU   IEDQAVTD+508                                             03618000
AVTKA02  EQU   IEDQAVTD+504                                             03619000
AVTOPTPT EQU   IEDQAVTD+500                                             03620000
AVTPCBPT EQU   IEDQAVTD+496                                             03621000
@NM00014 EQU   AVTECB1                                                  03622000
AVTCOMP  EQU   AVTECB1                                                  03623000
@NM00013 EQU   AVTECB1                                                  03624000
AVTOPECA EQU   IEDQAVTD+488                                             03625000
AVTOLECA EQU   IEDQAVTD+484                                             03626000
AVTCKECA EQU   IEDQAVTD+480                                             03627000
AVTCWECA EQU   IEDQAVTD+476                                             03628000
AVTCWTCB EQU   IEDQAVTD+472                                             03629000
AVTOLTCB EQU   IEDQAVTD+468                                             03630000
AVTOCTCB EQU   IEDQAVTD+464                                             03631000
AVTCKTCB EQU   IEDQAVTD+460                                             03632000
AVTAS    EQU   IEDQAVTD+456                                             03633000
AVTNOLBF EQU   IEDQAVTD+454                                             03634000
AVTNCKPR EQU   IEDQAVTD+453                                             03635000
AVTCIB   EQU   IEDQAVTD+452                                             03636000
AVTSPLPT EQU   IEDQAVTD+448                                             03637000
AVTMVBFR EQU   IEDQAVTD+444                                             03638000
AVTSBTA  EQU   IEDQAVTD+440                                             03639000
AVTRARTN EQU   IEDQAVTD+436                                             03640000
AVTBSCAN EQU   IEDQAVTD+432                                             03641000
AVTRDYA  EQU   IEDQAVTD+428                                             03642000
AVTDISTR EQU   IEDQAVTD+420                                             03643000
AVTPARM3 EQU   IEDQAVTD+416                                             03644000
@NM00012 EQU   AVTPKF                                                   03645000
@NM00011 EQU   AVTPKF                                                   03646000
@NM00010 EQU   AVTPKF                                                   03647000
AVTFTCHF EQU   AVTPKF                                                   03648000
@NM00009 EQU   AVTPKF                                                   03649000
@NM00008 EQU   AVTPKF                                                   03650000
@NM00007 EQU   AVTPKF                                                   03651000
@NM00006 EQU   AVTPKF                                                   03652000
AVTPARM  EQU   IEDQAVTD+408                                             03653000
AVTEXS2A EQU   IEDQAVTD+402                                             03654000
AVTEXA2S EQU   IEDQAVTD+396                                             03655000
AVTOCGET EQU   IEDQAVTD+392                                             03656000
AVTCKAVT EQU   @NM00004+1                                               03657000
@NM00005 EQU   AVTCKFLG                                                 03658000
AVTCKHLT EQU   AVTCKFLG                                                 03659000
AVTCKREQ EQU   AVTCKFLG                                                 03660000
AVTCKENV EQU   AVTCKFLG                                                 03661000
AVTCKNAC EQU   AVTCKFLG                                                 03662000
AVTCKTAC EQU   AVTCKFLG                                                 03663000
AVTBUENT EQU   IEDQAVTD+386                                             03664000
@NM00003 EQU   IEDQAVTD+385                                             03665000
AVTFULLT EQU   AVTBUFSW                                                 03666000
AVTUNCON EQU   AVTBUFSW                                                 03667000
@NM00002 EQU   AVTBUFSW                                                 03668000
AVTBUFTR EQU   AVTREADD                                                 03669000
AVTREADY EQU   IEDQAVTD+376                                             03670000
AVTRACE  EQU   IEDQAVTD+372                                             03671000
AVTTCB   EQU   IEDQAVTD+368                                             03672000
AVTPASWD EQU   IEDQAVTD+360                                             03673000
AVTCTLCH EQU   IEDQAVTD+352                                             03674000
AVTDOUBL EQU   IEDQAVTD+344                                             03675000
AVTDOUBX EQU   IEDQAVTD+336                                             03676000
AVTDPARM EQU   IEDQAVTD+332                                             03677000
AVTCSTCS EQU   IEDQAVTD+328                                             03678000
AVTDLQ   EQU   AVTSAVEX+32                                              03679000
@NM00001 EQU   AVTSAVEX                                                 03680000
AVTSAVE4 EQU   IEDQAVTD+216                                             03681000
AVTSAVE3 EQU   IEDQAVTD+144                                             03682000
AVTSAVE2 EQU   IEDQAVTD+72                                              03683000
AVTSAVE1 EQU   IEDQAVTD                                                 03684000
@NM00199 EQU   PSA+3668                                                 03685000
PSASTAK  EQU   PSA+3072                                                 03686000
@NM00198 EQU   PSA+1048                                                 03687000
PSAUSEND EQU   PSA+1048                                                 03688000
PSARV062 EQU   PSA+1044                                                 03689000
PSACDAL  EQU   PSA+1040                                                 03690000
PSAWTCOD EQU   PSA+1036                                                 03691000
PSAATCVT EQU   PSA+1032                                                 03692000
PSAPCPSW EQU   PSA+1024                                                 03693000
PSAPIR2  EQU   PSA+1020                                                 03694000
PSARV059 EQU   PSA+1018                                                 03695000
PSASVC13 EQU   PSA+1016                                                 03696000
PSALSFCC EQU   PSA+1012                                                 03697000
PSASFACC EQU   PSA+1008                                                 03698000
PSASTOP  EQU   PSA+992                                                  03699000
PSASTART EQU   PSA+976                                                  03700000
PSARSPSW EQU   PSA+968                                                  03701000
PSASRPSW EQU   PSA+960                                                  03702000
PSARV045 EQU   PSA+892                                                  03703000
PSARV044 EQU   PSA+888                                                  03704000
PSARV043 EQU   PSA+884                                                  03705000
PSARV042 EQU   PSA+880                                                  03706000
PSARV041 EQU   PSA+876                                                  03707000
PSARV040 EQU   PSA+872                                                  03708000
PSARV025 EQU   PSA+868                                                  03709000
PSADSSED EQU   PSA+868                                                  03710000
PSADSSPR EQU   PSA+864                                                  03711000
PSADSSFW EQU   PSA+860                                                  03712000
PSADSS14 EQU   PSA+856                                                  03713000
PSADSSPP EQU   PSA+848                                                  03714000
PSADSSRP EQU   PSA+840                                                  03715000
PSADSS05 EQU   PSADSSF4                                                 03716000
PSADSS10 EQU   PSADSSF4                                                 03717000
PSADSSVE EQU   PSADSSF4                                                 03718000
PSADSSDE EQU   PSADSSF4                                                 03719000
PSADSSC0 EQU   PSADSSF4                                                 03720000
PSADSSIE EQU   PSADSSF4                                                 03721000
PSADSS12 EQU   PSADSSF4                                                 03722000
PSADSSRC EQU   PSADSSF4                                                 03723000
PSARV057 EQU   PSADSSF3                                                 03724000
PSARV056 EQU   PSADSSF3                                                 03725000
PSARV055 EQU   PSADSSF3                                                 03726000
PSADSSMC EQU   PSADSSF3                                                 03727000
PSADSSRW EQU   PSADSSF3                                                 03728000
PSADSSNM EQU   PSADSSF3                                                 03729000
PSADSSES EQU   PSADSSF3                                                 03730000
PSADSSGP EQU   PSADSSF3                                                 03731000
PSADSSF2 EQU   PSADSSFL+1                                               03732000
PSADSSPI EQU   PSADSSF1                                                 03733000
PSADSSOI EQU   PSADSSF1                                                 03734000
PSADSSSP EQU   PSADSSF1                                                 03735000
PSADSSTP EQU   PSADSSF1                                                 03736000
PSADSSDW EQU   PSADSSF1                                                 03737000
PSADSSDD EQU   PSADSSF1                                                 03738000
PSADSSDM EQU   PSADSSF1                                                 03739000
PSADSSMV EQU   PSADSSF1                                                 03740000
PSADSSTS EQU   PSA+816                                                  03741000
PSADSSWK EQU   PSA+812                                                  03742000
PSADSSR3 EQU   PSA+808                                                  03743000
PSADSSR2 EQU   PSA+804                                                  03744000
PSADSSRS EQU   PSA+800                                                  03745000
PSASTOR  EQU   PSA+796                                                  03746000
PSACPUSA EQU   PSA+794                                                  03747000
PSAVSTAP EQU   PSA+792                                                  03748000
PSAWKVAP EQU   PSA+788                                                  03749000
PSAWKRAP EQU   PSA+784                                                  03750000
PSAMCHIC EQU   PSA+783                                                  03751000
PSARV061 EQU   PSA+782                                                  03752000
PSASYMSK EQU   PSA+781                                                  03753000
PSAMCHFL EQU   PSA+780                                                  03754000
PSACR0   EQU   PSA+776                                                  03755000
PSAPSWSV EQU   PSA+768                                                  03756000
PSACLHS  EQU   PSAHLHI                                                  03757000
PSALKR15 EQU   PSALKSA+60                                               03758000
PSALKR14 EQU   PSALKSA+56                                               03759000
PSALKR13 EQU   PSALKSA+52                                               03760000
PSALKR12 EQU   PSALKSA+48                                               03761000
PSALKR11 EQU   PSALKSA+44                                               03762000
PSALKR10 EQU   PSALKSA+40                                               03763000
PSALKR9  EQU   PSALKSA+36                                               03764000
PSALKR8  EQU   PSALKSA+32                                               03765000
PSALKR7  EQU   PSALKSA+28                                               03766000
PSALKR6  EQU   PSALKSA+24                                               03767000
PSALKR5  EQU   PSALKSA+20                                               03768000
PSALKR4  EQU   PSALKSA+16                                               03769000
PSALKR3  EQU   PSALKSA+12                                               03770000
PSALKR2  EQU   PSALKSA+8                                                03771000
PSALKR1  EQU   PSALKSA+4                                                03772000
PSALKR0  EQU   PSALKSA                                                  03773000
PSARV023 EQU   PSACLHT+52                                               03774000
PSALOCAL EQU   PSACLHT+48                                               03775000
PSACMSL  EQU   PSACLHT+44                                               03776000
PSAOPTL  EQU   PSACLHT+40                                               03777000
PSATPACL EQU   PSACLHT+36                                               03778000
PSATPDNL EQU   PSACLHT+32                                               03779000
PSATPNCL EQU   PSACLHT+28                                               03780000
PSAIOSLL EQU   PSACLHT+24                                               03781000
PSAIOSUL EQU   PSACLHT+20                                               03782000
PSAIOSCL EQU   PSACLHT+16                                               03783000
PSAIOSSL EQU   PSACLHT+12                                               03784000
PSASALCL EQU   PSACLHT+8                                                03785000
PSAASML  EQU   PSACLHT+4                                                03786000
PSADISPL EQU   PSACLHT                                                  03787000
PSASRSA  EQU   PSA+636                                                  03788000
PSARV050 EQU   PSA+634                                                  03789000
PSADSSGO EQU   PSA+633                                                  03790000
PSARECUR EQU   PSA+632                                                  03791000
PSAHLHIS EQU   PSA+628                                                  03792000
PSAIPCSA EQU   PSA+624                                                  03793000
@NM00197 EQU   PSA+621                                                  03794000
PSAIPCDM EQU   PSA+620                                                  03795000
PSAIPCD  EQU   PSA+616                                                  03796000
@NM00196 EQU   PSA+613                                                  03797000
PSAIPCRM EQU   PSA+612                                                  03798000
PSAIPCR  EQU   PSA+608                                                  03799000
PSAMCHEX EQU   PSA+600                                                  03800000
PSAMPSW  EQU   PSA+592                                                  03801000
PSAEXPS2 EQU   PSA+584                                                  03802000
PSAEXPS1 EQU   PSA+576                                                  03803000
PSAPIREG EQU   PSA+572                                                  03804000
PSARSREG EQU   PSA+568                                                  03805000
PSAGPREG EQU   PSA+556                                                  03806000
PSARV022 EQU   PSASUP4                                                  03807000
PSARV021 EQU   PSASUP4                                                  03808000
PSARV020 EQU   PSASUP4                                                  03809000
PSARV019 EQU   PSASUP4                                                  03810000
PSARV018 EQU   PSASUP4                                                  03811000
PSARV017 EQU   PSASUP4                                                  03812000
PSARV016 EQU   PSASUP4                                                  03813000
PSARV015 EQU   PSASUP4                                                  03814000
PSARV014 EQU   PSASUP3                                                  03815000
PSARV013 EQU   PSASUP3                                                  03816000
PSARV012 EQU   PSASUP3                                                  03817000
PSAESTA  EQU   PSASUP3                                                  03818000
PSASPR   EQU   PSASUP3                                                  03819000
PSAPSREG EQU   PSASUP3                                                  03820000
PSAPI2   EQU   PSASUP3                                                  03821000
PSAIOSUP EQU   PSASUP3                                                  03822000
PSALCR   EQU   PSASUP2                                                  03823000
PSARTM   EQU   PSASUP2                                                  03824000
PSAACR   EQU   PSASUP2                                                  03825000
PSAIPCE2 EQU   PSASUP2                                                  03826000
PSAIPCES EQU   PSASUP2                                                  03827000
PSAIPCEC EQU   PSASUP2                                                  03828000
PSAGTF   EQU   PSASUP2                                                  03829000
PSAIPCRI EQU   PSASUP2                                                  03830000
PSATYPE6 EQU   PSASUP1                                                  03831000
PSATCTL  EQU   PSASUP1                                                  03832000
PSADISP  EQU   PSASUP1                                                  03833000
PSALOCK  EQU   PSASUP1                                                  03834000
PSAPI    EQU   PSASUP1                                                  03835000
PSAEXT   EQU   PSASUP1                                                  03836000
PSASVC   EQU   PSASUP1                                                  03837000
PSAIO    EQU   PSASUP1                                                  03838000
PSAAOLD  EQU   PSA+548                                                  03839000
PSAANEW  EQU   PSA+544                                                  03840000
PSATOLD  EQU   PSA+540                                                  03841000
PSATNEW  EQU   PSA+536                                                  03842000
PSALCCAR EQU   PSA+532                                                  03843000
PSALCCAV EQU   PSA+528                                                  03844000
PSAPCCAR EQU   PSA+524                                                  03845000
PSAPCCAV EQU   PSA+520                                                  03846000
PSACPULA EQU   PSA+518                                                  03847000
PSACPUPA EQU   PSA+516                                                  03848000
PSAPSA   EQU   PSA+512                                                  03849000
FLCHDEND EQU   PSA+512                                                  03850000
FLCCRSAV EQU   FLCMCLA+280                                              03851000
FLCGRSAV EQU   FLCMCLA+216                                              03852000
FLCFPSAV EQU   FLCMCLA+184                                              03853000
FLCFLA   EQU   FLCMCLA+88                                               03854000
FLCRGNCD EQU   FLCMCLA+84                                               03855000
FLCFSAA  EQU   FLCFSA+1                                                 03856000
@NM00195 EQU   FLCFSA                                                   03857000
@NM00194 EQU   FLCMCLA+72                                               03858000
FLCMCIC  EQU   FLCMCLA+64                                               03859000
@NM00193 EQU   FLCMCLA+20                                               03860000
FLCIOAA  EQU   FLCIOA+1                                                 03861000
@NM00192 EQU   FLCIOA                                                   03862000
@NM00191 EQU   FLCMCLA+15                                               03863000
@NM00190 EQU   FLCMCLA+14                                               03864000
@NM00189 EQU   FLCMCLA+12                                               03865000
FLCLCL   EQU   FLCMCLA+8                                                03866000
FLCIOELA EQU   FLCIOEL+1                                                03867000
@NM00188 EQU   FLCIOEL                                                  03868000
FLCCHNID EQU   FLCMCLA                                                  03869000
@NM00187 EQU   PSA+160                                                  03870000
FLCMTRCD EQU   PSA+157                                                  03871000
@NM00186 EQU   PSA+156                                                  03872000
FLCPERA  EQU   FLCPER+1                                                 03873000
@NM00185 EQU   FLCPER                                                   03874000
@NM00184 EQU   PSA+151                                                  03875000
FLCPERCD EQU   PSA+150                                                  03876000
FLCMCNUM EQU   PSA+149                                                  03877000
@NM00183 EQU   PSA+148                                                  03878000
FLCTEAA  EQU   FLCTEA+1                                                 03879000
@NM00182 EQU   FLCTEA                                                   03880000
PSAPIPC  EQU   PSAPICOD                                                 03881000
PSAPIMC  EQU   PSAPICOD                                                 03882000
PSAPIPER EQU   PSAPICOD                                                 03883000
PSARV049 EQU   FLCPICOD                                                 03884000
FLCPILCB EQU   FLCPIILC                                                 03885000
@NM00181 EQU   FLCPIILC                                                 03886000
@NM00180 EQU   PSAEPPSW                                                 03887000
FLCSVCN  EQU   PSAESPSW+2                                               03888000
FLCSILCB EQU   FLCSVILC                                                 03889000
@NM00179 EQU   FLCSVILC                                                 03890000
@NM00178 EQU   PSAESPSW                                                 03891000
FLCEICOD EQU   PSAEEPSW+2                                               03892000
PSASPAD  EQU   PSAEEPSW                                                 03893000
@NM00177 EQU   PSA+128                                                  03894000
FLCINPSW EQU   PSA+120                                                  03895000
FLCMNPSW EQU   PSA+112                                                  03896000
FLCPNPSW EQU   PSA+104                                                  03897000
FLCSNPSW EQU   PSA+96                                                   03898000
FLCENPSW EQU   PSA+88                                                   03899000
FLCTRACE EQU   PSA+84                                                   03900000
FLCTIMER EQU   PSA+80                                                   03901000
FLCCVT2  EQU   PSA+76                                                   03902000
FLCCAW   EQU   PSA+72                                                   03903000
FLCCSW   EQU   PSA+64                                                   03904000
FLCIOPSW EQU   PSA+56                                                   03905000
FLCMOPSW EQU   PSA+48                                                   03906000
FLCPOPSW EQU   PSA+40                                                   03907000
FLCSOPSW EQU   PSA+32                                                   03908000
FLCEOPSW EQU   PSA+24                                                   03909000
@NM00176 EQU   FLCICCW2+4                                               03910000
FLCCVT   EQU   FLCICCW2                                                 03911000
FLCICCW1 EQU   FLCROPSW                                                 03912000
FLCIPPSW EQU   FLCRNPSW                                                 03913000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03914000
@RF00317 EQU   @RC00307                                                 03915000
@RC00315 EQU   @RC00307                                                 03916000
@RC00311 EQU   @RC00307                                                 03917000
@RC00353 EQU   @RC00349                                                 03918000
@RC00383 EQU   @RC00366                                                 03919000
@RC00381 EQU   @RC00366                                                 03920000
@RC00370 EQU   @RC00366                                                 03921000
@RC00368 EQU   @RC00366                                                 03922000
@PB00002 EQU   @EL00001                                                 03923000
@RC00377 EQU   @RC00370                                                 03924000
@RC00372 EQU   @RC00370                                                 03925000
CE0001@  EQU   @PB00002                                                 03926000
@RC00398 EQU   CE0001@                                                  03927000
@RC00464 EQU   CE0001@                                                  03928000
@ENDDATA EQU   *                                                        03929000
         END   IGE0004I,(C'PLS1430',0701,78128)                         03930000
