         TITLE 'IGG0203B  -  3705 CLOSE - LOAD 1                       *00001000
                        '                                               00002000
IGG0203B CSECT ,                                                   0001 00003000
@PROLOG  BALR  @03,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@03                                         0001 00006000
*                                   /*                                  00007000
IGG0203B IEDHJN AFTERHJN,HJN            IDENTIFICATION MACRO   @Y17XATL 00008000
         MODESET EXTKEY=SUPR            GET INTO KEY 0         @G36XRTB 00009000
*   RCORE=OWAREA;                   /* ADDR OF OPEN WORK AREA      0112 00010000
*                                                            @G36XRTB*/ 00011000
         L     RCORE,OWAREA(,RWTGC)                                0112 00012000
*   RDCB=DXUDCBAD;                  /* DCB ADDRESS           @G36XRTB*/ 00013000
         L     RDCB,DXUDCBAD(,RCORE)                               0113 00014000
*   RLCB=DCBEIOBX+DCBIOBAD-LCBPRFSZ;/* GET LCB ADDRESS       @Y17XATL*/ 00015000
         SLR   RLCB,RLCB                                           0114 00016000
         IC    RLCB,DCBEIOBX(,RDCB)                                0114 00017000
         AL    RLCB,DCBIOBAD(,RDCB)                                0114 00018000
         SL    RLCB,@CF01604                                       0114 00019000
*   CVTTCMFG=CVTTCMFG&LDEVF;        /* INDICATE THAT LOCAL DEVICE IS    00020000
*                                      NOT ATTACHED TO TCAM  @Y17XANL*/ 00021000
         L     @14,CVTPTR                                          0115 00022000
         NI    CVTTCMFG(@14),X'BF'                                 0115 00023000
*   TCXPTR=CVTAQAVT;                /* LOAD TCX POINTER      @OX21215*/ 00024000
         L     @12,CVTAQAVT(,@14)                                  0116 00025000
         LR    TCXPTR,@12                                          0116 00026000
*   RAVT=TCXAVT;                    /* LOAD AVT POINTER      @OX21215*/ 00027000
         L     RAVT,TCXAVT(,@12)                                   0117 00028000
*                                                                  0118 00029000
*   /*****************************************************************/ 00030000
*   /*                                                               */ 00031000
*   /* IF RECORDS ARE ON THE MDR QUEUE IN THE LCB, THEN ISSUE SENSE  */ 00032000
*   /* COMMAND TO THE 3705 TO CAUSE MDR RECORDS TO BE READ.  @Y17XATL*/ 00033000
*   /*                                                               */ 00034000
*   /*****************************************************************/ 00035000
*                                                                  0118 00036000
*   IF LCBOBRCH^=ZERO THEN          /* ANY RECORDS ON THE MDR CORE 0118 00037000
*                                      QUEUE                 @Y17XATL*/ 00038000
         SLR   @14,@14                                             0118 00039000
         C     @14,LCBOBRCH(,RLCB)                                 0118 00040000
         BE    @RF00118                                            0118 00041000
*     DO;                           /* YES, LOG THE MDR RECORDS    0119 00042000
*                                                            @Y17XATL*/ 00043000
*       RFY                                                        0120 00044000
*         IEDQCCW BASED(ADDR(LCBCCW1));/* BUILD NOOP CMD IN LCBCPA 0120 00045000
*                                      AREA                  @YM06001*/ 00046000
*       CCWOPCDE=CCWNOP;            /* SET SENSE COMMAND     @YM06001*/ 00047000
         LA    @12,144                                             0121 00048000
         ALR   @12,RLCB                                            0121 00049000
         MVI   CCWOPCDE(@12),X'03'                                 0121 00050000
*       CCWFLAGS=CLEAR;             /* CLEAR FLAG BYTE PRIOR TO ...     00051000
*                                                            @Y17XATS*/ 00052000
         MVI   CCWFLAGS(@12),X'00'                                 0122 00053000
*       CCWRSV=CLEAR;               /* CLEAR UNUSED BYTE     @Y17XATL*/ 00054000
         MVI   CCWRSV(@12),X'00'                                   0123 00055000
*       CCWCOUNT=ONE;               /* SET LENGTH OF DATA TO RECEIVE    00056000
*                                                            @Y17XATL*/ 00057000
         MVC   CCWCOUNT(2,@12),@CH00077                            0124 00058000
*       CCWADDR=ADDR(LCBCCW2);      /* SET FIELD TO RECEIVE DATA   0125 00059000
*                                                            @YM06001*/ 00060000
         LA    @11,LCBCCW2(,RLCB)                                  0125 00061000
         STCM  @11,7,CCWADDR(@12)                                  0125 00062000
         SPACE 1                                                        00063000
*       ECB=ZERO;                   /* CLEAR ECB             @Y17XATL*/ 00064000
         ST    @14,ECB(,RLCB)                                      0126 00065000
*       LCBECBPT=ADDR(ECB);         /* SET ECB ADDR IN IOB   @Y17XATL*/ 00066000
         LA    @14,ECB(,RLCB)                                      0127 00067000
         STCM  @14,7,LCBECBPT(RLCB)                                0127 00068000
*       RFY                                                        0128 00069000
*         RF RSTD;                  /*                       @Y17XATL*/ 00070000
*       LCBSTART=ADDR(LCBCCW1);     /* SET ADDR OF CCW IN START FIELD   00071000
*                                      OF IOB IN LCB         @Y17XATS*/ 00072000
         LA    @14,LCBCCW1(,RLCB)                                  0129 00073000
         STCM  @14,7,LCBSTART(RLCB)                                0129 00074000
*       LCBSTAT1='FF'X;             /* FLAG                  @Y17XATS*/ 00075000
         MVI   LCBSTAT1(RLCB),X'FF'                                0130 00076000
*       LCBSIO=SIOCODE;             /* ENTRY CODE TO DO STARTIO (TO     00077000
*                                      IEDQEB)               @G36XRTB*/ 00078000
         MVI   LCBSIO(RLCB),X'30'                                  0131 00079000
*       LCBCP=LCBSTART;             /* START OF CHANNEL PROGRAM    0132 00080000
*                                                            @G36XRTB*/ 00081000
         ST    @14,LCBCP(,RLCB)                                    0132 00082000
*       R1=ADDR(LCBQEBPL);          /* ADDRESS OF PARM LIST FOR    0133 00083000
*                                      IEDQEB TO DO STARTIO  @G36XRTB*/ 00084000
         LA    R1,LCBQEBPL(,RLCB)                                  0133 00085000
*       GEN(AQCTL);                 /* GO DO STARTIO         @G36XRTB*/ 00086000
         AQCTL                                                          00087000
*       R1=ADDR(ECB);               /* ADDRESS OF ECB        @G36XRTB*/ 00088000
         LA    R1,ECB(,RLCB)                                       0135 00089000
*       GEN(WAIT ECB=(1));          /* WAIT FOR STARTIO TO COMPLETE     00090000
*                                                            @G36XRTB*/ 00091000
         WAIT ECB=(1)                                                   00092000
*     END;                          /*                       @Y17XATL*/ 00093000
*   RFY                                                            0138 00094000
*    (RE,                                                          0138 00095000
*     RJ) RSTD;                                                    0138 00096000
@RF00118 DS    0H                                                  0139 00097000
*   RE=SAVTTNTX;                    /* GET ADDRESS OF TTCIN TO     0139 00098000
*                                      NETWORK ADDRESS ROUTINE     0139 00099000
*                                                            @OX21215*/ 00100000
         L     @14,AVTSAVTP(,IEDQAPTR)                             0139 00101000
         L     RE,SAVTTNTX(,@14)                                   0139 00102000
*   RJ=RE->WORD1;                   /* GET LENGTH OF TTCIN TO NETWORK   00103000
*                                      ADDRESS ROUTINE       @OX21215*/ 00104000
         LR    @12,RE                                              0140 00105000
         L     RJ,WORD1(,@12)                                      0140 00106000
*   CALL PAGEFREE;                  /* FREE ROUTINE          @OX21215*/ 00107000
         BAL   @14,PAGEFREE                                        0141 00108000
*   RFY                                                            0142 00109000
*    (RE,                                                          0142 00110000
*     RJ) UNRSTD;                                                  0142 00111000
*   RFY                                                            0143 00112000
*     RF UNRSTD;                    /*                       @Y17XATL*/ 00113000
*ENDLOAD1:                          /* EXIT CODING (SUPPLIED BY    0144 00114000
*                                      SYSTEM OPEN)                  */ 00115000
*   GEN;                                                           0144 00116000
ENDLOAD1 DS    0H                                                  0144 00117000
FOUR     EQU   4                        CONSTANT OF FOUR                00118000
EIGHT    EQU   8                        CONSTANT OF EIGHT               00119000
         MVC   0(2,RWTGC),LOAD2ID       SET TO XCTL TO SECOND LOAD      00120000
         L     RJ,FOUR(RWTGC)           GET WORK AREA ADDRESS           00121000
         STM   0,15,0(RJ)               SAVE REGISTERS FOR NEXT LOAD    00122000
RELOOP   EQU   *                                                        00123000
         LA    RWTGC,EIGHT(RWTGC)       INCREMENT CURRENT WTG REG       00124000
         LA    RPARC,FOUR(RPARC)        INCREMENT CURRENT DCB REG       00125000
         CLC   0(2,RWTGC),AMIDCNST      IS THIS EXECUTOR NEEDED AGAIN   00126000
         BCR   8,3                      RETURN IF YES                   00127000
         CLC   0(2,RWTGC),OPIDCNST      TEST FOR END OF TABLE           00128000
         BL    RELOOP                   NO, CHECK NEXT ENTRY            00129000
         CLC   0(TWO,RWTGC),OPIDCIDH    CLOSE EXECUTORS TO GIVE         00130000
         BH    RELOOP                   CONTROL TO                      00131000
         LR    RPARC,RPAR               RESET DCB AND                   00132000
         LA    RWTGC,FIRSTID(RWTG)       WTG TABLE POINTERS             00133000
FIRSTID  EQU   32                       OFFSET TO FIRST WTG ENTRY       00134000
ZCHECK   EQU   *                                                        00135000
         CLI   0(RWTGC),0               IS THIS ENTRY ZERO              00136000
         BNE   XCTLRTNE                 NO, TRANSFER TO NEXT MODULE     00137000
         LA    RWTGC,EIGHT(RWTGC)       IF ZERO INCREMENT POINTERS      00138000
         LA    RPARC,FOUR(RPARC)         AND RETURN TO CHECK NEXT       00139000
         B     ZCHECK                    ENTRY                          00140000
XCTLRTNE EQU   *                                                        00141000
         MODESET EXTKEY=DATAMGT         GET BACK TO KEY 5      @G36XRTB 00142000
         LA    RJ,DXCCW12(RJ)           POINT TO DOUBLE WORD LIST       00143000
         MVC   6(2,RWTG),0(RWTGC)       MOVE ID TO NAME FIELD           00144000
         XCTL  DE=(RWTG),SF=(E,(15))    XCTL TO NEXT LOAD               00145000
AMIDCNST DC    CL2'3B'                  ID OF CURRENT LOAD              00146000
OPIDCNST DC    CL2'0B'                  ID OF SYSTEM LOAD               00147000
OPIDCIDH DC    CL2'0G'                  ID OF CLOSE EXECUTOR            00148000
TWO      EQU   2                        LENGTH FOR COMPARE              00149000
*PAGEFREE:                          /*                       @OX21215*/ 00150000
*   GEN;                                                           0145 00151000
PAGEFREE DS    0H                                                  0145 00152000
         LR    RF,RE                    COPY ADDRESS TO FREE   @OX21215 00153000
         AR    RF,RJ                    BUMP TO END ADDRESS    @OX21215 00154000
         STM   RE,RF,AVTGETMN(RAVT)     STORE IN PARM LIST     @OX21215 00155000
         MVI   AVTGETMN+FOUR(RAVT),ENDLIST SET END OF LIST     @OX21215 00156000
         MVI   AVTGETMN(RAVT),FREEPG    SET FREE CODE          @OX21215 00157000
         LA    RF,AVTGETMN(RAVT)        ADDRESS OF PARM LIST   @OX21215 00158000
         LA    RE,AVTDMECB(RAVT)        ADDRESS OF FIX ECB     @OX21215 00159000
         XC    AVTDMECB(FOUR,RAVT),AVTDMECB(RAVT) CLEAR ECB    @OX21215 00160000
         ICM   RF,HI,FOUR(RF)           SET REG ONE PARM       @OX21215 00161000
         SVC   PGFREE                   FREE AREA              @OX21215 00162000
RETURN   EQU   14                       RETURN REGISTER        @OX21215 00163000
PGFREE   EQU   113                      SVC PAGE FREE          @OX21215 00164000
HI       EQU   8                        ICM/STCM MASK          @OX21215 00165000
FREEPG   EQU   X'20'                    ACTION CODE PAGE FREE  @OX21215 00166000
ENDLIST  EQU   X'80'                    END OF PARM LIST       @OX21215 00167000
*   RETURN;                         /* RETURN TO CALLER      @Y17XANL*/ 00168000
@EL00001 DS    0H                                                  0146 00169000
@EF00001 DS    0H                                                  0146 00170000
@ER00001 BR    @14                                                 0146 00171000
*   GEN;                                                           0147 00172000
LOAD2ID  DC    CL2'35'                  ID FOR NXT LOAD OF CLOSE        00173000
*   END IGG0203B                                                   0148 00174000
*                                                                  0148 00175000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00176000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00177000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00178000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 00179000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00180000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00181000
*/*%INCLUDE SYSLIB  (TCCWD   )                                       */ 00182000
*/*%INCLUDE SYSLIB  (IECDSECT)                                       */ 00183000
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */ 00184000
*                                                                  0148 00185000
*       ;                                                          0148 00186000
         B     @EL00001                                            0148 00187000
@DATA    DS    0H                                                       00188000
@CH00077 DC    H'1'                                                     00189000
         DS    0F                                                       00190000
         DS    0F                                                       00191000
@CF01604 DC    XL4'20'                                                  00192000
         DS    0D                                                       00193000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00194000
@01      EQU   01                                                       00195000
@02      EQU   02                                                       00196000
@03      EQU   03                                                       00197000
@04      EQU   04                                                       00198000
@05      EQU   05                                                       00199000
@06      EQU   06                                                       00200000
@07      EQU   07                                                       00201000
@08      EQU   08                                                       00202000
@09      EQU   09                                                       00203000
@10      EQU   10                                                       00204000
@11      EQU   11                                                       00205000
@12      EQU   12                                                       00206000
@13      EQU   13                                                       00207000
@14      EQU   14                                                       00208000
@15      EQU   15                                                       00209000
@0       EQU   00                                                       00210000
@1       EQU   01                                                       00211000
@2       EQU   02                                                       00212000
@3       EQU   03                                                       00213000
@4       EQU   04                                                       00214000
@5       EQU   05                                                       00215000
@6       EQU   06                                                       00216000
@7       EQU   07                                                       00217000
@8       EQU   08                                                       00218000
@9       EQU   09                                                       00219000
@A       EQU   10                                                       00220000
@B       EQU   11                                                       00221000
@C       EQU   12                                                       00222000
@D       EQU   13                                                       00223000
@E       EQU   14                                                       00224000
@F       EQU   15                                                       00225000
RE       EQU   @00                                                      00226000
RF       EQU   @01                                                      00227000
R1       EQU   @01                                                      00228000
RCORE    EQU   @02                                                      00229000
RDCB     EQU   @02                                                      00230000
DCBPTR   EQU   @02                                                      00231000
RLCB     EQU   @04                                                      00232000
RPAR     EQU   @05                                                      00233000
RWTG     EQU   @06                                                      00234000
RPARC    EQU   @07                                                      00235000
RWTGC    EQU   @08                                                      00236000
RAVT     EQU   @09                                                      00237000
IEDQAPTR EQU   @09                                                      00238000
TCXPTR   EQU   @15                                                      00239000
RJ       EQU   @15                                                      00240000
LCBXPTR  EQU   @05                                                      00241000
RSAVE    EQU   @13                                                      00242000
CVTPTR   EQU   16                                                       00243000
IEDQAVTD EQU   0                                                        00244000
AVTSAVEX EQU   IEDQAVTD+288                                             00245000
AVTREADD EQU   IEDQAVTD+380                                             00246000
AVTBUFSW EQU   IEDQAVTD+384                                             00247000
@NM00004 EQU   IEDQAVTD+388                                             00248000
AVTCKFLG EQU   @NM00004                                                 00249000
AVTBASE  EQU   IEDQAVTD+412                                             00250000
AVTPKF   EQU   AVTBASE                                                  00251000
AVTOSECB EQU   IEDQAVTD+492                                             00252000
AVTECB1  EQU   AVTOSECB                                                 00253000
AVTHG02  EQU   IEDQAVTD+528                                             00254000
AVTDISP  EQU   IEDQAVTD+552                                             00255000
AVTHD    EQU   IEDQAVTD+556                                             00256000
AVTSCOPT EQU   AVTHD                                                    00257000
AVTSAVTP EQU   IEDQAVTD+612                                             00258000
AVTSAVTF EQU   AVTSAVTP                                                 00259000
AVTCKPEL EQU   IEDQAVTD+652                                             00260000
AVTCKRMV EQU   AVTCKPEL                                                 00261000
AVTCKELF EQU   IEDQAVTD+680                                             00262000
AVTCKBYT EQU   IEDQAVTD+691                                             00263000
AVTHG01  EQU   IEDQAVTD+692                                             00264000
AVTCKLNK EQU   IEDQAVTD+696                                             00265000
AVTCRELE EQU   IEDQAVTD+708                                             00266000
AVTCCELE EQU   AVTCRELE                                                 00267000
AVTCLRHI EQU   IEDQAVTD+716                                             00268000
AVTADBUF EQU   IEDQAVTD+720                                             00269000
AVTSYSER EQU   IEDQAVTD+728                                             00270000
AVTBFRFG EQU   IEDQAVTD+784                                             00271000
AVTCKPQB EQU   IEDQAVTD+804                                             00272000
AVTCKPTB EQU   AVTCKPQB                                                 00273000
AVTCKPEC EQU   AVTCKPQB+4                                               00274000
AVTCKPCC EQU   AVTCKPEC                                                 00275000
AVTOPCQB EQU   IEDQAVTD+816                                             00276000
AVTOPCOB EQU   AVTOPCQB                                                 00277000
AVTOPCEC EQU   AVTOPCQB+4                                               00278000
AVTOPCCC EQU   AVTOPCEC                                                 00279000
AVTOLTQB EQU   IEDQAVTD+828                                             00280000
AVTCWFL1 EQU   IEDQAVTD+924                                             00281000
AVTCWFL2 EQU   IEDQAVTD+925                                             00282000
AVTSUBT  EQU   IEDQAVTD+948                                             00283000
AVTIOTR  EQU   IEDQAVTD+949                                             00284000
AVTBIT1  EQU   IEDQAVTD+1050                                            00285000
AVTBIT2  EQU   IEDQAVTD+1051                                            00286000
AVTBIT3  EQU   IEDQAVTD+1052                                            00287000
AVTBIT4  EQU   IEDQAVTD+1136                                            00288000
@NM00086 EQU   IEDQAVTD+1232                                            00289000
IEDNSVTD EQU   0                                                        00290000
SAVTDIAG EQU   IEDNSVTD                                                 00291000
SAVTDIAF EQU   SAVTDIAG                                                 00292000
SAVTLUSQ EQU   IEDNSVTD+88                                              00293000
SAVTTCPU EQU   IEDNSVTD+238                                             00294000
SAVTTNTX EQU   IEDNSVTD+252                                             00295000
SAVTZELM EQU   IEDNSVTD+270                                             00296000
SAVTRDRV EQU   IEDNSVTD+284                                             00297000
SAVTCKQB EQU   IEDNSVTD+300                                             00298000
SAVTCKTB EQU   SAVTCKQB                                                 00299000
SAVTCKEC EQU   SAVTCKQB+4                                               00300000
SAVTCKCC EQU   SAVTCKEC                                                 00301000
CVTMAP   EQU   0                                                        00302000
CVTDAR   EQU   CVTMAP+72                                                00303000
CVTFLGS1 EQU   CVTDAR                                                   00304000
CVTDCB   EQU   CVTMAP+116                                               00305000
CVTIERLC EQU   CVTMAP+144                                               00306000
CVTOPTA  EQU   CVTMAP+182                                               00307000
CVTOPTB  EQU   CVTMAP+183                                               00308000
CVTGTF   EQU   CVTMAP+236                                               00309000
CVTGTFST EQU   CVTGTF                                                   00310000
CVTGTFS  EQU   CVTGTFST                                                 00311000
CVTSTATE EQU   CVTGTFST                                                 00312000
CVTTMODE EQU   CVTGTFST                                                 00313000
CVTFORM  EQU   CVTGTFST                                                 00314000
CVTAQAVT EQU   CVTMAP+240                                               00315000
CVTTCMFG EQU   CVTAQAVT                                                 00316000
CVTVOLM2 EQU   CVTMAP+244                                               00317000
CVTTATA  EQU   CVTVOLM2                                                 00318000
CVTTSKS  EQU   CVTTATA                                                  00319000
CVTVOLF2 EQU   CVTTSKS                                                  00320000
CVTTAT   EQU   CVTTATA+1                                                00321000
CVTATER  EQU   CVTMAP+248                                               00322000
CVTEXT1  EQU   CVTMAP+252                                               00323000
CVTPURG  EQU   CVTMAP+260                                               00324000
CVTQMSG  EQU   CVTMAP+268                                               00325000
CVTDMSR  EQU   CVTMAP+272                                               00326000
CVTRSV37 EQU   CVTDMSR                                                  00327000
CVTDMSRF EQU   CVTRSV37                                                 00328000
CVTERPV  EQU   CVTMAP+316                                               00329000
CVTINTLA EQU   CVTMAP+320                                               00330000
CVTAPF   EQU   CVTMAP+324                                               00331000
CVTEXT2  EQU   CVTMAP+328                                               00332000
CVTHJES  EQU   CVTMAP+332                                               00333000
CVTPGSIA EQU   CVTMAP+348                                               00334000
CVTA1F1  EQU   CVTMAP+356                                               00335000
CVTSYSK  EQU   CVTMAP+357                                               00336000
CVTVOLM1 EQU   CVTMAP+380                                               00337000
CVTVOLF1 EQU   CVTVOLM1                                                 00338000
CVTATMCT EQU   CVTMAP+388                                               00339000
CVTXTNT1 EQU   0                                                        00340000
CVTXTNT2 EQU   0                                                        00341000
CVTDSSV  EQU   CVTXTNT2                                                 00342000
CVTFLGBT EQU   CVTXTNT2+5                                               00343000
CVTQID   EQU   CVTXTNT2+24                                              00344000
CVTSHS   EQU   CVTXTNT2+40                                              00345000
CVTRV400 EQU   CVTXTNT2+52                                              00346000
CVTRV409 EQU   CVTXTNT2+53                                              00347000
CVTATCVT EQU   CVTXTNT2+64                                              00348000
CVTRV429 EQU   CVTXTNT2+84                                              00349000
CVTRV438 EQU   CVTXTNT2+85                                              00350000
CVTRV457 EQU   CVTXTNT2+112                                             00351000
CVTRV466 EQU   CVTXTNT2+113                                             00352000
CVTFIX   EQU   -256                                                     00353000
CVTRELNO EQU   CVTFIX+252                                               00354000
IEDQLPTR EQU   0                                                        00355000
IEDQLCB  EQU   0                                                        00356000
LCBRCB   EQU   IEDQLCB                                                  00357000
LCBTSOB  EQU   IEDQLCB+19                                               00358000
LCBCHAIN EQU   IEDQLCB+20                                               00359000
LCBSCRNN EQU   LCBCHAIN                                                 00360000
LCBTETEN EQU   LCBCHAIN                                                 00361000
LCBINSRC EQU   IEDQLCB+21                                               00362000
LCBLKMDE EQU   LCBINSRC+2                                               00363000
LCBNTXT  EQU   IEDQLCB+24                                               00364000
LCBSTAT4 EQU   LCBNTXT                                                  00365000
LCBPHASE EQU   LCBSTAT4                                                 00366000
LCBSCBDA EQU   IEDQLCB+25                                               00367000
LCBMHA   EQU   IEDQLCB+29                                               00368000
LCBFLAG1 EQU   IEDQLCB+32                                               00369000
LCBIOBSN EQU   IEDQLCB+33                                               00370000
LCBSNS   EQU   LCBIOBSN+1                                               00371000
LCBSENS0 EQU   LCBSNS                                                   00372000
LCBLOSDT EQU   LCBSENS0                                                 00373000
LCBTMOUT EQU   LCBSENS0                                                 00374000
LCBECBPT EQU   LCBIOBSN+4                                               00375000
LCBFLAG3 EQU   LCBIOBSN+7                                               00376000
LCBCSW   EQU   LCBIOBSN+8                                               00377000
LCBCSWST EQU   LCBCSW+3                                                 00378000
LCBCSWUS EQU   LCBCSWST                                                 00379000
LCBCSWCS EQU   LCBCSWST+1                                               00380000
LCBSIOCC EQU   LCBIOBSN+15                                              00381000
LCBSTART EQU   LCBIOBSN+16                                              00382000
LCBDCBPT EQU   IEDQLCB+52                                               00383000
LCBRCQCB EQU   IEDQLCB+56                                               00384000
LCBRESTR EQU   LCBRCQCB                                                 00385000
LCBTHSQ  EQU   IEDQLCB+60                                               00386000
LCBINCAM EQU   LCBTHSQ                                                  00387000
LCBERRCT EQU   IEDQLCB+62                                               00388000
LCBLSPCI EQU   IEDQLCB+65                                               00389000
LCBRCBFR EQU   LCBLSPCI                                                 00390000
LCBSTATE EQU   IEDQLCB+70                                               00391000
LCBSTAT1 EQU   LCBSTATE                                                 00392000
LCBSTAT2 EQU   LCBSTATE+1                                               00393000
LCBBEOTN EQU   LCBSTAT2                                                 00394000
LCBSYNC  EQU   LCBSTAT2                                                 00395000
LCBDIAL  EQU   LCBSTAT2                                                 00396000
LCBTSTSW EQU   IEDQLCB+72                                               00397000
LCBERB   EQU   IEDQLCB+76                                               00398000
LCBERBST EQU   IEDQLCB+84                                               00399000
LCBDLNKN EQU   LCBERBST                                                 00400000
LCBERBCT EQU   IEDQLCB+88                                               00401000
LCBRBCT2 EQU   LCBERBCT+1                                               00402000
LCBMSGFM EQU   IEDQLCB+92                                               00403000
LCBOBRCH EQU   IEDQLCB+96                                               00404000
LCBINVPT EQU   LCBOBRCH+1                                               00405000
LCBBFRW  EQU   LCBINVPT                                                 00406000
LCBTPCD  EQU   IEDQLCB+100                                              00407000
LCBSTAT5 EQU   LCBTPCD                                                  00408000
LCBSTAT6 EQU   LCBTPCD+4                                                00409000
LCBRSPSV EQU   LCBTPCD+8                                                00410000
LCBSAVSN EQU   IEDQLCB+112                                              00411000
LCBERCCW EQU   IEDQLCB+120                                              00412000
LCBCPA   EQU   IEDQLCB+144                                              00413000
LCBCCW1  EQU   LCBCPA                                                   00414000
LCBCCW2  EQU   LCBCPA+8                                                 00415000
LCBCCW5  EQU   LCBCPA+32                                                00416000
LCBATTEL EQU   LCBCCW5                                                  00417000
LCBQEBPL EQU   LCBATTEL                                                 00418000
LCBSIO   EQU   LCBQEBPL                                                 00419000
LCBCP    EQU   LCBQEBPL+4                                               00420000
IEDQLCBX EQU   0                                                        00421000
LCBXCON  EQU   IEDQLCBX                                                 00422000
LCBXFLAG EQU   LCBXCON                                                  00423000
LCBXDCT  EQU   LCBXCON+1                                                00424000
LCBXRADR EQU   LCBXCON+4                                                00425000
IHADCB   EQU   0                                                        00426000
IEDQCCW  EQU   0                                                        00427000
CCW      EQU   IEDQCCW                                                  00428000
CCWOPCDE EQU   CCW                                                      00429000
CCWADDR  EQU   CCW+1                                                    00430000
CCWFLAGS EQU   CCW+4                                                    00431000
CCWRSV   EQU   CCW+5                                                    00432000
CCWCOUNT EQU   CCW+6                                                    00433000
FORCORE  EQU   0                                                        00434000
DXDSCB   EQU   FORCORE                                                  00435000
DXDAADDR EQU   FORCORE+312                                              00436000
DXDCB    EQU   FORCORE+320                                              00437000
DXCCW    EQU   FORCORE+368                                              00438000
DXVOLSR  EQU   FORCORE+500                                              00439000
DXVOLSR1 EQU   DXVOLSR                                                  00440000
DXVOLSR2 EQU   DXVOLSR+6                                                00441000
DXVOLSR3 EQU   DXVOLSR+12                                               00442000
DXUCBSAV EQU   FORCORE+564                                              00443000
DXUDCBAD EQU   FORCORE+568                                              00444000
DXPDCBAD EQU   FORCORE+572                                              00445000
DXATCOM1 EQU   FORCORE+588                                              00446000
DXATGENS EQU   DXATCOM1                                                 00447000
DXATVGIV EQU   DXATGENS                                                 00448000
DXATOUTA EQU   DXATCOM1+2                                               00449000
DXATDACC EQU   DXATCOM1+3                                               00450000
DXATCOM2 EQU   FORCORE+592                                              00451000
DXATEOV  EQU   DXATCOM2                                                 00452000
DXATOPEN EQU   DXATCOM2+1                                               00453000
DXATALL  EQU   DXATCOM2+2                                               00454000
DXATEXC1 EQU   FORCORE+604                                              00455000
DXATEXC2 EQU   FORCORE+608                                              00456000
DXRACIND EQU   FORCORE+612                                              00457000
DXRACFLG EQU   FORCORE+616                                              00458000
DXWORKE  EQU   FORCORE+620                                              00459000
IEDQTCXD EQU   0                                                        00460000
TCXAVT   EQU   IEDQTCXD                                                 00461000
TCXATTEN EQU   IEDQTCXD+4                                               00462000
TCXFLAG1 EQU   IEDQTCXD+34                                              00463000
TCXBUFA  EQU   IEDQTCXD+80                                              00464000
TCXDSAVE EQU   IEDQTCXD+104                                             00465000
TCXQE8   EQU   IEDQTCXD+216                                             00466000
DSECT    EQU   0                                                        00467000
WORD0    EQU   DSECT                                                    00468000
WORD1    EQU   DSECT+4                                                  00469000
WTGTABLE EQU   0                                                        00470000
OWAREA   EQU   WTGTABLE+4                                               00471000
CVTS01   EQU   CVTPGSIA                                                 00472000
CVTLPDIA EQU   CVTS01+12                                                00473000
CVTDIRST EQU   CVTLPDIA                                                 00474000
CVTSLIDA EQU   CVTS01+24                                                00475000
CVTCTLFG EQU   CVTS01+50                                                00476000
CVTRV210 EQU   CVTS01+424                                               00477000
CVTRV219 EQU   CVTS01+425                                               00478000
CVTRV228 EQU   CVTS01+426                                               00479000
CVTRV237 EQU   CVTS01+427                                               00480000
CVTMFRTR EQU   CVTS01+452                                               00481000
CVTRV262 EQU   CVTS01+468                                               00482000
CVTRV271 EQU   CVTS01+469                                               00483000
CVTRV280 EQU   CVTS01+470                                               00484000
CVTRV289 EQU   CVTS01+471                                               00485000
CVTGSDA  EQU   CVTS01+600                                               00486000
LCBRSPIN EQU   LCBIOBSN                                                 00487000
LCBLUSNS EQU   LCBRSPIN+5                                               00488000
LCBSCPRS EQU   LCBRSPIN+9                                               00489000
LCBCSWU1 EQU   LCBSCPRS+2                                               00490000
LCBRSPFG EQU   LCBRSPIN+15                                              00491000
LCBCOREQ EQU   LCBTPCD                                                  00492000
@NM00135 EQU   LCBCPA+40                                                00493000
LCBQNX   EQU   LCBERCCW                                                 00494000
LCBQNXMN EQU   LCBQNX                                                   00495000
LCBCANCL EQU   LCBSAVSN                                                 00496000
LCBCANFG EQU   LCBCANCL                                                 00497000
IHADCS1A EQU   IHADCB+8                                                 00498000
DCBBCKUP EQU   IHADCS1A+8                                               00499000
IHADCS2K EQU   IHADCB+20                                                00500000
DCBDUMPD EQU   IHADCS2K                                                 00501000
DCBTRSTA EQU   IHADCS2K+5                                               00502000
DCBDSORG EQU   IHADCS2K+6                                               00503000
DCBDSRG2 EQU   DCBDSORG+1                                               00504000
DCBIOBAD EQU   IHADCS2K+8                                               00505000
DCBRNCKD EQU   IHADCS2K+12                                              00506000
DCBEXLST EQU   IHADCS2K+16                                              00507000
DCBEIOBX EQU   DCBEXLST                                                 00508000
IHADCS24 EQU   IHADCB+40                                                00509000
DCBOFLGS EQU   IHADCS24+8                                               00510000
DCBOFLWR EQU   DCBOFLGS                                                 00511000
DCBIFLG  EQU   IHADCS24+9                                               00512000
DCBIBPCT EQU   DCBIFLG                                                  00513000
DCBMACR  EQU   IHADCS24+10                                              00514000
DCBMACR1 EQU   DCBMACR                                                  00515000
DCBMRFE  EQU   DCBMACR1                                                 00516000
DCBMRGET EQU   DCBMRFE                                                  00517000
DCBMRAPG EQU   DCBMACR1                                                 00518000
DCBMRRD  EQU   DCBMRAPG                                                 00519000
DCBMRCI  EQU   DCBMACR1                                                 00520000
DCBMRMVG EQU   DCBMRCI                                                  00521000
DCBMRLCG EQU   DCBMACR1                                                 00522000
DCBMRABC EQU   DCBMACR1                                                 00523000
DCBMRPT1 EQU   DCBMRABC                                                 00524000
DCBMRSBG EQU   DCBMRPT1                                                 00525000
DCBMRCRL EQU   DCBMACR1                                                 00526000
DCBMRCHK EQU   DCBMRCRL                                                 00527000
DCBMRRDX EQU   DCBMRCHK                                                 00528000
DCBMRDMG EQU   DCBMACR1                                                 00529000
DCBMACR2 EQU   DCBMACR+1                                                00530000
DCBMRPUT EQU   DCBMACR2                                                 00531000
DCBMRWRT EQU   DCBMACR2                                                 00532000
DCBMRMVP EQU   DCBMACR2                                                 00533000
DCBMR5WD EQU   DCBMACR2                                                 00534000
DCBMRLDM EQU   DCBMR5WD                                                 00535000
DCBMRLCP EQU   DCBMRLDM                                                 00536000
DCBMR4WD EQU   DCBMACR2                                                 00537000
DCBMRPT2 EQU   DCBMR4WD                                                 00538000
DCBMRTMD EQU   DCBMRPT2                                                 00539000
DCBMR3WD EQU   DCBMACR2                                                 00540000
DCBMRCTL EQU   DCBMR3WD                                                 00541000
DCBMRSTK EQU   DCBMRCTL                                                 00542000
DCBMR1WD EQU   DCBMACR2                                                 00543000
DCBMRSWA EQU   DCBMR1WD                                                 00544000
DCBMRDMD EQU   DCBMRSWA                                                 00545000
IHADCS25 EQU   IHADCB+40                                                00546000
DCBMACRF EQU   IHADCS25+2                                               00547000
DCBMACF1 EQU   DCBMACRF                                                 00548000
DCBMFFE  EQU   DCBMACF1                                                 00549000
DCBMFGET EQU   DCBMFFE                                                  00550000
DCBMFAPG EQU   DCBMACF1                                                 00551000
DCBMFRD  EQU   DCBMFAPG                                                 00552000
DCBMFCI  EQU   DCBMACF1                                                 00553000
DCBMFMVG EQU   DCBMFCI                                                  00554000
DCBMFLCG EQU   DCBMACF1                                                 00555000
DCBMFABC EQU   DCBMACF1                                                 00556000
DCBMFPT1 EQU   DCBMFABC                                                 00557000
DCBMFSBG EQU   DCBMFPT1                                                 00558000
DCBMFCRL EQU   DCBMACF1                                                 00559000
DCBMFCHK EQU   DCBMFCRL                                                 00560000
DCBMFDMG EQU   DCBMACF1                                                 00561000
DCBMACF2 EQU   DCBMACRF+1                                               00562000
DCBMFPUT EQU   DCBMACF2                                                 00563000
DCBMFWRT EQU   DCBMACF2                                                 00564000
DCBMFMVP EQU   DCBMACF2                                                 00565000
DCBMF5WD EQU   DCBMACF2                                                 00566000
DCBMFLDM EQU   DCBMF5WD                                                 00567000
DCBMFLCP EQU   DCBMFLDM                                                 00568000
DCBMF4WD EQU   DCBMACF2                                                 00569000
DCBMFPT2 EQU   DCBMF4WD                                                 00570000
DCBMFTMD EQU   DCBMFPT2                                                 00571000
DCBMF3WD EQU   DCBMACF2                                                 00572000
DCBMFCTL EQU   DCBMF3WD                                                 00573000
DCBMFSTK EQU   DCBMFCTL                                                 00574000
DCBMF1WD EQU   DCBMACF2                                                 00575000
DCBMFSWA EQU   DCBMF1WD                                                 00576000
DCBMFDMD EQU   DCBMFSWA                                                 00577000
DCBDEBAD EQU   IHADCS25+4                                               00578000
DCBIFLGS EQU   DCBDEBAD                                                 00579000
DCBIFPCT EQU   DCBIFLGS                                                 00580000
IHADCS27 EQU   IHADCB+48                                                00581000
DCBGET   EQU   IHADCS27                                                 00582000
DCBPUT   EQU   DCBGET                                                   00583000
DCBGETA  EQU   DCBPUT+1                                                 00584000
IHADCS43 EQU   IHADCB+48                                                00585000
DCBSCTAB EQU   IHADCS43                                                 00586000
ECB      EQU   LCBCPA+8                                                 00587000
*                                      START UNREFERENCED COMPONENTS    00588000
DCBBUFSI EQU   IHADCS43+6                                               00589000
DCBUNTCT EQU   IHADCS43+5                                               00590000
DCBILCT  EQU   IHADCS43+4                                               00591000
DCBSCTAD EQU   DCBSCTAB+1                                               00592000
@NM00157 EQU   DCBSCTAB                                                 00593000
DCBPUTA  EQU   DCBGETA                                                  00594000
@NM00156 EQU   DCBPUT                                                   00595000
DCBDEBA  EQU   DCBDEBAD+1                                               00596000
@NM00155 EQU   DCBIFLGS                                                 00597000
DCBIFIOE EQU   DCBIFLGS                                                 00598000
DCBCH12  EQU   DCBIFPCT                                                 00599000
DCBCH9   EQU   DCBIFPCT                                                 00600000
DCBIFEC  EQU   DCBIFLGS                                                 00601000
DCBMFSTI EQU   DCBMFDMD                                                 00602000
DCBMFAWR EQU   DCBMFSTK                                                 00603000
DCBMFUIP EQU   DCBMFTMD                                                 00604000
DCBMFIDW EQU   DCBMFLCP                                                 00605000
DCBMFWRK EQU   DCBMFMVP                                                 00606000
DCBMFRDQ EQU   DCBMFWRT                                                 00607000
DCBMFGTQ EQU   DCBMFPUT                                                 00608000
DCBMFSTL EQU   DCBMACF2                                                 00609000
DCBMFCK  EQU   DCBMFDMG                                                 00610000
DCBMFRDX EQU   DCBMFCHK                                                 00611000
DCBMFDBF EQU   DCBMFSBG                                                 00612000
DCBMFRDI EQU   DCBMFLCG                                                 00613000
DCBMFRDK EQU   DCBMFMVG                                                 00614000
DCBMFWRQ EQU   DCBMFRD                                                  00615000
DCBMFPTQ EQU   DCBMFGET                                                 00616000
DCBMFECP EQU   DCBMACF1                                                 00617000
DCBTIOT  EQU   IHADCS25                                                 00618000
DCBMRSTI EQU   DCBMRDMD                                                 00619000
DCBMRAWR EQU   DCBMRSTK                                                 00620000
DCBMRUIP EQU   DCBMRTMD                                                 00621000
DCBMRIDW EQU   DCBMRLCP                                                 00622000
DCBMRWRK EQU   DCBMRMVP                                                 00623000
DCBMRRDQ EQU   DCBMRWRT                                                 00624000
DCBMRGTQ EQU   DCBMRPUT                                                 00625000
DCBMRSTL EQU   DCBMACR2                                                 00626000
DCBMRCK  EQU   DCBMRDMG                                                 00627000
DCBPGFXA EQU   DCBMRRDX                                                 00628000
DCBMRDBF EQU   DCBMRSBG                                                 00629000
DCBMRRDI EQU   DCBMRLCG                                                 00630000
DCBMRRDK EQU   DCBMRMVG                                                 00631000
DCBMRWRQ EQU   DCBMRRD                                                  00632000
DCBMRPTQ EQU   DCBMRGET                                                 00633000
DCBMRECP EQU   DCBMACR1                                                 00634000
@NM00154 EQU   DCBIFLG                                                  00635000
DCBIBIOE EQU   DCBIFLG                                                  00636000
DCBICH12 EQU   DCBIBPCT                                                 00637000
DCBICH9  EQU   DCBIBPCT                                                 00638000
DCBIBEC  EQU   DCBIFLG                                                  00639000
DCBOFIOF EQU   DCBOFLGS                                                 00640000
DCBOFUEX EQU   DCBOFLGS                                                 00641000
DCBOFTM  EQU   DCBOFLGS                                                 00642000
DCBOFPPC EQU   DCBOFLGS                                                 00643000
DCBOFOPN EQU   DCBOFLGS                                                 00644000
DCBOFEOV EQU   DCBOFLGS                                                 00645000
DCBOFLRB EQU   DCBOFLGS                                                 00646000
DCBOFIOD EQU   DCBOFLWR                                                 00647000
DCBDDNAM EQU   IHADCS24                                                 00648000
DCBEXLSA EQU   DCBEXLST+1                                               00649000
DCBRNCKA EQU   DCBRNCKD+1                                               00650000
@NM00153 EQU   DCBRNCKD                                                 00651000
DCBDSGTR EQU   DCBDSRG2                                                 00652000
@NM00152 EQU   DCBDSRG2                                                 00653000
DCBDSRG1 EQU   DCBDSORG                                                 00654000
DCBCHNGL EQU   DCBTRSTA                                                 00655000
DCBNIDLE EQU   DCBTRSTA                                                 00656000
DCBBAKUP EQU   DCBTRSTA                                                 00657000
DCBIPLED EQU   DCBTRSTA                                                 00658000
DCBRSTRT EQU   DCBTRSTA                                                 00659000
DCBINITL EQU   DCBTRSTA                                                 00660000
DCBAUTOD EQU   DCBTRSTA                                                 00661000
DCBAUTOI EQU   DCBTRSTA                                                 00662000
@NM00151 EQU   IHADCS2K+4                                               00663000
DCBDUMPA EQU   DCBDUMPD+1                                               00664000
DCBUNITN EQU   DCBDUMPD                                                 00665000
DCBBCKUA EQU   DCBBCKUP+1                                               00666000
@NM00150 EQU   DCBBCKUP                                                 00667000
DCBIPLTX EQU   IHADCS1A                                                 00668000
@NM00143 EQU   LCBCANCL+3                                               00669000
LCBCANTH EQU   LCBCANCL+1                                               00670000
@NM00142 EQU   LCBCANFG                                                 00671000
LCBCANCD EQU   LCBCANFG                                                 00672000
@NM00141 EQU   LCBCANFG                                                 00673000
LCBCANEB EQU   LCBCANFG                                                 00674000
LCBCANXT EQU   LCBCANFG                                                 00675000
LCBUNADD EQU   LCBQNX+21                                                00676000
LCBUASZE EQU   LCBQNX+20                                                00677000
LCBDSTEA EQU   LCBQNX+16                                                00678000
@NM00140 EQU   LCBQNX+8                                                 00679000
LCBIOSBS EQU   LCBQNX+5                                                 00680000
@NM00139 EQU   LCBQNX+4                                                 00681000
LCBSTSAV EQU   LCBQNX+1                                                 00682000
@NM00138 EQU   LCBQNXMN                                                 00683000
LCBNX509 EQU   LCBQNXMN                                                 00684000
LCBNX162 EQU   LCBQNXMN                                                 00685000
LCBNX142 EQU   LCBQNXMN                                                 00686000
LCBNX064 EQU   LCBQNXMN                                                 00687000
@NM00137 EQU   @NM00135+4                                               00688000
LCBNCPPT EQU   @NM00135+1                                               00689000
@NM00136 EQU   @NM00135                                                 00690000
LCBWRSCH EQU   LCBCOREQ+8                                               00691000
LCBCQLNK EQU   LCBCOREQ+4                                               00692000
LCBCQELE EQU   LCBCOREQ                                                 00693000
LCBPAKCH EQU   LCBRSPIN+16                                              00694000
@NM00134 EQU   LCBRSPFG                                                 00695000
LCBRSRH  EQU   LCBRSPFG                                                 00696000
LCBEXPI  EQU   LCBRSPFG                                                 00697000
@NM00133 EQU   LCBRSPIN+12                                              00698000
LCBUSUE1 EQU   LCBCSWU1                                                 00699000
@NM00132 EQU   LCBCSWU1                                                 00700000
@NM00131 EQU   LCBSCPRS+1                                               00701000
LCBDFCMD EQU   LCBSCPRS                                                 00702000
LCBUSER  EQU   LCBLUSNS+2                                               00703000
LCBSMIN  EQU   LCBLUSNS+1                                               00704000
LCBSMAJ  EQU   LCBLUSNS                                                 00705000
LCBRHSV  EQU   LCBRSPIN+2                                               00706000
LCBSNS0  EQU   LCBRSPIN+1                                               00707000
@NM00130 EQU   LCBRSPIN                                                 00708000
CVTRV628 EQU   CVTS01+728                                               00709000
CVTRV627 EQU   CVTS01+724                                               00710000
CVTRV626 EQU   CVTS01+720                                               00711000
CVTRV625 EQU   CVTS01+716                                               00712000
CVTRV624 EQU   CVTS01+712                                               00713000
CVTRV623 EQU   CVTS01+708                                               00714000
CVTRV622 EQU   CVTS01+704                                               00715000
CVTRV621 EQU   CVTS01+700                                               00716000
CVTRV620 EQU   CVTS01+696                                               00717000
CVTRV619 EQU   CVTS01+692                                               00718000
CVTRV618 EQU   CVTS01+688                                               00719000
CVTRV617 EQU   CVTS01+684                                               00720000
CVTRV616 EQU   CVTS01+680                                               00721000
CVTRV615 EQU   CVTS01+676                                               00722000
CVTRV614 EQU   CVTS01+672                                               00723000
CVTRV613 EQU   CVTS01+668                                               00724000
CVTTCASP EQU   CVTS01+664                                               00725000
CVT0PT03 EQU   CVTS01+660                                               00726000
CVT0PT0E EQU   CVTS01+656                                               00727000
CVTIRM   EQU   CVTS01+652                                               00728000
CVTCGK   EQU   CVTS01+648                                               00729000
CVTRV607 EQU   CVTS01+644                                               00730000
CVTRV606 EQU   CVTS01+640                                               00731000
CVTRV605 EQU   CVTS01+636                                               00732000
CVTRV604 EQU   CVTS01+632                                               00733000
CVTEFF02 EQU   CVTS01+628                                               00734000
CVTCBBR  EQU   CVTS01+624                                               00735000
CVTSSCR  EQU   CVTS01+620                                               00736000
CVTEVENT EQU   CVTS01+616                                               00737000
CVTCRCA  EQU   CVTS01+612                                               00738000
CVTTPIO  EQU   CVTS01+608                                               00739000
CVTADV   EQU   CVTS01+604                                               00740000
CVTGSDAB EQU   CVTGSDA                                                  00741000
CVTQV3   EQU   CVTS01+596                                               00742000
CVTQV2   EQU   CVTS01+592                                               00743000
CVTQV1   EQU   CVTS01+588                                               00744000
CVTRPT   EQU   CVTS01+584                                               00745000
CVTSSRB  EQU   CVTS01+580                                               00746000
CVTCSDRL EQU   CVTS01+576                                               00747000
CVTEXP1  EQU   CVTS01+572                                               00748000
CVTRMPMT EQU   CVTS01+568                                               00749000
CVTRMPTT EQU   CVTS01+564                                               00750000
CVTVPSA  EQU   CVTS01+560                                               00751000
CVTVSTOP EQU   CVTS01+556                                               00752000
CVTGTFR8 EQU   CVTS01+552                                               00753000
CVTQUIT  EQU   CVTS01+548                                               00754000
CVTVACR  EQU   CVTS01+544                                               00755000
CVTWTCB  EQU   CVTS01+540                                               00756000
CVTSTPRS EQU   CVTS01+536                                               00757000
CVT0PT02 EQU   CVTS01+532                                               00758000
CVTDARCM EQU   CVTS01+528                                               00759000
CVTIRECM EQU   CVTS01+524                                               00760000
CVTJRECM EQU   CVTS01+520                                               00761000
CVTVEMS0 EQU   CVTS01+516                                               00762000
CVTSPFRR EQU   CVTS01+512                                               00763000
CVTRLSTG EQU   CVTS01+508                                               00764000
CVT0TC0A EQU   CVTS01+504                                               00765000
CVTGMBR  EQU   CVTS01+500                                               00766000
CVTLFRM  EQU   CVTS01+496                                               00767000
CVTRMBR  EQU   CVTS01+492                                               00768000
CVTVIOP  EQU   CVTS01+488                                               00769000
CVTRV307 EQU   CVTS01+486                                               00770000
CVTRV306 EQU   CVTS01+484                                               00771000
CVTRV305 EQU   CVTS01+482                                               00772000
CVTRV304 EQU   CVTS01+480                                               00773000
CVTRV303 EQU   CVTS01+478                                               00774000
CVTRV302 EQU   CVTS01+476                                               00775000
CVTTRCA  EQU   CVTS01+472                                               00776000
CVTRV297 EQU   CVTRV289                                                 00777000
CVTRV296 EQU   CVTRV289                                                 00778000
CVTRV295 EQU   CVTRV289                                                 00779000
CVTRV294 EQU   CVTRV289                                                 00780000
CVTRV293 EQU   CVTRV289                                                 00781000
CVTRV292 EQU   CVTRV289                                                 00782000
CVTRV291 EQU   CVTRV289                                                 00783000
CVTRV290 EQU   CVTRV289                                                 00784000
CVTRV288 EQU   CVTRV280                                                 00785000
CVTRV287 EQU   CVTRV280                                                 00786000
CVTRV286 EQU   CVTRV280                                                 00787000
CVTRV285 EQU   CVTRV280                                                 00788000
CVTRV284 EQU   CVTRV280                                                 00789000
CVTRV283 EQU   CVTRV280                                                 00790000
CVTRV282 EQU   CVTRV280                                                 00791000
CVTRV281 EQU   CVTRV280                                                 00792000
CVTRV279 EQU   CVTRV271                                                 00793000
CVTRV278 EQU   CVTRV271                                                 00794000
CVTRV277 EQU   CVTRV271                                                 00795000
CVTRV276 EQU   CVTRV271                                                 00796000
CVTRV275 EQU   CVTRV271                                                 00797000
CVTRV274 EQU   CVTRV271                                                 00798000
CVTRV273 EQU   CVTRV271                                                 00799000
CVTRV272 EQU   CVTRV271                                                 00800000
CVTRV270 EQU   CVTRV262                                                 00801000
CVTRV269 EQU   CVTRV262                                                 00802000
CVTRV268 EQU   CVTRV262                                                 00803000
CVTRV267 EQU   CVTRV262                                                 00804000
CVTRV266 EQU   CVTRV262                                                 00805000
CVTRV265 EQU   CVTRV262                                                 00806000
CVTRV264 EQU   CVTRV262                                                 00807000
CVTRV263 EQU   CVTRV262                                                 00808000
CVTVFP   EQU   CVTS01+464                                               00809000
CVTVSI   EQU   CVTS01+460                                               00810000
CVTVPSIB EQU   CVTS01+456                                               00811000
CVTMFACT EQU   CVTMFRTR                                                 00812000
CVTMFCTL EQU   CVTS01+448                                               00813000
CVTPVBP  EQU   CVTS01+444                                               00814000
CVTPWI   EQU   CVTS01+440                                               00815000
CVTRV254 EQU   CVTS01+438                                               00816000
CVTRV253 EQU   CVTS01+436                                               00817000
CVTRV252 EQU   CVTS01+434                                               00818000
CVTRV251 EQU   CVTS01+433                                               00819000
CVTRV250 EQU   CVTS01+432                                               00820000
CVTRV249 EQU   CVTS01+431                                               00821000
CVTRV248 EQU   CVTS01+430                                               00822000
CVTRV247 EQU   CVTS01+429                                               00823000
CVTRV246 EQU   CVTS01+428                                               00824000
CVTRV245 EQU   CVTRV237                                                 00825000
CVTRV244 EQU   CVTRV237                                                 00826000
CVTRV243 EQU   CVTRV237                                                 00827000
CVTRV242 EQU   CVTRV237                                                 00828000
CVTRV241 EQU   CVTRV237                                                 00829000
CVTRV240 EQU   CVTRV237                                                 00830000
CVTRV239 EQU   CVTRV237                                                 00831000
CVTRV238 EQU   CVTRV237                                                 00832000
CVTRV236 EQU   CVTRV228                                                 00833000
CVTRV235 EQU   CVTRV228                                                 00834000
CVTRV234 EQU   CVTRV228                                                 00835000
CVTRV233 EQU   CVTRV228                                                 00836000
CVTRV232 EQU   CVTRV228                                                 00837000
CVTRV231 EQU   CVTRV228                                                 00838000
CVTRV230 EQU   CVTRV228                                                 00839000
CVTRV229 EQU   CVTRV228                                                 00840000
CVTRV227 EQU   CVTRV219                                                 00841000
CVTRV226 EQU   CVTRV219                                                 00842000
CVTRV225 EQU   CVTRV219                                                 00843000
CVTRV224 EQU   CVTRV219                                                 00844000
CVTRV223 EQU   CVTRV219                                                 00845000
CVTRV222 EQU   CVTRV219                                                 00846000
CVTRV221 EQU   CVTRV219                                                 00847000
CVTRV220 EQU   CVTRV219                                                 00848000
CVTRV218 EQU   CVTRV210                                                 00849000
CVTRV217 EQU   CVTRV210                                                 00850000
CVTRV216 EQU   CVTRV210                                                 00851000
CVTRV215 EQU   CVTRV210                                                 00852000
CVTRV214 EQU   CVTRV210                                                 00853000
CVTRV213 EQU   CVTRV210                                                 00854000
CVTRV212 EQU   CVTRV210                                                 00855000
CVTRV211 EQU   CVTRV210                                                 00856000
CVTLCCAT EQU   CVTS01+420                                               00857000
CVTPCCAT EQU   CVTS01+416                                               00858000
CVTIPCRP EQU   CVTS01+412                                               00859000
CVTIPCRI EQU   CVTS01+408                                               00860000
CVTIPCDS EQU   CVTS01+404                                               00861000
CVTAIDVT EQU   CVTS01+400                                               00862000
CVTSSAP  EQU   CVTS01+396                                               00863000
CVTEHCIR EQU   CVTS01+392                                               00864000
CVTEHDEF EQU   CVTS01+388                                               00865000
CVTDAIR  EQU   CVTS01+384                                               00866000
CVTPERFM EQU   CVTS01+380                                               00867000
CVT044R2 EQU   CVTS01+376                                               00868000
CVTFETCH EQU   CVTS01+372                                               00869000
CVTRSTWD EQU   CVTS01+368                                               00870000
CVTSPOST EQU   CVTS01+364                                               00871000
CVTIOBP  EQU   CVTS01+360                                               00872000
CVTASMVT EQU   CVTS01+356                                               00873000
CVTRECRQ EQU   CVTS01+352                                               00874000
CVTWSAC  EQU   CVTS01+348                                               00875000
CVTRV149 EQU   CVTS01+344                                               00876000
CVTWSAL  EQU   CVTS01+340                                               00877000
CVTSPSA  EQU   CVTS01+336                                               00878000
CVTGLMN  EQU   CVTS01+332                                               00879000
CVTVEAC0 EQU   CVTS01+328                                               00880000
CVT062R1 EQU   CVTS01+324                                               00881000
CVTRPOST EQU   CVTS01+320                                               00882000
CVTDQIQE EQU   CVTS01+316                                               00883000
CVTCSD   EQU   CVTS01+312                                               00884000
CVTLKRMA EQU   CVTS01+308                                               00885000
CVTRSPIE EQU   CVTS01+304                                               00886000
CVTRENQ  EQU   CVTS01+300                                               00887000
CVTLQCB  EQU   CVTS01+296                                               00888000
CVTFQCB  EQU   CVTS01+292                                               00889000
CVTQCS01 EQU   CVTS01+288                                               00890000
CVTAPFT  EQU   CVTS01+284                                               00891000
CVTPARRL EQU   CVTS01+280                                               00892000
CVTVWAIT EQU   CVTS01+276                                               00893000
CVTGSPL  EQU   CVTS01+272                                               00894000
CVTLSMQ  EQU   CVTS01+268                                               00895000
CVTGSMQ  EQU   CVTS01+264                                               00896000
CVTEXPRO EQU   CVTS01+260                                               00897000
CVTOPCTP EQU   CVTS01+256                                               00898000
CVTSIC   EQU   CVTS01+252                                               00899000
CVTTPIOS EQU   CVTS01+248                                               00900000
CVTRTMS  EQU   CVTS01+244                                               00901000
CVTSDBF  EQU   CVTS01+240                                               00902000
CVTSCBP  EQU   CVTS01+236                                               00903000
CVTSDMP  EQU   CVTS01+232                                               00904000
CVTSV60  EQU   CVTS01+228                                               00905000
CVTRTMCT EQU   CVTS01+224                                               00906000
CVTASCBL EQU   CVTS01+220                                               00907000
CVTASCBH EQU   CVTS01+216                                               00908000
CVTGDA   EQU   CVTS01+212                                               00909000
CVTASVT  EQU   CVTS01+208                                               00910000
CVTVVMDI EQU   CVTS01+204                                               00911000
CVTAQTOP EQU   CVTS01+200                                               00912000
CVTIOSCS EQU   CVTS01+196                                               00913000
CVTSDRM  EQU   CVTS01+192                                               00914000
CVTOPTE  EQU   CVTS01+188                                               00915000
CVTSTXU  EQU   CVTS01+184                                               00916000
CVTQUIS  EQU   CVTS01+180                                               00917000
CVTPARS  EQU   CVTS01+176                                               00918000
CVTS1EE  EQU   CVTS01+172                                               00919000
CVTFRAS  EQU   CVTS01+168                                               00920000
CVTQSAS  EQU   CVTS01+164                                               00921000
CVTCRAS  EQU   CVTS01+160                                               00922000
CVTCRMN  EQU   CVTS01+156                                               00923000
CVTDELCP EQU   CVTS01+152                                               00924000
CVTFRECL EQU   CVTS01+148                                               00925000
CVTGETCL EQU   CVTS01+144                                               00926000
CVTBLDCP EQU   CVTS01+140                                               00927000
CVTAUTHL EQU   CVTS01+136                                               00928000
CVTSCAN  EQU   CVTS01+132                                               00929000
CVTRV144 EQU   CVTS01+130                                               00930000
CVTMAXMP EQU   CVTS01+128                                               00931000
CVTSTCK  EQU   CVTS01+124                                               00932000
CVTRV139 EQU   CVTS01+123                                               00933000
CVTDSSAC EQU   CVTS01+122                                               00934000
CVTRV513 EQU   CVTS01+121                                               00935000
CVTIOSPL EQU   CVTS01+120                                               00936000
CVTPTGT  EQU   CVTS01+116                                               00937000
CVTCSPIE EQU   CVTS01+112                                               00938000
CVTSMFEX EQU   CVTS01+108                                               00939000
CVTOLT0A EQU   CVTS01+104                                               00940000
CVTSRBRT EQU   CVTS01+100                                               00941000
CVTPUTL  EQU   CVTS01+96                                                00942000
CVTASCRL EQU   CVTS01+92                                                00943000
CVTASCRF EQU   CVTS01+88                                                00944000
CVTRV326 EQU   CVTS01+84                                                00945000
CVTRV325 EQU   CVTS01+80                                                00946000
CVTRV324 EQU   CVTS01+76                                                00947000
CVT0VL01 EQU   CVTS01+72                                                00948000
CVTSHRVM EQU   CVTS01+68                                                00949000
CVTRV332 EQU   CVTS01+64                                                00950000
CVTTAS   EQU   CVTS01+60                                                00951000
CVTRSCN  EQU   CVTS01+56                                                00952000
CVTTRAC2 EQU   CVTS01+54                                                00953000
CVTTRACE EQU   CVTS01+52                                                00954000
CVTAPG   EQU   CVTS01+51                                                00955000
CVTSDTRC EQU   CVTCTLFG                                                 00956000
CVTGTRCE EQU   CVTCTLFG                                                 00957000
CVTNOMP  EQU   CVTCTLFG                                                 00958000
CVTRSV79 EQU   CVTCTLFG                                                 00959000
CVTDSTAT EQU   CVTCTLFG                                                 00960000
CVTRSV78 EQU   CVTCTLFG                                                 00961000
CVTRV333 EQU   CVTCTLFG                                                 00962000
CVTRV323 EQU   CVTCTLFG                                                 00963000
CVTSPVLK EQU   CVTS01+49                                                00964000
CVTRSV77 EQU   CVTS01+48                                                00965000
CVTRV331 EQU   CVTS01+44                                                00966000
CVTRV330 EQU   CVTS01+40                                                00967000
CVTRV329 EQU   CVTS01+36                                                00968000
CVTRV328 EQU   CVTS01+32                                                00969000
CVTRV322 EQU   CVTS01+28                                                00970000
CVTSLID  EQU   CVTSLIDA+1                                               00971000
CVTSYLK  EQU   CVTSLIDA                                                 00972000
CVTRV321 EQU   CVTS01+20                                                00973000
CVTRV320 EQU   CVTS01+16                                                00974000
CVTLPDIR EQU   CVTLPDIA+1                                               00975000
CVTRSV69 EQU   CVTDIRST                                                 00976000
CVTRSV68 EQU   CVTDIRST                                                 00977000
CVTRSV67 EQU   CVTDIRST                                                 00978000
CVTRSV66 EQU   CVTDIRST                                                 00979000
CVTRSV65 EQU   CVTDIRST                                                 00980000
CVTRSV64 EQU   CVTDIRST                                                 00981000
CVTRSV63 EQU   CVTDIRST                                                 00982000
CVTDICOM EQU   CVTDIRST                                                 00983000
CVTPVTP  EQU   CVTS01+8                                                 00984000
CVTLPDSR EQU   CVTS01+4                                                 00985000
CVTGETL  EQU   CVTS01                                                   00986000
@NM00176 EQU   WTGTABLE                                                 00987000
BYTE1    EQU   WORD1                                                    00988000
BYTE0    EQU   WORD0                                                    00989000
TCXEND   EQU   IEDQTCXD+224                                             00990000
TCXNCPIO EQU   IEDQTCXD+220                                             00991000
TCXACTE8 EQU   TCXQE8                                                   00992000
TCXABEPL EQU   IEDQTCXD+212                                             00993000
TCXSRBS  EQU   IEDQTCXD+208                                             00994000
TCXSIOSB EQU   IEDQTCXD+204                                             00995000
TCXESAVE EQU   IEDQTCXD+132                                             00996000
TCXERPPM EQU   IEDQTCXD+128                                             00997000
TCXERPSV EQU   IEDQTCXD+116                                             00998000
TCXSATTN EQU   IEDQTCXD+112                                             00999000
@NM00175 EQU   TCXDSAVE+4                                               01000000
@NM00174 EQU   TCXDSAVE                                                 01001000
TCXPLCB  EQU   IEDQTCXD+100                                             01002000
TCXBITS  EQU   IEDQTCXD+98                                              01003000
TCXSCBSZ EQU   IEDQTCXD+97                                              01004000
TCXBIT1  EQU   IEDQTCXD+96                                              01005000
TCXCOMPT EQU   IEDQTCXD+92                                              01006000
TCXAVAIL EQU   IEDQTCXD+88                                              01007000
TCXBUFL  EQU   IEDQTCXD+84                                              01008000
TCXTOTE  EQU   TCXBUFA                                                  01009000
TCXCKPM  EQU   IEDQTCXD+79                                              01010000
TCXNCKPR EQU   IEDQTCXD+78                                              01011000
TCXSZAIB EQU   IEDQTCXD+76                                              01012000
TCXAIBC  EQU   IEDQTCXD+72                                              01013000
TCXPEBC  EQU   IEDQTCXD+68                                              01014000
TCXPEWAC EQU   IEDQTCXD+64                                              01015000
TCXQRQ   EQU   IEDQTCXD+60                                              01016000
TCXOCQ   EQU   IEDQTCXD+56                                              01017000
TCXPNTQ  EQU   IEDQTCXD+52                                              01018000
TCXPUTQ  EQU   IEDQTCXD+48                                              01019000
TCXGETQ  EQU   IEDQTCXD+44                                              01020000
TCXTSI   EQU   IEDQTCXD+40                                              01021000
TCXRPT   EQU   IEDQTCXD+36                                              01022000
TCXCC3TS EQU   IEDQTCXD+35                                              01023000
TCXAPDMP EQU   TCXFLAG1                                                 01024000
TCXAPPL  EQU   TCXFLAG1                                                 01025000
TCXRTM   EQU   TCXFLAG1                                                 01026000
TCXMCPCD EQU   TCXFLAG1                                                 01027000
TCXAUTH  EQU   TCXFLAG1                                                 01028000
TCXASID  EQU   IEDQTCXD+32                                              01029000
TCXASCB  EQU   IEDQTCXD+28                                              01030000
TCXREADY EQU   IEDQTCXD+24                                              01031000
TCXPASWD EQU   IEDQTCXD+16                                              01032000
TCXDISP  EQU   IEDQTCXD+12                                              01033000
TCXTCB   EQU   IEDQTCXD+8                                               01034000
TCXATTLN EQU   TCXATTEN                                                 01035000
DSECTSIZ EQU   FORCORE+652                                              01036000
DXWORKE8 EQU   DXWORKE+28                                               01037000
DXWORKE7 EQU   DXWORKE+24                                               01038000
DXWORKE6 EQU   DXWORKE+20                                               01039000
DXWORKE5 EQU   DXWORKE+16                                               01040000
DXWORKE4 EQU   DXWORKE+12                                               01041000
DXWORKE3 EQU   DXWORKE+8                                                01042000
DXWORKE2 EQU   DXWORKE+4                                                01043000
DXWORKE1 EQU   DXWORKE                                                  01044000
DXRACRES EQU   FORCORE+617                                              01045000
@NM00173 EQU   DXRACFLG                                                 01046000
DXRACUPD EQU   DXRACFLG                                                 01047000
DXRDELET EQU   DXRACFLG                                                 01048000
@NM00172 EQU   DXRACFLG                                                 01049000
DXRACID  EQU   FORCORE+613                                              01050000
@NM00171 EQU   DXRACIND                                                 01051000
DXRFOPEN EQU   DXRACIND                                                 01052000
@NM00170 EQU   DXRACIND                                                 01053000
DXATEXB2 EQU   DXATEXC2                                                 01054000
DXATEXB1 EQU   DXATEXC1                                                 01055000
DXATCOM4 EQU   FORCORE+600                                              01056000
DXATCOM3 EQU   FORCORE+596                                              01057000
@NM00169 EQU   DXATCOM2+3                                               01058000
@NM00168 EQU   DXATALL                                                  01059000
DXATSWAP EQU   DXATALL                                                  01060000
DXATFC   EQU   DXATALL                                                  01061000
@NM00167 EQU   DXATOPEN                                                 01062000
DXATDFIN EQU   DXATOPEN                                                 01063000
DXATDSIN EQU   DXATOPEN                                                 01064000
DXATMODM EQU   DXATOPEN                                                 01065000
DXATMODE EQU   DXATOPEN                                                 01066000
DXATMODS EQU   DXATOPEN                                                 01067000
DXATIGN  EQU   DXATOPEN                                                 01068000
DXATVCAT EQU   DXATEOV                                                  01069000
DXATDADM EQU   DXATEOV                                                  01070000
DXATREMT EQU   DXATEOV                                                  01071000
DXATDNEW EQU   DXATEOV                                                  01072000
DXATDFRE EQU   DXATEOV                                                  01073000
DXATDCHN EQU   DXATEOV                                                  01074000
DXATNVOL EQU   DXATEOV                                                  01075000
DXATCCAT EQU   DXATEOV                                                  01076000
DXATRDDB EQU   DXATDACC                                                 01077000
DXATEOF  EQU   DXATDACC                                                 01078000
@NM00166 EQU   DXATDACC                                                 01079000
DXATSMF  EQU   DXATDACC                                                 01080000
DXATUPDB EQU   DXATDACC                                                 01081000
DXATDRCT EQU   DXATDACC                                                 01082000
DXATTRAK EQU   DXATDACC                                                 01083000
DXATF1CE EQU   DXATDACC                                                 01084000
DXATNSL  EQU   DXATOUTA                                                 01085000
DXATTTM2 EQU   DXATOUTA                                                 01086000
DXATTTM1 EQU   DXATOUTA                                                 01087000
DXATTRL2 EQU   DXATOUTA                                                 01088000
DXATTRL1 EQU   DXATOUTA                                                 01089000
DXATDATM EQU   DXATOUTA                                                 01090000
DXATHDTM EQU   DXATOUTA                                                 01091000
DXATVLHD EQU   DXATOUTA                                                 01092000
DXATCLOS EQU   DXATCOM1+1                                               01093000
DXATSRET EQU   DXATGENS                                                 01094000
DXATVCIG EQU   DXATVGIV                                                 01095000
DXATVTMG EQU   DXATVGIV                                                 01096000
DXATVSMG EQU   DXATVGIV                                                 01097000
DXATJFCB EQU   DXATGENS                                                 01098000
DXATDISP EQU   DXATGENS                                                 01099000
DXATREFR EQU   DXATGENS                                                 01100000
DXATDMCT EQU   DXATGENS                                                 01101000
DXMSGADR EQU   FORCORE+584                                              01102000
DXPRPARC EQU   FORCORE+580                                              01103000
DXUDCBML EQU   FORCORE+578                                              01104000
DXUDCBPL EQU   FORCORE+576                                              01105000
DXPACBAD EQU   DXPDCBAD+1                                               01106000
@NM00165 EQU   DXPDCBAD                                                 01107000
DXUACBAD EQU   DXUDCBAD+1                                               01108000
@NM00164 EQU   DXUDCBAD                                                 01109000
DXUCBSVV EQU   DXUCBSAV+1                                               01110000
@NM00163 EQU   DXUCBSAV                                                 01111000
DXUCBADR EQU   FORCORE+560                                              01112000
DXTIOTAD EQU   FORCORE+556                                              01113000
DXDEBXAD EQU   FORCORE+552                                              01114000
DXDSAB   EQU   FORCORE+548                                              01115000
DXDSABAD EQU   FORCORE+544                                              01116000
DXDSABQD EQU   FORCORE+540                                              01117000
DXJSCBAD EQU   FORCORE+536                                              01118000
DXTCBADR EQU   FORCORE+532                                              01119000
DXASCBAD EQU   FORCORE+528                                              01120000
DXEXTSW  EQU   FORCORE+527                                              01121000
DXUKEY   EQU   FORCORE+526                                              01122000
DXWKEYSV EQU   FORCORE+525                                              01123000
DXRESSW  EQU   FORCORE+524                                              01124000
DXUNITOF EQU   FORCORE+522                                              01125000
DXNOUNIT EQU   FORCORE+520                                              01126000
DXVOLSEQ EQU   FORCORE+518                                              01127000
DXVOLMT3 EQU   DXVOLSR3                                                 01128000
DXVOLMT2 EQU   DXVOLSR2                                                 01129000
DXVOLMT1 EQU   DXVOLSR1                                                 01130000
DXWORK4  EQU   FORCORE+496                                              01131000
DXWORK3  EQU   FORCORE+492                                              01132000
DXWORK2  EQU   FORCORE+488                                              01133000
DXWORK1  EQU   FORCORE+484                                              01134000
DXWORK   EQU   FORCORE+480                                              01135000
DXXCTL   EQU   FORCORE+472                                              01136000
@NM00162 EQU   FORCORE+464                                              01137000
DXCCW12  EQU   DXCCW+88                                                 01138000
DXCCW11  EQU   DXCCW+80                                                 01139000
DXCCW10  EQU   DXCCW+72                                                 01140000
DXCCW9   EQU   DXCCW+64                                                 01141000
DXCCW8   EQU   DXCCW+56                                                 01142000
DXCCW7   EQU   DXCCW+48                                                 01143000
DXCCW6   EQU   DXCCW+40                                                 01144000
DXCCW5   EQU   DXCCW+32                                                 01145000
DXCCW4   EQU   DXCCW+24                                                 01146000
DXCCW3   EQU   DXCCW+16                                                 01147000
DXCCW2   EQU   DXCCW+8                                                  01148000
DXCCW1   EQU   DXCCW                                                    01149000
DXDCBDEB EQU   DXDCB+44                                                 01150000
@NM00161 EQU   DXDCB+24                                                 01151000
DXDEBDCB EQU   DXDCB+20                                                 01152000
@NM00160 EQU   DXDCB                                                    01153000
DXDEB    EQU   DXDAADDR+4                                               01154000
@NM00159 EQU   DXDAADDR                                                 01155000
DXIOB    EQU   FORCORE+280                                              01156000
DXECB    EQU   FORCORE+276                                              01157000
DXJBF    EQU   FORCORE+100                                              01158000
DSCCORE  EQU   FORCORE+96                                               01159000
DXLBL    EQU   DXDSCB                                                   01160000
@NM00158 EQU   CCWFLAGS                                                 01161000
CCWIDA   EQU   CCWFLAGS                                                 01162000
CCWPCI   EQU   CCWFLAGS                                                 01163000
CCWSKIP  EQU   CCWFLAGS                                                 01164000
CCWSLI   EQU   CCWFLAGS                                                 01165000
CCWCC    EQU   CCWFLAGS                                                 01166000
CCWCD    EQU   CCWFLAGS                                                 01167000
@NM00149 EQU   IHADCB                                                   01168000
LCBERADR EQU   LCBXRADR+1                                               01169000
LCBPCIRC EQU   LCBXRADR                                                 01170000
LCBDCT3  EQU   LCBXDCT+2                                                01171000
LCBDCT2  EQU   LCBXDCT+1                                                01172000
LCBDCT1  EQU   LCBXDCT                                                  01173000
@NM00148 EQU   LCBXFLAG                                                 01174000
LCBERPND EQU   LCBXFLAG                                                 01175000
LCBSRCPF EQU   LCBXFLAG                                                 01176000
LCBGPCTV EQU   LCBXFLAG                                                 01177000
@NM00147 EQU   LCBXFLAG                                                 01178000
@NM00146 EQU   LCBXFLAG                                                 01179000
@NM00145 EQU   LCBXFLAG                                                 01180000
@NM00144 EQU   LCBXFLAG                                                 01181000
LCBCCW10 EQU   LCBCPA+72                                                01182000
LCBCCW9  EQU   LCBCPA+64                                                01183000
LCBCCW8  EQU   LCBCPA+56                                                01184000
LCBCCW7  EQU   LCBCPA+48                                                01185000
LCBCCW6  EQU   LCBCPA+40                                                01186000
LCBIOSB  EQU   LCBQEBPL+1                                               01187000
LCBCCW4  EQU   LCBCPA+24                                                01188000
LCBCCW3  EQU   LCBCPA+16                                                01189000
@NM00129 EQU   LCBERCCW+16                                              01190000
LCBATL05 EQU   LCBERCCW+8                                               01191000
@NM00128 EQU   LCBERCCW                                                 01192000
LCBCSWSV EQU   LCBSAVSN+1                                               01193000
LCBSNSV  EQU   LCBSAVSN                                                 01194000
LCBBFSNS EQU   LCBRSPSV                                                 01195000
LCBWAITC EQU   LCBTPCD+5                                                01196000
LCBINPAK EQU   LCBSTAT6                                                 01197000
LCBMHBID EQU   LCBSTAT6                                                 01198000
LCBRTRRO EQU   LCBSTAT6                                                 01199000
LCBHDRPD EQU   LCBSTAT6                                                 01200000
LCBCHN   EQU   LCBSTAT6                                                 01201000
LCBBFRSV EQU   LCBTPCD+1                                                01202000
@NM00127 EQU   LCBSTAT5                                                 01203000
LCBLUS   EQU   LCBSTAT5                                                 01204000
LCBLUNIT EQU   LCBSTAT5                                                 01205000
LCBPERM  EQU   LCBSTAT5                                                 01206000
LCBNXCMD EQU   LCBBFRW                                                  01207000
LCBERMSK EQU   LCBOBRCH                                                 01208000
LCBSCBA  EQU   IEDQLCB+93                                               01209000
LCBOLT   EQU   LCBMSGFM                                                 01210000
LCBEOT   EQU   LCBMSGFM                                                 01211000
LCBENQ   EQU   LCBMSGFM                                                 01212000
LCBTTD   EQU   LCBMSGFM                                                 01213000
LCBRSTRT EQU   LCBMSGFM                                                 01214000
LCBVSTRT EQU   LCBMSGFM                                                 01215000
LCBACKI  EQU   LCBMSGFM                                                 01216000
LCBNAK   EQU   LCBMSGFM                                                 01217000
LCBTTCIN EQU   IEDQLCB+90                                               01218000
@NM00126 EQU   LCBRBCT2                                                 01219000
LCBDCNT  EQU   LCBRBCT2                                                 01220000
LCBRBCT1 EQU   LCBERBCT                                                 01221000
LCBERBCH EQU   IEDQLCB+85                                               01222000
LCBCOMPL EQU   LCBDLNKN                                                 01223000
LCBPRCPG EQU   LCBERBST                                                 01224000
LCBERROR EQU   LCBERBST                                                 01225000
LCBLOGDV EQU   LCBERBST                                                 01226000
LCBINQ   EQU   LCBERBST                                                 01227000
LCBRDERR EQU   LCBERBST                                                 01228000
LCBEOMSG EQU   LCBERBST                                                 01229000
LCBMSG   EQU   LCBERBST                                                 01230000
LCBERBLK EQU   IEDQLCB+81                                               01231000
LCBERBPY EQU   IEDQLCB+80                                               01232000
LCBERBQB EQU   LCBERB+1                                                 01233000
LCBERBKY EQU   LCBERB                                                   01234000
LCBRECAD EQU   IEDQLCB+73                                               01235000
@NM00125 EQU   LCBTSTSW                                                 01236000
@NM00124 EQU   LCBTSTSW                                                 01237000
@NM00123 EQU   LCBTSTSW                                                 01238000
@NM00122 EQU   LCBTSTSW                                                 01239000
@NM00121 EQU   LCBTSTSW                                                 01240000
@NM00120 EQU   LCBTSTSW                                                 01241000
@NM00119 EQU   LCBTSTSW                                                 01242000
LCBCONCT EQU   LCBTSTSW                                                 01243000
LCBRESP  EQU   LCBSTAT2                                                 01244000
LCBBFRAV EQU   LCBDIAL                                                  01245000
LCBATTN  EQU   LCBSYNC                                                  01246000
LCBNEGRP EQU   LCBSTAT2                                                 01247000
LCBSNDPR EQU   LCBSTAT2                                                 01248000
LCBCONNN EQU   LCBBEOTN                                                 01249000
LCBMSGNN EQU   LCBSTAT2                                                 01250000
LCBTRACE EQU   LCBSTAT2                                                 01251000
LCBSENDN EQU   LCBSTAT1                                                 01252000
LCBRECVN EQU   LCBSTAT1                                                 01253000
LCBFREEN EQU   LCBSTAT1                                                 01254000
LCBCONT  EQU   LCBSTAT1                                                 01255000
LCBINITN EQU   LCBSTAT1                                                 01256000
LCBOCNI  EQU   LCBSTAT1                                                 01257000
LCBOCWTN EQU   LCBSTAT1                                                 01258000
LCBRCLLN EQU   LCBSTAT1                                                 01259000
LCBRECOF EQU   IEDQLCB+68                                               01260000
LCBRDBFR EQU   LCBRCBFR                                                 01261000
LCBUCBX  EQU   IEDQLCB+64                                               01262000
LCBTTBIN EQU   LCBERRCT                                                 01263000
@NM00118 EQU   LCBINCAM                                                 01264000
LCBGETMN EQU   LCBINCAM                                                 01265000
@NM00117 EQU   LCBRESTR+1                                               01266000
LCBCMDSV EQU   LCBRESTR                                                 01267000
LCBPCILK EQU   LCBDCBPT                                                 01268000
LCBAP4OL EQU   LCBSIOCC                                                 01269000
LCBAP3OL EQU   LCBSIOCC                                                 01270000
LCBAP2OL EQU   LCBSIOCC                                                 01271000
LCBAP1OL EQU   LCBSIOCC                                                 01272000
LCBSIOC2 EQU   LCBSIOCC                                                 01273000
LCBSIOC1 EQU   LCBSIOCC                                                 01274000
@NM00116 EQU   LCBSIOCC                                                 01275000
LCBCSWRC EQU   LCBCSW+5                                                 01276000
LCBCSCHC EQU   LCBCSWCS                                                 01277000
LCBCSICC EQU   LCBCSWCS                                                 01278000
LCBCSCCC EQU   LCBCSWCS                                                 01279000
LCBCSCDC EQU   LCBCSWCS                                                 01280000
LCBCSPTC EQU   LCBCSWCS                                                 01281000
LCBCSPGC EQU   LCBCSWCS                                                 01282000
LCBCSIL  EQU   LCBCSWCS                                                 01283000
LCBCSPCI EQU   LCBCSWCS                                                 01284000
LCBUSUE  EQU   LCBCSWUS                                                 01285000
LCBUSUC  EQU   LCBCSWUS                                                 01286000
LCBUSDE  EQU   LCBCSWUS                                                 01287000
LCBUSCE  EQU   LCBCSWUS                                                 01288000
LCBUSBSY EQU   LCBCSWUS                                                 01289000
LCBUSCUE EQU   LCBCSWUS                                                 01290000
LCBUSSM  EQU   LCBCSWUS                                                 01291000
LCBUSAT  EQU   LCBCSWUS                                                 01292000
LCBCSWCA EQU   LCBCSW                                                   01293000
LCBOBR   EQU   LCBFLAG3                                                 01294000
LCBOBRRD EQU   LCBFLAG3                                                 01295000
LCBIOMSG EQU   LCBFLAG3                                                 01296000
LCBSOHC  EQU   LCBFLAG3                                                 01297000
LCBRLAD  EQU   LCBFLAG3                                                 01298000
LCBSOHR  EQU   LCBFLAG3                                                 01299000
@NM00115 EQU   LCBFLAG3                                                 01300000
LCBECBCC EQU   LCBIOBSN+3                                               01301000
LCBSENS1 EQU   LCBSNS+1                                                 01302000
LCBABORT EQU   LCBTMOUT                                                 01303000
LCBNOTIN EQU   LCBLOSDT                                                 01304000
LCBOVRUN EQU   LCBSENS0                                                 01305000
LCBDATCK EQU   LCBSENS0                                                 01306000
LCBEQUCK EQU   LCBSENS0                                                 01307000
LCBBUSCK EQU   LCBSENS0                                                 01308000
LCBINTRQ EQU   LCBSENS0                                                 01309000
LCBCMDRJ EQU   LCBSENS0                                                 01310000
LCBFLAG2 EQU   LCBIOBSN                                                 01311000
@NM00114 EQU   LCBFLAG1                                                 01312000
LCBUNREL EQU   LCBFLAG1                                                 01313000
LCBEXCPN EQU   LCBFLAG1                                                 01314000
@NM00113 EQU   LCBFLAG1                                                 01315000
LCBERPIN EQU   LCBFLAG1                                                 01316000
@NM00112 EQU   LCBFLAG1                                                 01317000
LCBFSBFR EQU   LCBMHA                                                   01318000
LCBISZE  EQU   IEDQLCB+28                                               01319000
LCBLNENT EQU   LCBSCBDA+1                                               01320000
@NM00111 EQU   LCBSCBDA                                                 01321000
LCBCPGMH EQU   LCBSTAT4                                                 01322000
LCBREAL  EQU   LCBPHASE                                                 01323000
@NM00110 EQU   LCBSTAT4                                                 01324000
LCBACTRQ EQU   LCBSTAT4                                                 01325000
LCBIPLRQ EQU   LCBSTAT4                                                 01326000
LCBDACRQ EQU   LCBSTAT4                                                 01327000
LCBDMPRQ EQU   LCBSTAT4                                                 01328000
@NM00109 EQU   LCBLKMDE                                                 01329000
LCBLOCKI EQU   LCBLKMDE                                                 01330000
LCBLOCKR EQU   LCBLKMDE                                                 01331000
LCBHMFLG EQU   LCBLKMDE                                                 01332000
LCBBDFLG EQU   LCBLKMDE                                                 01333000
@NM00108 EQU   LCBINSRC                                                 01334000
LCBABRTN EQU   LCBCHAIN                                                 01335000
LCBCTLMD EQU   LCBTETEN                                                 01336000
LCBBFRSZ EQU   LCBCHAIN                                                 01337000
LCBUREQN EQU   LCBCHAIN                                                 01338000
LCBNORTY EQU   LCBCHAIN                                                 01339000
LCBERMSG EQU   LCBCHAIN                                                 01340000
LCBEXCP  EQU   LCBCHAIN                                                 01341000
LCBINVRQ EQU   LCBSCRNN                                                 01342000
LCB2741N EQU   LCBTSOB                                                  01343000
LCBINHBN EQU   LCBTSOB                                                  01344000
LCBCIRCD EQU   LCBTSOB                                                  01345000
LCBPREP  EQU   LCBTSOB                                                  01346000
LCBSOPL  EQU   LCBTSOB                                                  01347000
LCBSATRD EQU   LCBTSOB                                                  01348000
LCBTSBUF EQU   LCBTSOB                                                  01349000
LCBWRBRK EQU   LCBTSOB                                                  01350000
LCBTDL   EQU   IEDQLCB+18                                               01351000
LCBEOLTD EQU   IEDQLCB+16                                               01352000
LCBRSLNK EQU   IEDQLCB+13                                               01353000
LCBRSPRI EQU   IEDQLCB+12                                               01354000
LCBSTCBA EQU   IEDQLCB+9                                                01355000
LCBRSKEY EQU   IEDQLCB+8                                                01356000
LCBLINK  EQU   LCBRCB+5                                                 01357000
LCBPRI   EQU   LCBRCB+4                                                 01358000
LCBQCBA  EQU   LCBRCB+1                                                 01359000
LCBKEY   EQU   LCBRCB                                                   01360000
CVTLEVL  EQU   CVTRELNO+2                                               01361000
CVTNUMB  EQU   CVTRELNO                                                 01362000
CVTMDL   EQU   CVTFIX+250                                               01363000
@NM00107 EQU   CVTFIX+248                                               01364000
@NM00106 EQU   CVTFIX                                                   01365000
CVTRV482 EQU   CVTXTNT2+128                                             01366000
CVTRV481 EQU   CVTXTNT2+124                                             01367000
CVTRV480 EQU   CVTXTNT2+120                                             01368000
CVTRV479 EQU   CVTXTNT2+118                                             01369000
CVTRV478 EQU   CVTXTNT2+117                                             01370000
CVTRV477 EQU   CVTXTNT2+116                                             01371000
CVTRV476 EQU   CVTXTNT2+115                                             01372000
CVTRV475 EQU   CVTXTNT2+114                                             01373000
CVTRV474 EQU   CVTRV466                                                 01374000
CVTRV473 EQU   CVTRV466                                                 01375000
CVTRV472 EQU   CVTRV466                                                 01376000
CVTRV471 EQU   CVTRV466                                                 01377000
CVTRV470 EQU   CVTRV466                                                 01378000
CVTRV469 EQU   CVTRV466                                                 01379000
CVTRV468 EQU   CVTRV466                                                 01380000
CVTRV467 EQU   CVTRV466                                                 01381000
CVTRV465 EQU   CVTRV457                                                 01382000
CVTRV464 EQU   CVTRV457                                                 01383000
CVTRV463 EQU   CVTRV457                                                 01384000
CVTRV462 EQU   CVTRV457                                                 01385000
CVTRV461 EQU   CVTRV457                                                 01386000
CVTRV460 EQU   CVTRV457                                                 01387000
CVTRV459 EQU   CVTRV457                                                 01388000
CVTRV458 EQU   CVTRV457                                                 01389000
CVTRV456 EQU   CVTXTNT2+108                                             01390000
CVTRV455 EQU   CVTXTNT2+104                                             01391000
CVTRV454 EQU   CVTXTNT2+100                                             01392000
CVTRV453 EQU   CVTXTNT2+96                                              01393000
CVTRV452 EQU   CVTXTNT2+94                                              01394000
CVTRV451 EQU   CVTXTNT2+92                                              01395000
CVTRV450 EQU   CVTXTNT2+90                                              01396000
CVTRV449 EQU   CVTXTNT2+88                                              01397000
CVTRV448 EQU   CVTXTNT2+87                                              01398000
CVTRV447 EQU   CVTXTNT2+86                                              01399000
CVTRV446 EQU   CVTRV438                                                 01400000
CVTRV445 EQU   CVTRV438                                                 01401000
CVTRV444 EQU   CVTRV438                                                 01402000
CVTRV443 EQU   CVTRV438                                                 01403000
CVTRV442 EQU   CVTRV438                                                 01404000
CVTRV441 EQU   CVTRV438                                                 01405000
CVTRV440 EQU   CVTRV438                                                 01406000
CVTRV439 EQU   CVTRV438                                                 01407000
CVTRV437 EQU   CVTRV429                                                 01408000
CVTRV436 EQU   CVTRV429                                                 01409000
CVTRV435 EQU   CVTRV429                                                 01410000
CVTRV434 EQU   CVTRV429                                                 01411000
CVTRV433 EQU   CVTRV429                                                 01412000
CVTRV432 EQU   CVTRV429                                                 01413000
CVTRV431 EQU   CVTRV429                                                 01414000
CVTRV430 EQU   CVTRV429                                                 01415000
CVTRV428 EQU   CVTXTNT2+80                                              01416000
CVTRV427 EQU   CVTXTNT2+76                                              01417000
CVTRV426 EQU   CVTXTNT2+72                                              01418000
CVTRV425 EQU   CVTXTNT2+68                                              01419000
CVTATACT EQU   CVTATCVT                                                 01420000
CVTRV423 EQU   CVTXTNT2+62                                              01421000
CVTRV422 EQU   CVTXTNT2+60                                              01422000
CVTRV421 EQU   CVTXTNT2+58                                              01423000
CVTRV420 EQU   CVTXTNT2+56                                              01424000
CVTRV419 EQU   CVTXTNT2+55                                              01425000
CVTRV418 EQU   CVTXTNT2+54                                              01426000
CVTRV417 EQU   CVTRV409                                                 01427000
CVTRV416 EQU   CVTRV409                                                 01428000
CVTRV415 EQU   CVTRV409                                                 01429000
CVTRV414 EQU   CVTRV409                                                 01430000
CVTRV413 EQU   CVTRV409                                                 01431000
CVTRV412 EQU   CVTRV409                                                 01432000
CVTRV411 EQU   CVTRV409                                                 01433000
CVTRV410 EQU   CVTRV409                                                 01434000
CVTRV408 EQU   CVTRV400                                                 01435000
CVTRV407 EQU   CVTRV400                                                 01436000
CVTRV406 EQU   CVTRV400                                                 01437000
CVTRV405 EQU   CVTRV400                                                 01438000
CVTRV404 EQU   CVTRV400                                                 01439000
CVTRV403 EQU   CVTRV400                                                 01440000
CVTRV402 EQU   CVTRV400                                                 01441000
CVTRV401 EQU   CVTRV400                                                 01442000
CVTICB   EQU   CVTXTNT2+48                                              01443000
CVTSKTA  EQU   CVTXTNT2+44                                              01444000
CVTSHSB  EQU   CVTSHS                                                   01445000
CVTRSV98 EQU   CVTXTNT2+36                                              01446000
CVTRSV97 EQU   CVTXTNT2+34                                              01447000
CVTRSV96 EQU   CVTXTNT2+32                                              01448000
CVTOLTEP EQU   CVTXTNT2+28                                              01449000
CVTQIDA  EQU   CVTQID+1                                                 01450000
CVTRSV95 EQU   CVTQID                                                   01451000
CVTRSV94 EQU   CVTXTNT2+20                                              01452000
CVTRSV93 EQU   CVTXTNT2+16                                              01453000
CVTRSV92 EQU   CVTXTNT2+12                                              01454000
CVTDEBVR EQU   CVTXTNT2+8                                               01455000
CVTRSV91 EQU   CVTXTNT2+6                                               01456000
CVTRSV9H EQU   CVTFLGBT                                                 01457000
CVTRSV9G EQU   CVTFLGBT                                                 01458000
CVTRSV9F EQU   CVTFLGBT                                                 01459000
CVTRSV9E EQU   CVTFLGBT                                                 01460000
CVTRSV9D EQU   CVTFLGBT                                                 01461000
CVTRSV9C EQU   CVTFLGBT                                                 01462000
CVTVME   EQU   CVTFLGBT                                                 01463000
CVTNPE   EQU   CVTFLGBT                                                 01464000
CVTNUCLS EQU   CVTXTNT2+4                                               01465000
CVTDSSVA EQU   CVTDSSV+1                                                01466000
CVTRSV89 EQU   CVTDSSV                                                  01467000
CVTRSV88 EQU   CVTXTNT1+8                                               01468000
CVTRSV87 EQU   CVTXTNT1+4                                               01469000
CVTFACHN EQU   CVTXTNT1                                                 01470000
CVTRV488 EQU   CVTMAP+412                                               01471000
CVTRV487 EQU   CVTMAP+408                                               01472000
CVTRV486 EQU   CVTMAP+404                                               01473000
CVTRV485 EQU   CVTMAP+400                                               01474000
CVTACTAP EQU   CVTMAP+396                                               01475000
CVTAUTH  EQU   CVTMAP+392                                               01476000
CVTATMCA EQU   CVTATMCT+1                                               01477000
CVTATMST EQU   CVTATMCT                                                 01478000
CVTRSV61 EQU   CVTMAP+384                                               01479000
CVTVOLT1 EQU   CVTVOLM1+1                                               01480000
CVTVOLI1 EQU   CVTVOLF1                                                 01481000
CVTSTOA  EQU   CVTMAP+376                                               01482000
CVTRSV58 EQU   CVTMAP+374                                               01483000
CVTRSV57 EQU   CVTMAP+372                                               01484000
CVTDDCE  EQU   CVTMAP+368                                               01485000
CVTPNWFR EQU   CVTMAP+364                                               01486000
CVTSMF   EQU   CVTMAP+360                                               01487000
CVTSULK  EQU   CVTMAP+358                                               01488000
CVTSLKO  EQU   CVTSYSK                                                  01489000
CVTSLKP  EQU   CVTSYSK                                                  01490000
CVTSLKQ  EQU   CVTSYSK                                                  01491000
CVTSLKR  EQU   CVTSYSK                                                  01492000
CVTRSV56 EQU   CVTSYSK                                                  01493000
CVTRSV55 EQU   CVTSYSK                                                  01494000
CVTRSV54 EQU   CVTSYSK                                                  01495000
CVTRSV53 EQU   CVTSYSK                                                  01496000
CVTRSV52 EQU   CVTA1F1                                                  01497000
CVTRSV51 EQU   CVTA1F1                                                  01498000
CVTRSV50 EQU   CVTA1F1                                                  01499000
CVTRSV49 EQU   CVTA1F1                                                  01500000
CVTRSV48 EQU   CVTA1F1                                                  01501000
CVTRSV47 EQU   CVTA1F1                                                  01502000
CVTSRSW  EQU   CVTA1F1                                                  01503000
CVTPFSW  EQU   CVTA1F1                                                  01504000
CVTPCVT  EQU   CVTMAP+352                                               01505000
CVTRSV46 EQU   CVTMAP+344                                               01506000
CVTRSV45 EQU   CVTMAP+340                                               01507000
CVTRSV44 EQU   CVTMAP+338                                               01508000
CVTRSV43 EQU   CVTMAP+336                                               01509000
CVTHJESA EQU   CVTHJES+1                                                01510000
CVTRSV42 EQU   CVTHJES                                                  01511000
CVTEXT2A EQU   CVTEXT2+1                                                01512000
CVTRSV41 EQU   CVTEXT2                                                  01513000
CVTAPFA  EQU   CVTAPF+1                                                 01514000
CVTRSV40 EQU   CVTAPF                                                   01515000
CVTRV518 EQU   CVTINTLA                                                 01516000
CVTRV517 EQU   CVTERPV                                                  01517000
CVTEORM  EQU   CVTMAP+312                                               01518000
CVTMCHPR EQU   CVTMAP+308                                               01519000
CVTTZ    EQU   CVTMAP+304                                               01520000
CVTJEPS  EQU   CVTMAP+300                                               01521000
CVTJESCT EQU   CVTMAP+296                                               01522000
CVTMODE  EQU   CVTMAP+292                                               01523000
CVTPTRV  EQU   CVTMAP+288                                               01524000
CVTREAL  EQU   CVTMAP+284                                               01525000
CVTRSV39 EQU   CVTMAP+280                                               01526000
CVTRSV38 EQU   CVTMAP+276                                               01527000
CVTDMSRA EQU   CVTDMSR+1                                                01528000
CVTRV634 EQU   CVTDMSRF                                                 01529000
CVTRV633 EQU   CVTDMSRF                                                 01530000
CVTRV632 EQU   CVTDMSRF                                                 01531000
CVTRV631 EQU   CVTDMSRF                                                 01532000
CVTRV630 EQU   CVTDMSRF                                                 01533000
CVTRV629 EQU   CVTDMSRF                                                 01534000
CVTUDUMP EQU   CVTDMSRF                                                 01535000
CVTSDUMP EQU   CVTDMSRF                                                 01536000
CVTQMSGA EQU   CVTQMSG+1                                                01537000
CVTRSV36 EQU   CVTQMSG                                                  01538000
CVTAMFF  EQU   CVTMAP+264                                               01539000
CVTPURGA EQU   CVTPURG+1                                                01540000
CVTRSV35 EQU   CVTPURG                                                  01541000
CVTCBSP  EQU   CVTMAP+256                                               01542000
CVTATERA EQU   CVTATER+1                                                01543000
CVTSYST  EQU   CVTATER                                                  01544000
CVTVOLT2 EQU   CVTTAT                                                   01545000
CVTVOLI2 EQU   CVTVOLF2                                                 01546000
CVTAQAVB EQU   CVTAQAVT+1                                               01547000
CVTRSV34 EQU   CVTTCMFG                                                 01548000
CVTRSV33 EQU   CVTTCMFG                                                 01549000
CVTRSV32 EQU   CVTTCMFG                                                 01550000
CVTRSV31 EQU   CVTTCMFG                                                 01551000
CVTRSV30 EQU   CVTTCMFG                                                 01552000
CVTRSV29 EQU   CVTTCMFG                                                 01553000
CVTRSV28 EQU   CVTTCMFG                                                 01554000
CVTTCRDY EQU   CVTTCMFG                                                 01555000
CVTGTFA  EQU   CVTGTF+1                                                 01556000
CVTRSV27 EQU   CVTGTFST                                                 01557000
CVTRNIO  EQU   CVTGTFST                                                 01558000
CVTUSR   EQU   CVTGTFST                                                 01559000
CVTRV318 EQU   CVTFORM                                                  01560000
CVTRV317 EQU   CVTTMODE                                                 01561000
CVTRV316 EQU   CVTSTATE                                                 01562000
CVTRV315 EQU   CVTGTFS                                                  01563000
CVTGTFAV EQU   CVTGTFS                                                  01564000
CVT0SCR1 EQU   CVTMAP+232                                               01565000
CVTRV515 EQU   CVTMAP+228                                               01566000
CVTRMS   EQU   CVTMAP+224                                               01567000
CVTPATCH EQU   CVTMAP+220                                               01568000
CVTTSCE  EQU   CVTMAP+216                                               01569000
CVTLNKSC EQU   CVTMAP+214                                               01570000
CVTQABST EQU   CVTMAP+212                                               01571000
CVTMDLDS EQU   CVTMAP+208                                               01572000
CVTUSER  EQU   CVTMAP+204                                               01573000
CVTABEND EQU   CVTMAP+200                                               01574000
CVTSMCA  EQU   CVTMAP+196                                               01575000
CVTRSV18 EQU   CVTMAP+192                                               01576000
CVTQLPAQ EQU   CVTMAP+188                                               01577000
CVTQCDSR EQU   CVTMAP+184                                               01578000
CVTRSV17 EQU   CVTOPTB                                                  01579000
CVTRSV16 EQU   CVTOPTB                                                  01580000
CVTFP    EQU   CVTOPTB                                                  01581000
CVTAPTHR EQU   CVTOPTB                                                  01582000
CVTNLOG  EQU   CVTOPTB                                                  01583000
CVTTOD   EQU   CVTOPTB                                                  01584000
CVTCTIMS EQU   CVTOPTB                                                  01585000
CVTPROT  EQU   CVTOPTB                                                  01586000
CVTXPFP  EQU   CVTOPTA                                                  01587000
CVTASCII EQU   CVTOPTA                                                  01588000
CVTRSV13 EQU   CVTOPTA                                                  01589000
CVTRSV12 EQU   CVTOPTA                                                  01590000
CVTNIP   EQU   CVTOPTA                                                  01591000
CVTDDR   EQU   CVTOPTA                                                  01592000
CVTAPR   EQU   CVTOPTA                                                  01593000
CVTCCH   EQU   CVTOPTA                                                  01594000
CVTSNCTR EQU   CVTMAP+180                                               01595000
CVTQMWR  EQU   CVTMAP+176                                               01596000
CVTQOCR  EQU   CVTMAP+172                                               01597000
CVT1EF00 EQU   CVTMAP+168                                               01598000
CVTMZ00  EQU   CVTMAP+164                                               01599000
CVTHEAD  EQU   CVTMAP+160                                               01600000
CVTRSV11 EQU   CVTMAP+156                                               01601000
CVT0PT01 EQU   CVTMAP+152                                               01602000
CVTMSER  EQU   CVTMAP+148                                               01603000
CVTRV516 EQU   CVTIERLC                                                 01604000
CVTILCH  EQU   CVTMAP+140                                               01605000
CVT0DS   EQU   CVTMAP+136                                               01606000
CVTFBOSV EQU   CVTMAP+132                                               01607000
CVTNUCB  EQU   CVTMAP+128                                               01608000
CVTIXAVL EQU   CVTMAP+124                                               01609000
CVTIOQET EQU   CVTMAP+120                                               01610000
CVTDCBA  EQU   CVTMAP+117                                               01611000
CVTMVS2  EQU   CVTDCB                                                   01612000
CVT6DAT  EQU   CVTDCB                                                   01613000
CVT4MPS  EQU   CVTDCB                                                   01614000
CVTRSV09 EQU   CVTDCB                                                   01615000
CVT4MS1  EQU   CVTDCB                                                   01616000
CVT2SPS  EQU   CVTDCB                                                   01617000
CVT1SSS  EQU   CVTDCB                                                   01618000
CVTRSV08 EQU   CVTDCB                                                   01619000
CVTSTB   EQU   CVTMAP+112                                               01620000
CVTQTD00 EQU   CVTMAP+108                                               01621000
CVTQTE00 EQU   CVTMAP+104                                               01622000
CVTCUCB  EQU   CVTMAP+100                                               01623000
CVTSJQ   EQU   CVTMAP+96                                                01624000
CVTPBLDL EQU   CVTMAP+92                                                01625000
CVTTPC   EQU   CVTMAP+88                                                01626000
CVTSVDCB EQU   CVTMAP+84                                                01627000
CVTBRET  EQU   CVTMAP+82                                                01628000
CVTEXIT  EQU   CVTMAP+80                                                01629000
CVT0FN00 EQU   CVTMAP+76                                                01630000
CVTDARA  EQU   CVTDAR+1                                                 01631000
CVTRSV07 EQU   CVTFLGS1                                                 01632000
CVTRSV06 EQU   CVTFLGS1                                                 01633000
CVTRSV05 EQU   CVTFLGS1                                                 01634000
CVTRSV04 EQU   CVTFLGS1                                                 01635000
CVTRSV03 EQU   CVTFLGS1                                                 01636000
CVTRSV02 EQU   CVTFLGS1                                                 01637000
CVTRSV01 EQU   CVTFLGS1                                                 01638000
CVTDMPLK EQU   CVTFLGS1                                                 01639000
CVTXITP  EQU   CVTMAP+68                                                01640000
CVTZDTAB EQU   CVTMAP+64                                                01641000
CVTMSLT  EQU   CVTMAP+60                                                01642000
CVTDATE  EQU   CVTMAP+56                                                01643000
CVTBTERM EQU   CVTMAP+52                                                01644000
CVTSYSAD EQU   CVTMAP+48                                                01645000
CVTXTLER EQU   CVTMAP+44                                                01646000
CVTILK2  EQU   CVTMAP+40                                                01647000
CVTILK1  EQU   CVTMAP+36                                                01648000
CVTPRLTV EQU   CVTMAP+32                                                01649000
CVTPCNVT EQU   CVTMAP+28                                                01650000
CVT0VL00 EQU   CVTMAP+24                                                01651000
CVTXAPG  EQU   CVTMAP+20                                                01652000
CVTBUF   EQU   CVTMAP+16                                                01653000
CVTJOB   EQU   CVTMAP+12                                                01654000
CVTLINK  EQU   CVTMAP+8                                                 01655000
CVT0EF00 EQU   CVTMAP+4                                                 01656000
CVTTCBP  EQU   CVTMAP                                                   01657000
CVT      EQU   CVTMAP                                                   01658000
SAVTLLCB EQU   IEDNSVTD+316                                             01659000
SAVTBITN EQU   IEDNSVTD+312                                             01660000
@NM00105 EQU   SAVTCKQB+8                                               01661000
@NM00104 EQU   SAVTCKEC+1                                               01662000
@NM00103 EQU   SAVTCKCC                                                 01663000
SAVTCKPO EQU   SAVTCKCC                                                 01664000
SAVTCKWA EQU   SAVTCKCC                                                 01665000
SAVTCKCH EQU   SAVTCKTB+1                                               01666000
SAVTCKVT EQU   SAVTCKTB                                                 01667000
@NM00102 EQU   IEDNSVTD+297                                             01668000
SAVTRDFG EQU   SAVTRDRV+12                                              01669000
@NM00101 EQU   SAVTRDRV+5                                               01670000
SAVTRDPY EQU   SAVTRDRV+4                                               01671000
SAVTRDQB EQU   SAVTRDRV+1                                               01672000
SAVTRDKY EQU   SAVTRDRV                                                 01673000
SAVTNID  EQU   IEDNSVTD+280                                             01674000
SAVTDVAS EQU   IEDNSVTD+276                                             01675000
SAVTPLSZ EQU   IEDNSVTD+274                                             01676000
@NM00100 EQU   IEDNSVTD+273                                             01677000
SAVTSUBL EQU   IEDNSVTD+272                                             01678000
@NM00099 EQU   SAVTZELM+1                                               01679000
SAVTSUBM EQU   SAVTZELM                                                 01680000
SAVTMHDX EQU   IEDNSVTD+268                                             01681000
SAVTNAT1 EQU   IEDNSVTD+266                                             01682000
SAVTSH20 EQU   IEDNSVTD+264                                             01683000
SAVTLCBS EQU   IEDNSVTD+260                                             01684000
SAVTRNMP EQU   IEDNSVTD+256                                             01685000
SAVTNAX  EQU   IEDNSVTD+248                                             01686000
SAVTSUBV EQU   IEDNSVTD+247                                             01687000
SAVTSUBA EQU   IEDNSVTD+246                                             01688000
SAVTSIBC EQU   IEDNSVTD+244                                             01689000
SAVTBSM  EQU   IEDNSVTD+240                                             01690000
SAVTSCPT EQU   SAVTTCPU                                                 01691000
SAVTRQTG EQU   IEDNSVTD+236                                             01692000
SAVTRQCH EQU   IEDNSVTD+232                                             01693000
SAVTMAND EQU   IEDNSVTD+228                                             01694000
SAVTSPLN EQU   IEDNSVTD+224                                             01695000
SAVTNADL EQU   IEDNSVTD+222                                             01696000
SAVTNATL EQU   IEDNSVTD+220                                             01697000
SAVTMHTB EQU   IEDNSVTD+216                                             01698000
SAVTSSMH EQU   IEDNSVTD+212                                             01699000
SAVTQRS  EQU   IEDNSVTD+208                                             01700000
SAVTRQIN EQU   IEDNSVTD+204                                             01701000
SAVTDFCO EQU   IEDNSVTD+200                                             01702000
SAVTSAO  EQU   IEDNSVTD+196                                             01703000
SAVTSARI EQU   IEDNSVTD+192                                             01704000
SAVTSAC  EQU   IEDNSVTD+188                                             01705000
SAVTSAI  EQU   IEDNSVTD+184                                             01706000
SAVTCSCI EQU   IEDNSVTD+180                                             01707000
SAVTSSRP EQU   IEDNSVTD+176                                             01708000
SAVTSSRQ EQU   IEDNSVTD+172                                             01709000
SAVTSCLU EQU   IEDNSVTD+168                                             01710000
SAVTXTRQ EQU   IEDNSVTD+164                                             01711000
SAVTMVBF EQU   IEDNSVTD+160                                             01712000
@NM00098 EQU   IEDNSVTD+148                                             01713000
SAVTIPCQ EQU   IEDNSVTD+144                                             01714000
@NM00097 EQU   IEDNSVTD+136                                             01715000
SAVTXFMI EQU   IEDNSVTD+132                                             01716000
@NM00096 EQU   IEDNSVTD+124                                             01717000
SAVTXFMO EQU   IEDNSVTD+120                                             01718000
@NM00095 EQU   IEDNSVTD+116                                             01719000
SAVTSSSR EQU   IEDNSVTD+112                                             01720000
SAVTSCPQ EQU   IEDNSVTD+108                                             01721000
SAVTSLCB EQU   IEDNSVTD+104                                             01722000
SAVTLUSR EQU   IEDNSVTD+100                                             01723000
@NM00094 EQU   SAVTLUSQ+8                                               01724000
SAVTLUSP EQU   SAVTLUSQ+4                                               01725000
SAVTLUSB EQU   SAVTLUSQ                                                 01726000
@NM00093 EQU   IEDNSVTD+84                                              01727000
SAVTSAT  EQU   IEDNSVTD+80                                              01728000
SAVTNAT  EQU   IEDNSVTD+76                                              01729000
SAVTCLUP EQU   IEDNSVTD+72                                              01730000
SAVTPIUT EQU   IEDNSVTD+68                                              01731000
SAVTRNTA EQU   IEDNSVTD+64                                              01732000
SAVTDNIR EQU   IEDNSVTD+60                                              01733000
SAVTCNIR EQU   IEDNSVTD+56                                              01734000
SAVTFLDH EQU   IEDNSVTD+52                                              01735000
SAVTSRTN EQU   IEDNSVTD+48                                              01736000
SAVTSREQ EQU   IEDNSVTD+44                                              01737000
SAVTFAIL EQU   IEDNSVTD+42                                              01738000
SAVTSUSE EQU   IEDNSVTD+40                                              01739000
SAVTSIB  EQU   IEDNSVTD+36                                              01740000
SAVTPRTN EQU   IEDNSVTD+32                                              01741000
@NM00092 EQU   IEDNSVTD+28                                              01742000
SAVTWH20 EQU   IEDNSVTD+26                                              01743000
SAVTPWT  EQU   IEDNSVTD+24                                              01744000
SAVTPRTQ EQU   IEDNSVTD+20                                              01745000
SAVTPREQ EQU   IEDNSVTD+16                                              01746000
SAVTPH20 EQU   IEDNSVTD+14                                              01747000
SAVTPUSE EQU   IEDNSVTD+12                                              01748000
SAVTPLCB EQU   IEDNSVTD+8                                               01749000
SAVTPOOL EQU   IEDNSVTD+4                                               01750000
SAVTPRMT EQU   SAVTDIAF                                                 01751000
SAVTVIRT EQU   SAVTDIAF                                                 01752000
AVTCPBNO EQU   IEDQAVTD+1244                                            01753000
AVTHRESS EQU   IEDQAVTD+1243                                            01754000
@NM00091 EQU   IEDQAVTD+1242                                            01755000
@NM00090 EQU   IEDQAVTD+1241                                            01756000
@NM00089 EQU   IEDQAVTD+1240                                            01757000
@NM00088 EQU   IEDQAVTD+1237                                            01758000
@NM00087 EQU   IEDQAVTD+1236                                            01759000
AVTHRESE EQU   @NM00086                                                 01760000
AVTRADDR EQU   IEDQAVTD+1228                                            01761000
AVTNADDR EQU   IEDQAVTD+1224                                            01762000
AVTHRESN EQU   IEDQAVTD+1220                                            01763000
AVTVOLRN EQU   IEDQAVTD+1216                                            01764000
AVTTOTNN EQU   IEDQAVTD+1212                                            01765000
AVTTRCYN EQU   IEDQAVTD+1208                                            01766000
AVTRCTRN EQU   IEDQAVTD+1204                                            01767000
AVTNOVON EQU   IEDQAVTD+1200                                            01768000
AVTADEBN EQU   IEDQAVTD+1196                                            01769000
AVTVOLRR EQU   IEDQAVTD+1192                                            01770000
AVTTOTNR EQU   IEDQAVTD+1188                                            01771000
AVTTRCYR EQU   IEDQAVTD+1184                                            01772000
AVTRCTRR EQU   IEDQAVTD+1180                                            01773000
AVTNOVOR EQU   IEDQAVTD+1176                                            01774000
AVTADEBR EQU   IEDQAVTD+1172                                            01775000
AVTLODPT EQU   IEDQAVTD+1168                                            01776000
AVTIOBN  EQU   IEDQAVTD+1164                                            01777000
AVTIOBR  EQU   IEDQAVTD+1160                                            01778000
AVTCPBPT EQU   IEDQAVTD+1156                                            01779000
AVTFCPB  EQU   IEDQAVTD+1152                                            01780000
@NM00085 EQU   IEDQAVTD+1148                                            01781000
AVTINCPQ EQU   IEDQAVTD+1144                                            01782000
@NM00084 EQU   IEDQAVTD+1140                                            01783000
@NM00083 EQU   IEDQAVTD+1137                                            01784000
@NM00082 EQU   AVTBIT4                                                  01785000
@NM00081 EQU   AVTBIT4                                                  01786000
@NM00080 EQU   AVTBIT4                                                  01787000
@NM00079 EQU   AVTBIT4                                                  01788000
@NM00078 EQU   AVTBIT4                                                  01789000
@NM00077 EQU   AVTBIT4                                                  01790000
@NM00076 EQU   AVTBIT4                                                  01791000
AVTRUFTN EQU   AVTBIT4                                                  01792000
@NM00075 EQU   IEDQAVTD+1132                                            01793000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01794000
@NM00074 EQU   IEDQAVTD+1124                                            01795000
AVTDKENQ EQU   IEDQAVTD+1120                                            01796000
@NM00073 EQU   IEDQAVTD+1116                                            01797000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01798000
AVTCOPY  EQU   IEDQAVTD+1108                                            01799000
AVTIA    EQU   IEDQAVTD+1104                                            01800000
AVTFL    EQU   IEDQAVTD+1100                                            01801000
@NM00072 EQU   IEDQAVTD+1096                                            01802000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01803000
AVTTOTNC EQU   IEDQAVTD+1088                                            01804000
AVTCMAX  EQU   IEDQAVTD+1084                                            01805000
AVTCMIN  EQU   IEDQAVTD+1080                                            01806000
AVTHM02  EQU   IEDQAVTD+1076                                            01807000
AVTOPCIN EQU   IEDQAVTD+1074                                            01808000
AVTDCTLN EQU   IEDQAVTD+1072                                            01809000
AVTOPMSK EQU   IEDQAVTD+1068                                            01810000
AVTDDFT  EQU   IEDQAVTD+1064                                            01811000
AVTSTEAL EQU   IEDQAVTD+1060                                            01812000
AVTOPTN  EQU   IEDQAVTD+1056                                            01813000
AVTDSKCT EQU   IEDQAVTD+1054                                            01814000
AVTCKRST EQU   IEDQAVTD+1053                                            01815000
AVTSTAN  EQU   AVTBIT3                                                  01816000
AVTSTACN EQU   AVTBIT3                                                  01817000
AVTSTAIN EQU   AVTBIT3                                                  01818000
AVTSTAYN EQU   AVTBIT3                                                  01819000
AVTOLTBN EQU   AVTBIT3                                                  01820000
AVTTSAB  EQU   AVTBIT3                                                  01821000
AVTRFULN EQU   AVTBIT3                                                  01822000
AVTRECVN EQU   AVTBIT3                                                  01823000
@NM00071 EQU   AVTBIT2                                                  01824000
@NM00070 EQU   AVTBIT2                                                  01825000
AVTOPEIN EQU   AVTBIT2                                                  01826000
AVTSTRTN EQU   AVTBIT2                                                  01827000
AVTTOPOL EQU   AVTBIT2                                                  01828000
AVTCOPYN EQU   AVTBIT2                                                  01829000
AVTREUSN EQU   AVTBIT2                                                  01830000
AVTEXTSC EQU   AVTBIT2                                                  01831000
AVTDISKN EQU   AVTBIT1                                                  01832000
AVTQUCKN EQU   AVTBIT1                                                  01833000
AVTCLOSN EQU   AVTBIT1                                                  01834000
AVTREADN EQU   AVTBIT1                                                  01835000
AVTDLAYN EQU   AVTBIT1                                                  01836000
AVTAQTAN EQU   AVTBIT1                                                  01837000
AVTTSON  EQU   AVTBIT1                                                  01838000
AVTAPLKN EQU   AVTBIT1                                                  01839000
AVTDUMBR EQU   IEDQAVTD+1048                                            01840000
AVTDLQX  EQU   IEDQAVTD+1046                                            01841000
AVTINTLV EQU   IEDQAVTD+1044                                            01842000
AVTSMCNT EQU   IEDQAVTD+1042                                            01843000
AVTAVFCT EQU   IEDQAVTD+1040                                            01844000
AVTOPCON EQU   IEDQAVTD+1038                                            01845000
AVTOPCNT EQU   IEDQAVTD+1036                                            01846000
AVTLNCNT EQU   IEDQAVTD+1034                                            01847000
AVTKEYLE EQU   IEDQAVTD+1032                                            01848000
AVTHA16  EQU   IEDQAVTD+1030                                            01849000
AVTHA7   EQU   IEDQAVTD+1028                                            01850000
AVTHA4   EQU   IEDQAVTD+1026                                            01851000
AVTHA3   EQU   IEDQAVTD+1024                                            01852000
AVTHA2   EQU   IEDQAVTD+1022                                            01853000
AVTGETMS EQU   IEDQAVTD+1021                                            01854000
@NM00069 EQU   IEDQAVTD+1020                                            01855000
AVTGETMD EQU   IEDQAVTD+1016                                            01856000
AVTGETMN EQU   IEDQAVTD+1012                                            01857000
AVTCWTOT EQU   IEDQAVTD+1008                                            01858000
AVTCWINT EQU   IEDQAVTD+956                                             01859000
AVTDTRAP EQU   IEDQAVTD+952                                             01860000
@NM00068 EQU   IEDQAVTD+950                                             01861000
@NM00067 EQU   AVTIOTR                                                  01862000
AVTIOTRH EQU   AVTIOTR                                                  01863000
AVTIOTRE EQU   AVTIOTR                                                  01864000
@NM00066 EQU   AVTSUBT                                                  01865000
AVTSUBPT EQU   AVTSUBT                                                  01866000
AVTSUBON EQU   AVTSUBT                                                  01867000
AVTAFE30 EQU   IEDQAVTD+944                                             01868000
AVTAFE20 EQU   IEDQAVTD+940                                             01869000
AVTAFE10 EQU   IEDQAVTD+936                                             01870000
AVTCWEC2 EQU   IEDQAVTD+932                                             01871000
AVTCWPM2 EQU   IEDQAVTD+928                                             01872000
AVTCWTS2 EQU   IEDQAVTD+927                                             01873000
AVTCWTS1 EQU   IEDQAVTD+926                                             01874000
AVTCWCLD EQU   AVTCWFL2                                                 01875000
AVTCWRAP EQU   AVTCWFL2                                                 01876000
@NM00065 EQU   AVTCWFL2                                                 01877000
@NM00064 EQU   AVTCWFL2                                                 01878000
@NM00063 EQU   AVTCWFL2                                                 01879000
@NM00062 EQU   AVTCWFL2                                                 01880000
@NM00061 EQU   AVTCWFL2                                                 01881000
AVTCWACT EQU   AVTCWFL2                                                 01882000
@NM00060 EQU   AVTCWFL1                                                 01883000
@NM00059 EQU   AVTCWFL1                                                 01884000
@NM00058 EQU   AVTCWFL1                                                 01885000
@NM00057 EQU   AVTCWFL1                                                 01886000
@NM00056 EQU   AVTCWFL1                                                 01887000
@NM00055 EQU   AVTCWFL1                                                 01888000
@NM00054 EQU   AVTCWFL1                                                 01889000
AVTCOMWN EQU   AVTCWFL1                                                 01890000
AVTCWEC1 EQU   IEDQAVTD+920                                             01891000
AVTCWPM1 EQU   IEDQAVTD+916                                             01892000
AVTCAREA EQU   IEDQAVTD+912                                             01893000
AVTFZERO EQU   IEDQAVTD+908                                             01894000
AVTCADDR EQU   IEDQAVTD+904                                             01895000
AVTCOREC EQU   IEDQAVTD+900                                             01896000
@NM00053 EQU   IEDQAVTD+892                                             01897000
AVTCPBCB EQU   IEDQAVTD+888                                             01898000
@NM00052 EQU   IEDQAVTD+880                                             01899000
AVTDSIOB EQU   IEDQAVTD+876                                             01900000
@NM00051 EQU   IEDQAVTD+868                                             01901000
AVTCPRMB EQU   IEDQAVTD+864                                             01902000
@NM00050 EQU   IEDQAVTD+856                                             01903000
AVTCLOSB EQU   IEDQAVTD+852                                             01904000
@NM00049 EQU   IEDQAVTD+844                                             01905000
AVTACTIB EQU   IEDQAVTD+840                                             01906000
@NM00048 EQU   IEDQAVTD+836                                             01907000
AVTOLTEB EQU   IEDQAVTD+832                                             01908000
AVTOLTCH EQU   AVTOLTQB+1                                               01909000
AVTOLTVT EQU   AVTOLTQB                                                 01910000
@NM00047 EQU   AVTOPCQB+8                                               01911000
@NM00046 EQU   AVTOPCEC+1                                               01912000
@NM00045 EQU   AVTOPCCC                                                 01913000
AVTOPCPO EQU   AVTOPCCC                                                 01914000
AVTOPCWA EQU   AVTOPCCC                                                 01915000
AVTOPCCH EQU   AVTOPCOB+1                                               01916000
AVTOPCVT EQU   AVTOPCOB                                                 01917000
@NM00044 EQU   AVTCKPQB+9                                               01918000
AVTCKPTS EQU   AVTCKPQB+8                                               01919000
@NM00043 EQU   AVTCKPEC+1                                               01920000
@NM00042 EQU   AVTCKPCC                                                 01921000
AVTCKPPO EQU   AVTCKPCC                                                 01922000
AVTCKPWA EQU   AVTCKPCC                                                 01923000
AVTCKPCH EQU   AVTCKPTB+1                                               01924000
AVTCKPVT EQU   AVTCKPTB                                                 01925000
@NM00041 EQU   IEDQAVTD+796                                             01926000
AVTBFRTB EQU   IEDQAVTD+792                                             01927000
@NM00040 EQU   IEDQAVTD+788                                             01928000
AVTSELCH EQU   IEDQAVTD+785                                             01929000
AVTBFRTN EQU   AVTBFRFG                                                 01930000
AVTBFREB EQU   IEDQAVTD+780                                             01931000
AVTTIMQ  EQU   IEDQAVTD+776                                             01932000
@NM00039 EQU   IEDQAVTD+772                                             01933000
AVTIMQPS EQU   IEDQAVTD+768                                             01934000
AVTINOUT EQU   IEDQAVTD+766                                             01935000
AVTREFTM EQU   IEDQAVTD+764                                             01936000
@NM00038 EQU   IEDQAVTD+752                                             01937000
AVTDELYB EQU   IEDQAVTD+748                                             01938000
AVTOCQPT EQU   IEDQAVTD+744                                             01939000
AVTTSOPT EQU   IEDQAVTD+740                                             01940000
AVTSUPPT EQU   IEDQAVTD+736                                             01941000
AVTCBQCB EQU   IEDQAVTD+732                                             01942000
AVTMSGS  EQU   IEDQAVTD+729                                             01943000
@NM00037 EQU   AVTSYSER                                                 01944000
@NM00036 EQU   AVTSYSER                                                 01945000
@NM00035 EQU   AVTSYSER                                                 01946000
@NM00034 EQU   AVTSYSER                                                 01947000
@NM00033 EQU   AVTSYSER                                                 01948000
@NM00032 EQU   AVTSYSER                                                 01949000
AVTCMAXN EQU   AVTSYSER                                                 01950000
AVTCMINN EQU   AVTSYSER                                                 01951000
AVT2260L EQU   IEDQAVTD+724                                             01952000
AVTABEPL EQU   AVTADBUF                                                 01953000
AVTHFF   EQU   AVTCLRHI+2                                               01954000
@NM00031 EQU   AVTCLRHI                                                 01955000
AVTCCLNK EQU   AVTCRELE+5                                               01956000
AVTCCPRI EQU   AVTCRELE+4                                               01957000
AVTCCQCB EQU   AVTCCELE+1                                               01958000
AVTCCKEY EQU   AVTCCELE                                                 01959000
AVTDELAD EQU   IEDQAVTD+704                                             01960000
AVTDELEM EQU   IEDQAVTD+700                                             01961000
AVTBSX   EQU   AVTCKLNK                                                 01962000
AVTOPETR EQU   AVTHG01                                                  01963000
@NM00030 EQU   AVTCKBYT                                                 01964000
AVTCKONQ EQU   AVTCKBYT                                                 01965000
@NM00029 EQU   AVTCKBYT                                                 01966000
@NM00028 EQU   AVTCKBYT                                                 01967000
@NM00027 EQU   AVTCKBYT                                                 01968000
@NM00026 EQU   AVTCKBYT                                                 01969000
@NM00025 EQU   AVTCKBYT                                                 01970000
@NM00024 EQU   AVTCKBYT                                                 01971000
AVTOPERT EQU   IEDQAVTD+690                                             01972000
AVTOPXCL EQU   IEDQAVTD+688                                             01973000
AVTOPERL EQU   IEDQAVTD+687                                             01974000
@NM00023 EQU   IEDQAVTD+686                                             01975000
AVTCKTIM EQU   IEDQAVTD+684                                             01976000
AVTCKELV EQU   IEDQAVTD+682                                             01977000
AVTCPRCD EQU   IEDQAVTD+681                                             01978000
AVTWARMN EQU   AVTCKELF                                                 01979000
AVTCRTLN EQU   AVTCKELF                                                 01980000
AVTCPIPN EQU   AVTCKELF                                                 01981000
AVTCCLCN EQU   AVTCKELF                                                 01982000
AVTCINCN EQU   AVTCKELF                                                 01983000
@NM00022 EQU   AVTCKELF                                                 01984000
AVTCMCPN EQU   AVTCKELF                                                 01985000
AVTNQBCK EQU   AVTCKELF                                                 01986000
AVTCKQAD EQU   IEDQAVTD+677                                             01987000
AVTSCBSZ EQU   IEDQAVTD+676                                             01988000
@NM00021 EQU   IEDQAVTD+672                                             01989000
AVTCKELE EQU   IEDQAVTD+668                                             01990000
@NM00020 EQU   AVTCKPEL+8                                               01991000
AVTCKRLK EQU   AVTCKPEL+5                                               01992000
AVTCKRPR EQU   AVTCKPEL+4                                               01993000
AVTCKRMQ EQU   AVTCKRMV+1                                               01994000
AVTCKRKY EQU   AVTCKRMV                                                 01995000
AVTHK    EQU   IEDQAVTD+648                                             01996000
AVTHI    EQU   IEDQAVTD+644                                             01997000
AVTIOT   EQU   IEDQAVTD+640                                             01998000
AVTNX    EQU   IEDQAVTD+636                                             01999000
AVTTONE  EQU   IEDQAVTD+632                                             02000000
AVTA3TL  EQU   IEDQAVTD+628                                             02001000
AVTDMECB EQU   IEDQAVTD+624                                             02002000
AVTABEND EQU   IEDQAVTD+618                                             02003000
AVTPLCBN EQU   IEDQAVTD+616                                             02004000
@NM00019 EQU   AVTSAVTP+1                                               02005000
@NM00018 EQU   AVTSAVTF                                                 02006000
AVTSNA   EQU   AVTSAVTF                                                 02007000
AVTONSNA EQU   AVTSAVTF                                                 02008000
AVTVTMCP EQU   AVTSAVTF                                                 02009000
@NM00017 EQU   IEDQAVTD+608                                             02010000
AVTCMBSS EQU   IEDQAVTD+604                                             02011000
AVTRCV   EQU   IEDQAVTD+600                                             02012000
AVTSEND  EQU   IEDQAVTD+596                                             02013000
AVTCSCH  EQU   IEDQAVTD+592                                             02014000
AVTQ1    EQU   IEDQAVTD+588                                             02015000
AVTE7    EQU   IEDQAVTD+584                                             02016000
AVTHB    EQU   IEDQAVTD+580                                             02017000
AVTR1    EQU   IEDQAVTD+576                                             02018000
AVTBZ    EQU   IEDQAVTD+572                                             02019000
AVTEZ    EQU   IEDQAVTD+568                                             02020000
AVTEC    EQU   IEDQAVTD+564                                             02021000
AVTEW    EQU   IEDQAVTD+560                                             02022000
AVTNDIAL EQU   AVTSCOPT                                                 02023000
AVTN2741 EQU   AVTSCOPT                                                 02024000
AVTCONCO EQU   AVTSCOPT                                                 02025000
AVTCONC  EQU   AVTSCOPT                                                 02026000
AVTCMBUF EQU   AVTSCOPT                                                 02027000
AVTAPDMP EQU   AVTSCOPT                                                 02028000
@NM00016 EQU   AVTSCOPT                                                 02029000
AVTHA    EQU   AVTDISP                                                  02030000
AVTEA    EQU   IEDQAVTD+548                                             02031000
AVTAX    EQU   IEDQAVTD+544                                             02032000
AVTA3    EQU   IEDQAVTD+540                                             02033000
AVTGD    EQU   IEDQAVTD+536                                             02034000
AVTAL    EQU   IEDQAVTD+532                                             02035000
AVTOLTST EQU   AVTHG02                                                  02036000
AVTE8    EQU   IEDQAVTD+524                                             02037000
AVTUI    EQU   IEDQAVTD+520                                             02038000
AVTCOMPT EQU   IEDQAVTD+516                                             02039000
AVTCRSRF EQU   IEDQAVTD+512                                             02040000
@NM00015 EQU   IEDQAVTD+508                                             02041000
AVTKA02  EQU   IEDQAVTD+504                                             02042000
AVTOPTPT EQU   IEDQAVTD+500                                             02043000
AVTPCBPT EQU   IEDQAVTD+496                                             02044000
@NM00014 EQU   AVTECB1                                                  02045000
AVTCOMP  EQU   AVTECB1                                                  02046000
@NM00013 EQU   AVTECB1                                                  02047000
AVTOPECA EQU   IEDQAVTD+488                                             02048000
AVTOLECA EQU   IEDQAVTD+484                                             02049000
AVTCKECA EQU   IEDQAVTD+480                                             02050000
AVTCWECA EQU   IEDQAVTD+476                                             02051000
AVTCWTCB EQU   IEDQAVTD+472                                             02052000
AVTOLTCB EQU   IEDQAVTD+468                                             02053000
AVTOCTCB EQU   IEDQAVTD+464                                             02054000
AVTCKTCB EQU   IEDQAVTD+460                                             02055000
AVTAS    EQU   IEDQAVTD+456                                             02056000
AVTNOLBF EQU   IEDQAVTD+454                                             02057000
AVTNCKPR EQU   IEDQAVTD+453                                             02058000
AVTCIB   EQU   IEDQAVTD+452                                             02059000
AVTSPLPT EQU   IEDQAVTD+448                                             02060000
AVTMVBFR EQU   IEDQAVTD+444                                             02061000
AVTSBTA  EQU   IEDQAVTD+440                                             02062000
AVTRARTN EQU   IEDQAVTD+436                                             02063000
AVTBSCAN EQU   IEDQAVTD+432                                             02064000
AVTRDYA  EQU   IEDQAVTD+428                                             02065000
AVTRNMPT EQU   IEDQAVTD+424                                             02066000
AVTDISTR EQU   IEDQAVTD+420                                             02067000
AVTPARM3 EQU   IEDQAVTD+416                                             02068000
@NM00012 EQU   AVTPKF                                                   02069000
@NM00011 EQU   AVTPKF                                                   02070000
@NM00010 EQU   AVTPKF                                                   02071000
AVTFTCHF EQU   AVTPKF                                                   02072000
@NM00009 EQU   AVTPKF                                                   02073000
@NM00008 EQU   AVTPKF                                                   02074000
@NM00007 EQU   AVTPKF                                                   02075000
@NM00006 EQU   AVTPKF                                                   02076000
AVTPARM  EQU   IEDQAVTD+408                                             02077000
AVTEXS2A EQU   IEDQAVTD+402                                             02078000
AVTEXA2S EQU   IEDQAVTD+396                                             02079000
AVTOCGET EQU   IEDQAVTD+392                                             02080000
AVTCKAVT EQU   @NM00004+1                                               02081000
@NM00005 EQU   AVTCKFLG                                                 02082000
AVTCKHLT EQU   AVTCKFLG                                                 02083000
AVTCKREQ EQU   AVTCKFLG                                                 02084000
AVTCKENV EQU   AVTCKFLG                                                 02085000
AVTCKNAC EQU   AVTCKFLG                                                 02086000
AVTCKTAC EQU   AVTCKFLG                                                 02087000
AVTBUENT EQU   IEDQAVTD+386                                             02088000
@NM00003 EQU   IEDQAVTD+385                                             02089000
AVTFULLT EQU   AVTBUFSW                                                 02090000
AVTUNCON EQU   AVTBUFSW                                                 02091000
@NM00002 EQU   AVTBUFSW                                                 02092000
AVTBUFTR EQU   AVTREADD                                                 02093000
AVTREADY EQU   IEDQAVTD+376                                             02094000
AVTRACE  EQU   IEDQAVTD+372                                             02095000
AVTTCB   EQU   IEDQAVTD+368                                             02096000
AVTPASWD EQU   IEDQAVTD+360                                             02097000
AVTCTLCH EQU   IEDQAVTD+352                                             02098000
AVTDOUBL EQU   IEDQAVTD+344                                             02099000
AVTDOUBX EQU   IEDQAVTD+336                                             02100000
AVTDPARM EQU   IEDQAVTD+332                                             02101000
AVTCSTCS EQU   IEDQAVTD+328                                             02102000
AVTDLQ   EQU   AVTSAVEX+32                                              02103000
@NM00001 EQU   AVTSAVEX                                                 02104000
AVTSAVE4 EQU   IEDQAVTD+216                                             02105000
AVTSAVE3 EQU   IEDQAVTD+144                                             02106000
AVTSAVE2 EQU   IEDQAVTD+72                                              02107000
AVTSAVE1 EQU   IEDQAVTD                                                 02108000
*                                      END UNREFERENCED COMPONENTS      02109000
@EL01    EQU   @EL00001                                                 02110000
@ENDDATA EQU   *                                                        02111000
@DATEND  EQU   *                                                        02112000
         END   IGG0203B,(C'PLS2111',0701,78117)                         02113000
