         TITLE 'IGG019R5, LOCAL ATTENTION HANDLER                      *00001000
                        '                                               00002000
IGG019R5 CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
         USING *,RBASE                                                  00005000
         SAVE  (14,12)             SAVE REGS FORM IOS                   00006000
         LR    RBASE,R15           SET UP BASE                          00007000
IGG019R5 IEDHJN START,HJN                                               00008000
*                                                                  0291 00009000
*/********************************************************************/ 00010000
*/*                                                                  */ 00011000
*/*     M A I N     R O U T I N E                                    */ 00012000
*/*                                                                  */ 00013000
*/********************************************************************/ 00014000
*                                                                  0291 00015000
*   R13SAVE=R13;                    /* SAVE SAVE AREA ADDRESS        */ 00016000
         ST    R13,R13SAVE                                         0291 00017000
*   TCXPTR=16->PTR31->CVTAQAVT;     /* GET ADDRESS OF TCX            */ 00018000
         LA    @08,16                                              0292 00019000
         L     @08,PTR31(,@08)                                     0292 00020000
         L     @08,CVTAQAVT(,@08)                                  0292 00021000
         ST    @08,TCXPTR                                          0292 00022000
*   IEDQAPTR=TCXAVT;                /* AVT ADDRESS                   */ 00023000
         L     @08,TCXAVT(,@08)                                    0293 00024000
         ST    @08,IEDQAPTR                                        0293 00025000
*   IOSBPTR=R1;                     /* IOS PASSED ADDRESS IOSB IN REG   00026000
*                                      1                             */ 00027000
         LR    IOSBPTR,R1                                          0294 00028000
*   TCBPTR=AVTTCB;                  /* TCB ADDRESS                   */ 00029000
         L     TCBPTR,AVTTCB(,@08)                                 0295 00030000
*/*                                                                  */ 00031000
*                                                                  0296 00032000
*   CALL GETUCB;                    /* GO LOCATE THE DEVICE THIS   0296 00033000
*                                      INTERRUPT IS FOR              */ 00034000
         BAL   @14,GETUCB                                          0296 00035000
*/*                                                                  */ 00036000
*                                                                  0297 00037000
*   IF UCBFOUND=ON THEN             /* CORRECT DEVICE FOUND          */ 00038000
         TM    UCBFOUND,B'10000000'                                0297 00039000
         BNO   @RF00297                                            0297 00040000
*     DO;                           /* YES                           */ 00041000
*       DCBPTR=DEBDCBAD;            /* DCB BASE                      */ 00042000
         L     DCBPTR,DEBDCBAD-1(,IEDQDPTR)                        0299 00043000
         LA    DCBPTR,0(,DCBPTR)                                   0299 00044000
*       RIOB=DCBIOBAD+(RLN*DCBEIOBX);/* CALCULATE RELATIVE IOB     0300 00045000
*                                      ADDRESS                       */ 00046000
         SLR   RIOB,RIOB                                           0300 00047000
         IC    RIOB,DCBEIOBX+32(,DCBPTR)                           0300 00048000
         SLR   @06,@06                                             0300 00049000
         IC    @06,RLN                                             0300 00050000
         MR    @08,@06                                             0300 00051000
         AL    RIOB,DCBIOBAD+20(,DCBPTR)                           0300 00052000
*       IF AVTIOT^=0 THEN           /* TRACE ROUTINE PRESENT         */ 00053000
         L     @08,IEDQAPTR                                        0301 00054000
         L     @08,AVTIOT(,@08)                                    0301 00055000
         LTR   @08,@08                                             0301 00056000
         BZ    @RF00301                                            0301 00057000
*         DO;                       /* YES                           */ 00058000
*           R1=0;                   /* ZERO REG 1 TO INDICATE TO   0303 00059000
*                                      TRACE THAT THIS ENTRY IS FROM    00060000
*                                      ATTENTION EXIT. NOTE: AT THIS    00061000
*                                      POINT REG 7 MUST HAVE UCB   0303 00062000
*                                      ADDRESS AND REG 9 IOB ADDRESS */ 00063000
         SLR   R1,R1                                               0303 00064000
*           CALL IGG019Q0;          /* GO TRACE THIS INTERRUPT       */ 00065000
         LR    @15,@08                                             0304 00066000
         BALR  @14,@15                                             0304 00067000
*         END;                                                     0305 00068000
*       RLCB=RIOB-(ADDR(LCBFLAG1)-ADDR(IEDQLCB));/* BACK UP FROM IOB    00069000
*                                      TO LCB                        */ 00070000
@RF00301 LR    @08,RIOB                                            0306 00071000
         SL    @08,@CF00043                                        0306 00072000
         LR    RLCB,@08                                            0306 00073000
*       IF DCBDSGTR=ON THEN         /* 3705 DCB                      */ 00074000
         TM    DCBDSGTR+20(DCBPTR),B'00000100'                     0307 00075000
         BNO   @RF00307                                            0307 00076000
*         CALL PROC3705;            /* PROCESS INTERRUPT FOR 3705    */ 00077000
         BAL   @14,PROC3705                                        0308 00078000
*       ELSE                        /* NOT 3705                      */ 00079000
*         CALL NOT3705;             /* PROCESS INTERRUPT FOR OTHER 0309 00080000
*                                      LOCAL DEVICES                 */ 00081000
         B     @RC00307                                            0309 00082000
@RF00307 BAL   @14,NOT3705                                         0309 00083000
*     END;                                                         0310 00084000
*                                                                  0310 00085000
@RC00307 DS    0H                                                  0311 00086000
*/*                                                                  */ 00087000
*                                                                  0311 00088000
*   R13=R13SAVE;                    /* RESTORE SAVE AREA ADDRESS     */ 00089000
@RF00297 L     R13,R13SAVE                                         0311 00090000
*   GEN(RETURN (14,12));            /* RESTORE REGS AND RETURN       */ 00091000
         RETURN (14,12)                                                 00092000
*/********************************************************************/ 00093000
*/*  E N D   O F   M A I N   R O U T I N E                           */ 00094000
*/********************************************************************/ 00095000
*                                                                  0313 00096000
*                                                                  0313 00097000
*/********************************************************************/ 00098000
*/*                                                                  */ 00099000
*/* THIS ROUTINE SETS THE TEST AND SET SWITCH, PUTS ATTENTION        */ 00100000
*/* ELEMENT ON ASYNCHRONOUS READY QUEUE, AND POST TCAM'S ECB IF      */ 00101000
*/* NECESSARY. LOCAL FIELD ATTNELEM CONTAINS ADDRESS OF THE          */ 00102000
*/* ATTEMTION ELEMENT TO BE PROCESSED.                               */ 00103000
*/*                                                                  */ 00104000
*/********************************************************************/ 00105000
*                                                                  0313 00106000
*   RFY                                                            0313 00107000
*    (R10,                                                         0313 00108000
*     R11) RSTD;                                                   0313 00109000
*ATTNPOST:                                                         0314 00110000
*   PROC OPTIONS(RETREG,SAVE(14));                                 0314 00111000
@EL00001 DS    0H                                                  0314 00112000
@EF00001 DS    0H                                                  0314 00113000
@ER00001 BR    @14                                                 0314 00114000
ATTNPOST ST    @14,@SA00002                                        0314 00115000
*   GEN REFS(LCBTSTSW,R1,R15);                                     0315 00116000
         L     R1,LCBTSTSW(RLCB)   PRIME FOR COMPARE AND SWAP           00117000
LOOP1    EQU *                                                          00118000
         LR    R15,R1              USE COMPARE AND SWAP ...             00119000
         O     R15,MASK1           TO SET TEST AND SET ...              00120000
         CS    R1,R15,LCBTSTSW(RLCB) SWITCH IN THE LOCAL'S...           00121000
         BNE   LOOP1               LCB                                  00122000
*   R1=ATTNELEM;                    /* ADDRESS OF ATTENTION        0316 00123000
*                                      ELEMENT(PASSED BY CALLER)     */ 00124000
         L     R1,ATTNELEM                                         0316 00125000
*   R1->RECBQCBA=ADDR(AVT2260L)-8;  /* RECEIVE SCHED ADDR IN QCB     */ 00126000
         L     @08,IEDQAPTR                                        0317 00127000
         LA    @08,AVT2260L(,@08)                                  0317 00128000
         SL    @08,@CF00045                                        0317 00129000
         STCM  @08,7,RECBQCBA(R1)                                  0317 00130000
*   R15=TCXREADY;                   /* ADDRESS OF 1ST ELEMENT ON   0318 00131000
*                                      ASYNC. READY Q                */ 00132000
         L     @08,TCXPTR                                          0318 00133000
         L     R15,TCXREADY(,@08)                                  0318 00134000
*NEWCURR:                                                          0319 00135000
*   ;                                                              0319 00136000
NEWCURR  DS    0H                                                  0320 00137000
*   R1->RECBLINK=R15;               /* LINK ATTN ELEM TO TOP OF READY   00138000
*                                      Q                             */ 00139000
         STCM  R15,7,RECBLINK(R1)                                  0320 00140000
*   CS(R15,R1,TCXREADY);            /* UPDATE READY Q                */ 00141000
         L     @08,TCXPTR                                          0321 00142000
         CS    R15,@01,TCXREADY(@08)                               0321 00143000
*   BC(7,NEWCURR);                  /* IF Q WAS UPDATED            0322 00144000
*                                      ASYNCHRONOUSLY TRY AGAIN      */ 00145000
         BC    7,NEWCURR                                           0322 00146000
*/*                                                                  */ 00147000
*                                                                  0323 00148000
*   R0=RBASE;                       /* SAVE BASE REG                 */ 00149000
         LR    R0,RBASE                                            0323 00150000
*   R11=ADDR(AVTOSECB);             /* TCM'S ECB ADDRESS             */ 00151000
         L     @08,IEDQAPTR                                        0324 00152000
         LA    R11,AVTOSECB(,@08)                                  0324 00153000
*   R10=0;                          /* PASS ZERO COMPLETION CODE TO     00154000
*                                      POST RTN                      */ 00155000
         SLR   R10,R10                                             0325 00156000
*   R15=16->PTR31->CVT0PT01;        /* ADDRESS OF POST RTN           */ 00157000
         LA    @06,16                                              0326 00158000
         L     @06,PTR31(,@06)                                     0326 00159000
         L     R15,CVT0PT01(,@06)                                  0326 00160000
*   RBASE=AVTTCB;                   /* TCB ADDRESS                   */ 00161000
         L     RBASE,AVTTCB(,@08)                                  0327 00162000
*   GEN(BALR  R14,R15);             /* POST TCAM'S ECB COMPLETE      */ 00163000
         BALR  R14,R15                                                  00164000
*   RBASE=R0;                       /* RESTORE BASE REG              */ 00165000
         LR    RBASE,R0                                            0329 00166000
*   RETURN;                         /* RETURN TO CALLER              */ 00167000
@EL00002 DS    0H                                                  0330 00168000
@EF00002 DS    0H                                                  0330 00169000
@ER00002 L     @14,@SA00002                                        0330 00170000
         BR    @14                                                 0330 00171000
*   END ATTNPOST;                                                  0331 00172000
*   RFY                                                            0332 00173000
*    (R10,                                                         0332 00174000
*     R11) UNRSTD;                                                 0332 00175000
*                                                                  0333 00176000
*/********************************************************************/ 00177000
*/*                                                                  */ 00178000
*/* THIS ROUTINE LOCATES THE DEVICE ON WHICH THE INTERRUPT OCCURRED. */ 00179000
*/*                                                                  */ 00180000
*/********************************************************************/ 00181000
*                                                                  0333 00182000
*GETUCB:                                                           0333 00183000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0333 00184000
GETUCB   DS    0H                                                  0334 00185000
*   RUCB=IOSUCB;                    /* GET UCB ADDRESS FOR THE DEVICE   00186000
*                                      ON WHICH THIS INTERRUPT     0334 00187000
*                                      OCCURED                       */ 00188000
         L     RUCB,IOSUCB(,IOSBPTR)                               0334 00189000
*   GEN(LA   RUCB,0(RUCB));         /* CLEAR HIGH ORDER BYTE         */ 00190000
         LA   RUCB,0(RUCB)                                              00191000
*   RDEB=TCBDEB;                    /* DEB ADDR              @OZ27364*/ 00192000
         L     RDEB,TCBDEB(,TCBPTR)                                0336 00193000
*   GEN(LA   RDEB,0(RDEB));         /* CLEAR HIGH ORDER BYTE         */ 00194000
         LA   RDEB,0(RDEB)                                              00195000
*DEBLOOP:                                                          0338 00196000
*   IF RDEB^=0 THEN                 /* IS THERE A DEB                */ 00197000
DEBLOOP  LTR   RDEB,RDEB                                           0338 00198000
         BZ    @RF00338                                            0338 00199000
*     DO;                           /* YES                           */ 00200000
*       RDEB=RDEB-(ADDR(DEBNMSUB)-ADDR(IEDQDEB));/* BACK UP  @OZ27364*/ 00201000
         SL    RDEB,@CF01513                                       0340 00202000
*       UCBINDEX=ADDR(DEBUCBAD);    /* GET ADDR OF 1ST UCB ADDRESS   */ 00203000
         LA    UCBINDEX,DEBUCBAD(,IEDQDPTR)                        0341 00204000
*       RLN=0;                      /* INIT RELATIVE LINE NUMBER   0342 00205000
*                                      COUNTER TO 0                  */ 00206000
         MVI   RLN,X'00'                                           0342 00207000
*UCBLOOP:                                                          0343 00208000
*       IF RLN=DEBNMEXT THEN        /* HAVE WE SEARCHED ALL UCB    0343 00209000
*                                      ADDRESSES IN THIS DEB         */ 00210000
UCBLOOP  CLC   RLN(1),DEBNMEXT(IEDQDPTR)                           0343 00211000
         BNE   @RF00343                                            0343 00212000
*         DO;                       /* YES                           */ 00213000
*           RDEB=DEBDEBAD;          /* NEXT DEB              @OZ27364*/ 00214000
         L     @11,DEBDEBAD-1(,IEDQDPTR)                           0345 00215000
         LA    @11,0(,@11)                                         0345 00216000
         LR    RDEB,@11                                            0345 00217000
*           GOTO DEBLOOP;           /* LOOK FOR UCB ADDRESS IN NEXT     00218000
*                                      DEB                           */ 00219000
         B     DEBLOOP                                             0346 00220000
*         END;                                                     0347 00221000
*       ELSE                                                       0348 00222000
*         DO;                                                      0348 00223000
@RF00343 DS    0H                                                  0349 00224000
*           RLN=RLN+1;              /* INCREMENT REL LINE NUMBER   0349 00225000
*                                      COUNT                         */ 00226000
         IC    @08,RLN                                             0349 00227000
         LA    @08,1(,@08)                                         0349 00228000
         STC   @08,RLN                                             0349 00229000
*           IF UCBINDEX->PTR24=RUCB THEN/* IS THIS THE UCB ADDRESS 0350 00230000
*                                      WE'VE BEEN LOOKING FOR        */ 00231000
         LR    @08,UCBINDEX                                        0350 00232000
         BCTR  @08,0                                               0350 00233000
         L     @08,PTR24(,@08)                                     0350 00234000
         LA    @08,0(,@08)                                         0350 00235000
         CR    RUCB,@08                                            0350 00236000
         BNE   @RF00350                                            0350 00237000
*             DO;                   /* YES                           */ 00238000
*               UCBFOUND=ON;        /* SET FOUND INDICATOR           */ 00239000
         OI    UCBFOUND,B'10000000'                                0352 00240000
*               RETURN;             /* RETURN TO CALLER              */ 00241000
@EL00003 DS    0H                                                  0353 00242000
@EF00003 DS    0H                                                  0353 00243000
@ER00003 BR    @14                                                 0353 00244000
*             END;                                                 0354 00245000
*           ELSE                    /* UCB ADDRESS NOT FOUND YET     */ 00246000
*             DO;                                                  0355 00247000
@RF00350 DS    0H                                                  0356 00248000
*               UCBINDEX=UCBINDEX+4;/* INCREMENT TO NEXT UCB ADDRESS */ 00249000
         AL    UCBINDEX,@CF00250                                   0356 00250000
*               GOTO UCBLOOP;       /* CONTINUE SEARCH FOR UCB     0357 00251000
*                                      ADDRESS                       */ 00252000
         B     UCBLOOP                                             0357 00253000
*             END;                                                 0358 00254000
*         END;                                                     0359 00255000
*     END;                                                         0360 00256000
*   ELSE                            /* DEB ADDRESS IS ZERO           */ 00257000
*     DO;                                                          0361 00258000
@RF00338 DS    0H                                                  0362 00259000
*       UCBFOUND=OFF;               /* INDICATE UCB ADDRESS NOT FOUND*/ 00260000
         NI    UCBFOUND,B'01111111'                                0362 00261000
*       RETURN;                     /* RETURN TO CALLER              */ 00262000
         B     @EL00003                                            0363 00263000
*     END;                                                         0364 00264000
*   END GETUCB;                                                    0365 00265000
*                                                                  0366 00266000
*/********************************************************************/ 00267000
*/*                                                                  */ 00268000
*/* THIS ROUTINE HANDLES INTERRUPTS FOR NON-3705 LOCAL DEVICES.      */ 00269000
*/*                                                                  */ 00270000
*/********************************************************************/ 00271000
*                                                                  0366 00272000
*NOT3705:                                                          0366 00273000
*   PROC OPTIONS(RETREG,SAVE(14));                                 0366 00274000
NOT3705  ST    @14,@SA00004                                        0366 00275000
*   IF IOSUSUC=OFF&                 /* NOT UNIT CHECK AND ...        */ 00276000
*       IOSUSAT=ON THEN             /* ...ATTENTION                  */ 00277000
         TM    IOSUSAT(IOSBPTR),B'10000000'                        0367 00278000
         BNO   @RF00367                                            0367 00279000
         TM    IOSUSUC(IOSBPTR),B'00000010'                        0367 00280000
         BNZ   @RF00367                                            0367 00281000
*     DO;                           /* YES                           */ 00282000
*       ATTNELEM=ADDR(LCBATTEL);    /* LOCAL(NON-3705) ATTENTION   0369 00283000
*                                      ELEMENT                       */ 00284000
         LA    @08,LCBATTEL(,IEDQLPTR)                             0369 00285000
         ST    @08,ATTNELEM                                        0369 00286000
*       IF ATTNELEM->RECBPRI=0 THEN /* ATTN ELEM POSTED              */ 00287000
         CLI   RECBPRI(@08),0                                      0370 00288000
         BNE   @RF00370                                            0370 00289000
*         DO;                       /* NO                            */ 00290000
*           ATTNELEM->RECBPRI=PRIATTN;/* LOCAL ATTEN PRIORITY        */ 00291000
         MVI   RECBPRI(@08),X'DC'                                  0372 00292000
*           CALL ATTNPOST;          /* POST ATTENTION ELEMENT        */ 00293000
         BAL   @14,ATTNPOST                                        0373 00294000
*         END;                                                     0374 00295000
*     END;                                                         0375 00296000
*   RETURN;                         /* RETURN TO CALLER              */ 00297000
@EL00004 DS    0H                                                  0376 00298000
@EF00004 DS    0H                                                  0376 00299000
@ER00004 L     @14,@SA00004                                        0376 00300000
         BR    @14                                                 0376 00301000
*   END NOT3705;                                                   0377 00302000
         B     @EL00004                                            0377 00303000
*                                                                  0378 00304000
*/********************************************************************/ 00305000
*/*                                                                  */ 00306000
*/* THIS ROUTINE PROCESSES INTERRUPTS FOR 3705.                      */ 00307000
*/*                                                                  */ 00308000
*/********************************************************************/ 00309000
*                                                                  0378 00310000
*PROC3705:                                                         0378 00311000
*   PROC OPTIONS(RETREG,SAVE(14));                                 0378 00312000
PROC3705 ST    @14,@SA00005                                        0378 00313000
*   IF R5IOSSTA=DEUC|               /* DEVICE END AND UNIT CHECK   0379 00314000
*                                      ON(MEANS THAT 3705 HAS FAILED    00315000
*                                      OR LOAD HAS BEEN DEPRESSED. 0379 00316000
*                                      THE SENSE WILL SAY IPL      0379 00317000
*                                      REQUIRED SO INTERRUPT IS    0379 00318000
*                                      TREATED LIKE ATTENTION. A READ   00319000
*                                      WILL BE ISSUED AND ERP WILL 0379 00320000
*                                      RECOVER)                      */ 00321000
*       IOSUSAT=ON THEN             /* ATTENTION INDICATOR           */ 00322000
         CLI   R5IOSSTA(IOSBPTR),X'06'                             0379 00323000
         BE    @RT00379                                            0379 00324000
         TM    IOSUSAT(IOSBPTR),B'10000000'                        0379 00325000
         BNO   @RF00379                                            0379 00326000
@RT00379 DS    0H                                                  0380 00327000
*     DO;                                                          0380 00328000
*       R1=LCBTTCIN;                /* TNT OFFSET OF 3705            */ 00329000
         LH    R1,LCBTTCIN(,IEDQLPTR)                              0381 00330000
         N     R1,@CF02962                                         0381 00331000
*       CALL IEDQTNT;               /* GO GET 3705 TERM ENTRY        */ 00332000
         L     @08,IEDQAPTR                                        0382 00333000
         L     @15,AVTRNMPT(,@08)                                  0382 00334000
         BALR  @14,@15                                             0382 00335000
*       R1=R1-LENGTH(IEDNTRM);      /* BACK UP TP PREFIX             */ 00336000
         SL    R1,@CF02724                                         0383 00337000
*       IF R1->TRMIPLDM=OFF THEN    /* IPL/DUMP IN PROGRESS          */ 00338000
         TM    TRMIPLDM(R1),B'10000000'                            0384 00339000
         BNZ   @RF00384                                            0384 00340000
*         DO;                       /* NO                            */ 00341000
*           ATTNELEM=ADDR(LCBATL05);/* 3705 ATTENTION ELEMENT        */ 00342000
         LA    @08,LCBATL05(,IEDQLPTR)                             0386 00343000
         ST    @08,ATTNELEM                                        0386 00344000
*           IF LCBBFRAV=ON THEN     /* BUFFERS AVAILABLE FOR READ    */ 00345000
         TM    LCBBFRAV(IEDQLPTR),B'00000010'                      0387 00346000
         BNO   @RF00387                                            0387 00347000
*             DO;                   /* YES                           */ 00348000
*               IF ATTNELEM->RECBPRI^=0 THEN/* ATTN ELEM POSTED      */ 00349000
         CLI   RECBPRI(@08),0                                      0389 00350000
         BE    @RF00389                                            0389 00351000
*                 LCBATTN=ON;       /* YES, INDICATE ATTENTION     0390 00352000
*                                      INTERRUPT                     */ 00353000
         OI    LCBATTN(IEDQLPTR),B'00000100'                       0390 00354000
*               ELSE                /* ATTN ELEM NOT POSTED          */ 00355000
*                 DO;                                              0391 00356000
         B     @RC00389                                            0391 00357000
@RF00389 DS    0H                                                  0392 00358000
*                   TS(LCBTSTSW);   /* LCB AVAILABLE                 */ 00359000
         TS    LCBTSTSW(IEDQLPTR)                                  0392 00360000
*                   BC(8,STARTIO);  /* YES, BRANCH TO DO STARTIO     */ 00361000
         BC    8,STARTIO                                           0393 00362000
*                   LCBATTN=ON;     /* SET ATTENTION INDICATOR       */ 00363000
         OI    LCBATTN(IEDQLPTR),B'00000100'                       0394 00364000
*                   ATTNELEM->RECBPRI=PRIATN05;/* 3705 ATTENTION   0395 00365000
*                                      PRIORITY                      */ 00366000
         L     @08,ATTNELEM                                        0395 00367000
         MVI   RECBPRI(@08),X'DD'                                  0395 00368000
*                   CALL ATTNPOST;  /* POST ATTN ELEM                */ 00369000
         BAL   @14,ATTNPOST                                        0396 00370000
*                   RETURN;         /* RETURN TO CALLER              */ 00371000
@EL00005 DS    0H                                                  0397 00372000
@EF00005 DS    0H                                                  0397 00373000
@ER00005 L     @14,@SA00005                                        0397 00374000
         BR    @14                                                 0397 00375000
*STARTIO:                                                          0398 00376000
*                   ;                                              0398 00377000
STARTIO  DS    0H                                                  0399 00378000
*                   LCBSTART=ADDR(LCBCCW3);/* ADDR OF READ START     */ 00379000
         LA    @11,LCBCCW3(,IEDQLPTR)                              0399 00380000
         STCM  @11,7,LCBSTART(IEDQLPTR)                            0399 00381000
*                   R15=ADDR(LCBCCW4);/* TIC TO 1ST READ BUF         */ 00382000
         LA    R15,LCBCCW4(,IEDQLPTR)                              0400 00383000
*                   R15->CCWADDR=LCBRDBFR;/* PUT ADDR OF 1ST READ  0401 00384000
*                                      BUFFER IN TIC FIELD           */ 00385000
         MVC   CCWADDR(3,R15),LCBRDBFR(IEDQLPTR)                   0401 00386000
*                   GEN REFS(LCBRECOF,R1,R15);                     0402 00387000
         L     R1,LCBRECOF(RLCB)   PRIME FOR COMPARE AND SWAP           00388000
LOOP2    EQU   *                                                        00389000
         LR    R15,R1              GET MASK FOR RESET OF...             00390000
         N     R15,MASK2           LCBFREEN LCBBFRAV                    00391000
         O     R15,MASK3           SET LCBRECVN                         00392000
         CS    R1,R15,LCBRECOF(RLCB) TRY TO UPDATE STATE                00393000
         BNE   LOOP2               RETRY IF UNSUCCESSFUL                00394000
*                   IOSBPTR=LCBIOSB;/* USE TCAMS IOSB        @ZM46619*/ 00395000
         L     IOSBPTR,LCBIOSB-1(,IEDQLPTR)                        0403 00396000
         LA    IOSBPTR,0(,IOSBPTR)                                 0403 00397000
*                   IOSFLA=0;       /* CLEAR IOSB FLAG               */ 00398000
         MVI   IOSFLA(IOSBPTR),X'00'                               0404 00399000
*                   IOSVST=LCBSTART;/* START OF CHAN PROG            */ 00400000
         L     @11,LCBSTART-1(,IEDQLPTR)                           0405 00401000
         LA    @11,0(,@11)                                         0405 00402000
         ST    @11,IOSVST(,IOSBPTR)                                0405 00403000
*                   GEN(L    R15,IOSVST(IOSBPTR));/* REAL ADDR     0406 00404000
*                                                            @ZM46619*/ 00405000
         L    R15,IOSVST(IOSBPTR)                                       00406000
*                   GEN(LRA   R15,0(R15));/* ...CHANNEL PROGRAM      */ 00407000
         LRA   R15,0(R15)                                               00408000
*                   IOSRST=R15;                                    0408 00409000
         ST    R15,IOSRST(,IOSBPTR)                                0408 00410000
*                   R1=IOSBPTR;     /* IOSB PTR IN REG 1             */ 00411000
         LR    R1,IOSBPTR                                          0409 00412000
*                   CALL SIOAPNG;   /* TRANSLATE CHANNEL PROGRAM FROM   00413000
*                                      VIRTUAL TO REAL               */ 00414000
         L     @15,DEBSIOA(,IEDQDPTR)                              0410 00415000
         BALR  @14,@15                                             0410 00416000
*                   SRBSECT=''B;    /* CLEAR SRB                     */ 00417000
         L     @11,SRBPTR(,IOSBPTR)                                0411 00418000
         XC    SRBSECT(44,@11),SRBSECT(@11)                        0411 00419000
*                   SRBID='SRB ';   /* SET SRB ID                    */ 00420000
         MVC   SRBID(4,@11),@CC02958                               0412 00421000
*                   SRBPARM=IOSBPTR;/* IOSB PTR IN SRB               */ 00422000
         ST    IOSBPTR,SRBPARM(,@11)                               0413 00423000
*                   R1=SRBPTR;      /* SRB PTR IN REG 1 FOR STARTIO  */ 00424000
         LR    R1,@11                                              0414 00425000
*                   R13=RBASE;      /* SAVE BASE REG (REG 13 IS THE     00426000
*                                      ONLY REG NOT DESTROYED BY   0415 00427000
*                                      STARTIO                       */ 00428000
         LR    R13,RBASE                                           0415 00429000
*                   R3=16->CVTPTR;  /* CVT ADDRESS IN REG 3          */ 00430000
         LA    @08,16                                              0416 00431000
         L     R3,CVTPTR(,@08)                                     0416 00432000
*                   R15=R3->CVTIXAVL->IOCSTIO;/* ADDRESS OF STARTIO     00433000
*                                      ROUTINE IN IOS                */ 00434000
         L     @08,CVTIXAVL(,R3)                                   0417 00435000
         L     R15,IOCSTIO(,@08)                                   0417 00436000
*                   GEN(LNR   R0,R1);/* FOR STARTIO ENTRY            */ 00437000
         LNR   R0,R1                                                    00438000
*                   GEN(BALR  R14,R15);/* GO DO START I/O            */ 00439000
         BALR  R14,R15                                                  00440000
*                   RBASE=R13;      /* RESTORE BASE                  */ 00441000
         LR    RBASE,R13                                           0420 00442000
*                   RETURN;         /* RETURN TO CALLER              */ 00443000
         B     @EL00005                                            0421 00444000
*                 END;                                             0422 00445000
*             END;                                                 0423 00446000
*           ELSE                    /* BUFFERS NOT AVAILABLE FOR READ*/ 00447000
*             DO;                                                  0424 00448000
         B     @RC00387                                            0424 00449000
@RF00387 DS    0H                                                  0425 00450000
*               LCBATTN=ON;         /* SET ATTENTION INDICATOR       */ 00451000
         OI    LCBATTN(IEDQLPTR),B'00000100'                       0425 00452000
*               IF ATTNELEM->RECBPRI=0 THEN/* ATTN ELEM ALREADY    0426 00453000
*                                      POSTED                        */ 00454000
         L     @08,ATTNELEM                                        0426 00455000
         CLI   RECBPRI(@08),0                                      0426 00456000
         BNE   @RF00426                                            0426 00457000
*                 DO;               /* NO                            */ 00458000
*                   ATTNELEM->RECBPRI=PRIATN05;/* 3705 ATTN POST   0428 00459000
*                                      PRIORITY                      */ 00460000
         MVI   RECBPRI(@08),X'DD'                                  0428 00461000
*                   CALL ATTNPOST;  /* POST ATTN ELEM                */ 00462000
         BAL   @14,ATTNPOST                                        0429 00463000
*                 END;                                             0430 00464000
*             END;                                                 0431 00465000
*         END;                                                     0432 00466000
*     END;                                                         0433 00467000
*   RETURN;                         /* RETURN TO CALLER              */ 00468000
         B     @EL00005                                            0434 00469000
*   END PROC3705;                                                  0435 00470000
         B     @EL00005                                            0435 00471000
*   END IGG019R5                                                   0436 00472000
*                                                                  0436 00473000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00474000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00475000
*/*%INCLUDE SYSLIB  (TCCWD   )                                       */ 00476000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00477000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00478000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00479000
*/*%INCLUDE SYSLIB  (TDEBD   )                                       */ 00480000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */ 00481000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00482000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 00483000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00484000
*/*%INCLUDE SYSLIB  (TRECBD  )                                       */ 00485000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00486000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00487000
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */ 00488000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00489000
*                                                                  0436 00490000
*       ;                                                          0436 00491000
@DATA    DS    0H                                                       00492000
         DS    0F                                                       00493000
@SA00005 DS    1F                                                       00494000
@SA00004 DS    1F                                                       00495000
@SA00002 DS    1F                                                       00496000
         DS    0F                                                       00497000
@CF00250 DC    F'4'                                                     00498000
@CF00045 DC    F'8'                                                     00499000
@CF02724 DC    F'14'                                                    00500000
@CF00043 DC    F'32'                                                    00501000
@CF01513 DC    F'36'                                                    00502000
@CF02962 DC    XL4'0000FFFF'                                            00503000
         DS    0D                                                       00504000
IEDQAPTR DS    A                                                        00505000
TCXPTR   DS    A                                                        00506000
R13SAVE  DS    A                                                        00507000
ATTNELEM DS    A                                                        00508000
RLN      DS    FL1                                                      00509000
@CC02958 DC    C'SRB '                                                  00510000
SWITCH1  DS    BL1                                                      00511000
         ORG   SWITCH1                                                  00512000
UCBFOUND DS    BL1                                                      00513000
@NM00192 EQU   SWITCH1+0                                                00514000
         ORG   SWITCH1+1                                                00515000
IGG019R5 CSECT                                                          00516000
MASK1    DS    0F                  TEST AND SET MASK                    00517000
         DC    X'0F000000'                                              00518000
MASK2    DS    0F                                                       00519000
         DC    X'FFFFFBFD'         LCBFREEN AND LCBBFRAV OFF            00520000
MASK3    DS    0F                                                       00521000
         DC    X'00000200'         LCBRECVN ON                          00522000
IGG019R5 CSECT                                                          00523000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00524000
@01      EQU   01                                                       00525000
@02      EQU   02                                                       00526000
@03      EQU   03                                                       00527000
@04      EQU   04                                                       00528000
@05      EQU   05                                                       00529000
@06      EQU   06                                                       00530000
@07      EQU   07                                                       00531000
@08      EQU   08                                                       00532000
@09      EQU   09                                                       00533000
@10      EQU   10                                                       00534000
@11      EQU   11                                                       00535000
@12      EQU   12                                                       00536000
@13      EQU   13                                                       00537000
@14      EQU   14                                                       00538000
@15      EQU   15                                                       00539000
UCBINDEX EQU   @11                                                      00540000
TCBPTR   EQU   @11                                                      00541000
IOSBPTR  EQU   @10                                                      00542000
DCBPTR   EQU   @11                                                      00543000
IEDQDPTR EQU   @03                                                      00544000
IEDQLPTR EQU   @04                                                      00545000
LCBXPTR  EQU   @05                                                      00546000
R1       EQU   @01                                                      00547000
R0       EQU   @00                                                      00548000
R14      EQU   @14                                                      00549000
R15      EQU   @15                                                      00550000
R3       EQU   @03                                                      00551000
RDEB     EQU   @03                                                      00552000
RLCB     EQU   @04                                                      00553000
RUCB     EQU   @07                                                      00554000
RIOB     EQU   @09                                                      00555000
R10      EQU   @10                                                      00556000
R11      EQU   @11                                                      00557000
RBASE    EQU   @12                                                      00558000
R13      EQU   @13                                                      00559000
IEDQAVTD EQU   0                                                        00560000
AVTSAVEX EQU   IEDQAVTD+288                                             00561000
AVTTCB   EQU   IEDQAVTD+368                                             00562000
@NM00003 EQU   IEDQAVTD+388                                             00563000
AVTCKFLG EQU   @NM00003                                                 00564000
AVTBASE  EQU   IEDQAVTD+412                                             00565000
AVTPKF   EQU   AVTBASE                                                  00566000
AVTRNMPT EQU   IEDQAVTD+424                                             00567000
AVTOSECB EQU   IEDQAVTD+492                                             00568000
AVTECB1  EQU   AVTOSECB                                                 00569000
AVTHG02  EQU   IEDQAVTD+528                                             00570000
AVTDISP  EQU   IEDQAVTD+552                                             00571000
AVTHD    EQU   IEDQAVTD+556                                             00572000
AVTSCOPT EQU   AVTHD                                                    00573000
AVTSAVTP EQU   IEDQAVTD+612                                             00574000
AVTSAVTF EQU   AVTSAVTP                                                 00575000
AVTIOT   EQU   IEDQAVTD+640                                             00576000
AVTCKPEL EQU   IEDQAVTD+652                                             00577000
AVTCKRMV EQU   AVTCKPEL                                                 00578000
AVTCKELF EQU   IEDQAVTD+680                                             00579000
AVTCKBYT EQU   IEDQAVTD+691                                             00580000
AVTHG01  EQU   IEDQAVTD+692                                             00581000
AVTCKLNK EQU   IEDQAVTD+696                                             00582000
AVTCRELE EQU   IEDQAVTD+708                                             00583000
AVTCCELE EQU   AVTCRELE                                                 00584000
AVTCLRHI EQU   IEDQAVTD+716                                             00585000
AVTADBUF EQU   IEDQAVTD+720                                             00586000
AVT2260L EQU   IEDQAVTD+724                                             00587000
AVTSYSER EQU   IEDQAVTD+728                                             00588000
AVTBFRFG EQU   IEDQAVTD+784                                             00589000
AVTCKPQB EQU   IEDQAVTD+804                                             00590000
AVTCKPTB EQU   AVTCKPQB                                                 00591000
AVTCKPEC EQU   AVTCKPQB+4                                               00592000
AVTCKPCC EQU   AVTCKPEC                                                 00593000
AVTOPCQB EQU   IEDQAVTD+816                                             00594000
AVTOPCOB EQU   AVTOPCQB                                                 00595000
AVTOPCEC EQU   AVTOPCQB+4                                               00596000
AVTOPCCC EQU   AVTOPCEC                                                 00597000
AVTOLTQB EQU   IEDQAVTD+828                                             00598000
AVTCWFL1 EQU   IEDQAVTD+924                                             00599000
AVTCWFL2 EQU   IEDQAVTD+925                                             00600000
AVTSUBT  EQU   IEDQAVTD+948                                             00601000
AVTIOTR  EQU   IEDQAVTD+949                                             00602000
AVTBIT1  EQU   IEDQAVTD+1050                                            00603000
AVTBIT2  EQU   IEDQAVTD+1051                                            00604000
AVTBIT3  EQU   IEDQAVTD+1052                                            00605000
AVTBIT4  EQU   IEDQAVTD+1136                                            00606000
@NM00085 EQU   IEDQAVTD+1232                                            00607000
IEDNSVTD EQU   0                                                        00608000
SAVTDIAG EQU   IEDNSVTD                                                 00609000
SAVTDIAF EQU   SAVTDIAG                                                 00610000
SAVTLUSQ EQU   IEDNSVTD+88                                              00611000
SAVTTCPU EQU   IEDNSVTD+238                                             00612000
SAVTZELM EQU   IEDNSVTD+270                                             00613000
SAVTRDRV EQU   IEDNSVTD+284                                             00614000
SAVTCKQB EQU   IEDNSVTD+300                                             00615000
SAVTCKTB EQU   SAVTCKQB                                                 00616000
SAVTCKEC EQU   SAVTCKQB+4                                               00617000
SAVTCKCC EQU   SAVTCKEC                                                 00618000
IEDQCCW  EQU   0                                                        00619000
CCW      EQU   IEDQCCW                                                  00620000
CCWADDR  EQU   CCW+1                                                    00621000
CCWFLAGS EQU   CCW+4                                                    00622000
CVTMAP   EQU   0                                                        00623000
CVTDAR   EQU   CVTMAP+72                                                00624000
CVTFLGS1 EQU   CVTDAR                                                   00625000
CVTDCB   EQU   CVTMAP+116                                               00626000
CVTIXAVL EQU   CVTMAP+124                                               00627000
CVTIERLC EQU   CVTMAP+144                                               00628000
CVT0PT01 EQU   CVTMAP+152                                               00629000
CVTOPTA  EQU   CVTMAP+182                                               00630000
CVTOPTB  EQU   CVTMAP+183                                               00631000
CVTGTF   EQU   CVTMAP+236                                               00632000
CVTGTFST EQU   CVTGTF                                                   00633000
CVTGTFS  EQU   CVTGTFST                                                 00634000
CVTSTATE EQU   CVTGTFST                                                 00635000
CVTTMODE EQU   CVTGTFST                                                 00636000
CVTFORM  EQU   CVTGTFST                                                 00637000
CVTAQAVT EQU   CVTMAP+240                                               00638000
CVTTCMFG EQU   CVTAQAVT                                                 00639000
CVTVOLM2 EQU   CVTMAP+244                                               00640000
CVTTATA  EQU   CVTVOLM2                                                 00641000
CVTTSKS  EQU   CVTTATA                                                  00642000
CVTVOLF2 EQU   CVTTSKS                                                  00643000
CVTTAT   EQU   CVTTATA+1                                                00644000
CVTATER  EQU   CVTMAP+248                                               00645000
CVTEXT1  EQU   CVTMAP+252                                               00646000
CVTPURG  EQU   CVTMAP+260                                               00647000
CVTQMSG  EQU   CVTMAP+268                                               00648000
CVTDMSR  EQU   CVTMAP+272                                               00649000
CVTRSV37 EQU   CVTDMSR                                                  00650000
CVTDMSRF EQU   CVTRSV37                                                 00651000
CVTERPV  EQU   CVTMAP+316                                               00652000
CVTINTLA EQU   CVTMAP+320                                               00653000
CVTAPF   EQU   CVTMAP+324                                               00654000
CVTEXT2  EQU   CVTMAP+328                                               00655000
CVTHJES  EQU   CVTMAP+332                                               00656000
CVTPGSIA EQU   CVTMAP+348                                               00657000
CVTA1F1  EQU   CVTMAP+356                                               00658000
CVTSYSK  EQU   CVTMAP+357                                               00659000
CVTVOLM1 EQU   CVTMAP+380                                               00660000
CVTVOLF1 EQU   CVTVOLM1                                                 00661000
CVTATMCT EQU   CVTMAP+388                                               00662000
CVTPTR   EQU   0                                                        00663000
CVTXTNT1 EQU   0                                                        00664000
CVTXTNT2 EQU   0                                                        00665000
CVTDSSV  EQU   CVTXTNT2                                                 00666000
CVTFLGBT EQU   CVTXTNT2+5                                               00667000
CVTQID   EQU   CVTXTNT2+24                                              00668000
CVTSHS   EQU   CVTXTNT2+40                                              00669000
CVTRV400 EQU   CVTXTNT2+52                                              00670000
CVTRV409 EQU   CVTXTNT2+53                                              00671000
CVTATCVT EQU   CVTXTNT2+64                                              00672000
CVTRV429 EQU   CVTXTNT2+84                                              00673000
CVTRV438 EQU   CVTXTNT2+85                                              00674000
CVTRV457 EQU   CVTXTNT2+112                                             00675000
CVTRV466 EQU   CVTXTNT2+113                                             00676000
CVTFIX   EQU   0                                                        00677000
CVTRELNO EQU   CVTFIX+252                                               00678000
IHADCB   EQU   0                                                        00679000
IHADCS16 EQU   0                                                        00680000
DCBMHA   EQU   IHADCS16                                                 00681000
DCBBUFOU EQU   DCBMHA                                                   00682000
DCBBUFIN EQU   DCBBUFOU                                                 00683000
DCBPCI   EQU   IHADCS16+5                                               00684000
DCBDSORG EQU   IHADCS16+6                                               00685000
DCBDSRG1 EQU   DCBDSORG                                                 00686000
DCBDSRG2 EQU   DCBDSORG+1                                               00687000
DCBDSGTR EQU   DCBDSRG2                                                 00688000
IHADCS17 EQU   0                                                        00689000
DCBCLPS  EQU   IHADCS17                                                 00690000
DCBIOBAD EQU   IHADCS17+8                                               00691000
IHADCS18 EQU   0                                                        00692000
DCBTRANA EQU   IHADCS18                                                 00693000
IHADCS19 EQU   0                                                        00694000
DCBLCBAD EQU   IHADCS19                                                 00695000
DCBCPRI  EQU   DCBLCBAD                                                 00696000
DCBEXLST EQU   IHADCS19+4                                               00697000
DCBEIOBX EQU   DCBEXLST                                                 00698000
IHADCS24 EQU   0                                                        00699000
DCBOFLGS EQU   IHADCS24+8                                               00700000
DCBOFLWR EQU   DCBOFLGS                                                 00701000
DCBIFLG  EQU   IHADCS24+9                                               00702000
DCBIBPCT EQU   DCBIFLG                                                  00703000
DCBMACR  EQU   IHADCS24+10                                              00704000
DCBMACR1 EQU   DCBMACR                                                  00705000
DCBMRFE  EQU   DCBMACR1                                                 00706000
DCBMRGET EQU   DCBMRFE                                                  00707000
DCBMRAPG EQU   DCBMACR1                                                 00708000
DCBMRRD  EQU   DCBMRAPG                                                 00709000
DCBMRCI  EQU   DCBMACR1                                                 00710000
DCBMRMVG EQU   DCBMRCI                                                  00711000
DCBMRLCG EQU   DCBMACR1                                                 00712000
DCBMRABC EQU   DCBMACR1                                                 00713000
DCBMRPT1 EQU   DCBMRABC                                                 00714000
DCBMRSBG EQU   DCBMRPT1                                                 00715000
DCBMRCRL EQU   DCBMACR1                                                 00716000
DCBMRCHK EQU   DCBMRCRL                                                 00717000
DCBMRRDX EQU   DCBMRCHK                                                 00718000
DCBMRDMG EQU   DCBMACR1                                                 00719000
DCBMACR2 EQU   DCBMACR+1                                                00720000
DCBMRPUT EQU   DCBMACR2                                                 00721000
DCBMRWRT EQU   DCBMACR2                                                 00722000
DCBMRMVP EQU   DCBMACR2                                                 00723000
DCBMR5WD EQU   DCBMACR2                                                 00724000
DCBMRLDM EQU   DCBMR5WD                                                 00725000
DCBMRLCP EQU   DCBMRLDM                                                 00726000
DCBMR4WD EQU   DCBMACR2                                                 00727000
DCBMRPT2 EQU   DCBMR4WD                                                 00728000
DCBMRTMD EQU   DCBMRPT2                                                 00729000
DCBMR3WD EQU   DCBMACR2                                                 00730000
DCBMRCTL EQU   DCBMR3WD                                                 00731000
DCBMRSTK EQU   DCBMRCTL                                                 00732000
DCBMR1WD EQU   DCBMACR2                                                 00733000
DCBMRSWA EQU   DCBMR1WD                                                 00734000
DCBMRDMD EQU   DCBMRSWA                                                 00735000
IHADCS25 EQU   0                                                        00736000
DCBMACRF EQU   IHADCS25+2                                               00737000
DCBMACF1 EQU   DCBMACRF                                                 00738000
DCBMFFE  EQU   DCBMACF1                                                 00739000
DCBMFGET EQU   DCBMFFE                                                  00740000
DCBMFAPG EQU   DCBMACF1                                                 00741000
DCBMFRD  EQU   DCBMFAPG                                                 00742000
DCBMFCI  EQU   DCBMACF1                                                 00743000
DCBMFMVG EQU   DCBMFCI                                                  00744000
DCBMFLCG EQU   DCBMACF1                                                 00745000
DCBMFABC EQU   DCBMACF1                                                 00746000
DCBMFPT1 EQU   DCBMFABC                                                 00747000
DCBMFSBG EQU   DCBMFPT1                                                 00748000
DCBMFCRL EQU   DCBMACF1                                                 00749000
DCBMFCHK EQU   DCBMFCRL                                                 00750000
DCBMFDMG EQU   DCBMACF1                                                 00751000
DCBMACF2 EQU   DCBMACRF+1                                               00752000
DCBMFPUT EQU   DCBMACF2                                                 00753000
DCBMFWRT EQU   DCBMACF2                                                 00754000
DCBMFMVP EQU   DCBMACF2                                                 00755000
DCBMF5WD EQU   DCBMACF2                                                 00756000
DCBMFLDM EQU   DCBMF5WD                                                 00757000
DCBMFLCP EQU   DCBMFLDM                                                 00758000
DCBMF4WD EQU   DCBMACF2                                                 00759000
DCBMFPT2 EQU   DCBMF4WD                                                 00760000
DCBMFTMD EQU   DCBMFPT2                                                 00761000
DCBMF3WD EQU   DCBMACF2                                                 00762000
DCBMFCTL EQU   DCBMF3WD                                                 00763000
DCBMFSTK EQU   DCBMFCTL                                                 00764000
DCBMF1WD EQU   DCBMACF2                                                 00765000
DCBMFSWA EQU   DCBMF1WD                                                 00766000
DCBMFDMD EQU   DCBMFSWA                                                 00767000
DCBDEBAD EQU   IHADCS25+4                                               00768000
DCBIFLGS EQU   DCBDEBAD                                                 00769000
DCBIFPCT EQU   DCBIFLGS                                                 00770000
IHADCS43 EQU   0                                                        00771000
DCBSCTAB EQU   IHADCS43                                                 00772000
IHADCS2A EQU   0                                                        00773000
DCBRESER EQU   IHADCS2A                                                 00774000
DCBINVLI EQU   IHADCS2A+4                                               00775000
DCBINVCI EQU   DCBINVLI                                                 00776000
IEDQDEB  EQU   0                                                        00777000
DEBPRF   EQU   IEDQDEB                                                  00778000
DEBAPVT  EQU   DEBPRF                                                   00779000
DEBSIOA  EQU   DEBAPVT+4                                                00780000
DEBNMSUB EQU   IEDQDEB+36                                               00781000
DEBDEBAD EQU   IEDQDEB+41                                               00782000
DEBNMEXT EQU   IEDQDEB+52                                               00783000
DEBDCBAD EQU   IEDQDEB+61                                               00784000
DEBUCBS  EQU   IEDQDEB+68                                               00785000
IOCOM    EQU   0                                                        00786000
IOCSTIO  EQU   IOCOM+28                                                 00787000
IOCOMPTR EQU   0                                                        00788000
IOSB     EQU   0                                                        00789000
IOSFLA   EQU   IOSB                                                     00790000
IOSACHN  EQU   IOSFLA                                                   00791000
IOSFLB   EQU   IOSB+1                                                   00792000
IOSFLC   EQU   IOSB+2                                                   00793000
IOSDVALT EQU   IOSFLC                                                   00794000
IOSPKEY  EQU   IOSB+12                                                  00795000
IOSOPT   EQU   IOSB+14                                                  00796000
IOSOPT2  EQU   IOSB+15                                                  00797000
IOSUCB   EQU   IOSB+16                                                  00798000
@NM00130 EQU   IOSB+20                                                  00799000
IOSCSW   EQU   @NM00130+1                                               00800000
IOSTATUS EQU   IOSCSW+3                                                 00801000
IOSTSA   EQU   IOSTATUS                                                 00802000
IOSSRB   EQU   IOSB+28                                                  00803000
IOSIPIB  EQU   IOSB+44                                                  00804000
IOSRST   EQU   IOSB+72                                                  00805000
IOSVST   EQU   IOSB+76                                                  00806000
IOSPATH  EQU   IOSB+86                                                  00807000
IOSCHN   EQU   IOSPATH                                                  00808000
IOSCKEY  EQU   IOSB+89                                                  00809000
IOSEEKA  EQU   IOSB+100                                                 00810000
IOSCCHH  EQU   IOSEEKA+3                                                00811000
IOSSKHH  EQU   IOSCCHH+2                                                00812000
IEDQLCB  EQU   0                                                        00813000
LCBRCB   EQU   IEDQLCB                                                  00814000
LCBTSOB  EQU   IEDQLCB+19                                               00815000
LCBCHAIN EQU   IEDQLCB+20                                               00816000
LCBSCRNN EQU   LCBCHAIN                                                 00817000
LCBTETEN EQU   LCBCHAIN                                                 00818000
LCBINSRC EQU   IEDQLCB+21                                               00819000
LCBLKMDE EQU   LCBINSRC+2                                               00820000
LCBNTXT  EQU   IEDQLCB+24                                               00821000
LCBSTAT4 EQU   LCBNTXT                                                  00822000
LCBPHASE EQU   LCBSTAT4                                                 00823000
LCBSCBDA EQU   IEDQLCB+25                                               00824000
LCBMHA   EQU   IEDQLCB+29                                               00825000
LCBFLAG1 EQU   IEDQLCB+32                                               00826000
LCBIOBSN EQU   IEDQLCB+33                                               00827000
LCBSNS   EQU   LCBIOBSN+1                                               00828000
LCBSENS0 EQU   LCBSNS                                                   00829000
LCBLOSDT EQU   LCBSENS0                                                 00830000
LCBTMOUT EQU   LCBSENS0                                                 00831000
LCBFLAG3 EQU   LCBIOBSN+7                                               00832000
LCBCSW   EQU   LCBIOBSN+8                                               00833000
LCBCSWST EQU   LCBCSW+3                                                 00834000
LCBCSWUS EQU   LCBCSWST                                                 00835000
LCBCSWCS EQU   LCBCSWST+1                                               00836000
LCBSIOCC EQU   LCBIOBSN+15                                              00837000
LCBSTART EQU   LCBIOBSN+16                                              00838000
LCBDCBPT EQU   IEDQLCB+52                                               00839000
LCBRCQCB EQU   IEDQLCB+56                                               00840000
LCBRESTR EQU   LCBRCQCB                                                 00841000
LCBTHSQ  EQU   IEDQLCB+60                                               00842000
LCBINCAM EQU   LCBTHSQ                                                  00843000
LCBERRCT EQU   IEDQLCB+62                                               00844000
LCBLSPCI EQU   IEDQLCB+65                                               00845000
LCBRCBFR EQU   LCBLSPCI                                                 00846000
LCBRDBFR EQU   LCBRCBFR                                                 00847000
LCBRECOF EQU   IEDQLCB+68                                               00848000
LCBSTATE EQU   IEDQLCB+70                                               00849000
LCBSTAT1 EQU   LCBSTATE                                                 00850000
LCBSTAT2 EQU   LCBSTATE+1                                               00851000
LCBBEOTN EQU   LCBSTAT2                                                 00852000
LCBSYNC  EQU   LCBSTAT2                                                 00853000
LCBATTN  EQU   LCBSYNC                                                  00854000
LCBDIAL  EQU   LCBSTAT2                                                 00855000
LCBBFRAV EQU   LCBDIAL                                                  00856000
LCBTSTSW EQU   IEDQLCB+72                                               00857000
LCBERB   EQU   IEDQLCB+76                                               00858000
LCBERBST EQU   IEDQLCB+84                                               00859000
LCBDLNKN EQU   LCBERBST                                                 00860000
LCBERBCT EQU   IEDQLCB+88                                               00861000
LCBRBCT2 EQU   LCBERBCT+1                                               00862000
LCBTTCIN EQU   IEDQLCB+90                                               00863000
LCBMSGFM EQU   IEDQLCB+92                                               00864000
LCBOBRCH EQU   IEDQLCB+96                                               00865000
LCBINVPT EQU   LCBOBRCH+1                                               00866000
LCBBFRW  EQU   LCBINVPT                                                 00867000
LCBTPCD  EQU   IEDQLCB+100                                              00868000
LCBSTAT5 EQU   LCBTPCD                                                  00869000
LCBSTAT6 EQU   LCBTPCD+4                                                00870000
LCBRSPSV EQU   LCBTPCD+8                                                00871000
LCBSAVSN EQU   IEDQLCB+112                                              00872000
LCBERCCW EQU   IEDQLCB+120                                              00873000
LCBATL05 EQU   LCBERCCW+8                                               00874000
LCBCPA   EQU   IEDQLCB+144                                              00875000
LCBCCW3  EQU   LCBCPA+16                                                00876000
LCBCCW4  EQU   LCBCPA+24                                                00877000
LCBCCW5  EQU   LCBCPA+32                                                00878000
LCBATTEL EQU   LCBCCW5                                                  00879000
LCBQEBPL EQU   LCBATTEL                                                 00880000
LCBIOSB  EQU   LCBQEBPL+1                                               00881000
IEDQLCBX EQU   0                                                        00882000
LCBXCON  EQU   IEDQLCBX                                                 00883000
LCBXFLAG EQU   LCBXCON                                                  00884000
LCBXDCT  EQU   LCBXCON+1                                                00885000
LCBXRADR EQU   LCBXCON+4                                                00886000
IEDQRECB EQU   0                                                        00887000
RECBQCBA EQU   IEDQRECB+1                                               00888000
RECBPRI  EQU   IEDQRECB+4                                               00889000
RECBLINK EQU   IEDQRECB+5                                               00890000
SRBSECT  EQU   0                                                        00891000
SRB      EQU   SRBSECT                                                  00892000
SRBID    EQU   SRB                                                      00893000
SRBFLC   EQU   SRB+12                                                   00894000
SRBPARM  EQU   SRB+28                                                   00895000
TCBFIX   EQU   0                                                        00896000
TCBFRS   EQU   TCBFIX                                                   00897000
TCB      EQU   0                                                        00898000
TCBPIE   EQU   TCB+4                                                    00899000
TCBPMASK EQU   TCBPIE                                                   00900000
TCBDEB   EQU   TCB+8                                                    00901000
TCBCMP   EQU   TCB+16                                                   00902000
TCBCMPF  EQU   TCBCMP                                                   00903000
TCBCPP   EQU   TCBCMPF                                                  00904000
TCBSTCC  EQU   TCBCMPF                                                  00905000
TCBCDBL  EQU   TCBCMPF                                                  00906000
TCBCWTO  EQU   TCBCMPF                                                  00907000
TCBCIND  EQU   TCBCMPF                                                  00908000
TCBCMSG  EQU   TCBCMPF                                                  00909000
TCBTRN   EQU   TCB+20                                                   00910000
TCBABF   EQU   TCBTRN                                                   00911000
TCBMSS   EQU   TCB+24                                                   00912000
TCBPKF   EQU   TCB+28                                                   00913000
TCBFLGS  EQU   TCB+29                                                   00914000
TCBFLGS1 EQU   TCBFLGS                                                  00915000
TCBFLGS2 EQU   TCBFLGS+1                                                00916000
TCBFLGS3 EQU   TCBFLGS+2                                                00917000
TCBFLGS4 EQU   TCBFLGS+3                                                00918000
TCBFLGS5 EQU   TCBFLGS+4                                                00919000
TCBABWF  EQU   TCBFLGS5                                                 00920000
TCBJPQ   EQU   TCB+44                                                   00921000
TCBPURGE EQU   TCBJPQ                                                   00922000
TCBGRS   EQU   TCB+48                                                   00923000
TCBFSA   EQU   TCB+112                                                  00924000
TCBTME   EQU   TCB+120                                                  00925000
TCBJSTCB EQU   TCB+124                                                  00926000
TCBTSFLG EQU   TCB+148                                                  00927000
TCBTSTSK EQU   TCBTSFLG                                                 00928000
TCBSTAB  EQU   TCB+160                                                  00929000
TCBNSTAE EQU   TCBSTAB                                                  00930000
TCBTCT   EQU   TCB+164                                                  00931000
TCBTCTGF EQU   TCBTCT                                                   00932000
TCBSCNDY EQU   TCB+172                                                  00933000
TCBNDSP  EQU   TCBSCNDY                                                 00934000
TCBNDSP1 EQU   TCBNDSP+1                                                00935000
TCBNDSP2 EQU   TCBNDSP+2                                                00936000
TCBNDSP3 EQU   TCBNDSP+3                                                00937000
TCBJSCB  EQU   TCB+180                                                  00938000
TCBRECDE EQU   TCBJSCB                                                  00939000
TCBEXT1  EQU   TCB+196                                                  00940000
TCBBITS  EQU   TCB+200                                                  00941000
TCBNDSP4 EQU   TCBBITS                                                  00942000
TCBNDSP5 EQU   TCBBITS+1                                                00943000
TCBFLGS6 EQU   TCBBITS+2                                                00944000
TCBFLGS7 EQU   TCBBITS+3                                                00945000
TCBDAR   EQU   TCB+204                                                  00946000
TCBDARC  EQU   TCBDAR                                                   00947000
TCBEXT2  EQU   TCB+208                                                  00948000
TCBFOE   EQU   TCB+244                                                  00949000
TCBESTAE EQU   TCB+264                                                  00950000
TCBESTRM EQU   TCBESTAE+1                                               00951000
TCBFBYT1 EQU   TCB+276                                                  00952000
TCBFBYT2 EQU   TCB+277                                                  00953000
TCBRV124 EQU   TCB+278                                                  00954000
TCBRV133 EQU   TCB+279                                                  00955000
TCBXTNT2 EQU   0                                                        00956000
TCBGTF   EQU   TCBXTNT2                                                 00957000
TCBTFLG  EQU   TCBGTF                                                   00958000
TCBRV146 EQU   TCBXTNT2+28                                              00959000
TCBRV155 EQU   TCBXTNT2+29                                              00960000
TCBRV164 EQU   TCBXTNT2+30                                              00961000
TCBRV173 EQU   TCBXTNT2+31                                              00962000
IEDQTCXD EQU   0                                                        00963000
TCXAVT   EQU   IEDQTCXD                                                 00964000
TCXATTEN EQU   IEDQTCXD+4                                               00965000
TCXREADY EQU   IEDQTCXD+24                                              00966000
TCXFLAG1 EQU   IEDQTCXD+34                                              00967000
TCXBUFA  EQU   IEDQTCXD+80                                              00968000
TCXDSAVE EQU   IEDQTCXD+104                                             00969000
TCXQE8   EQU   IEDQTCXD+216                                             00970000
IEDTRM   EQU   0                                                        00971000
IEDNTRM  EQU   IEDTRM                                                   00972000
TRMBYTE4 EQU   IEDNTRM                                                  00973000
TRMBYTE3 EQU   IEDNTRM+1                                                00974000
TRMBYTE2 EQU   IEDNTRM+2                                                00975000
TRMINPG  EQU   TRMBYTE2                                                 00976000
TRMBYTE1 EQU   IEDNTRM+3                                                00977000
TRMSCPRQ EQU   TRMBYTE1                                                 00978000
TRMBYTE0 EQU   IEDNTRM+6                                                00979000
TRMSIBPT EQU   IEDNTRM+7                                                00980000
IEDQTRM  EQU   IEDTRM+14                                                00981000
TRMSTATE EQU   IEDQTRM                                                  00982000
TRMLOG   EQU   TRMSTATE                                                 00983000
TRMINSEQ EQU   IEDQTRM+4                                                00984000
TLISTCNT EQU   TRMINSEQ                                                 00985000
TRMOUTSQ EQU   IEDQTRM+6                                                00986000
TLISTEN  EQU   TRMOUTSQ                                                 00987000
TRMDSORG EQU   TLISTEN                                                  00988000
TRMALTD  EQU   IEDQTRM+8                                                00989000
TRMDEVFL EQU   IEDQTRM+10                                               00990000
TRMSTAT  EQU   IEDQTRM+12                                               00991000
RTRM     EQU   0                                                        00992000
IGG019Q0 EQU   0                                                        00993000
IEDQTNT  EQU   0                                                        00994000
SIOAPNG  EQU   0                                                        00995000
PTR31    EQU   0                                                        00996000
PTR24    EQU   0                                                        00997000
DEBSUBR  EQU   0                                                        00998000
CVTS01   EQU   CVTPGSIA                                                 00999000
CVTLPDIA EQU   CVTS01+12                                                01000000
CVTDIRST EQU   CVTLPDIA                                                 01001000
CVTSLIDA EQU   CVTS01+24                                                01002000
CVTCTLFG EQU   CVTS01+50                                                01003000
CVTRV210 EQU   CVTS01+424                                               01004000
CVTRV219 EQU   CVTS01+425                                               01005000
CVTRV228 EQU   CVTS01+426                                               01006000
CVTRV237 EQU   CVTS01+427                                               01007000
CVTMFRTR EQU   CVTS01+452                                               01008000
CVTRV262 EQU   CVTS01+468                                               01009000
CVTRV271 EQU   CVTS01+469                                               01010000
CVTRV280 EQU   CVTS01+470                                               01011000
CVTRV289 EQU   CVTS01+471                                               01012000
CVTGSDA  EQU   CVTS01+600                                               01013000
DEBUCB   EQU   DEBUCBS                                                  01014000
DEBDVMOD EQU   DEBUCB                                                   01015000
DEBUCBAD EQU   DEBUCB+1                                                 01016000
IOSATTSC EQU   IOSIPIB                                                  01017000
IOSWTOWA EQU   IOSIPIB                                                  01018000
IOSPCISC EQU   IOSIPIB                                                  01019000
LCBRSPIN EQU   LCBIOBSN                                                 01020000
LCBLUSNS EQU   LCBRSPIN+5                                               01021000
LCBSCPRS EQU   LCBRSPIN+9                                               01022000
LCBCSWU1 EQU   LCBSCPRS+2                                               01023000
LCBRSPFG EQU   LCBRSPIN+15                                              01024000
LCBCOREQ EQU   LCBTPCD                                                  01025000
@NM00164 EQU   LCBCPA+40                                                01026000
LCBQNX   EQU   LCBERCCW                                                 01027000
LCBQNXMN EQU   LCBQNX                                                   01028000
LCBCANCL EQU   LCBSAVSN                                                 01029000
LCBCANFG EQU   LCBCANCL                                                 01030000
SRBPTR   EQU   IOSSRB                                                   01031000
TRMPRE1  EQU   TRMBYTE4                                                 01032000
TRMNCP1  EQU   TRMBYTE4                                                 01033000
TRMPRE   EQU   TRMBYTE3                                                 01034000
TRMNCP   EQU   TRMBYTE3                                                 01035000
TRMIPLDM EQU   TRMNCP                                                   01036000
TRMPU    EQU   TRMBYTE3                                                 01037000
TRMLU    EQU   TRMBYTE3                                                 01038000
TRMLINK  EQU   TRMBYTE3                                                 01039000
R5IOSSTA EQU   IOSTSA                                                   01040000
IOSUSAT  EQU   R5IOSSTA                                                 01041000
IOSUSUC  EQU   R5IOSSTA                                                 01042000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01043000
IOSUSUE  EQU   R5IOSSTA                                                 01044000
IOSUSDE  EQU   R5IOSSTA                                                 01045000
IOSUSCE  EQU   R5IOSSTA                                                 01046000
IOSUSBSY EQU   R5IOSSTA                                                 01047000
IOSUSCUE EQU   R5IOSSTA                                                 01048000
IOSUSSM  EQU   R5IOSSTA                                                 01049000
@NM00191 EQU   TRMLINK                                                  01050000
TRMLSTAT EQU   TRMLINK                                                  01051000
TRMLINT  EQU   TRMLINK                                                  01052000
TRMEPMOD EQU   TRMLINK                                                  01053000
TRMLULOG EQU   TRMLU                                                    01054000
TRMINERR EQU   TRMLU                                                    01055000
TRMLUREQ EQU   TRMLU                                                    01056000
TRMSESRQ EQU   TRMLU                                                    01057000
TRMTDIFF EQU   TRMLU                                                    01058000
TRMLUTM  EQU   TRMLU                                                    01059000
TRMLUIT  EQU   TRMLU                                                    01060000
TRMAUTO  EQU   TRMLU                                                    01061000
TRMPCONT EQU   TRMPU                                                    01062000
@NM00190 EQU   TRMPU                                                    01063000
TRMNCONT EQU   TRMNCP                                                   01064000
TRMQUCKN EQU   TRMNCP                                                   01065000
TRMSLOWN EQU   TRMNCP                                                   01066000
TRMSYGEN EQU   TRMNCP                                                   01067000
TRMNCPCL EQU   TRMNCP                                                   01068000
TRMINOUT EQU   TRMPRE                                                   01069000
TRMRDOUT EQU   TRMPRE                                                   01070000
TRMNLOUT EQU   TRMPRE                                                   01071000
TRMWROUT EQU   TRMPRE                                                   01072000
TRMASNXI EQU   TRMPRE                                                   01073000
TRMSTMM  EQU   TRMPRE                                                   01074000
TRMCMODE EQU   TRMPRE                                                   01075000
TRMSTPND EQU   TRMPRE                                                   01076000
@NM00189 EQU   TRMNCP1                                                  01077000
TRMINOP  EQU   TRMNCP1                                                  01078000
TRMLYNCH EQU   TRMPRE1                                                  01079000
TRMSPOUT EQU   TRMPRE1                                                  01080000
TRMERLCK EQU   TRMPRE1                                                  01081000
TRMQNPL  EQU   TRMPRE1                                                  01082000
TRMSPACT EQU   TRMPRE1                                                  01083000
TRMOCNI  EQU   TRMPRE1                                                  01084000
TRMSESSN EQU   TRMPRE1                                                  01085000
TRMCONT  EQU   TRMPRE1                                                  01086000
@NM00172 EQU   LCBCANCL+3                                               01087000
LCBCANTH EQU   LCBCANCL+1                                               01088000
@NM00171 EQU   LCBCANFG                                                 01089000
LCBCANCD EQU   LCBCANFG                                                 01090000
@NM00170 EQU   LCBCANFG                                                 01091000
LCBCANEB EQU   LCBCANFG                                                 01092000
LCBCANXT EQU   LCBCANFG                                                 01093000
LCBUNADD EQU   LCBQNX+21                                                01094000
LCBUASZE EQU   LCBQNX+20                                                01095000
LCBDSTEA EQU   LCBQNX+16                                                01096000
@NM00169 EQU   LCBQNX+8                                                 01097000
LCBIOSBS EQU   LCBQNX+5                                                 01098000
@NM00168 EQU   LCBQNX+4                                                 01099000
LCBSTSAV EQU   LCBQNX+1                                                 01100000
@NM00167 EQU   LCBQNXMN                                                 01101000
LCBNX509 EQU   LCBQNXMN                                                 01102000
LCBNX162 EQU   LCBQNXMN                                                 01103000
LCBNX142 EQU   LCBQNXMN                                                 01104000
LCBNX064 EQU   LCBQNXMN                                                 01105000
@NM00166 EQU   @NM00164+4                                               01106000
LCBNCPPT EQU   @NM00164+1                                               01107000
@NM00165 EQU   @NM00164                                                 01108000
LCBWRSCH EQU   LCBCOREQ+8                                               01109000
LCBCQLNK EQU   LCBCOREQ+4                                               01110000
LCBCQELE EQU   LCBCOREQ                                                 01111000
LCBPAKCH EQU   LCBRSPIN+16                                              01112000
@NM00163 EQU   LCBRSPFG                                                 01113000
LCBRSRH  EQU   LCBRSPFG                                                 01114000
LCBEXPI  EQU   LCBRSPFG                                                 01115000
@NM00162 EQU   LCBRSPIN+12                                              01116000
LCBUSUE1 EQU   LCBCSWU1                                                 01117000
@NM00161 EQU   LCBCSWU1                                                 01118000
@NM00160 EQU   LCBSCPRS+1                                               01119000
LCBDFCMD EQU   LCBSCPRS                                                 01120000
LCBUSER  EQU   LCBLUSNS+2                                               01121000
LCBSMIN  EQU   LCBLUSNS+1                                               01122000
LCBSMAJ  EQU   LCBLUSNS                                                 01123000
LCBRHSV  EQU   LCBRSPIN+2                                               01124000
LCBSNS0  EQU   LCBRSPIN+1                                               01125000
@NM00159 EQU   LCBRSPIN                                                 01126000
IOSPCIWA EQU   IOSPCISC+44                                              01127000
IOSPCIRS EQU   IOSPCISC+8                                               01128000
@NM00135 EQU   IOSPCISC+4                                               01129000
@NM00134 EQU   IOSPCISC                                                 01130000
IOSWRNDR EQU   IOSWTOWA+4                                               01131000
IOSWTOPT EQU   IOSWTOWA+3                                               01132000
IOSWTOCP EQU   IOSWTOWA+2                                               01133000
IOSWTOCH EQU   IOSWTOWA                                                 01134000
IOSATTWA EQU   IOSATTSC+40                                              01135000
@NM00133 EQU   IOSATTSC+24                                              01136000
IOSATTSN EQU   IOSATTSC                                                 01137000
CVTRV628 EQU   CVTS01+728                                               01138000
CVTRV627 EQU   CVTS01+724                                               01139000
CVTRV626 EQU   CVTS01+720                                               01140000
CVTRV625 EQU   CVTS01+716                                               01141000
CVTRV624 EQU   CVTS01+712                                               01142000
CVTRV623 EQU   CVTS01+708                                               01143000
CVTRV622 EQU   CVTS01+704                                               01144000
CVTRV621 EQU   CVTS01+700                                               01145000
CVTRV620 EQU   CVTS01+696                                               01146000
CVTRV619 EQU   CVTS01+692                                               01147000
CVTRV618 EQU   CVTS01+688                                               01148000
CVTRV617 EQU   CVTS01+684                                               01149000
CVTRV616 EQU   CVTS01+680                                               01150000
CVTRV615 EQU   CVTS01+676                                               01151000
CVTRV614 EQU   CVTS01+672                                               01152000
CVTRV613 EQU   CVTS01+668                                               01153000
CVTTCASP EQU   CVTS01+664                                               01154000
CVT0PT03 EQU   CVTS01+660                                               01155000
CVT0PT0E EQU   CVTS01+656                                               01156000
CVTIRM   EQU   CVTS01+652                                               01157000
CVTCGK   EQU   CVTS01+648                                               01158000
CVTRV607 EQU   CVTS01+644                                               01159000
CVTRV606 EQU   CVTS01+640                                               01160000
CVTRV605 EQU   CVTS01+636                                               01161000
CVTRV604 EQU   CVTS01+632                                               01162000
CVTEFF02 EQU   CVTS01+628                                               01163000
CVTCBBR  EQU   CVTS01+624                                               01164000
CVTSSCR  EQU   CVTS01+620                                               01165000
CVTEVENT EQU   CVTS01+616                                               01166000
CVTCRCA  EQU   CVTS01+612                                               01167000
CVTTPIO  EQU   CVTS01+608                                               01168000
CVTADV   EQU   CVTS01+604                                               01169000
CVTGSDAB EQU   CVTGSDA                                                  01170000
CVTQV3   EQU   CVTS01+596                                               01171000
CVTQV2   EQU   CVTS01+592                                               01172000
CVTQV1   EQU   CVTS01+588                                               01173000
CVTRPT   EQU   CVTS01+584                                               01174000
CVTSSRB  EQU   CVTS01+580                                               01175000
CVTCSDRL EQU   CVTS01+576                                               01176000
CVTEXP1  EQU   CVTS01+572                                               01177000
CVTRMPMT EQU   CVTS01+568                                               01178000
CVTRMPTT EQU   CVTS01+564                                               01179000
CVTVPSA  EQU   CVTS01+560                                               01180000
CVTVSTOP EQU   CVTS01+556                                               01181000
CVTGTFR8 EQU   CVTS01+552                                               01182000
CVTQUIT  EQU   CVTS01+548                                               01183000
CVTVACR  EQU   CVTS01+544                                               01184000
CVTWTCB  EQU   CVTS01+540                                               01185000
CVTSTPRS EQU   CVTS01+536                                               01186000
CVT0PT02 EQU   CVTS01+532                                               01187000
CVTDARCM EQU   CVTS01+528                                               01188000
CVTIRECM EQU   CVTS01+524                                               01189000
CVTJRECM EQU   CVTS01+520                                               01190000
CVTVEMS0 EQU   CVTS01+516                                               01191000
CVTSPFRR EQU   CVTS01+512                                               01192000
CVTRLSTG EQU   CVTS01+508                                               01193000
CVT0TC0A EQU   CVTS01+504                                               01194000
CVTGMBR  EQU   CVTS01+500                                               01195000
CVTLFRM  EQU   CVTS01+496                                               01196000
CVTRMBR  EQU   CVTS01+492                                               01197000
CVTVIOP  EQU   CVTS01+488                                               01198000
CVTRV307 EQU   CVTS01+486                                               01199000
CVTRV306 EQU   CVTS01+484                                               01200000
CVTRV305 EQU   CVTS01+482                                               01201000
CVTRV304 EQU   CVTS01+480                                               01202000
CVTRV303 EQU   CVTS01+478                                               01203000
CVTRV302 EQU   CVTS01+476                                               01204000
CVTTRCA  EQU   CVTS01+472                                               01205000
CVTRV297 EQU   CVTRV289                                                 01206000
CVTRV296 EQU   CVTRV289                                                 01207000
CVTRV295 EQU   CVTRV289                                                 01208000
CVTRV294 EQU   CVTRV289                                                 01209000
CVTRV293 EQU   CVTRV289                                                 01210000
CVTRV292 EQU   CVTRV289                                                 01211000
CVTRV291 EQU   CVTRV289                                                 01212000
CVTRV290 EQU   CVTRV289                                                 01213000
CVTRV288 EQU   CVTRV280                                                 01214000
CVTRV287 EQU   CVTRV280                                                 01215000
CVTRV286 EQU   CVTRV280                                                 01216000
CVTRV285 EQU   CVTRV280                                                 01217000
CVTRV284 EQU   CVTRV280                                                 01218000
CVTRV283 EQU   CVTRV280                                                 01219000
CVTRV282 EQU   CVTRV280                                                 01220000
CVTRV281 EQU   CVTRV280                                                 01221000
CVTRV279 EQU   CVTRV271                                                 01222000
CVTRV278 EQU   CVTRV271                                                 01223000
CVTRV277 EQU   CVTRV271                                                 01224000
CVTRV276 EQU   CVTRV271                                                 01225000
CVTRV275 EQU   CVTRV271                                                 01226000
CVTRV274 EQU   CVTRV271                                                 01227000
CVTRV273 EQU   CVTRV271                                                 01228000
CVTRV272 EQU   CVTRV271                                                 01229000
CVTRV270 EQU   CVTRV262                                                 01230000
CVTRV269 EQU   CVTRV262                                                 01231000
CVTRV268 EQU   CVTRV262                                                 01232000
CVTRV267 EQU   CVTRV262                                                 01233000
CVTRV266 EQU   CVTRV262                                                 01234000
CVTRV265 EQU   CVTRV262                                                 01235000
CVTRV264 EQU   CVTRV262                                                 01236000
CVTRV263 EQU   CVTRV262                                                 01237000
CVTVFP   EQU   CVTS01+464                                               01238000
CVTVSI   EQU   CVTS01+460                                               01239000
CVTVPSIB EQU   CVTS01+456                                               01240000
CVTMFACT EQU   CVTMFRTR                                                 01241000
CVTMFCTL EQU   CVTS01+448                                               01242000
CVTPVBP  EQU   CVTS01+444                                               01243000
CVTPWI   EQU   CVTS01+440                                               01244000
CVTRV254 EQU   CVTS01+438                                               01245000
CVTRV253 EQU   CVTS01+436                                               01246000
CVTRV252 EQU   CVTS01+434                                               01247000
CVTRV251 EQU   CVTS01+433                                               01248000
CVTRV250 EQU   CVTS01+432                                               01249000
CVTRV249 EQU   CVTS01+431                                               01250000
CVTRV248 EQU   CVTS01+430                                               01251000
CVTRV247 EQU   CVTS01+429                                               01252000
CVTRV246 EQU   CVTS01+428                                               01253000
CVTRV245 EQU   CVTRV237                                                 01254000
CVTRV244 EQU   CVTRV237                                                 01255000
CVTRV243 EQU   CVTRV237                                                 01256000
CVTRV242 EQU   CVTRV237                                                 01257000
CVTRV241 EQU   CVTRV237                                                 01258000
CVTRV240 EQU   CVTRV237                                                 01259000
CVTRV239 EQU   CVTRV237                                                 01260000
CVTRV238 EQU   CVTRV237                                                 01261000
CVTRV236 EQU   CVTRV228                                                 01262000
CVTRV235 EQU   CVTRV228                                                 01263000
CVTRV234 EQU   CVTRV228                                                 01264000
CVTRV233 EQU   CVTRV228                                                 01265000
CVTRV232 EQU   CVTRV228                                                 01266000
CVTRV231 EQU   CVTRV228                                                 01267000
CVTRV230 EQU   CVTRV228                                                 01268000
CVTRV229 EQU   CVTRV228                                                 01269000
CVTRV227 EQU   CVTRV219                                                 01270000
CVTRV226 EQU   CVTRV219                                                 01271000
CVTRV225 EQU   CVTRV219                                                 01272000
CVTRV224 EQU   CVTRV219                                                 01273000
CVTRV223 EQU   CVTRV219                                                 01274000
CVTRV222 EQU   CVTRV219                                                 01275000
CVTRV221 EQU   CVTRV219                                                 01276000
CVTRV220 EQU   CVTRV219                                                 01277000
CVTRV218 EQU   CVTRV210                                                 01278000
CVTRV217 EQU   CVTRV210                                                 01279000
CVTRV216 EQU   CVTRV210                                                 01280000
CVTRV215 EQU   CVTRV210                                                 01281000
CVTRV214 EQU   CVTRV210                                                 01282000
CVTRV213 EQU   CVTRV210                                                 01283000
CVTRV212 EQU   CVTRV210                                                 01284000
CVTRV211 EQU   CVTRV210                                                 01285000
CVTLCCAT EQU   CVTS01+420                                               01286000
CVTPCCAT EQU   CVTS01+416                                               01287000
CVTIPCRP EQU   CVTS01+412                                               01288000
CVTIPCRI EQU   CVTS01+408                                               01289000
CVTIPCDS EQU   CVTS01+404                                               01290000
CVTAIDVT EQU   CVTS01+400                                               01291000
CVTSSAP  EQU   CVTS01+396                                               01292000
CVTEHCIR EQU   CVTS01+392                                               01293000
CVTEHDEF EQU   CVTS01+388                                               01294000
CVTDAIR  EQU   CVTS01+384                                               01295000
CVTPERFM EQU   CVTS01+380                                               01296000
CVT044R2 EQU   CVTS01+376                                               01297000
CVTFETCH EQU   CVTS01+372                                               01298000
CVTRSTWD EQU   CVTS01+368                                               01299000
CVTSPOST EQU   CVTS01+364                                               01300000
CVTIOBP  EQU   CVTS01+360                                               01301000
CVTASMVT EQU   CVTS01+356                                               01302000
CVTRECRQ EQU   CVTS01+352                                               01303000
CVTWSAC  EQU   CVTS01+348                                               01304000
CVTRV149 EQU   CVTS01+344                                               01305000
CVTWSAL  EQU   CVTS01+340                                               01306000
CVTSPSA  EQU   CVTS01+336                                               01307000
CVTGLMN  EQU   CVTS01+332                                               01308000
CVTVEAC0 EQU   CVTS01+328                                               01309000
CVT062R1 EQU   CVTS01+324                                               01310000
CVTRPOST EQU   CVTS01+320                                               01311000
CVTDQIQE EQU   CVTS01+316                                               01312000
CVTCSD   EQU   CVTS01+312                                               01313000
CVTLKRMA EQU   CVTS01+308                                               01314000
CVTRSPIE EQU   CVTS01+304                                               01315000
CVTRENQ  EQU   CVTS01+300                                               01316000
CVTLQCB  EQU   CVTS01+296                                               01317000
CVTFQCB  EQU   CVTS01+292                                               01318000
CVTQCS01 EQU   CVTS01+288                                               01319000
CVTAPFT  EQU   CVTS01+284                                               01320000
CVTPARRL EQU   CVTS01+280                                               01321000
CVTVWAIT EQU   CVTS01+276                                               01322000
CVTGSPL  EQU   CVTS01+272                                               01323000
CVTLSMQ  EQU   CVTS01+268                                               01324000
CVTGSMQ  EQU   CVTS01+264                                               01325000
CVTEXPRO EQU   CVTS01+260                                               01326000
CVTOPCTP EQU   CVTS01+256                                               01327000
CVTSIC   EQU   CVTS01+252                                               01328000
CVTTPIOS EQU   CVTS01+248                                               01329000
CVTRTMS  EQU   CVTS01+244                                               01330000
CVTSDBF  EQU   CVTS01+240                                               01331000
CVTSCBP  EQU   CVTS01+236                                               01332000
CVTSDMP  EQU   CVTS01+232                                               01333000
CVTSV60  EQU   CVTS01+228                                               01334000
CVTRTMCT EQU   CVTS01+224                                               01335000
CVTASCBL EQU   CVTS01+220                                               01336000
CVTASCBH EQU   CVTS01+216                                               01337000
CVTGDA   EQU   CVTS01+212                                               01338000
CVTASVT  EQU   CVTS01+208                                               01339000
CVTVVMDI EQU   CVTS01+204                                               01340000
CVTAQTOP EQU   CVTS01+200                                               01341000
CVTIOSCS EQU   CVTS01+196                                               01342000
CVTSDRM  EQU   CVTS01+192                                               01343000
CVTOPTE  EQU   CVTS01+188                                               01344000
CVTSTXU  EQU   CVTS01+184                                               01345000
CVTQUIS  EQU   CVTS01+180                                               01346000
CVTPARS  EQU   CVTS01+176                                               01347000
CVTS1EE  EQU   CVTS01+172                                               01348000
CVTFRAS  EQU   CVTS01+168                                               01349000
CVTQSAS  EQU   CVTS01+164                                               01350000
CVTCRAS  EQU   CVTS01+160                                               01351000
CVTCRMN  EQU   CVTS01+156                                               01352000
CVTDELCP EQU   CVTS01+152                                               01353000
CVTFRECL EQU   CVTS01+148                                               01354000
CVTGETCL EQU   CVTS01+144                                               01355000
CVTBLDCP EQU   CVTS01+140                                               01356000
CVTAUTHL EQU   CVTS01+136                                               01357000
CVTSCAN  EQU   CVTS01+132                                               01358000
CVTRV144 EQU   CVTS01+130                                               01359000
CVTMAXMP EQU   CVTS01+128                                               01360000
CVTSTCK  EQU   CVTS01+124                                               01361000
CVTRV139 EQU   CVTS01+123                                               01362000
CVTDSSAC EQU   CVTS01+122                                               01363000
CVTRV513 EQU   CVTS01+121                                               01364000
CVTIOSPL EQU   CVTS01+120                                               01365000
CVTPTGT  EQU   CVTS01+116                                               01366000
CVTCSPIE EQU   CVTS01+112                                               01367000
CVTSMFEX EQU   CVTS01+108                                               01368000
CVTOLT0A EQU   CVTS01+104                                               01369000
CVTSRBRT EQU   CVTS01+100                                               01370000
CVTPUTL  EQU   CVTS01+96                                                01371000
CVTASCRL EQU   CVTS01+92                                                01372000
CVTASCRF EQU   CVTS01+88                                                01373000
CVTRV326 EQU   CVTS01+84                                                01374000
CVTRV325 EQU   CVTS01+80                                                01375000
CVTRV324 EQU   CVTS01+76                                                01376000
CVT0VL01 EQU   CVTS01+72                                                01377000
CVTSHRVM EQU   CVTS01+68                                                01378000
CVTRV332 EQU   CVTS01+64                                                01379000
CVTTAS   EQU   CVTS01+60                                                01380000
CVTRSCN  EQU   CVTS01+56                                                01381000
CVTTRAC2 EQU   CVTS01+54                                                01382000
CVTTRACE EQU   CVTS01+52                                                01383000
CVTAPG   EQU   CVTS01+51                                                01384000
CVTSDTRC EQU   CVTCTLFG                                                 01385000
CVTGTRCE EQU   CVTCTLFG                                                 01386000
CVTNOMP  EQU   CVTCTLFG                                                 01387000
CVTRSV79 EQU   CVTCTLFG                                                 01388000
CVTDSTAT EQU   CVTCTLFG                                                 01389000
CVTRSV78 EQU   CVTCTLFG                                                 01390000
CVTRV333 EQU   CVTCTLFG                                                 01391000
CVTRV323 EQU   CVTCTLFG                                                 01392000
CVTSPVLK EQU   CVTS01+49                                                01393000
CVTRSV77 EQU   CVTS01+48                                                01394000
CVTRV331 EQU   CVTS01+44                                                01395000
CVTRV330 EQU   CVTS01+40                                                01396000
CVTRV329 EQU   CVTS01+36                                                01397000
CVTRV328 EQU   CVTS01+32                                                01398000
CVTRV322 EQU   CVTS01+28                                                01399000
CVTSLID  EQU   CVTSLIDA+1                                               01400000
CVTSYLK  EQU   CVTSLIDA                                                 01401000
CVTRV321 EQU   CVTS01+20                                                01402000
CVTRV320 EQU   CVTS01+16                                                01403000
CVTLPDIR EQU   CVTLPDIA+1                                               01404000
CVTRSV69 EQU   CVTDIRST                                                 01405000
CVTRSV68 EQU   CVTDIRST                                                 01406000
CVTRSV67 EQU   CVTDIRST                                                 01407000
CVTRSV66 EQU   CVTDIRST                                                 01408000
CVTRSV65 EQU   CVTDIRST                                                 01409000
CVTRSV64 EQU   CVTDIRST                                                 01410000
CVTRSV63 EQU   CVTDIRST                                                 01411000
CVTDICOM EQU   CVTDIRST                                                 01412000
CVTPVTP  EQU   CVTS01+8                                                 01413000
CVTLPDSR EQU   CVTS01+4                                                 01414000
CVTGETL  EQU   CVTS01                                                   01415000
TRMOPT   EQU   IEDTRM+34                                                01416000
TRMOPTBL EQU   IEDQTRM+18                                               01417000
TRMOPNO  EQU   IEDQTRM+17                                               01418000
TRMCHCIN EQU   IEDQTRM+16                                               01419000
TRMSENSE EQU   TRMSTAT+3                                                01420000
TRMTEMPR EQU   TRMSTAT+2                                                01421000
TRMSIO   EQU   TRMSTAT                                                  01422000
@NM00188 EQU   TRMDEVFL+1                                               01423000
TRMTPIN  EQU   TRMDEVFL+1                                               01424000
TRMNCPI  EQU   TRMDEVFL+1                                               01425000
TRMRNTRM EQU   TRMDEVFL+1                                               01426000
@NM00187 EQU   TRMDEVFL+1                                               01427000
TRMLMD   EQU   TRMDEVFL+1                                               01428000
TRMCONC  EQU   TRMDEVFL+1                                               01429000
TRMTSOB  EQU   TRMDEVFL                                                 01430000
TRMBFDY  EQU   TRMDEVFL                                                 01431000
TRMTBLK  EQU   TRMDEVFL                                                 01432000
TRMSBLK  EQU   TRMDEVFL                                                 01433000
TRMBLKS  EQU   TRMDEVFL                                                 01434000
TRMADDC  EQU   TRMDEVFL                                                 01435000
TRMDDIG  EQU   TRMDEVFL                                                 01436000
TRMBUFS  EQU   TRMDEVFL                                                 01437000
TRMPRILK EQU   TRMALTD                                                  01438000
TRMLGB   EQU   TRMDSORG                                                 01439000
TRMUTERM EQU   TLISTCNT                                                 01440000
TRMDESTQ EQU   IEDQTRM+1                                                01441000
TRMSCNYN EQU   TRMSTATE                                                 01442000
TRMOPTFN EQU   TRMSTATE                                                 01443000
TRMHELDN EQU   TRMSTATE                                                 01444000
TRMACPTN EQU   TRMSTATE                                                 01445000
TRMPREF  EQU   TRMSTATE                                                 01446000
TRMPROC  EQU   TRMLOG                                                   01447000
TRMLIST  EQU   TRMLOG                                                   01448000
TRMLINE  EQU   TRMSTATE                                                 01449000
TRMSUBST EQU   IEDNTRM+12                                               01450000
TRMTYPE  EQU   IEDNTRM+11                                               01451000
TRMRLMCT EQU   IEDNTRM+10                                               01452000
TRMCOHTG EQU   TRMSIBPT+1                                               01453000
TRMGPCNT EQU   TRMSIBPT                                                 01454000
TRMBUFRD EQU   TRMBYTE0                                                 01455000
TRMSNA   EQU   TRMBYTE0                                                 01456000
TRMGP    EQU   TRMBYTE0                                                 01457000
TRMDIAL  EQU   TRMBYTE0                                                 01458000
@NM00186 EQU   TRMBYTE0                                                 01459000
TRMOUTPT EQU   TRMBYTE0                                                 01460000
TRMINPUT EQU   TRMBYTE0                                                 01461000
TRMUDEF  EQU   TRMBYTE0                                                 01462000
TRMCOHRT EQU   IEDNTRM+4                                                01463000
TRMSTOTE EQU   TRMBYTE1                                                 01464000
TRMCKPRN EQU   TRMBYTE1                                                 01465000
TRMTSATN EQU   TRMBYTE1                                                 01466000
TRMTRACE EQU   TRMBYTE1                                                 01467000
TRMSWBCK EQU   TRMBYTE1                                                 01468000
TRMAUTOC EQU   TRMBYTE1                                                 01469000
TRMINPTP EQU   TRMBYTE1                                                 01470000
TRMWTNEG EQU   TRMSCPRQ                                                 01471000
TRMWRBRK EQU   TRMBYTE2                                                 01472000
TRMNOSND EQU   TRMBYTE2                                                 01473000
TRMPREP  EQU   TRMBYTE2                                                 01474000
TRMGPACT EQU   TRMBYTE2                                                 01475000
TRMANDL  EQU   TRMBYTE2                                                 01476000
TRMCLOSN EQU   TRMINPG                                                  01477000
TRMREMB  EQU   TRMBYTE2                                                 01478000
TRMRSACT EQU   TRMBYTE2                                                 01479000
TCXEND   EQU   IEDQTCXD+224                                             01480000
TCXNCPIO EQU   IEDQTCXD+220                                             01481000
TCXACTE8 EQU   TCXQE8                                                   01482000
TCXABEPL EQU   IEDQTCXD+212                                             01483000
TCXSRBS  EQU   IEDQTCXD+208                                             01484000
TCXSIOSB EQU   IEDQTCXD+204                                             01485000
TCXESAVE EQU   IEDQTCXD+132                                             01486000
TCXERPPM EQU   IEDQTCXD+128                                             01487000
TCXERPSV EQU   IEDQTCXD+116                                             01488000
TCXSATTN EQU   IEDQTCXD+112                                             01489000
@NM00185 EQU   TCXDSAVE+4                                               01490000
@NM00184 EQU   TCXDSAVE                                                 01491000
TCXPLCB  EQU   IEDQTCXD+100                                             01492000
TCXBITS  EQU   IEDQTCXD+98                                              01493000
TCXSCBSZ EQU   IEDQTCXD+97                                              01494000
TCXBIT1  EQU   IEDQTCXD+96                                              01495000
TCXCOMPT EQU   IEDQTCXD+92                                              01496000
TCXAVAIL EQU   IEDQTCXD+88                                              01497000
TCXBUFL  EQU   IEDQTCXD+84                                              01498000
TCXTOTE  EQU   TCXBUFA                                                  01499000
TCXCKPM  EQU   IEDQTCXD+79                                              01500000
TCXNCKPR EQU   IEDQTCXD+78                                              01501000
TCXSZAIB EQU   IEDQTCXD+76                                              01502000
TCXAIBC  EQU   IEDQTCXD+72                                              01503000
TCXPEBC  EQU   IEDQTCXD+68                                              01504000
TCXPEWAC EQU   IEDQTCXD+64                                              01505000
TCXQRQ   EQU   IEDQTCXD+60                                              01506000
TCXOCQ   EQU   IEDQTCXD+56                                              01507000
TCXPNTQ  EQU   IEDQTCXD+52                                              01508000
TCXPUTQ  EQU   IEDQTCXD+48                                              01509000
TCXGETQ  EQU   IEDQTCXD+44                                              01510000
TCXTSI   EQU   IEDQTCXD+40                                              01511000
TCXRPT   EQU   IEDQTCXD+36                                              01512000
TCXCC3TS EQU   IEDQTCXD+35                                              01513000
TCXAPDMP EQU   TCXFLAG1                                                 01514000
TCXAPPL  EQU   TCXFLAG1                                                 01515000
TCXRTM   EQU   TCXFLAG1                                                 01516000
TCXMCPCD EQU   TCXFLAG1                                                 01517000
TCXAUTH  EQU   TCXFLAG1                                                 01518000
TCXASID  EQU   IEDQTCXD+32                                              01519000
TCXASCB  EQU   IEDQTCXD+28                                              01520000
TCXPASWD EQU   IEDQTCXD+16                                              01521000
TCXDISP  EQU   IEDQTCXD+12                                              01522000
TCXTCB   EQU   IEDQTCXD+8                                               01523000
TCXATTLN EQU   TCXATTEN                                                 01524000
@NM00183 EQU   TCBXTNT2+32                                              01525000
TCBRV181 EQU   TCBRV173                                                 01526000
TCBRV180 EQU   TCBRV173                                                 01527000
TCBRV179 EQU   TCBRV173                                                 01528000
TCBRV178 EQU   TCBRV173                                                 01529000
TCBRV177 EQU   TCBRV173                                                 01530000
TCBRV176 EQU   TCBRV173                                                 01531000
TCBRV175 EQU   TCBRV173                                                 01532000
TCBRV174 EQU   TCBRV173                                                 01533000
TCBRV172 EQU   TCBRV164                                                 01534000
TCBRV171 EQU   TCBRV164                                                 01535000
TCBRV170 EQU   TCBRV164                                                 01536000
TCBRV169 EQU   TCBRV164                                                 01537000
TCBRV168 EQU   TCBRV164                                                 01538000
TCBRV167 EQU   TCBRV164                                                 01539000
TCBRV166 EQU   TCBRV164                                                 01540000
TCBRV165 EQU   TCBRV164                                                 01541000
TCBRV163 EQU   TCBRV155                                                 01542000
TCBRV162 EQU   TCBRV155                                                 01543000
TCBRV161 EQU   TCBRV155                                                 01544000
TCBRV160 EQU   TCBRV155                                                 01545000
TCBRV159 EQU   TCBRV155                                                 01546000
TCBRV158 EQU   TCBRV155                                                 01547000
TCBRV157 EQU   TCBRV155                                                 01548000
TCBRV156 EQU   TCBRV155                                                 01549000
TCBRV154 EQU   TCBRV146                                                 01550000
TCBRV153 EQU   TCBRV146                                                 01551000
TCBRV152 EQU   TCBRV146                                                 01552000
TCBRV151 EQU   TCBRV146                                                 01553000
TCBRV150 EQU   TCBRV146                                                 01554000
TCBRV149 EQU   TCBRV146                                                 01555000
TCBRV148 EQU   TCBRV146                                                 01556000
TCBRV147 EQU   TCBRV146                                                 01557000
TCBRV145 EQU   TCBXTNT2+26                                              01558000
TCBRV144 EQU   TCBXTNT2+24                                              01559000
TCBRV143 EQU   TCBXTNT2+20                                              01560000
TCBRV142 EQU   TCBXTNT2+16                                              01561000
TCBRSV49 EQU   TCBXTNT2+12                                              01562000
TCBEVENT EQU   TCBXTNT2+8                                               01563000
TCBRCMP  EQU   TCBXTNT2+5                                               01564000
TCBRSVAB EQU   TCBXTNT2+4                                               01565000
TCBGTFA  EQU   TCBGTF+1                                                 01566000
TCBRSV47 EQU   TCBTFLG                                                  01567000
TCBRSV46 EQU   TCBTFLG                                                  01568000
TCBRSV45 EQU   TCBTFLG                                                  01569000
TCBRSV44 EQU   TCBTFLG                                                  01570000
TCBRSV43 EQU   TCBTFLG                                                  01571000
TCBDSPIT EQU   TCBTFLG                                                  01572000
TCBERRTN EQU   TCBTFLG                                                  01573000
TCBASYNC EQU   TCBTFLG                                                  01574000
@NM00182 EQU   TCB+296                                                  01575000
TCBSVCA2 EQU   TCB+292                                                  01576000
TCBSWASA EQU   TCB+288                                                  01577000
TCBDBTB  EQU   TCB+284                                                  01578000
TCBRPT   EQU   TCB+280                                                  01579000
TCBRV141 EQU   TCBRV133                                                 01580000
TCBRV140 EQU   TCBRV133                                                 01581000
TCBRV139 EQU   TCBRV133                                                 01582000
TCBRV138 EQU   TCBRV133                                                 01583000
TCBRV137 EQU   TCBRV133                                                 01584000
TCBRV136 EQU   TCBRV133                                                 01585000
TCBRV135 EQU   TCBRV133                                                 01586000
TCBRV134 EQU   TCBRV133                                                 01587000
TCBRV132 EQU   TCBRV124                                                 01588000
TCBRV131 EQU   TCBRV124                                                 01589000
TCBRV130 EQU   TCBRV124                                                 01590000
TCBRV129 EQU   TCBRV124                                                 01591000
TCBRV128 EQU   TCBRV124                                                 01592000
TCBRV127 EQU   TCBRV124                                                 01593000
TCBRV126 EQU   TCBRV124                                                 01594000
TCBRV125 EQU   TCBRV124                                                 01595000
TCBRV123 EQU   TCBFBYT2                                                 01596000
TCBRV122 EQU   TCBFBYT2                                                 01597000
TCBECBNV EQU   TCBFBYT2                                                 01598000
TCBSSSYN EQU   TCBFBYT2                                                 01599000
TCBFPRAP EQU   TCBFBYT2                                                 01600000
TCBFDW   EQU   TCBFBYT2                                                 01601000
TCBFMW   EQU   TCBFBYT2                                                 01602000
TCBCNCB  EQU   TCBFBYT2                                                 01603000
TCBLLH   EQU   TCBFBYT1                                                 01604000
TCBRV113 EQU   TCBFBYT1                                                 01605000
TCBEOT   EQU   TCBFBYT1                                                 01606000
TCBRTM2  EQU   TCBFBYT1                                                 01607000
TCBPGNLY EQU   TCBFBYT1                                                 01608000
TCBNDIOS EQU   TCBFBYT1                                                 01609000
TCBACTIV EQU   TCBFBYT1                                                 01610000
TCBEOTFM EQU   TCBFBYT1                                                 01611000
TCBAFFN  EQU   TCB+274                                                  01612000
TCBCCPVI EQU   TCB+272                                                  01613000
TCBUKYSP EQU   TCB+268                                                  01614000
TCBMODE  EQU   TCBESTAE+3                                               01615000
TCBERTYP EQU   TCBESTAE+2                                               01616000
TCBRV314 EQU   TCBESTRM                                                 01617000
TCBRV313 EQU   TCBESTRM                                                 01618000
TCBRV312 EQU   TCBESTRM                                                 01619000
TCBRV311 EQU   TCBESTRM                                                 01620000
TCBRV310 EQU   TCBESTRM                                                 01621000
TCBRV309 EQU   TCBESTRM                                                 01622000
TCBRV308 EQU   TCBESTRM                                                 01623000
TCBETERM EQU   TCBESTRM                                                 01624000
TCBSCBKY EQU   TCBESTAE                                                 01625000
TCBRTM12 EQU   TCB+260                                                  01626000
TCBTCBID EQU   TCB+256                                                  01627000
TCBRSV96 EQU   TCB+252                                                  01628000
TCBSWA   EQU   TCB+248                                                  01629000
TCBFOEA  EQU   TCBFOE+1                                                 01630000
TCBRSV42 EQU   TCBFOE                                                   01631000
TCBRV306 EQU   TCB+240                                                  01632000
TCBRSV41 EQU   TCB+239                                                  01633000
TCBTID   EQU   TCB+238                                                  01634000
TCBRSVAA EQU   TCB+237                                                  01635000
TCBABCUR EQU   TCB+236                                                  01636000
TCBTMSAV EQU   TCB+232                                                  01637000
TCBIOTIM EQU   TCB+228                                                  01638000
TCBRTWA  EQU   TCB+224                                                  01639000
TCBBACK  EQU   TCB+220                                                  01640000
TCBTIRB  EQU   TCB+216                                                  01641000
TCBAECB  EQU   TCB+212                                                  01642000
TCBEXT2A EQU   TCBEXT2+1                                                01643000
TCBRSV39 EQU   TCBEXT2                                                  01644000
TCBSTMCT EQU   TCB+207                                                  01645000
TCBSYSCT EQU   TCB+206                                                  01646000
TCBRSV37 EQU   TCB+205                                                  01647000
TCBEXSVC EQU   TCBDAR                                                   01648000
TCBDARMS EQU   TCBDAR                                                   01649000
TCBDARWT EQU   TCBDAR                                                   01650000
TCBDARO  EQU   TCBDAR                                                   01651000
TCBDARMC EQU   TCBDARC                                                  01652000
TCBDARD  EQU   TCBDAR                                                   01653000
TCBDARS  EQU   TCBDAR                                                   01654000
TCBDARP  EQU   TCBDAR                                                   01655000
TCBGTOFM EQU   TCBFLGS7                                                 01656000
TCBADMP  EQU   TCBFLGS7                                                 01657000
TCBRSTSK EQU   TCBFLGS7                                                 01658000
TCBSVCS  EQU   TCBFLGS7                                                 01659000
TCBSTACK EQU   TCBFLGS7                                                 01660000
TCBRSV34 EQU   TCBFLGS7                                                 01661000
TCBRSV33 EQU   TCBFLGS7                                                 01662000
TCBGPECB EQU   TCBFLGS7                                                 01663000
TCBNTJS  EQU   TCBFLGS6                                                 01664000
TCBAPG   EQU   TCBFLGS6                                                 01665000
TCBMIGR  EQU   TCBFLGS6                                                 01666000
TCBRV303 EQU   TCBFLGS6                                                 01667000
TCBSPVLK EQU   TCBFLGS6                                                 01668000
TCBCPU   EQU   TCBFLGS6                                                 01669000
TCBPIE17 EQU   TCBFLGS6                                                 01670000
TCBRV    EQU   TCBFLGS6                                                 01671000
TCBRSV79 EQU   TCBNDSP5                                                 01672000
TCBRSV78 EQU   TCBNDSP5                                                 01673000
TCBRSV77 EQU   TCBNDSP5                                                 01674000
TCBRSV76 EQU   TCBNDSP5                                                 01675000
TCBRSV75 EQU   TCBNDSP5                                                 01676000
TCBRSV74 EQU   TCBNDSP5                                                 01677000
TCBRSV95 EQU   TCBNDSP5                                                 01678000
TCBRSV94 EQU   TCBNDSP5                                                 01679000
TCBRSV93 EQU   TCBNDSP4                                                 01680000
TCBRSV92 EQU   TCBNDSP4                                                 01681000
TCBRSV91 EQU   TCBNDSP4                                                 01682000
TCBRSV90 EQU   TCBNDSP4                                                 01683000
TCBRSV89 EQU   TCBNDSP4                                                 01684000
TCBRSV88 EQU   TCBNDSP4                                                 01685000
TCBRSV87 EQU   TCBNDSP4                                                 01686000
TCBRSV86 EQU   TCBNDSP4                                                 01687000
TCBEXT1A EQU   TCBEXT1+1                                                01688000
TCBRSV32 EQU   TCBEXT1                                                  01689000
TCBEXCPD EQU   TCB+192                                                  01690000
TCBIOBRC EQU   TCB+188                                                  01691000
TCBDDWTC EQU   TCB+186                                                  01692000
TCBDDEXC EQU   TCB+184                                                  01693000
TCBJSCBB EQU   TCBJSCB+1                                                01694000
@NM00181 EQU   TCBRECDE                                                 01695000
TCBREC   EQU   TCBRECDE                                                 01696000
TCBMDIDS EQU   TCB+176                                                  01697000
TCBNDINT EQU   TCBNDSP3                                                 01698000
TCBRSV27 EQU   TCBNDSP3                                                 01699000
TCBRSV26 EQU   TCBNDSP3                                                 01700000
TCBRSV25 EQU   TCBNDSP3                                                 01701000
TCBRSV24 EQU   TCBNDSP3                                                 01702000
TCBSRBND EQU   TCBNDSP3                                                 01703000
TCBRV302 EQU   TCBNDSP3                                                 01704000
TCBLJSND EQU   TCBNDSP3                                                 01705000
TCBABE   EQU   TCBNDSP2                                                 01706000
TCBDSS   EQU   TCBNDSP2                                                 01707000
TCBOWAIT EQU   TCBNDSP2                                                 01708000
TCBIWAIT EQU   TCBNDSP2                                                 01709000
TCBNDTS  EQU   TCBNDSP2                                                 01710000
TCBNDSVC EQU   TCBNDSP2                                                 01711000
TCBSTPP  EQU   TCBNDSP2                                                 01712000
TCBABD   EQU   TCBNDSP2                                                 01713000
TCBRSV22 EQU   TCBNDSP1                                                 01714000
TCBPIEND EQU   TCBNDSP1                                                 01715000
TCBTPSP  EQU   TCBNDSP1                                                 01716000
TCBDDRND EQU   TCBNDSP1                                                 01717000
TCBRSPND EQU   TCBNDSP1                                                 01718000
TCBRSTND EQU   TCBNDSP1                                                 01719000
TCBDARPN EQU   TCBNDSP1                                                 01720000
TCBDARTN EQU   TCBNDSP1                                                 01721000
TCBNDSP0 EQU   TCBNDSP                                                  01722000
TCBUSER  EQU   TCB+168                                                  01723000
TCBTCTB  EQU   TCBTCT+1                                                 01724000
TCBRSV9C EQU   TCBTCTGF                                                 01725000
TCBRSV9B EQU   TCBTCTGF                                                 01726000
TCBRSV9A EQU   TCBTCTGF                                                 01727000
TCBRSV99 EQU   TCBTCTGF                                                 01728000
TCBRSV98 EQU   TCBTCTGF                                                 01729000
TCBRSV97 EQU   TCBTCTGF                                                 01730000
TCBRSV20 EQU   TCBTCTGF                                                 01731000
TCBSMFGF EQU   TCBTCTGF                                                 01732000
TCBSTABB EQU   TCBSTAB+1                                                01733000
TCBSTCUR EQU   TCBNSTAE                                                 01734000
TCBRV301 EQU   TCBNSTAE                                                 01735000
TCBSYNCH EQU   TCBNSTAE                                                 01736000
TCBHALT  EQU   TCBNSTAE                                                 01737000
TCBPPSUP EQU   TCBNSTAE                                                 01738000
TCB33E   EQU   TCBNSTAE                                                 01739000
TCBQUIES EQU   TCBNSTAE                                                 01740000
TCBSTABE EQU   TCBNSTAE                                                 01741000
TCBAQE   EQU   TCB+156                                                  01742000
TCBPQE   EQU   TCB+152                                                  01743000
TCBTSDP  EQU   TCB+151                                                  01744000
TCBTSLP  EQU   TCB+150                                                  01745000
TCBSTPCT EQU   TCB+149                                                  01746000
TCBCPUBN EQU   TCBTSFLG                                                 01747000
TCBDYDSP EQU   TCBTSFLG                                                 01748000
TCBRSV18 EQU   TCBTSFLG                                                 01749000
TCBRSV17 EQU   TCBTSFLG                                                 01750000
TCBTIOTG EQU   TCBTSFLG                                                 01751000
TCBATT   EQU   TCBTSFLG                                                 01752000
TCBSTPPR EQU   TCBTSFLG                                                 01753000
TCBRV300 EQU   TCBTSTSK                                                 01754000
TCBECB   EQU   TCB+144                                                  01755000
TCBIQE   EQU   TCB+140                                                  01756000
TCBLTC   EQU   TCB+136                                                  01757000
TCBOTC   EQU   TCB+132                                                  01758000
TCBNTC   EQU   TCB+128                                                  01759000
TCBJSTCA EQU   TCBJSTCB+1                                               01760000
TCBRSV16 EQU   TCBJSTCB                                                 01761000
TCBTQET  EQU   TCBTME                                                   01762000
TCBTCB   EQU   TCB+116                                                  01763000
TCBFSAB  EQU   TCBFSA+1                                                 01764000
TCBQEL   EQU   TCBFSA                                                   01765000
TCBGRS15 EQU   TCBGRS+60                                                01766000
TCBGRS14 EQU   TCBGRS+56                                                01767000
TCBGRS13 EQU   TCBGRS+52                                                01768000
TCBGRS12 EQU   TCBGRS+48                                                01769000
TCBGRS11 EQU   TCBGRS+44                                                01770000
TCBGRS10 EQU   TCBGRS+40                                                01771000
TCBGRS9  EQU   TCBGRS+36                                                01772000
TCBGRS8  EQU   TCBGRS+32                                                01773000
TCBGRS7  EQU   TCBGRS+28                                                01774000
TCBGRS6  EQU   TCBGRS+24                                                01775000
TCBGRS5  EQU   TCBGRS+20                                                01776000
TCBGRS4  EQU   TCBGRS+16                                                01777000
TCBGRS3  EQU   TCBGRS+12                                                01778000
TCBGRS2  EQU   TCBGRS+8                                                 01779000
TCBGRS1  EQU   TCBGRS+4                                                 01780000
TCBGRS0  EQU   TCBGRS                                                   01781000
TCBJPQB  EQU   TCBJPQ+1                                                 01782000
TCBRSV15 EQU   TCBPURGE                                                 01783000
TCBRSV14 EQU   TCBPURGE                                                 01784000
TCBRSV13 EQU   TCBPURGE                                                 01785000
TCBRSV12 EQU   TCBPURGE                                                 01786000
TCBRSV11 EQU   TCBPURGE                                                 01787000
TCBRSV10 EQU   TCBPURGE                                                 01788000
TCBRSV09 EQU   TCBPURGE                                                 01789000
TCBJPQF  EQU   TCBPURGE                                                 01790000
TCBJLB   EQU   TCB+40                                                   01791000
TCBLLS   EQU   TCB+36                                                   01792000
TCBDSP   EQU   TCB+35                                                   01793000
TCBLMP   EQU   TCB+34                                                   01794000
TCBPNDSP EQU   TCBFLGS5                                                 01795000
TCBFCD1  EQU   TCBFLGS5                                                 01796000
TCBSTP   EQU   TCBFLGS5                                                 01797000
TCBSYS   EQU   TCBFLGS5                                                 01798000
TCBANDSP EQU   TCBFLGS5                                                 01799000
TCBPAGE  EQU   TCBFLGS5                                                 01800000
TCBUXNDF EQU   TCBABWF                                                  01801000
TCBFC    EQU   TCBFLGS5                                                 01802000
TCBONDSP EQU   TCBFLGS4                                                 01803000
TCBMPCND EQU   TCBFLGS4                                                 01804000
TCBMPCVQ EQU   TCBFLGS4                                                 01805000
TCBUXNDV EQU   TCBFLGS4                                                 01806000
TCBHNDSP EQU   TCBFLGS4                                                 01807000
TCBRQENA EQU   TCBFLGS4                                                 01808000
TCBSER   EQU   TCBFLGS4                                                 01809000
TCBNDUMP EQU   TCBFLGS4                                                 01810000
TCBDWSTA EQU   TCBFLGS3                                                 01811000
TCBRSV08 EQU   TCBFLGS3                                                 01812000
TCBRSV07 EQU   TCBFLGS3                                                 01813000
TCBRSV06 EQU   TCBFLGS3                                                 01814000
TCBABGM  EQU   TCBFLGS3                                                 01815000
TCBABTRM EQU   TCBFLGS3                                                 01816000
TCBADINP EQU   TCBFLGS3                                                 01817000
TCBFSM   EQU   TCBFLGS3                                                 01818000
TCBFTS   EQU   TCBFLGS2                                                 01819000
TCBFETXR EQU   TCBFLGS2                                                 01820000
TCBFDSOP EQU   TCBFLGS2                                                 01821000
TCBFJMC  EQU   TCBFLGS2                                                 01822000
TCBFSMC  EQU   TCBFLGS2                                                 01823000
TCBFABOP EQU   TCBFLGS2                                                 01824000
TCBFSTI  EQU   TCBFLGS2                                                 01825000
TCBFOINP EQU   TCBFLGS2                                                 01826000
TCBFX    EQU   TCBFLGS1                                                 01827000
TCBFS    EQU   TCBFLGS1                                                 01828000
TCBFT    EQU   TCBFLGS1                                                 01829000
TCBPDUMP EQU   TCBFLGS1                                                 01830000
TCBNONPR EQU   TCBFLGS1                                                 01831000
TCBFERA  EQU   TCBFLGS1                                                 01832000
TCBFE    EQU   TCBFLGS1                                                 01833000
TCBFA    EQU   TCBFLGS1                                                 01834000
TCBZERO  EQU   TCBPKF                                                   01835000
TCBFLAG  EQU   TCBPKF                                                   01836000
TCBMSSB  EQU   TCBMSS+1                                                 01837000
TCBRSV03 EQU   TCBMSS                                                   01838000
TCBTRNB  EQU   TCBTRN+1                                                 01839000
TCBRSV02 EQU   TCBABF                                                   01840000
TCBOLTEP EQU   TCBABF                                                   01841000
TCBTCP   EQU   TCBABF                                                   01842000
TCBTCPP  EQU   TCBABF                                                   01843000
TCBRSV01 EQU   TCBABF                                                   01844000
TCBGRPH  EQU   TCBABF                                                   01845000
TCBNOCHK EQU   TCBABF                                                   01846000
TCBMOD91 EQU   TCBABF                                                   01847000
TCBCMPC  EQU   TCBCMP+1                                                 01848000
TCBRV318 EQU   TCBCMSG                                                  01849000
TCBRV317 EQU   TCBCIND                                                  01850000
TCBRV316 EQU   TCBCWTO                                                  01851000
TCBCASID EQU   TCBCDBL                                                  01852000
TCBNOCC  EQU   TCBSTCC                                                  01853000
TCBDMPO  EQU   TCBCPP                                                   01854000
TCBCSTEP EQU   TCBCMPF                                                  01855000
TCBCREQ  EQU   TCBCMPF                                                  01856000
TCBTIO   EQU   TCB+12                                                   01857000
TCBPIEA  EQU   TCBPIE+1                                                 01858000
TCBPM    EQU   TCBPMASK                                                 01859000
@NM00180 EQU   TCBPMASK                                                 01860000
TCBRBP   EQU   TCB                                                      01861000
TCBFRS6  EQU   TCBFRS+24                                                01862000
TCBFRS4  EQU   TCBFRS+16                                                01863000
TCBFRS2  EQU   TCBFRS+8                                                 01864000
TCBFRS0  EQU   TCBFRS                                                   01865000
@NM00179 EQU   SRB+40                                                   01866000
@NM00178 EQU   SRB+38                                                   01867000
SRBPRIOR EQU   SRB+37                                                   01868000
SRBPKF   EQU   SRB+36                                                   01869000
SRBSAVE  EQU   SRB+32                                                   01870000
SRBRMTR  EQU   SRB+24                                                   01871000
SRBEP    EQU   SRB+20                                                   01872000
SRBPTCB  EQU   SRBFLC+4                                                 01873000
SRBPASID EQU   SRBFLC+2                                                 01874000
SRBCPAFF EQU   SRBFLC                                                   01875000
SRBASCB  EQU   SRB+8                                                    01876000
SRBFLNK  EQU   SRB+4                                                    01877000
RECBKEY  EQU   IEDQRECB                                                 01878000
LCBERADR EQU   LCBXRADR+1                                               01879000
LCBPCIRC EQU   LCBXRADR                                                 01880000
LCBDCT3  EQU   LCBXDCT+2                                                01881000
LCBDCT2  EQU   LCBXDCT+1                                                01882000
LCBDCT1  EQU   LCBXDCT                                                  01883000
@NM00177 EQU   LCBXFLAG                                                 01884000
LCBERPND EQU   LCBXFLAG                                                 01885000
LCBSRCPF EQU   LCBXFLAG                                                 01886000
LCBGPCTV EQU   LCBXFLAG                                                 01887000
@NM00176 EQU   LCBXFLAG                                                 01888000
@NM00175 EQU   LCBXFLAG                                                 01889000
@NM00174 EQU   LCBXFLAG                                                 01890000
@NM00173 EQU   LCBXFLAG                                                 01891000
LCBCCW10 EQU   LCBCPA+72                                                01892000
LCBCCW9  EQU   LCBCPA+64                                                01893000
LCBCCW8  EQU   LCBCPA+56                                                01894000
LCBCCW7  EQU   LCBCPA+48                                                01895000
LCBCCW6  EQU   LCBCPA+40                                                01896000
LCBCP    EQU   LCBQEBPL+4                                               01897000
LCBSIO   EQU   LCBQEBPL                                                 01898000
LCBCCW2  EQU   LCBCPA+8                                                 01899000
LCBCCW1  EQU   LCBCPA                                                   01900000
@NM00158 EQU   LCBERCCW+16                                              01901000
@NM00157 EQU   LCBERCCW                                                 01902000
LCBCSWSV EQU   LCBSAVSN+1                                               01903000
LCBSNSV  EQU   LCBSAVSN                                                 01904000
LCBBFSNS EQU   LCBRSPSV                                                 01905000
LCBWAITC EQU   LCBTPCD+5                                                01906000
LCBINPAK EQU   LCBSTAT6                                                 01907000
LCBMHBID EQU   LCBSTAT6                                                 01908000
LCBRTRRO EQU   LCBSTAT6                                                 01909000
LCBHDRPD EQU   LCBSTAT6                                                 01910000
LCBCHN   EQU   LCBSTAT6                                                 01911000
LCBBFRSV EQU   LCBTPCD+1                                                01912000
@NM00156 EQU   LCBSTAT5                                                 01913000
LCBLUS   EQU   LCBSTAT5                                                 01914000
LCBLUNIT EQU   LCBSTAT5                                                 01915000
LCBPERM  EQU   LCBSTAT5                                                 01916000
LCBNXCMD EQU   LCBBFRW                                                  01917000
LCBERMSK EQU   LCBOBRCH                                                 01918000
LCBSCBA  EQU   IEDQLCB+93                                               01919000
LCBOLT   EQU   LCBMSGFM                                                 01920000
LCBEOT   EQU   LCBMSGFM                                                 01921000
LCBENQ   EQU   LCBMSGFM                                                 01922000
LCBTTD   EQU   LCBMSGFM                                                 01923000
LCBRSTRT EQU   LCBMSGFM                                                 01924000
LCBVSTRT EQU   LCBMSGFM                                                 01925000
LCBACKI  EQU   LCBMSGFM                                                 01926000
LCBNAK   EQU   LCBMSGFM                                                 01927000
@NM00155 EQU   LCBRBCT2                                                 01928000
LCBDCNT  EQU   LCBRBCT2                                                 01929000
LCBRBCT1 EQU   LCBERBCT                                                 01930000
LCBERBCH EQU   IEDQLCB+85                                               01931000
LCBCOMPL EQU   LCBDLNKN                                                 01932000
LCBPRCPG EQU   LCBERBST                                                 01933000
LCBERROR EQU   LCBERBST                                                 01934000
@NM00154 EQU   LCBERBST                                                 01935000
LCBINQ   EQU   LCBERBST                                                 01936000
LCBRDERR EQU   LCBERBST                                                 01937000
LCBEOMSG EQU   LCBERBST                                                 01938000
LCBMSG   EQU   LCBERBST                                                 01939000
LCBERBLK EQU   IEDQLCB+81                                               01940000
LCBERBPY EQU   IEDQLCB+80                                               01941000
LCBERBQB EQU   LCBERB+1                                                 01942000
LCBERBKY EQU   LCBERB                                                   01943000
LCBRECAD EQU   IEDQLCB+73                                               01944000
@NM00153 EQU   LCBTSTSW                                                 01945000
@NM00152 EQU   LCBTSTSW                                                 01946000
@NM00151 EQU   LCBTSTSW                                                 01947000
@NM00150 EQU   LCBTSTSW                                                 01948000
@NM00149 EQU   LCBTSTSW                                                 01949000
@NM00148 EQU   LCBTSTSW                                                 01950000
@NM00147 EQU   LCBTSTSW                                                 01951000
LCBCONCT EQU   LCBTSTSW                                                 01952000
LCBRESP  EQU   LCBSTAT2                                                 01953000
LCBNEGRP EQU   LCBSTAT2                                                 01954000
LCBSNDPR EQU   LCBSTAT2                                                 01955000
LCBCONNN EQU   LCBBEOTN                                                 01956000
LCBMSGNN EQU   LCBSTAT2                                                 01957000
LCBTRACE EQU   LCBSTAT2                                                 01958000
LCBSENDN EQU   LCBSTAT1                                                 01959000
LCBRECVN EQU   LCBSTAT1                                                 01960000
LCBFREEN EQU   LCBSTAT1                                                 01961000
LCBCONT  EQU   LCBSTAT1                                                 01962000
LCBINITN EQU   LCBSTAT1                                                 01963000
LCBOCNI  EQU   LCBSTAT1                                                 01964000
LCBOCWTN EQU   LCBSTAT1                                                 01965000
LCBRCLLN EQU   LCBSTAT1                                                 01966000
LCBUCBX  EQU   IEDQLCB+64                                               01967000
LCBTTBIN EQU   LCBERRCT                                                 01968000
@NM00146 EQU   LCBINCAM                                                 01969000
LCBGETMN EQU   LCBINCAM                                                 01970000
@NM00145 EQU   LCBRESTR+1                                               01971000
LCBCMDSV EQU   LCBRESTR                                                 01972000
LCBPCILK EQU   LCBDCBPT                                                 01973000
LCBAP4OL EQU   LCBSIOCC                                                 01974000
LCBAP3OL EQU   LCBSIOCC                                                 01975000
LCBAP2OL EQU   LCBSIOCC                                                 01976000
LCBAP1OL EQU   LCBSIOCC                                                 01977000
LCBSIOC2 EQU   LCBSIOCC                                                 01978000
LCBSIOC1 EQU   LCBSIOCC                                                 01979000
@NM00144 EQU   LCBSIOCC                                                 01980000
LCBCSWRC EQU   LCBCSW+5                                                 01981000
LCBCSCHC EQU   LCBCSWCS                                                 01982000
LCBCSICC EQU   LCBCSWCS                                                 01983000
LCBCSCCC EQU   LCBCSWCS                                                 01984000
LCBCSCDC EQU   LCBCSWCS                                                 01985000
LCBCSPTC EQU   LCBCSWCS                                                 01986000
LCBCSPGC EQU   LCBCSWCS                                                 01987000
LCBCSIL  EQU   LCBCSWCS                                                 01988000
LCBCSPCI EQU   LCBCSWCS                                                 01989000
LCBUSUE  EQU   LCBCSWUS                                                 01990000
LCBUSUC  EQU   LCBCSWUS                                                 01991000
LCBUSDE  EQU   LCBCSWUS                                                 01992000
LCBUSCE  EQU   LCBCSWUS                                                 01993000
LCBUSBSY EQU   LCBCSWUS                                                 01994000
LCBUSCUE EQU   LCBCSWUS                                                 01995000
LCBUSSM  EQU   LCBCSWUS                                                 01996000
LCBUSAT  EQU   LCBCSWUS                                                 01997000
LCBCSWCA EQU   LCBCSW                                                   01998000
LCBOBR   EQU   LCBFLAG3                                                 01999000
LCBOBRRD EQU   LCBFLAG3                                                 02000000
LCBIOMSG EQU   LCBFLAG3                                                 02001000
LCBSOHC  EQU   LCBFLAG3                                                 02002000
LCBRLAD  EQU   LCBFLAG3                                                 02003000
LCBSOHR  EQU   LCBFLAG3                                                 02004000
@NM00143 EQU   LCBFLAG3                                                 02005000
LCBECBPT EQU   LCBIOBSN+4                                               02006000
LCBECBCC EQU   LCBIOBSN+3                                               02007000
LCBSENS1 EQU   LCBSNS+1                                                 02008000
LCBABORT EQU   LCBTMOUT                                                 02009000
LCBNOTIN EQU   LCBLOSDT                                                 02010000
LCBOVRUN EQU   LCBSENS0                                                 02011000
LCBDATCK EQU   LCBSENS0                                                 02012000
LCBEQUCK EQU   LCBSENS0                                                 02013000
LCBBUSCK EQU   LCBSENS0                                                 02014000
LCBINTRQ EQU   LCBSENS0                                                 02015000
LCBCMDRJ EQU   LCBSENS0                                                 02016000
LCBFLAG2 EQU   LCBIOBSN                                                 02017000
@NM00142 EQU   LCBFLAG1                                                 02018000
LCBUNREL EQU   LCBFLAG1                                                 02019000
LCBEXCPN EQU   LCBFLAG1                                                 02020000
@NM00141 EQU   LCBFLAG1                                                 02021000
LCBERPIN EQU   LCBFLAG1                                                 02022000
@NM00140 EQU   LCBFLAG1                                                 02023000
LCBFSBFR EQU   LCBMHA                                                   02024000
LCBISZE  EQU   IEDQLCB+28                                               02025000
LCBLNENT EQU   LCBSCBDA+1                                               02026000
@NM00139 EQU   LCBSCBDA                                                 02027000
LCBCPGMH EQU   LCBSTAT4                                                 02028000
LCBREAL  EQU   LCBPHASE                                                 02029000
@NM00138 EQU   LCBSTAT4                                                 02030000
LCBACTRQ EQU   LCBSTAT4                                                 02031000
LCBIPLRQ EQU   LCBSTAT4                                                 02032000
LCBDACRQ EQU   LCBSTAT4                                                 02033000
LCBDMPRQ EQU   LCBSTAT4                                                 02034000
@NM00137 EQU   LCBLKMDE                                                 02035000
LCBLOCKI EQU   LCBLKMDE                                                 02036000
LCBLOCKR EQU   LCBLKMDE                                                 02037000
LCBHMFLG EQU   LCBLKMDE                                                 02038000
LCBBDFLG EQU   LCBLKMDE                                                 02039000
@NM00136 EQU   LCBINSRC                                                 02040000
LCBABRTN EQU   LCBCHAIN                                                 02041000
LCBCTLMD EQU   LCBTETEN                                                 02042000
LCBBFRSZ EQU   LCBCHAIN                                                 02043000
LCBUREQN EQU   LCBCHAIN                                                 02044000
LCBNORTY EQU   LCBCHAIN                                                 02045000
LCBERMSG EQU   LCBCHAIN                                                 02046000
LCBEXCP  EQU   LCBCHAIN                                                 02047000
LCBINVRQ EQU   LCBSCRNN                                                 02048000
LCB2741N EQU   LCBTSOB                                                  02049000
LCBINHBN EQU   LCBTSOB                                                  02050000
LCBCIRCD EQU   LCBTSOB                                                  02051000
LCBPREP  EQU   LCBTSOB                                                  02052000
LCBSOPL  EQU   LCBTSOB                                                  02053000
LCBSATRD EQU   LCBTSOB                                                  02054000
LCBTSBUF EQU   LCBTSOB                                                  02055000
LCBWRBRK EQU   LCBTSOB                                                  02056000
LCBTDL   EQU   IEDQLCB+18                                               02057000
LCBEOLTD EQU   IEDQLCB+16                                               02058000
LCBRSLNK EQU   IEDQLCB+13                                               02059000
LCBRSPRI EQU   IEDQLCB+12                                               02060000
LCBSTCBA EQU   IEDQLCB+9                                                02061000
LCBRSKEY EQU   IEDQLCB+8                                                02062000
LCBLINK  EQU   LCBRCB+5                                                 02063000
LCBPRI   EQU   LCBRCB+4                                                 02064000
LCBQCBA  EQU   LCBRCB+1                                                 02065000
LCBKEY   EQU   LCBRCB                                                   02066000
IOSEND   EQU   IOSB+108                                                 02067000
IOSSKR   EQU   IOSEEKA+7                                                02068000
IOSSKH2  EQU   IOSSKHH+1                                                02069000
IOSSKH1  EQU   IOSSKHH                                                  02070000
IOSSKCC  EQU   IOSCCHH                                                  02071000
IOSSKBB  EQU   IOSEEKA+1                                                02072000
IOSSKM   EQU   IOSEEKA                                                  02073000
IOSEEK   EQU   IOSB+92                                                  02074000
IOSMDM   EQU   IOSB+91                                                  02075000
IOSMDB   EQU   IOSB+90                                                  02076000
IOSCKEY7 EQU   IOSCKEY                                                  02077000
IOSCKEY6 EQU   IOSCKEY                                                  02078000
IOSCKEY5 EQU   IOSCKEY                                                  02079000
IOSCKEY4 EQU   IOSCKEY                                                  02080000
@NM00132 EQU   IOSCKEY                                                  02081000
IOSFMSK  EQU   IOSB+88                                                  02082000
IOSCUDEV EQU   IOSPATH+1                                                02083000
@NM00131 EQU   IOSCHN                                                   02084000
IOSPATH3 EQU   IOSCHN                                                   02085000
IOSPATH2 EQU   IOSCHN                                                   02086000
IOSEXP   EQU   IOSCHN                                                   02087000
IOSGDP   EQU   IOSCHN                                                   02088000
IOSAFF   EQU   IOSB+85                                                  02089000
IOSRSS1B EQU   IOSB+84                                                  02090000
IOSDSID  EQU   IOSB+80                                                  02091000
IOSDIE   EQU   IOSB+68                                                  02092000
IOSABN   EQU   IOSB+64                                                  02093000
IOSNRM   EQU   IOSB+60                                                  02094000
IOSPCI   EQU   IOSB+56                                                  02095000
IOSERP   EQU   IOSB+52                                                  02096000
IOSPCHN  EQU   IOSB+48                                                  02097000
IOSSNS   EQU   IOSB+42                                                  02098000
IOSAPMSK EQU   IOSB+40                                                  02099000
IOSRES4A EQU   IOSB+36                                                  02100000
IOSUSE   EQU   IOSB+32                                                  02101000
IOSCSWRC EQU   IOSCSW+5                                                 02102000
IOSTSB   EQU   IOSTATUS+1                                               02103000
IOSCSWCA EQU   IOSCSW                                                   02104000
IOSCC    EQU   @NM00130                                                 02105000
IOSOPT2X EQU   IOSOPT2                                                  02106000
IOSHTP   EQU   IOSOPT2                                                  02107000
IOSRELSE EQU   IOSOPT                                                   02108000
IOSAPR   EQU   IOSOPT                                                   02109000
IOSTSLL  EQU   IOSOPT                                                   02110000
IOSNERP  EQU   IOSOPT                                                   02111000
IOSPSLL  EQU   IOSOPT                                                   02112000
IOSQISCE EQU   IOSOPT                                                   02113000
IOSDEP   EQU   IOSOPT                                                   02114000
IOSBYP   EQU   IOSOPT                                                   02115000
IOSCOD   EQU   IOSB+13                                                  02116000
IOSPKY7  EQU   IOSPKEY                                                  02117000
IOSPGDPX EQU   IOSPKEY                                                  02118000
IOSIDR   EQU   IOSPKEY                                                  02119000
IOSLCL   EQU   IOSPKEY                                                  02120000
@NM00129 EQU   IOSPKEY                                                  02121000
IOSPGAD  EQU   IOSB+8                                                   02122000
IOSASID  EQU   IOSB+6                                                   02123000
IOSPRLVL EQU   IOSB+5                                                   02124000
IOSDVRID EQU   IOSB+4                                                   02125000
IOSPROC  EQU   IOSB+3                                                   02126000
IOSFLC7  EQU   IOSFLC                                                   02127000
IOSFLC6  EQU   IOSFLC                                                   02128000
IOSRWAIT EQU   IOSFLC                                                   02129000
IOSTP    EQU   IOSFLC                                                   02130000
IOSCC3WE EQU   IOSFLC                                                   02131000
IOSVERIF EQU   IOSDVALT                                                 02132000
IOSDVMNT EQU   IOSFLC                                                   02133000
IOSLOG   EQU   IOSFLB                                                   02134000
IOSBDCST EQU   IOSFLB                                                   02135000
IOSMSG   EQU   IOSFLB                                                   02136000
IOSFLB4  EQU   IOSFLB                                                   02137000
IOSFLB3  EQU   IOSFLB                                                   02138000
IOSFLB2  EQU   IOSFLB                                                   02139000
IOSSDR   EQU   IOSFLB                                                   02140000
IOSDIESE EQU   IOSFLB                                                   02141000
IOSIOSB  EQU   IOSFLA                                                   02142000
IOSDOM   EQU   IOSFLA                                                   02143000
IOSEX    EQU   IOSFLA                                                   02144000
IOSSMDB  EQU   IOSFLA                                                   02145000
IOSSMDA  EQU   IOSFLA                                                   02146000
IOSERR   EQU   IOSFLA                                                   02147000
IOSCCHN  EQU   IOSACHN                                                  02148000
IOSDCHN  EQU   IOSACHN                                                  02149000
IOCOEND  EQU   IOCOM+128                                                02150000
IOCPATCH EQU   IOCOM+124                                                02151000
IOCUCBBM EQU   IOCOM+120                                                02152000
IOCQCNT  EQU   IOCOM+116                                                02153000
IOCIOSDQ EQU   IOCOM+112                                                02154000
IOCIOSEQ EQU   IOCOM+108                                                02155000
IOCSVCF  EQU   IOCOM+104                                                02156000
IOCTCCW  EQU   IOCOM+100                                                02157000
IOCRSVTB EQU   IOCOM+96                                                 02158000
IOCMFCNT EQU   IOCOM+92                                                 02159000
IOCMFHK  EQU   IOCOM+88                                                 02160000
IOCGENA  EQU   IOCOM+84                                                 02161000
IOCCCH   EQU   IOCOM+80                                                 02162000
IOCASYNQ EQU   IOCOM+76                                                 02163000
IOCLCHTB EQU   IOCOM+72                                                 02164000
IOCATTBL EQU   IOCOM+68                                                 02165000
IOCOMEX  EQU   IOCOM+64                                                 02166000
IOCSYNCH EQU   IOCOM+56                                                 02167000
IOCCATLK EQU   IOCOM+48                                                 02168000
IOCPRGID EQU   IOCOM+44                                                 02169000
IOCIOSCP EQU   IOCOM+40                                                 02170000
IOCORMGT EQU   IOCOM+36                                                 02171000
IOCVOID  EQU   IOCOM+32                                                 02172000
@NM00128 EQU   IOCOM+24                                                 02173000
@NM00127 EQU   IOCOM+20                                                 02174000
IOCINT   EQU   IOCOM+16                                                 02175000
IOCCTBL  EQU   IOCOM+12                                                 02176000
IOCHIO   EQU   IOCOM+8                                                  02177000
IOCPST   EQU   IOCOM+4                                                  02178000
IOCPGCT  EQU   IOCOM+2                                                  02179000
IOCVOICT EQU   IOCOM                                                    02180000
DEBAPPAD EQU   IEDQDEB+65                                               02181000
DEBEXSCL EQU   IEDQDEB+64                                               02182000
DEBPROTG EQU   IEDQDEB+60                                               02183000
DEBECBAD EQU   IEDQDEB+57                                               02184000
DEBPRIOR EQU   IEDQDEB+56                                               02185000
DEBUSRPG EQU   IEDQDEB+53                                               02186000
DEBSYSPG EQU   IEDQDEB+49                                               02187000
DEBOPATB EQU   IEDQDEB+48                                               02188000
DEBIRBAD EQU   IEDQDEB+45                                               02189000
DEBOFLGS EQU   IEDQDEB+44                                               02190000
DEBAMLNG EQU   IEDQDEB+40                                               02191000
DEBTCBAD EQU   IEDQDEB+37                                               02192000
@NM00126 EQU   DEBPRF+33                                                02193000
DEBLNGTH EQU   DEBPRF+32                                                02194000
DEBDCBMK EQU   DEBPRF+28                                                02195000
DEBDSCBA EQU   DEBPRF+21                                                02196000
DEBWKARA EQU   DEBPRF+20                                                02197000
DEBXCEA  EQU   DEBAPVT+16                                               02198000
DEBCEA   EQU   DEBAPVT+12                                               02199000
DEBPCIA  EQU   DEBAPVT+8                                                02200000
DEBEOEA  EQU   DEBAPVT                                                  02201000
DCBINVLA EQU   DCBINVLI+1                                               02202000
@NM00125 EQU   DCBINVCI                                                 02203000
DCBINVB2 EQU   DCBINVCI                                                 02204000
@NM00124 EQU   DCBINVCI                                                 02205000
DCBINVB1 EQU   DCBINVCI                                                 02206000
@NM00123 EQU   DCBINVCI                                                 02207000
@NM00122 EQU   DCBRESER+2                                               02208000
DCBRESB2 EQU   DCBRESER+1                                               02209000
DCBRESB1 EQU   DCBRESER                                                 02210000
DCBBUFSI EQU   IHADCS43+6                                               02211000
DCBUNTCT EQU   IHADCS43+5                                               02212000
DCBILCT  EQU   IHADCS43+4                                               02213000
DCBSCTAD EQU   DCBSCTAB+1                                               02214000
@NM00121 EQU   DCBSCTAB                                                 02215000
DCBDEBA  EQU   DCBDEBAD+1                                               02216000
@NM00120 EQU   DCBIFLGS                                                 02217000
DCBIFIOE EQU   DCBIFLGS                                                 02218000
DCBCH12  EQU   DCBIFPCT                                                 02219000
DCBCH9   EQU   DCBIFPCT                                                 02220000
DCBIFEC  EQU   DCBIFLGS                                                 02221000
DCBMFSTI EQU   DCBMFDMD                                                 02222000
DCBMFAWR EQU   DCBMFSTK                                                 02223000
DCBMFUIP EQU   DCBMFTMD                                                 02224000
DCBMFIDW EQU   DCBMFLCP                                                 02225000
DCBMFWRK EQU   DCBMFMVP                                                 02226000
DCBMFRDQ EQU   DCBMFWRT                                                 02227000
DCBMFGTQ EQU   DCBMFPUT                                                 02228000
DCBMFSTL EQU   DCBMACF2                                                 02229000
DCBMFCK  EQU   DCBMFDMG                                                 02230000
DCBMFRDX EQU   DCBMFCHK                                                 02231000
DCBMFDBF EQU   DCBMFSBG                                                 02232000
DCBMFRDI EQU   DCBMFLCG                                                 02233000
DCBMFRDK EQU   DCBMFMVG                                                 02234000
DCBMFWRQ EQU   DCBMFRD                                                  02235000
DCBMFPTQ EQU   DCBMFGET                                                 02236000
DCBMFECP EQU   DCBMACF1                                                 02237000
DCBTIOT  EQU   IHADCS25                                                 02238000
DCBMRSTI EQU   DCBMRDMD                                                 02239000
DCBMRAWR EQU   DCBMRSTK                                                 02240000
DCBMRUIP EQU   DCBMRTMD                                                 02241000
DCBMRIDW EQU   DCBMRLCP                                                 02242000
DCBMRWRK EQU   DCBMRMVP                                                 02243000
DCBMRRDQ EQU   DCBMRWRT                                                 02244000
DCBMRGTQ EQU   DCBMRPUT                                                 02245000
DCBMRSTL EQU   DCBMACR2                                                 02246000
DCBMRCK  EQU   DCBMRDMG                                                 02247000
DCBPGFXA EQU   DCBMRRDX                                                 02248000
DCBMRDBF EQU   DCBMRSBG                                                 02249000
DCBMRRDI EQU   DCBMRLCG                                                 02250000
DCBMRRDK EQU   DCBMRMVG                                                 02251000
DCBMRWRQ EQU   DCBMRRD                                                  02252000
DCBMRPTQ EQU   DCBMRGET                                                 02253000
DCBMRECP EQU   DCBMACR1                                                 02254000
@NM00119 EQU   DCBIFLG                                                  02255000
DCBIBIOE EQU   DCBIFLG                                                  02256000
DCBICH12 EQU   DCBIBPCT                                                 02257000
DCBICH9  EQU   DCBIBPCT                                                 02258000
DCBIBEC  EQU   DCBIFLG                                                  02259000
DCBOFIOF EQU   DCBOFLGS                                                 02260000
DCBOFUEX EQU   DCBOFLGS                                                 02261000
DCBOFTM  EQU   DCBOFLGS                                                 02262000
DCBOFPPC EQU   DCBOFLGS                                                 02263000
DCBOFOPN EQU   DCBOFLGS                                                 02264000
DCBOFEOV EQU   DCBOFLGS                                                 02265000
DCBOFLRB EQU   DCBOFLGS                                                 02266000
DCBOFIOD EQU   DCBOFLWR                                                 02267000
DCBDDNAM EQU   IHADCS24                                                 02268000
DCBEXLSA EQU   DCBEXLST+1                                               02269000
DCBLCBA  EQU   DCBLCBAD+1                                               02270000
DCBCPS   EQU   DCBCPRI                                                  02271000
DCBCPE   EQU   DCBCPRI                                                  02272000
DCBCPR   EQU   DCBCPRI                                                  02273000
@NM00118 EQU   DCBCPRI                                                  02274000
DCBTRANS EQU   DCBTRANA+1                                               02275000
@NM00117 EQU   DCBTRANA                                                 02276000
DCBIOBAA EQU   DCBIOBAD+1                                               02277000
DCBDEVTP EQU   DCBIOBAD                                                 02278000
@NM00116 EQU   IHADCS17+7                                               02279000
@NM00115 EQU   IHADCS17+6                                               02280000
@NM00114 EQU   IHADCS17+5                                               02281000
DCBINTVL EQU   IHADCS17+4                                               02282000
DCBCLPSA EQU   DCBCLPS+1                                                02283000
DCBBUFRQ EQU   DCBCLPS                                                  02284000
DCBBUFMA EQU   IHADCS16+8                                               02285000
@NM00113 EQU   DCBDSRG2                                                 02286000
DCBACBM  EQU   DCBDSRG2                                                 02287000
@NM00112 EQU   DCBDSRG2                                                 02288000
DCBDSGTQ EQU   DCBDSRG2                                                 02289000
DCBDSGTX EQU   DCBDSRG2                                                 02290000
DCBDSGGS EQU   DCBDSRG2                                                 02291000
DCBDSGU  EQU   DCBDSRG1                                                 02292000
DCBDSGPO EQU   DCBDSRG1                                                 02293000
@NM00111 EQU   DCBDSRG1                                                 02294000
@NM00110 EQU   DCBDSRG1                                                 02295000
DCBDSGCX EQU   DCBDSRG1                                                 02296000
DCBDSGDA EQU   DCBDSRG1                                                 02297000
DCBDSGPS EQU   DCBDSRG1                                                 02298000
DCBDSGIS EQU   DCBDSRG1                                                 02299000
DCBPCIR2 EQU   DCBPCI                                                   02300000
DCBPCIR1 EQU   DCBPCI                                                   02301000
DCBPCIN2 EQU   DCBPCI                                                   02302000
DCBPCIN1 EQU   DCBPCI                                                   02303000
DCBPCIA2 EQU   DCBPCI                                                   02304000
DCBPCIA1 EQU   DCBPCI                                                   02305000
DCBPCIX2 EQU   DCBPCI                                                   02306000
DCBPCIX1 EQU   DCBPCI                                                   02307000
@NM00109 EQU   IHADCS16+4                                               02308000
DCBMH    EQU   DCBMHA+1                                                 02309000
DCBBFOUT EQU   DCBBUFIN                                                 02310000
DCBBFIN  EQU   DCBBUFIN                                                 02311000
@NM00108 EQU   IHADCB                                                   02312000
CVTLEVL  EQU   CVTRELNO+2                                               02313000
CVTNUMB  EQU   CVTRELNO                                                 02314000
CVTMDL   EQU   CVTFIX+250                                               02315000
@NM00107 EQU   CVTFIX+248                                               02316000
@NM00106 EQU   CVTFIX                                                   02317000
CVTRV482 EQU   CVTXTNT2+128                                             02318000
CVTRV481 EQU   CVTXTNT2+124                                             02319000
CVTRV480 EQU   CVTXTNT2+120                                             02320000
CVTRV479 EQU   CVTXTNT2+118                                             02321000
CVTRV478 EQU   CVTXTNT2+117                                             02322000
CVTRV477 EQU   CVTXTNT2+116                                             02323000
CVTRV476 EQU   CVTXTNT2+115                                             02324000
CVTRV475 EQU   CVTXTNT2+114                                             02325000
CVTRV474 EQU   CVTRV466                                                 02326000
CVTRV473 EQU   CVTRV466                                                 02327000
CVTRV472 EQU   CVTRV466                                                 02328000
CVTRV471 EQU   CVTRV466                                                 02329000
CVTRV470 EQU   CVTRV466                                                 02330000
CVTRV469 EQU   CVTRV466                                                 02331000
CVTRV468 EQU   CVTRV466                                                 02332000
CVTRV467 EQU   CVTRV466                                                 02333000
CVTRV465 EQU   CVTRV457                                                 02334000
CVTRV464 EQU   CVTRV457                                                 02335000
CVTRV463 EQU   CVTRV457                                                 02336000
CVTRV462 EQU   CVTRV457                                                 02337000
CVTRV461 EQU   CVTRV457                                                 02338000
CVTRV460 EQU   CVTRV457                                                 02339000
CVTRV459 EQU   CVTRV457                                                 02340000
CVTRV458 EQU   CVTRV457                                                 02341000
CVTRV456 EQU   CVTXTNT2+108                                             02342000
CVTRV455 EQU   CVTXTNT2+104                                             02343000
CVTRV454 EQU   CVTXTNT2+100                                             02344000
CVTRV453 EQU   CVTXTNT2+96                                              02345000
CVTRV452 EQU   CVTXTNT2+94                                              02346000
CVTRV451 EQU   CVTXTNT2+92                                              02347000
CVTRV450 EQU   CVTXTNT2+90                                              02348000
CVTRV449 EQU   CVTXTNT2+88                                              02349000
CVTRV448 EQU   CVTXTNT2+87                                              02350000
CVTRV447 EQU   CVTXTNT2+86                                              02351000
CVTRV446 EQU   CVTRV438                                                 02352000
CVTRV445 EQU   CVTRV438                                                 02353000
CVTRV444 EQU   CVTRV438                                                 02354000
CVTRV443 EQU   CVTRV438                                                 02355000
CVTRV442 EQU   CVTRV438                                                 02356000
CVTRV441 EQU   CVTRV438                                                 02357000
CVTRV440 EQU   CVTRV438                                                 02358000
CVTRV439 EQU   CVTRV438                                                 02359000
CVTRV437 EQU   CVTRV429                                                 02360000
CVTRV436 EQU   CVTRV429                                                 02361000
CVTRV435 EQU   CVTRV429                                                 02362000
CVTRV434 EQU   CVTRV429                                                 02363000
CVTRV433 EQU   CVTRV429                                                 02364000
CVTRV432 EQU   CVTRV429                                                 02365000
CVTRV431 EQU   CVTRV429                                                 02366000
CVTRV430 EQU   CVTRV429                                                 02367000
CVTRV428 EQU   CVTXTNT2+80                                              02368000
CVTRV427 EQU   CVTXTNT2+76                                              02369000
CVTRV426 EQU   CVTXTNT2+72                                              02370000
CVTRV425 EQU   CVTXTNT2+68                                              02371000
CVTATACT EQU   CVTATCVT                                                 02372000
CVTRV423 EQU   CVTXTNT2+62                                              02373000
CVTRV422 EQU   CVTXTNT2+60                                              02374000
CVTRV421 EQU   CVTXTNT2+58                                              02375000
CVTRV420 EQU   CVTXTNT2+56                                              02376000
CVTRV419 EQU   CVTXTNT2+55                                              02377000
CVTRV418 EQU   CVTXTNT2+54                                              02378000
CVTRV417 EQU   CVTRV409                                                 02379000
CVTRV416 EQU   CVTRV409                                                 02380000
CVTRV415 EQU   CVTRV409                                                 02381000
CVTRV414 EQU   CVTRV409                                                 02382000
CVTRV413 EQU   CVTRV409                                                 02383000
CVTRV412 EQU   CVTRV409                                                 02384000
CVTRV411 EQU   CVTRV409                                                 02385000
CVTRV410 EQU   CVTRV409                                                 02386000
CVTRV408 EQU   CVTRV400                                                 02387000
CVTRV407 EQU   CVTRV400                                                 02388000
CVTRV406 EQU   CVTRV400                                                 02389000
CVTRV405 EQU   CVTRV400                                                 02390000
CVTRV404 EQU   CVTRV400                                                 02391000
CVTRV403 EQU   CVTRV400                                                 02392000
CVTRV402 EQU   CVTRV400                                                 02393000
CVTRV401 EQU   CVTRV400                                                 02394000
CVTICB   EQU   CVTXTNT2+48                                              02395000
CVTSKTA  EQU   CVTXTNT2+44                                              02396000
CVTSHSB  EQU   CVTSHS                                                   02397000
CVTRSV98 EQU   CVTXTNT2+36                                              02398000
CVTRSV97 EQU   CVTXTNT2+34                                              02399000
CVTRSV96 EQU   CVTXTNT2+32                                              02400000
CVTOLTEP EQU   CVTXTNT2+28                                              02401000
CVTQIDA  EQU   CVTQID+1                                                 02402000
CVTRSV95 EQU   CVTQID                                                   02403000
CVTRSV94 EQU   CVTXTNT2+20                                              02404000
CVTRSV93 EQU   CVTXTNT2+16                                              02405000
CVTRSV92 EQU   CVTXTNT2+12                                              02406000
CVTDEBVR EQU   CVTXTNT2+8                                               02407000
CVTRSV91 EQU   CVTXTNT2+6                                               02408000
CVTRSV9H EQU   CVTFLGBT                                                 02409000
CVTRSV9G EQU   CVTFLGBT                                                 02410000
CVTRSV9F EQU   CVTFLGBT                                                 02411000
CVTRSV9E EQU   CVTFLGBT                                                 02412000
CVTRSV9D EQU   CVTFLGBT                                                 02413000
CVTRSV9C EQU   CVTFLGBT                                                 02414000
CVTVME   EQU   CVTFLGBT                                                 02415000
CVTNPE   EQU   CVTFLGBT                                                 02416000
CVTNUCLS EQU   CVTXTNT2+4                                               02417000
CVTDSSVA EQU   CVTDSSV+1                                                02418000
CVTRSV89 EQU   CVTDSSV                                                  02419000
CVTRSV88 EQU   CVTXTNT1+8                                               02420000
CVTRSV87 EQU   CVTXTNT1+4                                               02421000
CVTFACHN EQU   CVTXTNT1                                                 02422000
CVTRV488 EQU   CVTMAP+412                                               02423000
CVTRV487 EQU   CVTMAP+408                                               02424000
CVTRV486 EQU   CVTMAP+404                                               02425000
CVTRV485 EQU   CVTMAP+400                                               02426000
CVTACTAP EQU   CVTMAP+396                                               02427000
CVTAUTH  EQU   CVTMAP+392                                               02428000
CVTATMCA EQU   CVTATMCT+1                                               02429000
CVTATMST EQU   CVTATMCT                                                 02430000
CVTRSV61 EQU   CVTMAP+384                                               02431000
CVTVOLT1 EQU   CVTVOLM1+1                                               02432000
CVTVOLI1 EQU   CVTVOLF1                                                 02433000
CVTSTOA  EQU   CVTMAP+376                                               02434000
CVTRSV58 EQU   CVTMAP+374                                               02435000
CVTRSV57 EQU   CVTMAP+372                                               02436000
CVTDDCE  EQU   CVTMAP+368                                               02437000
CVTPNWFR EQU   CVTMAP+364                                               02438000
CVTSMF   EQU   CVTMAP+360                                               02439000
CVTSULK  EQU   CVTMAP+358                                               02440000
CVTSLKO  EQU   CVTSYSK                                                  02441000
CVTSLKP  EQU   CVTSYSK                                                  02442000
CVTSLKQ  EQU   CVTSYSK                                                  02443000
CVTSLKR  EQU   CVTSYSK                                                  02444000
CVTRSV56 EQU   CVTSYSK                                                  02445000
CVTRSV55 EQU   CVTSYSK                                                  02446000
CVTRSV54 EQU   CVTSYSK                                                  02447000
CVTRSV53 EQU   CVTSYSK                                                  02448000
CVTRSV52 EQU   CVTA1F1                                                  02449000
CVTRSV51 EQU   CVTA1F1                                                  02450000
CVTRSV50 EQU   CVTA1F1                                                  02451000
CVTRSV49 EQU   CVTA1F1                                                  02452000
CVTRSV48 EQU   CVTA1F1                                                  02453000
CVTRSV47 EQU   CVTA1F1                                                  02454000
CVTSRSW  EQU   CVTA1F1                                                  02455000
CVTPFSW  EQU   CVTA1F1                                                  02456000
CVTPCVT  EQU   CVTMAP+352                                               02457000
CVTRSV46 EQU   CVTMAP+344                                               02458000
CVTRSV45 EQU   CVTMAP+340                                               02459000
CVTRSV44 EQU   CVTMAP+338                                               02460000
CVTRSV43 EQU   CVTMAP+336                                               02461000
CVTHJESA EQU   CVTHJES+1                                                02462000
CVTRSV42 EQU   CVTHJES                                                  02463000
CVTEXT2A EQU   CVTEXT2+1                                                02464000
CVTRSV41 EQU   CVTEXT2                                                  02465000
CVTAPFA  EQU   CVTAPF+1                                                 02466000
CVTRSV40 EQU   CVTAPF                                                   02467000
CVTRV518 EQU   CVTINTLA                                                 02468000
CVTRV517 EQU   CVTERPV                                                  02469000
CVTEORM  EQU   CVTMAP+312                                               02470000
CVTMCHPR EQU   CVTMAP+308                                               02471000
CVTTZ    EQU   CVTMAP+304                                               02472000
CVTJEPS  EQU   CVTMAP+300                                               02473000
CVTJESCT EQU   CVTMAP+296                                               02474000
CVTMODE  EQU   CVTMAP+292                                               02475000
CVTPTRV  EQU   CVTMAP+288                                               02476000
CVTREAL  EQU   CVTMAP+284                                               02477000
CVTRSV39 EQU   CVTMAP+280                                               02478000
CVTRSV38 EQU   CVTMAP+276                                               02479000
CVTDMSRA EQU   CVTDMSR+1                                                02480000
CVTRV634 EQU   CVTDMSRF                                                 02481000
CVTRV633 EQU   CVTDMSRF                                                 02482000
CVTRV632 EQU   CVTDMSRF                                                 02483000
CVTRV631 EQU   CVTDMSRF                                                 02484000
CVTRV630 EQU   CVTDMSRF                                                 02485000
CVTRV629 EQU   CVTDMSRF                                                 02486000
CVTUDUMP EQU   CVTDMSRF                                                 02487000
CVTSDUMP EQU   CVTDMSRF                                                 02488000
CVTQMSGA EQU   CVTQMSG+1                                                02489000
CVTRSV36 EQU   CVTQMSG                                                  02490000
CVTAMFF  EQU   CVTMAP+264                                               02491000
CVTPURGA EQU   CVTPURG+1                                                02492000
CVTRSV35 EQU   CVTPURG                                                  02493000
CVTCBSP  EQU   CVTMAP+256                                               02494000
CVTATERA EQU   CVTATER+1                                                02495000
CVTSYST  EQU   CVTATER                                                  02496000
CVTVOLT2 EQU   CVTTAT                                                   02497000
CVTVOLI2 EQU   CVTVOLF2                                                 02498000
CVTAQAVB EQU   CVTAQAVT+1                                               02499000
CVTRSV34 EQU   CVTTCMFG                                                 02500000
CVTRSV33 EQU   CVTTCMFG                                                 02501000
CVTRSV32 EQU   CVTTCMFG                                                 02502000
CVTRSV31 EQU   CVTTCMFG                                                 02503000
CVTRSV30 EQU   CVTTCMFG                                                 02504000
CVTRSV29 EQU   CVTTCMFG                                                 02505000
CVTRSV28 EQU   CVTTCMFG                                                 02506000
CVTTCRDY EQU   CVTTCMFG                                                 02507000
CVTGTFA  EQU   CVTGTF+1                                                 02508000
CVTRSV27 EQU   CVTGTFST                                                 02509000
CVTRNIO  EQU   CVTGTFST                                                 02510000
CVTUSR   EQU   CVTGTFST                                                 02511000
CVTRV318 EQU   CVTFORM                                                  02512000
CVTRV317 EQU   CVTTMODE                                                 02513000
CVTRV316 EQU   CVTSTATE                                                 02514000
CVTRV315 EQU   CVTGTFS                                                  02515000
CVTGTFAV EQU   CVTGTFS                                                  02516000
CVT0SCR1 EQU   CVTMAP+232                                               02517000
CVTRV515 EQU   CVTMAP+228                                               02518000
CVTRMS   EQU   CVTMAP+224                                               02519000
CVTPATCH EQU   CVTMAP+220                                               02520000
CVTTSCE  EQU   CVTMAP+216                                               02521000
CVTLNKSC EQU   CVTMAP+214                                               02522000
CVTQABST EQU   CVTMAP+212                                               02523000
CVTMDLDS EQU   CVTMAP+208                                               02524000
CVTUSER  EQU   CVTMAP+204                                               02525000
CVTABEND EQU   CVTMAP+200                                               02526000
CVTSMCA  EQU   CVTMAP+196                                               02527000
CVTRSV18 EQU   CVTMAP+192                                               02528000
CVTQLPAQ EQU   CVTMAP+188                                               02529000
CVTQCDSR EQU   CVTMAP+184                                               02530000
CVTRSV17 EQU   CVTOPTB                                                  02531000
CVTRSV16 EQU   CVTOPTB                                                  02532000
CVTFP    EQU   CVTOPTB                                                  02533000
CVTAPTHR EQU   CVTOPTB                                                  02534000
CVTNLOG  EQU   CVTOPTB                                                  02535000
CVTTOD   EQU   CVTOPTB                                                  02536000
CVTCTIMS EQU   CVTOPTB                                                  02537000
CVTPROT  EQU   CVTOPTB                                                  02538000
CVTXPFP  EQU   CVTOPTA                                                  02539000
CVTASCII EQU   CVTOPTA                                                  02540000
CVTRSV13 EQU   CVTOPTA                                                  02541000
CVTRSV12 EQU   CVTOPTA                                                  02542000
CVTNIP   EQU   CVTOPTA                                                  02543000
CVTDDR   EQU   CVTOPTA                                                  02544000
CVTAPR   EQU   CVTOPTA                                                  02545000
CVTCCH   EQU   CVTOPTA                                                  02546000
CVTSNCTR EQU   CVTMAP+180                                               02547000
CVTQMWR  EQU   CVTMAP+176                                               02548000
CVTQOCR  EQU   CVTMAP+172                                               02549000
CVT1EF00 EQU   CVTMAP+168                                               02550000
CVTMZ00  EQU   CVTMAP+164                                               02551000
CVTHEAD  EQU   CVTMAP+160                                               02552000
CVTRSV11 EQU   CVTMAP+156                                               02553000
CVTMSER  EQU   CVTMAP+148                                               02554000
CVTRV516 EQU   CVTIERLC                                                 02555000
CVTILCH  EQU   CVTMAP+140                                               02556000
CVT0DS   EQU   CVTMAP+136                                               02557000
CVTFBOSV EQU   CVTMAP+132                                               02558000
CVTNUCB  EQU   CVTMAP+128                                               02559000
CVTIOQET EQU   CVTMAP+120                                               02560000
CVTDCBA  EQU   CVTMAP+117                                               02561000
CVTMVS2  EQU   CVTDCB                                                   02562000
CVT6DAT  EQU   CVTDCB                                                   02563000
CVT4MPS  EQU   CVTDCB                                                   02564000
CVTRSV09 EQU   CVTDCB                                                   02565000
CVT4MS1  EQU   CVTDCB                                                   02566000
CVT2SPS  EQU   CVTDCB                                                   02567000
CVT1SSS  EQU   CVTDCB                                                   02568000
CVTRSV08 EQU   CVTDCB                                                   02569000
CVTSTB   EQU   CVTMAP+112                                               02570000
CVTQTD00 EQU   CVTMAP+108                                               02571000
CVTQTE00 EQU   CVTMAP+104                                               02572000
CVTCUCB  EQU   CVTMAP+100                                               02573000
CVTSJQ   EQU   CVTMAP+96                                                02574000
CVTPBLDL EQU   CVTMAP+92                                                02575000
CVTTPC   EQU   CVTMAP+88                                                02576000
CVTSVDCB EQU   CVTMAP+84                                                02577000
CVTBRET  EQU   CVTMAP+82                                                02578000
CVTEXIT  EQU   CVTMAP+80                                                02579000
CVT0FN00 EQU   CVTMAP+76                                                02580000
CVTDARA  EQU   CVTDAR+1                                                 02581000
CVTRSV07 EQU   CVTFLGS1                                                 02582000
CVTRSV06 EQU   CVTFLGS1                                                 02583000
CVTRSV05 EQU   CVTFLGS1                                                 02584000
CVTRSV04 EQU   CVTFLGS1                                                 02585000
CVTRSV03 EQU   CVTFLGS1                                                 02586000
CVTRSV02 EQU   CVTFLGS1                                                 02587000
CVTRSV01 EQU   CVTFLGS1                                                 02588000
CVTDMPLK EQU   CVTFLGS1                                                 02589000
CVTXITP  EQU   CVTMAP+68                                                02590000
CVTZDTAB EQU   CVTMAP+64                                                02591000
CVTMSLT  EQU   CVTMAP+60                                                02592000
CVTDATE  EQU   CVTMAP+56                                                02593000
CVTBTERM EQU   CVTMAP+52                                                02594000
CVTSYSAD EQU   CVTMAP+48                                                02595000
CVTXTLER EQU   CVTMAP+44                                                02596000
CVTILK2  EQU   CVTMAP+40                                                02597000
CVTILK1  EQU   CVTMAP+36                                                02598000
CVTPRLTV EQU   CVTMAP+32                                                02599000
CVTPCNVT EQU   CVTMAP+28                                                02600000
CVT0VL00 EQU   CVTMAP+24                                                02601000
CVTXAPG  EQU   CVTMAP+20                                                02602000
CVTBUF   EQU   CVTMAP+16                                                02603000
CVTJOB   EQU   CVTMAP+12                                                02604000
CVTLINK  EQU   CVTMAP+8                                                 02605000
CVT0EF00 EQU   CVTMAP+4                                                 02606000
CVTTCBP  EQU   CVTMAP                                                   02607000
CVT      EQU   CVTMAP                                                   02608000
CCWCOUNT EQU   CCW+6                                                    02609000
CCWRSV   EQU   CCW+5                                                    02610000
@NM00105 EQU   CCWFLAGS                                                 02611000
CCWIDA   EQU   CCWFLAGS                                                 02612000
CCWPCI   EQU   CCWFLAGS                                                 02613000
CCWSKIP  EQU   CCWFLAGS                                                 02614000
CCWSLI   EQU   CCWFLAGS                                                 02615000
CCWCC    EQU   CCWFLAGS                                                 02616000
CCWCD    EQU   CCWFLAGS                                                 02617000
CCWOPCDE EQU   CCW                                                      02618000
SAVTLLCB EQU   IEDNSVTD+316                                             02619000
SAVTBITN EQU   IEDNSVTD+312                                             02620000
@NM00104 EQU   SAVTCKQB+8                                               02621000
@NM00103 EQU   SAVTCKEC+1                                               02622000
@NM00102 EQU   SAVTCKCC                                                 02623000
SAVTCKPO EQU   SAVTCKCC                                                 02624000
SAVTCKWA EQU   SAVTCKCC                                                 02625000
SAVTCKCH EQU   SAVTCKTB+1                                               02626000
SAVTCKVT EQU   SAVTCKTB                                                 02627000
@NM00101 EQU   IEDNSVTD+297                                             02628000
SAVTRDFG EQU   SAVTRDRV+12                                              02629000
@NM00100 EQU   SAVTRDRV+5                                               02630000
SAVTRDPY EQU   SAVTRDRV+4                                               02631000
SAVTRDQB EQU   SAVTRDRV+1                                               02632000
SAVTRDKY EQU   SAVTRDRV                                                 02633000
SAVTNID  EQU   IEDNSVTD+280                                             02634000
SAVTDVAS EQU   IEDNSVTD+276                                             02635000
SAVTPLSZ EQU   IEDNSVTD+274                                             02636000
@NM00099 EQU   IEDNSVTD+273                                             02637000
SAVTSUBL EQU   IEDNSVTD+272                                             02638000
@NM00098 EQU   SAVTZELM+1                                               02639000
SAVTSUBM EQU   SAVTZELM                                                 02640000
SAVTMHDX EQU   IEDNSVTD+268                                             02641000
SAVTNAT1 EQU   IEDNSVTD+266                                             02642000
SAVTSH20 EQU   IEDNSVTD+264                                             02643000
SAVTLCBS EQU   IEDNSVTD+260                                             02644000
SAVTRNMP EQU   IEDNSVTD+256                                             02645000
SAVTTNTX EQU   IEDNSVTD+252                                             02646000
SAVTNAX  EQU   IEDNSVTD+248                                             02647000
SAVTSUBV EQU   IEDNSVTD+247                                             02648000
SAVTSUBA EQU   IEDNSVTD+246                                             02649000
SAVTSIBC EQU   IEDNSVTD+244                                             02650000
SAVTBSM  EQU   IEDNSVTD+240                                             02651000
SAVTSCPT EQU   SAVTTCPU                                                 02652000
SAVTRQTG EQU   IEDNSVTD+236                                             02653000
SAVTRQCH EQU   IEDNSVTD+232                                             02654000
SAVTMAND EQU   IEDNSVTD+228                                             02655000
SAVTSPLN EQU   IEDNSVTD+224                                             02656000
SAVTNADL EQU   IEDNSVTD+222                                             02657000
SAVTNATL EQU   IEDNSVTD+220                                             02658000
SAVTMHTB EQU   IEDNSVTD+216                                             02659000
SAVTSSMH EQU   IEDNSVTD+212                                             02660000
SAVTQRS  EQU   IEDNSVTD+208                                             02661000
SAVTRQIN EQU   IEDNSVTD+204                                             02662000
SAVTDFCO EQU   IEDNSVTD+200                                             02663000
SAVTSAO  EQU   IEDNSVTD+196                                             02664000
SAVTSARI EQU   IEDNSVTD+192                                             02665000
SAVTSAC  EQU   IEDNSVTD+188                                             02666000
SAVTSAI  EQU   IEDNSVTD+184                                             02667000
SAVTCSCI EQU   IEDNSVTD+180                                             02668000
SAVTSSRP EQU   IEDNSVTD+176                                             02669000
SAVTSSRQ EQU   IEDNSVTD+172                                             02670000
SAVTSCLU EQU   IEDNSVTD+168                                             02671000
SAVTXTRQ EQU   IEDNSVTD+164                                             02672000
SAVTMVBF EQU   IEDNSVTD+160                                             02673000
@NM00097 EQU   IEDNSVTD+148                                             02674000
SAVTIPCQ EQU   IEDNSVTD+144                                             02675000
@NM00096 EQU   IEDNSVTD+136                                             02676000
SAVTXFMI EQU   IEDNSVTD+132                                             02677000
@NM00095 EQU   IEDNSVTD+124                                             02678000
SAVTXFMO EQU   IEDNSVTD+120                                             02679000
@NM00094 EQU   IEDNSVTD+116                                             02680000
SAVTSSSR EQU   IEDNSVTD+112                                             02681000
SAVTSCPQ EQU   IEDNSVTD+108                                             02682000
SAVTSLCB EQU   IEDNSVTD+104                                             02683000
SAVTLUSR EQU   IEDNSVTD+100                                             02684000
@NM00093 EQU   SAVTLUSQ+8                                               02685000
SAVTLUSP EQU   SAVTLUSQ+4                                               02686000
SAVTLUSB EQU   SAVTLUSQ                                                 02687000
@NM00092 EQU   IEDNSVTD+84                                              02688000
SAVTSAT  EQU   IEDNSVTD+80                                              02689000
SAVTNAT  EQU   IEDNSVTD+76                                              02690000
SAVTCLUP EQU   IEDNSVTD+72                                              02691000
SAVTPIUT EQU   IEDNSVTD+68                                              02692000
SAVTRNTA EQU   IEDNSVTD+64                                              02693000
SAVTDNIR EQU   IEDNSVTD+60                                              02694000
SAVTCNIR EQU   IEDNSVTD+56                                              02695000
SAVTFLDH EQU   IEDNSVTD+52                                              02696000
SAVTSRTN EQU   IEDNSVTD+48                                              02697000
SAVTSREQ EQU   IEDNSVTD+44                                              02698000
SAVTFAIL EQU   IEDNSVTD+42                                              02699000
SAVTSUSE EQU   IEDNSVTD+40                                              02700000
SAVTSIB  EQU   IEDNSVTD+36                                              02701000
SAVTPRTN EQU   IEDNSVTD+32                                              02702000
@NM00091 EQU   IEDNSVTD+28                                              02703000
SAVTWH20 EQU   IEDNSVTD+26                                              02704000
SAVTPWT  EQU   IEDNSVTD+24                                              02705000
SAVTPRTQ EQU   IEDNSVTD+20                                              02706000
SAVTPREQ EQU   IEDNSVTD+16                                              02707000
SAVTPH20 EQU   IEDNSVTD+14                                              02708000
SAVTPUSE EQU   IEDNSVTD+12                                              02709000
SAVTPLCB EQU   IEDNSVTD+8                                               02710000
SAVTPOOL EQU   IEDNSVTD+4                                               02711000
SAVTPRMT EQU   SAVTDIAF                                                 02712000
SAVTVIRT EQU   SAVTDIAF                                                 02713000
AVTCPBNO EQU   IEDQAVTD+1244                                            02714000
AVTHRESS EQU   IEDQAVTD+1243                                            02715000
@NM00090 EQU   IEDQAVTD+1242                                            02716000
@NM00089 EQU   IEDQAVTD+1241                                            02717000
@NM00088 EQU   IEDQAVTD+1240                                            02718000
@NM00087 EQU   IEDQAVTD+1237                                            02719000
@NM00086 EQU   IEDQAVTD+1236                                            02720000
AVTHRESE EQU   @NM00085                                                 02721000
AVTRADDR EQU   IEDQAVTD+1228                                            02722000
AVTNADDR EQU   IEDQAVTD+1224                                            02723000
AVTHRESN EQU   IEDQAVTD+1220                                            02724000
AVTVOLRN EQU   IEDQAVTD+1216                                            02725000
AVTTOTNN EQU   IEDQAVTD+1212                                            02726000
AVTTRCYN EQU   IEDQAVTD+1208                                            02727000
AVTRCTRN EQU   IEDQAVTD+1204                                            02728000
AVTNOVON EQU   IEDQAVTD+1200                                            02729000
AVTADEBN EQU   IEDQAVTD+1196                                            02730000
AVTVOLRR EQU   IEDQAVTD+1192                                            02731000
AVTTOTNR EQU   IEDQAVTD+1188                                            02732000
AVTTRCYR EQU   IEDQAVTD+1184                                            02733000
AVTRCTRR EQU   IEDQAVTD+1180                                            02734000
AVTNOVOR EQU   IEDQAVTD+1176                                            02735000
AVTADEBR EQU   IEDQAVTD+1172                                            02736000
AVTLODPT EQU   IEDQAVTD+1168                                            02737000
AVTIOBN  EQU   IEDQAVTD+1164                                            02738000
AVTIOBR  EQU   IEDQAVTD+1160                                            02739000
AVTCPBPT EQU   IEDQAVTD+1156                                            02740000
AVTFCPB  EQU   IEDQAVTD+1152                                            02741000
@NM00084 EQU   IEDQAVTD+1148                                            02742000
AVTINCPQ EQU   IEDQAVTD+1144                                            02743000
@NM00083 EQU   IEDQAVTD+1140                                            02744000
@NM00082 EQU   IEDQAVTD+1137                                            02745000
@NM00081 EQU   AVTBIT4                                                  02746000
@NM00080 EQU   AVTBIT4                                                  02747000
@NM00079 EQU   AVTBIT4                                                  02748000
@NM00078 EQU   AVTBIT4                                                  02749000
@NM00077 EQU   AVTBIT4                                                  02750000
@NM00076 EQU   AVTBIT4                                                  02751000
@NM00075 EQU   AVTBIT4                                                  02752000
AVTRUFTN EQU   AVTBIT4                                                  02753000
@NM00074 EQU   IEDQAVTD+1132                                            02754000
AVTNOBFQ EQU   IEDQAVTD+1128                                            02755000
@NM00073 EQU   IEDQAVTD+1124                                            02756000
AVTDKENQ EQU   IEDQAVTD+1120                                            02757000
@NM00072 EQU   IEDQAVTD+1116                                            02758000
AVTDKAPQ EQU   IEDQAVTD+1112                                            02759000
AVTCOPY  EQU   IEDQAVTD+1108                                            02760000
AVTIA    EQU   IEDQAVTD+1104                                            02761000
AVTFL    EQU   IEDQAVTD+1100                                            02762000
@NM00071 EQU   IEDQAVTD+1096                                            02763000
AVTNCPBQ EQU   IEDQAVTD+1092                                            02764000
AVTTOTNC EQU   IEDQAVTD+1088                                            02765000
AVTCMAX  EQU   IEDQAVTD+1084                                            02766000
AVTCMIN  EQU   IEDQAVTD+1080                                            02767000
AVTHM02  EQU   IEDQAVTD+1076                                            02768000
AVTOPCIN EQU   IEDQAVTD+1074                                            02769000
AVTDCTLN EQU   IEDQAVTD+1072                                            02770000
AVTOPMSK EQU   IEDQAVTD+1068                                            02771000
AVTDDFT  EQU   IEDQAVTD+1064                                            02772000
AVTSTEAL EQU   IEDQAVTD+1060                                            02773000
AVTOPTN  EQU   IEDQAVTD+1056                                            02774000
AVTDSKCT EQU   IEDQAVTD+1054                                            02775000
AVTCKRST EQU   IEDQAVTD+1053                                            02776000
AVTSTAN  EQU   AVTBIT3                                                  02777000
AVTSTACN EQU   AVTBIT3                                                  02778000
AVTSTAIN EQU   AVTBIT3                                                  02779000
AVTSTAYN EQU   AVTBIT3                                                  02780000
AVTOLTBN EQU   AVTBIT3                                                  02781000
AVTTSAB  EQU   AVTBIT3                                                  02782000
AVTRFULN EQU   AVTBIT3                                                  02783000
AVTRECVN EQU   AVTBIT3                                                  02784000
@NM00070 EQU   AVTBIT2                                                  02785000
@NM00069 EQU   AVTBIT2                                                  02786000
AVTOPEIN EQU   AVTBIT2                                                  02787000
AVTSTRTN EQU   AVTBIT2                                                  02788000
AVTTOPOL EQU   AVTBIT2                                                  02789000
AVTCOPYN EQU   AVTBIT2                                                  02790000
AVTREUSN EQU   AVTBIT2                                                  02791000
AVTEXTSC EQU   AVTBIT2                                                  02792000
AVTDISKN EQU   AVTBIT1                                                  02793000
AVTQUCKN EQU   AVTBIT1                                                  02794000
AVTCLOSN EQU   AVTBIT1                                                  02795000
AVTREADN EQU   AVTBIT1                                                  02796000
AVTDLAYN EQU   AVTBIT1                                                  02797000
AVTAQTAN EQU   AVTBIT1                                                  02798000
AVTTSON  EQU   AVTBIT1                                                  02799000
AVTAPLKN EQU   AVTBIT1                                                  02800000
AVTDUMBR EQU   IEDQAVTD+1048                                            02801000
AVTDLQX  EQU   IEDQAVTD+1046                                            02802000
AVTINTLV EQU   IEDQAVTD+1044                                            02803000
AVTSMCNT EQU   IEDQAVTD+1042                                            02804000
AVTAVFCT EQU   IEDQAVTD+1040                                            02805000
AVTOPCON EQU   IEDQAVTD+1038                                            02806000
AVTOPCNT EQU   IEDQAVTD+1036                                            02807000
AVTLNCNT EQU   IEDQAVTD+1034                                            02808000
AVTKEYLE EQU   IEDQAVTD+1032                                            02809000
AVTHA16  EQU   IEDQAVTD+1030                                            02810000
AVTHA7   EQU   IEDQAVTD+1028                                            02811000
AVTHA4   EQU   IEDQAVTD+1026                                            02812000
AVTHA3   EQU   IEDQAVTD+1024                                            02813000
AVTHA2   EQU   IEDQAVTD+1022                                            02814000
AVTGETMS EQU   IEDQAVTD+1021                                            02815000
@NM00068 EQU   IEDQAVTD+1020                                            02816000
AVTGETMD EQU   IEDQAVTD+1016                                            02817000
AVTGETMN EQU   IEDQAVTD+1012                                            02818000
AVTCWTOT EQU   IEDQAVTD+1008                                            02819000
AVTCWINT EQU   IEDQAVTD+956                                             02820000
AVTDTRAP EQU   IEDQAVTD+952                                             02821000
@NM00067 EQU   IEDQAVTD+950                                             02822000
@NM00066 EQU   AVTIOTR                                                  02823000
AVTIOTRH EQU   AVTIOTR                                                  02824000
AVTIOTRE EQU   AVTIOTR                                                  02825000
@NM00065 EQU   AVTSUBT                                                  02826000
AVTSUBPT EQU   AVTSUBT                                                  02827000
AVTSUBON EQU   AVTSUBT                                                  02828000
AVTAFE30 EQU   IEDQAVTD+944                                             02829000
AVTAFE20 EQU   IEDQAVTD+940                                             02830000
AVTAFE10 EQU   IEDQAVTD+936                                             02831000
AVTCWEC2 EQU   IEDQAVTD+932                                             02832000
AVTCWPM2 EQU   IEDQAVTD+928                                             02833000
AVTCWTS2 EQU   IEDQAVTD+927                                             02834000
AVTCWTS1 EQU   IEDQAVTD+926                                             02835000
AVTCWCLD EQU   AVTCWFL2                                                 02836000
AVTCWRAP EQU   AVTCWFL2                                                 02837000
@NM00064 EQU   AVTCWFL2                                                 02838000
@NM00063 EQU   AVTCWFL2                                                 02839000
@NM00062 EQU   AVTCWFL2                                                 02840000
@NM00061 EQU   AVTCWFL2                                                 02841000
@NM00060 EQU   AVTCWFL2                                                 02842000
AVTCWACT EQU   AVTCWFL2                                                 02843000
@NM00059 EQU   AVTCWFL1                                                 02844000
@NM00058 EQU   AVTCWFL1                                                 02845000
@NM00057 EQU   AVTCWFL1                                                 02846000
@NM00056 EQU   AVTCWFL1                                                 02847000
@NM00055 EQU   AVTCWFL1                                                 02848000
@NM00054 EQU   AVTCWFL1                                                 02849000
@NM00053 EQU   AVTCWFL1                                                 02850000
AVTCOMWN EQU   AVTCWFL1                                                 02851000
AVTCWEC1 EQU   IEDQAVTD+920                                             02852000
AVTCWPM1 EQU   IEDQAVTD+916                                             02853000
AVTCAREA EQU   IEDQAVTD+912                                             02854000
AVTFZERO EQU   IEDQAVTD+908                                             02855000
AVTCADDR EQU   IEDQAVTD+904                                             02856000
AVTCOREC EQU   IEDQAVTD+900                                             02857000
@NM00052 EQU   IEDQAVTD+892                                             02858000
AVTCPBCB EQU   IEDQAVTD+888                                             02859000
@NM00051 EQU   IEDQAVTD+880                                             02860000
AVTDSIOB EQU   IEDQAVTD+876                                             02861000
@NM00050 EQU   IEDQAVTD+868                                             02862000
AVTCPRMB EQU   IEDQAVTD+864                                             02863000
@NM00049 EQU   IEDQAVTD+856                                             02864000
AVTCLOSB EQU   IEDQAVTD+852                                             02865000
@NM00048 EQU   IEDQAVTD+844                                             02866000
AVTACTIB EQU   IEDQAVTD+840                                             02867000
@NM00047 EQU   IEDQAVTD+836                                             02868000
AVTOLTEB EQU   IEDQAVTD+832                                             02869000
AVTOLTCH EQU   AVTOLTQB+1                                               02870000
AVTOLTVT EQU   AVTOLTQB                                                 02871000
@NM00046 EQU   AVTOPCQB+8                                               02872000
@NM00045 EQU   AVTOPCEC+1                                               02873000
@NM00044 EQU   AVTOPCCC                                                 02874000
AVTOPCPO EQU   AVTOPCCC                                                 02875000
AVTOPCWA EQU   AVTOPCCC                                                 02876000
AVTOPCCH EQU   AVTOPCOB+1                                               02877000
AVTOPCVT EQU   AVTOPCOB                                                 02878000
@NM00043 EQU   AVTCKPQB+9                                               02879000
AVTCKPTS EQU   AVTCKPQB+8                                               02880000
@NM00042 EQU   AVTCKPEC+1                                               02881000
@NM00041 EQU   AVTCKPCC                                                 02882000
AVTCKPPO EQU   AVTCKPCC                                                 02883000
AVTCKPWA EQU   AVTCKPCC                                                 02884000
AVTCKPCH EQU   AVTCKPTB+1                                               02885000
AVTCKPVT EQU   AVTCKPTB                                                 02886000
@NM00040 EQU   IEDQAVTD+796                                             02887000
AVTBFRTB EQU   IEDQAVTD+792                                             02888000
@NM00039 EQU   IEDQAVTD+788                                             02889000
AVTSELCH EQU   IEDQAVTD+785                                             02890000
AVTBFRTN EQU   AVTBFRFG                                                 02891000
AVTBFREB EQU   IEDQAVTD+780                                             02892000
AVTTIMQ  EQU   IEDQAVTD+776                                             02893000
@NM00038 EQU   IEDQAVTD+772                                             02894000
AVTIMQPS EQU   IEDQAVTD+768                                             02895000
AVTINOUT EQU   IEDQAVTD+766                                             02896000
AVTREFTM EQU   IEDQAVTD+764                                             02897000
@NM00037 EQU   IEDQAVTD+752                                             02898000
AVTDELYB EQU   IEDQAVTD+748                                             02899000
AVTOCQPT EQU   IEDQAVTD+744                                             02900000
AVTTSOPT EQU   IEDQAVTD+740                                             02901000
AVTSUPPT EQU   IEDQAVTD+736                                             02902000
AVTCBQCB EQU   IEDQAVTD+732                                             02903000
AVTMSGS  EQU   IEDQAVTD+729                                             02904000
@NM00036 EQU   AVTSYSER                                                 02905000
@NM00035 EQU   AVTSYSER                                                 02906000
@NM00034 EQU   AVTSYSER                                                 02907000
@NM00033 EQU   AVTSYSER                                                 02908000
@NM00032 EQU   AVTSYSER                                                 02909000
@NM00031 EQU   AVTSYSER                                                 02910000
AVTCMAXN EQU   AVTSYSER                                                 02911000
AVTCMINN EQU   AVTSYSER                                                 02912000
AVTABEPL EQU   AVTADBUF                                                 02913000
AVTHFF   EQU   AVTCLRHI+2                                               02914000
@NM00030 EQU   AVTCLRHI                                                 02915000
AVTCCLNK EQU   AVTCRELE+5                                               02916000
AVTCCPRI EQU   AVTCRELE+4                                               02917000
AVTCCQCB EQU   AVTCCELE+1                                               02918000
AVTCCKEY EQU   AVTCCELE                                                 02919000
AVTDELAD EQU   IEDQAVTD+704                                             02920000
AVTDELEM EQU   IEDQAVTD+700                                             02921000
AVTBSX   EQU   AVTCKLNK                                                 02922000
AVTOPETR EQU   AVTHG01                                                  02923000
@NM00029 EQU   AVTCKBYT                                                 02924000
AVTCKONQ EQU   AVTCKBYT                                                 02925000
@NM00028 EQU   AVTCKBYT                                                 02926000
@NM00027 EQU   AVTCKBYT                                                 02927000
@NM00026 EQU   AVTCKBYT                                                 02928000
@NM00025 EQU   AVTCKBYT                                                 02929000
@NM00024 EQU   AVTCKBYT                                                 02930000
@NM00023 EQU   AVTCKBYT                                                 02931000
AVTOPERT EQU   IEDQAVTD+690                                             02932000
AVTOPXCL EQU   IEDQAVTD+688                                             02933000
AVTOPERL EQU   IEDQAVTD+687                                             02934000
@NM00022 EQU   IEDQAVTD+686                                             02935000
AVTCKTIM EQU   IEDQAVTD+684                                             02936000
AVTCKELV EQU   IEDQAVTD+682                                             02937000
AVTCPRCD EQU   IEDQAVTD+681                                             02938000
AVTWARMN EQU   AVTCKELF                                                 02939000
AVTCRTLN EQU   AVTCKELF                                                 02940000
AVTCPIPN EQU   AVTCKELF                                                 02941000
AVTCCLCN EQU   AVTCKELF                                                 02942000
AVTCINCN EQU   AVTCKELF                                                 02943000
@NM00021 EQU   AVTCKELF                                                 02944000
AVTCMCPN EQU   AVTCKELF                                                 02945000
AVTNQBCK EQU   AVTCKELF                                                 02946000
AVTCKQAD EQU   IEDQAVTD+677                                             02947000
AVTSCBSZ EQU   IEDQAVTD+676                                             02948000
@NM00020 EQU   IEDQAVTD+672                                             02949000
AVTCKELE EQU   IEDQAVTD+668                                             02950000
@NM00019 EQU   AVTCKPEL+8                                               02951000
AVTCKRLK EQU   AVTCKPEL+5                                               02952000
AVTCKRPR EQU   AVTCKPEL+4                                               02953000
AVTCKRMQ EQU   AVTCKRMV+1                                               02954000
AVTCKRKY EQU   AVTCKRMV                                                 02955000
AVTHK    EQU   IEDQAVTD+648                                             02956000
AVTHI    EQU   IEDQAVTD+644                                             02957000
AVTNX    EQU   IEDQAVTD+636                                             02958000
AVTTONE  EQU   IEDQAVTD+632                                             02959000
AVTA3TL  EQU   IEDQAVTD+628                                             02960000
AVTDMECB EQU   IEDQAVTD+624                                             02961000
AVTABEND EQU   IEDQAVTD+618                                             02962000
AVTPLCBN EQU   IEDQAVTD+616                                             02963000
@NM00018 EQU   AVTSAVTP+1                                               02964000
@NM00017 EQU   AVTSAVTF                                                 02965000
AVTSNA   EQU   AVTSAVTF                                                 02966000
AVTONSNA EQU   AVTSAVTF                                                 02967000
AVTVTMCP EQU   AVTSAVTF                                                 02968000
@NM00016 EQU   IEDQAVTD+608                                             02969000
AVTCMBSS EQU   IEDQAVTD+604                                             02970000
AVTRCV   EQU   IEDQAVTD+600                                             02971000
AVTSEND  EQU   IEDQAVTD+596                                             02972000
AVTCSCH  EQU   IEDQAVTD+592                                             02973000
AVTQ1    EQU   IEDQAVTD+588                                             02974000
AVTE7    EQU   IEDQAVTD+584                                             02975000
AVTHB    EQU   IEDQAVTD+580                                             02976000
AVTR1    EQU   IEDQAVTD+576                                             02977000
AVTBZ    EQU   IEDQAVTD+572                                             02978000
AVTEZ    EQU   IEDQAVTD+568                                             02979000
AVTEC    EQU   IEDQAVTD+564                                             02980000
AVTEW    EQU   IEDQAVTD+560                                             02981000
AVTNDIAL EQU   AVTSCOPT                                                 02982000
AVTN2741 EQU   AVTSCOPT                                                 02983000
AVTCONCO EQU   AVTSCOPT                                                 02984000
AVTCONC  EQU   AVTSCOPT                                                 02985000
AVTCMBUF EQU   AVTSCOPT                                                 02986000
AVTAPDMP EQU   AVTSCOPT                                                 02987000
@NM00015 EQU   AVTSCOPT                                                 02988000
AVTHA    EQU   AVTDISP                                                  02989000
AVTEA    EQU   IEDQAVTD+548                                             02990000
AVTAX    EQU   IEDQAVTD+544                                             02991000
AVTA3    EQU   IEDQAVTD+540                                             02992000
AVTGD    EQU   IEDQAVTD+536                                             02993000
AVTAL    EQU   IEDQAVTD+532                                             02994000
AVTOLTST EQU   AVTHG02                                                  02995000
AVTE8    EQU   IEDQAVTD+524                                             02996000
AVTUI    EQU   IEDQAVTD+520                                             02997000
AVTCOMPT EQU   IEDQAVTD+516                                             02998000
AVTCRSRF EQU   IEDQAVTD+512                                             02999000
@NM00014 EQU   IEDQAVTD+508                                             03000000
AVTKA02  EQU   IEDQAVTD+504                                             03001000
AVTOPTPT EQU   IEDQAVTD+500                                             03002000
AVTPCBPT EQU   IEDQAVTD+496                                             03003000
@NM00013 EQU   AVTECB1                                                  03004000
AVTCOMP  EQU   AVTECB1                                                  03005000
@NM00012 EQU   AVTECB1                                                  03006000
AVTOPECA EQU   IEDQAVTD+488                                             03007000
AVTOLECA EQU   IEDQAVTD+484                                             03008000
AVTCKECA EQU   IEDQAVTD+480                                             03009000
AVTCWECA EQU   IEDQAVTD+476                                             03010000
AVTCWTCB EQU   IEDQAVTD+472                                             03011000
AVTOLTCB EQU   IEDQAVTD+468                                             03012000
AVTOCTCB EQU   IEDQAVTD+464                                             03013000
AVTCKTCB EQU   IEDQAVTD+460                                             03014000
AVTAS    EQU   IEDQAVTD+456                                             03015000
AVTNOLBF EQU   IEDQAVTD+454                                             03016000
AVTNCKPR EQU   IEDQAVTD+453                                             03017000
AVTCIB   EQU   IEDQAVTD+452                                             03018000
AVTSPLPT EQU   IEDQAVTD+448                                             03019000
AVTMVBFR EQU   IEDQAVTD+444                                             03020000
AVTSBTA  EQU   IEDQAVTD+440                                             03021000
AVTRARTN EQU   IEDQAVTD+436                                             03022000
AVTBSCAN EQU   IEDQAVTD+432                                             03023000
AVTRDYA  EQU   IEDQAVTD+428                                             03024000
AVTDISTR EQU   IEDQAVTD+420                                             03025000
AVTPARM3 EQU   IEDQAVTD+416                                             03026000
@NM00011 EQU   AVTPKF                                                   03027000
@NM00010 EQU   AVTPKF                                                   03028000
@NM00009 EQU   AVTPKF                                                   03029000
AVTFTCHF EQU   AVTPKF                                                   03030000
@NM00008 EQU   AVTPKF                                                   03031000
@NM00007 EQU   AVTPKF                                                   03032000
@NM00006 EQU   AVTPKF                                                   03033000
@NM00005 EQU   AVTPKF                                                   03034000
AVTPARM  EQU   IEDQAVTD+408                                             03035000
AVTEXS2A EQU   IEDQAVTD+402                                             03036000
AVTEXA2S EQU   IEDQAVTD+396                                             03037000
AVTOCGET EQU   IEDQAVTD+392                                             03038000
AVTCKAVT EQU   @NM00003+1                                               03039000
@NM00004 EQU   AVTCKFLG                                                 03040000
AVTCKHLT EQU   AVTCKFLG                                                 03041000
AVTCKREQ EQU   AVTCKFLG                                                 03042000
AVTCKENV EQU   AVTCKFLG                                                 03043000
AVTCKNAC EQU   AVTCKFLG                                                 03044000
AVTCKTAC EQU   AVTCKFLG                                                 03045000
@NM00002 EQU   IEDQAVTD+384                                             03046000
AVTREADD EQU   IEDQAVTD+380                                             03047000
AVTREADY EQU   IEDQAVTD+376                                             03048000
AVTRACE  EQU   IEDQAVTD+372                                             03049000
AVTPASWD EQU   IEDQAVTD+360                                             03050000
AVTCTLCH EQU   IEDQAVTD+352                                             03051000
AVTDOUBL EQU   IEDQAVTD+344                                             03052000
AVTDOUBX EQU   IEDQAVTD+336                                             03053000
AVTDPARM EQU   IEDQAVTD+332                                             03054000
AVTCSTCS EQU   IEDQAVTD+328                                             03055000
AVTDLQ   EQU   AVTSAVEX+32                                              03056000
@NM00001 EQU   AVTSAVEX                                                 03057000
AVTSAVE4 EQU   IEDQAVTD+216                                             03058000
AVTSAVE3 EQU   IEDQAVTD+144                                             03059000
AVTSAVE2 EQU   IEDQAVTD+72                                              03060000
AVTSAVE1 EQU   IEDQAVTD                                                 03061000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03062000
@RF00367 EQU   @EL00004                                                 03063000
@RF00370 EQU   @EL00004                                                 03064000
@RF00379 EQU   @EL00005                                                 03065000
@RF00384 EQU   @EL00005                                                 03066000
@RC00387 EQU   @EL00005                                                 03067000
@RF00426 EQU   @EL00005                                                 03068000
@PB00005 EQU   @EL00001                                                 03069000
@PB00004 EQU   @PB00005                                                 03070000
@RC00389 EQU   @RC00387                                                 03071000
@PB00003 EQU   @PB00004                                                 03072000
@PB00002 EQU   @PB00003                                                 03073000
@ENDDATA EQU   *                                                        03074000
         END   IGG019R5,(C'PLS2305',0701,77312)                         03075000
