         TITLE 'IGG019TI - FIRST LEVEL DATA HANDLER                    *00001000
                        '                                               00002000
IGG019TI CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
*                                   /*                                  00005000
*        FIRST LEVEL DATA HANDLER QCB - 3 WORDS                         00006000
         DC    A(0)                     ELEMENT CHAIN                   00007000
         DC    A(0)                     LINK                            00008000
         DC    AL1(06)                  STCB VTO                        00009000
         DC    AL3(*-1)                 STCB POINTER                    00010000
         USING IGG019TI,RBASE           MODULE ADDRESSABILITY           00011000
*   RBASE=RQCB;                     /* SET BASE REGISTER - REGISTER 7   00012000
*                                      AT ENTRY POINTS TO QCB AT        00013000
*                                      OFFSET +0 IN THIS MODULE      */ 00014000
         LR    RBASE,RQCB                                       02S0272 00015000
*   RFY                                                         02S0273 00016000
*     RQCB UNRSTD;                                              02S0273 00017000
*   GEN NOREFS NOSETS NOEXIT SEQFLOW;                           02S0274 00018000
IGG019TI IEDHJN AFTERHJN,HJN            IDENTIFICATION MACRO            00019000
*   IF RINPUT->PRFPRI=PRIAIPL THEN  /* IF INPUT IS LCB       @YM02949*/ 00020000
         CLI   PRFPRI(RINPUT),X'DE'                             02S0275 00021000
         BNE   @RF00275                                         02S0275 00022000
*     DO;                           /* POST OPRE TO OPERATOR CONTROL    00023000
*                                                            @YM02949*/ 00024000
*       RLCB=RINPUT;                /* GET LCB ADDRESS       @YM02949*/ 00025000
         LR    RLCB,RINPUT                                      02S0277 00026000
*       RPARM=CPAOPRE;              /* GET OPRE ADDRESS      @YM02949*/ 00027000
         L     RPARM,CPAOPRE(,RLCB)                             02S0278 00028000
*       CALL DSPPOST;               /* POST OPRE TO OPERATOR CONTROL    00029000
*                                                            @YM02949*/ 00030000
         LA    @15,DSPPOST(,RDISP)                              02S0279 00031000
         BALR  @14,@15                                          02S0279 00032000
*     END;                          /*                       @YM02949*/ 00033000
*                                                               02S0281 00034000
*   /*****************************************************************/ 00035000
*   /*                                                               */ 00036000
*   /* PROCESS: THIS SEGMENT DOES THE PROCESSING THAT IS NECESSARY TO*/ 00037000
*   /* PERFORM THE FUNCTION OF THE MODULE.                           */ 00038000
*   /*                                                               */ 00039000
*   /*****************************************************************/ 00040000
*                                                               02S0281 00041000
*                                                               03S0281 00042000
*   /*****************************************************************/ 00043000
*   /*                                                               */ 00044000
*   /* PROCESS.ENTRY: AT ENTRY ESTABLISH THE LCB ADDRESS, MOVE THE   */ 00045000
*   /* FIRST CCW BACK INTO THE UNIT FROM THE PREFIX, AND INITIALIZE  */ 00046000
*   /* THE FREE QUEUE POINTER AND THE INTERNAL STATE VALUES.         */ 00047000
*   /*                                                               */ 00048000
*   /*****************************************************************/ 00049000
*                                                               03S0281 00050000
*   RPIU=RINPUT&CLRHI;              /* GET POINTER TO FIRST PIU (AND    00051000
*                                      CLEAR HI ORDER BYTE)          */ 00052000
@RF00275 LR    RPIU,RINPUT                                      03S0281 00053000
         N     RPIU,@CF01470                                    03S0281 00054000
*   RUNIT=RPIU-LENGTH(IEDQCCW);     /* GET ADDR OF CCW IN PREFIX TO     00055000
*                                      THE 1ST PIU                   */ 00056000
         LR    @10,RPIU                                         03S0282 00057000
         SL    @10,@CF00044                                     03S0282 00058000
         LR    RUNIT,@10                                        03S0282 00059000
*   RLCB=PRF1WD2;                   /* GET 3705 LCB ADDR SAVED BY TH    00060000
*                                                            @OZ26333*/ 00061000
         L     RLCB,PRF1WD2(,@10)                               03S0283 00062000
*   PRFRCB=RUNIT->CCW;              /* RESTORE CCW FROM PREFIX TO       00063000
*                                      START OF THE PIU              */ 00064000
         MVC   PRFRCB(8,RPIU),CCW(RUNIT)                        03S0284 00065000
*   LCBFSBFR=ZERO;                  /* RESET FREE QUEUE POINTER      */ 00066000
         SLR   @10,@10                                          03S0285 00067000
         STCM  @10,7,LCBFSBFR(RLCB)                             03S0285 00068000
*   RSTATE=NOSTATE;                 /* INITIALIZE INTERNAL STATE        00069000
*                                      VALUES                @YM03702*/ 00070000
         SLR   RSTATE,RSTATE                                    03S0286 00071000
*   RUNIT=RPIU;                     /* SET CURRENT UNIT POINTER TO      00072000
*                                      CURRENT PIU POINTER           */ 00073000
         LR    RUNIT,RPIU                                       03S0287 00074000
*   RFY                                                         03S0288 00075000
*     RINPUT UNRSTD;                                            03S0288 00076000
*   IF PRFOPCDE=CCWWRITE|           /* TEST 1ST CCW IN CHANNEL ...   */ 00077000
*       PRFOPCDE=CCWBRK THEN        /* ... PROGRAM FOR A WRITE       */ 00078000
         CLI   PRFOPCDE(RPIU),X'01'                             02S0289 00079000
         BE    @RT00289                                         02S0289 00080000
         CLI   PRFOPCDE(RPIU),X'09'                             02S0289 00081000
         BNE   @RF00289                                         02S0289 00082000
@RT00289 DS    0H                                               02S0290 00083000
*     DO;                           /* PROCESS WRITE PIU'S           */ 00084000
*                                                               03S0291 00085000
*       /*************************************************************/ 00086000
*       /*                                                           */ 00087000
*       /* PROCESS.WRITEPIU: PROCESS EACH WRITE PIU IN THE CHANNEL   */ 00088000
*       /* PROGRAM. THOSE PIU'S WHICH WERE NOT TRANSMITTED           */ 00089000
*       /* SUCCESSFULLY ARE REENQUEUED FOR LATER TRANSMISSION. THE   */ 00090000
*       /* UNITS OF THOSE WHICH WERE TRANSMITTED SUCCESSFULLY ARE    */ 00091000
*       /* PLACED ON THE FREE QUEUE.                                 */ 00092000
*       /*                                                           */ 00093000
*       /*************************************************************/ 00094000
*                                                               03S0291 00095000
*       IF(LCBCSWCA-LENGTH(IEDQCCW))->CCWOPCDE=CCWWS0|/* IF INTERRUPT   00096000
*                                      IS ON A WRITE START CCW THEN     00097000
*                                                            @YM09094*/ 00098000
*           (LCBCSWCA-LENGTH(IEDQCCW))->CCWOPCDE=CCWWS1 THEN/*  03S0291 00099000
*                                                            @YM09094*/ 00100000
         L     @10,LCBCSWCA-1(,RLCB)                            03S0291 00101000
         LA    @10,0(,@10)                                      03S0291 00102000
         SL    @10,@CF00044                                     03S0291 00103000
         CLI   CCWOPCDE(@10),X'31'                              03S0291 00104000
         BE    @RT00291                                         03S0291 00105000
         CLI   CCWOPCDE(@10),X'51'                              03S0291 00106000
         BNE   @RF00291                                         03S0291 00107000
@RT00291 DS    0H                                               03S0292 00108000
*         RSTATE=DRAIN;             /* ALL PIUS IN THE WRITE BTU        00109000
*                                      SHOULD BE REPOSTED TO THE CORE   00110000
*                                      QUEUE                 @YM09094*/ 00111000
         LA    RSTATE,1                                         03S0292 00112000
*       DO UNTIL RSTATE=ENDWRITE;   /*                       @YM03702*/ 00113000
@RF00291 DS    0H                                               03S0293 00114000
@DL00293 DS    0H                                               03S0294 00115000
*                                                               04S0294 00116000
*         /***********************************************************/ 00117000
*         /*                                                         */ 00118000
*         /* PROCESS.WRITEPIU.SCANPIU: SCAN THE WRITE PIU COUNTING   */ 00119000
*         /* THE UNITS IN THE THE PIU. IF THE INTERRUPTED CCW IS IN  */ 00120000
*         /* THE PIU,SET THE INDICATOR 'DRAIN' SO THAT THE PIU (AND  */ 00121000
*         /* ALL SUBSEQUENT WRITE PIU'S) WILL BE REENQUEUED TO THE   */ 00122000
*         /* LCB CORE QUEUE.                                         */ 00123000
*         /*                                                         */ 00124000
*         /***********************************************************/ 00125000
*                                                               04S0294 00126000
*         RFY                                                   04S0294 00127000
*          (RWORK,                                              04S0294 00128000
*           RPIUSZ) RSTD;                                       04S0294 00129000
*         RPIU=RUNIT;               /* SET PIU TO THE CURRENT UNIT   */ 00130000
         LR    RPIU,RUNIT                                       04S0295 00131000
*         RPIUSZ=PRFPIUO+LENGTH(IEDTH)+TTHDCF;/* COMPUTE PIU SIZE    */ 00132000
         SLR   @07,@07                                          04S0296 00133000
         IC    @07,PRFPIUO(,RPIU)                               04S0296 00134000
         LA    RPIUSZ,10                                        04S0296 00135000
         ALR   RPIUSZ,@07                                       04S0296 00136000
         LA    @03,PRFPIUO(,RPIU)                               04S0296 00137000
         ALR   @07,@03                                          04S0296 00138000
         SLR   @03,@03                                          04S0296 00139000
         ICM   @03,3,TTHDCF(@07)                                04S0296 00140000
         ALR   RPIUSZ,@03                                       04S0296 00141000
*         RCOUNT=ZERO;              /* INITIALIZE COUNT OF UNITS     */ 00142000
         SLR   RCOUNT,RCOUNT                                    04S0297 00143000
*         DO UNTIL RPIUSZ<=ZERO;    /* PROCESS EACH UNIT OF THE PIU     00144000
*                                      UNTIL THE END OF THE PIU IS      00145000
*                                      REACHED                       */ 00146000
@DL00298 DS    0H                                               04S0299 00147000
*           IF RSTATE^=DRAIN THEN   /* HAS THE INTERRUPTED CCW BEEN     00148000
*                                      FOUND                 @YM03702*/ 00149000
         LA    @07,1                                            04S0299 00150000
         CR    RSTATE,@07                                       04S0299 00151000
         BE    @RF00299                                         04S0299 00152000
*             DO;                   /* NO, TEST FOR INTERRUPTED CCW  */ 00153000
*               IF RUNIT->PRFOPCDE=CCWBRK THEN/* IS THIS A WRITE        00154000
*                                      BREAK CCW                     */ 00155000
         CLI   PRFOPCDE(RUNIT),X'09'                            04S0301 00156000
         BNE   @RF00301                                         04S0301 00157000
*                 IF RUNIT=LCBCSWCA THEN/* YES, WAS INTERRUPT ON THIS   00158000
*                                      CCW                           */ 00159000
         L     @03,LCBCSWCA-1(,RLCB)                            04S0302 00160000
         LA    @03,0(,@03)                                      04S0302 00161000
         CR    RUNIT,@03                                        04S0302 00162000
         BNE   @RF00302                                         04S0302 00163000
*                   RSTATE=DRAIN;   /* INDICATE THAT THE INTERRUPTED    00164000
*                                      CCW IS FOUND          @YM03702*/ 00165000
         LR    RSTATE,@07                                       04S0303 00166000
*                 ELSE                                          04S0304 00167000
*                   ;                                           04S0304 00168000
@RF00302 DS    0H                                               04S0305 00169000
*               ELSE                /* CCW IS NOT A WRITE BREAK      */ 00170000
*                 IF RUNIT=LCBCSWCA-LENGTH(IEDQCCW) THEN/* WAS  04S0305 00171000
*                                      INTERRUPT ON THIS CCW         */ 00172000
         B     @RC00301                                         04S0305 00173000
@RF00301 L     @07,LCBCSWCA-1(,RLCB)                            04S0305 00174000
         LA    @07,0(,@07)                                      04S0305 00175000
         SL    @07,@CF00044                                     04S0305 00176000
         CR    RUNIT,@07                                        04S0305 00177000
         BNE   @RF00305                                         04S0305 00178000
*                   RSTATE=DRAIN;   /* INDICATE THAT THE INTERRUPTED    00179000
*                                      CCW IS FOUND          @YM03702*/ 00180000
         LA    RSTATE,1                                         04S0306 00181000
*             END;                                              04S0307 00182000
@RF00305 DS    0H                                               04S0307 00183000
@RC00301 DS    0H                                               04S0308 00184000
*           RWORK=RUNIT;            /* SAVE UNIT ADDR (IN CASE IT IS    00185000
*                                      LAST UNIT)                    */ 00186000
@RF00299 LR    RWORK,RUNIT                                      04S0308 00187000
*           RUNIT=RUNIT->PRFTI0;    /* GET NEXT UNIT                 */ 00188000
         L     @07,PRFTI0-1(,RUNIT)                             04S0309 00189000
         LA    @07,0(,@07)                                      04S0309 00190000
         LR    RUNIT,@07                                        04S0309 00191000
*           RCOUNT=RCOUNT+1;        /* INCREMENT COUNT OF UNITS IN      00192000
*                                      THE PIU                       */ 00193000
         AL    RCOUNT,@CF00059                                  04S0310 00194000
*           RPIUSZ=RPIUSZ-AVTKEYLE; /* DECREMENT PIU SIZE BY LENGTH     00195000
*                                      OF A UNIT                     */ 00196000
         SH    RPIUSZ,AVTKEYLE(,RAVT)                           04S0311 00197000
*         END;                                                  04S0312 00198000
@DE00298 LTR   RPIUSZ,RPIUSZ                                    04S0312 00199000
         BP    @DL00298                                         04S0312 00200000
*         RWORK->PRFTIC=INVTIC;     /* SET INVALID TIC IN LAST UNIT  */ 00201000
         MVC   PRFTIC(4,RWORK),INVTIC                           04S0313 00202000
*         RFY                                                   04S0314 00203000
*          (RWORK,                                              04S0314 00204000
*           RPIUSZ) UNRSTD;                                     04S0314 00205000
*         IF RSTATE=DRAIN THEN      /* SHOULD PIU BE REENQUEUED 03S0315 00206000
*                                                            @YM03702*/ 00207000
         C     RSTATE,@CF00059                                  03S0315 00208000
         BNE   @RF00315                                         03S0315 00209000
*           DO;                     /* YES, REENQUEUE ON LCB CORE       00210000
*                                      QUEUE                         */ 00211000
*             PRFQCBA=ADDR(LCBCOREQ);/* QUEUE TO LCB CORE QUEUE      */ 00212000
         LA    @10,LCBCOREQ(,RLCB)                              03S0317 00213000
         STCM  @10,7,PRFQCBA(RPIU)                              03S0317 00214000
*             PRFPRI=PRIOUTQ;       /* SET PRIORITY                  */ 00215000
         MVI   PRFPRI(RPIU),X'E0'                               03S0318 00216000
*             RFY                                               03S0319 00217000
*               RPARM RSTD;                                     03S0319 00218000
*             RPARM=RPIU;           /* MAKE THE PIU THE ELEMENT TO      00219000
*                                      TPOST                         */ 00220000
         LR    RPARM,RPIU                                       03S0320 00221000
*             CALL DSPPOSTR;        /* CALL DISPATCHER TO TPOST THE     00222000
*                                      ELEMENT                       */ 00223000
         LA    @15,DSPPOSTR(,RDISP)                             03S0321 00224000
         BALR  @14,@15                                          03S0321 00225000
*             RFY                                               03S0322 00226000
*               RPARM UNRSTD;                                   03S0322 00227000
*           END;                                                03S0323 00228000
*         ELSE                      /* DO NOT REENQUEUE              */ 00229000
*           DO;                     /* PLACE ITS UNITS ON FREE QUEUE */ 00230000
         B     @RC00315                                         03S0324 00231000
@RF00315 DS    0H                                               03S0325 00232000
*                                                               04S0325 00233000
*             /*******************************************************/ 00234000
*             /*                                                     */ 00235000
*             /* PROCESS.WRITEPIU.PROCPIU: PLACE THE UNITS OF THE    */ 00236000
*             /* WRITE PIU ON THE FREE QUEUE.                        */ 00237000
*             /*                                                     */ 00238000
*             /*******************************************************/ 00239000
*                                                               04S0325 00240000
*             RFY                                               04S0325 00241000
*               RWORK RSTD;                                     04S0325 00242000
*             PRFNBUNT=RCOUNT;      /* SET COUNT OF UNITS IN THIS       00243000
*                                      BUFFER                        */ 00244000
         STC   RCOUNT,PRFNBUNT(,RPIU)                           04S0326 00245000
*             IF LCBFSBFR^=ZERO THEN/* IS THERE A BUFFER ON THE FREE    00246000
*                                      QUEUE                         */ 00247000
         L     @10,LCBFSBFR-1(,RLCB)                            04S0327 00248000
         LA    @10,0(,@10)                                      04S0327 00249000
         LTR   @10,@10                                          04S0327 00250000
         BZ    @RF00327                                         04S0327 00251000
*               DO UNTIL RCOUNT=ZERO;/* YES, ADD UNITS OF THIS PIU TO   00252000
*                                      THE BUFFER                    */ 00253000
@DL00328 DS    0H                                               04S0329 00254000
*                 RWORK=PRFTI0;     /* GET NEXT UNIT                 */ 00255000
         L     RWORK,PRFTI0-1(,RPIU)                            04S0329 00256000
         LA    RWORK,0(,RWORK)                                  04S0329 00257000
*                 IF LCBFSBFR->PRFNBUNT=MAXUNITS THEN/* IS MAXIMUM      00258000
*                                      UNITS PER BUFFER REACHED      */ 00259000
         L     @10,LCBFSBFR-1(,RLCB)                            04S0330 00260000
         LA    @10,0(,@10)                                      04S0330 00261000
         CLI   PRFNBUNT(@10),255                                04S0330 00262000
         BNE   @RF00330                                         04S0330 00263000
*                   DO;             /* YES, MAX IS REACHED           */ 00264000
*                     PRFNBUNT=1;   /* BEGIN NEW BUFFER BY SETTING      00265000
*                                      NUMBER OF UNITS TO 1          */ 00266000
         MVI   PRFNBUNT(RPIU),X'01'                             04S0332 00267000
*                     PRFLINK=LCBFSBFR;/* LINK CURRENT PIU TO BUFFER    00268000
*                                      ON FREE QUEUE                 */ 00269000
         STCM  @10,7,PRFLINK(RPIU)                              04S0333 00270000
*                     PRFTIC=INVTIC;/* SET INVALID TIC IN UNIT       */ 00271000
         MVC   PRFTIC(4,RPIU),INVTIC                            04S0334 00272000
*                     LCBFSBFR=RPIU;/* PUT CURRENT UNIT AS 1ST BUFFER   00273000
*                                      ON FREE QUEUE                 */ 00274000
         STCM  RPIU,7,LCBFSBFR(RLCB)                            04S0335 00275000
*                   END;                                        04S0336 00276000
*                 ELSE              /* MAX IS NOT REACHED            */ 00277000
*                   DO;                                         04S0337 00278000
         B     @RC00330                                         04S0337 00279000
@RF00330 DS    0H                                               04S0338 00280000
*                     PRFNBUNT=LCBFSBFR->PRFNBUNT+1;/* INCREMENT        00281000
*                                      NUMBER OF UNITS ON FREE QUEUE */ 00282000
         L     @10,LCBFSBFR-1(,RLCB)                            04S0338 00283000
         LA    @10,0(,@10)                                      04S0338 00284000
         LA    @07,1                                            04S0338 00285000
         SLR   @03,@03                                          04S0338 00286000
         IC    @03,PRFNBUNT(,@10)                               04S0338 00287000
         ALR   @07,@03                                          04S0338 00288000
         STC   @07,PRFNBUNT(,RPIU)                              04S0338 00289000
*                     PRFTI0=LCBFSBFR;/* POINT THIS UNIT TO 1ST ON      00290000
*                                      FREE QUEUE                    */ 00291000
         STCM  @10,7,PRFTI0(RPIU)                               04S0339 00292000
*                     PRFLINK=LCBFSBFR->PRFLINK;/* SAVE LINK FROM OLD   00293000
*                                      1ST ON QUEUE                  */ 00294000
         MVC   PRFLINK(3,RPIU),PRFLINK(@10)                     04S0340 00295000
*                     LCBFSBFR=RPIU;/* MAKE THIS UNIT 1ST ON FREE       00296000
*                                      QUEUE                         */ 00297000
         STCM  RPIU,7,LCBFSBFR(RLCB)                            04S0341 00298000
*                   END;                                        04S0342 00299000
*                 RCOUNT=RCOUNT-1;  /* DECREMENT COUNT OF UNITS      */ 00300000
@RC00330 BCTR  RCOUNT,0                                         04S0343 00301000
*                 RPIU=RWORK;       /* GET ADDRESS OF NEXT UNIT      */ 00302000
         LR    RPIU,RWORK                                       04S0344 00303000
*               END;                                            04S0345 00304000
@DE00328 LTR   RCOUNT,RCOUNT                                    04S0345 00305000
         BNZ   @DL00328                                         04S0345 00306000
*             ELSE                  /* NO BUFFERS ON FREE QUEUE      */ 00307000
*               DO;                                             04S0346 00308000
         B     @RC00327                                         04S0346 00309000
@RF00327 DS    0H                                               04S0347 00310000
*                 LCBFSBFR=RPIU;    /* ADD THIS UNIT AS FIRST ON FREE   00311000
*                                      QUEUE                         */ 00312000
         STCM  RPIU,7,LCBFSBFR(RLCB)                            04S0347 00313000
*                 PRFLINK=ZERO;     /* CLEAR LINK                    */ 00314000
         SLR   @10,@10                                          04S0348 00315000
         STCM  @10,7,PRFLINK(RPIU)                              04S0348 00316000
*               END;                                            04S0349 00317000
*             RFY                                               04S0350 00318000
*               RWORK UNRSTD;                                   04S0350 00319000
@RC00327 DS    0H                                               04S0351 00320000
*           END;                                                03S0351 00321000
*         IF RUNIT=INVTICA|         /* IS ADDR OF NEXT UNIT INVALID     00322000
*                                      OR ...                        */ 00323000
*             RUNIT->PRFOPCDE=CCWREAD THEN/* ... IS NEXT CCW A READ  */ 00324000
@RC00315 SLR   @10,@10                                          03S0352 00325000
         ICM   @10,7,INVTICA                                    03S0352 00326000
         CR    RUNIT,@10                                        03S0352 00327000
         BE    @RT00352                                         03S0352 00328000
         CLI   PRFOPCDE(RUNIT),X'02'                            03S0352 00329000
         BNE   @RF00352                                         03S0352 00330000
@RT00352 DS    0H                                               03S0353 00331000
*           RSTATE=ENDWRITE;        /* YES, INDICATE THAT THE END OF    00332000
*                                      THE WRITE PIU'S IS REACHED       00333000
*                                                            @YM03702*/ 00334000
         LA    RSTATE,2                                         03S0353 00335000
*       END;                                                    03S0354 00336000
@RF00352 DS    0H                                               03S0354 00337000
@DE00293 C     RSTATE,@CF00130                                  03S0354 00338000
         BNE   @DL00293                                         03S0354 00339000
*     END;                                                      02S0355 00340000
*   RFY                                                         02S0356 00341000
*     IEDQPRF BASED(RPRF);          /* BASE FOR BUFFER UNIT          */ 00342000
@RF00289 DS    0H                                               02S0357 00343000
*   RPRF=RUNIT;                     /* SET CURRENT BUFFER TO CURRENT    00344000
*                                      UNIT                          */ 00345000
         LR    RPRF,RUNIT                                       02S0357 00346000
*   READBTU=0;                      /* INITIALIZE POINTER TO READ BTU*/ 00347000
         SLR   @10,@10                                          02S0358 00348000
         STCM  @10,7,READBTU(RLCB)                              02S0358 00349000
*   IF RPRF^=INVTICA THEN           /* TEST FOR PRESENSE OF A VALID     00350000
*                                      CCW => READ PIU               */ 00351000
         SLR   @10,@10                                          02S0359 00352000
         ICM   @10,7,INVTICA                                    02S0359 00353000
         CR    RPRF,@10                                         02S0359 00354000
         BE    @RF00359                                         02S0359 00355000
*     DO;                           /* PROCESS THE READ PIU'S        */ 00356000
*                                                               03S0361 00357000
*       /*************************************************************/ 00358000
*       /*                                                           */ 00359000
*       /* PROCESS.READPIU.SCANREAD: SCAN EACH READ PIU AND COUNT THE*/ 00360000
*       /* TOTAL NUMBER OF UNITS NEEDED TO REPLENISH THE UNIT COUNT. */ 00361000
*       /*                                                           */ 00362000
*       /*************************************************************/ 00363000
*                                                               03S0361 00364000
*       RFY                                                     03S0361 00365000
*        (REG9,                                                 03S0361 00366000
*         REG10) RSTD;                                          03S0361 00367000
*       GEN REFS(LCBBFRAV,CSMASK2) SETS(REG9,REG10,LCBBFRAV);   03S0362 00368000
*                                     /*                                00369000
         L     REG10,LCBBFRAV-3(,RLCB)  LOAD WORD CONTAINING   @YM04622 00370000
*                                       LCBBFRAV               @YM04622 00371000
CSLOOP2  EQU   *                                               @YM04622 00372000
         LR    REG9,REG10                                      @YM04622 00373000
         N     REG9,CSMASK2             TURN OFF LCBBFRAV IN 9 @YM04622 00374000
         CS    REG10,REG9,LCBBFRAV-3(RLCB) CS LCBBFRAV         @YM04622 00375000
         BNE   CSLOOP2                  DO AGAIN IF NOT EQUAL  @YM04622 00376000
*       RFY                                                     03S0363 00377000
*        (REG9,                                                 03S0363 00378000
*         REG10) UNRSTD;            /*                       @YM04622*/ 00379000
*       READBTU=RPRF;               /* SAVE READ BTU FOR POST        */ 00380000
         STCM  RPRF,7,READBTU(RLCB)                             03S0364 00381000
*       RCOUNT=ZERO;                /* CLEAR COUNT FIELD             */ 00382000
         SLR   RCOUNT,RCOUNT                                    03S0365 00383000
*       DO UNTIL RPRF=INVTICA;      /* LOOP THROUGH READ CCW'S UNTIL    00384000
*                                      INVALID TIC IS FOUND          */ 00385000
@DL00366 DS    0H                                               03S0367 00386000
*         RCOUNT=RCOUNT+1;          /* INCREMENT COUNT OF UNITS      */ 00387000
         AL    RCOUNT,@CF00059                                  03S0367 00388000
*         RPRF=PRFTI0;              /* GET NEXT UNIT                 */ 00389000
         L     @10,PRFTI0-1(,RPRF)                              03S0368 00390000
         LA    @10,0(,@10)                                      03S0368 00391000
         LR    RPRF,@10                                         03S0368 00392000
*       END;                                                    03S0369 00393000
@DE00366 SLR   @10,@10                                          03S0369 00394000
         ICM   @10,7,INVTICA                                    03S0369 00395000
         CR    RPRF,@10                                         03S0369 00396000
         BNE   @DL00366                                         03S0369 00397000
*       LCBRBCT1=1;                 /* SET ONE BUFFER NEEDED         */ 00398000
         MVI   LCBRBCT1(RLCB),X'01'                             03S0370 00399000
*       LCBRBCT2=RCOUNT;            /* SET NUMBER OF UNITS NEEDED IN    00400000
*                                      THE BUFFER                    */ 00401000
         STC   RCOUNT,LCBRBCT2(,RLCB)                           03S0371 00402000
*     END;                                                      02S0372 00403000
*                                                               03S0373 00404000
*   /*****************************************************************/ 00405000
*   /*                                                               */ 00406000
*   /* PROCESS.READPIU: SCAN THE READ PIU'S COUNTING THE NUMBER OF   */ 00407000
*   /* UNITS NEEDED TO REPLENISH THE READ COUNT. USE THE UNITS ON THE*/ 00408000
*   /* FREE QUEUE TO REPLENISH THE COUNT. IF MORE UNITS ARE ON THE   */ 00409000
*   /* QUEUE THAN ARE NEEDED, THEN POST THE EXTRA UNITS TO THE FREE  */ 00410000
*   /* POOL. IF NOT ENOUGH UNITS ARE AVAILABLE, THEN POST THE ERB TO */ 00411000
*   /* REQUEST MORE.                                                 */ 00412000
*   /*                                                               */ 00413000
*   /*****************************************************************/ 00414000
*                                                               03S0373 00415000
*   DO WHILE LCBFSBFR^=ZERO;        /* REMOVE BUFFERS FROM THE FREE     00416000
*                                      QUEUE WHILE THERE ARE BUFFERS    00417000
*                                      ON THE QUEUE                  */ 00418000
@RF00359 B     @DE00373                                         03S0373 00419000
@DL00373 DS    0H                                               03S0374 00420000
*     RPRF=LCBFSBFR;                /* MAKE 1ST ON THE FREE QUEUE THE   00421000
*                                      CURRENT BUFFER                */ 00422000
         L     RPRF,LCBFSBFR-1(,RLCB)                           03S0374 00423000
         LA    RPRF,0(,RPRF)                                    03S0374 00424000
*     LCBFSBFR=PRFLINK;             /* MAKE THE NEXT BUFFER THE 1ST     00425000
*                                      ON FREE QUEUE                 */ 00426000
         MVC   LCBFSBFR(3,RLCB),PRFLINK(RPRF)                   03S0375 00427000
*     IF LCBRBCT2^=ZERO THEN        /* ARE UNITS NEEDED TO REPLENISH    00428000
*                                      READ COUNT                    */ 00429000
         CLI   LCBRBCT2(RLCB),0                                 03S0376 00430000
         BE    @RF00376                                         03S0376 00431000
*       IF PRFNBUNT>=LCBRBCT2 THEN  /* YES, ARE THERE ENOUGH UNITS IN   00432000
*                                      THIS BUFFER TO REPLENISH THE     00433000
*                                      COUNT                         */ 00434000
         CLC   PRFNBUNT(1,RPRF),LCBRBCT2(RLCB)                  03S0377 00435000
         BL    @RF00377                                         03S0377 00436000
*         DO;                       /* YES, MOVE THE UNITS TO THE ERB   00437000
*                                      FROM THE FREE QUEUE           */ 00438000
*                                                               04S0379 00439000
*           /*********************************************************/ 00440000
*           /*                                                       */ 00441000
*           /* PROCESS.READPIU.ADDUNITS: ADD UNITS TO THE ERB. THE   */ 00442000
*           /* UNITS ARE OBTAINED FROM THE FREE QUEUE.               */ 00443000
*           /*                                                       */ 00444000
*           /*********************************************************/ 00445000
*                                                               04S0379 00446000
*           DO UNTIL LCBRBCT2=ZERO; /* ADD UNITS TO ERB UNTIL NUMBER    00447000
*                                      OF REQUIRED UNITS IS OBTAINED */ 00448000
@DL00379 DS    0H                                               04S0380 00449000
*             RUNIT=RPRF;           /* DELINK ...                    */ 00450000
         LR    RUNIT,RPRF                                       04S0380 00451000
*             RPRF=PRFTI0;          /* ... THE UNIT                  */ 00452000
         L     @10,PRFTI0-1(,RPRF)                              04S0381 00453000
         LA    @10,0(,@10)                                      04S0381 00454000
         LR    RPRF,@10                                         04S0381 00455000
*             IF RPRF^=INVTICA THEN /* IS THERE ANOTHER UNIT         */ 00456000
         SLR   @10,@10                                          04S0382 00457000
         ICM   @10,7,INVTICA                                    04S0382 00458000
         CR    RPRF,@10                                         04S0382 00459000
         BE    @RF00382                                         04S0382 00460000
*               PRFNBUNT=RUNIT->PRFNBUNT-1;/* YES, CHANGE THE UNIT      00461000
*                                      COUNT                         */ 00462000
         SLR   @10,@10                                          04S0383 00463000
         IC    @10,PRFNBUNT(,RUNIT)                             04S0383 00464000
         BCTR  @10,0                                            04S0383 00465000
         STC   @10,PRFNBUNT(,RPRF)                              04S0383 00466000
*             IF LCBERBCH=ZERO THEN /* IS THE ERB CHAIN EMPTY        */ 00467000
@RF00382 L     @10,LCBERBCH-1(,RLCB)                            04S0384 00468000
         LA    @10,0(,@10)                                      04S0384 00469000
         LTR   @10,@10                                          04S0384 00470000
         BNZ   @RF00384                                         04S0384 00471000
*               RUNIT->PRFNBUNT=1;  /* YES, INDICATE ONE UNIT ON        00472000
*                                      CHAIN                         */ 00473000
         MVI   PRFNBUNT(RUNIT),X'01'                            04S0385 00474000
*             ELSE                  /* ERB CHAIN IS NOT EMPTY        */ 00475000
*               RUNIT->PRFNBUNT=LCBERBCH->PRFNBUNT+1;/* UPDATE COUNT    00476000
*                                      OF UNITS                      */ 00477000
         B     @RC00384                                         04S0386 00478000
@RF00384 L     @10,LCBERBCH-1(,RLCB)                            04S0386 00479000
         LA    @09,1                                            04S0386 00480000
         SLR   @07,@07                                          04S0386 00481000
         IC    @07,PRFNBUNT(,@10)                               04S0386 00482000
         ALR   @09,@07                                          04S0386 00483000
         STC   @09,PRFNBUNT(,RUNIT)                             04S0386 00484000
*             RUNIT->PRFTI0=LCBERBCH;/* CHAIN THE UNIT ...           */ 00485000
@RC00384 MVC   PRFTI0(3,RUNIT),LCBERBCH(RLCB)                   04S0387 00486000
*             LCBERBCH=RUNIT;       /* ... OFF THE ERB               */ 00487000
         STCM  RUNIT,7,LCBERBCH(RLCB)                           04S0388 00488000
*             LCBRBCT2=LCBRBCT2-1;  /* DECREMENT COUNT OF UNITS 04S0389 00489000
*                                      NEEDED                        */ 00490000
         SLR   @10,@10                                          04S0389 00491000
         IC    @10,LCBRBCT2(,RLCB)                              04S0389 00492000
         BCTR  @10,0                                            04S0389 00493000
         STC   @10,LCBRBCT2(,RLCB)                              04S0389 00494000
*           END;                                                04S0390 00495000
@DE00379 CLI   LCBRBCT2(RLCB),0                                 04S0390 00496000
         BNE   @DL00379                                         04S0390 00497000
*           LCBERBQB=RLCB;          /* POST ERB TO DRIVE THE RECEIVE    00498000
*                                      SCHEDULER                     */ 00499000
         STCM  RLCB,7,LCBERBQB(RLCB)                            04S0391 00500000
*           LCBERBPY=PRIINTRQ;      /* SET PRIORITY                  */ 00501000
         MVI   LCBERBPY(RLCB),X'E4'                             04S0392 00502000
*           RFY                                                 04S0393 00503000
*             RPARM RSTD;                                       04S0393 00504000
*           RPARM=ADDR(LCBERB);     /* MAKE THE ERB THE ELEMENT TO      00505000
*                                      TPOST*                        */ 00506000
         LA    RPARM,LCBERB(,RLCB)                              04S0394 00507000
*           CALL DSPPOSTR;          /* CALL DISPATCHER TO TPOST THE     00508000
*                                      ELEMENT                       */ 00509000
         LA    @15,DSPPOSTR(,RDISP)                             04S0395 00510000
         BALR  @14,@15                                          04S0395 00511000
*           RFY                                                 04S0396 00512000
*             RPARM UNRSTD;                                     04S0396 00513000
*         END;                                                  03S0397 00514000
*     IF RPRF^=INVTICA THEN         /* ARE THERE UNITS IN THIS BUFFER   00515000
*                                      THAT ARE NOT NEEDED           */ 00516000
@RF00377 DS    0H                                               03S0398 00517000
@RF00376 SLR   @10,@10                                          03S0398 00518000
         ICM   @10,7,INVTICA                                    03S0398 00519000
         CR    RPRF,@10                                         03S0398 00520000
         BE    @RF00398                                         03S0398 00521000
*       DO;                         /* YES, POST THEM TO THE FREE       00522000
*                                      POOL                          */ 00523000
*         PRFQCBA=ADDR(AVTBFRTB);   /* SET TO QUEUE TO FREE POOL     */ 00524000
         LA    @10,AVTBFRTB(,RAVT)                              03S0400 00525000
         STCM  @10,7,PRFQCBA(RPRF)                              03S0400 00526000
*         PRFPRI=PRIBFRTB;          /* SET PRIORITY                  */ 00527000
         MVI   PRFPRI(RPRF),X'E0'                               03S0401 00528000
*         RFY                                                   03S0402 00529000
*           RPARM RSTD;                                         03S0402 00530000
*         RPARM=RPRF;               /* MAKE THE BUFFER THE ELEMENT TO   00531000
*                                      TPOST                         */ 00532000
         LR    RPARM,RPRF                                       03S0403 00533000
*         CALL DSPPOSTR;            /* CALL DISPATCHER TO TPOST THE     00534000
*                                      ELEMENT                       */ 00535000
         LA    @15,DSPPOSTR(,RDISP)                             03S0404 00536000
         BALR  @14,@15                                          03S0404 00537000
*         RFY                                                   03S0405 00538000
*           RPARM UNRSTD;                                       03S0405 00539000
*       END;                                                    03S0406 00540000
*   END;                                                        03S0407 00541000
@RF00398 DS    0H                                               03S0407 00542000
@DE00373 L     @10,LCBFSBFR-1(,RLCB)                            03S0407 00543000
         LA    @10,0(,@10)                                      03S0407 00544000
         LTR   @10,@10                                          03S0407 00545000
         BNZ   @DL00373                                         03S0407 00546000
*                                                               04S0408 00547000
*   /*****************************************************************/ 00548000
*   /*                                                               */ 00549000
*   /* PROCESS.READPIU.POSTERB: IF BUFFER UNITS ARE NEEDED FROM THE  */ 00550000
*   /* BUFFER FREE POOL TO REPLENISH THE READ COUNT, THEN POST THE   */ 00551000
*   /* ERB TO GET THEM.                                              */ 00552000
*   /*                                                               */ 00553000
*   /*****************************************************************/ 00554000
*                                                               04S0408 00555000
*   IF LCBRBCT2^=ZERO THEN          /* ARE UNITS NEEDED              */ 00556000
         CLI   LCBRBCT2(RLCB),0                                 04S0408 00557000
         BE    @RF00408                                         04S0408 00558000
*     DO;                           /* YES, POST THE ERB             */ 00559000
*       LCBDLNKN=OFF;               /* INDICATE ERB POSTED           */ 00560000
         NI    LCBDLNKN(RLCB),B'11111110'                       04S0410 00561000
*       LCBRCQCB=RLCB;              /* SET QCB TO WHICH BUFFERS WILL    00562000
*                                      BE TPOSTED                    */ 00563000
         ST    RLCB,LCBRCQCB(,RLCB)                             04S0411 00564000
*       LCBERBQB=ADDR(AVTBFREB);    /* QUEUE ERB TO AVAILABLE BUFFER    00565000
*                                      ROUTINE                       */ 00566000
         LA    @10,AVTBFREB(,RAVT)                              04S0412 00567000
         STCM  @10,7,LCBERBQB(RLCB)                             04S0412 00568000
*       LCBERBPY=PRIINTRQ;          /* SET PRIORITY                  */ 00569000
         MVI   LCBERBPY(RLCB),X'E4'                             04S0413 00570000
*       RFY                                                     04S0414 00571000
*         RPARM RSTD;                                           04S0414 00572000
*       RPARM=ADDR(LCBERB);         /* MAKE THE ERB THE ELEMENT TO      00573000
*                                      TPOST                         */ 00574000
         LA    RPARM,LCBERB(,RLCB)                              04S0415 00575000
*       CALL DSPPOSTR;              /* CALL DISPATCHER TO TPOST 04S0416 00576000
*                                      ELEMENT                       */ 00577000
         LA    @15,DSPPOSTR(,RDISP)                             04S0416 00578000
         BALR  @14,@15                                          04S0416 00579000
*       RFY                                                     04S0417 00580000
*         RPARM UNRSTD;                                         04S0417 00581000
*     END;                                                      04S0418 00582000
*                                                               03S0419 00583000
*   /*****************************************************************/ 00584000
*   /*                                                               */ 00585000
*   /* PROCESS.EXIT: POST LCB TO ITSELF IF THE ERB HAS NOT BEEN      */ 00586000
*   /* POSTED. SET LCB FIELDS AND POST ANY READ PIU'S TO PATH        */ 00587000
*   /* CONTROL.                                                      */ 00588000
*   /*                                                               */ 00589000
*   /*****************************************************************/ 00590000
*                                                               03S0419 00591000
*   IF LCBDLNKN=ON&                 /* IS THE ...                    */ 00592000
*       LCBERBCH=ZERO THEN          /* ... ERB POSTED                */ 00593000
@RF00408 TM    LCBDLNKN(RLCB),B'00000001'                       03S0419 00594000
         BNO   @RF00419                                         03S0419 00595000
         L     @10,LCBERBCH-1(,RLCB)                            03S0419 00596000
         LA    @10,0(,@10)                                      03S0419 00597000
         LTR   @10,@10                                          03S0419 00598000
         BNZ   @RF00419                                         03S0419 00599000
*     DO;                           /* NO, POST THE LCB TO ITSELF    */ 00600000
*       LCBQCBA=RLCB;               /* SET LCB AS THE QCB            */ 00601000
         STCM  RLCB,7,LCBQCBA(RLCB)                             03S0421 00602000
*       LCBPRI=PRIRESUM;            /* SET PRIORITY          @YM08511*/ 00603000
         MVI   LCBPRI(RLCB),X'E5'                               03S0422 00604000
*       RFY                                                     03S0423 00605000
*         RPARM RSTD;                                           03S0423 00606000
*       RPARM=RLCB;                 /* MAKE THE LCB THE ELEMENT TO      00607000
*                                      TPOST                         */ 00608000
         LR    RPARM,RLCB                                       03S0424 00609000
*       CALL DSPPOSTR;              /* CALL DISPATCHER TO TPOST 03S0425 00610000
*                                      ELEMENT                       */ 00611000
         LA    @15,DSPPOSTR(,RDISP)                             03S0425 00612000
         BALR  @14,@15                                          03S0425 00613000
*       RFY                                                     03S0426 00614000
*         RPARM UNRSTD;                                         03S0426 00615000
*     END;                                                      03S0427 00616000
*   LCBSTAT1=CLEAR;                 /* CLEAR STATE FIELD             */ 00617000
@RF00419 MVI   LCBSTAT1(RLCB),X'00'                             03S0428 00618000
*   RFY                                                         03S0429 00619000
*    (REG9,                                                     03S0429 00620000
*     REG10) RSTD;                  /*                       @YM04622*/ 00621000
*   GEN REFS(CSMASK1,LCBRECVN)      /*                       @YM04622*/ 00622000
*       SETS(REG9,REG10,LCBRECVN);                              03S0430 00623000
*                              /* @YM04622*/                            00624000
*                                     /*                                00625000
         L     REG10,LCBRECVN-2(,RLCB)  LOAD WORD CONTAINING   @YM04622 00626000
*                                       LCBRECVN               @YM04622 00627000
CSLOOP1  EQU   *                                               @YM04622 00628000
         LR    REG9,REG10                                      @YM04622 00629000
         O     REG9,CSMASK1             TURN ON LCBRECVN IN 9  @YM04622 00630000
         CS    REG10,REG9,LCBRECVN-2(RLCB) CS LCBRECVN         @YM04622 00631000
         BNE   CSLOOP1                  DO AGAIN IF NOT EQUAL  @YM04622 00632000
*   RFY                                                         03S0431 00633000
*    (REG9,                                                     03S0431 00634000
*     REG10) UNRSTD;                /*                       @YM04622*/ 00635000
*   LCBTSTSW=CLEAR;                 /* CLEAR TEST-AND-SET SWITCH     */ 00636000
         MVI   LCBTSTSW(RLCB),X'00'                             03S0432 00637000
*   RFY                                                         03S0433 00638000
*    (RPARM,                                                    03S0433 00639000
*     RSTCB,                                                    03S0433 00640000
*     RQCB,                                                     03S0433 00641000
*     RRETURN) RSTD;                                            03S0433 00642000
*   IF READBTU^=ZERO THEN           /* IS READ BTU AVAILABLE         */ 00643000
         L     @15,READBTU-1(,RLCB)                             03S0434 00644000
         LA    @15,0(,@15)                                      03S0434 00645000
         LTR   @15,@15                                          03S0434 00646000
         BZ    @RF00434                                         03S0434 00647000
*     DO;                           /* YES                           */ 00648000
*       RPARM=READBTU;              /* SET CURRENT PIU TO READ PIU   */ 00649000
         LR    RPARM,@15                                        03S0436 00650000
*       RPARM->PRFQCBA=SAVTIPCQ;    /* SET DSPBYPAS QCB ADDRESS      */ 00651000
         L     @15,AVTSAVTP(,RAVT)                              03S0437 00652000
         L     @15,SAVTIPCQ(,@15)                               03S0437 00653000
         STCM  @15,7,PRFQCBA(RPARM)                             03S0437 00654000
*       RPARM->PRFPRI=PRIFLDH;      /* SET DSPBYPAS PRIORITY         */ 00655000
         MVI   PRFPRI(RPARM),X'E4'                              03S0438 00656000
*       RQCB=SAVTIPCQ;              /* QUEUE TO PATH CONTROL @YM03681*/ 00657000
         LR    RQCB,@15                                         03S0439 00658000
*       RSTCB=QCBSTCHN;             /* SET STCB POINTER      @YM03681*/ 00659000
         L     RSTCB,QCBSTCHN-1(,RQCB)                          03S0440 00660000
         LA    RSTCB,0(,RSTCB)                                  03S0440 00661000
*       RRETURN=ADDR(DSPBYPAS);     /* EXIT TO BY-PASS               */ 00662000
         LA    RRETURN,DSPBYPAS(,RDISP)                         03S0441 00663000
*     END;                                                      03S0442 00664000
*   ELSE                            /* READ BTU NOT AVAILABLE        */ 00665000
*     RRETURN=ADDR(DSPDISP);        /* RETURN TO DISPATCHER          */ 00666000
         B     @RC00434                                         03S0443 00667000
@RF00434 LA    RRETURN,DSPDISP(,RDISP)                          03S0443 00668000
*   RFY                                                         03S0444 00669000
*    (RPARM,                                                    03S0444 00670000
*     RSTCB,                                                    03S0444 00671000
*     RQCB,                                                     03S0444 00672000
*     RRETURN) UNRSTD;                                          03S0444 00673000
*   END IGG019TI                                                01S0445 00674000
*                                                               01S0445 00675000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00676000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00677000
*/*%INCLUDE SYSLIB  (TCCWD   )                                       */ 00678000
*/*%INCLUDE SYSLIB  (TDISPD  )                                       */ 00679000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 00680000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00681000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00682000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 00683000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00684000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 00685000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 00686000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 00687000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 00688000
*/*%INCLUDE SYSUT5  (ENTRY   )                                       */ 00689000
*/*%INCLUDE SYSUT5  (WRITEPIU)                                       */ 00690000
*/*%INCLUDE SYSUT5  (SCANPIU )                                       */ 00691000
*/*%INCLUDE SYSUT5  (PROCPIU )                                       */ 00692000
*/*%INCLUDE SYSUT5  (SCANREAD)                                       */ 00693000
*/*%INCLUDE SYSUT5  (READPIU )                                       */ 00694000
*/*%INCLUDE SYSUT5  (ADDUNITS)                                       */ 00695000
*/*%INCLUDE SYSUT5  (POSTERB )                                       */ 00696000
*/*%INCLUDE SYSUT5  (EXIT    )                                       */ 00697000
*                                                               01S0445 00698000
*       ;                                                       01S0445 00699000
@EL00001 DS    0H                                               01S0445 00700000
@EF00001 DS    0H                                               01S0445 00701000
@ER00001 BR    @14                                              01S0445 00702000
@DATA    DS    0H                                                       00703000
         DS    0F                                                       00704000
         DS    0F                                                       00705000
@CF00059 DC    F'1'                                                     00706000
@CF00130 DC    F'2'                                                     00707000
@CF00044 DC    F'8'                                                     00708000
@CF01470 DC    XL4'00FFFFFF'                                            00709000
         DS    0D                                                       00710000
CSMASK1  DC    X'00000200'                                              00711000
CSMASK2  DC    X'FFFFFFFD'                                              00712000
INVTIC   DS    CL4                                                      00713000
         ORG   INVTIC                                                   00714000
INVTICC  DC    X'08'                                                    00715000
INVTICA  DC    X'000002'                                                00716000
         ORG   INVTIC+4                                                 00717000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00718000
@01      EQU   01                                                       00719000
@02      EQU   02                                                       00720000
@03      EQU   03                                                       00721000
@04      EQU   04                                                       00722000
@05      EQU   05                                                       00723000
@06      EQU   06                                                       00724000
@07      EQU   07                                                       00725000
@08      EQU   08                                                       00726000
@09      EQU   09                                                       00727000
@10      EQU   10                                                       00728000
@11      EQU   11                                                       00729000
@12      EQU   12                                                       00730000
@13      EQU   13                                                       00731000
@14      EQU   14                                                       00732000
@15      EQU   15                                                       00733000
IEDQAPTR EQU   @13                                                      00734000
RDISP    EQU   @11                                                      00735000
IEDQLPTR EQU   @04                                                      00736000
LCBXPTR  EQU   @05                                                      00737000
IEDQPPTR EQU   @06                                                      00738000
IEDQQPTR EQU   @07                                                      00739000
RPIU     EQU   @06                                                      00740000
RAVT     EQU   @13                                                      00741000
RLCB     EQU   @04                                                      00742000
RQCB     EQU   @07                                                      00743000
RINPUT   EQU   @01                                                      00744000
RPARM    EQU   @01                                                      00745000
RSTATE   EQU   @02                                                      00746000
RSTCB    EQU   @03                                                      00747000
RCOUNT   EQU   @05                                                      00748000
RPRF     EQU   @06                                                      00749000
RUNIT    EQU   @08                                                      00750000
RWORK    EQU   @09                                                      00751000
REG9     EQU   @09                                                      00752000
REG10    EQU   @10                                                      00753000
RPIUSZ   EQU   @10                                                      00754000
RBASE    EQU   @12                                                      00755000
RRETURN  EQU   @14                                                      00756000
RBRANCH  EQU   @15                                                      00757000
REG0     EQU   @00                                                      00758000
IEDQAVTD EQU   0                                                        00759000
AVTSAVEX EQU   IEDQAVTD+216                                             00760000
@NM00003 EQU   IEDQAVTD+316                                             00761000
AVTCKFLG EQU   @NM00003                                                 00762000
AVTBASE  EQU   IEDQAVTD+340                                             00763000
AVTPKF   EQU   AVTBASE                                                  00764000
AVTOSECB EQU   IEDQAVTD+420                                             00765000
AVTECB1  EQU   AVTOSECB                                                 00766000
AVTHG02  EQU   IEDQAVTD+456                                             00767000
AVTDISP  EQU   IEDQAVTD+480                                             00768000
AVTHD    EQU   IEDQAVTD+484                                             00769000
AVTSCOPT EQU   AVTHD                                                    00770000
AVTSAVTP EQU   IEDQAVTD+540                                             00771000
AVTSAVTF EQU   AVTSAVTP                                                 00772000
AVTCKPEL EQU   IEDQAVTD+580                                             00773000
AVTCKRMV EQU   AVTCKPEL                                                 00774000
AVTCKELF EQU   IEDQAVTD+608                                             00775000
AVTCKBYT EQU   IEDQAVTD+619                                             00776000
AVTHG01  EQU   IEDQAVTD+620                                             00777000
AVTCKLNK EQU   IEDQAVTD+624                                             00778000
AVTCRELE EQU   IEDQAVTD+636                                             00779000
AVTCCELE EQU   AVTCRELE                                                 00780000
AVTCLRHI EQU   IEDQAVTD+644                                             00781000
AVTADBUF EQU   IEDQAVTD+648                                             00782000
AVTSYSER EQU   IEDQAVTD+656                                             00783000
AVTBFREB EQU   IEDQAVTD+708                                             00784000
AVTBFRFG EQU   IEDQAVTD+712                                             00785000
AVTBFRTB EQU   IEDQAVTD+720                                             00786000
AVTCKPQB EQU   IEDQAVTD+732                                             00787000
AVTCKPTB EQU   AVTCKPQB                                                 00788000
AVTCKPEC EQU   AVTCKPQB+4                                               00789000
AVTCKPCC EQU   AVTCKPEC                                                 00790000
AVTOPCQB EQU   IEDQAVTD+744                                             00791000
AVTOPCOB EQU   AVTOPCQB                                                 00792000
AVTOPCEC EQU   AVTOPCQB+4                                               00793000
AVTOPCCC EQU   AVTOPCEC                                                 00794000
AVTOLTQB EQU   IEDQAVTD+756                                             00795000
AVTCWFL1 EQU   IEDQAVTD+852                                             00796000
AVTCWFL2 EQU   IEDQAVTD+853                                             00797000
AVTSUBT  EQU   IEDQAVTD+876                                             00798000
AVTIOTR  EQU   IEDQAVTD+877                                             00799000
AVTKEYLE EQU   IEDQAVTD+960                                             00800000
AVTBIT1  EQU   IEDQAVTD+978                                             00801000
AVTBIT2  EQU   IEDQAVTD+979                                             00802000
AVTBIT3  EQU   IEDQAVTD+980                                             00803000
AVTBIT4  EQU   IEDQAVTD+1064                                            00804000
@NM00085 EQU   IEDQAVTD+1160                                            00805000
IEDNSVTD EQU   0                                                        00806000
SAVTDIAG EQU   IEDNSVTD                                                 00807000
SAVTDIAF EQU   SAVTDIAG                                                 00808000
SAVTLUSQ EQU   IEDNSVTD+88                                              00809000
SAVTIPCQ EQU   IEDNSVTD+144                                             00810000
SAVTTCPU EQU   IEDNSVTD+238                                             00811000
SAVTZELM EQU   IEDNSVTD+270                                             00812000
SAVTRDRV EQU   IEDNSVTD+284                                             00813000
SAVTCKQB EQU   IEDNSVTD+300                                             00814000
SAVTCKTB EQU   SAVTCKQB                                                 00815000
SAVTCKEC EQU   SAVTCKQB+4                                               00816000
SAVTCKCC EQU   SAVTCKEC                                                 00817000
IEDQCCW  EQU   0                                                        00818000
CCW      EQU   IEDQCCW                                                  00819000
CCWOPCDE EQU   CCW                                                      00820000
CCWFLAGS EQU   CCW+4                                                    00821000
IEDQDISP EQU   0                                                        00822000
DSPDISP  EQU   4                                                        00823000
DSPBYPAS EQU   20                                                       00824000
DSPPOST  EQU   24                                                       00825000
DSPPOSTR EQU   28                                                       00826000
IEDQLCB  EQU   0                                                        00827000
LCBRCB   EQU   IEDQLCB                                                  00828000
LCBQCBA  EQU   LCBRCB+1                                                 00829000
LCBPRI   EQU   LCBRCB+4                                                 00830000
LCBTSOB  EQU   IEDQLCB+19                                               00831000
LCBCHAIN EQU   IEDQLCB+20                                               00832000
LCBSCRNN EQU   LCBCHAIN                                                 00833000
LCBTETEN EQU   LCBCHAIN                                                 00834000
LCBINSRC EQU   IEDQLCB+21                                               00835000
LCBLKMDE EQU   LCBINSRC+2                                               00836000
LCBNTXT  EQU   IEDQLCB+24                                               00837000
LCBSTAT4 EQU   LCBNTXT                                                  00838000
LCBPHASE EQU   LCBSTAT4                                                 00839000
LCBSCBDA EQU   IEDQLCB+25                                               00840000
LCBMHA   EQU   IEDQLCB+29                                               00841000
LCBFSBFR EQU   LCBMHA                                                   00842000
LCBFLAG1 EQU   IEDQLCB+32                                               00843000
LCBIOBSN EQU   IEDQLCB+33                                               00844000
LCBSNS   EQU   LCBIOBSN+1                                               00845000
LCBSENS0 EQU   LCBSNS                                                   00846000
LCBLOSDT EQU   LCBSENS0                                                 00847000
LCBTMOUT EQU   LCBSENS0                                                 00848000
LCBFLAG3 EQU   LCBIOBSN+7                                               00849000
LCBCSW   EQU   LCBIOBSN+8                                               00850000
LCBCSWCA EQU   LCBCSW                                                   00851000
LCBCSWST EQU   LCBCSW+3                                                 00852000
LCBCSWUS EQU   LCBCSWST                                                 00853000
LCBCSWCS EQU   LCBCSWST+1                                               00854000
LCBSIOCC EQU   LCBIOBSN+15                                              00855000
LCBDCBPT EQU   IEDQLCB+52                                               00856000
LCBRCQCB EQU   IEDQLCB+56                                               00857000
LCBRESTR EQU   LCBRCQCB                                                 00858000
LCBTHSQ  EQU   IEDQLCB+60                                               00859000
LCBINCAM EQU   LCBTHSQ                                                  00860000
LCBERRCT EQU   IEDQLCB+62                                               00861000
LCBLSPCI EQU   IEDQLCB+65                                               00862000
LCBRCBFR EQU   LCBLSPCI                                                 00863000
LCBSTATE EQU   IEDQLCB+70                                               00864000
LCBSTAT1 EQU   LCBSTATE                                                 00865000
LCBRECVN EQU   LCBSTAT1                                                 00866000
LCBSTAT2 EQU   LCBSTATE+1                                               00867000
LCBBEOTN EQU   LCBSTAT2                                                 00868000
LCBSYNC  EQU   LCBSTAT2                                                 00869000
LCBDIAL  EQU   LCBSTAT2                                                 00870000
LCBBFRAV EQU   LCBDIAL                                                  00871000
LCBTSTSW EQU   IEDQLCB+72                                               00872000
LCBERB   EQU   IEDQLCB+76                                               00873000
LCBERBQB EQU   LCBERB+1                                                 00874000
LCBERBPY EQU   IEDQLCB+80                                               00875000
LCBERBST EQU   IEDQLCB+84                                               00876000
LCBDLNKN EQU   LCBERBST                                                 00877000
LCBERBCH EQU   IEDQLCB+85                                               00878000
LCBERBCT EQU   IEDQLCB+88                                               00879000
LCBRBCT1 EQU   LCBERBCT                                                 00880000
LCBRBCT2 EQU   LCBERBCT+1                                               00881000
LCBMSGFM EQU   IEDQLCB+92                                               00882000
LCBOBRCH EQU   IEDQLCB+96                                               00883000
LCBINVPT EQU   LCBOBRCH+1                                               00884000
LCBBFRW  EQU   LCBINVPT                                                 00885000
LCBTPCD  EQU   IEDQLCB+100                                              00886000
LCBSTAT5 EQU   LCBTPCD                                                  00887000
LCBSTAT6 EQU   LCBTPCD+4                                                00888000
LCBRSPSV EQU   LCBTPCD+8                                                00889000
LCBSAVSN EQU   IEDQLCB+112                                              00890000
LCBERCCW EQU   IEDQLCB+120                                              00891000
LCBCPA   EQU   IEDQLCB+144                                              00892000
LCBCCW1  EQU   LCBCPA                                                   00893000
LCBCCW2  EQU   LCBCPA+8                                                 00894000
LCBCCW5  EQU   LCBCPA+32                                                00895000
LCBATTEL EQU   LCBCCW5                                                  00896000
LCBQEBPL EQU   LCBATTEL                                                 00897000
IEDQLCBX EQU   0                                                        00898000
LCBXCON  EQU   IEDQLCBX                                                 00899000
LCBXFLAG EQU   LCBXCON                                                  00900000
LCBXDCT  EQU   LCBXCON+1                                                00901000
LCBXRADR EQU   LCBXCON+4                                                00902000
IEDQPRF  EQU   0                                                        00903000
PRFRCB   EQU   IEDQPRF                                                  00904000
PRFKEY   EQU   PRFRCB                                                   00905000
PRFOPCDE EQU   PRFKEY                                                   00906000
PRFQCBA  EQU   PRFRCB+1                                                 00907000
PRFPRI   EQU   PRFRCB+4                                                 00908000
PRFLINK  EQU   PRFRCB+5                                                 00909000
PRFTIC   EQU   IEDQPRF+8                                                00910000
PRFTICC  EQU   PRFTIC                                                   00911000
PRFTI0   EQU   PRFTIC+1                                                 00912000
PRFNBUNT EQU   IEDQPRF+12                                               00913000
PRFSUNIT EQU   PRFNBUNT                                                 00914000
PRFPLQCB EQU   PRFSUNIT                                                 00915000
PRFPIUO  EQU   PRFPLQCB                                                 00916000
@NM00154 EQU   IEDQPRF+16                                               00917000
PRFSVFFO EQU   @NM00154                                                 00918000
PRFSTAT1 EQU   IEDQPRF+20                                               00919000
PRFEOFN  EQU   PRFSTAT1                                                 00920000
PRFCORE  EQU   IEDQPRF+21                                               00921000
PRFXTRA  EQU   PRFCORE                                                  00922000
PRFSCAN  EQU   IEDQPRF+24                                               00923000
PRFTQBCK EQU   IEDQPRF+26                                               00924000
PRFNTXT  EQU   PRFTQBCK                                                 00925000
PRFEOBOF EQU   PRFNTXT                                                  00926000
PRFCHDR  EQU   IEDQPRF+32                                               00927000
PRFHQBCK EQU   IEDQPRF+35                                               00928000
IEDPF1   EQU   0                                                        00929000
PRF1FLG1 EQU   IEDPF1+3                                                 00930000
PRF1WD2  EQU   IEDPF1+4                                                 00931000
PRF1SEQP EQU   PRF1WD2                                                  00932000
PRF1SQID EQU   PRF1SEQP                                                 00933000
PRF1TAG1 EQU   PRF1SQID                                                 00934000
IEDPF2   EQU   0                                                        00935000
PRF2FLG2 EQU   IEDPF2                                                   00936000
PRF2WD2  EQU   IEDPF2+4                                                 00937000
IEDQQCB  EQU   0                                                        00938000
QCBDSFLG EQU   IEDQQCB                                                  00939000
QCBDISK  EQU   QCBDSFLG                                                 00940000
QCBELCHN EQU   IEDQQCB+1                                                00941000
QCBSTCHN EQU   IEDQQCB+9                                                00942000
QCBEOLDT EQU   IEDQQCB+16                                               00943000
QCBBYTE1 EQU   QCBEOLDT+1                                               00944000
QCBLKRLN EQU   IEDQQCB+18                                               00945000
QCBRETCT EQU   QCBLKRLN                                                 00946000
QCBSTAT  EQU   IEDQQCB+19                                               00947000
QCBINSRC EQU   IEDQQCB+21                                               00948000
@NM00164 EQU   QCBINSRC                                                 00949000
QCBTSOF2 EQU   @NM00164+1                                               00950000
QCBTSOF1 EQU   @NM00164+2                                               00951000
QCBINTVL EQU   IEDQQCB+24                                               00952000
QCBPREN  EQU   IEDQQCB+28                                               00953000
QCBLKRRN EQU   QCBPREN+1                                                00954000
QCBDCBAD EQU   IEDQQCB+33                                               00955000
QCBFLAG  EQU   IEDQQCB+36                                               00956000
IEDQPQCB EQU   0                                                        00957000
QCBFHDLZ EQU   IEDQPQCB+3                                               00958000
QCBPFEFO EQU   QCBFHDLZ+1                                               00959000
QCBFHDTZ EQU   IEDQPQCB+6                                               00960000
QCBINTLF EQU   IEDQPQCB+12                                              00961000
IEDNQCB  EQU   0                                                        00962000
QCBSTAT1 EQU   IEDNQCB+4                                                00963000
QCBPLCBA EQU   IEDNQCB+5                                                00964000
IEDTH    EQU   0                                                        00965000
TTHBYTE0 EQU   IEDTH                                                    00966000
TTHSNF   EQU   IEDTH+6                                                  00967000
TTHTAG   EQU   TTHSNF                                                   00968000
TTHTAG1  EQU   TTHTAG                                                   00969000
TTHDCF   EQU   IEDTH+8                                                  00970000
DSPCHAIN EQU   12                                                       00971000
DSPLIFO  EQU   56                                                       00972000
DSPLIFOR EQU   60                                                       00973000
DSPLIST  EQU   8                                                        00974000
DSPPRIO  EQU   48                                                       00975000
DSPPRIOR EQU   52                                                       00976000
DSPTRACE EQU   64                                                       00977000
DSPTSTQ  EQU   32                                                       00978000
DSPTSTQR EQU   36                                                       00979000
DSPUNAV  EQU   40                                                       00980000
DSPUNAVR EQU   44                                                       00981000
DSPWAIT  EQU   16                                                       00982000
QCBLDCB  EQU   0                                                        00983000
LCBRSPIN EQU   LCBIOBSN                                                 00984000
LCBLUSNS EQU   LCBRSPIN+5                                               00985000
LCBSCPRS EQU   LCBRSPIN+9                                               00986000
LCBCSWU1 EQU   LCBSCPRS+2                                               00987000
LCBRSPFG EQU   LCBRSPIN+15                                              00988000
LCBCOREQ EQU   LCBTPCD                                                  00989000
@NM00134 EQU   LCBCPA+40                                                00990000
LCBQNX   EQU   LCBERCCW                                                 00991000
LCBQNXMN EQU   LCBQNX                                                   00992000
LCBCANCL EQU   LCBSAVSN                                                 00993000
LCBCANFG EQU   LCBCANCL                                                 00994000
READBTU  EQU   LCBCCW2+5                                                00995000
CPA      EQU   LCBCCW1                                                  00996000
CPAOPRE  EQU   CPA+4                                                    00997000
PRFSHDR  EQU   IEDQPRF+42                                               00998000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00999000
@NM00171 EQU   CPA                                                      01000000
@NM00142 EQU   LCBCANCL+3                                               01001000
LCBCANTH EQU   LCBCANCL+1                                               01002000
@NM00141 EQU   LCBCANFG                                                 01003000
LCBCANCD EQU   LCBCANFG                                                 01004000
@NM00140 EQU   LCBCANFG                                                 01005000
LCBCANEB EQU   LCBCANFG                                                 01006000
LCBCANXT EQU   LCBCANFG                                                 01007000
LCBUNADD EQU   LCBQNX+21                                                01008000
LCBUASZE EQU   LCBQNX+20                                                01009000
LCBDSTEA EQU   LCBQNX+16                                                01010000
@NM00139 EQU   LCBQNX+8                                                 01011000
LCBIOSBS EQU   LCBQNX+5                                                 01012000
@NM00138 EQU   LCBQNX+4                                                 01013000
LCBSTSAV EQU   LCBQNX+1                                                 01014000
@NM00137 EQU   LCBQNXMN                                                 01015000
LCBNX509 EQU   LCBQNXMN                                                 01016000
LCBNX162 EQU   LCBQNXMN                                                 01017000
LCBNX142 EQU   LCBQNXMN                                                 01018000
LCBNX064 EQU   LCBQNXMN                                                 01019000
@NM00136 EQU   @NM00134+4                                               01020000
LCBNCPPT EQU   @NM00134+1                                               01021000
@NM00135 EQU   @NM00134                                                 01022000
LCBWRSCH EQU   LCBCOREQ+8                                               01023000
LCBCQLNK EQU   LCBCOREQ+4                                               01024000
LCBCQELE EQU   LCBCOREQ                                                 01025000
LCBPAKCH EQU   LCBRSPIN+16                                              01026000
@NM00133 EQU   LCBRSPFG                                                 01027000
LCBRSRH  EQU   LCBRSPFG                                                 01028000
LCBEXPI  EQU   LCBRSPFG                                                 01029000
@NM00132 EQU   LCBRSPIN+12                                              01030000
LCBUSUE1 EQU   LCBCSWU1                                                 01031000
@NM00131 EQU   LCBCSWU1                                                 01032000
@NM00130 EQU   LCBSCPRS+1                                               01033000
LCBDFCMD EQU   LCBSCPRS                                                 01034000
LCBUSER  EQU   LCBLUSNS+2                                               01035000
LCBSMIN  EQU   LCBLUSNS+1                                               01036000
LCBSMAJ  EQU   LCBLUSNS                                                 01037000
LCBRHSV  EQU   LCBRSPIN+2                                               01038000
LCBSNS0  EQU   LCBRSPIN+1                                               01039000
@NM00129 EQU   LCBRSPIN                                                 01040000
TTHTAG2  EQU   TTHTAG+1                                                 01041000
@NM00170 EQU   TTHTAG1                                                  01042000
TTHTAGS  EQU   TTHTAG1                                                  01043000
TTHOAF   EQU   IEDTH+4                                                  01044000
TTHDAF   EQU   IEDTH+2                                                  01045000
TTHBYTE1 EQU   IEDTH+1                                                  01046000
TTHEFI   EQU   TTHBYTE0                                                 01047000
@NM00169 EQU   TTHBYTE0                                                 01048000
TTHEBIU  EQU   TTHBYTE0                                                 01049000
TTHBBIU  EQU   TTHBYTE0                                                 01050000
TTHFTYPE EQU   TTHBYTE0                                                 01051000
QCBTTCIN EQU   QCBPLCBA+1                                               01052000
@NM00168 EQU   QCBPLCBA                                                 01053000
@NM00167 EQU   QCBSTAT1                                                 01054000
QCBFLUSH EQU   QCBSTAT1                                                 01055000
QCBNDXRQ EQU   QCBSTAT1                                                 01056000
QCBESIG  EQU   QCBSTAT1                                                 01057000
QCBRCVRQ EQU   QCBSTAT1                                                 01058000
QCBSNDRQ EQU   QCBSTAT1                                                 01059000
QCBWAITC EQU   QCBSTAT1                                                 01060000
QCBPLCBN EQU   QCBSTAT1                                                 01061000
QCBCHAIN EQU   IEDNQCB                                                  01062000
QCBPQBCK EQU   IEDQPQCB+25                                              01063000
QCBPRIPQ EQU   IEDQPQCB+24                                              01064000
QCBCFHDR EQU   IEDQPQCB+21                                              01065000
QCBLFEFO EQU   IEDQPQCB+18                                              01066000
QCBFFEFO EQU   IEDQPQCB+15                                              01067000
QCBPREVF EQU   QCBINTLF                                                 01068000
QCBINTFF EQU   IEDQPQCB+9                                               01069000
QCBDATSQ EQU   QCBFHDTZ+1                                               01070000
@NM00166 EQU   QCBFHDTZ                                                 01071000
@NM00165 EQU   QCBPFEFO                                                 01072000
QCBDATFL EQU   QCBFHDLZ                                                 01073000
QCBDNHDR EQU   IEDQPQCB                                                 01074000
QCBQBACK EQU   IEDQQCB+37                                               01075000
QCBCKPT  EQU   QCBFLAG                                                  01076000
QCBPROC  EQU   QCBFLAG                                                  01077000
QCBSDFFO EQU   QCBFLAG                                                  01078000
QCBTERMQ EQU   QCBFLAG                                                  01079000
QCBRSRV  EQU   QCBFLAG                                                  01080000
QCBREAD  EQU   QCBFLAG                                                  01081000
QCBNOBRK EQU   QCBFLAG                                                  01082000
QCBTSSES EQU   QCBFLAG                                                  01083000
QCBLGBAD EQU   QCBDCBAD                                                 01084000
QCBRELLN EQU   IEDQQCB+32                                               01085000
QCBTJID  EQU   QCBLKRRN+1                                               01086000
QCBCARCT EQU   QCBLKRRN                                                 01087000
QCBPRLVL EQU   QCBPREN                                                  01088000
QCBMSGCT EQU   IEDQQCB+26                                               01089000
QCBEXTO  EQU   QCBINTVL                                                 01090000
QCBDISC  EQU   QCBTSOF1                                                 01091000
QCBDELAY EQU   QCBTSOF1                                                 01092000
QCBPARTO EQU   QCBTSOF1                                                 01093000
QCBSATRD EQU   QCBTSOF1                                                 01094000
QCBNOBUF EQU   QCBTSOF1                                                 01095000
QCBTPUT  EQU   QCBTSOF1                                                 01096000
QCBTGET  EQU   QCBTSOF1                                                 01097000
QCBWRBRK EQU   QCBTSOF1                                                 01098000
QCBSATLC EQU   QCBTSOF2                                                 01099000
QCBSATTI EQU   QCBTSOF2                                                 01100000
QCBSATCH EQU   QCBTSOF2                                                 01101000
QCBSIMRD EQU   QCBTSOF2                                                 01102000
QCBDSSMI EQU   QCBTSOF2                                                 01103000
QCBPOSTO EQU   QCBTSOF2                                                 01104000
QCBBUFQ  EQU   QCBTSOF2                                                 01105000
QCBINHBN EQU   QCBTSOF2                                                 01106000
QCBSATCT EQU   @NM00164                                                 01107000
QCBSCBOF EQU   IEDQQCB+20                                               01108000
QCBTIME  EQU   QCBSTAT                                                  01109000
QCBCLOCK EQU   QCBSTAT                                                  01110000
QCBSCHDL EQU   QCBSTAT                                                  01111000
QCBSMODE EQU   QCBSTAT                                                  01112000
QCBSEND  EQU   QCBSTAT                                                  01113000
QCBBUFRD EQU   QCBSTAT                                                  01114000
QCBTRMHO EQU   QCBSTAT                                                  01115000
QCBEOM   EQU   QCBSTAT                                                  01116000
QCBHUCT  EQU   QCBRETCT                                                 01117000
QCBIEND  EQU   QCBRETCT                                                 01118000
QCBEND   EQU   QCBRETCT                                                 01119000
QCBNL    EQU   QCBRETCT                                                 01120000
QCBLOGCT EQU   QCBRETCT                                                 01121000
@NM00163 EQU   QCBBYTE1                                                 01122000
QCBRITRM EQU   QCBBYTE1                                                 01123000
@NM00162 EQU   QCBEOLDT                                                 01124000
QCBSLINK EQU   IEDQQCB+13                                               01125000
QCBSTPRI EQU   IEDQQCB+12                                               01126000
QCBSTVTO EQU   IEDQQCB+8                                                01127000
QCBLINK  EQU   IEDQQCB+5                                                01128000
QCBPRI   EQU   IEDQQCB+4                                                01129000
QCBCNTEN EQU   QCBELCHN+2                                               01130000
@NM00161 EQU   QCBELCHN+2                                               01131000
@NM00160 EQU   QCBELCHN                                                 01132000
QCBHELD  EQU   QCBDSFLG                                                 01133000
QCBFQCB  EQU   QCBDSFLG                                                 01134000
QCBDRQQ  EQU   QCBDSFLG                                                 01135000
QCBALTMH EQU   QCBDSFLG                                                 01136000
QCBREUS  EQU   QCBDISK                                                  01137000
QCBNREUS EQU   QCBDISK                                                  01138000
QCBCORE  EQU   QCBDSFLG                                                 01139000
QCBTSQ   EQU   QCBDSFLG                                                 01140000
PRF2SEQP EQU   PRF2WD2                                                  01141000
@NM00159 EQU   IEDPF2+1                                                 01142000
@NM00158 EQU   PRF2FLG2                                                 01143000
PRF2TERM EQU   PRF2FLG2                                                 01144000
PRF2SMI  EQU   PRF2FLG2                                                 01145000
PRF2FORM EQU   PRF2FLG2                                                 01146000
PRF2TNTI EQU   PRF2FLG2                                                 01147000
PRF1RULN EQU   PRF1SEQP+2                                               01148000
PRF1TAG2 EQU   PRF1SQID+1                                               01149000
@NM00157 EQU   PRF1TAG1                                                 01150000
PRF1TAGS EQU   PRF1TAG1                                                 01151000
@NM00156 EQU   PRF1FLG1                                                 01152000
PRF1LOGD EQU   PRF1FLG1                                                 01153000
PRF1USS  EQU   PRF1FLG1                                                 01154000
PRF1FORM EQU   PRF1FLG1                                                 01155000
PRF1EXPI EQU   PRF1FLG1                                                 01156000
PRF1FIDI EQU   PRF1FLG1                                                 01157000
PRF1RH   EQU   IEDPF1                                                   01158000
PRFDEST  EQU   IEDQPRF+40                                               01159000
PRFISEQ  EQU   IEDQPRF+38                                               01160000
PRFSTXT  EQU   PRFHQBCK                                                 01161000
PRFNHDR  EQU   PRFCHDR                                                  01162000
PRFCRCD  EQU   IEDQPRF+29                                               01163000
PRFSVSEQ EQU   PRFNTXT+1                                                01164000
PRFSVPRI EQU   PRFEOBOF                                                 01165000
PRFISIZE EQU   PRFSCAN+1                                                01166000
@NM00155 EQU   PRFSCAN                                                  01167000
PRFEOB   EQU   PRFXTRA+1                                                01168000
PRFSTSO  EQU   PRFXTRA                                                  01169000
PRFNHDRN EQU   PRFSTAT1                                                 01170000
PRFNLSTN EQU   PRFSTAT1                                                 01171000
PRFLOCK  EQU   PRFEOFN                                                  01172000
PRFDUPLN EQU   PRFSTAT1                                                 01173000
PRFTSMSG EQU   PRFSTAT1                                                 01174000
PRFITCPN EQU   PRFSTAT1                                                 01175000
PRFERMGN EQU   PRFSTAT1                                                 01176000
PRFCNCLN EQU   PRFSTAT1                                                 01177000
PRFSVFLG EQU   @NM00154+3                                               01178000
PRFSIZE  EQU   PRFSVFFO+2                                               01179000
PRFSRCE  EQU   PRFSVFFO                                                 01180000
PRFLCB   EQU   IEDQPRF+13                                               01181000
@NM00153 EQU   PRFTICC                                                  01182000
@NM00152 EQU   PRFTICC                                                  01183000
@NM00151 EQU   PRFTICC                                                  01184000
PRFTICON EQU   PRFTICC                                                  01185000
@NM00150 EQU   PRFTICC                                                  01186000
@NM00149 EQU   PRFTICC                                                  01187000
PRFBFMM  EQU   PRFTICC                                                  01188000
PRFEOMSG EQU   PRFTICC                                                  01189000
PRFCOUNT EQU   PRFLINK+1                                                01190000
@NM00148 EQU   PRFLINK                                                  01191000
PRFFLAGS EQU   PRFPRI                                                   01192000
PRFIOADR EQU   PRFQCBA                                                  01193000
LCBERADR EQU   LCBXRADR+1                                               01194000
LCBPCIRC EQU   LCBXRADR                                                 01195000
LCBDCT3  EQU   LCBXDCT+2                                                01196000
LCBDCT2  EQU   LCBXDCT+1                                                01197000
LCBDCT1  EQU   LCBXDCT                                                  01198000
@NM00147 EQU   LCBXFLAG                                                 01199000
LCBERPND EQU   LCBXFLAG                                                 01200000
LCBSRCPF EQU   LCBXFLAG                                                 01201000
LCBGPCTV EQU   LCBXFLAG                                                 01202000
@NM00146 EQU   LCBXFLAG                                                 01203000
@NM00145 EQU   LCBXFLAG                                                 01204000
@NM00144 EQU   LCBXFLAG                                                 01205000
@NM00143 EQU   LCBXFLAG                                                 01206000
LCBCCW10 EQU   LCBCPA+72                                                01207000
LCBCCW9  EQU   LCBCPA+64                                                01208000
LCBCCW8  EQU   LCBCPA+56                                                01209000
LCBCCW7  EQU   LCBCPA+48                                                01210000
LCBCCW6  EQU   LCBCPA+40                                                01211000
LCBCP    EQU   LCBQEBPL+4                                               01212000
LCBIOSB  EQU   LCBQEBPL+1                                               01213000
LCBSIO   EQU   LCBQEBPL                                                 01214000
LCBCCW4  EQU   LCBCPA+24                                                01215000
LCBCCW3  EQU   LCBCPA+16                                                01216000
@NM00128 EQU   LCBERCCW+16                                              01217000
LCBATL05 EQU   LCBERCCW+8                                               01218000
@NM00127 EQU   LCBERCCW                                                 01219000
LCBCSWSV EQU   LCBSAVSN+1                                               01220000
LCBSNSV  EQU   LCBSAVSN                                                 01221000
LCBBFSNS EQU   LCBRSPSV                                                 01222000
LCBWAITC EQU   LCBTPCD+5                                                01223000
LCBINPAK EQU   LCBSTAT6                                                 01224000
LCBMHBID EQU   LCBSTAT6                                                 01225000
LCBRTRRO EQU   LCBSTAT6                                                 01226000
LCBHDRPD EQU   LCBSTAT6                                                 01227000
LCBCHN   EQU   LCBSTAT6                                                 01228000
LCBBFRSV EQU   LCBTPCD+1                                                01229000
@NM00126 EQU   LCBSTAT5                                                 01230000
LCBLUS   EQU   LCBSTAT5                                                 01231000
LCBLUNIT EQU   LCBSTAT5                                                 01232000
LCBPERM  EQU   LCBSTAT5                                                 01233000
LCBNXCMD EQU   LCBBFRW                                                  01234000
LCBERMSK EQU   LCBOBRCH                                                 01235000
LCBSCBA  EQU   IEDQLCB+93                                               01236000
LCBOLT   EQU   LCBMSGFM                                                 01237000
LCBEOT   EQU   LCBMSGFM                                                 01238000
LCBENQ   EQU   LCBMSGFM                                                 01239000
LCBTTD   EQU   LCBMSGFM                                                 01240000
LCBRSTRT EQU   LCBMSGFM                                                 01241000
LCBVSTRT EQU   LCBMSGFM                                                 01242000
LCBACKI  EQU   LCBMSGFM                                                 01243000
LCBNAK   EQU   LCBMSGFM                                                 01244000
LCBTTCIN EQU   IEDQLCB+90                                               01245000
@NM00125 EQU   LCBRBCT2                                                 01246000
LCBDCNT  EQU   LCBRBCT2                                                 01247000
LCBCOMPL EQU   LCBDLNKN                                                 01248000
LCBPRCPG EQU   LCBERBST                                                 01249000
LCBERROR EQU   LCBERBST                                                 01250000
@NM00124 EQU   LCBERBST                                                 01251000
LCBINQ   EQU   LCBERBST                                                 01252000
LCBRDERR EQU   LCBERBST                                                 01253000
LCBEOMSG EQU   LCBERBST                                                 01254000
LCBMSG   EQU   LCBERBST                                                 01255000
LCBERBLK EQU   IEDQLCB+81                                               01256000
LCBERBKY EQU   LCBERB                                                   01257000
LCBRECAD EQU   IEDQLCB+73                                               01258000
@NM00123 EQU   LCBTSTSW                                                 01259000
@NM00122 EQU   LCBTSTSW                                                 01260000
@NM00121 EQU   LCBTSTSW                                                 01261000
@NM00120 EQU   LCBTSTSW                                                 01262000
@NM00119 EQU   LCBTSTSW                                                 01263000
@NM00118 EQU   LCBTSTSW                                                 01264000
@NM00117 EQU   LCBTSTSW                                                 01265000
LCBCONCT EQU   LCBTSTSW                                                 01266000
LCBRESP  EQU   LCBSTAT2                                                 01267000
LCBATTN  EQU   LCBSYNC                                                  01268000
LCBNEGRP EQU   LCBSTAT2                                                 01269000
LCBSNDPR EQU   LCBSTAT2                                                 01270000
LCBCONNN EQU   LCBBEOTN                                                 01271000
LCBMSGNN EQU   LCBSTAT2                                                 01272000
LCBTRACE EQU   LCBSTAT2                                                 01273000
LCBSENDN EQU   LCBSTAT1                                                 01274000
LCBFREEN EQU   LCBSTAT1                                                 01275000
LCBCONT  EQU   LCBSTAT1                                                 01276000
LCBINITN EQU   LCBSTAT1                                                 01277000
LCBOCNI  EQU   LCBSTAT1                                                 01278000
LCBOCWTN EQU   LCBSTAT1                                                 01279000
LCBRCLLN EQU   LCBSTAT1                                                 01280000
LCBRECOF EQU   IEDQLCB+68                                               01281000
LCBRDBFR EQU   LCBRCBFR                                                 01282000
LCBUCBX  EQU   IEDQLCB+64                                               01283000
LCBTTBIN EQU   LCBERRCT                                                 01284000
@NM00116 EQU   LCBINCAM                                                 01285000
LCBGETMN EQU   LCBINCAM                                                 01286000
@NM00115 EQU   LCBRESTR+1                                               01287000
LCBCMDSV EQU   LCBRESTR                                                 01288000
LCBPCILK EQU   LCBDCBPT                                                 01289000
LCBSTART EQU   LCBIOBSN+16                                              01290000
LCBAP4OL EQU   LCBSIOCC                                                 01291000
LCBAP3OL EQU   LCBSIOCC                                                 01292000
LCBAP2OL EQU   LCBSIOCC                                                 01293000
LCBAP1OL EQU   LCBSIOCC                                                 01294000
LCBSIOC2 EQU   LCBSIOCC                                                 01295000
LCBSIOC1 EQU   LCBSIOCC                                                 01296000
@NM00114 EQU   LCBSIOCC                                                 01297000
LCBCSWRC EQU   LCBCSW+5                                                 01298000
LCBCSCHC EQU   LCBCSWCS                                                 01299000
LCBCSICC EQU   LCBCSWCS                                                 01300000
LCBCSCCC EQU   LCBCSWCS                                                 01301000
LCBCSCDC EQU   LCBCSWCS                                                 01302000
LCBCSPTC EQU   LCBCSWCS                                                 01303000
LCBCSPGC EQU   LCBCSWCS                                                 01304000
LCBCSIL  EQU   LCBCSWCS                                                 01305000
LCBCSPCI EQU   LCBCSWCS                                                 01306000
LCBUSUE  EQU   LCBCSWUS                                                 01307000
LCBUSUC  EQU   LCBCSWUS                                                 01308000
LCBUSDE  EQU   LCBCSWUS                                                 01309000
LCBUSCE  EQU   LCBCSWUS                                                 01310000
LCBUSBSY EQU   LCBCSWUS                                                 01311000
LCBUSCUE EQU   LCBCSWUS                                                 01312000
LCBUSSM  EQU   LCBCSWUS                                                 01313000
LCBUSAT  EQU   LCBCSWUS                                                 01314000
LCBOBR   EQU   LCBFLAG3                                                 01315000
LCBOBRRD EQU   LCBFLAG3                                                 01316000
LCBIOMSG EQU   LCBFLAG3                                                 01317000
LCBSOHC  EQU   LCBFLAG3                                                 01318000
LCBRLAD  EQU   LCBFLAG3                                                 01319000
LCBSOHR  EQU   LCBFLAG3                                                 01320000
@NM00113 EQU   LCBFLAG3                                                 01321000
LCBECBPT EQU   LCBIOBSN+4                                               01322000
LCBECBCC EQU   LCBIOBSN+3                                               01323000
LCBSENS1 EQU   LCBSNS+1                                                 01324000
LCBABORT EQU   LCBTMOUT                                                 01325000
LCBNOTIN EQU   LCBLOSDT                                                 01326000
LCBOVRUN EQU   LCBSENS0                                                 01327000
LCBDATCK EQU   LCBSENS0                                                 01328000
LCBEQUCK EQU   LCBSENS0                                                 01329000
LCBBUSCK EQU   LCBSENS0                                                 01330000
LCBINTRQ EQU   LCBSENS0                                                 01331000
LCBCMDRJ EQU   LCBSENS0                                                 01332000
LCBFLAG2 EQU   LCBIOBSN                                                 01333000
@NM00112 EQU   LCBFLAG1                                                 01334000
LCBUNREL EQU   LCBFLAG1                                                 01335000
LCBEXCPN EQU   LCBFLAG1                                                 01336000
@NM00111 EQU   LCBFLAG1                                                 01337000
LCBERPIN EQU   LCBFLAG1                                                 01338000
@NM00110 EQU   LCBFLAG1                                                 01339000
LCBISZE  EQU   IEDQLCB+28                                               01340000
LCBLNENT EQU   LCBSCBDA+1                                               01341000
@NM00109 EQU   LCBSCBDA                                                 01342000
LCBCPGMH EQU   LCBSTAT4                                                 01343000
LCBREAL  EQU   LCBPHASE                                                 01344000
@NM00108 EQU   LCBSTAT4                                                 01345000
LCBACTRQ EQU   LCBSTAT4                                                 01346000
LCBIPLRQ EQU   LCBSTAT4                                                 01347000
LCBDACRQ EQU   LCBSTAT4                                                 01348000
LCBDMPRQ EQU   LCBSTAT4                                                 01349000
@NM00107 EQU   LCBLKMDE                                                 01350000
LCBLOCKI EQU   LCBLKMDE                                                 01351000
LCBLOCKR EQU   LCBLKMDE                                                 01352000
LCBHMFLG EQU   LCBLKMDE                                                 01353000
LCBBDFLG EQU   LCBLKMDE                                                 01354000
@NM00106 EQU   LCBINSRC                                                 01355000
LCBABRTN EQU   LCBCHAIN                                                 01356000
LCBCTLMD EQU   LCBTETEN                                                 01357000
LCBBFRSZ EQU   LCBCHAIN                                                 01358000
LCBUREQN EQU   LCBCHAIN                                                 01359000
LCBNORTY EQU   LCBCHAIN                                                 01360000
LCBERMSG EQU   LCBCHAIN                                                 01361000
LCBEXCP  EQU   LCBCHAIN                                                 01362000
LCBINVRQ EQU   LCBSCRNN                                                 01363000
LCB2741N EQU   LCBTSOB                                                  01364000
LCBINHBN EQU   LCBTSOB                                                  01365000
LCBCIRCD EQU   LCBTSOB                                                  01366000
LCBPREP  EQU   LCBTSOB                                                  01367000
LCBSOPL  EQU   LCBTSOB                                                  01368000
LCBSATRD EQU   LCBTSOB                                                  01369000
LCBTSBUF EQU   LCBTSOB                                                  01370000
LCBWRBRK EQU   LCBTSOB                                                  01371000
LCBTDL   EQU   IEDQLCB+18                                               01372000
LCBEOLTD EQU   IEDQLCB+16                                               01373000
LCBRSLNK EQU   IEDQLCB+13                                               01374000
LCBRSPRI EQU   IEDQLCB+12                                               01375000
LCBSTCBA EQU   IEDQLCB+9                                                01376000
LCBRSKEY EQU   IEDQLCB+8                                                01377000
LCBLINK  EQU   LCBRCB+5                                                 01378000
LCBKEY   EQU   LCBRCB                                                   01379000
CCWCOUNT EQU   CCW+6                                                    01380000
CCWRSV   EQU   CCW+5                                                    01381000
@NM00105 EQU   CCWFLAGS                                                 01382000
CCWIDA   EQU   CCWFLAGS                                                 01383000
CCWPCI   EQU   CCWFLAGS                                                 01384000
CCWSKIP  EQU   CCWFLAGS                                                 01385000
CCWSLI   EQU   CCWFLAGS                                                 01386000
CCWCC    EQU   CCWFLAGS                                                 01387000
CCWCD    EQU   CCWFLAGS                                                 01388000
CCWADDR  EQU   CCW+1                                                    01389000
SAVTLLCB EQU   IEDNSVTD+316                                             01390000
SAVTBITN EQU   IEDNSVTD+312                                             01391000
@NM00104 EQU   SAVTCKQB+8                                               01392000
@NM00103 EQU   SAVTCKEC+1                                               01393000
@NM00102 EQU   SAVTCKCC                                                 01394000
SAVTCKPO EQU   SAVTCKCC                                                 01395000
SAVTCKWA EQU   SAVTCKCC                                                 01396000
SAVTCKCH EQU   SAVTCKTB+1                                               01397000
SAVTCKVT EQU   SAVTCKTB                                                 01398000
@NM00101 EQU   IEDNSVTD+297                                             01399000
SAVTRDFG EQU   SAVTRDRV+12                                              01400000
@NM00100 EQU   SAVTRDRV+5                                               01401000
SAVTRDPY EQU   SAVTRDRV+4                                               01402000
SAVTRDQB EQU   SAVTRDRV+1                                               01403000
SAVTRDKY EQU   SAVTRDRV                                                 01404000
SAVTNID  EQU   IEDNSVTD+280                                             01405000
SAVTDVAS EQU   IEDNSVTD+276                                             01406000
SAVTPLSZ EQU   IEDNSVTD+274                                             01407000
@NM00099 EQU   IEDNSVTD+273                                             01408000
SAVTSUBL EQU   IEDNSVTD+272                                             01409000
@NM00098 EQU   SAVTZELM+1                                               01410000
SAVTSUBM EQU   SAVTZELM                                                 01411000
SAVTMHDX EQU   IEDNSVTD+268                                             01412000
SAVTNAT1 EQU   IEDNSVTD+266                                             01413000
SAVTSH20 EQU   IEDNSVTD+264                                             01414000
SAVTLCBS EQU   IEDNSVTD+260                                             01415000
SAVTRNMP EQU   IEDNSVTD+256                                             01416000
SAVTTNTX EQU   IEDNSVTD+252                                             01417000
SAVTNAX  EQU   IEDNSVTD+248                                             01418000
SAVTSUBV EQU   IEDNSVTD+247                                             01419000
SAVTSUBA EQU   IEDNSVTD+246                                             01420000
SAVTSIBC EQU   IEDNSVTD+244                                             01421000
SAVTBSM  EQU   IEDNSVTD+240                                             01422000
SAVTSCPT EQU   SAVTTCPU                                                 01423000
SAVTRQTG EQU   IEDNSVTD+236                                             01424000
SAVTRQCH EQU   IEDNSVTD+232                                             01425000
SAVTMAND EQU   IEDNSVTD+228                                             01426000
SAVTSPLN EQU   IEDNSVTD+224                                             01427000
SAVTNADL EQU   IEDNSVTD+222                                             01428000
SAVTNATL EQU   IEDNSVTD+220                                             01429000
SAVTMHTB EQU   IEDNSVTD+216                                             01430000
SAVTSSMH EQU   IEDNSVTD+212                                             01431000
SAVTQRS  EQU   IEDNSVTD+208                                             01432000
SAVTRQIN EQU   IEDNSVTD+204                                             01433000
SAVTDFCO EQU   IEDNSVTD+200                                             01434000
SAVTSAO  EQU   IEDNSVTD+196                                             01435000
SAVTSARI EQU   IEDNSVTD+192                                             01436000
SAVTSAC  EQU   IEDNSVTD+188                                             01437000
SAVTSAI  EQU   IEDNSVTD+184                                             01438000
SAVTCSCI EQU   IEDNSVTD+180                                             01439000
SAVTSSRP EQU   IEDNSVTD+176                                             01440000
SAVTSSRQ EQU   IEDNSVTD+172                                             01441000
SAVTSCLU EQU   IEDNSVTD+168                                             01442000
SAVTXTRQ EQU   IEDNSVTD+164                                             01443000
SAVTMVBF EQU   IEDNSVTD+160                                             01444000
@NM00097 EQU   IEDNSVTD+148                                             01445000
@NM00096 EQU   IEDNSVTD+136                                             01446000
SAVTXFMI EQU   IEDNSVTD+132                                             01447000
@NM00095 EQU   IEDNSVTD+124                                             01448000
SAVTXFMO EQU   IEDNSVTD+120                                             01449000
@NM00094 EQU   IEDNSVTD+116                                             01450000
SAVTSSSR EQU   IEDNSVTD+112                                             01451000
SAVTSCPQ EQU   IEDNSVTD+108                                             01452000
SAVTSLCB EQU   IEDNSVTD+104                                             01453000
SAVTLUSR EQU   IEDNSVTD+100                                             01454000
@NM00093 EQU   SAVTLUSQ+8                                               01455000
SAVTLUSP EQU   SAVTLUSQ+4                                               01456000
SAVTLUSB EQU   SAVTLUSQ                                                 01457000
@NM00092 EQU   IEDNSVTD+84                                              01458000
SAVTSAT  EQU   IEDNSVTD+80                                              01459000
SAVTNAT  EQU   IEDNSVTD+76                                              01460000
SAVTCLUP EQU   IEDNSVTD+72                                              01461000
SAVTPIUT EQU   IEDNSVTD+68                                              01462000
SAVTRNTA EQU   IEDNSVTD+64                                              01463000
SAVTDNIR EQU   IEDNSVTD+60                                              01464000
SAVTCNIR EQU   IEDNSVTD+56                                              01465000
SAVTFLDH EQU   IEDNSVTD+52                                              01466000
SAVTSRTN EQU   IEDNSVTD+48                                              01467000
SAVTSREQ EQU   IEDNSVTD+44                                              01468000
SAVTFAIL EQU   IEDNSVTD+42                                              01469000
SAVTSUSE EQU   IEDNSVTD+40                                              01470000
SAVTSIB  EQU   IEDNSVTD+36                                              01471000
SAVTPRTN EQU   IEDNSVTD+32                                              01472000
@NM00091 EQU   IEDNSVTD+28                                              01473000
SAVTWH20 EQU   IEDNSVTD+26                                              01474000
SAVTPWT  EQU   IEDNSVTD+24                                              01475000
SAVTPRTQ EQU   IEDNSVTD+20                                              01476000
SAVTPREQ EQU   IEDNSVTD+16                                              01477000
SAVTPH20 EQU   IEDNSVTD+14                                              01478000
SAVTPUSE EQU   IEDNSVTD+12                                              01479000
SAVTPLCB EQU   IEDNSVTD+8                                               01480000
SAVTPOOL EQU   IEDNSVTD+4                                               01481000
SAVTPRMT EQU   SAVTDIAF                                                 01482000
SAVTVIRT EQU   SAVTDIAF                                                 01483000
AVTCPBNO EQU   IEDQAVTD+1172                                            01484000
AVTHRESS EQU   IEDQAVTD+1171                                            01485000
@NM00090 EQU   IEDQAVTD+1170                                            01486000
@NM00089 EQU   IEDQAVTD+1169                                            01487000
@NM00088 EQU   IEDQAVTD+1168                                            01488000
@NM00087 EQU   IEDQAVTD+1165                                            01489000
@NM00086 EQU   IEDQAVTD+1164                                            01490000
AVTHRESE EQU   @NM00085                                                 01491000
AVTRADDR EQU   IEDQAVTD+1156                                            01492000
AVTNADDR EQU   IEDQAVTD+1152                                            01493000
AVTHRESN EQU   IEDQAVTD+1148                                            01494000
AVTVOLRN EQU   IEDQAVTD+1144                                            01495000
AVTTOTNN EQU   IEDQAVTD+1140                                            01496000
AVTTRCYN EQU   IEDQAVTD+1136                                            01497000
AVTRCTRN EQU   IEDQAVTD+1132                                            01498000
AVTNOVON EQU   IEDQAVTD+1128                                            01499000
AVTADEBN EQU   IEDQAVTD+1124                                            01500000
AVTVOLRR EQU   IEDQAVTD+1120                                            01501000
AVTTOTNR EQU   IEDQAVTD+1116                                            01502000
AVTTRCYR EQU   IEDQAVTD+1112                                            01503000
AVTRCTRR EQU   IEDQAVTD+1108                                            01504000
AVTNOVOR EQU   IEDQAVTD+1104                                            01505000
AVTADEBR EQU   IEDQAVTD+1100                                            01506000
AVTLODPT EQU   IEDQAVTD+1096                                            01507000
AVTIOBN  EQU   IEDQAVTD+1092                                            01508000
AVTIOBR  EQU   IEDQAVTD+1088                                            01509000
AVTCPBPT EQU   IEDQAVTD+1084                                            01510000
AVTFCPB  EQU   IEDQAVTD+1080                                            01511000
@NM00084 EQU   IEDQAVTD+1076                                            01512000
AVTINCPQ EQU   IEDQAVTD+1072                                            01513000
@NM00083 EQU   IEDQAVTD+1068                                            01514000
@NM00082 EQU   IEDQAVTD+1065                                            01515000
@NM00081 EQU   AVTBIT4                                                  01516000
@NM00080 EQU   AVTBIT4                                                  01517000
@NM00079 EQU   AVTBIT4                                                  01518000
@NM00078 EQU   AVTBIT4                                                  01519000
@NM00077 EQU   AVTBIT4                                                  01520000
@NM00076 EQU   AVTBIT4                                                  01521000
@NM00075 EQU   AVTBIT4                                                  01522000
AVTRUFTN EQU   AVTBIT4                                                  01523000
@NM00074 EQU   IEDQAVTD+1060                                            01524000
AVTNOBFQ EQU   IEDQAVTD+1056                                            01525000
@NM00073 EQU   IEDQAVTD+1052                                            01526000
AVTDKENQ EQU   IEDQAVTD+1048                                            01527000
@NM00072 EQU   IEDQAVTD+1044                                            01528000
AVTDKAPQ EQU   IEDQAVTD+1040                                            01529000
AVTCOPY  EQU   IEDQAVTD+1036                                            01530000
AVTIA    EQU   IEDQAVTD+1032                                            01531000
AVTFL    EQU   IEDQAVTD+1028                                            01532000
@NM00071 EQU   IEDQAVTD+1024                                            01533000
AVTNCPBQ EQU   IEDQAVTD+1020                                            01534000
AVTTOTNC EQU   IEDQAVTD+1016                                            01535000
AVTCMAX  EQU   IEDQAVTD+1012                                            01536000
AVTCMIN  EQU   IEDQAVTD+1008                                            01537000
AVTHM02  EQU   IEDQAVTD+1004                                            01538000
AVTOPCIN EQU   IEDQAVTD+1002                                            01539000
AVTDCTLN EQU   IEDQAVTD+1000                                            01540000
AVTOPMSK EQU   IEDQAVTD+996                                             01541000
AVTDDFT  EQU   IEDQAVTD+992                                             01542000
AVTSTEAL EQU   IEDQAVTD+988                                             01543000
AVTOPTN  EQU   IEDQAVTD+984                                             01544000
AVTDSKCT EQU   IEDQAVTD+982                                             01545000
AVTCKRST EQU   IEDQAVTD+981                                             01546000
AVTSTAN  EQU   AVTBIT3                                                  01547000
AVTSTACN EQU   AVTBIT3                                                  01548000
AVTSTAIN EQU   AVTBIT3                                                  01549000
AVTSTAYN EQU   AVTBIT3                                                  01550000
AVTOLTBN EQU   AVTBIT3                                                  01551000
AVTTSAB  EQU   AVTBIT3                                                  01552000
AVTRFULN EQU   AVTBIT3                                                  01553000
AVTRECVN EQU   AVTBIT3                                                  01554000
@NM00070 EQU   AVTBIT2                                                  01555000
@NM00069 EQU   AVTBIT2                                                  01556000
AVTOPEIN EQU   AVTBIT2                                                  01557000
AVTSTRTN EQU   AVTBIT2                                                  01558000
AVTTOPOL EQU   AVTBIT2                                                  01559000
AVTCOPYN EQU   AVTBIT2                                                  01560000
AVTREUSN EQU   AVTBIT2                                                  01561000
AVTEXTSC EQU   AVTBIT2                                                  01562000
AVTDISKN EQU   AVTBIT1                                                  01563000
AVTQUCKN EQU   AVTBIT1                                                  01564000
AVTCLOSN EQU   AVTBIT1                                                  01565000
AVTREADN EQU   AVTBIT1                                                  01566000
AVTDLAYN EQU   AVTBIT1                                                  01567000
AVTAQTAN EQU   AVTBIT1                                                  01568000
AVTTSON  EQU   AVTBIT1                                                  01569000
AVTAPLKN EQU   AVTBIT1                                                  01570000
AVTDUMBR EQU   IEDQAVTD+976                                             01571000
AVTDLQX  EQU   IEDQAVTD+974                                             01572000
AVTINTLV EQU   IEDQAVTD+972                                             01573000
AVTSMCNT EQU   IEDQAVTD+970                                             01574000
AVTAVFCT EQU   IEDQAVTD+968                                             01575000
AVTOPCON EQU   IEDQAVTD+966                                             01576000
AVTOPCNT EQU   IEDQAVTD+964                                             01577000
AVTLNCNT EQU   IEDQAVTD+962                                             01578000
AVTHA16  EQU   IEDQAVTD+958                                             01579000
AVTHA7   EQU   IEDQAVTD+956                                             01580000
AVTHA4   EQU   IEDQAVTD+954                                             01581000
AVTHA3   EQU   IEDQAVTD+952                                             01582000
AVTHA2   EQU   IEDQAVTD+950                                             01583000
AVTGETMS EQU   IEDQAVTD+949                                             01584000
@NM00068 EQU   IEDQAVTD+948                                             01585000
AVTGETMD EQU   IEDQAVTD+944                                             01586000
AVTGETMN EQU   IEDQAVTD+940                                             01587000
AVTCWTOT EQU   IEDQAVTD+936                                             01588000
AVTCWINT EQU   IEDQAVTD+884                                             01589000
AVTDTRAP EQU   IEDQAVTD+880                                             01590000
@NM00067 EQU   IEDQAVTD+878                                             01591000
@NM00066 EQU   AVTIOTR                                                  01592000
AVTIOTRH EQU   AVTIOTR                                                  01593000
AVTIOTRE EQU   AVTIOTR                                                  01594000
@NM00065 EQU   AVTSUBT                                                  01595000
AVTSUBPT EQU   AVTSUBT                                                  01596000
AVTSUBON EQU   AVTSUBT                                                  01597000
AVTAFE30 EQU   IEDQAVTD+872                                             01598000
AVTAFE20 EQU   IEDQAVTD+868                                             01599000
AVTAFE10 EQU   IEDQAVTD+864                                             01600000
AVTCWEC2 EQU   IEDQAVTD+860                                             01601000
AVTCWPM2 EQU   IEDQAVTD+856                                             01602000
AVTCWTS2 EQU   IEDQAVTD+855                                             01603000
AVTCWTS1 EQU   IEDQAVTD+854                                             01604000
AVTCWCLD EQU   AVTCWFL2                                                 01605000
AVTCWRAP EQU   AVTCWFL2                                                 01606000
@NM00064 EQU   AVTCWFL2                                                 01607000
@NM00063 EQU   AVTCWFL2                                                 01608000
@NM00062 EQU   AVTCWFL2                                                 01609000
@NM00061 EQU   AVTCWFL2                                                 01610000
@NM00060 EQU   AVTCWFL2                                                 01611000
AVTCWACT EQU   AVTCWFL2                                                 01612000
@NM00059 EQU   AVTCWFL1                                                 01613000
@NM00058 EQU   AVTCWFL1                                                 01614000
@NM00057 EQU   AVTCWFL1                                                 01615000
@NM00056 EQU   AVTCWFL1                                                 01616000
@NM00055 EQU   AVTCWFL1                                                 01617000
@NM00054 EQU   AVTCWFL1                                                 01618000
@NM00053 EQU   AVTCWFL1                                                 01619000
AVTCOMWN EQU   AVTCWFL1                                                 01620000
AVTCWEC1 EQU   IEDQAVTD+848                                             01621000
AVTCWPM1 EQU   IEDQAVTD+844                                             01622000
AVTCAREA EQU   IEDQAVTD+840                                             01623000
AVTFZERO EQU   IEDQAVTD+836                                             01624000
AVTCADDR EQU   IEDQAVTD+832                                             01625000
AVTCOREC EQU   IEDQAVTD+828                                             01626000
@NM00052 EQU   IEDQAVTD+820                                             01627000
AVTCPBCB EQU   IEDQAVTD+816                                             01628000
@NM00051 EQU   IEDQAVTD+808                                             01629000
AVTDSIOB EQU   IEDQAVTD+804                                             01630000
@NM00050 EQU   IEDQAVTD+796                                             01631000
AVTCPRMB EQU   IEDQAVTD+792                                             01632000
@NM00049 EQU   IEDQAVTD+784                                             01633000
AVTCLOSB EQU   IEDQAVTD+780                                             01634000
@NM00048 EQU   IEDQAVTD+772                                             01635000
AVTACTIB EQU   IEDQAVTD+768                                             01636000
@NM00047 EQU   IEDQAVTD+764                                             01637000
AVTOLTEB EQU   IEDQAVTD+760                                             01638000
AVTOLTCH EQU   AVTOLTQB+1                                               01639000
AVTOLTVT EQU   AVTOLTQB                                                 01640000
@NM00046 EQU   AVTOPCQB+8                                               01641000
@NM00045 EQU   AVTOPCEC+1                                               01642000
@NM00044 EQU   AVTOPCCC                                                 01643000
AVTOPCPO EQU   AVTOPCCC                                                 01644000
AVTOPCWA EQU   AVTOPCCC                                                 01645000
AVTOPCCH EQU   AVTOPCOB+1                                               01646000
AVTOPCVT EQU   AVTOPCOB                                                 01647000
@NM00043 EQU   AVTCKPQB+9                                               01648000
AVTCKPTS EQU   AVTCKPQB+8                                               01649000
@NM00042 EQU   AVTCKPEC+1                                               01650000
@NM00041 EQU   AVTCKPCC                                                 01651000
AVTCKPPO EQU   AVTCKPCC                                                 01652000
AVTCKPWA EQU   AVTCKPCC                                                 01653000
AVTCKPCH EQU   AVTCKPTB+1                                               01654000
AVTCKPVT EQU   AVTCKPTB                                                 01655000
@NM00040 EQU   IEDQAVTD+724                                             01656000
@NM00039 EQU   IEDQAVTD+716                                             01657000
AVTSELCH EQU   IEDQAVTD+713                                             01658000
AVTBFRTN EQU   AVTBFRFG                                                 01659000
AVTTIMQ  EQU   IEDQAVTD+704                                             01660000
@NM00038 EQU   IEDQAVTD+700                                             01661000
AVTIMQPS EQU   IEDQAVTD+696                                             01662000
AVTINOUT EQU   IEDQAVTD+694                                             01663000
AVTREFTM EQU   IEDQAVTD+692                                             01664000
@NM00037 EQU   IEDQAVTD+680                                             01665000
AVTDELYB EQU   IEDQAVTD+676                                             01666000
AVTOCQPT EQU   IEDQAVTD+672                                             01667000
AVTTSOPT EQU   IEDQAVTD+668                                             01668000
AVTSUPPT EQU   IEDQAVTD+664                                             01669000
AVTCBQCB EQU   IEDQAVTD+660                                             01670000
AVTMSGS  EQU   IEDQAVTD+657                                             01671000
@NM00036 EQU   AVTSYSER                                                 01672000
@NM00035 EQU   AVTSYSER                                                 01673000
@NM00034 EQU   AVTSYSER                                                 01674000
@NM00033 EQU   AVTSYSER                                                 01675000
@NM00032 EQU   AVTSYSER                                                 01676000
@NM00031 EQU   AVTSYSER                                                 01677000
AVTCMAXN EQU   AVTSYSER                                                 01678000
AVTCMINN EQU   AVTSYSER                                                 01679000
AVT2260L EQU   IEDQAVTD+652                                             01680000
AVTABEPL EQU   AVTADBUF                                                 01681000
AVTHFF   EQU   AVTCLRHI+2                                               01682000
@NM00030 EQU   AVTCLRHI                                                 01683000
AVTCCLNK EQU   AVTCRELE+5                                               01684000
AVTCCPRI EQU   AVTCRELE+4                                               01685000
AVTCCQCB EQU   AVTCCELE+1                                               01686000
AVTCCKEY EQU   AVTCCELE                                                 01687000
AVTDELAD EQU   IEDQAVTD+632                                             01688000
AVTDELEM EQU   IEDQAVTD+628                                             01689000
AVTBSX   EQU   AVTCKLNK                                                 01690000
AVTOPETR EQU   AVTHG01                                                  01691000
@NM00029 EQU   AVTCKBYT                                                 01692000
AVTCKONQ EQU   AVTCKBYT                                                 01693000
@NM00028 EQU   AVTCKBYT                                                 01694000
@NM00027 EQU   AVTCKBYT                                                 01695000
@NM00026 EQU   AVTCKBYT                                                 01696000
@NM00025 EQU   AVTCKBYT                                                 01697000
@NM00024 EQU   AVTCKBYT                                                 01698000
@NM00023 EQU   AVTCKBYT                                                 01699000
AVTOPERT EQU   IEDQAVTD+618                                             01700000
AVTOPXCL EQU   IEDQAVTD+616                                             01701000
AVTOPERL EQU   IEDQAVTD+615                                             01702000
@NM00022 EQU   IEDQAVTD+614                                             01703000
AVTCKTIM EQU   IEDQAVTD+612                                             01704000
AVTCKELV EQU   IEDQAVTD+610                                             01705000
AVTCPRCD EQU   IEDQAVTD+609                                             01706000
AVTWARMN EQU   AVTCKELF                                                 01707000
AVTCRTLN EQU   AVTCKELF                                                 01708000
AVTCPIPN EQU   AVTCKELF                                                 01709000
AVTCCLCN EQU   AVTCKELF                                                 01710000
AVTCINCN EQU   AVTCKELF                                                 01711000
@NM00021 EQU   AVTCKELF                                                 01712000
AVTCMCPN EQU   AVTCKELF                                                 01713000
AVTNQBCK EQU   AVTCKELF                                                 01714000
AVTCKQAD EQU   IEDQAVTD+605                                             01715000
AVTSCBSZ EQU   IEDQAVTD+604                                             01716000
@NM00020 EQU   IEDQAVTD+600                                             01717000
AVTCKELE EQU   IEDQAVTD+596                                             01718000
@NM00019 EQU   AVTCKPEL+8                                               01719000
AVTCKRLK EQU   AVTCKPEL+5                                               01720000
AVTCKRPR EQU   AVTCKPEL+4                                               01721000
AVTCKRMQ EQU   AVTCKRMV+1                                               01722000
AVTCKRKY EQU   AVTCKRMV                                                 01723000
AVTHK    EQU   IEDQAVTD+576                                             01724000
AVTHI    EQU   IEDQAVTD+572                                             01725000
AVTIOT   EQU   IEDQAVTD+568                                             01726000
AVTNX    EQU   IEDQAVTD+564                                             01727000
AVTTONE  EQU   IEDQAVTD+560                                             01728000
AVTA3TL  EQU   IEDQAVTD+556                                             01729000
AVTDMECB EQU   IEDQAVTD+552                                             01730000
AVTABEND EQU   IEDQAVTD+546                                             01731000
AVTPLCBN EQU   IEDQAVTD+544                                             01732000
@NM00018 EQU   AVTSAVTP+1                                               01733000
@NM00017 EQU   AVTSAVTF                                                 01734000
AVTSNA   EQU   AVTSAVTF                                                 01735000
AVTONSNA EQU   AVTSAVTF                                                 01736000
AVTVTMCP EQU   AVTSAVTF                                                 01737000
@NM00016 EQU   IEDQAVTD+536                                             01738000
AVTCMBSS EQU   IEDQAVTD+532                                             01739000
AVTRCV   EQU   IEDQAVTD+528                                             01740000
AVTSEND  EQU   IEDQAVTD+524                                             01741000
AVTCSCH  EQU   IEDQAVTD+520                                             01742000
AVTQ1    EQU   IEDQAVTD+516                                             01743000
AVTE7    EQU   IEDQAVTD+512                                             01744000
AVTHB    EQU   IEDQAVTD+508                                             01745000
AVTR1    EQU   IEDQAVTD+504                                             01746000
AVTBZ    EQU   IEDQAVTD+500                                             01747000
AVTEZ    EQU   IEDQAVTD+496                                             01748000
AVTEC    EQU   IEDQAVTD+492                                             01749000
AVTEW    EQU   IEDQAVTD+488                                             01750000
AVTNDIAL EQU   AVTSCOPT                                                 01751000
AVTN2741 EQU   AVTSCOPT                                                 01752000
AVTCONCO EQU   AVTSCOPT                                                 01753000
AVTCONC  EQU   AVTSCOPT                                                 01754000
AVTCMBUF EQU   AVTSCOPT                                                 01755000
AVTAPDMP EQU   AVTSCOPT                                                 01756000
@NM00015 EQU   AVTSCOPT                                                 01757000
AVTHA    EQU   AVTDISP                                                  01758000
AVTEA    EQU   IEDQAVTD+476                                             01759000
AVTAX    EQU   IEDQAVTD+472                                             01760000
AVTA3    EQU   IEDQAVTD+468                                             01761000
AVTGD    EQU   IEDQAVTD+464                                             01762000
AVTAL    EQU   IEDQAVTD+460                                             01763000
AVTOLTST EQU   AVTHG02                                                  01764000
AVTE8    EQU   IEDQAVTD+452                                             01765000
AVTUI    EQU   IEDQAVTD+448                                             01766000
AVTCOMPT EQU   IEDQAVTD+444                                             01767000
AVTCRSRF EQU   IEDQAVTD+440                                             01768000
@NM00014 EQU   IEDQAVTD+436                                             01769000
AVTKA02  EQU   IEDQAVTD+432                                             01770000
AVTOPTPT EQU   IEDQAVTD+428                                             01771000
AVTPCBPT EQU   IEDQAVTD+424                                             01772000
@NM00013 EQU   AVTECB1                                                  01773000
AVTCOMP  EQU   AVTECB1                                                  01774000
@NM00012 EQU   AVTECB1                                                  01775000
AVTOPECA EQU   IEDQAVTD+416                                             01776000
AVTOLECA EQU   IEDQAVTD+412                                             01777000
AVTCKECA EQU   IEDQAVTD+408                                             01778000
AVTCWECA EQU   IEDQAVTD+404                                             01779000
AVTCWTCB EQU   IEDQAVTD+400                                             01780000
AVTOLTCB EQU   IEDQAVTD+396                                             01781000
AVTOCTCB EQU   IEDQAVTD+392                                             01782000
AVTCKTCB EQU   IEDQAVTD+388                                             01783000
AVTAS    EQU   IEDQAVTD+384                                             01784000
AVTNOLBF EQU   IEDQAVTD+382                                             01785000
AVTNCKPR EQU   IEDQAVTD+381                                             01786000
AVTCIB   EQU   IEDQAVTD+380                                             01787000
AVTSPLPT EQU   IEDQAVTD+376                                             01788000
AVTMVBFR EQU   IEDQAVTD+372                                             01789000
AVTSBTA  EQU   IEDQAVTD+368                                             01790000
AVTRARTN EQU   IEDQAVTD+364                                             01791000
AVTBSCAN EQU   IEDQAVTD+360                                             01792000
AVTRDYA  EQU   IEDQAVTD+356                                             01793000
AVTRNMPT EQU   IEDQAVTD+352                                             01794000
AVTDISTR EQU   IEDQAVTD+348                                             01795000
AVTPARM3 EQU   IEDQAVTD+344                                             01796000
@NM00011 EQU   AVTPKF                                                   01797000
@NM00010 EQU   AVTPKF                                                   01798000
@NM00009 EQU   AVTPKF                                                   01799000
AVTFTCHF EQU   AVTPKF                                                   01800000
@NM00008 EQU   AVTPKF                                                   01801000
@NM00007 EQU   AVTPKF                                                   01802000
@NM00006 EQU   AVTPKF                                                   01803000
@NM00005 EQU   AVTPKF                                                   01804000
AVTPARM  EQU   IEDQAVTD+336                                             01805000
AVTEXS2A EQU   IEDQAVTD+330                                             01806000
AVTEXA2S EQU   IEDQAVTD+324                                             01807000
AVTOCGET EQU   IEDQAVTD+320                                             01808000
AVTCKAVT EQU   @NM00003+1                                               01809000
@NM00004 EQU   AVTCKFLG                                                 01810000
AVTCKHLT EQU   AVTCKFLG                                                 01811000
AVTCKREQ EQU   AVTCKFLG                                                 01812000
AVTCKENV EQU   AVTCKFLG                                                 01813000
AVTCKNAC EQU   AVTCKFLG                                                 01814000
AVTCKTAC EQU   AVTCKFLG                                                 01815000
@NM00002 EQU   IEDQAVTD+312                                             01816000
AVTREADD EQU   IEDQAVTD+308                                             01817000
AVTREADY EQU   IEDQAVTD+304                                             01818000
AVTRACE  EQU   IEDQAVTD+300                                             01819000
AVTTCB   EQU   IEDQAVTD+296                                             01820000
AVTPASWD EQU   IEDQAVTD+288                                             01821000
AVTCTLCH EQU   IEDQAVTD+280                                             01822000
AVTDOUBL EQU   IEDQAVTD+272                                             01823000
AVTDOUBX EQU   IEDQAVTD+264                                             01824000
AVTDPARM EQU   IEDQAVTD+260                                             01825000
AVTCSTCS EQU   IEDQAVTD+256                                             01826000
AVTDLQ   EQU   AVTSAVEX+32                                              01827000
@NM00001 EQU   AVTSAVEX                                                 01828000
AVTSAVE4 EQU   IEDQAVTD+144                                             01829000
AVTSAVE3 EQU   IEDQAVTD+72                                              01830000
AVTSAVE2 EQU   IEDQAVTD                                                 01831000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01832000
@RC00434 EQU   @EL00001                                                 01833000
@ENDDATA EQU   *                                                        01834000
         END   IGG019TI,(C'PLS2349',0701,77312)                         01835000
