         TITLE 'IGG019TE - 3705 SEND SCHEDULER                         *00001000
                        '                                               00002000
IGG019TE CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
*                                   /*                                  00005000
*        3705 SEND SCHEDULER STCB - 6 BYTES                             00006000
         DC    AL1(08)                  STCB VTO                        00007000
         DC    XL5'00'                                                  00008000
         LR    RBASE,RSTCB              SET BASE REGISTER - REG 3       00009000
*                                       AT ENTRY IS POINTER TO STCB     00010000
         USING IGG019TE,RBASE           MODULE ADDRESSABILITY           00011000
IGG019TE IEDHJN AFTERHJN,HJN            IDENTIFICATION MACRO            00012000
*   REXIT=ZERO;                     /* INITIALIZE RETURN ADDRESS     */ 00013000
         SLR   REXIT,REXIT                                      02S0278 00014000
*   IF RPARM->LCBRSKEY^=DSPLOCSC THEN/* TEST FOR INPUT TYPE - PIU OR    00015000
*                                      LCB                           */ 00016000
         CLI   LCBRSKEY(RPARM),X'1E'                            02S0279 00017000
         BE    @RF00279                                         02S0279 00018000
*     DO;                           /* ENTRY WITH A PIU              */ 00019000
*       RLCB=RQCB-(ADDR(LCBCOREQ)-ADDR(IEDQLCB));/* CALCULATE LCB       00020000
*                                      ADDRESS - QCB AT ENTRY IS        00021000
*                                      LCBCOREQ                      */ 00022000
         LR    @10,RQCB                                         02S0281 00023000
         SL    @10,@CF01541                                     02S0281 00024000
         LR    RLCB,@10                                         02S0281 00025000
*       CALL DSPPRIOR;              /* CALL DISPATCHER TO INSERT THE    00026000
*                                      PIU ON THE OUTPUT CORE QUEUE  */ 00027000
         LA    @15,DSPPRIOR(,RDISP)                             02S0282 00028000
         BALR  @14,@15                                          02S0282 00029000
*       RPARM=LCBTTCIN;             /* GET NCP TNT INDEX     @YM08120*/ 00030000
         LH    RPARM,LCBTTCIN(,RLCB)                            02S0283 00031000
         N     RPARM,@CF01549                                   02S0283 00032000
*       CALL TNTCODE;               /* GET NCP TTE ADDR      @YM08120*/ 00033000
         L     @15,IEDQNPTR(,RAVT)                              02S0284 00034000
         BALR  @14,@15                                          02S0284 00035000
*       RTRM=RPARM-LENGTH(IEDNTRM); /* SET NCP TTE BASE      @YM08120*/ 00036000
         LR    RTRM,RPARM                                       02S0285 00037000
         SL    RTRM,@CF01287                                    02S0285 00038000
*       IF LCBFREEN=OFF THEN        /* IS 3705 LCB FREE      @YM07717*/ 00039000
         TM    LCBFREEN(RLCB),B'00000100'                       02S0286 00040000
         BNZ   @RF00286                                         02S0286 00041000
*         IF TRMINOP=OFF THEN       /* AND INOP HAS NOT OCCURRED        00042000
*                                                            @YM08120*/ 00043000
         TM    TRMINOP(RTRM),B'10000000'                        02S0287 00044000
         BNZ   @RF00287                                         02S0287 00045000
*           REXIT=ADDR(DSPDISP);    /* NO, EXIT AND WAIT UNTIL NEXT     00046000
*                                      SCHEDULE OF THE LCB   @YM07717*/ 00047000
         LA    REXIT,DSPDISP(,RDISP)                            02S0288 00048000
*         ELSE                                                  02S0289 00049000
*           ;                       /*                       @YM07784*/ 00050000
@RF00287 DS    0H                                               02S0290 00051000
*       ELSE                        /* YES, THE 3705 LCB IS FREE        00052000
*                                                            @YM07717*/ 00053000
*         IF TRMSLOWN=ON THEN       /* IS 3705 IN SLOWDOWN           */ 00054000
         B     @RC00286                                         02S0290 00055000
@RF00286 TM    TRMSLOWN(RTRM),B'00010000'                       02S0290 00056000
         BNO   @RF00290                                         02S0290 00057000
*           REXIT=ADDR(DSPDISP);    /* YES, REQUEST EXIT WITH NO        00058000
*                                      PROCESSING                    */ 00059000
         LA    REXIT,DSPDISP(,RDISP)                            02S0291 00060000
*     END;                                                      02S0292 00061000
*   ELSE                            /* ENTRY WITH AN LCB             */ 00062000
*     DO;                                                       02S0293 00063000
         B     @RC00279                                         02S0293 00064000
@RF00279 DS    0H                                               02S0294 00065000
*       RLCB=RPARM;                 /* SAVE LCB ADDRESS              */ 00066000
         LR    RLCB,RPARM                                       02S0294 00067000
*       RPARM=LCBTTCIN;             /* GET TNT OFFSET OF THE 3705 LCB*/ 00068000
         LH    RPARM,LCBTTCIN(,RLCB)                            02S0295 00069000
         N     RPARM,@CF01549                                   02S0295 00070000
*       CALL TNTCODE;               /* GET 3705 TERM ENTRY ADDRESS   */ 00071000
         L     @15,IEDQNPTR(,RAVT)                              02S0296 00072000
         BALR  @14,@15                                          02S0296 00073000
*       RTRM=RPARM-LENGTH(IEDNTRM); /* SAVE TERM ENTRY ADDRESS       */ 00074000
         LR    RTRM,RPARM                                       02S0297 00075000
         SL    RTRM,@CF01287                                    02S0297 00076000
*     END;                                                      02S0298 00077000
*   RFY                                                         02S0299 00078000
*     RQCB UNRSTD;                                              02S0299 00079000
@RC00279 DS    0H                                               02S0300 00080000
*   IF REXIT=ZERO THEN              /* HAS EXIT BEEN REQUESTED       */ 00081000
         LTR   REXIT,REXIT                                      02S0300 00082000
         BNZ   @RF00300                                         02S0300 00083000
*     DO;                           /* NO, CONTINUE PROCESSING       */ 00084000
*       IF TRMINOP=ON|TRMIPLDM=ON THEN/* HAS CHANNEL INOP BEEN  02S0302 00085000
*                                      DETECTED OR IS IPL/DUMP IN       00086000
*                                      PROGRESS              @YM08120*/ 00087000
         TM    TRMINOP(RTRM),B'10000000'                        02S0302 00088000
         BO    @RT00302                                         02S0302 00089000
         TM    TRMIPLDM(RTRM),B'10000000'                       02S0302 00090000
         BNO   @RF00302                                         02S0302 00091000
@RT00302 DS    0H                                               02S0303 00092000
*         DO;                       /* YES, POST PIU'S ON OUTPUT CORE   00093000
*                                      QUEUE TO CLEANUP              */ 00094000
*                                                               03S0304 00095000
*           /*********************************************************/ 00096000
*           /*                                                       */ 00097000
*           /* PROCESS.POSTPIUS: POST ALL PIU'S THAT WERE ON THE     */ 00098000
*           /* OUTPUT CORE QUEUE TO CLEANUP VIA A RETURN TO DSPCHAIN.*/ 00099000
*           /* SET OUTPUT CORE QUEUE TO POINT TO DUMMY END.          */ 00100000
*           /*                                                       */ 00101000
*           /*********************************************************/ 00102000
*                                                               03S0304 00103000
*           RFY                                                 03S0304 00104000
*             RBRANCH RSTD;                                     03S0304 00105000
*           IF LCBCQELE^=AVTDELAD THEN/* DOES OUTPUT CORE QUEUE 03S0305 00106000
*                                      CONTAIN ANY PIU'S             */ 00107000
         L     @14,LCBCQELE(,RLCB)                              03S0305 00108000
         L     @10,AVTDELAD(,RAVT)                              03S0305 00109000
         CR    @14,@10                                          03S0305 00110000
         BE    @RF00305                                         03S0305 00111000
*             DO;                   /* YES, POST THEM TO CLEANUP     */ 00112000
*               RPARM=LCBCQELE;     /* GET ADDR OF 1ST ELEMENT ON       00113000
*                                      OUTPUT CORE QUEUE             */ 00114000
         LR    RPARM,@14                                        03S0307 00115000
*               LCBCQELE=AVTDELAD;  /* DELINK ALL PIU'S FROM THE        00116000
*                                      QUEUE                         */ 00117000
         ST    @10,LCBCQELE(,RLCB)                              03S0308 00118000
*               RPRF=RPARM;         /* GET ADDRESS OF 1ST PIU        */ 00119000
         LR    RPRF,RPARM                                       03S0309 00120000
*               DO UNTIL RPRF=AVTDELAD;/* SET UP ALL PIU'S FOR POST     00121000
*                                      TO CLEANUP                    */ 00122000
@DL00310 DS    0H                                               03S0311 00123000
*                 PRFQCBA=SAVTCLUP; /* QUEUE THE PIU FOR CLEANUP     */ 00124000
         L     @14,AVTSAVTP(,RAVT)                              03S0311 00125000
         MVC   PRFQCBA(3,RPRF),SAVTCLUP+1(@14)                  03S0311 00126000
*                 PRFPRI=PRIOUTQ;   /* SET PRIORITY                  */ 00127000
         MVI   PRFPRI(RPRF),X'E0'                               03S0312 00128000
*                 RBRANCH=RPRF;     /* SAVE ELEMENT ADDRESS          */ 00129000
         LR    RBRANCH,RPRF                                     03S0313 00130000
*                 RPRF=PRFLINK;     /* GET NEXT ELEMENT              */ 00131000
         L     @14,PRFLINK-1(,RPRF)                             03S0314 00132000
         LA    @14,0(,@14)                                      03S0314 00133000
         LR    RPRF,@14                                         03S0314 00134000
*               END;                                            03S0315 00135000
@DE00310 C     RPRF,AVTDELAD(,RAVT)                             03S0315 00136000
         BNE   @DL00310                                         03S0315 00137000
*               RBRANCH->PRFLINK=ZERO;/* CLEAR LINK IN LAST PIU      */ 00138000
         SLR   @14,@14                                          03S0316 00139000
         STCM  @14,7,PRFLINK(RBRANCH)                           03S0316 00140000
*               REXIT=ADDR(DSPCHAIN);/* REQUEST RETURN TO DSPCHAIN      00141000
*                                      ENTRY POINT OF THE DISPATCHER */ 00142000
         LA    REXIT,DSPCHAIN(,RDISP)                           03S0317 00143000
*               RFY                                             03S0318 00144000
*                 RBRANCH UNRSTD;                               03S0318 00145000
*             END;                                              03S0319 00146000
*         END;                                                  02S0320 00147000
*       ELSE                        /* NO INOP                       */ 00148000
*         IF LCBATTN=ON&            /* TEST FOR ATTENTION ...        */ 00149000
*             LCBBFRAV=OFF          /* ... WITH NO BUFFERS AVAILABLE */ 00150000
*           THEN                                                02S0321 00151000
         B     @RC00302                                         02S0321 00152000
@RF00302 TM    LCBATTN(RLCB),B'00000100'                        02S0321 00153000
         BNO   @RF00321                                         02S0321 00154000
         TM    LCBBFRAV(RLCB),B'00000010'                       02S0321 00155000
         BZ    @RT00321                                         02S0321 00156000
*           ;                       /* YES, NO PROCESSING            */ 00157000
*         ELSE                      /* NO ATTENTION OR BUFFERS ARE      00158000
*                                      AVAILABLE                     */ 00159000
*           DO;                     /* CHECK FOR AVAILABLE LCB SO       00160000
*                                      THAT BTU'S CAN BE BUILT       */ 00161000
@RF00321 DS    0H                                               02S0324 00162000
*             TS(LCBTSTSW);         /* IS LCB AVAILABLE FOR I/O      */ 00163000
         TS    LCBTSTSW(RLCB)                                   02S0324 00164000
*             BC(NZ,NOPROC);        /* NO, SKIP PROCESSING           */ 00165000
         BC    7,NOPROC                                         02S0325 00166000
*                                                               03S0326 00167000
*             /*******************************************************/ 00168000
*             /*                                                     */ 00169000
*             /* PROCESS.BLDBTUS: BUILD THE WRITE AND READ CCW'S AND */ 00170000
*             /* ISSUE AN AQCTL TO START I/O ON THE BTU'S.   @G36XRIB*/ 00171000
*             /*                                                     */ 00172000
*             /*******************************************************/ 00173000
*                                                               03S0326 00174000
*             RFY                                               03S0326 00175000
*              (REG9,                                           03S0326 00176000
*               REG10) RSTD;        /*                       @YM04622*/ 00177000
*             GEN REFS(LCBFREEN,LCBSENDN,CSMASK1) SETS(LCBFREEN,        00178000
*                 LCBSENDN,REG9,REG10);                         03S0327 00179000
*                                   /* @YM04622*/                       00180000
*                                     /*                       @YM04622 00181000
         L     REG10,LCBSENDN-2(,RLCB)  GET WORD CONTAINING    @YM04622 00182000
*                                       LCBSENDN AND LCBFREEN  @YM04622 00183000
CSLOOP1  EQU   *                                               @YM04622 00184000
         LR    REG9,REG10                                      @YM04622 00185000
         N     REG9,CSMASK1             TURN OFF LCBFREEN      @YM04622 00186000
         O     REG9,CSMASK1+4           TURN ON LCBSENDN       @YM04622 00187000
         CS    REG10,REG9,LCBSENDN-2(RLCB) CS BOTH BITS        @YM04622 00188000
         BNE   CSLOOP1                  DO AGAIN IF NOT EQUAL  @YM04622 00189000
*             RFY                                               03S0328 00190000
*              (REG9,                                           03S0328 00191000
*               REG10) UNRSTD;      /*                       @YM04622*/ 00192000
*             LCBSTART=ADDR(LCBCCW1);/* GET ADDR OF CHANNEL PROGRAM     00193000
*                                      AREA IN THE 3705 LCB          */ 00194000
         LA    @10,LCBCCW1(,RLCB)                               03S0329 00195000
         STCM  @10,7,LCBSTART(RLCB)                             03S0329 00196000
*             CPAWRTBF=LCBCQELE;    /* WRITE START TIC POINTS TO        00197000
*                                      FIRST PIU ON OUTPUT CORE QUEUE*/ 00198000
         MVC   CPAWRTBF(3,RLCB),LCBCQELE+1(RLCB)                03S0330 00199000
*                                                               04S0331 00200000
*             /*******************************************************/ 00201000
*             /*                                                     */ 00202000
*             /* PROCESS.BLDBTUS.BLDWRITE: BUILD THE WRITE CCW'S. IF */ 00203000
*             /* THIS IS THE FIRST CHANNEL PROGRAM TO EXECUTE AFTER  */ 00204000
*             /* THE ACTPU FOR THE 3705, THEN A RESTART CCW MUST     */ 00205000
*             /* PRECEED THE FIRST WRITE CCW. BUILD A WRITE BREAK CCW*/ 00206000
*             /* IN THE PREFIX OF THE LAST UNIT OF THE LAST PIU.     */ 00207000
*             /*                                                     */ 00208000
*             /*******************************************************/ 00209000
*                                                               04S0331 00210000
*             RFY                                               04S0331 00211000
*               REG9 RSTD;          /*                       @YM05684*/ 00212000
*             IF TRMINPG=ON&        /* FIRST ...                     */ 00213000
*                 TRMRSACT=OFF THEN /* ... TIME                      */ 00214000
         TM    TRMINPG(RTRM),B'00100000'                        04S0332 00215000
         BNO   @RF00332                                         04S0332 00216000
         TM    TRMRSACT(RTRM),B'10000000'                       04S0332 00217000
         BNZ   @RF00332                                         04S0332 00218000
*               DO;                 /* YES, BUILD THE RESTART CCW    */ 00219000
*                 RPRF=ADDR(CPARST);/* GET ADDRESS INTO WHICH RESTART   00220000
*                                      CCW IS TO BE BUILT            */ 00221000
         LA    @10,8                                            04S0334 00222000
         LA    RPRF,LCBCPA(,RLCB)                               04S0334 00223000
         SLR   RPRF,@10                                         04S0334 00224000
*                 CCWOPCDE=CCWRRS;  /* SET RESTART OP CODE           */ 00225000
         MVI   CCWOPCDE(RPRF),X'93'                             04S0335 00226000
*                 CCWADDR=ADDR(CCWADDR)-1;/* DUMMY DATA ADDRESS 04S0336 00227000
*                                                            @YM03703*/ 00228000
         LA    @07,CCWADDR(,RPRF)                               04S0336 00229000
         BCTR  @07,0                                            04S0336 00230000
         STCM  @07,7,CCWADDR(RPRF)                              04S0336 00231000
*                 CCWFLAGS=''B;     /* CLEAR CCW FLAGS               */ 00232000
         MVI   CCWFLAGS(RPRF),X'00'                             04S0337 00233000
*                 CCWCC=ON;         /* COMMAND CHAINING              */ 00234000
*                 CCWSLI=ON;        /* SUPPRESS INCORRECT LENGTH     */ 00235000
         OI    CCWCC(RPRF),B'01100000'                          04S0339 00236000
*                 CCWRSV=CLEAR;     /* CLEAR UNUSED FIELD            */ 00237000
         MVI   CCWRSV(RPRF),X'00'                               04S0340 00238000
*                 CCWCOUNT=ONE;     /* SET COUNT FIELD               */ 00239000
         LA    @07,1                                            04S0341 00240000
         STCM  @07,3,CCWCOUNT(RPRF)                             04S0341 00241000
*                 LCBSTART=RPRF;    /* SET START OF CHANNEL PROGRAM     00242000
*                                      TO RESTART CCW                */ 00243000
         STCM  RPRF,7,LCBSTART(RLCB)                            04S0342 00244000
*                 RPRF=RPRF+8;      /* BUMP TO WRITE START CH PGM       00245000
*                                                            @XM05830*/ 00246000
         ALR   RPRF,@10                                         04S0343 00247000
*                 CCWOPCDE=CCWWS0;  /* SET TO WRITE START ZERO  04S0344 00248000
*                                                            @XM05830*/ 00249000
         MVI   CCWOPCDE(RPRF),X'31'                             04S0344 00250000
*                 CCWADDR=ADDR(CCWADDR)-1;/* SET DUMMY ADDR  @XM05830*/ 00251000
         LA    @05,CCWADDR(,RPRF)                               04S0345 00252000
         BCTR  @05,0                                            04S0345 00253000
         STCM  @05,7,CCWADDR(RPRF)                              04S0345 00254000
*                 CCWFLAGS=''B;     /* CLEAR FLAGS           @XM05830*/ 00255000
         MVI   CCWFLAGS(RPRF),X'00'                             04S0346 00256000
*                 CCWCC=ON;         /* TURN ON COMMAND CHAINING 04S0347 00257000
*                                                            @XM05830*/ 00258000
*                 CCWSLI=ON;        /* SUPPRESS INCORRECT LENGTH        00259000
*                                                            @XM05830*/ 00260000
         OI    CCWCC(RPRF),B'01100000'                          04S0348 00261000
*                 CCWRSV=CLEAR;     /* ZERO UNUSED AREA      @XM05830*/ 00262000
         MVI   CCWRSV(RPRF),X'00'                               04S0349 00263000
*                 CCWCOUNT=ONE;     /* LENGTH OF WRITE START @XM05830*/ 00264000
         STCM  @07,3,CCWCOUNT(RPRF)                             04S0350 00265000
*                 RPRF=RPRF+8;      /* BUMP TO TIC CCW       @XM05830*/ 00266000
         ALR   RPRF,@10                                         04S0351 00267000
*                 CCWOPCDE=CCWTIC;  /* SET TO TIC            @XM05830*/ 00268000
         MVI   CCWOPCDE(RPRF),X'08'                             04S0352 00269000
*                 RPRF=RPRF+8;      /* BUMP TO READ START CCW   04S0353 00270000
*                                                            @XM05830*/ 00271000
         ALR   RPRF,@10                                         04S0353 00272000
*                 CCWOPCDE=CCWRS0;  /* SET TO READ START ZERO   04S0354 00273000
*                                                            @XM05830*/ 00274000
         MVI   CCWOPCDE(RPRF),X'32'                             04S0354 00275000
*                 CCWADDR=ADDR(CCWADDR)-1;/* DUMMY ADDRESS   @XM05830*/ 00276000
         LA    @10,CCWADDR(,RPRF)                               04S0355 00277000
         BCTR  @10,0                                            04S0355 00278000
         STCM  @10,7,CCWADDR(RPRF)                              04S0355 00279000
*                 CCWFLAGS=''B;     /* CLEAR FLAGS           @XM05830*/ 00280000
         MVI   CCWFLAGS(RPRF),X'00'                             04S0356 00281000
*                 CCWCC=ON;         /* TURN ON COMMAND CHAINING 04S0357 00282000
*                                                            @XM05830*/ 00283000
*                 CCWSLI=ON;        /* SUPPRESS INCORRECT LENGTH        00284000
*                                                            @XM05830*/ 00285000
         OI    CCWCC(RPRF),B'01100000'                          04S0358 00286000
*                 CCWRSV=CLEAR;     /* CLEAR UNUSED AREA     @XM05830*/ 00287000
         MVI   CCWRSV(RPRF),X'00'                               04S0359 00288000
*                 CCWCOUNT=ONE;     /* SET COUNT TO ONE      @XM05830*/ 00289000
         STCM  @07,3,CCWCOUNT(RPRF)                             04S0360 00290000
*                 LCBREAL=OFF;      /* INDICATE LCB CCWS NOT    04S0361 00291000
*                                      TRANSLATED            @OZ27812*/ 00292000
         NI    LCBREAL(RLCB),B'11111011'                        04S0361 00293000
*               END;                                            04S0362 00294000
*             RPRF=ADDR(CPAWRTS);   /* MAKE THE WRITE START CCW THE     00295000
*                                      CURRENT UNIT FOR THE PURPOSE     00296000
*                                      OF INITIALIZING CPAWRTBK      */ 00297000
@RF00332 LA    RPRF,CPAWRTS(,RLCB)                              04S0363 00298000
*             DO UNTIL LCBCQELE=AVTDELAD;/* BUILD CCW'S UNTIL OUTPUT    00299000
*                                      CORE QUEUE IS EMPTY           */ 00300000
@DL00364 DS    0H                                               04S0365 00301000
*                                                               05S0365 00302000
*               /*****************************************************/ 00303000
*               /*                                                   */ 00304000
*               /* PROCESS.BLDBTUS.BLDWRITE.BLDCCWS: DELINK TOP PIU  */ 00305000
*               /* FROM OUTPUT CORE QUEUE. BUILD A WRITE CCW WITH A  */ 00306000
*               /* TIC FOLLOWING IT IN THE FIRST 12 BYTES OF THE     */ 00307000
*               /* BUFFER UNIT.                                      */ 00308000
*               /*                                                   */ 00309000
*               /*****************************************************/ 00310000
*                                                               05S0365 00311000
*               RFY                                             05S0365 00312000
*                 RCOUNT RSTD;                                  05S0365 00313000
*               REG9=RPRF;          /* SAVE FOR LAST PIU CHECK  05S0366 00314000
*                                                            @YM05684*/ 00315000
         LR    REG9,RPRF                                        05S0366 00316000
*               CPAWRTBK=RPRF;      /* SAVE FOR LAST UNIT TO WRTBRK     00317000
*                                      CHECK                         */ 00318000
         STCM  RPRF,7,CPAWRTBK(RLCB)                            05S0367 00319000
*               RPRF=LCBCQELE;      /* GET TOP ELEMENT (PIU) FROM       00320000
*                                      OUTPUT CORE QUEUE             */ 00321000
         L     RPRF,LCBCQELE(,RLCB)                             05S0368 00322000
*               LCBCQELE=PRFLINK;   /* DELINK THE ELEMENT            */ 00323000
         L     @10,PRFLINK-1(,RPRF)                             05S0369 00324000
         LA    @10,0(,@10)                                      05S0369 00325000
         ST    @10,LCBCQELE(,RLCB)                              05S0369 00326000
*               CCWOPCDE=CCWWRITE;  /* SET WRITE COMMAND CODE        */ 00327000
         MVI   CCWOPCDE(RPRF),X'01'                             05S0370 00328000
*               CCWADDR=ADDR(PRFSUNIT)+PRFPIUO;/* SET ADDR OF DATA   */ 00329000
         LA    @10,PRFSUNIT(,RPRF)                              05S0371 00330000
         SLR   @07,@07                                          05S0371 00331000
         IC    @07,PRFPIUO(,RPRF)                               05S0371 00332000
         ALR   @10,@07                                          05S0371 00333000
         STCM  @10,7,CCWADDR(RPRF)                              05S0371 00334000
*               CCWFLAGS=''B;       /* CLEAR CCW FLAGS               */ 00335000
         MVI   CCWFLAGS(RPRF),X'00'                             05S0372 00336000
*               CCWCC=ON;           /* COMMAND CHAINING              */ 00337000
*               CCWSLI=ON;          /* SUPPRESS INCORRECT LENGTH     */ 00338000
         OI    CCWCC(RPRF),B'01100000'                          05S0374 00339000
*               CCWRSV=CLEAR;       /* CLEAR UNUSED FIELD            */ 00340000
         MVI   CCWRSV(RPRF),X'00'                               05S0375 00341000
*               PRFTICC=CCWTIC;     /* SET TIC COMMAND               */ 00342000
         MVI   PRFTICC(RPRF),X'08'                              05S0376 00343000
*               RCOUNT=LENGTH(IEDTH)+TTHDCF;/* GET LENGTH OF DATA IN    00344000
*                                      PIU                           */ 00345000
         LA    @10,PRFPIUO(,RPRF)                               05S0377 00346000
         ALR   @10,@07                                          05S0377 00347000
         LA    RCOUNT,10                                        05S0377 00348000
         SLR   @03,@03                                          05S0377 00349000
         ICM   @03,3,TTHDCF(@10)                                05S0377 00350000
         ALR   RCOUNT,@03                                       05S0377 00351000
*               IF AVTKEYLE>=RCOUNT+PRFPIUO THEN/* DOES ENTIRE PIU      00352000
*                                      FIT IN ONE BUFFER UNIT        */ 00353000
         ALR   @07,RCOUNT                                       05S0378 00354000
         CH    @07,AVTKEYLE(,RAVT)                              05S0378 00355000
         BH    @RF00378                                         05S0378 00356000
*                 CCWCOUNT=RCOUNT;  /* YES, SET COUNT IN THE CCW     */ 00357000
         STCM  RCOUNT,3,CCWCOUNT(RPRF)                          05S0379 00358000
*               ELSE                /* NO, PROCESS MULTIPLE UNITS    */ 00359000
*                 DO;                                           05S0380 00360000
         B     @RC00378                                         05S0380 00361000
@RF00378 DS    0H                                               05S0381 00362000
*                   CCWCOUNT=AVTKEYLE-PRFPIUO;/* SET COUNT IN 1ST       00363000
*                                      UNIT                          */ 00364000
         LH    @10,AVTKEYLE(,RAVT)                              05S0381 00365000
         SLR   @07,@07                                          05S0381 00366000
         IC    @07,PRFPIUO(,RPRF)                               05S0381 00367000
         SLR   @10,@07                                          05S0381 00368000
         STCM  @10,3,CCWCOUNT(RPRF)                             05S0381 00369000
*                   RCOUNT=RCOUNT-CCWCOUNT;/* ADJUST REMAINING COUNT    00370000
*                                      IN THE PIU                    */ 00371000
         SLR   RCOUNT,@10                                       05S0382 00372000
*                                                               06S0383 00373000
*                   /*************************************************/ 00374000
*                   /*                                               */ 00375000
*                   /* PROCESS.BLDBTUS.BLDWRITE.BLDCCWS.BLDUNITS:    */ 00376000
*                   /* PROCESS THE EXTRA UNITS OF A WRITE PIU BY     */ 00377000
*                   /* BUILDING WRITES AND TIC'S IN THE UNITS.       */ 00378000
*                   /*                                               */ 00379000
*                   /*************************************************/ 00380000
*                                                               06S0383 00381000
*                   DO UNTIL RCOUNT<=ZERO;/* BUILD EACH UNIT UNTIL      00382000
*                                      LAST UNIT REACHED             */ 00383000
@DL00383 DS    0H                                               06S0384 00384000
*                     CPAWRTBK=RPRF;/* SAVE CURRENT LAST UNIT FOR       00385000
*                                      WRITE BRK CHK         @YM05684*/ 00386000
         STCM  RPRF,7,CPAWRTBK(RLCB)                            06S0384 00387000
*                     CCWCC=OFF;    /* TURN OFF COM CHAIN IN 1ST UNIT   00388000
*                                                            @YM05684*/ 00389000
*                     CCWCD=ON;     /* TURN ON DATA CHAIN IN 1ST UNIT   00390000
*                                                            @YM05684*/ 00391000
         OI    CCWCD(RPRF),B'10000000'                          06S0386 00392000
         NI    CCWCC(RPRF),B'10111111'                          06S0386 00393000
*                     RPRF=PRFTI0;  /* GET NEXT UNIT OF THE PIU      */ 00394000
         L     @10,PRFTI0-1(,RPRF)                              06S0387 00395000
         LA    @10,0(,@10)                                      06S0387 00396000
         LR    RPRF,@10                                         06S0387 00397000
*                     CCWOPCDE=CCWWRITE;/* SET WRITE COMMAND CODE    */ 00398000
         MVI   CCWOPCDE(RPRF),X'01'                             06S0388 00399000
*                     CCWADDR=ADDR(PRFSUNIT);/* POINT TO DATA IN THE    00400000
*                                      UNIT                          */ 00401000
         LA    @10,PRFSUNIT(,RPRF)                              06S0389 00402000
         STCM  @10,7,CCWADDR(RPRF)                              06S0389 00403000
*                     CCWFLAGS=''B; /* CLEAR CCW FLAGS               */ 00404000
         MVI   CCWFLAGS(RPRF),X'00'                             06S0390 00405000
*                     CCWCD=ON;     /* DATA CHAINING         @YM05684*/ 00406000
*                     CCWSLI=ON;    /* SUPPRESS INCORRECT LENGTH     */ 00407000
         OI    CCWCD(RPRF),B'10100000'                          06S0392 00408000
*                     CCWRSV=CLEAR; /* CLEAR RESERVED FIELD          */ 00409000
         MVI   CCWRSV(RPRF),X'00'                               06S0393 00410000
*                     CCWCOUNT=AVTKEYLE;/* COUNT IS ONE BUFFER UNIT  */ 00411000
         LH    @10,AVTKEYLE(,RAVT)                              06S0394 00412000
         STCM  @10,3,CCWCOUNT(RPRF)                             06S0394 00413000
*                     PRFTICC=CCWTIC;/* SET TIC COMMAND CODE         */ 00414000
         MVI   PRFTICC(RPRF),X'08'                              06S0395 00415000
*                     RCOUNT=RCOUNT-AVTKEYLE;/* ADJUST REMAINING        00416000
*                                      LENGTH                        */ 00417000
         SLR   RCOUNT,@10                                       06S0396 00418000
*                   END;                                        06S0397 00419000
@DE00383 LTR   RCOUNT,RCOUNT                                    06S0397 00420000
         BP    @DL00383                                         06S0397 00421000
*                   CCWCC=ON;       /* COM CHAIN ON FOR LAST UNIT IN    00422000
*                                      PIU                   @YM05684*/ 00423000
*                   CCWCD=OFF;      /* DATA CHAIN OFF FOR LAST UNIT     00424000
*                                      IN PIU                @YM05684*/ 00425000
         OI    CCWCC(RPRF),B'01000000'                          06S0399 00426000
         NI    CCWCD(RPRF),B'01111111'                          06S0399 00427000
*                   CCWCOUNT=RCOUNT+AVTKEYLE;/* CORRECT THE LENGTH      00428000
*                                      SET IN THE LAST UNIT          */ 00429000
         LR    @10,RCOUNT                                       06S0400 00430000
         AH    @10,AVTKEYLE(,RAVT)                              06S0400 00431000
         STCM  @10,3,CCWCOUNT(RPRF)                             06S0400 00432000
*                 END;                                          05S0401 00433000
*               PRFTI0=LCBCQELE;    /* TIC LAST (OR ONLY) UNIT OF       00434000
*                                      THIS PIU TO THE NEXT PIU      */ 00435000
@RC00378 MVC   PRFTI0(3,RPRF),LCBCQELE+1(RLCB)                  05S0402 00436000
*               RFY                                             05S0403 00437000
*                 RCOUNT UNRSTD;                                05S0403 00438000
*             END;                                              04S0404 00439000
@DE00364 CLC   LCBCQELE(4,RLCB),AVTDELAD(RAVT)                  04S0404 00440000
         BNE   @DL00364                                         04S0404 00441000
*             RPRF=REG9->PRFTI0;    /* POINT TO FIRST UNIT OF LAST      00442000
*                                      PIU                   @YM05684*/ 00443000
         L     RPRF,PRFTI0-1(,REG9)                             04S0405 00444000
         LA    RPRF,0(,RPRF)                                    04S0405 00445000
*             DO WHILE CCWCD=ON;    /* CYCLE THRU LAST PIU   @YM05684*/ 00446000
         B     @DE00406                                         04S0406 00447000
@DL00406 DS    0H                                               04S0407 00448000
*               CCWOPCDE=CCWBRK;    /* MAKE UNIT WRITE BREAK @YM05684*/ 00449000
         MVI   CCWOPCDE(RPRF),X'09'                             04S0407 00450000
*               RPRF=RPRF->PRFTI0;  /* GET NEXT UNIT         @YM05684*/ 00451000
         L     @10,PRFTI0-1(,RPRF)                              04S0408 00452000
         LA    @10,0(,@10)                                      04S0408 00453000
         LR    RPRF,@10                                         04S0408 00454000
*             END;                  /*                       @YM05684*/ 00455000
@DE00406 TM    CCWCD(RPRF),B'10000000'                          04S0409 00456000
         BO    @DL00406                                         04S0409 00457000
*             RPARM=CPAWRTBK;       /* GET ADDR OF CCW THAT TIC'S TO    00458000
*                                      LAST UNIT OF LAST PIU         */ 00459000
         L     RPARM,CPAWRTBK-1(,RLCB)                          04S0410 00460000
         LA    RPARM,0(,RPARM)                                  04S0410 00461000
*             RPRF=RPARM->PRFTI0;   /* GET ADDR OF LAST UNIT         */ 00462000
         L     @10,PRFTI0-1(,RPARM)                             04S0411 00463000
         LA    @10,0(,@10)                                      04S0411 00464000
         LR    RPRF,@10                                         04S0411 00465000
*             RPARM->PRFTI0=RPARM->PRFTI0-LENGTH(IEDQCCW);/* CHANGE     00466000
*                                      TIC TO POINT TO PREFIX OF LAST   00467000
*                                      UNIT                          */ 00468000
         SL    @10,@CF00044                                     04S0412 00469000
         STCM  @10,7,PRFTI0(RPARM)                              04S0412 00470000
*             RPARM=RPARM->PRFTI0;  /* GET ADDR OF PREFIX            */ 00471000
         LR    RPARM,@10                                        04S0413 00472000
*             CCWOPCDE=CCWBRK;      /* CHANGE LAST WRITE TO WRITE       00473000
*                                      BREAK                         */ 00474000
         MVI   CCWOPCDE(RPRF),X'09'                             04S0414 00475000
*             RPARM->CCW=CCW;       /* MOVE WRT BREAK CCW TO PREFIX  */ 00476000
         MVC   CCW(8,RPARM),CCW(RPRF)                           04S0415 00477000
*             CCWOPCDE=CCWNOP;      /* BUILD NOOP CCW IN THE UNIT    */ 00478000
         MVI   CCWOPCDE(RPRF),X'03'                             04S0416 00479000
*             CCWFLAGS=''B;         /* CLEAR CCW FLAGS               */ 00480000
         MVI   CCWFLAGS(RPRF),X'00'                             04S0417 00481000
*             CCWCOUNT=ONE;         /* SET COUNT FOR NOOP            */ 00482000
         MVC   CCWCOUNT(2,RPRF),@CH00059                        04S0418 00483000
*             PRFTI0=ADDR(LCBCCW6); /* SET TIC TO SPECIAL NOOP  04S0419 00484000
*                                      COMMAND                       */ 00485000
         LA    @10,LCBCCW6(,RLCB)                               04S0419 00486000
         STCM  @10,7,PRFTI0(RPRF)                               04S0419 00487000
*             RFY                                               04S0420 00488000
*               REG9 UNRSTD;        /*                       @YM05684*/ 00489000
*             IF LCBBFRAV=ON THEN   /* ARE READ BUFFERS AVAILABLE    */ 00490000
         TM    LCBBFRAV(RLCB),B'00000010'                       03S0421 00491000
         BNO   @RF00421                                         03S0421 00492000
*               DO;                 /* YES, BUILD THE READS          */ 00493000
*                                                               04S0423 00494000
*                 /***************************************************/ 00495000
*                 /*                                                 */ 00496000
*                 /* PROCESS.BLDREAD: CHAIN THE READ BUFFERS TO THE  */ 00497000
*                 /* WRITE BREAK UNIT AND INDICATE RECEIVING         */ 00498000
*                 /*                                                 */ 00499000
*                 /***************************************************/ 00500000
*                                                               04S0423 00501000
*                 PRFTI0=ADDR(CPARDS);/* TIC THE WRITE BREAK UNIT TO    00502000
*                                      THE READ START                */ 00503000
         LA    @10,CPARDS(,RLCB)                                04S0423 00504000
         STCM  @10,7,PRFTI0(RPRF)                               04S0423 00505000
*                 CPARDU=LCBRDBFR;  /* SET TIC AFTER READ START TO      00506000
*                                      THE READ BUFFERS              */ 00507000
         MVC   CPARDU(3,RLCB),LCBRDBFR(RLCB)                    04S0424 00508000
*                 RFY                                           04S0425 00509000
*                  (REG9,                                       04S0425 00510000
*                   REG10) RSTD;    /*                       @YM04622*/ 00511000
*                 GEN REFS(LCBRECVN,LCBBFRAV,CSMASK2) SETS(REG9,REG10,  00512000
*                     LCBRECVN,LCBBFRAV);                       04S0426 00513000
*                                                         /* @YM04622*/ 00514000
*                                     /*                       @YM04622 00515000
         L     REG10,LCBBFRAV-3(,RLCB)  GET WORD CONTAINING    @YM04622 00516000
*                                       LCBBFRAV AND LCBRECVN  @YM04622 00517000
CSLOOP2  EQU   *                                               @YM04622 00518000
         LR    REG9,REG10                                      @YM04622 00519000
         N     REG9,CSMASK2             TURN OFF LCBBFRAV      @YM04622 00520000
         O     REG9,CSMASK2+4           TURN ON LCBRECVN       @YM04622 00521000
         CS    REG10,REG9,LCBBFRAV-3(RLCB) CS BOTH BITS        @YM04622 00522000
         BNE   CSLOOP2                  DO AGAIN IF NOT EQUAL  @YM04622 00523000
*                 RFY                                           04S0427 00524000
*                  (REG9,                                       04S0427 00525000
*                   REG10) UNRSTD;  /*                       @YM04622*/ 00526000
*               END;                                            03S0428 00527000
*             LCBSIO=SIOCODE;       /* STARTIO ENTRY CODE FOR AQCTL     00528000
*                                      (IEDQEB)              @G36XRIB*/ 00529000
@RF00421 MVI   LCBSIO(RLCB),X'30'                               03S0429 00530000
*             LCBCP=LCBSTART;       /* ADDR OF START OF CHANNEL 03S0430 00531000
*                                      PROGRAM               @G36XRIB*/ 00532000
         L     @10,LCBSTART-1(,RLCB)                            03S0430 00533000
         LA    @10,0(,@10)                                      03S0430 00534000
         ST    @10,LCBCP(,RLCB)                                 03S0430 00535000
*             RPARM=ADDR(LCBQEBPL); /* ADDR OF PARM LIST FOR IEDQEB     00536000
*                                                            @G36XRIB*/ 00537000
         LA    RPARM,LCBQEBPL(,RLCB)                            03S0431 00538000
*             GEN(AQCTL);           /* DO STARTIO            @G36XRIB*/ 00539000
         AQCTL                                                          00540000
*NOPROC:                                                        02S0433 00541000
*           END;                                                02S0433 00542000
NOPROC   DS    0H                                               02S0434 00543000
*     END;                                                      02S0434 00544000
@RT00321 DS    0H                                               02S0434 00545000
@RC00302 DS    0H                                               02S0435 00546000
*                                                               02S0435 00547000
*   /*****************************************************************/ 00548000
*   /*                                                               */ 00549000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00550000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT.                    */ 00551000
*   /*                                                               */ 00552000
*   /*****************************************************************/ 00553000
*                                                               02S0435 00554000
*   RFY                                                         02S0435 00555000
*     RRETURN RSTD;                                             02S0435 00556000
@RF00300 DS    0H                                               02S0436 00557000
*   IF REXIT^=ZERO THEN             /* HAS EXIT ADDRESS BEEN    02S0436 00558000
*                                      ESTABLISHED                   */ 00559000
         LTR   REXIT,REXIT                                      02S0436 00560000
         BZ    @RF00436                                         02S0436 00561000
*     RRETURN=REXIT;                /* YES, SET RETURN ADDRESS       */ 00562000
         LR    RRETURN,REXIT                                    02S0437 00563000
*   ELSE                            /* NO                            */ 00564000
*     RRETURN=ADDR(DSPDISP);        /* RETURN TO DISPATCHER          */ 00565000
         B     @RC00436                                         02S0438 00566000
@RF00436 LA    RRETURN,DSPDISP(,RDISP)                          02S0438 00567000
*   RFY                                                         02S0439 00568000
*     RRETURN UNRSTD;                                           02S0439 00569000
*   END IGG019TE                                                01S0440 00570000
*                                                               01S0440 00571000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00572000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00573000
*/*%INCLUDE SYSLIB  (TCCWD   )                                       */ 00574000
*/*%INCLUDE SYSLIB  (TDISPD  )                                       */ 00575000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 00576000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00577000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00578000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 00579000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00580000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00581000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 00582000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 00583000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 00584000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 00585000
*/*%INCLUDE SYSUT5  (POSTPIUS)                                       */ 00586000
*/*%INCLUDE SYSUT5  (BLDBTUS )                                       */ 00587000
*/*%INCLUDE SYSUT5  (BLDWRITE)                                       */ 00588000
*/*%INCLUDE SYSUT5  (BLDCCWS )                                       */ 00589000
*/*%INCLUDE SYSUT5  (BLDUNITS)                                       */ 00590000
*/*%INCLUDE SYSUT5  (BLDREAD )                                       */ 00591000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 00592000
*                                                               01S0440 00593000
*       ;                                                       01S0440 00594000
@EL00001 DS    0H                                               01S0440 00595000
@EF00001 DS    0H                                               01S0440 00596000
@ER00001 BR    @14                                              01S0440 00597000
@DATA    DS    0H                                                       00598000
@CH00059 DC    H'1'                                                     00599000
         DS    0F                                                       00600000
         DS    0F                                                       00601000
@CF00044 DC    F'8'                                                     00602000
@CF01287 DC    F'14'                                                    00603000
@CF01541 DC    F'100'                                                   00604000
@CF01549 DC    XL4'0000FFFF'                                            00605000
         DS    0D                                                       00606000
CSMASK1  DC    X'FFFFFBFF00000100'                                      00607000
CSMASK2  DC    X'FFFFFFFD00000200'                                      00608000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00609000
@01      EQU   01                                                       00610000
@02      EQU   02                                                       00611000
@03      EQU   03                                                       00612000
@04      EQU   04                                                       00613000
@05      EQU   05                                                       00614000
@06      EQU   06                                                       00615000
@07      EQU   07                                                       00616000
@08      EQU   08                                                       00617000
@09      EQU   09                                                       00618000
@10      EQU   10                                                       00619000
@11      EQU   11                                                       00620000
@12      EQU   12                                                       00621000
@13      EQU   13                                                       00622000
@14      EQU   14                                                       00623000
@15      EQU   15                                                       00624000
IEDQAPTR EQU   @13                                                      00625000
RDISP    EQU   @11                                                      00626000
IEDQLPTR EQU   @04                                                      00627000
LCBXPTR  EQU   @05                                                      00628000
IEDQPPTR EQU   @06                                                      00629000
RTRM     EQU   @08                                                      00630000
RAVT     EQU   @13                                                      00631000
RPRF     EQU   @06                                                      00632000
RLCB     EQU   @04                                                      00633000
RPARM    EQU   @01                                                      00634000
REXIT    EQU   @02                                                      00635000
RSTCB    EQU   @03                                                      00636000
RCOUNT   EQU   @05                                                      00637000
RQCB     EQU   @07                                                      00638000
REG9     EQU   @09                                                      00639000
REG10    EQU   @10                                                      00640000
RBASE    EQU   @12                                                      00641000
RRETURN  EQU   @14                                                      00642000
RBRANCH  EQU   @15                                                      00643000
IEDQTPTR EQU   @08                                                      00644000
IEDQAVTD EQU   0                                                        00645000
AVTSAVEX EQU   IEDQAVTD+216                                             00646000
@NM00003 EQU   IEDQAVTD+316                                             00647000
AVTCKFLG EQU   @NM00003                                                 00648000
AVTBASE  EQU   IEDQAVTD+340                                             00649000
AVTPKF   EQU   AVTBASE                                                  00650000
AVTRNMPT EQU   IEDQAVTD+352                                             00651000
AVTOSECB EQU   IEDQAVTD+420                                             00652000
AVTECB1  EQU   AVTOSECB                                                 00653000
AVTHG02  EQU   IEDQAVTD+456                                             00654000
AVTDISP  EQU   IEDQAVTD+480                                             00655000
AVTHD    EQU   IEDQAVTD+484                                             00656000
AVTSCOPT EQU   AVTHD                                                    00657000
AVTSAVTP EQU   IEDQAVTD+540                                             00658000
AVTSAVTF EQU   AVTSAVTP                                                 00659000
AVTCKPEL EQU   IEDQAVTD+580                                             00660000
AVTCKRMV EQU   AVTCKPEL                                                 00661000
AVTCKELF EQU   IEDQAVTD+608                                             00662000
AVTCKBYT EQU   IEDQAVTD+619                                             00663000
AVTHG01  EQU   IEDQAVTD+620                                             00664000
AVTCKLNK EQU   IEDQAVTD+624                                             00665000
AVTDELAD EQU   IEDQAVTD+632                                             00666000
AVTCRELE EQU   IEDQAVTD+636                                             00667000
AVTCCELE EQU   AVTCRELE                                                 00668000
AVTCLRHI EQU   IEDQAVTD+644                                             00669000
AVTADBUF EQU   IEDQAVTD+648                                             00670000
AVTSYSER EQU   IEDQAVTD+656                                             00671000
AVTBFRFG EQU   IEDQAVTD+712                                             00672000
AVTCKPQB EQU   IEDQAVTD+732                                             00673000
AVTCKPTB EQU   AVTCKPQB                                                 00674000
AVTCKPEC EQU   AVTCKPQB+4                                               00675000
AVTCKPCC EQU   AVTCKPEC                                                 00676000
AVTOPCQB EQU   IEDQAVTD+744                                             00677000
AVTOPCOB EQU   AVTOPCQB                                                 00678000
AVTOPCEC EQU   AVTOPCQB+4                                               00679000
AVTOPCCC EQU   AVTOPCEC                                                 00680000
AVTOLTQB EQU   IEDQAVTD+756                                             00681000
AVTCWFL1 EQU   IEDQAVTD+852                                             00682000
AVTCWFL2 EQU   IEDQAVTD+853                                             00683000
AVTSUBT  EQU   IEDQAVTD+876                                             00684000
AVTIOTR  EQU   IEDQAVTD+877                                             00685000
AVTKEYLE EQU   IEDQAVTD+960                                             00686000
AVTBIT1  EQU   IEDQAVTD+978                                             00687000
AVTBIT2  EQU   IEDQAVTD+979                                             00688000
AVTBIT3  EQU   IEDQAVTD+980                                             00689000
AVTBIT4  EQU   IEDQAVTD+1064                                            00690000
@NM00085 EQU   IEDQAVTD+1160                                            00691000
IEDNSVTD EQU   0                                                        00692000
SAVTDIAG EQU   IEDNSVTD                                                 00693000
SAVTDIAF EQU   SAVTDIAG                                                 00694000
SAVTCLUP EQU   IEDNSVTD+72                                              00695000
SAVTLUSQ EQU   IEDNSVTD+88                                              00696000
SAVTTCPU EQU   IEDNSVTD+238                                             00697000
SAVTZELM EQU   IEDNSVTD+270                                             00698000
SAVTRDRV EQU   IEDNSVTD+284                                             00699000
SAVTCKQB EQU   IEDNSVTD+300                                             00700000
SAVTCKTB EQU   SAVTCKQB                                                 00701000
SAVTCKEC EQU   SAVTCKQB+4                                               00702000
SAVTCKCC EQU   SAVTCKEC                                                 00703000
IEDQCCW  EQU   0                                                        00704000
CCW      EQU   IEDQCCW                                                  00705000
CCWOPCDE EQU   CCW                                                      00706000
CCWADDR  EQU   CCW+1                                                    00707000
CCWFLAGS EQU   CCW+4                                                    00708000
CCWCD    EQU   CCWFLAGS                                                 00709000
CCWCC    EQU   CCWFLAGS                                                 00710000
CCWSLI   EQU   CCWFLAGS                                                 00711000
CCWRSV   EQU   CCW+5                                                    00712000
CCWCOUNT EQU   CCW+6                                                    00713000
IEDQDISP EQU   0                                                        00714000
DSPDISP  EQU   4                                                        00715000
DSPCHAIN EQU   12                                                       00716000
DSPPRIOR EQU   52                                                       00717000
IEDQLCB  EQU   0                                                        00718000
LCBRCB   EQU   IEDQLCB                                                  00719000
LCBRSKEY EQU   IEDQLCB+8                                                00720000
LCBTSOB  EQU   IEDQLCB+19                                               00721000
LCBCHAIN EQU   IEDQLCB+20                                               00722000
LCBSCRNN EQU   LCBCHAIN                                                 00723000
LCBTETEN EQU   LCBCHAIN                                                 00724000
LCBINSRC EQU   IEDQLCB+21                                               00725000
LCBLKMDE EQU   LCBINSRC+2                                               00726000
LCBNTXT  EQU   IEDQLCB+24                                               00727000
LCBSTAT4 EQU   LCBNTXT                                                  00728000
LCBPHASE EQU   LCBSTAT4                                                 00729000
LCBREAL  EQU   LCBPHASE                                                 00730000
LCBSCBDA EQU   IEDQLCB+25                                               00731000
LCBMHA   EQU   IEDQLCB+29                                               00732000
LCBFLAG1 EQU   IEDQLCB+32                                               00733000
LCBIOBSN EQU   IEDQLCB+33                                               00734000
LCBSNS   EQU   LCBIOBSN+1                                               00735000
LCBSENS0 EQU   LCBSNS                                                   00736000
LCBLOSDT EQU   LCBSENS0                                                 00737000
LCBTMOUT EQU   LCBSENS0                                                 00738000
LCBFLAG3 EQU   LCBIOBSN+7                                               00739000
LCBCSW   EQU   LCBIOBSN+8                                               00740000
LCBCSWST EQU   LCBCSW+3                                                 00741000
LCBCSWUS EQU   LCBCSWST                                                 00742000
LCBCSWCS EQU   LCBCSWST+1                                               00743000
LCBSIOCC EQU   LCBIOBSN+15                                              00744000
LCBSTART EQU   LCBIOBSN+16                                              00745000
LCBDCBPT EQU   IEDQLCB+52                                               00746000
LCBRCQCB EQU   IEDQLCB+56                                               00747000
LCBRESTR EQU   LCBRCQCB                                                 00748000
LCBTHSQ  EQU   IEDQLCB+60                                               00749000
LCBINCAM EQU   LCBTHSQ                                                  00750000
LCBERRCT EQU   IEDQLCB+62                                               00751000
LCBLSPCI EQU   IEDQLCB+65                                               00752000
LCBRCBFR EQU   LCBLSPCI                                                 00753000
LCBRDBFR EQU   LCBRCBFR                                                 00754000
LCBSTATE EQU   IEDQLCB+70                                               00755000
LCBSTAT1 EQU   LCBSTATE                                                 00756000
LCBFREEN EQU   LCBSTAT1                                                 00757000
LCBRECVN EQU   LCBSTAT1                                                 00758000
LCBSENDN EQU   LCBSTAT1                                                 00759000
LCBSTAT2 EQU   LCBSTATE+1                                               00760000
LCBBEOTN EQU   LCBSTAT2                                                 00761000
LCBSYNC  EQU   LCBSTAT2                                                 00762000
LCBATTN  EQU   LCBSYNC                                                  00763000
LCBDIAL  EQU   LCBSTAT2                                                 00764000
LCBBFRAV EQU   LCBDIAL                                                  00765000
LCBTSTSW EQU   IEDQLCB+72                                               00766000
LCBERB   EQU   IEDQLCB+76                                               00767000
LCBERBST EQU   IEDQLCB+84                                               00768000
LCBDLNKN EQU   LCBERBST                                                 00769000
LCBERBCT EQU   IEDQLCB+88                                               00770000
LCBRBCT2 EQU   LCBERBCT+1                                               00771000
LCBTTCIN EQU   IEDQLCB+90                                               00772000
LCBMSGFM EQU   IEDQLCB+92                                               00773000
LCBOBRCH EQU   IEDQLCB+96                                               00774000
LCBINVPT EQU   LCBOBRCH+1                                               00775000
LCBBFRW  EQU   LCBINVPT                                                 00776000
LCBTPCD  EQU   IEDQLCB+100                                              00777000
LCBSTAT5 EQU   LCBTPCD                                                  00778000
LCBSTAT6 EQU   LCBTPCD+4                                                00779000
LCBRSPSV EQU   LCBTPCD+8                                                00780000
LCBSAVSN EQU   IEDQLCB+112                                              00781000
LCBERCCW EQU   IEDQLCB+120                                              00782000
LCBCPA   EQU   IEDQLCB+144                                              00783000
LCBCCW1  EQU   LCBCPA                                                   00784000
LCBCCW2  EQU   LCBCPA+8                                                 00785000
LCBCCW3  EQU   LCBCPA+16                                                00786000
LCBCCW4  EQU   LCBCPA+24                                                00787000
LCBCCW5  EQU   LCBCPA+32                                                00788000
LCBATTEL EQU   LCBCCW5                                                  00789000
LCBQEBPL EQU   LCBATTEL                                                 00790000
LCBSIO   EQU   LCBQEBPL                                                 00791000
LCBCP    EQU   LCBQEBPL+4                                               00792000
LCBCCW6  EQU   LCBCPA+40                                                00793000
IEDQLCBX EQU   0                                                        00794000
LCBXCON  EQU   IEDQLCBX                                                 00795000
LCBXFLAG EQU   LCBXCON                                                  00796000
LCBXDCT  EQU   LCBXCON+1                                                00797000
LCBXRADR EQU   LCBXCON+4                                                00798000
IEDQPRF  EQU   0                                                        00799000
PRFRCB   EQU   IEDQPRF                                                  00800000
PRFKEY   EQU   PRFRCB                                                   00801000
PRFQCBA  EQU   PRFRCB+1                                                 00802000
PRFPRI   EQU   PRFRCB+4                                                 00803000
PRFLINK  EQU   PRFRCB+5                                                 00804000
PRFTIC   EQU   IEDQPRF+8                                                00805000
PRFTICC  EQU   PRFTIC                                                   00806000
PRFTI0   EQU   PRFTIC+1                                                 00807000
PRFNBUNT EQU   IEDQPRF+12                                               00808000
PRFSUNIT EQU   PRFNBUNT                                                 00809000
PRFPLQCB EQU   PRFSUNIT                                                 00810000
PRFPIUO  EQU   PRFPLQCB                                                 00811000
@NM00154 EQU   IEDQPRF+16                                               00812000
PRFSVFFO EQU   @NM00154                                                 00813000
PRFSTAT1 EQU   IEDQPRF+20                                               00814000
PRFEOFN  EQU   PRFSTAT1                                                 00815000
PRFCORE  EQU   IEDQPRF+21                                               00816000
PRFXTRA  EQU   PRFCORE                                                  00817000
PRFSCAN  EQU   IEDQPRF+24                                               00818000
PRFTQBCK EQU   IEDQPRF+26                                               00819000
PRFNTXT  EQU   PRFTQBCK                                                 00820000
PRFEOBOF EQU   PRFNTXT                                                  00821000
PRFCHDR  EQU   IEDQPRF+32                                               00822000
PRFHQBCK EQU   IEDQPRF+35                                               00823000
IEDPF1   EQU   0                                                        00824000
PRF1FLG1 EQU   IEDPF1+3                                                 00825000
PRF1WD2  EQU   IEDPF1+4                                                 00826000
PRF1SEQP EQU   PRF1WD2                                                  00827000
PRF1SQID EQU   PRF1SEQP                                                 00828000
PRF1TAG1 EQU   PRF1SQID                                                 00829000
IEDPF2   EQU   0                                                        00830000
PRF2FLG2 EQU   IEDPF2                                                   00831000
PRF2WD2  EQU   IEDPF2+4                                                 00832000
IEDQTNTD EQU   0                                                        00833000
IEDQTCDE EQU   IEDQTNTD                                                 00834000
IEDQTDCE EQU   IEDQTNTD+46                                              00835000
TNTCODE  EQU   0                                                        00836000
IEDTNTA  EQU   0                                                        00837000
IEDTRM   EQU   0                                                        00838000
IEDNTRM  EQU   IEDTRM                                                   00839000
TRMBYTE4 EQU   IEDNTRM                                                  00840000
TRMBYTE3 EQU   IEDNTRM+1                                                00841000
TRMBYTE2 EQU   IEDNTRM+2                                                00842000
TRMRSACT EQU   TRMBYTE2                                                 00843000
TRMINPG  EQU   TRMBYTE2                                                 00844000
TRMBYTE1 EQU   IEDNTRM+3                                                00845000
TRMSCPRQ EQU   TRMBYTE1                                                 00846000
TRMBYTE0 EQU   IEDNTRM+6                                                00847000
TRMSIBPT EQU   IEDNTRM+7                                                00848000
IEDQTRM  EQU   IEDTRM+14                                                00849000
TRMSTATE EQU   IEDQTRM                                                  00850000
TRMLOG   EQU   TRMSTATE                                                 00851000
TRMINSEQ EQU   IEDQTRM+4                                                00852000
TLISTCNT EQU   TRMINSEQ                                                 00853000
TRMOUTSQ EQU   IEDQTRM+6                                                00854000
TLISTEN  EQU   TRMOUTSQ                                                 00855000
TRMDSORG EQU   TLISTEN                                                  00856000
TRMALTD  EQU   IEDQTRM+8                                                00857000
TRMDEVFL EQU   IEDQTRM+10                                               00858000
TRMSTAT  EQU   IEDQTRM+12                                               00859000
IEDTH    EQU   0                                                        00860000
TTHBYTE0 EQU   IEDTH                                                    00861000
TTHSNF   EQU   IEDTH+6                                                  00862000
TTHTAG   EQU   TTHSNF                                                   00863000
TTHTAG1  EQU   TTHTAG                                                   00864000
TTHDCF   EQU   IEDTH+8                                                  00865000
CPARST   EQU   0                                                        00866000
DSPBYPAS EQU   20                                                       00867000
DSPLIFO  EQU   56                                                       00868000
DSPLIFOR EQU   60                                                       00869000
DSPLIST  EQU   8                                                        00870000
DSPPOST  EQU   24                                                       00871000
DSPPOSTR EQU   28                                                       00872000
DSPPRIO  EQU   48                                                       00873000
DSPTRACE EQU   64                                                       00874000
DSPTSTQ  EQU   32                                                       00875000
DSPTSTQR EQU   36                                                       00876000
DSPUNAV  EQU   40                                                       00877000
DSPUNAVR EQU   44                                                       00878000
DSPWAIT  EQU   16                                                       00879000
TNTDCODE EQU   0                                                        00880000
TNTFIRST EQU   0                                                        00881000
LCBRSPIN EQU   LCBIOBSN                                                 00882000
LCBLUSNS EQU   LCBRSPIN+5                                               00883000
LCBSCPRS EQU   LCBRSPIN+9                                               00884000
LCBCSWU1 EQU   LCBSCPRS+2                                               00885000
LCBRSPFG EQU   LCBRSPIN+15                                              00886000
LCBCOREQ EQU   LCBTPCD                                                  00887000
LCBCQELE EQU   LCBCOREQ                                                 00888000
@NM00134 EQU   LCBCPA+40                                                00889000
LCBQNX   EQU   LCBERCCW                                                 00890000
LCBQNXMN EQU   LCBQNX                                                   00891000
LCBCANCL EQU   LCBSAVSN                                                 00892000
LCBCANFG EQU   LCBCANCL                                                 00893000
IEDQNPTR EQU   AVTRNMPT                                                 00894000
TRMPRE1  EQU   TRMBYTE4                                                 00895000
TRMNCP1  EQU   TRMBYTE4                                                 00896000
TRMINOP  EQU   TRMNCP1                                                  00897000
TRMPRE   EQU   TRMBYTE3                                                 00898000
TRMNCP   EQU   TRMBYTE3                                                 00899000
TRMIPLDM EQU   TRMNCP                                                   00900000
TRMSLOWN EQU   TRMNCP                                                   00901000
TRMPU    EQU   TRMBYTE3                                                 00902000
TRMLU    EQU   TRMBYTE3                                                 00903000
TRMLINK  EQU   TRMBYTE3                                                 00904000
CPACCW1  EQU   LCBCCW1                                                  00905000
CPAWRTS  EQU   CPACCW1                                                  00906000
CPACCW2  EQU   LCBCCW2                                                  00907000
CPAWRTBF EQU   CPACCW2+1                                                00908000
CPAWRTBK EQU   CPACCW2+5                                                00909000
CPACCW3  EQU   LCBCCW3                                                  00910000
CPARDS   EQU   CPACCW3                                                  00911000
CPACCW4  EQU   LCBCCW4                                                  00912000
CPARDU   EQU   CPACCW4+1                                                00913000
PRFSHDR  EQU   IEDQPRF+42                                               00914000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00915000
@NM00173 EQU   CPACCW4                                                  00916000
@NM00172 EQU   CPACCW3+4                                                00917000
@NM00171 EQU   CPACCW3+1                                                00918000
@NM00170 EQU   CPACCW2+4                                                00919000
@NM00169 EQU   CPACCW2                                                  00920000
@NM00168 EQU   CPACCW1+1                                                00921000
@NM00165 EQU   TRMLINK                                                  00922000
TRMLSTAT EQU   TRMLINK                                                  00923000
TRMLINT  EQU   TRMLINK                                                  00924000
TRMEPMOD EQU   TRMLINK                                                  00925000
TRMLULOG EQU   TRMLU                                                    00926000
TRMINERR EQU   TRMLU                                                    00927000
TRMLUREQ EQU   TRMLU                                                    00928000
TRMSESRQ EQU   TRMLU                                                    00929000
TRMTDIFF EQU   TRMLU                                                    00930000
TRMLUTM  EQU   TRMLU                                                    00931000
TRMLUIT  EQU   TRMLU                                                    00932000
TRMAUTO  EQU   TRMLU                                                    00933000
TRMPCONT EQU   TRMPU                                                    00934000
@NM00164 EQU   TRMPU                                                    00935000
TRMNCONT EQU   TRMNCP                                                   00936000
TRMQUCKN EQU   TRMNCP                                                   00937000
TRMSYGEN EQU   TRMNCP                                                   00938000
TRMNCPCL EQU   TRMNCP                                                   00939000
TRMINOUT EQU   TRMPRE                                                   00940000
TRMRDOUT EQU   TRMPRE                                                   00941000
TRMNLOUT EQU   TRMPRE                                                   00942000
TRMWROUT EQU   TRMPRE                                                   00943000
TRMASNXI EQU   TRMPRE                                                   00944000
TRMSTMM  EQU   TRMPRE                                                   00945000
TRMCMODE EQU   TRMPRE                                                   00946000
TRMSTPND EQU   TRMPRE                                                   00947000
@NM00163 EQU   TRMNCP1                                                  00948000
TRMLYNCH EQU   TRMPRE1                                                  00949000
TRMSPOUT EQU   TRMPRE1                                                  00950000
TRMERLCK EQU   TRMPRE1                                                  00951000
TRMQNPL  EQU   TRMPRE1                                                  00952000
TRMSPACT EQU   TRMPRE1                                                  00953000
TRMOCNI  EQU   TRMPRE1                                                  00954000
TRMSESSN EQU   TRMPRE1                                                  00955000
TRMCONT  EQU   TRMPRE1                                                  00956000
@NM00142 EQU   LCBCANCL+3                                               00957000
LCBCANTH EQU   LCBCANCL+1                                               00958000
@NM00141 EQU   LCBCANFG                                                 00959000
LCBCANCD EQU   LCBCANFG                                                 00960000
@NM00140 EQU   LCBCANFG                                                 00961000
LCBCANEB EQU   LCBCANFG                                                 00962000
LCBCANXT EQU   LCBCANFG                                                 00963000
LCBUNADD EQU   LCBQNX+21                                                00964000
LCBUASZE EQU   LCBQNX+20                                                00965000
LCBDSTEA EQU   LCBQNX+16                                                00966000
@NM00139 EQU   LCBQNX+8                                                 00967000
LCBIOSBS EQU   LCBQNX+5                                                 00968000
@NM00138 EQU   LCBQNX+4                                                 00969000
LCBSTSAV EQU   LCBQNX+1                                                 00970000
@NM00137 EQU   LCBQNXMN                                                 00971000
LCBNX509 EQU   LCBQNXMN                                                 00972000
LCBNX162 EQU   LCBQNXMN                                                 00973000
LCBNX142 EQU   LCBQNXMN                                                 00974000
LCBNX064 EQU   LCBQNXMN                                                 00975000
@NM00136 EQU   @NM00134+4                                               00976000
LCBNCPPT EQU   @NM00134+1                                               00977000
@NM00135 EQU   @NM00134                                                 00978000
LCBWRSCH EQU   LCBCOREQ+8                                               00979000
LCBCQLNK EQU   LCBCOREQ+4                                               00980000
LCBPAKCH EQU   LCBRSPIN+16                                              00981000
@NM00133 EQU   LCBRSPFG                                                 00982000
LCBRSRH  EQU   LCBRSPFG                                                 00983000
LCBEXPI  EQU   LCBRSPFG                                                 00984000
@NM00132 EQU   LCBRSPIN+12                                              00985000
LCBUSUE1 EQU   LCBCSWU1                                                 00986000
@NM00131 EQU   LCBCSWU1                                                 00987000
@NM00130 EQU   LCBSCPRS+1                                               00988000
LCBDFCMD EQU   LCBSCPRS                                                 00989000
LCBUSER  EQU   LCBLUSNS+2                                               00990000
LCBSMIN  EQU   LCBLUSNS+1                                               00991000
LCBSMAJ  EQU   LCBLUSNS                                                 00992000
LCBRHSV  EQU   LCBRSPIN+2                                               00993000
LCBSNS0  EQU   LCBRSPIN+1                                               00994000
@NM00129 EQU   LCBRSPIN                                                 00995000
TTHTAG2  EQU   TTHTAG+1                                                 00996000
@NM00167 EQU   TTHTAG1                                                  00997000
TTHTAGS  EQU   TTHTAG1                                                  00998000
TTHOAF   EQU   IEDTH+4                                                  00999000
TTHDAF   EQU   IEDTH+2                                                  01000000
TTHBYTE1 EQU   IEDTH+1                                                  01001000
TTHEFI   EQU   TTHBYTE0                                                 01002000
@NM00166 EQU   TTHBYTE0                                                 01003000
TTHEBIU  EQU   TTHBYTE0                                                 01004000
TTHBBIU  EQU   TTHBYTE0                                                 01005000
TTHFTYPE EQU   TTHBYTE0                                                 01006000
TRMOPT   EQU   IEDTRM+34                                                01007000
TRMOPTBL EQU   IEDQTRM+18                                               01008000
TRMOPNO  EQU   IEDQTRM+17                                               01009000
TRMCHCIN EQU   IEDQTRM+16                                               01010000
TRMSENSE EQU   TRMSTAT+3                                                01011000
TRMTEMPR EQU   TRMSTAT+2                                                01012000
TRMSIO   EQU   TRMSTAT                                                  01013000
@NM00162 EQU   TRMDEVFL+1                                               01014000
TRMTPIN  EQU   TRMDEVFL+1                                               01015000
TRMNCPI  EQU   TRMDEVFL+1                                               01016000
TRMRNTRM EQU   TRMDEVFL+1                                               01017000
@NM00161 EQU   TRMDEVFL+1                                               01018000
TRMLMD   EQU   TRMDEVFL+1                                               01019000
TRMCONC  EQU   TRMDEVFL+1                                               01020000
TRMTSOB  EQU   TRMDEVFL                                                 01021000
TRMBFDY  EQU   TRMDEVFL                                                 01022000
TRMTBLK  EQU   TRMDEVFL                                                 01023000
TRMSBLK  EQU   TRMDEVFL                                                 01024000
TRMBLKS  EQU   TRMDEVFL                                                 01025000
TRMADDC  EQU   TRMDEVFL                                                 01026000
TRMDDIG  EQU   TRMDEVFL                                                 01027000
TRMBUFS  EQU   TRMDEVFL                                                 01028000
TRMPRILK EQU   TRMALTD                                                  01029000
TRMLGB   EQU   TRMDSORG                                                 01030000
TRMUTERM EQU   TLISTCNT                                                 01031000
TRMDESTQ EQU   IEDQTRM+1                                                01032000
TRMSCNYN EQU   TRMSTATE                                                 01033000
TRMOPTFN EQU   TRMSTATE                                                 01034000
TRMHELDN EQU   TRMSTATE                                                 01035000
TRMACPTN EQU   TRMSTATE                                                 01036000
TRMPREF  EQU   TRMSTATE                                                 01037000
TRMPROC  EQU   TRMLOG                                                   01038000
TRMLIST  EQU   TRMLOG                                                   01039000
TRMLINE  EQU   TRMSTATE                                                 01040000
TRMSUBST EQU   IEDNTRM+12                                               01041000
TRMTYPE  EQU   IEDNTRM+11                                               01042000
TRMRLMCT EQU   IEDNTRM+10                                               01043000
TRMCOHTG EQU   TRMSIBPT+1                                               01044000
TRMGPCNT EQU   TRMSIBPT                                                 01045000
TRMBUFRD EQU   TRMBYTE0                                                 01046000
TRMSNA   EQU   TRMBYTE0                                                 01047000
TRMGP    EQU   TRMBYTE0                                                 01048000
TRMDIAL  EQU   TRMBYTE0                                                 01049000
@NM00160 EQU   TRMBYTE0                                                 01050000
TRMOUTPT EQU   TRMBYTE0                                                 01051000
TRMINPUT EQU   TRMBYTE0                                                 01052000
TRMUDEF  EQU   TRMBYTE0                                                 01053000
TRMCOHRT EQU   IEDNTRM+4                                                01054000
TRMSTOTE EQU   TRMBYTE1                                                 01055000
TRMCKPRN EQU   TRMBYTE1                                                 01056000
TRMTSATN EQU   TRMBYTE1                                                 01057000
TRMTRACE EQU   TRMBYTE1                                                 01058000
TRMSWBCK EQU   TRMBYTE1                                                 01059000
TRMAUTOC EQU   TRMBYTE1                                                 01060000
TRMINPTP EQU   TRMBYTE1                                                 01061000
TRMWTNEG EQU   TRMSCPRQ                                                 01062000
TRMWRBRK EQU   TRMBYTE2                                                 01063000
TRMNOSND EQU   TRMBYTE2                                                 01064000
TRMPREP  EQU   TRMBYTE2                                                 01065000
TRMGPACT EQU   TRMBYTE2                                                 01066000
TRMANDL  EQU   TRMBYTE2                                                 01067000
TRMCLOSN EQU   TRMINPG                                                  01068000
TRMREMB  EQU   TRMBYTE2                                                 01069000
TNTTRMAD EQU   IEDTNTA                                                  01070000
TNTLEN   EQU   IEDQTNTD+44                                              01071000
TNTMIDEN EQU   IEDQTNTD+41                                              01072000
TNTENLEN EQU   IEDQTNTD+40                                              01073000
TNTSRCHX EQU   IEDQTNTD+38                                              01074000
PRF2SEQP EQU   PRF2WD2                                                  01075000
@NM00159 EQU   IEDPF2+1                                                 01076000
@NM00158 EQU   PRF2FLG2                                                 01077000
PRF2TERM EQU   PRF2FLG2                                                 01078000
PRF2SMI  EQU   PRF2FLG2                                                 01079000
PRF2FORM EQU   PRF2FLG2                                                 01080000
PRF2TNTI EQU   PRF2FLG2                                                 01081000
PRF1RULN EQU   PRF1SEQP+2                                               01082000
PRF1TAG2 EQU   PRF1SQID+1                                               01083000
@NM00157 EQU   PRF1TAG1                                                 01084000
PRF1TAGS EQU   PRF1TAG1                                                 01085000
@NM00156 EQU   PRF1FLG1                                                 01086000
PRF1LOGD EQU   PRF1FLG1                                                 01087000
PRF1USS  EQU   PRF1FLG1                                                 01088000
PRF1FORM EQU   PRF1FLG1                                                 01089000
PRF1EXPI EQU   PRF1FLG1                                                 01090000
PRF1FIDI EQU   PRF1FLG1                                                 01091000
PRF1RH   EQU   IEDPF1                                                   01092000
PRFDEST  EQU   IEDQPRF+40                                               01093000
PRFISEQ  EQU   IEDQPRF+38                                               01094000
PRFSTXT  EQU   PRFHQBCK                                                 01095000
PRFNHDR  EQU   PRFCHDR                                                  01096000
PRFCRCD  EQU   IEDQPRF+29                                               01097000
PRFSVSEQ EQU   PRFNTXT+1                                                01098000
PRFSVPRI EQU   PRFEOBOF                                                 01099000
PRFISIZE EQU   PRFSCAN+1                                                01100000
@NM00155 EQU   PRFSCAN                                                  01101000
PRFEOB   EQU   PRFXTRA+1                                                01102000
PRFSTSO  EQU   PRFXTRA                                                  01103000
PRFNHDRN EQU   PRFSTAT1                                                 01104000
PRFNLSTN EQU   PRFSTAT1                                                 01105000
PRFLOCK  EQU   PRFEOFN                                                  01106000
PRFDUPLN EQU   PRFSTAT1                                                 01107000
PRFTSMSG EQU   PRFSTAT1                                                 01108000
PRFITCPN EQU   PRFSTAT1                                                 01109000
PRFERMGN EQU   PRFSTAT1                                                 01110000
PRFCNCLN EQU   PRFSTAT1                                                 01111000
PRFSVFLG EQU   @NM00154+3                                               01112000
PRFSIZE  EQU   PRFSVFFO+2                                               01113000
PRFSRCE  EQU   PRFSVFFO                                                 01114000
PRFLCB   EQU   IEDQPRF+13                                               01115000
@NM00153 EQU   PRFTICC                                                  01116000
@NM00152 EQU   PRFTICC                                                  01117000
@NM00151 EQU   PRFTICC                                                  01118000
PRFTICON EQU   PRFTICC                                                  01119000
@NM00150 EQU   PRFTICC                                                  01120000
@NM00149 EQU   PRFTICC                                                  01121000
PRFBFMM  EQU   PRFTICC                                                  01122000
PRFEOMSG EQU   PRFTICC                                                  01123000
PRFCOUNT EQU   PRFLINK+1                                                01124000
@NM00148 EQU   PRFLINK                                                  01125000
PRFFLAGS EQU   PRFPRI                                                   01126000
PRFIOADR EQU   PRFQCBA                                                  01127000
PRFOPCDE EQU   PRFKEY                                                   01128000
LCBERADR EQU   LCBXRADR+1                                               01129000
LCBPCIRC EQU   LCBXRADR                                                 01130000
LCBDCT3  EQU   LCBXDCT+2                                                01131000
LCBDCT2  EQU   LCBXDCT+1                                                01132000
LCBDCT1  EQU   LCBXDCT                                                  01133000
@NM00147 EQU   LCBXFLAG                                                 01134000
LCBERPND EQU   LCBXFLAG                                                 01135000
LCBSRCPF EQU   LCBXFLAG                                                 01136000
LCBGPCTV EQU   LCBXFLAG                                                 01137000
@NM00146 EQU   LCBXFLAG                                                 01138000
@NM00145 EQU   LCBXFLAG                                                 01139000
@NM00144 EQU   LCBXFLAG                                                 01140000
@NM00143 EQU   LCBXFLAG                                                 01141000
LCBCCW10 EQU   LCBCPA+72                                                01142000
LCBCCW9  EQU   LCBCPA+64                                                01143000
LCBCCW8  EQU   LCBCPA+56                                                01144000
LCBCCW7  EQU   LCBCPA+48                                                01145000
LCBIOSB  EQU   LCBQEBPL+1                                               01146000
@NM00128 EQU   LCBERCCW+16                                              01147000
LCBATL05 EQU   LCBERCCW+8                                               01148000
@NM00127 EQU   LCBERCCW                                                 01149000
LCBCSWSV EQU   LCBSAVSN+1                                               01150000
LCBSNSV  EQU   LCBSAVSN                                                 01151000
LCBBFSNS EQU   LCBRSPSV                                                 01152000
LCBWAITC EQU   LCBTPCD+5                                                01153000
LCBINPAK EQU   LCBSTAT6                                                 01154000
LCBMHBID EQU   LCBSTAT6                                                 01155000
LCBRTRRO EQU   LCBSTAT6                                                 01156000
LCBHDRPD EQU   LCBSTAT6                                                 01157000
LCBCHN   EQU   LCBSTAT6                                                 01158000
LCBBFRSV EQU   LCBTPCD+1                                                01159000
@NM00126 EQU   LCBSTAT5                                                 01160000
LCBLUS   EQU   LCBSTAT5                                                 01161000
LCBLUNIT EQU   LCBSTAT5                                                 01162000
LCBPERM  EQU   LCBSTAT5                                                 01163000
LCBNXCMD EQU   LCBBFRW                                                  01164000
LCBERMSK EQU   LCBOBRCH                                                 01165000
LCBSCBA  EQU   IEDQLCB+93                                               01166000
LCBOLT   EQU   LCBMSGFM                                                 01167000
LCBEOT   EQU   LCBMSGFM                                                 01168000
LCBENQ   EQU   LCBMSGFM                                                 01169000
LCBTTD   EQU   LCBMSGFM                                                 01170000
LCBRSTRT EQU   LCBMSGFM                                                 01171000
LCBVSTRT EQU   LCBMSGFM                                                 01172000
LCBACKI  EQU   LCBMSGFM                                                 01173000
LCBNAK   EQU   LCBMSGFM                                                 01174000
@NM00125 EQU   LCBRBCT2                                                 01175000
LCBDCNT  EQU   LCBRBCT2                                                 01176000
LCBRBCT1 EQU   LCBERBCT                                                 01177000
LCBERBCH EQU   IEDQLCB+85                                               01178000
LCBCOMPL EQU   LCBDLNKN                                                 01179000
LCBPRCPG EQU   LCBERBST                                                 01180000
LCBERROR EQU   LCBERBST                                                 01181000
@NM00124 EQU   LCBERBST                                                 01182000
LCBINQ   EQU   LCBERBST                                                 01183000
LCBRDERR EQU   LCBERBST                                                 01184000
LCBEOMSG EQU   LCBERBST                                                 01185000
LCBMSG   EQU   LCBERBST                                                 01186000
LCBERBLK EQU   IEDQLCB+81                                               01187000
LCBERBPY EQU   IEDQLCB+80                                               01188000
LCBERBQB EQU   LCBERB+1                                                 01189000
LCBERBKY EQU   LCBERB                                                   01190000
LCBRECAD EQU   IEDQLCB+73                                               01191000
@NM00123 EQU   LCBTSTSW                                                 01192000
@NM00122 EQU   LCBTSTSW                                                 01193000
@NM00121 EQU   LCBTSTSW                                                 01194000
@NM00120 EQU   LCBTSTSW                                                 01195000
@NM00119 EQU   LCBTSTSW                                                 01196000
@NM00118 EQU   LCBTSTSW                                                 01197000
@NM00117 EQU   LCBTSTSW                                                 01198000
LCBCONCT EQU   LCBTSTSW                                                 01199000
LCBRESP  EQU   LCBSTAT2                                                 01200000
LCBNEGRP EQU   LCBSTAT2                                                 01201000
LCBSNDPR EQU   LCBSTAT2                                                 01202000
LCBCONNN EQU   LCBBEOTN                                                 01203000
LCBMSGNN EQU   LCBSTAT2                                                 01204000
LCBTRACE EQU   LCBSTAT2                                                 01205000
LCBCONT  EQU   LCBSTAT1                                                 01206000
LCBINITN EQU   LCBSTAT1                                                 01207000
LCBOCNI  EQU   LCBSTAT1                                                 01208000
LCBOCWTN EQU   LCBSTAT1                                                 01209000
LCBRCLLN EQU   LCBSTAT1                                                 01210000
LCBRECOF EQU   IEDQLCB+68                                               01211000
LCBUCBX  EQU   IEDQLCB+64                                               01212000
LCBTTBIN EQU   LCBERRCT                                                 01213000
@NM00116 EQU   LCBINCAM                                                 01214000
LCBGETMN EQU   LCBINCAM                                                 01215000
@NM00115 EQU   LCBRESTR+1                                               01216000
LCBCMDSV EQU   LCBRESTR                                                 01217000
LCBPCILK EQU   LCBDCBPT                                                 01218000
LCBAP4OL EQU   LCBSIOCC                                                 01219000
LCBAP3OL EQU   LCBSIOCC                                                 01220000
LCBAP2OL EQU   LCBSIOCC                                                 01221000
LCBAP1OL EQU   LCBSIOCC                                                 01222000
LCBSIOC2 EQU   LCBSIOCC                                                 01223000
LCBSIOC1 EQU   LCBSIOCC                                                 01224000
@NM00114 EQU   LCBSIOCC                                                 01225000
LCBCSWRC EQU   LCBCSW+5                                                 01226000
LCBCSCHC EQU   LCBCSWCS                                                 01227000
LCBCSICC EQU   LCBCSWCS                                                 01228000
LCBCSCCC EQU   LCBCSWCS                                                 01229000
LCBCSCDC EQU   LCBCSWCS                                                 01230000
LCBCSPTC EQU   LCBCSWCS                                                 01231000
LCBCSPGC EQU   LCBCSWCS                                                 01232000
LCBCSIL  EQU   LCBCSWCS                                                 01233000
LCBCSPCI EQU   LCBCSWCS                                                 01234000
LCBUSUE  EQU   LCBCSWUS                                                 01235000
LCBUSUC  EQU   LCBCSWUS                                                 01236000
LCBUSDE  EQU   LCBCSWUS                                                 01237000
LCBUSCE  EQU   LCBCSWUS                                                 01238000
LCBUSBSY EQU   LCBCSWUS                                                 01239000
LCBUSCUE EQU   LCBCSWUS                                                 01240000
LCBUSSM  EQU   LCBCSWUS                                                 01241000
LCBUSAT  EQU   LCBCSWUS                                                 01242000
LCBCSWCA EQU   LCBCSW                                                   01243000
LCBOBR   EQU   LCBFLAG3                                                 01244000
LCBOBRRD EQU   LCBFLAG3                                                 01245000
LCBIOMSG EQU   LCBFLAG3                                                 01246000
LCBSOHC  EQU   LCBFLAG3                                                 01247000
LCBRLAD  EQU   LCBFLAG3                                                 01248000
LCBSOHR  EQU   LCBFLAG3                                                 01249000
@NM00113 EQU   LCBFLAG3                                                 01250000
LCBECBPT EQU   LCBIOBSN+4                                               01251000
LCBECBCC EQU   LCBIOBSN+3                                               01252000
LCBSENS1 EQU   LCBSNS+1                                                 01253000
LCBABORT EQU   LCBTMOUT                                                 01254000
LCBNOTIN EQU   LCBLOSDT                                                 01255000
LCBOVRUN EQU   LCBSENS0                                                 01256000
LCBDATCK EQU   LCBSENS0                                                 01257000
LCBEQUCK EQU   LCBSENS0                                                 01258000
LCBBUSCK EQU   LCBSENS0                                                 01259000
LCBINTRQ EQU   LCBSENS0                                                 01260000
LCBCMDRJ EQU   LCBSENS0                                                 01261000
LCBFLAG2 EQU   LCBIOBSN                                                 01262000
@NM00112 EQU   LCBFLAG1                                                 01263000
LCBUNREL EQU   LCBFLAG1                                                 01264000
LCBEXCPN EQU   LCBFLAG1                                                 01265000
@NM00111 EQU   LCBFLAG1                                                 01266000
LCBERPIN EQU   LCBFLAG1                                                 01267000
@NM00110 EQU   LCBFLAG1                                                 01268000
LCBFSBFR EQU   LCBMHA                                                   01269000
LCBISZE  EQU   IEDQLCB+28                                               01270000
LCBLNENT EQU   LCBSCBDA+1                                               01271000
@NM00109 EQU   LCBSCBDA                                                 01272000
LCBCPGMH EQU   LCBSTAT4                                                 01273000
@NM00108 EQU   LCBSTAT4                                                 01274000
LCBACTRQ EQU   LCBSTAT4                                                 01275000
LCBIPLRQ EQU   LCBSTAT4                                                 01276000
LCBDACRQ EQU   LCBSTAT4                                                 01277000
LCBDMPRQ EQU   LCBSTAT4                                                 01278000
@NM00107 EQU   LCBLKMDE                                                 01279000
LCBLOCKI EQU   LCBLKMDE                                                 01280000
LCBLOCKR EQU   LCBLKMDE                                                 01281000
LCBHMFLG EQU   LCBLKMDE                                                 01282000
LCBBDFLG EQU   LCBLKMDE                                                 01283000
@NM00106 EQU   LCBINSRC                                                 01284000
LCBABRTN EQU   LCBCHAIN                                                 01285000
LCBCTLMD EQU   LCBTETEN                                                 01286000
LCBBFRSZ EQU   LCBCHAIN                                                 01287000
LCBUREQN EQU   LCBCHAIN                                                 01288000
LCBNORTY EQU   LCBCHAIN                                                 01289000
LCBERMSG EQU   LCBCHAIN                                                 01290000
LCBEXCP  EQU   LCBCHAIN                                                 01291000
LCBINVRQ EQU   LCBSCRNN                                                 01292000
LCB2741N EQU   LCBTSOB                                                  01293000
LCBINHBN EQU   LCBTSOB                                                  01294000
LCBCIRCD EQU   LCBTSOB                                                  01295000
LCBPREP  EQU   LCBTSOB                                                  01296000
LCBSOPL  EQU   LCBTSOB                                                  01297000
LCBSATRD EQU   LCBTSOB                                                  01298000
LCBTSBUF EQU   LCBTSOB                                                  01299000
LCBWRBRK EQU   LCBTSOB                                                  01300000
LCBTDL   EQU   IEDQLCB+18                                               01301000
LCBEOLTD EQU   IEDQLCB+16                                               01302000
LCBRSLNK EQU   IEDQLCB+13                                               01303000
LCBRSPRI EQU   IEDQLCB+12                                               01304000
LCBSTCBA EQU   IEDQLCB+9                                                01305000
LCBLINK  EQU   LCBRCB+5                                                 01306000
LCBPRI   EQU   LCBRCB+4                                                 01307000
LCBQCBA  EQU   LCBRCB+1                                                 01308000
LCBKEY   EQU   LCBRCB                                                   01309000
@NM00105 EQU   CCWFLAGS                                                 01310000
CCWIDA   EQU   CCWFLAGS                                                 01311000
CCWPCI   EQU   CCWFLAGS                                                 01312000
CCWSKIP  EQU   CCWFLAGS                                                 01313000
SAVTLLCB EQU   IEDNSVTD+316                                             01314000
SAVTBITN EQU   IEDNSVTD+312                                             01315000
@NM00104 EQU   SAVTCKQB+8                                               01316000
@NM00103 EQU   SAVTCKEC+1                                               01317000
@NM00102 EQU   SAVTCKCC                                                 01318000
SAVTCKPO EQU   SAVTCKCC                                                 01319000
SAVTCKWA EQU   SAVTCKCC                                                 01320000
SAVTCKCH EQU   SAVTCKTB+1                                               01321000
SAVTCKVT EQU   SAVTCKTB                                                 01322000
@NM00101 EQU   IEDNSVTD+297                                             01323000
SAVTRDFG EQU   SAVTRDRV+12                                              01324000
@NM00100 EQU   SAVTRDRV+5                                               01325000
SAVTRDPY EQU   SAVTRDRV+4                                               01326000
SAVTRDQB EQU   SAVTRDRV+1                                               01327000
SAVTRDKY EQU   SAVTRDRV                                                 01328000
SAVTNID  EQU   IEDNSVTD+280                                             01329000
SAVTDVAS EQU   IEDNSVTD+276                                             01330000
SAVTPLSZ EQU   IEDNSVTD+274                                             01331000
@NM00099 EQU   IEDNSVTD+273                                             01332000
SAVTSUBL EQU   IEDNSVTD+272                                             01333000
@NM00098 EQU   SAVTZELM+1                                               01334000
SAVTSUBM EQU   SAVTZELM                                                 01335000
SAVTMHDX EQU   IEDNSVTD+268                                             01336000
SAVTNAT1 EQU   IEDNSVTD+266                                             01337000
SAVTSH20 EQU   IEDNSVTD+264                                             01338000
SAVTLCBS EQU   IEDNSVTD+260                                             01339000
SAVTRNMP EQU   IEDNSVTD+256                                             01340000
SAVTTNTX EQU   IEDNSVTD+252                                             01341000
SAVTNAX  EQU   IEDNSVTD+248                                             01342000
SAVTSUBV EQU   IEDNSVTD+247                                             01343000
SAVTSUBA EQU   IEDNSVTD+246                                             01344000
SAVTSIBC EQU   IEDNSVTD+244                                             01345000
SAVTBSM  EQU   IEDNSVTD+240                                             01346000
SAVTSCPT EQU   SAVTTCPU                                                 01347000
SAVTRQTG EQU   IEDNSVTD+236                                             01348000
SAVTRQCH EQU   IEDNSVTD+232                                             01349000
SAVTMAND EQU   IEDNSVTD+228                                             01350000
SAVTSPLN EQU   IEDNSVTD+224                                             01351000
SAVTNADL EQU   IEDNSVTD+222                                             01352000
SAVTNATL EQU   IEDNSVTD+220                                             01353000
SAVTMHTB EQU   IEDNSVTD+216                                             01354000
SAVTSSMH EQU   IEDNSVTD+212                                             01355000
SAVTQRS  EQU   IEDNSVTD+208                                             01356000
SAVTRQIN EQU   IEDNSVTD+204                                             01357000
SAVTDFCO EQU   IEDNSVTD+200                                             01358000
SAVTSAO  EQU   IEDNSVTD+196                                             01359000
SAVTSARI EQU   IEDNSVTD+192                                             01360000
SAVTSAC  EQU   IEDNSVTD+188                                             01361000
SAVTSAI  EQU   IEDNSVTD+184                                             01362000
SAVTCSCI EQU   IEDNSVTD+180                                             01363000
SAVTSSRP EQU   IEDNSVTD+176                                             01364000
SAVTSSRQ EQU   IEDNSVTD+172                                             01365000
SAVTSCLU EQU   IEDNSVTD+168                                             01366000
SAVTXTRQ EQU   IEDNSVTD+164                                             01367000
SAVTMVBF EQU   IEDNSVTD+160                                             01368000
@NM00097 EQU   IEDNSVTD+148                                             01369000
SAVTIPCQ EQU   IEDNSVTD+144                                             01370000
@NM00096 EQU   IEDNSVTD+136                                             01371000
SAVTXFMI EQU   IEDNSVTD+132                                             01372000
@NM00095 EQU   IEDNSVTD+124                                             01373000
SAVTXFMO EQU   IEDNSVTD+120                                             01374000
@NM00094 EQU   IEDNSVTD+116                                             01375000
SAVTSSSR EQU   IEDNSVTD+112                                             01376000
SAVTSCPQ EQU   IEDNSVTD+108                                             01377000
SAVTSLCB EQU   IEDNSVTD+104                                             01378000
SAVTLUSR EQU   IEDNSVTD+100                                             01379000
@NM00093 EQU   SAVTLUSQ+8                                               01380000
SAVTLUSP EQU   SAVTLUSQ+4                                               01381000
SAVTLUSB EQU   SAVTLUSQ                                                 01382000
@NM00092 EQU   IEDNSVTD+84                                              01383000
SAVTSAT  EQU   IEDNSVTD+80                                              01384000
SAVTNAT  EQU   IEDNSVTD+76                                              01385000
SAVTPIUT EQU   IEDNSVTD+68                                              01386000
SAVTRNTA EQU   IEDNSVTD+64                                              01387000
SAVTDNIR EQU   IEDNSVTD+60                                              01388000
SAVTCNIR EQU   IEDNSVTD+56                                              01389000
SAVTFLDH EQU   IEDNSVTD+52                                              01390000
SAVTSRTN EQU   IEDNSVTD+48                                              01391000
SAVTSREQ EQU   IEDNSVTD+44                                              01392000
SAVTFAIL EQU   IEDNSVTD+42                                              01393000
SAVTSUSE EQU   IEDNSVTD+40                                              01394000
SAVTSIB  EQU   IEDNSVTD+36                                              01395000
SAVTPRTN EQU   IEDNSVTD+32                                              01396000
@NM00091 EQU   IEDNSVTD+28                                              01397000
SAVTWH20 EQU   IEDNSVTD+26                                              01398000
SAVTPWT  EQU   IEDNSVTD+24                                              01399000
SAVTPRTQ EQU   IEDNSVTD+20                                              01400000
SAVTPREQ EQU   IEDNSVTD+16                                              01401000
SAVTPH20 EQU   IEDNSVTD+14                                              01402000
SAVTPUSE EQU   IEDNSVTD+12                                              01403000
SAVTPLCB EQU   IEDNSVTD+8                                               01404000
SAVTPOOL EQU   IEDNSVTD+4                                               01405000
SAVTPRMT EQU   SAVTDIAF                                                 01406000
SAVTVIRT EQU   SAVTDIAF                                                 01407000
AVTCPBNO EQU   IEDQAVTD+1172                                            01408000
AVTHRESS EQU   IEDQAVTD+1171                                            01409000
@NM00090 EQU   IEDQAVTD+1170                                            01410000
@NM00089 EQU   IEDQAVTD+1169                                            01411000
@NM00088 EQU   IEDQAVTD+1168                                            01412000
@NM00087 EQU   IEDQAVTD+1165                                            01413000
@NM00086 EQU   IEDQAVTD+1164                                            01414000
AVTHRESE EQU   @NM00085                                                 01415000
AVTRADDR EQU   IEDQAVTD+1156                                            01416000
AVTNADDR EQU   IEDQAVTD+1152                                            01417000
AVTHRESN EQU   IEDQAVTD+1148                                            01418000
AVTVOLRN EQU   IEDQAVTD+1144                                            01419000
AVTTOTNN EQU   IEDQAVTD+1140                                            01420000
AVTTRCYN EQU   IEDQAVTD+1136                                            01421000
AVTRCTRN EQU   IEDQAVTD+1132                                            01422000
AVTNOVON EQU   IEDQAVTD+1128                                            01423000
AVTADEBN EQU   IEDQAVTD+1124                                            01424000
AVTVOLRR EQU   IEDQAVTD+1120                                            01425000
AVTTOTNR EQU   IEDQAVTD+1116                                            01426000
AVTTRCYR EQU   IEDQAVTD+1112                                            01427000
AVTRCTRR EQU   IEDQAVTD+1108                                            01428000
AVTNOVOR EQU   IEDQAVTD+1104                                            01429000
AVTADEBR EQU   IEDQAVTD+1100                                            01430000
AVTLODPT EQU   IEDQAVTD+1096                                            01431000
AVTIOBN  EQU   IEDQAVTD+1092                                            01432000
AVTIOBR  EQU   IEDQAVTD+1088                                            01433000
AVTCPBPT EQU   IEDQAVTD+1084                                            01434000
AVTFCPB  EQU   IEDQAVTD+1080                                            01435000
@NM00084 EQU   IEDQAVTD+1076                                            01436000
AVTINCPQ EQU   IEDQAVTD+1072                                            01437000
@NM00083 EQU   IEDQAVTD+1068                                            01438000
@NM00082 EQU   IEDQAVTD+1065                                            01439000
@NM00081 EQU   AVTBIT4                                                  01440000
@NM00080 EQU   AVTBIT4                                                  01441000
@NM00079 EQU   AVTBIT4                                                  01442000
@NM00078 EQU   AVTBIT4                                                  01443000
@NM00077 EQU   AVTBIT4                                                  01444000
@NM00076 EQU   AVTBIT4                                                  01445000
@NM00075 EQU   AVTBIT4                                                  01446000
AVTRUFTN EQU   AVTBIT4                                                  01447000
@NM00074 EQU   IEDQAVTD+1060                                            01448000
AVTNOBFQ EQU   IEDQAVTD+1056                                            01449000
@NM00073 EQU   IEDQAVTD+1052                                            01450000
AVTDKENQ EQU   IEDQAVTD+1048                                            01451000
@NM00072 EQU   IEDQAVTD+1044                                            01452000
AVTDKAPQ EQU   IEDQAVTD+1040                                            01453000
AVTCOPY  EQU   IEDQAVTD+1036                                            01454000
AVTIA    EQU   IEDQAVTD+1032                                            01455000
AVTFL    EQU   IEDQAVTD+1028                                            01456000
@NM00071 EQU   IEDQAVTD+1024                                            01457000
AVTNCPBQ EQU   IEDQAVTD+1020                                            01458000
AVTTOTNC EQU   IEDQAVTD+1016                                            01459000
AVTCMAX  EQU   IEDQAVTD+1012                                            01460000
AVTCMIN  EQU   IEDQAVTD+1008                                            01461000
AVTHM02  EQU   IEDQAVTD+1004                                            01462000
AVTOPCIN EQU   IEDQAVTD+1002                                            01463000
AVTDCTLN EQU   IEDQAVTD+1000                                            01464000
AVTOPMSK EQU   IEDQAVTD+996                                             01465000
AVTDDFT  EQU   IEDQAVTD+992                                             01466000
AVTSTEAL EQU   IEDQAVTD+988                                             01467000
AVTOPTN  EQU   IEDQAVTD+984                                             01468000
AVTDSKCT EQU   IEDQAVTD+982                                             01469000
AVTCKRST EQU   IEDQAVTD+981                                             01470000
AVTSTAN  EQU   AVTBIT3                                                  01471000
AVTSTACN EQU   AVTBIT3                                                  01472000
AVTSTAIN EQU   AVTBIT3                                                  01473000
AVTSTAYN EQU   AVTBIT3                                                  01474000
AVTOLTBN EQU   AVTBIT3                                                  01475000
AVTTSAB  EQU   AVTBIT3                                                  01476000
AVTRFULN EQU   AVTBIT3                                                  01477000
AVTRECVN EQU   AVTBIT3                                                  01478000
@NM00070 EQU   AVTBIT2                                                  01479000
@NM00069 EQU   AVTBIT2                                                  01480000
AVTOPEIN EQU   AVTBIT2                                                  01481000
AVTSTRTN EQU   AVTBIT2                                                  01482000
AVTTOPOL EQU   AVTBIT2                                                  01483000
AVTCOPYN EQU   AVTBIT2                                                  01484000
AVTREUSN EQU   AVTBIT2                                                  01485000
AVTEXTSC EQU   AVTBIT2                                                  01486000
AVTDISKN EQU   AVTBIT1                                                  01487000
AVTQUCKN EQU   AVTBIT1                                                  01488000
AVTCLOSN EQU   AVTBIT1                                                  01489000
AVTREADN EQU   AVTBIT1                                                  01490000
AVTDLAYN EQU   AVTBIT1                                                  01491000
AVTAQTAN EQU   AVTBIT1                                                  01492000
AVTTSON  EQU   AVTBIT1                                                  01493000
AVTAPLKN EQU   AVTBIT1                                                  01494000
AVTDUMBR EQU   IEDQAVTD+976                                             01495000
AVTDLQX  EQU   IEDQAVTD+974                                             01496000
AVTINTLV EQU   IEDQAVTD+972                                             01497000
AVTSMCNT EQU   IEDQAVTD+970                                             01498000
AVTAVFCT EQU   IEDQAVTD+968                                             01499000
AVTOPCON EQU   IEDQAVTD+966                                             01500000
AVTOPCNT EQU   IEDQAVTD+964                                             01501000
AVTLNCNT EQU   IEDQAVTD+962                                             01502000
AVTHA16  EQU   IEDQAVTD+958                                             01503000
AVTHA7   EQU   IEDQAVTD+956                                             01504000
AVTHA4   EQU   IEDQAVTD+954                                             01505000
AVTHA3   EQU   IEDQAVTD+952                                             01506000
AVTHA2   EQU   IEDQAVTD+950                                             01507000
AVTGETMS EQU   IEDQAVTD+949                                             01508000
@NM00068 EQU   IEDQAVTD+948                                             01509000
AVTGETMD EQU   IEDQAVTD+944                                             01510000
AVTGETMN EQU   IEDQAVTD+940                                             01511000
AVTCWTOT EQU   IEDQAVTD+936                                             01512000
AVTCWINT EQU   IEDQAVTD+884                                             01513000
AVTDTRAP EQU   IEDQAVTD+880                                             01514000
@NM00067 EQU   IEDQAVTD+878                                             01515000
@NM00066 EQU   AVTIOTR                                                  01516000
AVTIOTRH EQU   AVTIOTR                                                  01517000
AVTIOTRE EQU   AVTIOTR                                                  01518000
@NM00065 EQU   AVTSUBT                                                  01519000
AVTSUBPT EQU   AVTSUBT                                                  01520000
AVTSUBON EQU   AVTSUBT                                                  01521000
AVTAFE30 EQU   IEDQAVTD+872                                             01522000
AVTAFE20 EQU   IEDQAVTD+868                                             01523000
AVTAFE10 EQU   IEDQAVTD+864                                             01524000
AVTCWEC2 EQU   IEDQAVTD+860                                             01525000
AVTCWPM2 EQU   IEDQAVTD+856                                             01526000
AVTCWTS2 EQU   IEDQAVTD+855                                             01527000
AVTCWTS1 EQU   IEDQAVTD+854                                             01528000
AVTCWCLD EQU   AVTCWFL2                                                 01529000
AVTCWRAP EQU   AVTCWFL2                                                 01530000
@NM00064 EQU   AVTCWFL2                                                 01531000
@NM00063 EQU   AVTCWFL2                                                 01532000
@NM00062 EQU   AVTCWFL2                                                 01533000
@NM00061 EQU   AVTCWFL2                                                 01534000
@NM00060 EQU   AVTCWFL2                                                 01535000
AVTCWACT EQU   AVTCWFL2                                                 01536000
@NM00059 EQU   AVTCWFL1                                                 01537000
@NM00058 EQU   AVTCWFL1                                                 01538000
@NM00057 EQU   AVTCWFL1                                                 01539000
@NM00056 EQU   AVTCWFL1                                                 01540000
@NM00055 EQU   AVTCWFL1                                                 01541000
@NM00054 EQU   AVTCWFL1                                                 01542000
@NM00053 EQU   AVTCWFL1                                                 01543000
AVTCOMWN EQU   AVTCWFL1                                                 01544000
AVTCWEC1 EQU   IEDQAVTD+848                                             01545000
AVTCWPM1 EQU   IEDQAVTD+844                                             01546000
AVTCAREA EQU   IEDQAVTD+840                                             01547000
AVTFZERO EQU   IEDQAVTD+836                                             01548000
AVTCADDR EQU   IEDQAVTD+832                                             01549000
AVTCOREC EQU   IEDQAVTD+828                                             01550000
@NM00052 EQU   IEDQAVTD+820                                             01551000
AVTCPBCB EQU   IEDQAVTD+816                                             01552000
@NM00051 EQU   IEDQAVTD+808                                             01553000
AVTDSIOB EQU   IEDQAVTD+804                                             01554000
@NM00050 EQU   IEDQAVTD+796                                             01555000
AVTCPRMB EQU   IEDQAVTD+792                                             01556000
@NM00049 EQU   IEDQAVTD+784                                             01557000
AVTCLOSB EQU   IEDQAVTD+780                                             01558000
@NM00048 EQU   IEDQAVTD+772                                             01559000
AVTACTIB EQU   IEDQAVTD+768                                             01560000
@NM00047 EQU   IEDQAVTD+764                                             01561000
AVTOLTEB EQU   IEDQAVTD+760                                             01562000
AVTOLTCH EQU   AVTOLTQB+1                                               01563000
AVTOLTVT EQU   AVTOLTQB                                                 01564000
@NM00046 EQU   AVTOPCQB+8                                               01565000
@NM00045 EQU   AVTOPCEC+1                                               01566000
@NM00044 EQU   AVTOPCCC                                                 01567000
AVTOPCPO EQU   AVTOPCCC                                                 01568000
AVTOPCWA EQU   AVTOPCCC                                                 01569000
AVTOPCCH EQU   AVTOPCOB+1                                               01570000
AVTOPCVT EQU   AVTOPCOB                                                 01571000
@NM00043 EQU   AVTCKPQB+9                                               01572000
AVTCKPTS EQU   AVTCKPQB+8                                               01573000
@NM00042 EQU   AVTCKPEC+1                                               01574000
@NM00041 EQU   AVTCKPCC                                                 01575000
AVTCKPPO EQU   AVTCKPCC                                                 01576000
AVTCKPWA EQU   AVTCKPCC                                                 01577000
AVTCKPCH EQU   AVTCKPTB+1                                               01578000
AVTCKPVT EQU   AVTCKPTB                                                 01579000
@NM00040 EQU   IEDQAVTD+724                                             01580000
AVTBFRTB EQU   IEDQAVTD+720                                             01581000
@NM00039 EQU   IEDQAVTD+716                                             01582000
AVTSELCH EQU   IEDQAVTD+713                                             01583000
AVTBFRTN EQU   AVTBFRFG                                                 01584000
AVTBFREB EQU   IEDQAVTD+708                                             01585000
AVTTIMQ  EQU   IEDQAVTD+704                                             01586000
@NM00038 EQU   IEDQAVTD+700                                             01587000
AVTIMQPS EQU   IEDQAVTD+696                                             01588000
AVTINOUT EQU   IEDQAVTD+694                                             01589000
AVTREFTM EQU   IEDQAVTD+692                                             01590000
@NM00037 EQU   IEDQAVTD+680                                             01591000
AVTDELYB EQU   IEDQAVTD+676                                             01592000
AVTOCQPT EQU   IEDQAVTD+672                                             01593000
AVTTSOPT EQU   IEDQAVTD+668                                             01594000
AVTSUPPT EQU   IEDQAVTD+664                                             01595000
AVTCBQCB EQU   IEDQAVTD+660                                             01596000
AVTMSGS  EQU   IEDQAVTD+657                                             01597000
@NM00036 EQU   AVTSYSER                                                 01598000
@NM00035 EQU   AVTSYSER                                                 01599000
@NM00034 EQU   AVTSYSER                                                 01600000
@NM00033 EQU   AVTSYSER                                                 01601000
@NM00032 EQU   AVTSYSER                                                 01602000
@NM00031 EQU   AVTSYSER                                                 01603000
AVTCMAXN EQU   AVTSYSER                                                 01604000
AVTCMINN EQU   AVTSYSER                                                 01605000
AVT2260L EQU   IEDQAVTD+652                                             01606000
AVTABEPL EQU   AVTADBUF                                                 01607000
AVTHFF   EQU   AVTCLRHI+2                                               01608000
@NM00030 EQU   AVTCLRHI                                                 01609000
AVTCCLNK EQU   AVTCRELE+5                                               01610000
AVTCCPRI EQU   AVTCRELE+4                                               01611000
AVTCCQCB EQU   AVTCCELE+1                                               01612000
AVTCCKEY EQU   AVTCCELE                                                 01613000
AVTDELEM EQU   IEDQAVTD+628                                             01614000
AVTBSX   EQU   AVTCKLNK                                                 01615000
AVTOPETR EQU   AVTHG01                                                  01616000
@NM00029 EQU   AVTCKBYT                                                 01617000
AVTCKONQ EQU   AVTCKBYT                                                 01618000
@NM00028 EQU   AVTCKBYT                                                 01619000
@NM00027 EQU   AVTCKBYT                                                 01620000
@NM00026 EQU   AVTCKBYT                                                 01621000
@NM00025 EQU   AVTCKBYT                                                 01622000
@NM00024 EQU   AVTCKBYT                                                 01623000
@NM00023 EQU   AVTCKBYT                                                 01624000
AVTOPERT EQU   IEDQAVTD+618                                             01625000
AVTOPXCL EQU   IEDQAVTD+616                                             01626000
AVTOPERL EQU   IEDQAVTD+615                                             01627000
@NM00022 EQU   IEDQAVTD+614                                             01628000
AVTCKTIM EQU   IEDQAVTD+612                                             01629000
AVTCKELV EQU   IEDQAVTD+610                                             01630000
AVTCPRCD EQU   IEDQAVTD+609                                             01631000
AVTWARMN EQU   AVTCKELF                                                 01632000
AVTCRTLN EQU   AVTCKELF                                                 01633000
AVTCPIPN EQU   AVTCKELF                                                 01634000
AVTCCLCN EQU   AVTCKELF                                                 01635000
AVTCINCN EQU   AVTCKELF                                                 01636000
@NM00021 EQU   AVTCKELF                                                 01637000
AVTCMCPN EQU   AVTCKELF                                                 01638000
AVTNQBCK EQU   AVTCKELF                                                 01639000
AVTCKQAD EQU   IEDQAVTD+605                                             01640000
AVTSCBSZ EQU   IEDQAVTD+604                                             01641000
@NM00020 EQU   IEDQAVTD+600                                             01642000
AVTCKELE EQU   IEDQAVTD+596                                             01643000
@NM00019 EQU   AVTCKPEL+8                                               01644000
AVTCKRLK EQU   AVTCKPEL+5                                               01645000
AVTCKRPR EQU   AVTCKPEL+4                                               01646000
AVTCKRMQ EQU   AVTCKRMV+1                                               01647000
AVTCKRKY EQU   AVTCKRMV                                                 01648000
AVTHK    EQU   IEDQAVTD+576                                             01649000
AVTHI    EQU   IEDQAVTD+572                                             01650000
AVTIOT   EQU   IEDQAVTD+568                                             01651000
AVTNX    EQU   IEDQAVTD+564                                             01652000
AVTTONE  EQU   IEDQAVTD+560                                             01653000
AVTA3TL  EQU   IEDQAVTD+556                                             01654000
AVTDMECB EQU   IEDQAVTD+552                                             01655000
AVTABEND EQU   IEDQAVTD+546                                             01656000
AVTPLCBN EQU   IEDQAVTD+544                                             01657000
@NM00018 EQU   AVTSAVTP+1                                               01658000
@NM00017 EQU   AVTSAVTF                                                 01659000
AVTSNA   EQU   AVTSAVTF                                                 01660000
AVTONSNA EQU   AVTSAVTF                                                 01661000
AVTVTMCP EQU   AVTSAVTF                                                 01662000
@NM00016 EQU   IEDQAVTD+536                                             01663000
AVTCMBSS EQU   IEDQAVTD+532                                             01664000
AVTRCV   EQU   IEDQAVTD+528                                             01665000
AVTSEND  EQU   IEDQAVTD+524                                             01666000
AVTCSCH  EQU   IEDQAVTD+520                                             01667000
AVTQ1    EQU   IEDQAVTD+516                                             01668000
AVTE7    EQU   IEDQAVTD+512                                             01669000
AVTHB    EQU   IEDQAVTD+508                                             01670000
AVTR1    EQU   IEDQAVTD+504                                             01671000
AVTBZ    EQU   IEDQAVTD+500                                             01672000
AVTEZ    EQU   IEDQAVTD+496                                             01673000
AVTEC    EQU   IEDQAVTD+492                                             01674000
AVTEW    EQU   IEDQAVTD+488                                             01675000
AVTNDIAL EQU   AVTSCOPT                                                 01676000
AVTN2741 EQU   AVTSCOPT                                                 01677000
AVTCONCO EQU   AVTSCOPT                                                 01678000
AVTCONC  EQU   AVTSCOPT                                                 01679000
AVTCMBUF EQU   AVTSCOPT                                                 01680000
AVTAPDMP EQU   AVTSCOPT                                                 01681000
@NM00015 EQU   AVTSCOPT                                                 01682000
AVTHA    EQU   AVTDISP                                                  01683000
AVTEA    EQU   IEDQAVTD+476                                             01684000
AVTAX    EQU   IEDQAVTD+472                                             01685000
AVTA3    EQU   IEDQAVTD+468                                             01686000
AVTGD    EQU   IEDQAVTD+464                                             01687000
AVTAL    EQU   IEDQAVTD+460                                             01688000
AVTOLTST EQU   AVTHG02                                                  01689000
AVTE8    EQU   IEDQAVTD+452                                             01690000
AVTUI    EQU   IEDQAVTD+448                                             01691000
AVTCOMPT EQU   IEDQAVTD+444                                             01692000
AVTCRSRF EQU   IEDQAVTD+440                                             01693000
@NM00014 EQU   IEDQAVTD+436                                             01694000
AVTKA02  EQU   IEDQAVTD+432                                             01695000
AVTOPTPT EQU   IEDQAVTD+428                                             01696000
AVTPCBPT EQU   IEDQAVTD+424                                             01697000
@NM00013 EQU   AVTECB1                                                  01698000
AVTCOMP  EQU   AVTECB1                                                  01699000
@NM00012 EQU   AVTECB1                                                  01700000
AVTOPECA EQU   IEDQAVTD+416                                             01701000
AVTOLECA EQU   IEDQAVTD+412                                             01702000
AVTCKECA EQU   IEDQAVTD+408                                             01703000
AVTCWECA EQU   IEDQAVTD+404                                             01704000
AVTCWTCB EQU   IEDQAVTD+400                                             01705000
AVTOLTCB EQU   IEDQAVTD+396                                             01706000
AVTOCTCB EQU   IEDQAVTD+392                                             01707000
AVTCKTCB EQU   IEDQAVTD+388                                             01708000
AVTAS    EQU   IEDQAVTD+384                                             01709000
AVTNOLBF EQU   IEDQAVTD+382                                             01710000
AVTNCKPR EQU   IEDQAVTD+381                                             01711000
AVTCIB   EQU   IEDQAVTD+380                                             01712000
AVTSPLPT EQU   IEDQAVTD+376                                             01713000
AVTMVBFR EQU   IEDQAVTD+372                                             01714000
AVTSBTA  EQU   IEDQAVTD+368                                             01715000
AVTRARTN EQU   IEDQAVTD+364                                             01716000
AVTBSCAN EQU   IEDQAVTD+360                                             01717000
AVTRDYA  EQU   IEDQAVTD+356                                             01718000
AVTDISTR EQU   IEDQAVTD+348                                             01719000
AVTPARM3 EQU   IEDQAVTD+344                                             01720000
@NM00011 EQU   AVTPKF                                                   01721000
@NM00010 EQU   AVTPKF                                                   01722000
@NM00009 EQU   AVTPKF                                                   01723000
AVTFTCHF EQU   AVTPKF                                                   01724000
@NM00008 EQU   AVTPKF                                                   01725000
@NM00007 EQU   AVTPKF                                                   01726000
@NM00006 EQU   AVTPKF                                                   01727000
@NM00005 EQU   AVTPKF                                                   01728000
AVTPARM  EQU   IEDQAVTD+336                                             01729000
AVTEXS2A EQU   IEDQAVTD+330                                             01730000
AVTEXA2S EQU   IEDQAVTD+324                                             01731000
AVTOCGET EQU   IEDQAVTD+320                                             01732000
AVTCKAVT EQU   @NM00003+1                                               01733000
@NM00004 EQU   AVTCKFLG                                                 01734000
AVTCKHLT EQU   AVTCKFLG                                                 01735000
AVTCKREQ EQU   AVTCKFLG                                                 01736000
AVTCKENV EQU   AVTCKFLG                                                 01737000
AVTCKNAC EQU   AVTCKFLG                                                 01738000
AVTCKTAC EQU   AVTCKFLG                                                 01739000
@NM00002 EQU   IEDQAVTD+312                                             01740000
AVTREADD EQU   IEDQAVTD+308                                             01741000
AVTREADY EQU   IEDQAVTD+304                                             01742000
AVTRACE  EQU   IEDQAVTD+300                                             01743000
AVTTCB   EQU   IEDQAVTD+296                                             01744000
AVTPASWD EQU   IEDQAVTD+288                                             01745000
AVTCTLCH EQU   IEDQAVTD+280                                             01746000
AVTDOUBL EQU   IEDQAVTD+272                                             01747000
AVTDOUBX EQU   IEDQAVTD+264                                             01748000
AVTDPARM EQU   IEDQAVTD+260                                             01749000
AVTCSTCS EQU   IEDQAVTD+256                                             01750000
AVTDLQ   EQU   AVTSAVEX+32                                              01751000
@NM00001 EQU   AVTSAVEX                                                 01752000
AVTSAVE4 EQU   IEDQAVTD+144                                             01753000
AVTSAVE3 EQU   IEDQAVTD+72                                              01754000
AVTSAVE2 EQU   IEDQAVTD                                                 01755000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01756000
@RF00290 EQU   @RC00279                                                 01757000
@RC00286 EQU   @RC00279                                                 01758000
@RF00305 EQU   @RC00302                                                 01759000
@RC00436 EQU   @EL00001                                                 01760000
@ENDDATA EQU   *                                                        01761000
         END   IGG019TE,(C'PLS2322',0701,77312)                         01762000
