         TITLE 'IGG0198D  -  3705 OPEN - LOAD 2                        *00001000
                        '                                               00002000
IGG0198D CSECT ,                                                   0001 00003000
@PROLOG  BALR  @03,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@03                                         0001 00006000
         B     MODSTRT                  SKIP IDS OF LOADED MODS         00007000
TTRGEN   EQU   *                                                        00008000
NENT     EQU   2                        NUMBER OF ENTRIES               00009000
LNTRCE   DC    CL2'Q0'                  LINE TRACE ID          @Y17XANL 00010000
CEAID    DC    CL2'TH'                  3705 CHANNEL END APPENDAGE ID   00011000
LRSID    DC    CL2'Q1'                  LOCAL RECEIVE SCHEDULER ID      00012000
AHRID    DC    CL2'R5'                  ATTENTION HANDLER ROUTINE ID    00013000
SCTID    DC    CL2'TM'                  ID FOR THE SPECIAL CHARS TABLE  00014000
WRTID    DC    CL2'TE'                  ID FOR 3705 WRITE SCHEDULER     00015000
FLDHID   DC    CL2'TI'                  ID FOR FIRST LEVEL DATA         00016000
*                                         HANDLER                       00017000
ENDIDS   EQU   *                        END OF IDS FOR LOAD             00018000
LENGTH   EQU   NENT*6+6                                                 00019000
NODBWDS  EQU   (LENGTH+7)/8                                             00020000
ORGIDTTR EQU   1024-NODBWDS*8                                           00021000
         ORG   IGG0198D+ORGIDTTR                                        00022000
LOAD4ID  DC    CL2'8E'                  ID FOR NEXT LOAD OF 3705 OPEN   00023000
         DC    XL4'0'                   TTR OF NXT LOAD                 00024000
OPENERP  DC    CL2'33'                  OPEN ERROR HANDLER ID           00025000
         DC    XL4'0'                   TTR OF OPEN ERROR HANDLER       00026000
IDEND    DC    X'0000'                                                  00027000
         CNOP  4,8                                                      00028000
LOAD19ID DC    C'019'                                                   00029000
         DC    YL1(X'80'-NODBWDS)       FLAG FOR IEHIOSUP               00030000
         ORG   ENDIDS                                                   00031000
IGG0198D IEDHJN ,HJN                    IDENTIFICATION MACRO   @Y17XANL 00032000
MODSTRT  EQU   *                                                        00033000
         L    RJ,4(RWTGC)               RESTORE ADDRESS OF REGISTER     00034000
*                                         SAVE AREA                     00035000
         LM    RLCB,RDEB,16(RJ)         RESTORE SAVED REGISTERS FROM    00036000
*                                         PREVIOUS LOAD OF OPEN         00037000
         L    RDCB,8(RJ)                RESTORE DCB ADDRESS             00038000
*   RJ=DEBLNGTH;                    /* LENGTH OF DEB           Y05330*/ 00039000
         SLR   RJ,RJ                                               0204 00040000
         IC    RJ,DEBLNGTH(,IEDQDPTR)                              0204 00041000
*   RE=RDEB;                        /* DEB ADDRESS FOR FIX     Y05330*/ 00042000
         LR    RE,RDEB                                             0205 00043000
*   CALL PAGEFIX;                   /* FIX DEB                 Y05330*/ 00044000
         BAL   @14,PAGEFIX                                         0206 00045000
*   RE=RDCB;                        /* DCB ADDRESS             Y05330*/ 00046000
         LR    RE,RDCB                                             0207 00047000
*   RJ=LENGTH(IHADCB);              /* DCBLENGTH               Y05330*/ 00048000
         LA    RJ,52                                               0208 00049000
*   CALL PAGEFIX1;                  /* FIX DCB                 Y05330*/ 00050000
         BAL   @14,PAGEFIX1                                        0209 00051000
*   RJ=DCBEIOBX;                    /* LCB LENGTH              Y05330*/ 00052000
         SLR   RJ,RJ                                               0210 00053000
         IC    RJ,DCBEIOBX(,RDCB)                                  0210 00054000
*   RE=RLCB;                        /* LCB ADDRESS             Y05330*/ 00055000
         LR    RE,RLCB                                             0211 00056000
*   CALL PAGEFIX1;                  /* FIX LCB                 Y05330*/ 00057000
         BAL   @14,PAGEFIX1                                        0212 00058000
*   RFY                                                            0213 00059000
*    (RE,                                                          0213 00060000
*     RJ) UNRSTD;                   /*                       @Y17XANL*/ 00061000
*                                                                  0214 00062000
*   /*****************************************************************/ 00063000
*   /*                                                               */ 00064000
*   /* INITIALIZE CHANNEL PROGRAM AREA OF LCB                @Y17XANL*/ 00065000
*   /*                                                               */ 00066000
*   /*****************************************************************/ 00067000
*                                                                  0214 00068000
*   LCBCPA(1:LENGTH(INITCCW1))=INITCCW1;/* MOVE CCW'S INTO THE LCB 0214 00069000
*                                                            @YM03703*/ 00070000
         MVC   LCBCPA(32,IEDQLPTR),INITCCW1                        0214 00071000
*   LCBCCW6(1:LENGTH(INITCCW2))=INITCCW2;/* REST OF CCWS     @ZM46810*/ 00072000
         MVC   LCBCCW6(16,IEDQLPTR),INITCCW2                       0215 00073000
*   LCBIOSBS=LCBIOSB;               /* SAVE IOSB FOR LATER RESTORE 0216 00074000
*                                                            @ZM46833*/ 00075000
         MVC   LCBIOSBS(3,IEDQLPTR),LCBIOSB(IEDQLPTR)              0216 00076000
*   WRTADDR=ADDR(WRTADDR)-1;        /* DUMMY DATA ADDRESS    @YM03703*/ 00077000
         LA    @12,WRTADDR(,IEDQLPTR)                              0217 00078000
         BCTR  @12,0                                               0217 00079000
         STCM  @12,7,WRTADDR(IEDQLPTR)                             0217 00080000
*   RDADDR=ADDR(RDADDR)-1;          /* DUMMY DATA ADDRESS    @YM03703*/ 00081000
         LA    @12,RDADDR(,IEDQLPTR)                               0218 00082000
         BCTR  @12,0                                               0218 00083000
         STCM  @12,7,RDADDR(IEDQLPTR)                              0218 00084000
*   NOP1ADDR=ADDR(NOP1ADDR)-1;      /* DUMMY DATA ADDRESS    @YM03703*/ 00085000
         LA    @12,NOP1ADDR(,IEDQLPTR)                             0219 00086000
         BCTR  @12,0                                               0219 00087000
         STCM  @12,7,NOP1ADDR(IEDQLPTR)                            0219 00088000
*   NOP2ADDR=ADDR(NOP2ADDR)-1;      /* DUMMY DATA ADDRESS    @YM03703*/ 00089000
         LA    @12,NOP2ADDR(,IEDQLPTR)                             0220 00090000
         BCTR  @12,0                                               0220 00091000
         STCM  @12,7,NOP2ADDR(IEDQLPTR)                            0220 00092000
*   LCBRDBFR=ADDR(LCBCCW7);         /* POINT START OF READ CHANNEL 0221 00093000
*                                      PROGRAM TO A NO-OP    @Y17XANL*/ 00094000
         LA    @12,LCBCCW7(,IEDQLPTR)                              0221 00095000
         STCM  @12,7,LCBRDBFR(IEDQLPTR)                            0221 00096000
*   LCBBFRAV=OFF;                   /* INDICATE NO BUFFERS AVAILABLE    00097000
*                                                            @Y17XANL*/ 00098000
         NI    LCBBFRAV(IEDQLPTR),B'11111101'                      0222 00099000
*   RESTRICT(RF);                   /* SO COMPILER WON'T USE R1      */ 00100000
*   RF=ADDR(AHRID);                 /* GET THE ADDR. OF THE ID AND 0224 00101000
*                                      TTR OF THE ATTENTION HANDLING    00102000
*                                      ROUTINE                       */ 00103000
         LA    RF,AHRID                                            0224 00104000
*   CALL LOADER;                    /* LOAD THE ATTENTION HANDLING 0225 00105000
*                                      ROUTINE                       */ 00106000
         BAL   @14,LOADER                                          0225 00107000
*   RFY                                                            0226 00108000
*     RJ RSTD;                      /*                       @Y17XANL*/ 00109000
*   TCXATTEN=RF;                    /* SAVE THE MODULE ADDR. IN THE     00110000
*                                      TCX                   @Y17XANL*/ 00111000
         L     @14,CVTPTR                                          0227 00112000
         L     @14,CVTAQAVT(,@14)                                  0227 00113000
         ST    RF,TCXATTEN(,@14)                                   0227 00114000
*   TCXATTLN=RJ;                    /* SAVE LENGTH           @Y17XANL*/ 00115000
         STC   RJ,TCXATTLN(,@14)                                   0228 00116000
*   CALL PAGEFIX;                   /* FIX ATTENTION HANDLING ROUTINE   00117000
*                                                            @Y17XANL*/ 00118000
         BAL   @14,PAGEFIX                                         0229 00119000
*   RFY                                                            0230 00120000
*     RJ UNRSTD;                    /*                       @Y17XANL*/ 00121000
*   CVTTCMFG=CVTTCMFG|LDEV;         /* INDICATE THAT A LOCAL DEVICE     00122000
*                                      IS ACTIVE             @Y17XANL*/ 00123000
         L     @12,CVTPTR                                          0231 00124000
         OI    CVTTCMFG(@12),X'40'                                 0231 00125000
*   UCBATI=20;                      /* SET ATTN TAB INDEX    @G36XRNB*/ 00126000
         L     @10,UCBPTR-1(,IEDQDPTR)                             0232 00127000
         L     @10,UCBEXTPT(,@10)                                  0232 00128000
         MVI   UCBATI(@10),X'14'                                   0232 00129000
*   ATBRTN=TCXATTEN;                /* SET ATTN RTN ADDR     @G36XRNB*/ 00130000
         L     @10,IOCOMPTR(,@12)                                  0233 00131000
         L     @10,IOCATTBL(,@10)                                  0233 00132000
         L     @12,CVTAQAVT(,@12)                                  0233 00133000
         L     @00,TCXATTEN(,@12)                                  0233 00134000
         ST    @00,ATBRTN(,@10)                                    0233 00135000
*   ATBASID=TCXASID;                /* SET ASID FOR ATTN RTN @G36XRNB*/ 00136000
         LH    @12,TCXASID(,@12)                                   0234 00137000
         STH   @12,ATBASID(,@10)                                   0234 00138000
         SPACE 5                                                        00139000
*   RF=ADDR(LRSID);                 /* GET THE ADDR. OF THE ID AND 0235 00140000
*                                      TTR FOR THE LOCAL RECEIVE   0235 00141000
*                                      SCHEDULER                     */ 00142000
         LA    RF,LRSID                                            0235 00143000
*   CALL LOADER;                    /* LOAD THE SCHEDULER            */ 00144000
         BAL   @14,LOADER                                          0236 00145000
*   AVT2260L=RF;                    /* SAVE THE MODULE ADDR. IN THE     00146000
*                                      AVT                           */ 00147000
         ST    RF,AVT2260L(,IEDQAPTR)                              0237 00148000
*   AVTQ1=RF+2;                     /* SAVE THE ADDR. PLUS 2 IN THE     00149000
*                                      AVT                           */ 00150000
         LA    @12,2                                               0238 00151000
         ALR   @12,RF                                              0238 00152000
         ST    @12,AVTQ1(,IEDQAPTR)                                0238 00153000
*   RF=ADDR(FLDHID);                /* GET ADDRESS OF ID AND TTR FOR    00154000
*                                      THE FIRST LEVEL DATA HANDLER  */ 00155000
         LA    RF,FLDHID                                           0239 00156000
*   CALL LOADER;                    /* LOAD FLDH                     */ 00157000
         BAL   @14,LOADER                                          0240 00158000
*   SAVTFLDH=RF;                    /* PUT QCB ADDRESS IN AVT        */ 00159000
         L     @12,AVTSAVTP(,IEDQAPTR)                             0241 00160000
         ST    RF,SAVTFLDH(,@12)                                   0241 00161000
         SPACE 3                                                        00162000
*   RF=ADDR(CEAID);                 /* GET ADDR. OF ID AND TTR FOR 0242 00163000
*                                      THE 3705 CHANNEL END APPENDAGE*/ 00164000
         LA    RF,CEAID                                            0242 00165000
*   CALL LOADER;                    /* LOAD THE APPENDAGE            */ 00166000
         BAL   @14,LOADER                                          0243 00167000
*   RFY                                                            0244 00168000
*     RJ RSTD;                      /*                       @Y17XANL*/ 00169000
*   RJ=RF->ZERO1;                   /* GET THE LENGTH OF APPENDAGE 0245 00170000
*                                      FROM THE 1ST WORD OF OF THE 0245 00171000
*                                      APPENDAGE             @Y17XANL*/ 00172000
         L     RJ,ZERO1(,RF)                                       0245 00173000
*   GEN;                                                           0246 00174000
         L     RF,FOUR(RF)              ADDRESS OF SIO APPENDAGE Y05330 00175000
         ST    RF,DEBSIOA(RDEB)         SAVE ADDRESS IN DEB      Y05330 00176000
*                                       SIO APG ENTERED FROM ERP Y05330 00177000
         LA    RF,EIGHT                 OFFSET TO CHANNEL END    Y05330 00178000
         AR    RF,RE                    ADDRESS OF CHANNEL END   Y05330 00179000
*   DEBCEA=RF;                      /* SAVE THE ADDRESS IN THE DEB 0247 00180000
*                                      APPENDAGE VECTOR TABLE        */ 00181000
         ST    RF,DEBCEA(,IEDQDPTR)                                0247 00182000
*   DEBXCEA=RF;                     /* SET ABNORMAL END APPENDAGE  0248 00183000
*                                      ADDRESS                       */ 00184000
         ST    RF,DEBXCEA(,IEDQDPTR)                               0248 00185000
*   IOSNRM=RF;                      /* NORMAL END APPENDAGE  @G36XRNB*/ 00186000
         L     @14,IOSBPTR-1(,IEDQLPTR)                            0249 00187000
         LA    @14,0(,@14)                                         0249 00188000
         ST    RF,IOSNRM(,@14)                                     0249 00189000
*   IOSABN=RF;                      /* ABNORMAL END APPENDAGE      0250 00190000
*                                                            @G36XRNB*/ 00191000
         ST    RF,IOSABN(,@14)                                     0250 00192000
*   IOSPCI=ADDR(CVTBRET);           /* PCI APPENDAGE         @G36XRNB*/ 00193000
         L     @12,CVTPTR                                          0251 00194000
         LA    @12,CVTBRET(,@12)                                   0251 00195000
         ST    @12,IOSPCI(,@14)                                    0251 00196000
*   IOSDIE=ADDR(CVTBRET);           /* DIE EXIT              @G36XRNB*/ 00197000
         ST    @12,IOSDIE(,@14)                                    0252 00198000
*   CALL PAGEFIX1;                  /* FIX THE APPENDAGE     @Y17XANL*/ 00199000
         BAL   @14,PAGEFIX1                                        0253 00200000
*   RFY                                                            0254 00201000
*     RE RSTD;                      /*                       @OX21215*/ 00202000
*   RE=SAVTTNTX;                    /* GET ADDRESS OF TTCIN TO     0255 00203000
*                                      NETWORK ADDRESS ROUTINE     0255 00204000
*                                                            @OX21215*/ 00205000
         L     @14,AVTSAVTP(,IEDQAPTR)                             0255 00206000
         L     RE,SAVTTNTX(,@14)                                   0255 00207000
*   RJ=RE->WORD1;                   /* GET LENGTH OF ROUTINE @OX21215*/ 00208000
         LR    @12,RE                                              0256 00209000
         L     RJ,WORD1(,@12)                                      0256 00210000
*   CALL PAGEFIX1;                  /* FIX CONVERT ROUTINE   @OX21215*/ 00211000
         BAL   @14,PAGEFIX1                                        0257 00212000
*   RFY                                                            0258 00213000
*     RJ UNRSTD;                    /*                       @Y17XANL*/ 00214000
*   RFY                                                            0259 00215000
*     RE UNRSTD;                    /*                       @OX21215*/ 00216000
*   RF=ADDR(WRTID);                 /* GET ADDRESS OF ID AND TTR FOR    00217000
*                                      THE 3705 WRITE SCHEDULER      */ 00218000
         LA    RF,WRTID                                            0260 00219000
*   CALL LOADER;                    /* LOAD THE WRITE SCHEDULER      */ 00220000
         BAL   @14,LOADER                                          0261 00221000
*   LCBWRSCH=RF;                    /* PUT STCB ADDRESS IN CORE QUEUE   00222000
*                                      QCB                           */ 00223000
         ST    RF,LCBWRSCH(,IEDQLPTR)                              0262 00224000
*   LCBRSLNK=RF;                    /* PUT STCB ADDRESS IN LCB     0263 00225000
*                                      SUBTASK CHAIN                 */ 00226000
         STCM  RF,7,LCBRSLNK(IEDQLPTR)                             0263 00227000
*   IF AVTRACE^=0 THEN              /* TRACE MUST BE SPECIFIED IN  0264 00228000
*                                      ORDER TO LOAD IGG019QO      0264 00229000
*                                                            @YM03712*/ 00230000
         SLR   @12,@12                                             0264 00231000
         C     @12,AVTRACE(,IEDQAPTR)                              0264 00232000
         BE    @RF00264                                            0264 00233000
*     DO;                           /*                       @YM03712*/ 00234000
*       IF AVTIOT=0 THEN            /* HAS TRACE ROUTINE BEEN LOADED    00235000
*                                                            @OZ30863*/ 00236000
         C     @12,AVTIOT(,IEDQAPTR)                               0266 00237000
         BNE   @RF00266                                            0266 00238000
*         DO;                       /*                       @OZ30863*/ 00239000
*           RF=ADDR(LNTRCE);        /* GET ADDR OF ID AND TTR FOR  0268 00240000
*                                      LINE TRACE            @Y17XANL*/ 00241000
         LA    RF,LNTRCE                                           0268 00242000
*           CALL LOADER;            /* LOAD LINE TRACE ROUTINE     0269 00243000
*                                                            @Y17XANL*/ 00244000
         BAL   @14,LOADER                                          0269 00245000
*           AVTIOT=RF;              /* SAVE LINE TRACE ADDRESS     0270 00246000
*                                                            @Y17XANL*/ 00247000
         ST    RF,AVTIOT(,IEDQAPTR)                                0270 00248000
*           GEN                                                    0271 00249000
*( STC  RJ,AVTIOT(,IEDQAPTR)    SAVE LENGTH OF Q0 @ZM47650);       0271 00250000
          STC  RJ,AVTIOT(,IEDQAPTR)    SAVE LENGTH OF Q0 @ZM47650       00251000
*           CALL PAGEFIX;           /* FIX LINE TRACE ROUTINE      0272 00252000
*                                                            @Y17XANL*/ 00253000
         BAL   @14,PAGEFIX                                         0272 00254000
*         END;                      /*                       @OZ30863*/ 00255000
*       ELSE                                                       0274 00256000
*         ;                         /* TRACE ALREADY LOADED  @OZ30863*/ 00257000
@RF00266 DS    0H                                                  0275 00258000
*     END;                          /*                       @YM03712*/ 00259000
         SPACE 3                                                        00260000
*   RF=ADDR(SCTID);                 /* GET ADDRESS OF ID AND TTR FOR    00261000
*                                      SPECIAL CHARACTERS TABLE      */ 00262000
@RF00264 LA    RF,SCTID                                            0276 00263000
*   CALL LOADER;                    /* LOAD THE SCT                  */ 00264000
         BAL   @14,LOADER                                          0277 00265000
*   DCBSCTAD=RF;                    /* PUT ADDRESS IN DCB            */ 00266000
         STCM  RF,7,DCBSCTAD(RDCB)                                 0278 00267000
*ENDLOAD1:                          /* EXIT CODING (SUPPLIED BY    0279 00268000
*                                      SYSTEM OPEN)                  */ 00269000
*   GEN;                                                           0279 00270000
ENDLOAD1 DS    0H                                                  0279 00271000
*                                         ATTRIBUTES                    00272000
         MVC   0(5,RWTGC),LOAD4ID       SET TO XCTL TO THIRD LOAD       00273000
         L     RJ,FOUR(RWTGC)           GET WORK AREA ADDRESS           00274000
         STM   0,15,0(RJ)               SAVE REGISTERS FOR NEXT LOAD    00275000
RELOOP   EQU   *                                                        00276000
         LA    RWTGC,EIGHT(RWTGC)       INCREMENT CURRENT WTG REG       00277000
         LA    RPARC,FOUR(RPARC)        INCREMENT CURRENT DCB REG       00278000
         CLC   0(2,RWTGC),AMIDCNST      IS THIS EXECUTOR NEEDED AGAIN   00279000
         BCR   8,3                      RETURN IF YES                   00280000
         CLC   0(2,RWTGC),OPIDCNST      TEST FOR END OF TABLE           00281000
         BNE   RELOOP                   NO, CHECK NEXT ENTRY            00282000
         LR    RPARC,RPAR               RESET DCB AND                   00283000
         LA    RWTGC,FIRSTID(RWTG)       WTG TABLE POINTERS             00284000
FIRSTID  EQU   32                       OFFSET TO FIRST WTG ENTRY       00285000
ZCHECK   EQU   *                                                        00286000
         CLI   0(RWTGC),0               IS THIS ENTRY ZERO              00287000
         BNE   XCTLRTNE                 NO, TRANSFER TO NEXT MODULE     00288000
         LA    RWTGC,EIGHT(RWTGC)       IF ZERO INCREMENT POINTERS      00289000
         LA    RPARC,FOUR(RPARC)         AND RETURN TO CHECK NEXT       00290000
         B     ZCHECK                    ENTRY                          00291000
XCTLRTNE EQU   *                                                        00292000
         LA    RJ,DXCCW12(RJ)           POINT TO DOUBLE WORD LIST       00293000
DXCCW12  EQU   X'1C8'                                                   00294000
         MVC   6(2,RWTG),0(RWTGC)       MOVE ID TO NAME FIELD           00295000
         MVC   14(3,RWTG),2(RWTGC)      MOVE TTR TO WTG FIELD           00296000
         XCTL  DE=(RWTG),SF=(E,(15))    XCTL TO NEXT LOAD               00297000
*WTGSETUP:                                                         0280 00298000
*   GEN;                                                           0280 00299000
WTGSETUP DS    0H                                                  0280 00300000
         L     RJ,FOUR(RWTGC)           GET WORK AREA ADDRESS           00301000
         STM   0,15,0(RJ)               SAVE REGISTERS FOR NEXT LOAD    00302000
DXCCW10  EQU   X'1B8'                                                   00303000
         XC    DXCCW10(4,RJ),DXCCW10(RJ) ZERO FOR ERROR LOAD            00304000
         MVC   AVTOPXCL(2,RAVT),AMIDCNST MOVE THE ID OF THE CURRENT     00305000
*                                        EXECUTOR INTO THE AVT FOR      00306000
*                                        RETURN TO THIS MODULE          00307000
         MVC   0(5,RWTGC),OPENERP       MOVE THE ID AND TTR OF THE      00308000
*                                        ERROR MODULE INTO THE          00309000
*                                        WHERE-TO-GO PARAMETER LIST     00310000
         B     XCTLRTNE                 GO TO TRANSFER CONTROL          00311000
AMIDCNST DC    CL2'8D'                  ID OF CURRENT LOAD              00312000
OPIDCNST DC    CL2'0S'                  ID OF SYSTEM LOAD               00313000
*ABEND23:                                                          0281 00314000
*   AVTOPERT=23;                    /* NO CORE FOR SQS AREA          */ 00315000
ABEND23  MVI   AVTOPERT(IEDQAPTR),X'17'                            0281 00316000
*   GOTO WTGSETUP;                  /* EXIT TO OPEN ERROR HANDLER    */ 00317000
         B     WTGSETUP                                            0282 00318000
*LOADER:                            /* LOADER SUBROUTINE             */ 00319000
*   RWTG->LOADID=RF->THISLOAD;      /* MOVE IN NAME OF MODULE TO BE     00320000
*                                      LOADED                        */ 00321000
LOADER   MVC   LOADID(2,RWTG),THISLOAD(RF)                         0283 00322000
*   GEN;                                                           0284 00323000
         SR    RJ,RJ                    CLEAR REGISTER FOR IC           00324000
         IC    RJ,DEBNMSUB(RDEB)        PICK UP NUMBER OF SUBROUTINES   00325000
*                                         ALREADY LOADED                00326000
         SLL   RJ,1                     MULTIPLY BY TWO                 00327000
         AR    RJ,RDEB                  ADD TO DEB BASE REGISTER        00328000
         SR    RE,RE                    CLEAR FOR INSERT        OY03305 00329000
         IC    RE,DEBAMLNG(RDEB)        GET SIZE OF ACCESS      OY03305 00330000
*                                       METHOD WORKAREA         OY03305 00331000
         AR    RJ,RE                    BUMP POINTER TO NAME    OY03305 00332000
*                                       FIELD                   OY03305 00333000
         IC    RE,DEBNMEXT(RDEB)        NUMBER OF EXTENTS      @YM08489 00334000
         SLL   RE,2                     FOUR BYTES PER UCB     @YM08489 00335000
         AR    RJ,RE                    BUMP TO NAME FIELD     @YM08489 00336000
         MVC   DEBUCBS(2,RJ),0(RF)      MOVE ID OF THIS MODULE BEING    00337000
*                                         LOADED INTO THE DEB SUB-      00338000
*                                         ROUTINE NAME FIELD   @YM08489 00339000
*   RF=CVTSVDCB;                    /* GET ADDRESS OF SVCLIB DCB     */ 00340000
         L     @12,CVTPTR                                          0285 00341000
         L     RF,CVTSVDCB(,@12)                                   0285 00342000
*   GEN;                                                           0286 00343000
         LOAD  EPLOC=(6),DCB=(1)        LOAD THE MODULE                 00344000
         SR    RJ,RJ                    CLEAR FOR INSERT                00345000
         IC    RJ,DEBNMSUB(RDEB)        COUNT OF LOADED MODULES         00346000
         LA    RJ,1(RJ)                 ADD ONE TO COUNT                00347000
         STC   RJ,DEBNMSUB(RDEB)        SET NEW COUNT                   00348000
         LR    RJ,RF                    SAVE MODULE LENGTH              00349000
         LR    RF,RE                    SAVE MODULE ADDRESS             00350000
*   RETURN;                         /* RETURN TO CALLING ROUTINE     */ 00351000
@EL00001 DS    0H                                                  0287 00352000
@EF00001 DS    0H                                                  0287 00353000
@ER00001 BR    @14                                                 0287 00354000
*PAGEFIX:                                                          0288 00355000
*   GEN(SLL   RJ,THREE                 CONVERT TO BYTE LENGTH );   0288 00356000
PAGEFIX  SLL   RJ,THREE                 CONVERT TO BYTE LENGTH          00357000
*PAGEFIX1:                                                         0289 00358000
*   GEN;                                                           0289 00359000
PAGEFIX1 DS    0H                                                  0289 00360000
         LR    RF,RE                    COPY ADDRESS TO FIX      Y05330 00361000
         AR    RF,RJ                    BUMP TO END ADDRESS      Y05330 00362000
         STM   RE,RF,AVTGETMN(RAVT)     STORE IN PARM LIST       Y05330 00363000
         MVI   AVTGETMN+FOUR(RAVT),ENDLIST SET END OF LIST       Y05330 00364000
         MVI   AVTGETMN(RAVT),FIXPG     SET FIX CODE             Y05330 00365000
         LA    RF,AVTGETMN(RAVT)        ADDRESS OF PARM LIST     Y05330 00366000
         LA    RE,AVTDMECB(RAVT)        ADDRESS OF FIX ECB       Y05330 00367000
         XC    AVTDMECB(FOUR,RAVT),AVTDMECB(RAVT) CLEAR ECB      Y05330 00368000
         ICM   RF,HI,FOUR(RF)           SET REG ONE PARM         Y05330 00369000
         SVC   PGFIX                    FIX DATA AREA            Y05330 00370000
         LA    RF,AVTDMECB(RAVT)        ECB ADDRESS            @G36XRNB 00371000
         WAIT  ECB=(1)                  WAIT FOR FIX             Y05330 00372000
         TM    AVTDMECB+THREE(RAVT),FOUR CHECK RETURN CODE       Y05330 00373000
         BNZ   ABEND23                  EXIT IF BAD              Y05330 00374000
RETURN   EQU   14                       RETURN REGISTER          Y05330 00375000
PGFIX    EQU   113                      SVC PAGE FIX             Y05330 00376000
HI       EQU   8                        ICM/STCM MASK            Y05330 00377000
FIXPG    EQU   X'52'                    ACTION CODE FOR PAGE FIX Y05330 00378000
ENDLIST  EQU   X'80'                    END OF PARM LIST         Y05330 00379000
THREE    EQU   3                        OFFSET OF THREE          Y05330 00380000
DEBIOVR  EQU   X'20'                    EXCPVR IS VALID          Y05330 00381000
DEBSIOX  EQU   X'40'                    ENTER SIO APG FROM ERP   Y05330 00382000
*   RETURN;                         /* RETURN TO CALLER      @Y17XANL*/ 00383000
         B     @EL00001                                            0290 00384000
         SPACE 5                                                        00385000
*   END IGG0198D                                                   0291 00386000
*                                                                  0291 00387000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00388000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00389000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 00390000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00391000
*/*%INCLUDE SYSLIB  (TCCWD   )                                       */ 00392000
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */ 00393000
*/*%INCLUDE SYSLIB  (TDEBD   )                                       */ 00394000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00395000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00396000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00397000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */ 00398000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00399000
*                                                                  0291 00400000
*       ;                                                          0291 00401000
         B     @EL00001                                            0291 00402000
@DATA    DS    0H                                                       00403000
         DS    0F                                                       00404000
         DS    0F                                                       00405000
         DS    0D                                                       00406000
INITCCW1 DS    CL32                                                     00407000
         ORG   INITCCW1                                                 00408000
WRTSTART DS    CL8                                                      00409000
         ORG   WRTSTART                                                 00410000
@NM00182 DC    X'31'                                                    00411000
@NM00183 DC    AL3(0)                                                   00412000
@NM00184 DC    X'60'                                                    00413000
@NM00185 DC    AL1(0)                                                   00414000
@NM00186 DC    AL2(1)                                                   00415000
         ORG   INITCCW1+8                                               00416000
TIC1     DS    CL8                                                      00417000
         ORG   TIC1                                                     00418000
@NM00187 DC    X'08'                                                    00419000
@NM00188 DC    XL7'0'                                                   00420000
         ORG   INITCCW1+16                                              00421000
RDSTART  DS    CL8                                                      00422000
         ORG   RDSTART                                                  00423000
@NM00189 DC    X'32'                                                    00424000
@NM00190 DC    AL3(0)                                                   00425000
@NM00191 DC    X'60'                                                    00426000
@NM00192 DC    AL1(0)                                                   00427000
@NM00193 DC    AL2(1)                                                   00428000
         ORG   INITCCW1+24                                              00429000
TIC2     DS    CL8                                                      00430000
         ORG   TIC2                                                     00431000
@NM00194 DC    X'08'                                                    00432000
@NM00195 DC    XL7'0'                                                   00433000
         ORG   INITCCW1+32                                              00434000
INITCCW2 DS    CL16                                                     00435000
         ORG   INITCCW2                                                 00436000
NOP1     DS    CL8                                                      00437000
         ORG   NOP1                                                     00438000
@NM00196 DC    X'03'                                                    00439000
@NM00197 DC    AL3(0)                                                   00440000
@NM00198 DC    AL2(0)                                                   00441000
@NM00199 DC    AL2(1)                                                   00442000
         ORG   INITCCW2+8                                               00443000
NOP2     DS    CL8                                                      00444000
         ORG   NOP2                                                     00445000
@NM00200 DC    X'03'                                                    00446000
@NM00201 DC    AL3(0)                                                   00447000
@NM00202 DC    AL2(0)                                                   00448000
@NM00203 DC    AL2(1)                                                   00449000
         ORG   INITCCW2+16                                              00450000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00451000
@01      EQU   01                                                       00452000
@02      EQU   02                                                       00453000
@03      EQU   03                                                       00454000
@04      EQU   04                                                       00455000
@05      EQU   05                                                       00456000
@06      EQU   06                                                       00457000
@07      EQU   07                                                       00458000
@08      EQU   08                                                       00459000
@09      EQU   09                                                       00460000
@10      EQU   10                                                       00461000
@11      EQU   11                                                       00462000
@12      EQU   12                                                       00463000
@13      EQU   13                                                       00464000
@14      EQU   14                                                       00465000
@15      EQU   15                                                       00466000
@0       EQU   00                                                       00467000
@1       EQU   01                                                       00468000
@2       EQU   02                                                       00469000
@3       EQU   03                                                       00470000
@4       EQU   04                                                       00471000
@5       EQU   05                                                       00472000
@6       EQU   06                                                       00473000
@7       EQU   07                                                       00474000
@8       EQU   08                                                       00475000
@9       EQU   09                                                       00476000
@A       EQU   10                                                       00477000
@B       EQU   11                                                       00478000
@C       EQU   12                                                       00479000
@D       EQU   13                                                       00480000
@E       EQU   14                                                       00481000
@F       EQU   15                                                       00482000
RE       EQU   @00                                                      00483000
RF       EQU   @01                                                      00484000
RDCB     EQU   @02                                                      00485000
DCBPTR   EQU   @02                                                      00486000
RLCB     EQU   @04                                                      00487000
RCORE    EQU   @04                                                      00488000
IEDQLPTR EQU   @04                                                      00489000
RPAR     EQU   @05                                                      00490000
RWTG     EQU   @06                                                      00491000
RPARC    EQU   @07                                                      00492000
RWTGC    EQU   @08                                                      00493000
RAVT     EQU   @09                                                      00494000
IEDQAPTR EQU   @09                                                      00495000
RDEB     EQU   @11                                                      00496000
IEDQDPTR EQU   @11                                                      00497000
RJ       EQU   @15                                                      00498000
TCXPTR   EQU   @15                                                      00499000
LCBXPTR  EQU   @05                                                      00500000
RUCB     EQU   @12                                                      00501000
CVTPTR   EQU   16                                                       00502000
IEDQAVTD EQU   0                                                        00503000
AVTSAVEX EQU   IEDQAVTD+288                                             00504000
AVTRACE  EQU   IEDQAVTD+372                                             00505000
AVTREADD EQU   IEDQAVTD+380                                             00506000
AVTBUFSW EQU   IEDQAVTD+384                                             00507000
@NM00004 EQU   IEDQAVTD+388                                             00508000
AVTCKFLG EQU   @NM00004                                                 00509000
AVTBASE  EQU   IEDQAVTD+412                                             00510000
AVTPKF   EQU   AVTBASE                                                  00511000
AVTOSECB EQU   IEDQAVTD+492                                             00512000
AVTECB1  EQU   AVTOSECB                                                 00513000
AVTHG02  EQU   IEDQAVTD+528                                             00514000
AVTDISP  EQU   IEDQAVTD+552                                             00515000
AVTHD    EQU   IEDQAVTD+556                                             00516000
AVTSCOPT EQU   AVTHD                                                    00517000
AVTQ1    EQU   IEDQAVTD+588                                             00518000
AVTSAVTP EQU   IEDQAVTD+612                                             00519000
AVTSAVTF EQU   AVTSAVTP                                                 00520000
AVTIOT   EQU   IEDQAVTD+640                                             00521000
AVTCKPEL EQU   IEDQAVTD+652                                             00522000
AVTCKRMV EQU   AVTCKPEL                                                 00523000
AVTCKELF EQU   IEDQAVTD+680                                             00524000
AVTOPERT EQU   IEDQAVTD+690                                             00525000
AVTCKBYT EQU   IEDQAVTD+691                                             00526000
AVTHG01  EQU   IEDQAVTD+692                                             00527000
AVTCKLNK EQU   IEDQAVTD+696                                             00528000
AVTCRELE EQU   IEDQAVTD+708                                             00529000
AVTCCELE EQU   AVTCRELE                                                 00530000
AVTCLRHI EQU   IEDQAVTD+716                                             00531000
AVTADBUF EQU   IEDQAVTD+720                                             00532000
AVT2260L EQU   IEDQAVTD+724                                             00533000
AVTSYSER EQU   IEDQAVTD+728                                             00534000
AVTBFRFG EQU   IEDQAVTD+784                                             00535000
AVTCKPQB EQU   IEDQAVTD+804                                             00536000
AVTCKPTB EQU   AVTCKPQB                                                 00537000
AVTCKPEC EQU   AVTCKPQB+4                                               00538000
AVTCKPCC EQU   AVTCKPEC                                                 00539000
AVTOPCQB EQU   IEDQAVTD+816                                             00540000
AVTOPCOB EQU   AVTOPCQB                                                 00541000
AVTOPCEC EQU   AVTOPCQB+4                                               00542000
AVTOPCCC EQU   AVTOPCEC                                                 00543000
AVTOLTQB EQU   IEDQAVTD+828                                             00544000
AVTCWFL1 EQU   IEDQAVTD+924                                             00545000
AVTCWFL2 EQU   IEDQAVTD+925                                             00546000
AVTSUBT  EQU   IEDQAVTD+948                                             00547000
AVTIOTR  EQU   IEDQAVTD+949                                             00548000
AVTBIT1  EQU   IEDQAVTD+1050                                            00549000
AVTBIT2  EQU   IEDQAVTD+1051                                            00550000
AVTBIT3  EQU   IEDQAVTD+1052                                            00551000
AVTBIT4  EQU   IEDQAVTD+1136                                            00552000
@NM00086 EQU   IEDQAVTD+1232                                            00553000
IEDNSVTD EQU   0                                                        00554000
SAVTDIAG EQU   IEDNSVTD                                                 00555000
SAVTDIAF EQU   SAVTDIAG                                                 00556000
SAVTFLDH EQU   IEDNSVTD+52                                              00557000
SAVTLUSQ EQU   IEDNSVTD+88                                              00558000
SAVTTCPU EQU   IEDNSVTD+238                                             00559000
SAVTTNTX EQU   IEDNSVTD+252                                             00560000
SAVTZELM EQU   IEDNSVTD+270                                             00561000
SAVTRDRV EQU   IEDNSVTD+284                                             00562000
SAVTCKQB EQU   IEDNSVTD+300                                             00563000
SAVTCKTB EQU   SAVTCKQB                                                 00564000
SAVTCKEC EQU   SAVTCKQB+4                                               00565000
SAVTCKCC EQU   SAVTCKEC                                                 00566000
IEDQLCB  EQU   0                                                        00567000
LCBRCB   EQU   IEDQLCB                                                  00568000
LCBRSLNK EQU   IEDQLCB+13                                               00569000
LCBTSOB  EQU   IEDQLCB+19                                               00570000
LCBCHAIN EQU   IEDQLCB+20                                               00571000
LCBSCRNN EQU   LCBCHAIN                                                 00572000
LCBTETEN EQU   LCBCHAIN                                                 00573000
LCBINSRC EQU   IEDQLCB+21                                               00574000
LCBLKMDE EQU   LCBINSRC+2                                               00575000
LCBNTXT  EQU   IEDQLCB+24                                               00576000
LCBSTAT4 EQU   LCBNTXT                                                  00577000
LCBPHASE EQU   LCBSTAT4                                                 00578000
LCBSCBDA EQU   IEDQLCB+25                                               00579000
LCBMHA   EQU   IEDQLCB+29                                               00580000
LCBFLAG1 EQU   IEDQLCB+32                                               00581000
LCBIOBSN EQU   IEDQLCB+33                                               00582000
LCBSNS   EQU   LCBIOBSN+1                                               00583000
LCBSENS0 EQU   LCBSNS                                                   00584000
LCBLOSDT EQU   LCBSENS0                                                 00585000
LCBTMOUT EQU   LCBSENS0                                                 00586000
LCBFLAG3 EQU   LCBIOBSN+7                                               00587000
LCBCSW   EQU   LCBIOBSN+8                                               00588000
LCBCSWST EQU   LCBCSW+3                                                 00589000
LCBCSWUS EQU   LCBCSWST                                                 00590000
LCBCSWCS EQU   LCBCSWST+1                                               00591000
LCBSIOCC EQU   LCBIOBSN+15                                              00592000
LCBDCBPT EQU   IEDQLCB+52                                               00593000
LCBRCQCB EQU   IEDQLCB+56                                               00594000
LCBRESTR EQU   LCBRCQCB                                                 00595000
LCBTHSQ  EQU   IEDQLCB+60                                               00596000
LCBINCAM EQU   LCBTHSQ                                                  00597000
LCBERRCT EQU   IEDQLCB+62                                               00598000
LCBLSPCI EQU   IEDQLCB+65                                               00599000
LCBRCBFR EQU   LCBLSPCI                                                 00600000
LCBRDBFR EQU   LCBRCBFR                                                 00601000
LCBSTATE EQU   IEDQLCB+70                                               00602000
LCBSTAT1 EQU   LCBSTATE                                                 00603000
LCBSTAT2 EQU   LCBSTATE+1                                               00604000
LCBBEOTN EQU   LCBSTAT2                                                 00605000
LCBSYNC  EQU   LCBSTAT2                                                 00606000
LCBDIAL  EQU   LCBSTAT2                                                 00607000
LCBBFRAV EQU   LCBDIAL                                                  00608000
LCBTSTSW EQU   IEDQLCB+72                                               00609000
LCBERB   EQU   IEDQLCB+76                                               00610000
LCBERBST EQU   IEDQLCB+84                                               00611000
LCBDLNKN EQU   LCBERBST                                                 00612000
LCBERBCT EQU   IEDQLCB+88                                               00613000
LCBRBCT2 EQU   LCBERBCT+1                                               00614000
LCBMSGFM EQU   IEDQLCB+92                                               00615000
LCBOBRCH EQU   IEDQLCB+96                                               00616000
LCBINVPT EQU   LCBOBRCH+1                                               00617000
LCBBFRW  EQU   LCBINVPT                                                 00618000
LCBTPCD  EQU   IEDQLCB+100                                              00619000
LCBSTAT5 EQU   LCBTPCD                                                  00620000
LCBSTAT6 EQU   LCBTPCD+4                                                00621000
LCBRSPSV EQU   LCBTPCD+8                                                00622000
LCBSAVSN EQU   IEDQLCB+112                                              00623000
LCBERCCW EQU   IEDQLCB+120                                              00624000
LCBCPA   EQU   IEDQLCB+144                                              00625000
LCBCCW1  EQU   LCBCPA                                                   00626000
LCBCCW3  EQU   LCBCPA+16                                                00627000
LCBCCW5  EQU   LCBCPA+32                                                00628000
LCBATTEL EQU   LCBCCW5                                                  00629000
LCBQEBPL EQU   LCBATTEL                                                 00630000
LCBIOSB  EQU   LCBQEBPL+1                                               00631000
LCBCCW6  EQU   LCBCPA+40                                                00632000
LCBCCW7  EQU   LCBCPA+48                                                00633000
IEDQLCBX EQU   0                                                        00634000
LCBXCON  EQU   IEDQLCBX                                                 00635000
LCBXFLAG EQU   LCBXCON                                                  00636000
LCBXDCT  EQU   LCBXCON+1                                                00637000
LCBXRADR EQU   LCBXCON+4                                                00638000
CVTMAP   EQU   0                                                        00639000
CVTDAR   EQU   CVTMAP+72                                                00640000
CVTFLGS1 EQU   CVTDAR                                                   00641000
CVTBRET  EQU   CVTMAP+82                                                00642000
CVTSVDCB EQU   CVTMAP+84                                                00643000
CVTDCB   EQU   CVTMAP+116                                               00644000
CVTIXAVL EQU   CVTMAP+124                                               00645000
CVTIERLC EQU   CVTMAP+144                                               00646000
CVTOPTA  EQU   CVTMAP+182                                               00647000
CVTOPTB  EQU   CVTMAP+183                                               00648000
CVTGTF   EQU   CVTMAP+236                                               00649000
CVTGTFST EQU   CVTGTF                                                   00650000
CVTGTFS  EQU   CVTGTFST                                                 00651000
CVTSTATE EQU   CVTGTFST                                                 00652000
CVTTMODE EQU   CVTGTFST                                                 00653000
CVTFORM  EQU   CVTGTFST                                                 00654000
CVTAQAVT EQU   CVTMAP+240                                               00655000
CVTTCMFG EQU   CVTAQAVT                                                 00656000
CVTVOLM2 EQU   CVTMAP+244                                               00657000
CVTTATA  EQU   CVTVOLM2                                                 00658000
CVTTSKS  EQU   CVTTATA                                                  00659000
CVTVOLF2 EQU   CVTTSKS                                                  00660000
CVTTAT   EQU   CVTTATA+1                                                00661000
CVTATER  EQU   CVTMAP+248                                               00662000
CVTEXT1  EQU   CVTMAP+252                                               00663000
CVTPURG  EQU   CVTMAP+260                                               00664000
CVTQMSG  EQU   CVTMAP+268                                               00665000
CVTDMSR  EQU   CVTMAP+272                                               00666000
CVTRSV37 EQU   CVTDMSR                                                  00667000
CVTDMSRF EQU   CVTRSV37                                                 00668000
CVTERPV  EQU   CVTMAP+316                                               00669000
CVTINTLA EQU   CVTMAP+320                                               00670000
CVTAPF   EQU   CVTMAP+324                                               00671000
CVTEXT2  EQU   CVTMAP+328                                               00672000
CVTHJES  EQU   CVTMAP+332                                               00673000
CVTPGSIA EQU   CVTMAP+348                                               00674000
CVTA1F1  EQU   CVTMAP+356                                               00675000
CVTSYSK  EQU   CVTMAP+357                                               00676000
CVTVOLM1 EQU   CVTMAP+380                                               00677000
CVTVOLF1 EQU   CVTVOLM1                                                 00678000
CVTATMCT EQU   CVTMAP+388                                               00679000
CVTXTNT1 EQU   0                                                        00680000
CVTXTNT2 EQU   0                                                        00681000
CVTDSSV  EQU   CVTXTNT2                                                 00682000
CVTFLGBT EQU   CVTXTNT2+5                                               00683000
CVTQID   EQU   CVTXTNT2+24                                              00684000
CVTSHS   EQU   CVTXTNT2+40                                              00685000
CVTRV400 EQU   CVTXTNT2+52                                              00686000
CVTRV409 EQU   CVTXTNT2+53                                              00687000
CVTATCVT EQU   CVTXTNT2+64                                              00688000
CVTRV429 EQU   CVTXTNT2+84                                              00689000
CVTRV438 EQU   CVTXTNT2+85                                              00690000
CVTRV457 EQU   CVTXTNT2+112                                             00691000
CVTRV466 EQU   CVTXTNT2+113                                             00692000
CVTFIX   EQU   -256                                                     00693000
CVTRELNO EQU   CVTFIX+252                                               00694000
IEDQCCW  EQU   0                                                        00695000
CCW      EQU   IEDQCCW                                                  00696000
CCWFLAGS EQU   CCW+4                                                    00697000
IEDQTCXD EQU   0                                                        00698000
TCXATTEN EQU   IEDQTCXD+4                                               00699000
TCXATTLN EQU   TCXATTEN                                                 00700000
TCXASID  EQU   IEDQTCXD+32                                              00701000
TCXFLAG1 EQU   IEDQTCXD+34                                              00702000
TCXBUFA  EQU   IEDQTCXD+80                                              00703000
TCXDSAVE EQU   IEDQTCXD+104                                             00704000
TCXQE8   EQU   IEDQTCXD+216                                             00705000
IEDQDEB  EQU   0                                                        00706000
DEBPRF   EQU   IEDQDEB                                                  00707000
DEBAPVT  EQU   DEBPRF                                                   00708000
DEBCEA   EQU   DEBAPVT+12                                               00709000
DEBXCEA  EQU   DEBAPVT+16                                               00710000
DEBLNGTH EQU   DEBPRF+32                                                00711000
DEBNMEXT EQU   IEDQDEB+52                                               00712000
DEBUCBS  EQU   IEDQDEB+68                                               00713000
IHADCB   EQU   0                                                        00714000
UCB      EQU   -512                                                     00715000
UCBOB    EQU   0                                                        00716000
UCBJBNR  EQU   UCBOB                                                    00717000
UCBFL5   EQU   UCBOB+1                                                  00718000
UCBAF    EQU   UCBFL5                                                   00719000
UCBSTAT  EQU   UCBOB+3                                                  00720000
UCBCHAN  EQU   UCBOB+4                                                  00721000
UCBSFLS  EQU   UCBOB+6                                                  00722000
UCBFLA   EQU   UCBSFLS                                                  00723000
UCBFL1   EQU   UCBFLA                                                   00724000
UCBBSY   EQU   UCBFL1                                                   00725000
UCBNRY   EQU   UCBFL1                                                   00726000
UCBPST   EQU   UCBFL1                                                   00727000
UCBCUB   EQU   UCBFL1                                                   00728000
UCBFLB   EQU   UCBSFLS+1                                                00729000
UCBCHM   EQU   UCBOB+8                                                  00730000
UCBCHM1  EQU   UCBCHM                                                   00731000
UCBPTH0  EQU   UCBCHM1                                                  00732000
UCBPTH1  EQU   UCBCHM1                                                  00733000
UCBWGT   EQU   UCBOB+12                                                 00734000
UCBTYP   EQU   UCBOB+16                                                 00735000
UCBTBYT1 EQU   UCBTYP                                                   00736000
UCB1FEA5 EQU   UCBTBYT1                                                 00737000
UCB1FEA6 EQU   UCBTBYT1                                                 00738000
UCBTBYT2 EQU   UCBTYP+1                                                 00739000
UCB2OPT2 EQU   UCBTBYT2                                                 00740000
UCBDUDN1 EQU   UCB2OPT2                                                 00741000
UCB2OPT3 EQU   UCBTBYT2                                                 00742000
UCBDUDN2 EQU   UCB2OPT3                                                 00743000
UCB2OPT4 EQU   UCBTBYT2                                                 00744000
UCBRWTAU EQU   UCB2OPT4                                                 00745000
UCB2OPT6 EQU   UCBTBYT2                                                 00746000
UCB2OPT7 EQU   UCBTBYT2                                                 00747000
UCBTBYT3 EQU   UCBTYP+2                                                 00748000
UCBDVCLS EQU   UCBTBYT3                                                 00749000
UCBTBYT4 EQU   UCBTYP+3                                                 00750000
UCBEXTPT EQU   UCBOB+20                                                 00751000
UCBFLC   EQU   UCBEXTPT                                                 00752000
UCBDEV   EQU   UCBOB+24                                                 00753000
UCBCMEXT EQU   0                                                        00754000
UCBATI   EQU   UCBCMEXT+3                                               00755000
@NM00165 EQU   UCBATI                                                   00756000
UCBFLP1  EQU   UCBCMEXT+5                                               00757000
UCBMT    EQU   0                                                        00758000
UCBOCR   EQU   0                                                        00759000
UCB3540X EQU   0                                                        00760000
UCBDKBYT EQU   UCB3540X+6                                               00761000
UCB3800X EQU   0                                                        00762000
UCBOPTNS EQU   UCB3800X                                                 00763000
UCBACTIV EQU   UCB3800X+3                                               00764000
UCBMDRBF EQU   UCB3800X+36                                              00765000
UCBUCS   EQU   0                                                        00766000
UCBUCSOP EQU   UCBUCS+4                                                 00767000
UCBFCBOP EQU   UCBUCS+5                                                 00768000
IOCOM    EQU   0                                                        00769000
IOCATTBL EQU   IOCOM+68                                                 00770000
IOSB     EQU   0                                                        00771000
IOSFLA   EQU   IOSB                                                     00772000
IOSACHN  EQU   IOSFLA                                                   00773000
IOSFLB   EQU   IOSB+1                                                   00774000
IOSFLC   EQU   IOSB+2                                                   00775000
IOSDVALT EQU   IOSFLC                                                   00776000
IOSPKEY  EQU   IOSB+12                                                  00777000
IOSOPT   EQU   IOSB+14                                                  00778000
IOSOPT2  EQU   IOSB+15                                                  00779000
@NM00169 EQU   IOSB+20                                                  00780000
IOSCSW   EQU   @NM00169+1                                               00781000
IOSTATUS EQU   IOSCSW+3                                                 00782000
IOSIPIB  EQU   IOSB+44                                                  00783000
IOSPCI   EQU   IOSB+56                                                  00784000
IOSNRM   EQU   IOSB+60                                                  00785000
IOSABN   EQU   IOSB+64                                                  00786000
IOSDIE   EQU   IOSB+68                                                  00787000
IOSPATH  EQU   IOSB+86                                                  00788000
IOSCHN   EQU   IOSPATH                                                  00789000
IOSCKEY  EQU   IOSB+89                                                  00790000
IOSEEKA  EQU   IOSB+100                                                 00791000
IOSCCHH  EQU   IOSEEKA+3                                                00792000
IOSSKHH  EQU   IOSCCHH+2                                                00793000
ATBFLA   EQU   40                                                       00794000
ATBASID  EQU   ATBFLA+2                                                 00795000
ATBRTN   EQU   ATBFLA+4                                                 00796000
SDSECT   EQU   0                                                        00797000
ZERO1    EQU   SDSECT                                                   00798000
FOUR     EQU   SDSECT+4                                                 00799000
@NM00176 EQU   0                                                        00800000
IQE      EQU   @NM00176+64                                              00801000
LOADSECT EQU   0                                                        00802000
THISLOAD EQU   LOADSECT                                                 00803000
DSECT    EQU   0                                                        00804000
WORD0    EQU   DSECT                                                    00805000
WORD1    EQU   DSECT+4                                                  00806000
WTGDSECT EQU   0                                                        00807000
LOADID   EQU   WTGDSECT+6                                               00808000
DEBSUBR  EQU   0                                                        00809000
UCBBGN   EQU   -512                                                     00810000
LCBRSPIN EQU   LCBIOBSN                                                 00811000
LCBLUSNS EQU   LCBRSPIN+5                                               00812000
LCBSCPRS EQU   LCBRSPIN+9                                               00813000
LCBCSWU1 EQU   LCBSCPRS+2                                               00814000
LCBRSPFG EQU   LCBRSPIN+15                                              00815000
LCBCOREQ EQU   LCBTPCD                                                  00816000
LCBWRSCH EQU   LCBCOREQ+8                                               00817000
@NM00133 EQU   LCBCPA+40                                                00818000
LCBQNX   EQU   LCBERCCW                                                 00819000
LCBQNXMN EQU   LCBQNX                                                   00820000
LCBIOSBS EQU   LCBQNX+5                                                 00821000
LCBCANCL EQU   LCBSAVSN                                                 00822000
LCBCANFG EQU   LCBCANCL                                                 00823000
CVTS01   EQU   CVTPGSIA                                                 00824000
CVTLPDIA EQU   CVTS01+12                                                00825000
CVTDIRST EQU   CVTLPDIA                                                 00826000
CVTSLIDA EQU   CVTS01+24                                                00827000
CVTCTLFG EQU   CVTS01+50                                                00828000
CVTRV210 EQU   CVTS01+424                                               00829000
CVTRV219 EQU   CVTS01+425                                               00830000
CVTRV228 EQU   CVTS01+426                                               00831000
CVTRV237 EQU   CVTS01+427                                               00832000
CVTMFRTR EQU   CVTS01+452                                               00833000
CVTRV262 EQU   CVTS01+468                                               00834000
CVTRV271 EQU   CVTS01+469                                               00835000
CVTRV280 EQU   CVTS01+470                                               00836000
CVTRV289 EQU   CVTS01+471                                               00837000
CVTGSDA  EQU   CVTS01+600                                               00838000
DEBUCB   EQU   DEBUCBS                                                  00839000
DEBDVMOD EQU   DEBUCB                                                   00840000
DEBUCBAD EQU   DEBUCB+1                                                 00841000
IHADCS1A EQU   IHADCB+8                                                 00842000
DCBBCKUP EQU   IHADCS1A+8                                               00843000
IHADCS2K EQU   IHADCB+20                                                00844000
DCBDUMPD EQU   IHADCS2K                                                 00845000
DCBTRSTA EQU   IHADCS2K+5                                               00846000
DCBDSORG EQU   IHADCS2K+6                                               00847000
DCBDSRG2 EQU   DCBDSORG+1                                               00848000
DCBRNCKD EQU   IHADCS2K+12                                              00849000
DCBEXLST EQU   IHADCS2K+16                                              00850000
DCBEIOBX EQU   DCBEXLST                                                 00851000
IHADCS24 EQU   IHADCB+40                                                00852000
DCBOFLGS EQU   IHADCS24+8                                               00853000
DCBOFLWR EQU   DCBOFLGS                                                 00854000
DCBIFLG  EQU   IHADCS24+9                                               00855000
DCBIBPCT EQU   DCBIFLG                                                  00856000
DCBMACR  EQU   IHADCS24+10                                              00857000
DCBMACR1 EQU   DCBMACR                                                  00858000
DCBMRFE  EQU   DCBMACR1                                                 00859000
DCBMRGET EQU   DCBMRFE                                                  00860000
DCBMRAPG EQU   DCBMACR1                                                 00861000
DCBMRRD  EQU   DCBMRAPG                                                 00862000
DCBMRCI  EQU   DCBMACR1                                                 00863000
DCBMRMVG EQU   DCBMRCI                                                  00864000
DCBMRLCG EQU   DCBMACR1                                                 00865000
DCBMRABC EQU   DCBMACR1                                                 00866000
DCBMRPT1 EQU   DCBMRABC                                                 00867000
DCBMRSBG EQU   DCBMRPT1                                                 00868000
DCBMRCRL EQU   DCBMACR1                                                 00869000
DCBMRCHK EQU   DCBMRCRL                                                 00870000
DCBMRRDX EQU   DCBMRCHK                                                 00871000
DCBMRDMG EQU   DCBMACR1                                                 00872000
DCBMACR2 EQU   DCBMACR+1                                                00873000
DCBMRPUT EQU   DCBMACR2                                                 00874000
DCBMRWRT EQU   DCBMACR2                                                 00875000
DCBMRMVP EQU   DCBMACR2                                                 00876000
DCBMR5WD EQU   DCBMACR2                                                 00877000
DCBMRLDM EQU   DCBMR5WD                                                 00878000
DCBMRLCP EQU   DCBMRLDM                                                 00879000
DCBMR4WD EQU   DCBMACR2                                                 00880000
DCBMRPT2 EQU   DCBMR4WD                                                 00881000
DCBMRTMD EQU   DCBMRPT2                                                 00882000
DCBMR3WD EQU   DCBMACR2                                                 00883000
DCBMRCTL EQU   DCBMR3WD                                                 00884000
DCBMRSTK EQU   DCBMRCTL                                                 00885000
DCBMR1WD EQU   DCBMACR2                                                 00886000
DCBMRSWA EQU   DCBMR1WD                                                 00887000
DCBMRDMD EQU   DCBMRSWA                                                 00888000
IHADCS25 EQU   IHADCB+40                                                00889000
DCBMACRF EQU   IHADCS25+2                                               00890000
DCBMACF1 EQU   DCBMACRF                                                 00891000
DCBMFFE  EQU   DCBMACF1                                                 00892000
DCBMFGET EQU   DCBMFFE                                                  00893000
DCBMFAPG EQU   DCBMACF1                                                 00894000
DCBMFRD  EQU   DCBMFAPG                                                 00895000
DCBMFCI  EQU   DCBMACF1                                                 00896000
DCBMFMVG EQU   DCBMFCI                                                  00897000
DCBMFLCG EQU   DCBMACF1                                                 00898000
DCBMFABC EQU   DCBMACF1                                                 00899000
DCBMFPT1 EQU   DCBMFABC                                                 00900000
DCBMFSBG EQU   DCBMFPT1                                                 00901000
DCBMFCRL EQU   DCBMACF1                                                 00902000
DCBMFCHK EQU   DCBMFCRL                                                 00903000
DCBMFDMG EQU   DCBMACF1                                                 00904000
DCBMACF2 EQU   DCBMACRF+1                                               00905000
DCBMFPUT EQU   DCBMACF2                                                 00906000
DCBMFWRT EQU   DCBMACF2                                                 00907000
DCBMFMVP EQU   DCBMACF2                                                 00908000
DCBMF5WD EQU   DCBMACF2                                                 00909000
DCBMFLDM EQU   DCBMF5WD                                                 00910000
DCBMFLCP EQU   DCBMFLDM                                                 00911000
DCBMF4WD EQU   DCBMACF2                                                 00912000
DCBMFPT2 EQU   DCBMF4WD                                                 00913000
DCBMFTMD EQU   DCBMFPT2                                                 00914000
DCBMF3WD EQU   DCBMACF2                                                 00915000
DCBMFCTL EQU   DCBMF3WD                                                 00916000
DCBMFSTK EQU   DCBMFCTL                                                 00917000
DCBMF1WD EQU   DCBMACF2                                                 00918000
DCBMFSWA EQU   DCBMF1WD                                                 00919000
DCBMFDMD EQU   DCBMFSWA                                                 00920000
DCBDEBAD EQU   IHADCS25+4                                               00921000
DCBIFLGS EQU   DCBDEBAD                                                 00922000
DCBIFPCT EQU   DCBIFLGS                                                 00923000
IHADCS27 EQU   IHADCB+48                                                00924000
DCBGET   EQU   IHADCS27                                                 00925000
DCBPUT   EQU   DCBGET                                                   00926000
DCBGETA  EQU   DCBPUT+1                                                 00927000
IHADCS43 EQU   IHADCB+48                                                00928000
DCBSCTAB EQU   IHADCS43                                                 00929000
DCBSCTAD EQU   DCBSCTAB+1                                               00930000
UCBPTR   EQU   DEBUCBAD                                                 00931000
UCBOBS01 EQU   UCBDEV                                                   00932000
UCBSTAB  EQU   UCBOBS01+10                                              00933000
UCBBSVL  EQU   UCBSTAB                                                  00934000
UCBPRSRS EQU   UCBSTAB                                                  00935000
UCBDMCT  EQU   UCBOBS01+11                                              00936000
UCBFL4   EQU   UCBOBS01+13                                              00937000
UCBOBS02 EQU   UCBDEV                                                   00938000
UCBTFL1  EQU   UCBOBS02+19                                              00939000
UCBXTN   EQU   UCBOBS02+20                                              00940000
UCBVOPT  EQU   UCBXTN                                                   00941000
UCBOBS03 EQU   UCBDEV                                                   00942000
UCBXTADR EQU   UCBOBS03                                                 00943000
UCBOBS04 EQU   UCBDEV                                                   00944000
UCBBTA   EQU   UCBOBS04+12                                              00945000
UCBOBS06 EQU   UCBDEV                                                   00946000
UCBAOF   EQU   UCBOBS06                                                 00947000
UCBAOF1  EQU   UCBAOF                                                   00948000
UCBAOF2  EQU   UCBAOF+1                                                 00949000
@NM00164 EQU   UCBOBS06+3                                               00950000
UCBIRB   EQU   UCBOBS06+4                                               00951000
UCBGRAF  EQU   UCBIRB                                                   00952000
UCBLDNCA EQU   UCBOBS06+8                                               00953000
UCBRDYQ  EQU   UCBLDNCA                                                 00954000
UCBIRLN  EQU   UCBRDYQ                                                  00955000
UCBLDNCB EQU   UCBRDYQ+1                                                00956000
UCBCTLNK EQU   UCBOBS06+12                                              00957000
UCBOBS07 EQU   UCBDEV                                                   00958000
UCBOBS08 EQU   UCBDEV                                                   00959000
UCBCTCAD EQU   UCBOBS08                                                 00960000
UCBCTCF1 EQU   UCBOBS08+4                                               00961000
UCBOBS09 EQU   UCBDEV                                                   00962000
IOCOMPTR EQU   CVTIXAVL                                                 00963000
IOSBPTR  EQU   LCBIOSB                                                  00964000
IOSATTSC EQU   IOSIPIB                                                  00965000
IOSWTOWA EQU   IOSIPIB                                                  00966000
IOSPCISC EQU   IOSIPIB                                                  00967000
@NM00204 EQU   LCBCCW1                                                  00968000
WRTADDR  EQU   @NM00204+1                                               00969000
@NM00206 EQU   LCBCCW3                                                  00970000
RDADDR   EQU   @NM00206+1                                               00971000
@NM00208 EQU   LCBCCW6                                                  00972000
NOP1ADDR EQU   @NM00208+1                                               00973000
@NM00210 EQU   LCBCCW7                                                  00974000
NOP2ADDR EQU   @NM00210+1                                               00975000
*                                      START UNREFERENCED COMPONENTS    00976000
@NM00211 EQU   @NM00210                                                 00977000
@NM00209 EQU   @NM00208                                                 00978000
@NM00207 EQU   @NM00206                                                 00979000
@NM00205 EQU   @NM00204                                                 00980000
IOSPCIWA EQU   IOSPCISC+44                                              00981000
IOSPCIRS EQU   IOSPCISC+8                                               00982000
@NM00174 EQU   IOSPCISC+4                                               00983000
@NM00173 EQU   IOSPCISC                                                 00984000
IOSWRNDR EQU   IOSWTOWA+4                                               00985000
IOSWTOPT EQU   IOSWTOWA+3                                               00986000
IOSWTOCP EQU   IOSWTOWA+2                                               00987000
IOSWTOCH EQU   IOSWTOWA                                                 00988000
IOSATTWA EQU   IOSATTSC+40                                              00989000
@NM00172 EQU   IOSATTSC+24                                              00990000
IOSATTSN EQU   IOSATTSC                                                 00991000
UCBRV066 EQU   UCBOBS09+4                                               00992000
UCBIOSBA EQU   UCBOBS09                                                 00993000
UCBRV042 EQU   UCBOBS08+5                                               00994000
UCBRV082 EQU   UCBCTCF1                                                 00995000
UCBRV081 EQU   UCBCTCF1                                                 00996000
UCBRV080 EQU   UCBCTCF1                                                 00997000
UCBRV079 EQU   UCBCTCF1                                                 00998000
UCBRV078 EQU   UCBCTCF1                                                 00999000
UCBRV077 EQU   UCBCTCF1                                                 01000000
UCBRV076 EQU   UCBCTCF1                                                 01001000
UCBCTC80 EQU   UCBCTCF1                                                 01002000
UCBCTCAL EQU   UCBCTCAD                                                 01003000
UCBICNCB EQU   UCBOBS07+4                                               01004000
UCBRV040 EQU   UCBOBS07                                                 01005000
UCBCTLNA EQU   UCBCTLNK+1                                               01006000
UCBRLN   EQU   UCBCTLNK                                                 01007000
UCBRDYQA EQU   UCBLDNCB                                                 01008000
UCBINRLN EQU   UCBIRLN                                                  01009000
UCBIRBA  EQU   UCBIRB+1                                                 01010000
UCBRV039 EQU   UCBGRAF                                                  01011000
UCBDWNR  EQU   UCBGRAF                                                  01012000
UCBRPND  EQU   UCBGRAF                                                  01013000
UCBUPM   EQU   UCBGRAF                                                  01014000
UCBBTAM  EQU   UCBGRAF                                                  01015000
UCBDRNO  EQU   UCBGRAF                                                  01016000
UCBDRO   EQU   UCBGRAF                                                  01017000
UCBOIP   EQU   UCBGRAF                                                  01018000
UCBATRCD EQU   @NM00164                                                 01019000
UCBSKPFG EQU   @NM00164                                                 01020000
UCBRIPND EQU   @NM00164                                                 01021000
UCBRTIAC EQU   @NM00164                                                 01022000
UCBRSV79 EQU   @NM00164                                                 01023000
UCBRSV78 EQU   @NM00164                                                 01024000
UCBRSV77 EQU   @NM00164                                                 01025000
UCBOLTEP EQU   @NM00164                                                 01026000
UCBATNCT EQU   UCBOBS06+2                                               01027000
UCBRSV76 EQU   UCBAOF2                                                  01028000
UCBRSV75 EQU   UCBAOF2                                                  01029000
UCBRSV74 EQU   UCBAOF2                                                  01030000
UCBRSV73 EQU   UCBAOF2                                                  01031000
UCBRSV72 EQU   UCBAOF2                                                  01032000
UCBRSV71 EQU   UCBAOF2                                                  01033000
UCBRSV70 EQU   UCBAOF2                                                  01034000
UCBRSV69 EQU   UCBAOF2                                                  01035000
UCBRSV68 EQU   UCBAOF1                                                  01036000
UCBRSV67 EQU   UCBAOF1                                                  01037000
UCBRSV66 EQU   UCBAOF1                                                  01038000
UCBRSV65 EQU   UCBAOF1                                                  01039000
UCBRSV64 EQU   UCBAOF1                                                  01040000
UCBOFNL  EQU   UCBAOF1                                                  01041000
UCBOFSP  EQU   UCBAOF1                                                  01042000
UCBOFMCR EQU   UCBAOF1                                                  01043000
UCBBTB   EQU   UCBBTA+1                                                 01044000
UCBDI    EQU   UCBBTA                                                   01045000
UCBSNS   EQU   UCBOBS04+8                                               01046000
UCBTEB   EQU   UCBOBS04+4                                               01047000
UCBGCB   EQU   UCBOBS04+3                                               01048000
UCBOPEN  EQU   UCBOBS04+2                                               01049000
UCBSTART EQU   UCBOBS04                                                 01050000
UCBXTNB  EQU   UCBXTN+1                                                 01051000
UCBRSV22 EQU   UCBVOPT                                                  01052000
UCBRSV21 EQU   UCBVOPT                                                  01053000
UCBRSV20 EQU   UCBVOPT                                                  01054000
UCBESVE  EQU   UCBVOPT                                                  01055000
UCBERPC  EQU   UCBVOPT                                                  01056000
UCBESVC  EQU   UCBVOPT                                                  01057000
UCBEVA   EQU   UCBVOPT                                                  01058000
UCBESV   EQU   UCBVOPT                                                  01059000
UCBRV009 EQU   UCBTFL1                                                  01060000
UCBRV008 EQU   UCBTFL1                                                  01061000
UCBRV007 EQU   UCBTFL1                                                  01062000
UCBRV006 EQU   UCBTFL1                                                  01063000
UCBRV005 EQU   UCBTFL1                                                  01064000
UCBRV038 EQU   UCBTFL1                                                  01065000
UCBNSLTP EQU   UCBTFL1                                                  01066000
UCBNLTP  EQU   UCBTFL1                                                  01067000
UCBRES1B EQU   UCBOBS02+18                                              01068000
UCBFSER  EQU   UCBOBS02+12                                              01069000
@NM00163 EQU   UCBOBS02+4                                               01070000
UCBFSEQ  EQU   UCBOBS02+2                                               01071000
UCBFSCT  EQU   UCBOBS02                                                 01072000
UCBNEXP  EQU   UCBOBS01+20                                              01073000
UCBBASE  EQU   UCBOBS01+16                                              01074000
UCBRES1A EQU   UCBOBS01+15                                              01075000
UCBUSER  EQU   UCBOBS01+14                                              01076000
UCBFL47  EQU   UCBFL4                                                   01077000
UCBFL46  EQU   UCBFL4                                                   01078000
UCBFL45  EQU   UCBFL4                                                   01079000
UCBRV065 EQU   UCBFL4                                                   01080000
UCBDSS   EQU   UCBFL4                                                   01081000
UCBRV028 EQU   UCBFL4                                                   01082000
UCBWDAV  EQU   UCBFL4                                                   01083000
UCBDAVV  EQU   UCBFL4                                                   01084000
UCBSQC   EQU   UCBOBS01+12                                              01085000
UCBDATP  EQU   UCBOBS01+12                                              01086000
UCBDMC   EQU   UCBDMCT                                                  01087000
UCBMOUNT EQU   UCBDMCT                                                  01088000
UCBBNUL  EQU   UCBSTAB                                                  01089000
UCBSHAR  EQU   UCBSTAB                                                  01090000
UCBBSTR  EQU   UCBSTAB                                                  01091000
UCBBPUB  EQU   UCBSTAB                                                  01092000
UCBBPRV  EQU   UCBSTAB                                                  01093000
UCBBALB  EQU   UCBPRSRS                                                 01094000
UCBPGFL  EQU   UCBSTAB                                                  01095000
UCBDVSHR EQU   UCBBSVL                                                  01096000
UCBVOLI  EQU   UCBOBS01+4                                               01097000
UCBVTOC  EQU   UCBOBS01                                                 01098000
DCBBUFSI EQU   IHADCS43+6                                               01099000
DCBUNTCT EQU   IHADCS43+5                                               01100000
DCBILCT  EQU   IHADCS43+4                                               01101000
@NM00161 EQU   DCBSCTAB                                                 01102000
DCBPUTA  EQU   DCBGETA                                                  01103000
@NM00160 EQU   DCBPUT                                                   01104000
DCBDEBA  EQU   DCBDEBAD+1                                               01105000
@NM00159 EQU   DCBIFLGS                                                 01106000
DCBIFIOE EQU   DCBIFLGS                                                 01107000
DCBCH12  EQU   DCBIFPCT                                                 01108000
DCBCH9   EQU   DCBIFPCT                                                 01109000
DCBIFEC  EQU   DCBIFLGS                                                 01110000
DCBMFSTI EQU   DCBMFDMD                                                 01111000
DCBMFAWR EQU   DCBMFSTK                                                 01112000
DCBMFUIP EQU   DCBMFTMD                                                 01113000
DCBMFIDW EQU   DCBMFLCP                                                 01114000
DCBMFWRK EQU   DCBMFMVP                                                 01115000
DCBMFRDQ EQU   DCBMFWRT                                                 01116000
DCBMFGTQ EQU   DCBMFPUT                                                 01117000
DCBMFSTL EQU   DCBMACF2                                                 01118000
DCBMFCK  EQU   DCBMFDMG                                                 01119000
DCBMFRDX EQU   DCBMFCHK                                                 01120000
DCBMFDBF EQU   DCBMFSBG                                                 01121000
DCBMFRDI EQU   DCBMFLCG                                                 01122000
DCBMFRDK EQU   DCBMFMVG                                                 01123000
DCBMFWRQ EQU   DCBMFRD                                                  01124000
DCBMFPTQ EQU   DCBMFGET                                                 01125000
DCBMFECP EQU   DCBMACF1                                                 01126000
DCBTIOT  EQU   IHADCS25                                                 01127000
DCBMRSTI EQU   DCBMRDMD                                                 01128000
DCBMRAWR EQU   DCBMRSTK                                                 01129000
DCBMRUIP EQU   DCBMRTMD                                                 01130000
DCBMRIDW EQU   DCBMRLCP                                                 01131000
DCBMRWRK EQU   DCBMRMVP                                                 01132000
DCBMRRDQ EQU   DCBMRWRT                                                 01133000
DCBMRGTQ EQU   DCBMRPUT                                                 01134000
DCBMRSTL EQU   DCBMACR2                                                 01135000
DCBMRCK  EQU   DCBMRDMG                                                 01136000
DCBPGFXA EQU   DCBMRRDX                                                 01137000
DCBMRDBF EQU   DCBMRSBG                                                 01138000
DCBMRRDI EQU   DCBMRLCG                                                 01139000
DCBMRRDK EQU   DCBMRMVG                                                 01140000
DCBMRWRQ EQU   DCBMRRD                                                  01141000
DCBMRPTQ EQU   DCBMRGET                                                 01142000
DCBMRECP EQU   DCBMACR1                                                 01143000
@NM00158 EQU   DCBIFLG                                                  01144000
DCBIBIOE EQU   DCBIFLG                                                  01145000
DCBICH12 EQU   DCBIBPCT                                                 01146000
DCBICH9  EQU   DCBIBPCT                                                 01147000
DCBIBEC  EQU   DCBIFLG                                                  01148000
DCBOFIOF EQU   DCBOFLGS                                                 01149000
DCBOFUEX EQU   DCBOFLGS                                                 01150000
DCBOFTM  EQU   DCBOFLGS                                                 01151000
DCBOFPPC EQU   DCBOFLGS                                                 01152000
DCBOFOPN EQU   DCBOFLGS                                                 01153000
DCBOFEOV EQU   DCBOFLGS                                                 01154000
DCBOFLRB EQU   DCBOFLGS                                                 01155000
DCBOFIOD EQU   DCBOFLWR                                                 01156000
DCBDDNAM EQU   IHADCS24                                                 01157000
DCBEXLSA EQU   DCBEXLST+1                                               01158000
DCBRNCKA EQU   DCBRNCKD+1                                               01159000
@NM00157 EQU   DCBRNCKD                                                 01160000
DCBIOBAD EQU   IHADCS2K+8                                               01161000
DCBDSGTR EQU   DCBDSRG2                                                 01162000
@NM00156 EQU   DCBDSRG2                                                 01163000
DCBDSRG1 EQU   DCBDSORG                                                 01164000
DCBCHNGL EQU   DCBTRSTA                                                 01165000
DCBNIDLE EQU   DCBTRSTA                                                 01166000
DCBBAKUP EQU   DCBTRSTA                                                 01167000
DCBIPLED EQU   DCBTRSTA                                                 01168000
DCBRSTRT EQU   DCBTRSTA                                                 01169000
DCBINITL EQU   DCBTRSTA                                                 01170000
DCBAUTOD EQU   DCBTRSTA                                                 01171000
DCBAUTOI EQU   DCBTRSTA                                                 01172000
@NM00155 EQU   IHADCS2K+4                                               01173000
DCBDUMPA EQU   DCBDUMPD+1                                               01174000
DCBUNITN EQU   DCBDUMPD                                                 01175000
DCBBCKUA EQU   DCBBCKUP+1                                               01176000
@NM00154 EQU   DCBBCKUP                                                 01177000
DCBIPLTX EQU   IHADCS1A                                                 01178000
CVTRV628 EQU   CVTS01+728                                               01179000
CVTRV627 EQU   CVTS01+724                                               01180000
CVTRV626 EQU   CVTS01+720                                               01181000
CVTRV625 EQU   CVTS01+716                                               01182000
CVTRV624 EQU   CVTS01+712                                               01183000
CVTRV623 EQU   CVTS01+708                                               01184000
CVTRV622 EQU   CVTS01+704                                               01185000
CVTRV621 EQU   CVTS01+700                                               01186000
CVTRV620 EQU   CVTS01+696                                               01187000
CVTRV619 EQU   CVTS01+692                                               01188000
CVTRV618 EQU   CVTS01+688                                               01189000
CVTRV617 EQU   CVTS01+684                                               01190000
CVTRV616 EQU   CVTS01+680                                               01191000
CVTRV615 EQU   CVTS01+676                                               01192000
CVTRV614 EQU   CVTS01+672                                               01193000
CVTRV613 EQU   CVTS01+668                                               01194000
CVTTCASP EQU   CVTS01+664                                               01195000
CVT0PT03 EQU   CVTS01+660                                               01196000
CVT0PT0E EQU   CVTS01+656                                               01197000
CVTIRM   EQU   CVTS01+652                                               01198000
CVTCGK   EQU   CVTS01+648                                               01199000
CVTRV607 EQU   CVTS01+644                                               01200000
CVTRV606 EQU   CVTS01+640                                               01201000
CVTRV605 EQU   CVTS01+636                                               01202000
CVTRV604 EQU   CVTS01+632                                               01203000
CVTEFF02 EQU   CVTS01+628                                               01204000
CVTCBBR  EQU   CVTS01+624                                               01205000
CVTSSCR  EQU   CVTS01+620                                               01206000
CVTEVENT EQU   CVTS01+616                                               01207000
CVTCRCA  EQU   CVTS01+612                                               01208000
CVTTPIO  EQU   CVTS01+608                                               01209000
CVTADV   EQU   CVTS01+604                                               01210000
CVTGSDAB EQU   CVTGSDA                                                  01211000
CVTQV3   EQU   CVTS01+596                                               01212000
CVTQV2   EQU   CVTS01+592                                               01213000
CVTQV1   EQU   CVTS01+588                                               01214000
CVTRPT   EQU   CVTS01+584                                               01215000
CVTSSRB  EQU   CVTS01+580                                               01216000
CVTCSDRL EQU   CVTS01+576                                               01217000
CVTEXP1  EQU   CVTS01+572                                               01218000
CVTRMPMT EQU   CVTS01+568                                               01219000
CVTRMPTT EQU   CVTS01+564                                               01220000
CVTVPSA  EQU   CVTS01+560                                               01221000
CVTVSTOP EQU   CVTS01+556                                               01222000
CVTGTFR8 EQU   CVTS01+552                                               01223000
CVTQUIT  EQU   CVTS01+548                                               01224000
CVTVACR  EQU   CVTS01+544                                               01225000
CVTWTCB  EQU   CVTS01+540                                               01226000
CVTSTPRS EQU   CVTS01+536                                               01227000
CVT0PT02 EQU   CVTS01+532                                               01228000
CVTDARCM EQU   CVTS01+528                                               01229000
CVTIRECM EQU   CVTS01+524                                               01230000
CVTJRECM EQU   CVTS01+520                                               01231000
CVTVEMS0 EQU   CVTS01+516                                               01232000
CVTSPFRR EQU   CVTS01+512                                               01233000
CVTRLSTG EQU   CVTS01+508                                               01234000
CVT0TC0A EQU   CVTS01+504                                               01235000
CVTGMBR  EQU   CVTS01+500                                               01236000
CVTLFRM  EQU   CVTS01+496                                               01237000
CVTRMBR  EQU   CVTS01+492                                               01238000
CVTVIOP  EQU   CVTS01+488                                               01239000
CVTRV307 EQU   CVTS01+486                                               01240000
CVTRV306 EQU   CVTS01+484                                               01241000
CVTRV305 EQU   CVTS01+482                                               01242000
CVTRV304 EQU   CVTS01+480                                               01243000
CVTRV303 EQU   CVTS01+478                                               01244000
CVTRV302 EQU   CVTS01+476                                               01245000
CVTTRCA  EQU   CVTS01+472                                               01246000
CVTRV297 EQU   CVTRV289                                                 01247000
CVTRV296 EQU   CVTRV289                                                 01248000
CVTRV295 EQU   CVTRV289                                                 01249000
CVTRV294 EQU   CVTRV289                                                 01250000
CVTRV293 EQU   CVTRV289                                                 01251000
CVTRV292 EQU   CVTRV289                                                 01252000
CVTRV291 EQU   CVTRV289                                                 01253000
CVTRV290 EQU   CVTRV289                                                 01254000
CVTRV288 EQU   CVTRV280                                                 01255000
CVTRV287 EQU   CVTRV280                                                 01256000
CVTRV286 EQU   CVTRV280                                                 01257000
CVTRV285 EQU   CVTRV280                                                 01258000
CVTRV284 EQU   CVTRV280                                                 01259000
CVTRV283 EQU   CVTRV280                                                 01260000
CVTRV282 EQU   CVTRV280                                                 01261000
CVTRV281 EQU   CVTRV280                                                 01262000
CVTRV279 EQU   CVTRV271                                                 01263000
CVTRV278 EQU   CVTRV271                                                 01264000
CVTRV277 EQU   CVTRV271                                                 01265000
CVTRV276 EQU   CVTRV271                                                 01266000
CVTRV275 EQU   CVTRV271                                                 01267000
CVTRV274 EQU   CVTRV271                                                 01268000
CVTRV273 EQU   CVTRV271                                                 01269000
CVTRV272 EQU   CVTRV271                                                 01270000
CVTRV270 EQU   CVTRV262                                                 01271000
CVTRV269 EQU   CVTRV262                                                 01272000
CVTRV268 EQU   CVTRV262                                                 01273000
CVTRV267 EQU   CVTRV262                                                 01274000
CVTRV266 EQU   CVTRV262                                                 01275000
CVTRV265 EQU   CVTRV262                                                 01276000
CVTRV264 EQU   CVTRV262                                                 01277000
CVTRV263 EQU   CVTRV262                                                 01278000
CVTVFP   EQU   CVTS01+464                                               01279000
CVTVSI   EQU   CVTS01+460                                               01280000
CVTVPSIB EQU   CVTS01+456                                               01281000
CVTMFACT EQU   CVTMFRTR                                                 01282000
CVTMFCTL EQU   CVTS01+448                                               01283000
CVTPVBP  EQU   CVTS01+444                                               01284000
CVTPWI   EQU   CVTS01+440                                               01285000
CVTRV254 EQU   CVTS01+438                                               01286000
CVTRV253 EQU   CVTS01+436                                               01287000
CVTRV252 EQU   CVTS01+434                                               01288000
CVTRV251 EQU   CVTS01+433                                               01289000
CVTRV250 EQU   CVTS01+432                                               01290000
CVTRV249 EQU   CVTS01+431                                               01291000
CVTRV248 EQU   CVTS01+430                                               01292000
CVTRV247 EQU   CVTS01+429                                               01293000
CVTRV246 EQU   CVTS01+428                                               01294000
CVTRV245 EQU   CVTRV237                                                 01295000
CVTRV244 EQU   CVTRV237                                                 01296000
CVTRV243 EQU   CVTRV237                                                 01297000
CVTRV242 EQU   CVTRV237                                                 01298000
CVTRV241 EQU   CVTRV237                                                 01299000
CVTRV240 EQU   CVTRV237                                                 01300000
CVTRV239 EQU   CVTRV237                                                 01301000
CVTRV238 EQU   CVTRV237                                                 01302000
CVTRV236 EQU   CVTRV228                                                 01303000
CVTRV235 EQU   CVTRV228                                                 01304000
CVTRV234 EQU   CVTRV228                                                 01305000
CVTRV233 EQU   CVTRV228                                                 01306000
CVTRV232 EQU   CVTRV228                                                 01307000
CVTRV231 EQU   CVTRV228                                                 01308000
CVTRV230 EQU   CVTRV228                                                 01309000
CVTRV229 EQU   CVTRV228                                                 01310000
CVTRV227 EQU   CVTRV219                                                 01311000
CVTRV226 EQU   CVTRV219                                                 01312000
CVTRV225 EQU   CVTRV219                                                 01313000
CVTRV224 EQU   CVTRV219                                                 01314000
CVTRV223 EQU   CVTRV219                                                 01315000
CVTRV222 EQU   CVTRV219                                                 01316000
CVTRV221 EQU   CVTRV219                                                 01317000
CVTRV220 EQU   CVTRV219                                                 01318000
CVTRV218 EQU   CVTRV210                                                 01319000
CVTRV217 EQU   CVTRV210                                                 01320000
CVTRV216 EQU   CVTRV210                                                 01321000
CVTRV215 EQU   CVTRV210                                                 01322000
CVTRV214 EQU   CVTRV210                                                 01323000
CVTRV213 EQU   CVTRV210                                                 01324000
CVTRV212 EQU   CVTRV210                                                 01325000
CVTRV211 EQU   CVTRV210                                                 01326000
CVTLCCAT EQU   CVTS01+420                                               01327000
CVTPCCAT EQU   CVTS01+416                                               01328000
CVTIPCRP EQU   CVTS01+412                                               01329000
CVTIPCRI EQU   CVTS01+408                                               01330000
CVTIPCDS EQU   CVTS01+404                                               01331000
CVTAIDVT EQU   CVTS01+400                                               01332000
CVTSSAP  EQU   CVTS01+396                                               01333000
CVTEHCIR EQU   CVTS01+392                                               01334000
CVTEHDEF EQU   CVTS01+388                                               01335000
CVTDAIR  EQU   CVTS01+384                                               01336000
CVTPERFM EQU   CVTS01+380                                               01337000
CVT044R2 EQU   CVTS01+376                                               01338000
CVTFETCH EQU   CVTS01+372                                               01339000
CVTRSTWD EQU   CVTS01+368                                               01340000
CVTSPOST EQU   CVTS01+364                                               01341000
CVTIOBP  EQU   CVTS01+360                                               01342000
CVTASMVT EQU   CVTS01+356                                               01343000
CVTRECRQ EQU   CVTS01+352                                               01344000
CVTWSAC  EQU   CVTS01+348                                               01345000
CVTRV149 EQU   CVTS01+344                                               01346000
CVTWSAL  EQU   CVTS01+340                                               01347000
CVTSPSA  EQU   CVTS01+336                                               01348000
CVTGLMN  EQU   CVTS01+332                                               01349000
CVTVEAC0 EQU   CVTS01+328                                               01350000
CVT062R1 EQU   CVTS01+324                                               01351000
CVTRPOST EQU   CVTS01+320                                               01352000
CVTDQIQE EQU   CVTS01+316                                               01353000
CVTCSD   EQU   CVTS01+312                                               01354000
CVTLKRMA EQU   CVTS01+308                                               01355000
CVTRSPIE EQU   CVTS01+304                                               01356000
CVTRENQ  EQU   CVTS01+300                                               01357000
CVTLQCB  EQU   CVTS01+296                                               01358000
CVTFQCB  EQU   CVTS01+292                                               01359000
CVTQCS01 EQU   CVTS01+288                                               01360000
CVTAPFT  EQU   CVTS01+284                                               01361000
CVTPARRL EQU   CVTS01+280                                               01362000
CVTVWAIT EQU   CVTS01+276                                               01363000
CVTGSPL  EQU   CVTS01+272                                               01364000
CVTLSMQ  EQU   CVTS01+268                                               01365000
CVTGSMQ  EQU   CVTS01+264                                               01366000
CVTEXPRO EQU   CVTS01+260                                               01367000
CVTOPCTP EQU   CVTS01+256                                               01368000
CVTSIC   EQU   CVTS01+252                                               01369000
CVTTPIOS EQU   CVTS01+248                                               01370000
CVTRTMS  EQU   CVTS01+244                                               01371000
CVTSDBF  EQU   CVTS01+240                                               01372000
CVTSCBP  EQU   CVTS01+236                                               01373000
CVTSDMP  EQU   CVTS01+232                                               01374000
CVTSV60  EQU   CVTS01+228                                               01375000
CVTRTMCT EQU   CVTS01+224                                               01376000
CVTASCBL EQU   CVTS01+220                                               01377000
CVTASCBH EQU   CVTS01+216                                               01378000
CVTGDA   EQU   CVTS01+212                                               01379000
CVTASVT  EQU   CVTS01+208                                               01380000
CVTVVMDI EQU   CVTS01+204                                               01381000
CVTAQTOP EQU   CVTS01+200                                               01382000
CVTIOSCS EQU   CVTS01+196                                               01383000
CVTSDRM  EQU   CVTS01+192                                               01384000
CVTOPTE  EQU   CVTS01+188                                               01385000
CVTSTXU  EQU   CVTS01+184                                               01386000
CVTQUIS  EQU   CVTS01+180                                               01387000
CVTPARS  EQU   CVTS01+176                                               01388000
CVTS1EE  EQU   CVTS01+172                                               01389000
CVTFRAS  EQU   CVTS01+168                                               01390000
CVTQSAS  EQU   CVTS01+164                                               01391000
CVTCRAS  EQU   CVTS01+160                                               01392000
CVTCRMN  EQU   CVTS01+156                                               01393000
CVTDELCP EQU   CVTS01+152                                               01394000
CVTFRECL EQU   CVTS01+148                                               01395000
CVTGETCL EQU   CVTS01+144                                               01396000
CVTBLDCP EQU   CVTS01+140                                               01397000
CVTAUTHL EQU   CVTS01+136                                               01398000
CVTSCAN  EQU   CVTS01+132                                               01399000
CVTRV144 EQU   CVTS01+130                                               01400000
CVTMAXMP EQU   CVTS01+128                                               01401000
CVTSTCK  EQU   CVTS01+124                                               01402000
CVTRV139 EQU   CVTS01+123                                               01403000
CVTDSSAC EQU   CVTS01+122                                               01404000
CVTRV513 EQU   CVTS01+121                                               01405000
CVTIOSPL EQU   CVTS01+120                                               01406000
CVTPTGT  EQU   CVTS01+116                                               01407000
CVTCSPIE EQU   CVTS01+112                                               01408000
CVTSMFEX EQU   CVTS01+108                                               01409000
CVTOLT0A EQU   CVTS01+104                                               01410000
CVTSRBRT EQU   CVTS01+100                                               01411000
CVTPUTL  EQU   CVTS01+96                                                01412000
CVTASCRL EQU   CVTS01+92                                                01413000
CVTASCRF EQU   CVTS01+88                                                01414000
CVTRV326 EQU   CVTS01+84                                                01415000
CVTRV325 EQU   CVTS01+80                                                01416000
CVTRV324 EQU   CVTS01+76                                                01417000
CVT0VL01 EQU   CVTS01+72                                                01418000
CVTSHRVM EQU   CVTS01+68                                                01419000
CVTRV332 EQU   CVTS01+64                                                01420000
CVTTAS   EQU   CVTS01+60                                                01421000
CVTRSCN  EQU   CVTS01+56                                                01422000
CVTTRAC2 EQU   CVTS01+54                                                01423000
CVTTRACE EQU   CVTS01+52                                                01424000
CVTAPG   EQU   CVTS01+51                                                01425000
CVTSDTRC EQU   CVTCTLFG                                                 01426000
CVTGTRCE EQU   CVTCTLFG                                                 01427000
CVTNOMP  EQU   CVTCTLFG                                                 01428000
CVTRSV79 EQU   CVTCTLFG                                                 01429000
CVTDSTAT EQU   CVTCTLFG                                                 01430000
CVTRSV78 EQU   CVTCTLFG                                                 01431000
CVTRV333 EQU   CVTCTLFG                                                 01432000
CVTRV323 EQU   CVTCTLFG                                                 01433000
CVTSPVLK EQU   CVTS01+49                                                01434000
CVTRSV77 EQU   CVTS01+48                                                01435000
CVTRV331 EQU   CVTS01+44                                                01436000
CVTRV330 EQU   CVTS01+40                                                01437000
CVTRV329 EQU   CVTS01+36                                                01438000
CVTRV328 EQU   CVTS01+32                                                01439000
CVTRV322 EQU   CVTS01+28                                                01440000
CVTSLID  EQU   CVTSLIDA+1                                               01441000
CVTSYLK  EQU   CVTSLIDA                                                 01442000
CVTRV321 EQU   CVTS01+20                                                01443000
CVTRV320 EQU   CVTS01+16                                                01444000
CVTLPDIR EQU   CVTLPDIA+1                                               01445000
CVTRSV69 EQU   CVTDIRST                                                 01446000
CVTRSV68 EQU   CVTDIRST                                                 01447000
CVTRSV67 EQU   CVTDIRST                                                 01448000
CVTRSV66 EQU   CVTDIRST                                                 01449000
CVTRSV65 EQU   CVTDIRST                                                 01450000
CVTRSV64 EQU   CVTDIRST                                                 01451000
CVTRSV63 EQU   CVTDIRST                                                 01452000
CVTDICOM EQU   CVTDIRST                                                 01453000
CVTPVTP  EQU   CVTS01+8                                                 01454000
CVTLPDSR EQU   CVTS01+4                                                 01455000
CVTGETL  EQU   CVTS01                                                   01456000
@NM00141 EQU   LCBCANCL+3                                               01457000
LCBCANTH EQU   LCBCANCL+1                                               01458000
@NM00140 EQU   LCBCANFG                                                 01459000
LCBCANCD EQU   LCBCANFG                                                 01460000
@NM00139 EQU   LCBCANFG                                                 01461000
LCBCANEB EQU   LCBCANFG                                                 01462000
LCBCANXT EQU   LCBCANFG                                                 01463000
LCBUNADD EQU   LCBQNX+21                                                01464000
LCBUASZE EQU   LCBQNX+20                                                01465000
LCBDSTEA EQU   LCBQNX+16                                                01466000
@NM00138 EQU   LCBQNX+8                                                 01467000
@NM00137 EQU   LCBQNX+4                                                 01468000
LCBSTSAV EQU   LCBQNX+1                                                 01469000
@NM00136 EQU   LCBQNXMN                                                 01470000
LCBNX509 EQU   LCBQNXMN                                                 01471000
LCBNX162 EQU   LCBQNXMN                                                 01472000
LCBNX142 EQU   LCBQNXMN                                                 01473000
LCBNX064 EQU   LCBQNXMN                                                 01474000
@NM00135 EQU   @NM00133+4                                               01475000
LCBNCPPT EQU   @NM00133+1                                               01476000
@NM00134 EQU   @NM00133                                                 01477000
LCBCQLNK EQU   LCBCOREQ+4                                               01478000
LCBCQELE EQU   LCBCOREQ                                                 01479000
LCBPAKCH EQU   LCBRSPIN+16                                              01480000
@NM00132 EQU   LCBRSPFG                                                 01481000
LCBRSRH  EQU   LCBRSPFG                                                 01482000
LCBEXPI  EQU   LCBRSPFG                                                 01483000
@NM00131 EQU   LCBRSPIN+12                                              01484000
LCBUSUE1 EQU   LCBCSWU1                                                 01485000
@NM00130 EQU   LCBCSWU1                                                 01486000
@NM00129 EQU   LCBSCPRS+1                                               01487000
LCBDFCMD EQU   LCBSCPRS                                                 01488000
LCBUSER  EQU   LCBLUSNS+2                                               01489000
LCBSMIN  EQU   LCBLUSNS+1                                               01490000
LCBSMAJ  EQU   LCBLUSNS                                                 01491000
LCBRHSV  EQU   LCBRSPIN+2                                               01492000
LCBSNS0  EQU   LCBRSPIN+1                                               01493000
@NM00128 EQU   LCBRSPIN                                                 01494000
@NM00181 EQU   WTGDSECT+8                                               01495000
@NM00180 EQU   WTGDSECT                                                 01496000
BYTE     EQU   WORD1                                                    01497000
BYTE0    EQU   WORD0                                                    01498000
LOADDWL  EQU   LOADSECT+5                                               01499000
LOADTTR  EQU   LOADSECT+2                                               01500000
IQETCBAD EQU   IQE+13                                                   01501000
@NM00179 EQU   IQE+12                                                   01502000
IQEIRBAD EQU   IQE+8                                                    01503000
IQETRCAD EQU   IQE+5                                                    01504000
@NM00178 EQU   IQE                                                      01505000
@NM00177 EQU   @NM00176+2                                               01506000
QOFF     EQU   @NM00176                                                 01507000
EIGHT    EQU   SDSECT+8                                                 01508000
BYTEFOUR EQU   FOUR                                                     01509000
@NM00175 EQU   ATBFLA                                                   01510000
IOSEND   EQU   IOSB+108                                                 01511000
IOSSKR   EQU   IOSEEKA+7                                                01512000
IOSSKH2  EQU   IOSSKHH+1                                                01513000
IOSSKH1  EQU   IOSSKHH                                                  01514000
IOSSKCC  EQU   IOSCCHH                                                  01515000
IOSSKBB  EQU   IOSEEKA+1                                                01516000
IOSSKM   EQU   IOSEEKA                                                  01517000
IOSEEK   EQU   IOSB+92                                                  01518000
IOSMDM   EQU   IOSB+91                                                  01519000
IOSMDB   EQU   IOSB+90                                                  01520000
IOSCKEY7 EQU   IOSCKEY                                                  01521000
IOSCKEY6 EQU   IOSCKEY                                                  01522000
IOSCKEY5 EQU   IOSCKEY                                                  01523000
IOSCKEY4 EQU   IOSCKEY                                                  01524000
@NM00171 EQU   IOSCKEY                                                  01525000
IOSFMSK  EQU   IOSB+88                                                  01526000
IOSCUDEV EQU   IOSPATH+1                                                01527000
@NM00170 EQU   IOSCHN                                                   01528000
IOSPATH3 EQU   IOSCHN                                                   01529000
IOSPATH2 EQU   IOSCHN                                                   01530000
IOSEXP   EQU   IOSCHN                                                   01531000
IOSGDP   EQU   IOSCHN                                                   01532000
IOSAFF   EQU   IOSB+85                                                  01533000
IOSRSS1B EQU   IOSB+84                                                  01534000
IOSDSID  EQU   IOSB+80                                                  01535000
IOSVST   EQU   IOSB+76                                                  01536000
IOSRST   EQU   IOSB+72                                                  01537000
IOSERP   EQU   IOSB+52                                                  01538000
IOSPCHN  EQU   IOSB+48                                                  01539000
IOSSNS   EQU   IOSB+42                                                  01540000
IOSAPMSK EQU   IOSB+40                                                  01541000
IOSRES4A EQU   IOSB+36                                                  01542000
IOSUSE   EQU   IOSB+32                                                  01543000
IOSSRB   EQU   IOSB+28                                                  01544000
IOSCSWRC EQU   IOSCSW+5                                                 01545000
IOSTSB   EQU   IOSTATUS+1                                               01546000
IOSTSA   EQU   IOSTATUS                                                 01547000
IOSCSWCA EQU   IOSCSW                                                   01548000
IOSCC    EQU   @NM00169                                                 01549000
IOSUCB   EQU   IOSB+16                                                  01550000
IOSOPT2X EQU   IOSOPT2                                                  01551000
IOSHTP   EQU   IOSOPT2                                                  01552000
IOSRELSE EQU   IOSOPT                                                   01553000
IOSAPR   EQU   IOSOPT                                                   01554000
IOSTSLL  EQU   IOSOPT                                                   01555000
IOSNERP  EQU   IOSOPT                                                   01556000
IOSPSLL  EQU   IOSOPT                                                   01557000
IOSQISCE EQU   IOSOPT                                                   01558000
IOSDEP   EQU   IOSOPT                                                   01559000
IOSBYP   EQU   IOSOPT                                                   01560000
IOSCOD   EQU   IOSB+13                                                  01561000
IOSPKY7  EQU   IOSPKEY                                                  01562000
IOSPGDPX EQU   IOSPKEY                                                  01563000
IOSIDR   EQU   IOSPKEY                                                  01564000
IOSLCL   EQU   IOSPKEY                                                  01565000
@NM00168 EQU   IOSPKEY                                                  01566000
IOSPGAD  EQU   IOSB+8                                                   01567000
IOSASID  EQU   IOSB+6                                                   01568000
IOSPRLVL EQU   IOSB+5                                                   01569000
IOSDVRID EQU   IOSB+4                                                   01570000
IOSPROC  EQU   IOSB+3                                                   01571000
IOSFLC7  EQU   IOSFLC                                                   01572000
IOSFLC6  EQU   IOSFLC                                                   01573000
IOSRWAIT EQU   IOSFLC                                                   01574000
IOSTP    EQU   IOSFLC                                                   01575000
IOSCC3WE EQU   IOSFLC                                                   01576000
IOSVERIF EQU   IOSDVALT                                                 01577000
IOSDVMNT EQU   IOSFLC                                                   01578000
IOSLOG   EQU   IOSFLB                                                   01579000
IOSBDCST EQU   IOSFLB                                                   01580000
IOSMSG   EQU   IOSFLB                                                   01581000
IOSFLB4  EQU   IOSFLB                                                   01582000
IOSFLB3  EQU   IOSFLB                                                   01583000
IOSFLB2  EQU   IOSFLB                                                   01584000
IOSSDR   EQU   IOSFLB                                                   01585000
IOSDIESE EQU   IOSFLB                                                   01586000
IOSIOSB  EQU   IOSFLA                                                   01587000
IOSDOM   EQU   IOSFLA                                                   01588000
IOSEX    EQU   IOSFLA                                                   01589000
IOSSMDB  EQU   IOSFLA                                                   01590000
IOSSMDA  EQU   IOSFLA                                                   01591000
IOSERR   EQU   IOSFLA                                                   01592000
IOSCCHN  EQU   IOSACHN                                                  01593000
IOSDCHN  EQU   IOSACHN                                                  01594000
IOCOEND  EQU   IOCOM+128                                                01595000
IOCPATCH EQU   IOCOM+124                                                01596000
IOCUCBBM EQU   IOCOM+120                                                01597000
IOCQCNT  EQU   IOCOM+116                                                01598000
IOCIOSDQ EQU   IOCOM+112                                                01599000
IOCIOSEQ EQU   IOCOM+108                                                01600000
IOCSVCF  EQU   IOCOM+104                                                01601000
IOCTCCW  EQU   IOCOM+100                                                01602000
IOCRSVTB EQU   IOCOM+96                                                 01603000
IOCMFCNT EQU   IOCOM+92                                                 01604000
IOCMFHK  EQU   IOCOM+88                                                 01605000
IOCGENA  EQU   IOCOM+84                                                 01606000
IOCCCH   EQU   IOCOM+80                                                 01607000
IOCASYNQ EQU   IOCOM+76                                                 01608000
IOCLCHTB EQU   IOCOM+72                                                 01609000
IOCOMEX  EQU   IOCOM+64                                                 01610000
IOCSYNCH EQU   IOCOM+56                                                 01611000
IOCCATLK EQU   IOCOM+48                                                 01612000
IOCPRGID EQU   IOCOM+44                                                 01613000
IOCIOSCP EQU   IOCOM+40                                                 01614000
IOCORMGT EQU   IOCOM+36                                                 01615000
IOCVOID  EQU   IOCOM+32                                                 01616000
IOCSTIO  EQU   IOCOM+28                                                 01617000
@NM00167 EQU   IOCOM+24                                                 01618000
@NM00166 EQU   IOCOM+20                                                 01619000
IOCINT   EQU   IOCOM+16                                                 01620000
IOCCTBL  EQU   IOCOM+12                                                 01621000
IOCHIO   EQU   IOCOM+8                                                  01622000
IOCPST   EQU   IOCOM+4                                                  01623000
IOCPGCT  EQU   IOCOM+2                                                  01624000
IOCVOICT EQU   IOCOM                                                    01625000
UCBERADR EQU   UCBUCS+12                                                01626000
UCBFCBID EQU   UCBUCS+8                                                 01627000
UCBERCNT EQU   UCBUCS+7                                                 01628000
UCBRSV51 EQU   UCBUCS+6                                                 01629000
UCBRSV50 EQU   UCBFCBOP                                                 01630000
UCBRSV49 EQU   UCBFCBOP                                                 01631000
UCBRSV48 EQU   UCBFCBOP                                                 01632000
UCBRSV47 EQU   UCBFCBOP                                                 01633000
UCBRSV46 EQU   UCBFCBOP                                                 01634000
UCBRSV45 EQU   UCBFCBOP                                                 01635000
UCBRSV44 EQU   UCBFCBOP                                                 01636000
UCBFCBO1 EQU   UCBFCBOP                                                 01637000
UCBUCSPE EQU   UCBUCSOP                                                 01638000
UCBRSV43 EQU   UCBUCSOP                                                 01639000
UCBRSV42 EQU   UCBUCSOP                                                 01640000
UCBRSV41 EQU   UCBUCSOP                                                 01641000
UCBRSV40 EQU   UCBUCSOP                                                 01642000
UCBRSV39 EQU   UCBUCSOP                                                 01643000
UCBUCSO2 EQU   UCBUCSOP                                                 01644000
UCBUCSO1 EQU   UCBUCSOP                                                 01645000
UCBUCSID EQU   UCBUCS                                                   01646000
UCBMDRBA EQU   UCBMDRBF+1                                               01647000
UCBRV075 EQU   UCBMDRBF                                                 01648000
UCBRV074 EQU   UCB3800X+32                                              01649000
UCBIMAGE EQU   UCB3800X+28                                              01650000
UCBFCBNM EQU   UCB3800X+24                                              01651000
UCBCHAR4 EQU   UCB3800X+20                                              01652000
UCBCHAR3 EQU   UCB3800X+16                                              01653000
UCBCHAR2 EQU   UCB3800X+12                                              01654000
UCBCHAR1 EQU   UCB3800X+8                                               01655000
UCBCGMID EQU   UCB3800X+4                                               01656000
UCBBRSTA EQU   UCBACTIV                                                 01657000
UCBRV063 EQU   UCBACTIV                                                 01658000
UCBRV062 EQU   UCBACTIV                                                 01659000
UCBRV061 EQU   UCBACTIV                                                 01660000
UCBRV060 EQU   UCBACTIV                                                 01661000
UCBRV059 EQU   UCBACTIV                                                 01662000
UCBRV058 EQU   UCBACTIV                                                 01663000
UCBRV057 EQU   UCBACTIV                                                 01664000
UCBRV050 EQU   UCB3800X+2                                               01665000
UCBCGMNO EQU   UCB3800X+1                                               01666000
UCBRV083 EQU   UCBOPTNS                                                 01667000
UCBBRSTR EQU   UCBOPTNS                                                 01668000
UCBRV056 EQU   UCBOPTNS                                                 01669000
UCBRV055 EQU   UCBOPTNS                                                 01670000
UCBRV054 EQU   UCBOPTNS                                                 01671000
UCBRV053 EQU   UCBOPTNS                                                 01672000
UCBRV052 EQU   UCBOPTNS                                                 01673000
UCBRV051 EQU   UCBOPTNS                                                 01674000
UCBRV073 EQU   UCB3540X+7                                               01675000
UCBRV072 EQU   UCBDKBYT                                                 01676000
UCBRV071 EQU   UCBDKBYT                                                 01677000
UCBRV070 EQU   UCBDKBYT                                                 01678000
UCBRV069 EQU   UCBDKBYT                                                 01679000
UCBRV068 EQU   UCBDKBYT                                                 01680000
UCBRV067 EQU   UCBDKBYT                                                 01681000
UCBVLVER EQU   UCBDKBYT                                                 01682000
UCBDKAMX EQU   UCBDKBYT                                                 01683000
UCBVLSER EQU   UCB3540X                                                 01684000
UCBRDATA EQU   UCBOCR+4                                                 01685000
UCBFRID  EQU   UCBOCR                                                   01686000
UCBCLN   EQU   UCBMT+14                                                 01687000
UCBERG   EQU   UCBMT+12                                                 01688000
UCBMS    EQU   UCBMT+11                                                 01689000
UCBNB    EQU   UCBMT+10                                                 01690000
UCBPW    EQU   UCBMT+9                                                  01691000
UCBPR    EQU   UCBMT+8                                                  01692000
UCBSIO   EQU   UCBMT+6                                                  01693000
UCBTW    EQU   UCBMT+5                                                  01694000
UCBTR    EQU   UCBMT+4                                                  01695000
UCBTWT   EQU   UCBMT+3                                                  01696000
UCBTRT   EQU   UCBMT+2                                                  01697000
UCBCTD   EQU   UCBMT                                                    01698000
UCBWTOID EQU   UCBCMEXT+17                                              01699000
UCBRV043 EQU   UCBCMEXT+16                                              01700000
UCBASID  EQU   UCBCMEXT+14                                              01701000
UCBMFCNT EQU   UCBCMEXT+12                                              01702000
UCBPMSK  EQU   UCBCMEXT+10                                              01703000
UCBCCWOF EQU   UCBCMEXT+8                                               01704000
UCBRV041 EQU   UCBCMEXT+6                                               01705000
UCBRV036 EQU   UCBFLP1                                                  01706000
UCBRV035 EQU   UCBFLP1                                                  01707000
UCBERLOG EQU   UCBFLP1                                                  01708000
UCBRV033 EQU   UCBFLP1                                                  01709000
UCBRV032 EQU   UCBFLP1                                                  01710000
UCBRV031 EQU   UCBFLP1                                                  01711000
UCBSHRUP EQU   UCBFLP1                                                  01712000
UCBNSRCH EQU   UCBFLP1                                                  01713000
UCBSNSCT EQU   UCBCMEXT+4                                               01714000
UCBHPDV  EQU   @NM00165                                                 01715000
UCBHALI  EQU   @NM00165                                                 01716000
UCBRSV09 EQU   @NM00165                                                 01717000
UCBRSV08 EQU   @NM00165                                                 01718000
UCBRSV07 EQU   @NM00165                                                 01719000
UCBRSV06 EQU   @NM00165                                                 01720000
UCBRSV05 EQU   @NM00165                                                 01721000
UCBRSV04 EQU   @NM00165                                                 01722000
UCBDTI   EQU   UCBCMEXT+2                                               01723000
UCBSTI   EQU   UCBCMEXT+1                                               01724000
UCBETI   EQU   UCBCMEXT                                                 01725000
UCBEXTP  EQU   UCBEXTPT+1                                               01726000
UCBDDRSW EQU   UCBFLC                                                   01727000
UCBTICBT EQU   UCBFLC                                                   01728000
UCBIVRR  EQU   UCBFLC                                                   01729000
UCBIVRS  EQU   UCBFLC                                                   01730000
UCBITF   EQU   UCBFLC                                                   01731000
UCBUDE   EQU   UCBFLC                                                   01732000
UCBWAA   EQU   UCBFLC                                                   01733000
UCBATTP  EQU   UCBFLC                                                   01734000
UCBUNTYP EQU   UCBTBYT4                                                 01735000
UCBRSV11 EQU   UCBDVCLS                                                 01736000
UCBRSV10 EQU   UCBDVCLS                                                 01737000
UCB3CHAR EQU   UCBDVCLS                                                 01738000
UCB3UREC EQU   UCBDVCLS                                                 01739000
UCB3DISP EQU   UCBDVCLS                                                 01740000
UCB3DACC EQU   UCBDVCLS                                                 01741000
UCB3COMM EQU   UCBDVCLS                                                 01742000
UCB3TAPE EQU   UCBDVCLS                                                 01743000
UCBDVPWR EQU   UCB2OPT7                                                 01744000
UCBVLPWR EQU   UCB2OPT6                                                 01745000
UCB2OPT5 EQU   UCBTBYT2                                                 01746000
UCBRVDEV EQU   UCBRWTAU                                                 01747000
UCBRPS   EQU   UCBDUDN2                                                 01748000
UCBRR    EQU   UCBDUDN1                                                 01749000
UCB2OPT1 EQU   UCBTBYT2                                                 01750000
UCB2OPT0 EQU   UCBTBYT2                                                 01751000
UCB1FEA7 EQU   UCBTBYT1                                                 01752000
UCBD6250 EQU   UCB1FEA6                                                 01753000
UCBD1600 EQU   UCB1FEA5                                                 01754000
UCB1FEA4 EQU   UCBTBYT1                                                 01755000
UCB1FEA3 EQU   UCBTBYT1                                                 01756000
UCB1FEA2 EQU   UCBTBYT1                                                 01757000
UCB1FEA1 EQU   UCBTBYT1                                                 01758000
UCB1FEA0 EQU   UCBTBYT1                                                 01759000
UCBNAME  EQU   UCBOB+13                                                 01760000
UCBRV029 EQU   UCBWGT                                                   01761000
UCBVHRSN EQU   UCBWGT                                                   01762000
UCBVORSN EQU   UCBWGT                                                   01763000
UCBMTPXP EQU   UCBWGT                                                   01764000
UCBREW   EQU   UCBWGT                                                   01765000
UCBPUB   EQU   UCBWGT                                                   01766000
UCBOUT   EQU   UCBWGT                                                   01767000
UCBIN    EQU   UCBWGT                                                   01768000
UCBCPU   EQU   UCBOB+11                                                 01769000
UCBLCI   EQU   UCBOB+10                                                 01770000
UCBCNT   EQU   UCBOB+9                                                  01771000
UCBRV017 EQU   UCBCHM1                                                  01772000
UCBRV016 EQU   UCBCHM1                                                  01773000
UCBRV015 EQU   UCBCHM1                                                  01774000
UCBRV014 EQU   UCBCHM1                                                  01775000
UCBSPB   EQU   UCBPTH1                                                  01776000
UCBPPB   EQU   UCBPTH1                                                  01777000
UCBSPA   EQU   UCBPTH0                                                  01778000
UCBPPA   EQU   UCBPTH0                                                  01779000
UCBSIGP  EQU   UCBFLB                                                   01780000
UCBVALPH EQU   UCBFLB                                                   01781000
UCBCRHSN EQU   UCBFLB                                                   01782000
UCBCRHRV EQU   UCBFLB                                                   01783000
UCBRESVH EQU   UCBFLB                                                   01784000
UCBSPST  EQU   UCBFLB                                                   01785000
UCBASNS  EQU   UCBFLB                                                   01786000
UCBIORST EQU   UCBFLB                                                   01787000
UCBQISCE EQU   UCBFL1                                                   01788000
UCBACTV  EQU   UCBFL1                                                   01789000
UCBSAP   EQU   UCBFL1                                                   01790000
UCBNOTRC EQU   UCBCUB                                                   01791000
UCBPSNS  EQU   UCBFL1                                                   01792000
UCBUSING EQU   UCBPST                                                   01793000
UCBNOTRD EQU   UCBNRY                                                   01794000
UCBBUSYD EQU   UCBBSY                                                   01795000
UCBUA    EQU   UCBCHAN+1                                                01796000
UCBCHA   EQU   UCBCHAN                                                  01797000
UCBDADI  EQU   UCBSTAT                                                  01798000
UCBSYSR  EQU   UCBSTAT                                                  01799000
UCBPRES  EQU   UCBSTAT                                                  01800000
UCBALOC  EQU   UCBSTAT                                                  01801000
UCBUNLD  EQU   UCBSTAT                                                  01802000
UCBRESV  EQU   UCBSTAT                                                  01803000
UCBCHGS  EQU   UCBSTAT                                                  01804000
UCBONLI  EQU   UCBSTAT                                                  01805000
UCBID    EQU   UCBOB+2                                                  01806000
UCBALTPH EQU   UCBFL5                                                   01807000
UCBALTCU EQU   UCBFL5                                                   01808000
UCBNALOC EQU   UCBFL5                                                   01809000
UCBENVRD EQU   UCBFL5                                                   01810000
UCBVSDR  EQU   UCBFL5                                                   01811000
UCBSASK  EQU   UCBFL5                                                   01812000
UCBAMV   EQU   UCBAF                                                    01813000
UCBDCC   EQU   UCBFL5                                                   01814000
UCBMONT  EQU   UCBJBNR                                                  01815000
UCBRV011 EQU   UCBJBNR                                                  01816000
UCBRSV02 EQU   UCBJBNR                                                  01817000
UCBOLDSM EQU   UCBJBNR                                                  01818000
UCBRV003 EQU   UCBJBNR                                                  01819000
UCBDUC   EQU   UCBJBNR                                                  01820000
UCBJES3  EQU   UCBJBNR                                                  01821000
UCBVRDEV EQU   UCBJBNR                                                  01822000
UCBCMSEG EQU   UCBOB                                                    01823000
UCBPFXND EQU   UCB+512                                                  01824000
UCBIOQ   EQU   UCB+508                                                  01825000
UCBLOCK  EQU   UCB+504                                                  01826000
UCBPXST  EQU   UCB+504                                                  01827000
@NM00162 EQU   UCB                                                      01828000
@NM00153 EQU   IHADCB                                                   01829000
DEBAPPAD EQU   IEDQDEB+65                                               01830000
DEBEXSCL EQU   IEDQDEB+64                                               01831000
DEBDCBAD EQU   IEDQDEB+61                                               01832000
DEBPROTG EQU   IEDQDEB+60                                               01833000
DEBECBAD EQU   IEDQDEB+57                                               01834000
DEBPRIOR EQU   IEDQDEB+56                                               01835000
DEBUSRPG EQU   IEDQDEB+53                                               01836000
DEBSYSPG EQU   IEDQDEB+49                                               01837000
DEBOPATB EQU   IEDQDEB+48                                               01838000
DEBIRBAD EQU   IEDQDEB+45                                               01839000
DEBOFLGS EQU   IEDQDEB+44                                               01840000
DEBDEBAD EQU   IEDQDEB+41                                               01841000
DEBAMLNG EQU   IEDQDEB+40                                               01842000
DEBTCBAD EQU   IEDQDEB+37                                               01843000
DEBNMSUB EQU   IEDQDEB+36                                               01844000
@NM00152 EQU   DEBPRF+33                                                01845000
DEBDCBMK EQU   DEBPRF+28                                                01846000
DEBDSCBA EQU   DEBPRF+21                                                01847000
DEBWKARA EQU   DEBPRF+20                                                01848000
DEBPCIA  EQU   DEBAPVT+8                                                01849000
DEBSIOA  EQU   DEBAPVT+4                                                01850000
DEBEOEA  EQU   DEBAPVT                                                  01851000
TCXEND   EQU   IEDQTCXD+224                                             01852000
TCXNCPIO EQU   IEDQTCXD+220                                             01853000
TCXACTE8 EQU   TCXQE8                                                   01854000
TCXABEPL EQU   IEDQTCXD+212                                             01855000
TCXSRBS  EQU   IEDQTCXD+208                                             01856000
TCXSIOSB EQU   IEDQTCXD+204                                             01857000
TCXESAVE EQU   IEDQTCXD+132                                             01858000
TCXERPPM EQU   IEDQTCXD+128                                             01859000
TCXERPSV EQU   IEDQTCXD+116                                             01860000
TCXSATTN EQU   IEDQTCXD+112                                             01861000
@NM00151 EQU   TCXDSAVE+4                                               01862000
@NM00150 EQU   TCXDSAVE                                                 01863000
TCXPLCB  EQU   IEDQTCXD+100                                             01864000
TCXBITS  EQU   IEDQTCXD+98                                              01865000
TCXSCBSZ EQU   IEDQTCXD+97                                              01866000
TCXBIT1  EQU   IEDQTCXD+96                                              01867000
TCXCOMPT EQU   IEDQTCXD+92                                              01868000
TCXAVAIL EQU   IEDQTCXD+88                                              01869000
TCXBUFL  EQU   IEDQTCXD+84                                              01870000
TCXTOTE  EQU   TCXBUFA                                                  01871000
TCXCKPM  EQU   IEDQTCXD+79                                              01872000
TCXNCKPR EQU   IEDQTCXD+78                                              01873000
TCXSZAIB EQU   IEDQTCXD+76                                              01874000
TCXAIBC  EQU   IEDQTCXD+72                                              01875000
TCXPEBC  EQU   IEDQTCXD+68                                              01876000
TCXPEWAC EQU   IEDQTCXD+64                                              01877000
TCXQRQ   EQU   IEDQTCXD+60                                              01878000
TCXOCQ   EQU   IEDQTCXD+56                                              01879000
TCXPNTQ  EQU   IEDQTCXD+52                                              01880000
TCXPUTQ  EQU   IEDQTCXD+48                                              01881000
TCXGETQ  EQU   IEDQTCXD+44                                              01882000
TCXTSI   EQU   IEDQTCXD+40                                              01883000
TCXRPT   EQU   IEDQTCXD+36                                              01884000
TCXCC3TS EQU   IEDQTCXD+35                                              01885000
TCXAPDMP EQU   TCXFLAG1                                                 01886000
TCXAPPL  EQU   TCXFLAG1                                                 01887000
TCXRTM   EQU   TCXFLAG1                                                 01888000
TCXMCPCD EQU   TCXFLAG1                                                 01889000
TCXAUTH  EQU   TCXFLAG1                                                 01890000
TCXASCB  EQU   IEDQTCXD+28                                              01891000
TCXREADY EQU   IEDQTCXD+24                                              01892000
TCXPASWD EQU   IEDQTCXD+16                                              01893000
TCXDISP  EQU   IEDQTCXD+12                                              01894000
TCXTCB   EQU   IEDQTCXD+8                                               01895000
TCXAVT   EQU   IEDQTCXD                                                 01896000
CCWCOUNT EQU   CCW+6                                                    01897000
CCWRSV   EQU   CCW+5                                                    01898000
@NM00149 EQU   CCWFLAGS                                                 01899000
CCWIDA   EQU   CCWFLAGS                                                 01900000
CCWPCI   EQU   CCWFLAGS                                                 01901000
CCWSKIP  EQU   CCWFLAGS                                                 01902000
CCWSLI   EQU   CCWFLAGS                                                 01903000
CCWCC    EQU   CCWFLAGS                                                 01904000
CCWCD    EQU   CCWFLAGS                                                 01905000
CCWADDR  EQU   CCW+1                                                    01906000
CCWOPCDE EQU   CCW                                                      01907000
CVTLEVL  EQU   CVTRELNO+2                                               01908000
CVTNUMB  EQU   CVTRELNO                                                 01909000
CVTMDL   EQU   CVTFIX+250                                               01910000
@NM00148 EQU   CVTFIX+248                                               01911000
@NM00147 EQU   CVTFIX                                                   01912000
CVTRV482 EQU   CVTXTNT2+128                                             01913000
CVTRV481 EQU   CVTXTNT2+124                                             01914000
CVTRV480 EQU   CVTXTNT2+120                                             01915000
CVTRV479 EQU   CVTXTNT2+118                                             01916000
CVTRV478 EQU   CVTXTNT2+117                                             01917000
CVTRV477 EQU   CVTXTNT2+116                                             01918000
CVTRV476 EQU   CVTXTNT2+115                                             01919000
CVTRV475 EQU   CVTXTNT2+114                                             01920000
CVTRV474 EQU   CVTRV466                                                 01921000
CVTRV473 EQU   CVTRV466                                                 01922000
CVTRV472 EQU   CVTRV466                                                 01923000
CVTRV471 EQU   CVTRV466                                                 01924000
CVTRV470 EQU   CVTRV466                                                 01925000
CVTRV469 EQU   CVTRV466                                                 01926000
CVTRV468 EQU   CVTRV466                                                 01927000
CVTRV467 EQU   CVTRV466                                                 01928000
CVTRV465 EQU   CVTRV457                                                 01929000
CVTRV464 EQU   CVTRV457                                                 01930000
CVTRV463 EQU   CVTRV457                                                 01931000
CVTRV462 EQU   CVTRV457                                                 01932000
CVTRV461 EQU   CVTRV457                                                 01933000
CVTRV460 EQU   CVTRV457                                                 01934000
CVTRV459 EQU   CVTRV457                                                 01935000
CVTRV458 EQU   CVTRV457                                                 01936000
CVTRV456 EQU   CVTXTNT2+108                                             01937000
CVTRV455 EQU   CVTXTNT2+104                                             01938000
CVTRV454 EQU   CVTXTNT2+100                                             01939000
CVTRV453 EQU   CVTXTNT2+96                                              01940000
CVTRV452 EQU   CVTXTNT2+94                                              01941000
CVTRV451 EQU   CVTXTNT2+92                                              01942000
CVTRV450 EQU   CVTXTNT2+90                                              01943000
CVTRV449 EQU   CVTXTNT2+88                                              01944000
CVTRV448 EQU   CVTXTNT2+87                                              01945000
CVTRV447 EQU   CVTXTNT2+86                                              01946000
CVTRV446 EQU   CVTRV438                                                 01947000
CVTRV445 EQU   CVTRV438                                                 01948000
CVTRV444 EQU   CVTRV438                                                 01949000
CVTRV443 EQU   CVTRV438                                                 01950000
CVTRV442 EQU   CVTRV438                                                 01951000
CVTRV441 EQU   CVTRV438                                                 01952000
CVTRV440 EQU   CVTRV438                                                 01953000
CVTRV439 EQU   CVTRV438                                                 01954000
CVTRV437 EQU   CVTRV429                                                 01955000
CVTRV436 EQU   CVTRV429                                                 01956000
CVTRV435 EQU   CVTRV429                                                 01957000
CVTRV434 EQU   CVTRV429                                                 01958000
CVTRV433 EQU   CVTRV429                                                 01959000
CVTRV432 EQU   CVTRV429                                                 01960000
CVTRV431 EQU   CVTRV429                                                 01961000
CVTRV430 EQU   CVTRV429                                                 01962000
CVTRV428 EQU   CVTXTNT2+80                                              01963000
CVTRV427 EQU   CVTXTNT2+76                                              01964000
CVTRV426 EQU   CVTXTNT2+72                                              01965000
CVTRV425 EQU   CVTXTNT2+68                                              01966000
CVTATACT EQU   CVTATCVT                                                 01967000
CVTRV423 EQU   CVTXTNT2+62                                              01968000
CVTRV422 EQU   CVTXTNT2+60                                              01969000
CVTRV421 EQU   CVTXTNT2+58                                              01970000
CVTRV420 EQU   CVTXTNT2+56                                              01971000
CVTRV419 EQU   CVTXTNT2+55                                              01972000
CVTRV418 EQU   CVTXTNT2+54                                              01973000
CVTRV417 EQU   CVTRV409                                                 01974000
CVTRV416 EQU   CVTRV409                                                 01975000
CVTRV415 EQU   CVTRV409                                                 01976000
CVTRV414 EQU   CVTRV409                                                 01977000
CVTRV413 EQU   CVTRV409                                                 01978000
CVTRV412 EQU   CVTRV409                                                 01979000
CVTRV411 EQU   CVTRV409                                                 01980000
CVTRV410 EQU   CVTRV409                                                 01981000
CVTRV408 EQU   CVTRV400                                                 01982000
CVTRV407 EQU   CVTRV400                                                 01983000
CVTRV406 EQU   CVTRV400                                                 01984000
CVTRV405 EQU   CVTRV400                                                 01985000
CVTRV404 EQU   CVTRV400                                                 01986000
CVTRV403 EQU   CVTRV400                                                 01987000
CVTRV402 EQU   CVTRV400                                                 01988000
CVTRV401 EQU   CVTRV400                                                 01989000
CVTICB   EQU   CVTXTNT2+48                                              01990000
CVTSKTA  EQU   CVTXTNT2+44                                              01991000
CVTSHSB  EQU   CVTSHS                                                   01992000
CVTRSV98 EQU   CVTXTNT2+36                                              01993000
CVTRSV97 EQU   CVTXTNT2+34                                              01994000
CVTRSV96 EQU   CVTXTNT2+32                                              01995000
CVTOLTEP EQU   CVTXTNT2+28                                              01996000
CVTQIDA  EQU   CVTQID+1                                                 01997000
CVTRSV95 EQU   CVTQID                                                   01998000
CVTRSV94 EQU   CVTXTNT2+20                                              01999000
CVTRSV93 EQU   CVTXTNT2+16                                              02000000
CVTRSV92 EQU   CVTXTNT2+12                                              02001000
CVTDEBVR EQU   CVTXTNT2+8                                               02002000
CVTRSV91 EQU   CVTXTNT2+6                                               02003000
CVTRSV9H EQU   CVTFLGBT                                                 02004000
CVTRSV9G EQU   CVTFLGBT                                                 02005000
CVTRSV9F EQU   CVTFLGBT                                                 02006000
CVTRSV9E EQU   CVTFLGBT                                                 02007000
CVTRSV9D EQU   CVTFLGBT                                                 02008000
CVTRSV9C EQU   CVTFLGBT                                                 02009000
CVTVME   EQU   CVTFLGBT                                                 02010000
CVTNPE   EQU   CVTFLGBT                                                 02011000
CVTNUCLS EQU   CVTXTNT2+4                                               02012000
CVTDSSVA EQU   CVTDSSV+1                                                02013000
CVTRSV89 EQU   CVTDSSV                                                  02014000
CVTRSV88 EQU   CVTXTNT1+8                                               02015000
CVTRSV87 EQU   CVTXTNT1+4                                               02016000
CVTFACHN EQU   CVTXTNT1                                                 02017000
CVTRV488 EQU   CVTMAP+412                                               02018000
CVTRV487 EQU   CVTMAP+408                                               02019000
CVTRV486 EQU   CVTMAP+404                                               02020000
CVTRV485 EQU   CVTMAP+400                                               02021000
CVTACTAP EQU   CVTMAP+396                                               02022000
CVTAUTH  EQU   CVTMAP+392                                               02023000
CVTATMCA EQU   CVTATMCT+1                                               02024000
CVTATMST EQU   CVTATMCT                                                 02025000
CVTRSV61 EQU   CVTMAP+384                                               02026000
CVTVOLT1 EQU   CVTVOLM1+1                                               02027000
CVTVOLI1 EQU   CVTVOLF1                                                 02028000
CVTSTOA  EQU   CVTMAP+376                                               02029000
CVTRSV58 EQU   CVTMAP+374                                               02030000
CVTRSV57 EQU   CVTMAP+372                                               02031000
CVTDDCE  EQU   CVTMAP+368                                               02032000
CVTPNWFR EQU   CVTMAP+364                                               02033000
CVTSMF   EQU   CVTMAP+360                                               02034000
CVTSULK  EQU   CVTMAP+358                                               02035000
CVTSLKO  EQU   CVTSYSK                                                  02036000
CVTSLKP  EQU   CVTSYSK                                                  02037000
CVTSLKQ  EQU   CVTSYSK                                                  02038000
CVTSLKR  EQU   CVTSYSK                                                  02039000
CVTRSV56 EQU   CVTSYSK                                                  02040000
CVTRSV55 EQU   CVTSYSK                                                  02041000
CVTRSV54 EQU   CVTSYSK                                                  02042000
CVTRSV53 EQU   CVTSYSK                                                  02043000
CVTRSV52 EQU   CVTA1F1                                                  02044000
CVTRSV51 EQU   CVTA1F1                                                  02045000
CVTRSV50 EQU   CVTA1F1                                                  02046000
CVTRSV49 EQU   CVTA1F1                                                  02047000
CVTRSV48 EQU   CVTA1F1                                                  02048000
CVTRSV47 EQU   CVTA1F1                                                  02049000
CVTSRSW  EQU   CVTA1F1                                                  02050000
CVTPFSW  EQU   CVTA1F1                                                  02051000
CVTPCVT  EQU   CVTMAP+352                                               02052000
CVTRSV46 EQU   CVTMAP+344                                               02053000
CVTRSV45 EQU   CVTMAP+340                                               02054000
CVTRSV44 EQU   CVTMAP+338                                               02055000
CVTRSV43 EQU   CVTMAP+336                                               02056000
CVTHJESA EQU   CVTHJES+1                                                02057000
CVTRSV42 EQU   CVTHJES                                                  02058000
CVTEXT2A EQU   CVTEXT2+1                                                02059000
CVTRSV41 EQU   CVTEXT2                                                  02060000
CVTAPFA  EQU   CVTAPF+1                                                 02061000
CVTRSV40 EQU   CVTAPF                                                   02062000
CVTRV518 EQU   CVTINTLA                                                 02063000
CVTRV517 EQU   CVTERPV                                                  02064000
CVTEORM  EQU   CVTMAP+312                                               02065000
CVTMCHPR EQU   CVTMAP+308                                               02066000
CVTTZ    EQU   CVTMAP+304                                               02067000
CVTJEPS  EQU   CVTMAP+300                                               02068000
CVTJESCT EQU   CVTMAP+296                                               02069000
CVTMODE  EQU   CVTMAP+292                                               02070000
CVTPTRV  EQU   CVTMAP+288                                               02071000
CVTREAL  EQU   CVTMAP+284                                               02072000
CVTRSV39 EQU   CVTMAP+280                                               02073000
CVTRSV38 EQU   CVTMAP+276                                               02074000
CVTDMSRA EQU   CVTDMSR+1                                                02075000
CVTRV634 EQU   CVTDMSRF                                                 02076000
CVTRV633 EQU   CVTDMSRF                                                 02077000
CVTRV632 EQU   CVTDMSRF                                                 02078000
CVTRV631 EQU   CVTDMSRF                                                 02079000
CVTRV630 EQU   CVTDMSRF                                                 02080000
CVTRV629 EQU   CVTDMSRF                                                 02081000
CVTUDUMP EQU   CVTDMSRF                                                 02082000
CVTSDUMP EQU   CVTDMSRF                                                 02083000
CVTQMSGA EQU   CVTQMSG+1                                                02084000
CVTRSV36 EQU   CVTQMSG                                                  02085000
CVTAMFF  EQU   CVTMAP+264                                               02086000
CVTPURGA EQU   CVTPURG+1                                                02087000
CVTRSV35 EQU   CVTPURG                                                  02088000
CVTCBSP  EQU   CVTMAP+256                                               02089000
CVTATERA EQU   CVTATER+1                                                02090000
CVTSYST  EQU   CVTATER                                                  02091000
CVTVOLT2 EQU   CVTTAT                                                   02092000
CVTVOLI2 EQU   CVTVOLF2                                                 02093000
CVTAQAVB EQU   CVTAQAVT+1                                               02094000
CVTRSV34 EQU   CVTTCMFG                                                 02095000
CVTRSV33 EQU   CVTTCMFG                                                 02096000
CVTRSV32 EQU   CVTTCMFG                                                 02097000
CVTRSV31 EQU   CVTTCMFG                                                 02098000
CVTRSV30 EQU   CVTTCMFG                                                 02099000
CVTRSV29 EQU   CVTTCMFG                                                 02100000
CVTRSV28 EQU   CVTTCMFG                                                 02101000
CVTTCRDY EQU   CVTTCMFG                                                 02102000
CVTGTFA  EQU   CVTGTF+1                                                 02103000
CVTRSV27 EQU   CVTGTFST                                                 02104000
CVTRNIO  EQU   CVTGTFST                                                 02105000
CVTUSR   EQU   CVTGTFST                                                 02106000
CVTRV318 EQU   CVTFORM                                                  02107000
CVTRV317 EQU   CVTTMODE                                                 02108000
CVTRV316 EQU   CVTSTATE                                                 02109000
CVTRV315 EQU   CVTGTFS                                                  02110000
CVTGTFAV EQU   CVTGTFS                                                  02111000
CVT0SCR1 EQU   CVTMAP+232                                               02112000
CVTRV515 EQU   CVTMAP+228                                               02113000
CVTRMS   EQU   CVTMAP+224                                               02114000
CVTPATCH EQU   CVTMAP+220                                               02115000
CVTTSCE  EQU   CVTMAP+216                                               02116000
CVTLNKSC EQU   CVTMAP+214                                               02117000
CVTQABST EQU   CVTMAP+212                                               02118000
CVTMDLDS EQU   CVTMAP+208                                               02119000
CVTUSER  EQU   CVTMAP+204                                               02120000
CVTABEND EQU   CVTMAP+200                                               02121000
CVTSMCA  EQU   CVTMAP+196                                               02122000
CVTRSV18 EQU   CVTMAP+192                                               02123000
CVTQLPAQ EQU   CVTMAP+188                                               02124000
CVTQCDSR EQU   CVTMAP+184                                               02125000
CVTRSV17 EQU   CVTOPTB                                                  02126000
CVTRSV16 EQU   CVTOPTB                                                  02127000
CVTFP    EQU   CVTOPTB                                                  02128000
CVTAPTHR EQU   CVTOPTB                                                  02129000
CVTNLOG  EQU   CVTOPTB                                                  02130000
CVTTOD   EQU   CVTOPTB                                                  02131000
CVTCTIMS EQU   CVTOPTB                                                  02132000
CVTPROT  EQU   CVTOPTB                                                  02133000
CVTXPFP  EQU   CVTOPTA                                                  02134000
CVTASCII EQU   CVTOPTA                                                  02135000
CVTRSV13 EQU   CVTOPTA                                                  02136000
CVTRSV12 EQU   CVTOPTA                                                  02137000
CVTNIP   EQU   CVTOPTA                                                  02138000
CVTDDR   EQU   CVTOPTA                                                  02139000
CVTAPR   EQU   CVTOPTA                                                  02140000
CVTCCH   EQU   CVTOPTA                                                  02141000
CVTSNCTR EQU   CVTMAP+180                                               02142000
CVTQMWR  EQU   CVTMAP+176                                               02143000
CVTQOCR  EQU   CVTMAP+172                                               02144000
CVT1EF00 EQU   CVTMAP+168                                               02145000
CVTMZ00  EQU   CVTMAP+164                                               02146000
CVTHEAD  EQU   CVTMAP+160                                               02147000
CVTRSV11 EQU   CVTMAP+156                                               02148000
CVT0PT01 EQU   CVTMAP+152                                               02149000
CVTMSER  EQU   CVTMAP+148                                               02150000
CVTRV516 EQU   CVTIERLC                                                 02151000
CVTILCH  EQU   CVTMAP+140                                               02152000
CVT0DS   EQU   CVTMAP+136                                               02153000
CVTFBOSV EQU   CVTMAP+132                                               02154000
CVTNUCB  EQU   CVTMAP+128                                               02155000
CVTIOQET EQU   CVTMAP+120                                               02156000
CVTDCBA  EQU   CVTMAP+117                                               02157000
CVTMVS2  EQU   CVTDCB                                                   02158000
CVT6DAT  EQU   CVTDCB                                                   02159000
CVT4MPS  EQU   CVTDCB                                                   02160000
CVTRSV09 EQU   CVTDCB                                                   02161000
CVT4MS1  EQU   CVTDCB                                                   02162000
CVT2SPS  EQU   CVTDCB                                                   02163000
CVT1SSS  EQU   CVTDCB                                                   02164000
CVTRSV08 EQU   CVTDCB                                                   02165000
CVTSTB   EQU   CVTMAP+112                                               02166000
CVTQTD00 EQU   CVTMAP+108                                               02167000
CVTQTE00 EQU   CVTMAP+104                                               02168000
CVTCUCB  EQU   CVTMAP+100                                               02169000
CVTSJQ   EQU   CVTMAP+96                                                02170000
CVTPBLDL EQU   CVTMAP+92                                                02171000
CVTTPC   EQU   CVTMAP+88                                                02172000
CVTEXIT  EQU   CVTMAP+80                                                02173000
CVT0FN00 EQU   CVTMAP+76                                                02174000
CVTDARA  EQU   CVTDAR+1                                                 02175000
CVTRSV07 EQU   CVTFLGS1                                                 02176000
CVTRSV06 EQU   CVTFLGS1                                                 02177000
CVTRSV05 EQU   CVTFLGS1                                                 02178000
CVTRSV04 EQU   CVTFLGS1                                                 02179000
CVTRSV03 EQU   CVTFLGS1                                                 02180000
CVTRSV02 EQU   CVTFLGS1                                                 02181000
CVTRSV01 EQU   CVTFLGS1                                                 02182000
CVTDMPLK EQU   CVTFLGS1                                                 02183000
CVTXITP  EQU   CVTMAP+68                                                02184000
CVTZDTAB EQU   CVTMAP+64                                                02185000
CVTMSLT  EQU   CVTMAP+60                                                02186000
CVTDATE  EQU   CVTMAP+56                                                02187000
CVTBTERM EQU   CVTMAP+52                                                02188000
CVTSYSAD EQU   CVTMAP+48                                                02189000
CVTXTLER EQU   CVTMAP+44                                                02190000
CVTILK2  EQU   CVTMAP+40                                                02191000
CVTILK1  EQU   CVTMAP+36                                                02192000
CVTPRLTV EQU   CVTMAP+32                                                02193000
CVTPCNVT EQU   CVTMAP+28                                                02194000
CVT0VL00 EQU   CVTMAP+24                                                02195000
CVTXAPG  EQU   CVTMAP+20                                                02196000
CVTBUF   EQU   CVTMAP+16                                                02197000
CVTJOB   EQU   CVTMAP+12                                                02198000
CVTLINK  EQU   CVTMAP+8                                                 02199000
CVT0EF00 EQU   CVTMAP+4                                                 02200000
CVTTCBP  EQU   CVTMAP                                                   02201000
CVT      EQU   CVTMAP                                                   02202000
LCBERADR EQU   LCBXRADR+1                                               02203000
LCBPCIRC EQU   LCBXRADR                                                 02204000
LCBDCT3  EQU   LCBXDCT+2                                                02205000
LCBDCT2  EQU   LCBXDCT+1                                                02206000
LCBDCT1  EQU   LCBXDCT                                                  02207000
@NM00146 EQU   LCBXFLAG                                                 02208000
LCBERPND EQU   LCBXFLAG                                                 02209000
LCBSRCPF EQU   LCBXFLAG                                                 02210000
LCBGPCTV EQU   LCBXFLAG                                                 02211000
@NM00145 EQU   LCBXFLAG                                                 02212000
@NM00144 EQU   LCBXFLAG                                                 02213000
@NM00143 EQU   LCBXFLAG                                                 02214000
@NM00142 EQU   LCBXFLAG                                                 02215000
LCBCCW10 EQU   LCBCPA+72                                                02216000
LCBCCW9  EQU   LCBCPA+64                                                02217000
LCBCCW8  EQU   LCBCPA+56                                                02218000
LCBCP    EQU   LCBQEBPL+4                                               02219000
LCBSIO   EQU   LCBQEBPL                                                 02220000
LCBCCW4  EQU   LCBCPA+24                                                02221000
LCBCCW2  EQU   LCBCPA+8                                                 02222000
@NM00127 EQU   LCBERCCW+16                                              02223000
LCBATL05 EQU   LCBERCCW+8                                               02224000
@NM00126 EQU   LCBERCCW                                                 02225000
LCBCSWSV EQU   LCBSAVSN+1                                               02226000
LCBSNSV  EQU   LCBSAVSN                                                 02227000
LCBBFSNS EQU   LCBRSPSV                                                 02228000
LCBWAITC EQU   LCBTPCD+5                                                02229000
LCBINPAK EQU   LCBSTAT6                                                 02230000
LCBMHBID EQU   LCBSTAT6                                                 02231000
LCBRTRRO EQU   LCBSTAT6                                                 02232000
LCBHDRPD EQU   LCBSTAT6                                                 02233000
LCBCHN   EQU   LCBSTAT6                                                 02234000
LCBBFRSV EQU   LCBTPCD+1                                                02235000
@NM00125 EQU   LCBSTAT5                                                 02236000
LCBLUS   EQU   LCBSTAT5                                                 02237000
LCBLUNIT EQU   LCBSTAT5                                                 02238000
LCBPERM  EQU   LCBSTAT5                                                 02239000
LCBNXCMD EQU   LCBBFRW                                                  02240000
LCBERMSK EQU   LCBOBRCH                                                 02241000
LCBSCBA  EQU   IEDQLCB+93                                               02242000
LCBOLT   EQU   LCBMSGFM                                                 02243000
LCBEOT   EQU   LCBMSGFM                                                 02244000
LCBENQ   EQU   LCBMSGFM                                                 02245000
LCBTTD   EQU   LCBMSGFM                                                 02246000
LCBRSTRT EQU   LCBMSGFM                                                 02247000
LCBVSTRT EQU   LCBMSGFM                                                 02248000
LCBACKI  EQU   LCBMSGFM                                                 02249000
LCBNAK   EQU   LCBMSGFM                                                 02250000
LCBTTCIN EQU   IEDQLCB+90                                               02251000
@NM00124 EQU   LCBRBCT2                                                 02252000
LCBDCNT  EQU   LCBRBCT2                                                 02253000
LCBRBCT1 EQU   LCBERBCT                                                 02254000
LCBERBCH EQU   IEDQLCB+85                                               02255000
LCBCOMPL EQU   LCBDLNKN                                                 02256000
LCBPRCPG EQU   LCBERBST                                                 02257000
LCBERROR EQU   LCBERBST                                                 02258000
LCBLOGDV EQU   LCBERBST                                                 02259000
LCBINQ   EQU   LCBERBST                                                 02260000
LCBRDERR EQU   LCBERBST                                                 02261000
LCBEOMSG EQU   LCBERBST                                                 02262000
LCBMSG   EQU   LCBERBST                                                 02263000
LCBERBLK EQU   IEDQLCB+81                                               02264000
LCBERBPY EQU   IEDQLCB+80                                               02265000
LCBERBQB EQU   LCBERB+1                                                 02266000
LCBERBKY EQU   LCBERB                                                   02267000
LCBRECAD EQU   IEDQLCB+73                                               02268000
@NM00123 EQU   LCBTSTSW                                                 02269000
@NM00122 EQU   LCBTSTSW                                                 02270000
@NM00121 EQU   LCBTSTSW                                                 02271000
@NM00120 EQU   LCBTSTSW                                                 02272000
@NM00119 EQU   LCBTSTSW                                                 02273000
@NM00118 EQU   LCBTSTSW                                                 02274000
@NM00117 EQU   LCBTSTSW                                                 02275000
LCBCONCT EQU   LCBTSTSW                                                 02276000
LCBRESP  EQU   LCBSTAT2                                                 02277000
LCBATTN  EQU   LCBSYNC                                                  02278000
LCBNEGRP EQU   LCBSTAT2                                                 02279000
LCBSNDPR EQU   LCBSTAT2                                                 02280000
LCBCONNN EQU   LCBBEOTN                                                 02281000
LCBMSGNN EQU   LCBSTAT2                                                 02282000
LCBTRACE EQU   LCBSTAT2                                                 02283000
LCBSENDN EQU   LCBSTAT1                                                 02284000
LCBRECVN EQU   LCBSTAT1                                                 02285000
LCBFREEN EQU   LCBSTAT1                                                 02286000
LCBCONT  EQU   LCBSTAT1                                                 02287000
LCBINITN EQU   LCBSTAT1                                                 02288000
LCBOCNI  EQU   LCBSTAT1                                                 02289000
LCBOCWTN EQU   LCBSTAT1                                                 02290000
LCBRCLLN EQU   LCBSTAT1                                                 02291000
LCBRECOF EQU   IEDQLCB+68                                               02292000
LCBUCBX  EQU   IEDQLCB+64                                               02293000
LCBTTBIN EQU   LCBERRCT                                                 02294000
@NM00116 EQU   LCBINCAM                                                 02295000
LCBGETMN EQU   LCBINCAM                                                 02296000
@NM00115 EQU   LCBRESTR+1                                               02297000
LCBCMDSV EQU   LCBRESTR                                                 02298000
LCBPCILK EQU   LCBDCBPT                                                 02299000
LCBSTART EQU   LCBIOBSN+16                                              02300000
LCBAP4OL EQU   LCBSIOCC                                                 02301000
LCBAP3OL EQU   LCBSIOCC                                                 02302000
LCBAP2OL EQU   LCBSIOCC                                                 02303000
LCBAP1OL EQU   LCBSIOCC                                                 02304000
LCBSIOC2 EQU   LCBSIOCC                                                 02305000
LCBSIOC1 EQU   LCBSIOCC                                                 02306000
@NM00114 EQU   LCBSIOCC                                                 02307000
LCBCSWRC EQU   LCBCSW+5                                                 02308000
LCBCSCHC EQU   LCBCSWCS                                                 02309000
LCBCSICC EQU   LCBCSWCS                                                 02310000
LCBCSCCC EQU   LCBCSWCS                                                 02311000
LCBCSCDC EQU   LCBCSWCS                                                 02312000
LCBCSPTC EQU   LCBCSWCS                                                 02313000
LCBCSPGC EQU   LCBCSWCS                                                 02314000
LCBCSIL  EQU   LCBCSWCS                                                 02315000
LCBCSPCI EQU   LCBCSWCS                                                 02316000
LCBUSUE  EQU   LCBCSWUS                                                 02317000
LCBUSUC  EQU   LCBCSWUS                                                 02318000
LCBUSDE  EQU   LCBCSWUS                                                 02319000
LCBUSCE  EQU   LCBCSWUS                                                 02320000
LCBUSBSY EQU   LCBCSWUS                                                 02321000
LCBUSCUE EQU   LCBCSWUS                                                 02322000
LCBUSSM  EQU   LCBCSWUS                                                 02323000
LCBUSAT  EQU   LCBCSWUS                                                 02324000
LCBCSWCA EQU   LCBCSW                                                   02325000
LCBOBR   EQU   LCBFLAG3                                                 02326000
LCBOBRRD EQU   LCBFLAG3                                                 02327000
LCBIOMSG EQU   LCBFLAG3                                                 02328000
LCBSOHC  EQU   LCBFLAG3                                                 02329000
LCBRLAD  EQU   LCBFLAG3                                                 02330000
LCBSOHR  EQU   LCBFLAG3                                                 02331000
@NM00113 EQU   LCBFLAG3                                                 02332000
LCBECBPT EQU   LCBIOBSN+4                                               02333000
LCBECBCC EQU   LCBIOBSN+3                                               02334000
LCBSENS1 EQU   LCBSNS+1                                                 02335000
LCBABORT EQU   LCBTMOUT                                                 02336000
LCBNOTIN EQU   LCBLOSDT                                                 02337000
LCBOVRUN EQU   LCBSENS0                                                 02338000
LCBDATCK EQU   LCBSENS0                                                 02339000
LCBEQUCK EQU   LCBSENS0                                                 02340000
LCBBUSCK EQU   LCBSENS0                                                 02341000
LCBINTRQ EQU   LCBSENS0                                                 02342000
LCBCMDRJ EQU   LCBSENS0                                                 02343000
LCBFLAG2 EQU   LCBIOBSN                                                 02344000
@NM00112 EQU   LCBFLAG1                                                 02345000
LCBUNREL EQU   LCBFLAG1                                                 02346000
LCBEXCPN EQU   LCBFLAG1                                                 02347000
@NM00111 EQU   LCBFLAG1                                                 02348000
LCBERPIN EQU   LCBFLAG1                                                 02349000
@NM00110 EQU   LCBFLAG1                                                 02350000
LCBFSBFR EQU   LCBMHA                                                   02351000
LCBISZE  EQU   IEDQLCB+28                                               02352000
LCBLNENT EQU   LCBSCBDA+1                                               02353000
@NM00109 EQU   LCBSCBDA                                                 02354000
LCBCPGMH EQU   LCBSTAT4                                                 02355000
LCBREAL  EQU   LCBPHASE                                                 02356000
@NM00108 EQU   LCBSTAT4                                                 02357000
LCBACTRQ EQU   LCBSTAT4                                                 02358000
LCBIPLRQ EQU   LCBSTAT4                                                 02359000
LCBDACRQ EQU   LCBSTAT4                                                 02360000
LCBDMPRQ EQU   LCBSTAT4                                                 02361000
@NM00107 EQU   LCBLKMDE                                                 02362000
LCBLOCKI EQU   LCBLKMDE                                                 02363000
LCBLOCKR EQU   LCBLKMDE                                                 02364000
LCBHMFLG EQU   LCBLKMDE                                                 02365000
LCBBDFLG EQU   LCBLKMDE                                                 02366000
@NM00106 EQU   LCBINSRC                                                 02367000
LCBABRTN EQU   LCBCHAIN                                                 02368000
LCBCTLMD EQU   LCBTETEN                                                 02369000
LCBBFRSZ EQU   LCBCHAIN                                                 02370000
LCBUREQN EQU   LCBCHAIN                                                 02371000
LCBNORTY EQU   LCBCHAIN                                                 02372000
LCBERMSG EQU   LCBCHAIN                                                 02373000
LCBEXCP  EQU   LCBCHAIN                                                 02374000
LCBINVRQ EQU   LCBSCRNN                                                 02375000
LCB2741N EQU   LCBTSOB                                                  02376000
LCBINHBN EQU   LCBTSOB                                                  02377000
LCBCIRCD EQU   LCBTSOB                                                  02378000
LCBPREP  EQU   LCBTSOB                                                  02379000
LCBSOPL  EQU   LCBTSOB                                                  02380000
LCBSATRD EQU   LCBTSOB                                                  02381000
LCBTSBUF EQU   LCBTSOB                                                  02382000
LCBWRBRK EQU   LCBTSOB                                                  02383000
LCBTDL   EQU   IEDQLCB+18                                               02384000
LCBEOLTD EQU   IEDQLCB+16                                               02385000
LCBRSPRI EQU   IEDQLCB+12                                               02386000
LCBSTCBA EQU   IEDQLCB+9                                                02387000
LCBRSKEY EQU   IEDQLCB+8                                                02388000
LCBLINK  EQU   LCBRCB+5                                                 02389000
LCBPRI   EQU   LCBRCB+4                                                 02390000
LCBQCBA  EQU   LCBRCB+1                                                 02391000
LCBKEY   EQU   LCBRCB                                                   02392000
SAVTLLCB EQU   IEDNSVTD+316                                             02393000
SAVTBITN EQU   IEDNSVTD+312                                             02394000
@NM00105 EQU   SAVTCKQB+8                                               02395000
@NM00104 EQU   SAVTCKEC+1                                               02396000
@NM00103 EQU   SAVTCKCC                                                 02397000
SAVTCKPO EQU   SAVTCKCC                                                 02398000
SAVTCKWA EQU   SAVTCKCC                                                 02399000
SAVTCKCH EQU   SAVTCKTB+1                                               02400000
SAVTCKVT EQU   SAVTCKTB                                                 02401000
@NM00102 EQU   IEDNSVTD+297                                             02402000
SAVTRDFG EQU   SAVTRDRV+12                                              02403000
@NM00101 EQU   SAVTRDRV+5                                               02404000
SAVTRDPY EQU   SAVTRDRV+4                                               02405000
SAVTRDQB EQU   SAVTRDRV+1                                               02406000
SAVTRDKY EQU   SAVTRDRV                                                 02407000
SAVTNID  EQU   IEDNSVTD+280                                             02408000
SAVTDVAS EQU   IEDNSVTD+276                                             02409000
SAVTPLSZ EQU   IEDNSVTD+274                                             02410000
@NM00100 EQU   IEDNSVTD+273                                             02411000
SAVTSUBL EQU   IEDNSVTD+272                                             02412000
@NM00099 EQU   SAVTZELM+1                                               02413000
SAVTSUBM EQU   SAVTZELM                                                 02414000
SAVTMHDX EQU   IEDNSVTD+268                                             02415000
SAVTNAT1 EQU   IEDNSVTD+266                                             02416000
SAVTSH20 EQU   IEDNSVTD+264                                             02417000
SAVTLCBS EQU   IEDNSVTD+260                                             02418000
SAVTRNMP EQU   IEDNSVTD+256                                             02419000
SAVTNAX  EQU   IEDNSVTD+248                                             02420000
SAVTSUBV EQU   IEDNSVTD+247                                             02421000
SAVTSUBA EQU   IEDNSVTD+246                                             02422000
SAVTSIBC EQU   IEDNSVTD+244                                             02423000
SAVTBSM  EQU   IEDNSVTD+240                                             02424000
SAVTSCPT EQU   SAVTTCPU                                                 02425000
SAVTRQTG EQU   IEDNSVTD+236                                             02426000
SAVTRQCH EQU   IEDNSVTD+232                                             02427000
SAVTMAND EQU   IEDNSVTD+228                                             02428000
SAVTSPLN EQU   IEDNSVTD+224                                             02429000
SAVTNADL EQU   IEDNSVTD+222                                             02430000
SAVTNATL EQU   IEDNSVTD+220                                             02431000
SAVTMHTB EQU   IEDNSVTD+216                                             02432000
SAVTSSMH EQU   IEDNSVTD+212                                             02433000
SAVTQRS  EQU   IEDNSVTD+208                                             02434000
SAVTRQIN EQU   IEDNSVTD+204                                             02435000
SAVTDFCO EQU   IEDNSVTD+200                                             02436000
SAVTSAO  EQU   IEDNSVTD+196                                             02437000
SAVTSARI EQU   IEDNSVTD+192                                             02438000
SAVTSAC  EQU   IEDNSVTD+188                                             02439000
SAVTSAI  EQU   IEDNSVTD+184                                             02440000
SAVTCSCI EQU   IEDNSVTD+180                                             02441000
SAVTSSRP EQU   IEDNSVTD+176                                             02442000
SAVTSSRQ EQU   IEDNSVTD+172                                             02443000
SAVTSCLU EQU   IEDNSVTD+168                                             02444000
SAVTXTRQ EQU   IEDNSVTD+164                                             02445000
SAVTMVBF EQU   IEDNSVTD+160                                             02446000
@NM00098 EQU   IEDNSVTD+148                                             02447000
SAVTIPCQ EQU   IEDNSVTD+144                                             02448000
@NM00097 EQU   IEDNSVTD+136                                             02449000
SAVTXFMI EQU   IEDNSVTD+132                                             02450000
@NM00096 EQU   IEDNSVTD+124                                             02451000
SAVTXFMO EQU   IEDNSVTD+120                                             02452000
@NM00095 EQU   IEDNSVTD+116                                             02453000
SAVTSSSR EQU   IEDNSVTD+112                                             02454000
SAVTSCPQ EQU   IEDNSVTD+108                                             02455000
SAVTSLCB EQU   IEDNSVTD+104                                             02456000
SAVTLUSR EQU   IEDNSVTD+100                                             02457000
@NM00094 EQU   SAVTLUSQ+8                                               02458000
SAVTLUSP EQU   SAVTLUSQ+4                                               02459000
SAVTLUSB EQU   SAVTLUSQ                                                 02460000
@NM00093 EQU   IEDNSVTD+84                                              02461000
SAVTSAT  EQU   IEDNSVTD+80                                              02462000
SAVTNAT  EQU   IEDNSVTD+76                                              02463000
SAVTCLUP EQU   IEDNSVTD+72                                              02464000
SAVTPIUT EQU   IEDNSVTD+68                                              02465000
SAVTRNTA EQU   IEDNSVTD+64                                              02466000
SAVTDNIR EQU   IEDNSVTD+60                                              02467000
SAVTCNIR EQU   IEDNSVTD+56                                              02468000
SAVTSRTN EQU   IEDNSVTD+48                                              02469000
SAVTSREQ EQU   IEDNSVTD+44                                              02470000
SAVTFAIL EQU   IEDNSVTD+42                                              02471000
SAVTSUSE EQU   IEDNSVTD+40                                              02472000
SAVTSIB  EQU   IEDNSVTD+36                                              02473000
SAVTPRTN EQU   IEDNSVTD+32                                              02474000
@NM00092 EQU   IEDNSVTD+28                                              02475000
SAVTWH20 EQU   IEDNSVTD+26                                              02476000
SAVTPWT  EQU   IEDNSVTD+24                                              02477000
SAVTPRTQ EQU   IEDNSVTD+20                                              02478000
SAVTPREQ EQU   IEDNSVTD+16                                              02479000
SAVTPH20 EQU   IEDNSVTD+14                                              02480000
SAVTPUSE EQU   IEDNSVTD+12                                              02481000
SAVTPLCB EQU   IEDNSVTD+8                                               02482000
SAVTPOOL EQU   IEDNSVTD+4                                               02483000
SAVTPRMT EQU   SAVTDIAF                                                 02484000
SAVTVIRT EQU   SAVTDIAF                                                 02485000
AVTCPBNO EQU   IEDQAVTD+1244                                            02486000
AVTHRESS EQU   IEDQAVTD+1243                                            02487000
@NM00091 EQU   IEDQAVTD+1242                                            02488000
@NM00090 EQU   IEDQAVTD+1241                                            02489000
@NM00089 EQU   IEDQAVTD+1240                                            02490000
@NM00088 EQU   IEDQAVTD+1237                                            02491000
@NM00087 EQU   IEDQAVTD+1236                                            02492000
AVTHRESE EQU   @NM00086                                                 02493000
AVTRADDR EQU   IEDQAVTD+1228                                            02494000
AVTNADDR EQU   IEDQAVTD+1224                                            02495000
AVTHRESN EQU   IEDQAVTD+1220                                            02496000
AVTVOLRN EQU   IEDQAVTD+1216                                            02497000
AVTTOTNN EQU   IEDQAVTD+1212                                            02498000
AVTTRCYN EQU   IEDQAVTD+1208                                            02499000
AVTRCTRN EQU   IEDQAVTD+1204                                            02500000
AVTNOVON EQU   IEDQAVTD+1200                                            02501000
AVTADEBN EQU   IEDQAVTD+1196                                            02502000
AVTVOLRR EQU   IEDQAVTD+1192                                            02503000
AVTTOTNR EQU   IEDQAVTD+1188                                            02504000
AVTTRCYR EQU   IEDQAVTD+1184                                            02505000
AVTRCTRR EQU   IEDQAVTD+1180                                            02506000
AVTNOVOR EQU   IEDQAVTD+1176                                            02507000
AVTADEBR EQU   IEDQAVTD+1172                                            02508000
AVTLODPT EQU   IEDQAVTD+1168                                            02509000
AVTIOBN  EQU   IEDQAVTD+1164                                            02510000
AVTIOBR  EQU   IEDQAVTD+1160                                            02511000
AVTCPBPT EQU   IEDQAVTD+1156                                            02512000
AVTFCPB  EQU   IEDQAVTD+1152                                            02513000
@NM00085 EQU   IEDQAVTD+1148                                            02514000
AVTINCPQ EQU   IEDQAVTD+1144                                            02515000
@NM00084 EQU   IEDQAVTD+1140                                            02516000
@NM00083 EQU   IEDQAVTD+1137                                            02517000
@NM00082 EQU   AVTBIT4                                                  02518000
@NM00081 EQU   AVTBIT4                                                  02519000
@NM00080 EQU   AVTBIT4                                                  02520000
@NM00079 EQU   AVTBIT4                                                  02521000
@NM00078 EQU   AVTBIT4                                                  02522000
@NM00077 EQU   AVTBIT4                                                  02523000
@NM00076 EQU   AVTBIT4                                                  02524000
AVTRUFTN EQU   AVTBIT4                                                  02525000
@NM00075 EQU   IEDQAVTD+1132                                            02526000
AVTNOBFQ EQU   IEDQAVTD+1128                                            02527000
@NM00074 EQU   IEDQAVTD+1124                                            02528000
AVTDKENQ EQU   IEDQAVTD+1120                                            02529000
@NM00073 EQU   IEDQAVTD+1116                                            02530000
AVTDKAPQ EQU   IEDQAVTD+1112                                            02531000
AVTCOPY  EQU   IEDQAVTD+1108                                            02532000
AVTIA    EQU   IEDQAVTD+1104                                            02533000
AVTFL    EQU   IEDQAVTD+1100                                            02534000
@NM00072 EQU   IEDQAVTD+1096                                            02535000
AVTNCPBQ EQU   IEDQAVTD+1092                                            02536000
AVTTOTNC EQU   IEDQAVTD+1088                                            02537000
AVTCMAX  EQU   IEDQAVTD+1084                                            02538000
AVTCMIN  EQU   IEDQAVTD+1080                                            02539000
AVTHM02  EQU   IEDQAVTD+1076                                            02540000
AVTOPCIN EQU   IEDQAVTD+1074                                            02541000
AVTDCTLN EQU   IEDQAVTD+1072                                            02542000
AVTOPMSK EQU   IEDQAVTD+1068                                            02543000
AVTDDFT  EQU   IEDQAVTD+1064                                            02544000
AVTSTEAL EQU   IEDQAVTD+1060                                            02545000
AVTOPTN  EQU   IEDQAVTD+1056                                            02546000
AVTDSKCT EQU   IEDQAVTD+1054                                            02547000
AVTCKRST EQU   IEDQAVTD+1053                                            02548000
AVTSTAN  EQU   AVTBIT3                                                  02549000
AVTSTACN EQU   AVTBIT3                                                  02550000
AVTSTAIN EQU   AVTBIT3                                                  02551000
AVTSTAYN EQU   AVTBIT3                                                  02552000
AVTOLTBN EQU   AVTBIT3                                                  02553000
AVTTSAB  EQU   AVTBIT3                                                  02554000
AVTRFULN EQU   AVTBIT3                                                  02555000
AVTRECVN EQU   AVTBIT3                                                  02556000
@NM00071 EQU   AVTBIT2                                                  02557000
@NM00070 EQU   AVTBIT2                                                  02558000
AVTOPEIN EQU   AVTBIT2                                                  02559000
AVTSTRTN EQU   AVTBIT2                                                  02560000
AVTTOPOL EQU   AVTBIT2                                                  02561000
AVTCOPYN EQU   AVTBIT2                                                  02562000
AVTREUSN EQU   AVTBIT2                                                  02563000
AVTEXTSC EQU   AVTBIT2                                                  02564000
AVTDISKN EQU   AVTBIT1                                                  02565000
AVTQUCKN EQU   AVTBIT1                                                  02566000
AVTCLOSN EQU   AVTBIT1                                                  02567000
AVTREADN EQU   AVTBIT1                                                  02568000
AVTDLAYN EQU   AVTBIT1                                                  02569000
AVTAQTAN EQU   AVTBIT1                                                  02570000
AVTTSON  EQU   AVTBIT1                                                  02571000
AVTAPLKN EQU   AVTBIT1                                                  02572000
AVTDUMBR EQU   IEDQAVTD+1048                                            02573000
AVTDLQX  EQU   IEDQAVTD+1046                                            02574000
AVTINTLV EQU   IEDQAVTD+1044                                            02575000
AVTSMCNT EQU   IEDQAVTD+1042                                            02576000
AVTAVFCT EQU   IEDQAVTD+1040                                            02577000
AVTOPCON EQU   IEDQAVTD+1038                                            02578000
AVTOPCNT EQU   IEDQAVTD+1036                                            02579000
AVTLNCNT EQU   IEDQAVTD+1034                                            02580000
AVTKEYLE EQU   IEDQAVTD+1032                                            02581000
AVTHA16  EQU   IEDQAVTD+1030                                            02582000
AVTHA7   EQU   IEDQAVTD+1028                                            02583000
AVTHA4   EQU   IEDQAVTD+1026                                            02584000
AVTHA3   EQU   IEDQAVTD+1024                                            02585000
AVTHA2   EQU   IEDQAVTD+1022                                            02586000
AVTGETMS EQU   IEDQAVTD+1021                                            02587000
@NM00069 EQU   IEDQAVTD+1020                                            02588000
AVTGETMD EQU   IEDQAVTD+1016                                            02589000
AVTGETMN EQU   IEDQAVTD+1012                                            02590000
AVTCWTOT EQU   IEDQAVTD+1008                                            02591000
AVTCWINT EQU   IEDQAVTD+956                                             02592000
AVTDTRAP EQU   IEDQAVTD+952                                             02593000
@NM00068 EQU   IEDQAVTD+950                                             02594000
@NM00067 EQU   AVTIOTR                                                  02595000
AVTIOTRH EQU   AVTIOTR                                                  02596000
AVTIOTRE EQU   AVTIOTR                                                  02597000
@NM00066 EQU   AVTSUBT                                                  02598000
AVTSUBPT EQU   AVTSUBT                                                  02599000
AVTSUBON EQU   AVTSUBT                                                  02600000
AVTAFE30 EQU   IEDQAVTD+944                                             02601000
AVTAFE20 EQU   IEDQAVTD+940                                             02602000
AVTAFE10 EQU   IEDQAVTD+936                                             02603000
AVTCWEC2 EQU   IEDQAVTD+932                                             02604000
AVTCWPM2 EQU   IEDQAVTD+928                                             02605000
AVTCWTS2 EQU   IEDQAVTD+927                                             02606000
AVTCWTS1 EQU   IEDQAVTD+926                                             02607000
AVTCWCLD EQU   AVTCWFL2                                                 02608000
AVTCWRAP EQU   AVTCWFL2                                                 02609000
@NM00065 EQU   AVTCWFL2                                                 02610000
@NM00064 EQU   AVTCWFL2                                                 02611000
@NM00063 EQU   AVTCWFL2                                                 02612000
@NM00062 EQU   AVTCWFL2                                                 02613000
@NM00061 EQU   AVTCWFL2                                                 02614000
AVTCWACT EQU   AVTCWFL2                                                 02615000
@NM00060 EQU   AVTCWFL1                                                 02616000
@NM00059 EQU   AVTCWFL1                                                 02617000
@NM00058 EQU   AVTCWFL1                                                 02618000
@NM00057 EQU   AVTCWFL1                                                 02619000
@NM00056 EQU   AVTCWFL1                                                 02620000
@NM00055 EQU   AVTCWFL1                                                 02621000
@NM00054 EQU   AVTCWFL1                                                 02622000
AVTCOMWN EQU   AVTCWFL1                                                 02623000
AVTCWEC1 EQU   IEDQAVTD+920                                             02624000
AVTCWPM1 EQU   IEDQAVTD+916                                             02625000
AVTCAREA EQU   IEDQAVTD+912                                             02626000
AVTFZERO EQU   IEDQAVTD+908                                             02627000
AVTCADDR EQU   IEDQAVTD+904                                             02628000
AVTCOREC EQU   IEDQAVTD+900                                             02629000
@NM00053 EQU   IEDQAVTD+892                                             02630000
AVTCPBCB EQU   IEDQAVTD+888                                             02631000
@NM00052 EQU   IEDQAVTD+880                                             02632000
AVTDSIOB EQU   IEDQAVTD+876                                             02633000
@NM00051 EQU   IEDQAVTD+868                                             02634000
AVTCPRMB EQU   IEDQAVTD+864                                             02635000
@NM00050 EQU   IEDQAVTD+856                                             02636000
AVTCLOSB EQU   IEDQAVTD+852                                             02637000
@NM00049 EQU   IEDQAVTD+844                                             02638000
AVTACTIB EQU   IEDQAVTD+840                                             02639000
@NM00048 EQU   IEDQAVTD+836                                             02640000
AVTOLTEB EQU   IEDQAVTD+832                                             02641000
AVTOLTCH EQU   AVTOLTQB+1                                               02642000
AVTOLTVT EQU   AVTOLTQB                                                 02643000
@NM00047 EQU   AVTOPCQB+8                                               02644000
@NM00046 EQU   AVTOPCEC+1                                               02645000
@NM00045 EQU   AVTOPCCC                                                 02646000
AVTOPCPO EQU   AVTOPCCC                                                 02647000
AVTOPCWA EQU   AVTOPCCC                                                 02648000
AVTOPCCH EQU   AVTOPCOB+1                                               02649000
AVTOPCVT EQU   AVTOPCOB                                                 02650000
@NM00044 EQU   AVTCKPQB+9                                               02651000
AVTCKPTS EQU   AVTCKPQB+8                                               02652000
@NM00043 EQU   AVTCKPEC+1                                               02653000
@NM00042 EQU   AVTCKPCC                                                 02654000
AVTCKPPO EQU   AVTCKPCC                                                 02655000
AVTCKPWA EQU   AVTCKPCC                                                 02656000
AVTCKPCH EQU   AVTCKPTB+1                                               02657000
AVTCKPVT EQU   AVTCKPTB                                                 02658000
@NM00041 EQU   IEDQAVTD+796                                             02659000
AVTBFRTB EQU   IEDQAVTD+792                                             02660000
@NM00040 EQU   IEDQAVTD+788                                             02661000
AVTSELCH EQU   IEDQAVTD+785                                             02662000
AVTBFRTN EQU   AVTBFRFG                                                 02663000
AVTBFREB EQU   IEDQAVTD+780                                             02664000
AVTTIMQ  EQU   IEDQAVTD+776                                             02665000
@NM00039 EQU   IEDQAVTD+772                                             02666000
AVTIMQPS EQU   IEDQAVTD+768                                             02667000
AVTINOUT EQU   IEDQAVTD+766                                             02668000
AVTREFTM EQU   IEDQAVTD+764                                             02669000
@NM00038 EQU   IEDQAVTD+752                                             02670000
AVTDELYB EQU   IEDQAVTD+748                                             02671000
AVTOCQPT EQU   IEDQAVTD+744                                             02672000
AVTTSOPT EQU   IEDQAVTD+740                                             02673000
AVTSUPPT EQU   IEDQAVTD+736                                             02674000
AVTCBQCB EQU   IEDQAVTD+732                                             02675000
AVTMSGS  EQU   IEDQAVTD+729                                             02676000
@NM00037 EQU   AVTSYSER                                                 02677000
@NM00036 EQU   AVTSYSER                                                 02678000
@NM00035 EQU   AVTSYSER                                                 02679000
@NM00034 EQU   AVTSYSER                                                 02680000
@NM00033 EQU   AVTSYSER                                                 02681000
@NM00032 EQU   AVTSYSER                                                 02682000
AVTCMAXN EQU   AVTSYSER                                                 02683000
AVTCMINN EQU   AVTSYSER                                                 02684000
AVTABEPL EQU   AVTADBUF                                                 02685000
AVTHFF   EQU   AVTCLRHI+2                                               02686000
@NM00031 EQU   AVTCLRHI                                                 02687000
AVTCCLNK EQU   AVTCRELE+5                                               02688000
AVTCCPRI EQU   AVTCRELE+4                                               02689000
AVTCCQCB EQU   AVTCCELE+1                                               02690000
AVTCCKEY EQU   AVTCCELE                                                 02691000
AVTDELAD EQU   IEDQAVTD+704                                             02692000
AVTDELEM EQU   IEDQAVTD+700                                             02693000
AVTBSX   EQU   AVTCKLNK                                                 02694000
AVTOPETR EQU   AVTHG01                                                  02695000
@NM00030 EQU   AVTCKBYT                                                 02696000
AVTCKONQ EQU   AVTCKBYT                                                 02697000
@NM00029 EQU   AVTCKBYT                                                 02698000
@NM00028 EQU   AVTCKBYT                                                 02699000
@NM00027 EQU   AVTCKBYT                                                 02700000
@NM00026 EQU   AVTCKBYT                                                 02701000
@NM00025 EQU   AVTCKBYT                                                 02702000
@NM00024 EQU   AVTCKBYT                                                 02703000
AVTOPXCL EQU   IEDQAVTD+688                                             02704000
AVTOPERL EQU   IEDQAVTD+687                                             02705000
@NM00023 EQU   IEDQAVTD+686                                             02706000
AVTCKTIM EQU   IEDQAVTD+684                                             02707000
AVTCKELV EQU   IEDQAVTD+682                                             02708000
AVTCPRCD EQU   IEDQAVTD+681                                             02709000
AVTWARMN EQU   AVTCKELF                                                 02710000
AVTCRTLN EQU   AVTCKELF                                                 02711000
AVTCPIPN EQU   AVTCKELF                                                 02712000
AVTCCLCN EQU   AVTCKELF                                                 02713000
AVTCINCN EQU   AVTCKELF                                                 02714000
@NM00022 EQU   AVTCKELF                                                 02715000
AVTCMCPN EQU   AVTCKELF                                                 02716000
AVTNQBCK EQU   AVTCKELF                                                 02717000
AVTCKQAD EQU   IEDQAVTD+677                                             02718000
AVTSCBSZ EQU   IEDQAVTD+676                                             02719000
@NM00021 EQU   IEDQAVTD+672                                             02720000
AVTCKELE EQU   IEDQAVTD+668                                             02721000
@NM00020 EQU   AVTCKPEL+8                                               02722000
AVTCKRLK EQU   AVTCKPEL+5                                               02723000
AVTCKRPR EQU   AVTCKPEL+4                                               02724000
AVTCKRMQ EQU   AVTCKRMV+1                                               02725000
AVTCKRKY EQU   AVTCKRMV                                                 02726000
AVTHK    EQU   IEDQAVTD+648                                             02727000
AVTHI    EQU   IEDQAVTD+644                                             02728000
AVTNX    EQU   IEDQAVTD+636                                             02729000
AVTTONE  EQU   IEDQAVTD+632                                             02730000
AVTA3TL  EQU   IEDQAVTD+628                                             02731000
AVTDMECB EQU   IEDQAVTD+624                                             02732000
AVTABEND EQU   IEDQAVTD+618                                             02733000
AVTPLCBN EQU   IEDQAVTD+616                                             02734000
@NM00019 EQU   AVTSAVTP+1                                               02735000
@NM00018 EQU   AVTSAVTF                                                 02736000
AVTSNA   EQU   AVTSAVTF                                                 02737000
AVTONSNA EQU   AVTSAVTF                                                 02738000
AVTVTMCP EQU   AVTSAVTF                                                 02739000
@NM00017 EQU   IEDQAVTD+608                                             02740000
AVTCMBSS EQU   IEDQAVTD+604                                             02741000
AVTRCV   EQU   IEDQAVTD+600                                             02742000
AVTSEND  EQU   IEDQAVTD+596                                             02743000
AVTCSCH  EQU   IEDQAVTD+592                                             02744000
AVTE7    EQU   IEDQAVTD+584                                             02745000
AVTHB    EQU   IEDQAVTD+580                                             02746000
AVTR1    EQU   IEDQAVTD+576                                             02747000
AVTBZ    EQU   IEDQAVTD+572                                             02748000
AVTEZ    EQU   IEDQAVTD+568                                             02749000
AVTEC    EQU   IEDQAVTD+564                                             02750000
AVTEW    EQU   IEDQAVTD+560                                             02751000
AVTNDIAL EQU   AVTSCOPT                                                 02752000
AVTN2741 EQU   AVTSCOPT                                                 02753000
AVTCONCO EQU   AVTSCOPT                                                 02754000
AVTCONC  EQU   AVTSCOPT                                                 02755000
AVTCMBUF EQU   AVTSCOPT                                                 02756000
AVTAPDMP EQU   AVTSCOPT                                                 02757000
@NM00016 EQU   AVTSCOPT                                                 02758000
AVTHA    EQU   AVTDISP                                                  02759000
AVTEA    EQU   IEDQAVTD+548                                             02760000
AVTAX    EQU   IEDQAVTD+544                                             02761000
AVTA3    EQU   IEDQAVTD+540                                             02762000
AVTGD    EQU   IEDQAVTD+536                                             02763000
AVTAL    EQU   IEDQAVTD+532                                             02764000
AVTOLTST EQU   AVTHG02                                                  02765000
AVTE8    EQU   IEDQAVTD+524                                             02766000
AVTUI    EQU   IEDQAVTD+520                                             02767000
AVTCOMPT EQU   IEDQAVTD+516                                             02768000
AVTCRSRF EQU   IEDQAVTD+512                                             02769000
@NM00015 EQU   IEDQAVTD+508                                             02770000
AVTKA02  EQU   IEDQAVTD+504                                             02771000
AVTOPTPT EQU   IEDQAVTD+500                                             02772000
AVTPCBPT EQU   IEDQAVTD+496                                             02773000
@NM00014 EQU   AVTECB1                                                  02774000
AVTCOMP  EQU   AVTECB1                                                  02775000
@NM00013 EQU   AVTECB1                                                  02776000
AVTOPECA EQU   IEDQAVTD+488                                             02777000
AVTOLECA EQU   IEDQAVTD+484                                             02778000
AVTCKECA EQU   IEDQAVTD+480                                             02779000
AVTCWECA EQU   IEDQAVTD+476                                             02780000
AVTCWTCB EQU   IEDQAVTD+472                                             02781000
AVTOLTCB EQU   IEDQAVTD+468                                             02782000
AVTOCTCB EQU   IEDQAVTD+464                                             02783000
AVTCKTCB EQU   IEDQAVTD+460                                             02784000
AVTAS    EQU   IEDQAVTD+456                                             02785000
AVTNOLBF EQU   IEDQAVTD+454                                             02786000
AVTNCKPR EQU   IEDQAVTD+453                                             02787000
AVTCIB   EQU   IEDQAVTD+452                                             02788000
AVTSPLPT EQU   IEDQAVTD+448                                             02789000
AVTMVBFR EQU   IEDQAVTD+444                                             02790000
AVTSBTA  EQU   IEDQAVTD+440                                             02791000
AVTRARTN EQU   IEDQAVTD+436                                             02792000
AVTBSCAN EQU   IEDQAVTD+432                                             02793000
AVTRDYA  EQU   IEDQAVTD+428                                             02794000
AVTRNMPT EQU   IEDQAVTD+424                                             02795000
AVTDISTR EQU   IEDQAVTD+420                                             02796000
AVTPARM3 EQU   IEDQAVTD+416                                             02797000
@NM00012 EQU   AVTPKF                                                   02798000
@NM00011 EQU   AVTPKF                                                   02799000
@NM00010 EQU   AVTPKF                                                   02800000
AVTFTCHF EQU   AVTPKF                                                   02801000
@NM00009 EQU   AVTPKF                                                   02802000
@NM00008 EQU   AVTPKF                                                   02803000
@NM00007 EQU   AVTPKF                                                   02804000
@NM00006 EQU   AVTPKF                                                   02805000
AVTPARM  EQU   IEDQAVTD+408                                             02806000
AVTEXS2A EQU   IEDQAVTD+402                                             02807000
AVTEXA2S EQU   IEDQAVTD+396                                             02808000
AVTOCGET EQU   IEDQAVTD+392                                             02809000
AVTCKAVT EQU   @NM00004+1                                               02810000
@NM00005 EQU   AVTCKFLG                                                 02811000
AVTCKHLT EQU   AVTCKFLG                                                 02812000
AVTCKREQ EQU   AVTCKFLG                                                 02813000
AVTCKENV EQU   AVTCKFLG                                                 02814000
AVTCKNAC EQU   AVTCKFLG                                                 02815000
AVTCKTAC EQU   AVTCKFLG                                                 02816000
AVTBUENT EQU   IEDQAVTD+386                                             02817000
@NM00003 EQU   IEDQAVTD+385                                             02818000
AVTFULLT EQU   AVTBUFSW                                                 02819000
AVTUNCON EQU   AVTBUFSW                                                 02820000
@NM00002 EQU   AVTBUFSW                                                 02821000
AVTBUFTR EQU   AVTREADD                                                 02822000
AVTREADY EQU   IEDQAVTD+376                                             02823000
AVTTCB   EQU   IEDQAVTD+368                                             02824000
AVTPASWD EQU   IEDQAVTD+360                                             02825000
AVTCTLCH EQU   IEDQAVTD+352                                             02826000
AVTDOUBL EQU   IEDQAVTD+344                                             02827000
AVTDOUBX EQU   IEDQAVTD+336                                             02828000
AVTDPARM EQU   IEDQAVTD+332                                             02829000
AVTCSTCS EQU   IEDQAVTD+328                                             02830000
AVTDLQ   EQU   AVTSAVEX+32                                              02831000
@NM00001 EQU   AVTSAVEX                                                 02832000
AVTSAVE4 EQU   IEDQAVTD+216                                             02833000
AVTSAVE3 EQU   IEDQAVTD+144                                             02834000
AVTSAVE2 EQU   IEDQAVTD+72                                              02835000
AVTSAVE1 EQU   IEDQAVTD                                                 02836000
*                                      END UNREFERENCED COMPONENTS      02837000
@EL01    EQU   @EL00001                                                 02838000
@ENDDATA EQU   *                                                        02839000
@DATEND  EQU   *                                                        02840000
         END   IGG0198D,(C'PLS2041',0701,78117)                         02841000
