         TITLE 'IGG019TH - 3705 CHANNEL END/SIO APPENDAGE              *00001000
                        '                                               00002000
IGG019TH CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
*                                                /* @YM02924*/          00005000
*                                                                       00006000
         DC    A(END19TH+2-IGG019TH)    LENGTH OF IGG019TH              00007000
         DC    A(SIOAPNDG)              ADDRESS OF SIO APPENDAGE        00008000
THENTRY  EQU   *                                               @YM02924 00009000
         USING THENTRY,TEMPBASE         MODULE ADDRESSABILITY  @YM02924 00010000
IGG019TH IEDHJN AFTERHJN                MODULE AND DATE                 00011000
*   STM(REG0,RBRANCH,SIOSAVE);      /* SAVE REGS ON ENTRY    @ZM47611*/ 00012000
         STM   REG0,RBRANCH,SIOSAVE                                0465 00013000
*   RAVT=TCXAVT;                    /* GET AVT ADDR FROM TCX         */ 00014000
         L     @11,CVTPTR                                          0466 00015000
         L     @11,TCXPTR(,@11)                                    0466 00016000
         L     RAVT,TCXAVT(,@11)                                   0466 00017000
*   GEN REFS(TEMPBASE,RBASE) NOEXIT SEQFLOW SETS(RBASE);           0467 00018000
*                                                    /* @YM02924*/      00019000
         DROP  TEMPBASE                                                 00020000
         LR    RBASE,TEMPBASE                                  @YM02924 00021000
         USING THENTRY,RBASE                                   @YM02924 00022000
*   RFY                                                            0468 00023000
*     TEMPBASE UNRSTD;              /*                       @YM02924*/ 00024000
*   AVTDPARM=RRETURN;               /* SAVE REGISTER FOR IOS         */ 00025000
         ST    RRETURN,AVTDPARM(,RAVT)                             0469 00026000
*   RLCB=RPARM->IOSUSE;             /* REG 1 POINTS TO IOSB. PTR TO     00027000
*                                      LCB IS IN IOSB        @G36XRIB*/ 00028000
         L     RLCB,IOSUSE(,RPARM)                                 0470 00029000
*/* MAP I/O STATUS FIELDS FROM IOSB INTO LCB(IOB)            @G36XRIB*/ 00030000
*                                                                  0471 00031000
*   LCBFLAG1=IOSFLA;                /* STATUS BITS           @G36XRIB*/ 00032000
         L     @15,IOSBPTR-1(,RLCB)                                0471 00033000
         LA    @15,0(,@15)                                         0471 00034000
         MVC   LCBFLAG1(1,RLCB),IOSFLA(@15)                        0471 00035000
*   LCBFLAG2=IOSFLB;                /* STATUS BITS           @G36XRIB*/ 00036000
         MVC   LCBFLAG2(1,RLCB),IOSFLB(@15)                        0472 00037000
*   LCBECBCC=IOSCOD;                /* ECB COMPLETION CODE   @G36XRIB*/ 00038000
         MVC   LCBECBCC(1,RLCB),IOSCOD(@15)                        0473 00039000
*   LCBSIOCC=IOSCC;                 /* SIO COMPLETION CODE   @G36XRIB*/ 00040000
         MVC   LCBSIOCC(1,RLCB),IOSCC(@15)                         0474 00041000
*   LCBCSW=IOSCSW;                  /* CSW                   @G36XRIB*/ 00042000
         MVC   LCBCSW(7,RLCB),IOSCSW(@15)                          0475 00043000
*   LCBSNS=IOSSNS;                  /* SENSE BYTES           @G36XRIB*/ 00044000
         MVC   LCBSNS(2,RLCB),IOSSNS(@15)                          0476 00045000
*/*                                                          @G36XRIB*/ 00046000
*                                                                  0477 00047000
*   IF LCBSIOC2=ON|                 /* SIO CONDITION CODE 1 OR 3...     00048000
*                                                            @OY20765*/ 00049000
*       LCBCSWCA=0                  /* ..OR CURRENT I/O OPERATION  0477 00050000
*                                      INTERCEPTED BECAUSE ERROR   0477 00051000
*                                      CONDITION DETECTED ON PREVIOUS   00052000
*                                      I/O OPERATION AFTER CHANNEL 0477 00053000
*                                      END                   @OY20765*/ 00054000
*     THEN                          /*                       @OY20765*/ 00055000
         TM    LCBSIOC2(RLCB),B'00010000'                          0477 00056000
         BO    @RT00477                                            0477 00057000
         L     @15,LCBCSWCA-1(,RLCB)                               0477 00058000
         LA    @15,0(,@15)                                         0477 00059000
         LTR   @15,@15                                             0477 00060000
         BNZ   @RF00477                                            0477 00061000
@RT00477 DS    0H                                                  0478 00062000
*     DO;                           /* YES                   @G36XRIB*/ 00063000
*       LCBCSWCA=LCBSTART+LENGTH(IEDQCCW);/* ..THEN SETUP DUMMY    0479 00064000
*                                      INTERRUPT ADDRESS     @G36XRIB*/ 00065000
         LA    @15,8                                               0479 00066000
         L     @11,LCBSTART-1(,RLCB)                               0479 00067000
         LA    @11,0(,@11)                                         0479 00068000
         ALR   @15,@11                                             0479 00069000
         STCM  @15,7,LCBCSWCA(RLCB)                                0479 00070000
*       IOSCSWCA=LCBCSWCA;          /* PUT DUMMY ADDR IN IOSB ALSO 0480 00071000
*                                                            @G36XRIB*/ 00072000
         L     @11,IOSBPTR-1(,RLCB)                                0480 00073000
         STCM  @15,7,IOSCSWCA(@11)                                 0480 00074000
*     END;                          /*                       @G36XRIB*/ 00075000
*   ELSE                                                           0482 00076000
*     ;                             /*                       @YM06897*/ 00077000
@RF00477 DS    0H                                                  0483 00078000
*   RFY                                                            0483 00079000
*    (RPARM,                                                       0483 00080000
*     REG3,                                                        0483 00081000
*     REG4,                                                        0483 00082000
*     RCCW,                                                        0483 00083000
*     RPRF,                                                        0483 00084000
*     REG7,                                                        0483 00085000
*     RTRM) UNRSTD;                                                0483 00086000
*   RFY                                                            0484 00087000
*    (REG0,                                                        0484 00088000
*     REG9,                                                        0484 00089000
*     RRETURN) UNRSTD;                                             0484 00090000
*                                                                  0485 00091000
*   /*****************************************************************/ 00092000
*   /*                                                               */ 00093000
*   /* GET THE TERM ENTRY (TTE) FOR THE NCP (3705) REPRESENTED BY    */ 00094000
*   /* THIS LCB. CALL IEDQTNT WITH REG1 CONTAINING THE TTCIN, REG14  */ 00095000
*   /* THE RETURN ADDR, AND REG15 THE ADDR OF IEDQTNT. IEDQTNT WILL  */ 00096000
*   /* RETURN WITH THE TERM ENTRY ADDR IN REG1.                      */ 00097000
*   /*                                                               */ 00098000
*   /*****************************************************************/ 00099000
*                                                                  0485 00100000
*   RFY                                                            0485 00101000
*    (RPARM,                                                       0485 00102000
*     RTRM) RSTD;                                                  0485 00103000
*   RPARM=LCBTTCIN;                 /* GET TNT OFFSET OF NCP         */ 00104000
         LH    RPARM,LCBTTCIN(,RLCB)                               0486 00105000
         N     RPARM,@CF02869                                      0486 00106000
*   CALL TNTCODE;                   /* CALL IEDQTNT FOR TERM ENTRY   */ 00107000
         L     @15,IEDQNPTR(,RAVT)                                 0487 00108000
         BALR  @14,@15                                             0487 00109000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SAVE TERM ENTRY ADDR  @YM04622*/ 00110000
         LR    RTRM,RPARM                                          0488 00111000
         SL    RTRM,@CF02521                                       0488 00112000
*   RFY                                                            0489 00113000
*     RPARM UNRSTD;                                                0489 00114000
*                                                                  0490 00115000
*   /*****************************************************************/ 00116000
*   /*                                                               */ 00117000
*   /* IF CCW'S ARE REAL, THEN TRANSLATE THEM TO VIRTUAL.            */ 00118000
*   /*                                                               */ 00119000
*   /*****************************************************************/ 00120000
*                                                                  0490 00121000
*   RFY                                                            0490 00122000
*    (RPARM,                                                       0490 00123000
*     RCCW,                                                        0490 00124000
*     RINT,                                                        0490 00125000
*     RWORK) RSTD;                  /*                       @YM04622*/ 00126000
*   IF LCBRLAD=ON THEN              /* IF REAL CHAN PROGRAM EXISTS 0491 00127000
*                                      THEN ...              @YM04622*/ 00128000
         TM    LCBRLAD(RLCB),B'00010000'                           0491 00129000
         BNO   @RF00491                                            0491 00130000
*     DO;                           /* ... TRANSLATE TO VIRTUAL    0492 00131000
*                                                            @YM04622*/ 00132000
*       RWORK=CVTPTRV;              /* GET ADDR OF REAL TO VIRTUAL 0493 00133000
*                                      TRANSLATE ROUTINE             */ 00134000
         L     @04,CVTPTR                                          0493 00135000
         L     RWORK,CVTPTRV(,@04)                                 0493 00136000
*       RINT=LCBCSWCA-LENGTH(IEDQCCW);/* INTERRUPT CCW ADDRESS     0494 00137000
*                                                            @YM04622*/ 00138000
         L     RINT,LCBCSWCA-1(,RLCB)                              0494 00139000
         LA    RINT,0(,RINT)                                       0494 00140000
         SL    RINT,@CF00046                                       0494 00141000
*       IF TRMIPLDM=ON|             /* IF IPL OR DUMP IN PROGRESS ...   00142000
*                                                            @YM04622*/ 00143000
*           LCBSTAT1=CLOSDOWN THEN  /* ... OR CLOSE CHANNEL PROGRAM     00144000
*                                      THEN                  @YM04622*/ 00145000
         TM    TRMIPLDM(RTRM),B'10000000'                          0495 00146000
         BO    @RT00495                                            0495 00147000
         CLI   LCBSTAT1(RLCB),X'FF'                                0495 00148000
         BNE   @RF00495                                            0495 00149000
@RT00495 DS    0H                                                  0496 00150000
*         RCCW=LCBSTART;            /* BEGIN TRANSLATION WITH FIRST     00151000
*                                      CCW                   @YM04622*/ 00152000
         L     RCCW,LCBSTART-1(,RLCB)                              0496 00153000
         LA    RCCW,0(,RCCW)                                       0496 00154000
*       ELSE                        /*                       @YM04622*/ 00155000
*         DO;                       /* ELSE DETERMINE WHICH CCWS NEED   00156000
*                                      TRANSLATION           @YM04622*/ 00157000
         B     @RC00495                                            0497 00158000
@RF00495 DS    0H                                                  0498 00159000
*           RPARM=RLCB+DCBEIOBX;    /* POINT TO END OF LCB   @YM04622*/ 00160000
         L     @11,LCBDCBPT(,RLCB)                                 0498 00161000
         LR    RPARM,RLCB                                          0498 00162000
         SLR   @04,@04                                             0498 00163000
         IC    @04,DCBEIOBX+20(,@11)                               0498 00164000
         ALR   RPARM,@04                                           0498 00165000
*           IF RINT>=RLCB&          /* IF INTERRUPT CCW IS IN THE LCB   00166000
*                                                            @YM04622*/ 00167000
*               RINT<RPARM&         /*                       @YM04622*/ 00168000
*               RINT^=ADDR(LCBCCW7) THEN/* BUT NOT NOP CCW AFTER   0499 00169000
*                                      READS                 @YM04622*/ 00170000
         CR    RINT,RLCB                                           0499 00171000
         BL    @RF00499                                            0499 00172000
         CR    RINT,RPARM                                          0499 00173000
         BNL   @RF00499                                            0499 00174000
         LA    @11,LCBCCW7(,RLCB)                                  0499 00175000
         CR    RINT,@11                                            0499 00176000
         BE    @RF00499                                            0499 00177000
*             RINT=ZERO;            /* THEN INDICATE NO READ CCW   0500 00178000
*                                      TRANSLATION           @YM04622*/ 00179000
         SLR   RINT,RINT                                           0500 00180000
*           RCCW=ADDR(LCBCCW2);     /* ASSUME SENDING        @YM04622*/ 00181000
@RF00499 LA    RCCW,LCBCCW2(,RLCB)                                 0501 00182000
*           IF LCBSENDN=OFF THEN    /* IF NOT SENDING THEN ...     0502 00183000
*                                                            @YM04622*/ 00184000
         TM    LCBSENDN(RLCB),B'00000001'                          0502 00185000
         BNZ   @RF00502                                            0502 00186000
*             RCCW=ADDR(LCBCCW4);   /* ... ASSUME READING    @YM04622*/ 00187000
         LA    RCCW,LCBCCW4(,RLCB)                                 0503 00188000
*         END;                      /*                       @YM04622*/ 00189000
@RF00502 DS    0H                                                  0505 00190000
*       DO WHILE LCBRLAD=ON;        /* TRANSLATE CCW'S WHILE ANY ARE    00191000
*                                      REAL                          */ 00192000
@RC00495 B     @DE00505                                            0505 00193000
@DL00505 DS    0H                                                  0506 00194000
*         RPARM=CCWADDR;            /* GET CCW DATA ADDRESS          */ 00195000
         SLR   RPARM,RPARM                                         0506 00196000
         ICM   RPARM,7,CCWADDR(RCCW)                               0506 00197000
*         CALL CONVERT;             /* CALL CONVERT ROUTINE          */ 00198000
         LR    @15,RWORK                                           0507 00199000
         BALR  @14,@15                                             0507 00200000
*         RFY                                                      0508 00201000
*           RBRANCH RSTD;                                          0508 00202000
*         IF RBRANCH^=ZERO THEN     /* ERROR ON CONVERSION           */ 00203000
         LTR   RBRANCH,RBRANCH                                     0509 00204000
         BZ    @RF00509                                            0509 00205000
*           CALL CONVERR;           /* YES, CALL CONVERSION ERROR  0510 00206000
*                                      SUBROUTINE                    */ 00207000
         BAL   @14,CONVERR                                         0510 00208000
*         RFY                                                      0511 00209000
*           RBRANCH UNRSTD;                                        0511 00210000
@RF00509 DS    0H                                                  0512 00211000
*         CCWADDR=RPARM;            /* UPDATE CCW DATA ADDRESS WITH     00212000
*                                      VIRTUAL ADDR                  */ 00213000
         STCM  RPARM,7,CCWADDR(RCCW)                               0512 00214000
*         IF RCCW=RINT&             /* IF THIS IS THE INTERRUPT CCW     00215000
*                                      ...                   @YM04622*/ 00216000
*             TRMIPLDM^=ON THEN     /* ... AND NOT IN PROCESS OF   0513 00217000
*                                      IPL/DUMP              @YM04622*/ 00218000
         CR    RCCW,RINT                                           0513 00219000
         BNE   @RF00513                                            0513 00220000
         TM    TRMIPLDM(RTRM),B'10000000'                          0513 00221000
         BO    @RF00513                                            0513 00222000
*           RINT=ZERO;              /* THEN INDICATE INTERRUPT CCW 0514 00223000
*                                      TRANSLATED            @YM04622*/ 00224000
         SLR   RINT,RINT                                           0514 00225000
*         IF NOTTIC1=OFF&           /* IS COMMAND ...                */ 00226000
*             NOTTIC2=OFF&          /* ... A ...                     */ 00227000
*             NOTTIC3=OFF THEN      /* ... TIC                       */ 00228000
@RF00513 TM    NOTTIC1(RCCW),B'00000111'                           0515 00229000
         BNZ   @RF00515                                            0515 00230000
*           DO;                     /*                       @YM04622*/ 00231000
*             CCWOPCDE=CCWTIC;      /* INDICATE VIRTUAL TIC (CCW   0517 00232000
*                                      VIRTUAL)              @YM04622*/ 00233000
         MVI   CCWOPCDE(RCCW),X'08'                                0517 00234000
*             RCCW=RPARM;           /* NEXT CCW IS TIC TO CCW      0518 00235000
*                                                            @YM04622*/ 00236000
         LR    RCCW,RPARM                                          0518 00237000
*             IF CCWOPCDE=CCWREAD THEN/* IF THIS IS A READ CCW ... 0519 00238000
*                                                            @YM04622*/ 00239000
         CLI   CCWOPCDE(RCCW),X'02'                                0519 00240000
         BNE   @RF00519                                            0519 00241000
*               IF RINT=ZERO THEN   /* ... AND THE INTERRUPT CCW HAS    00242000
*                                      BEEN TRANSLATED       @YM04622*/ 00243000
         LTR   RINT,RINT                                           0520 00244000
         BNZ   @RF00520                                            0520 00245000
*                 LCBRLAD=OFF;      /* INDICATE TRANSLATION COMPLETE    00246000
*                                                            @YM04622*/ 00247000
         NI    LCBRLAD(RLCB),B'11101111'                           0521 00248000
*               ELSE                                               0522 00249000
*                 ;                 /*                       @YM04622*/ 00250000
@RF00520 DS    0H                                                  0523 00251000
*             ELSE                  /*                       @YM04622*/ 00252000
*               IF RCCW=ADDR(LCBCCW3) THEN/* IF TIC TO READ START ...   00253000
*                                                            @YM06637*/ 00254000
         B     @RC00519                                            0523 00255000
@RF00519 LA    @11,LCBCCW3(,RLCB)                                  0523 00256000
         CR    RCCW,@11                                            0523 00257000
         BNE   @RF00523                                            0523 00258000
*                 RCCW=ADDR(LCBCCW4);/* ... TRANSLATE TIC TO READ  0524 00259000
*                                      BUFFER                @YM06637*/ 00260000
         LA    RCCW,LCBCCW4(,RLCB)                                 0524 00261000
*               ELSE                /*                       @YM06637*/ 00262000
*                 IF CCWOPCDE=CCWNOP THEN/* IF TIC TO A NOP, FINISHED   00263000
*                                                            @YM04622*/ 00264000
         B     @RC00523                                            0525 00265000
@RF00523 CLI   CCWOPCDE(RCCW),X'03'                                0525 00266000
         BNE   @RF00525                                            0525 00267000
*                   LCBRLAD=OFF;    /* INDICATE TRANSLATION COMPLETE    00268000
*                                                            @YM04622*/ 00269000
         NI    LCBRLAD(RLCB),B'11101111'                           0526 00270000
*           END;                    /*                       @YM04622*/ 00271000
*         ELSE                      /* NOT A TIC                     */ 00272000
*           RCCW=RCCW+LENGTH(IEDQCCW);/* YES, NEXT CCW FOLLOWS THIS     00273000
*                                      CCW                           */ 00274000
         B     @RC00515                                            0528 00275000
@RF00515 AL    RCCW,@CF00046                                       0528 00276000
*         IF CCWCC=ON|              /* IF COMMAND CHAINING ...     0529 00277000
*                                                            @YM06637*/ 00278000
*             CCWCD=ON THEN                                        0529 00279000
@RC00515 TM    CCWCC(RCCW),B'11000000'                             0529 00280000
         BNZ   @RT00529                                            0529 00281000
*           ;                       /* ... OR DATA CHAINING THEN   0530 00282000
*                                      TRANSLATE             @YM06637*/ 00283000
*         ELSE                      /*                       @YM06637*/ 00284000
*           IF TRMIPLDM=ON|         /* IF IPL/DUMP IN PROGRESS ... 0531 00285000
*                                                            @YM06637*/ 00286000
*               LCBSTAT1=CLOSDOWN THEN/* ... OR TCAM CLOSEDOWN     0531 00287000
*                                                            @YM06637*/ 00288000
         TM    TRMIPLDM(RTRM),B'10000000'                          0531 00289000
         BO    @RT00531                                            0531 00290000
         CLI   LCBSTAT1(RLCB),X'FF'                                0531 00291000
         BNE   @RF00531                                            0531 00292000
@RT00531 DS    0H                                                  0532 00293000
*             IF LCBRLAD=OFF THEN                                  0532 00294000
         TM    LCBRLAD(RLCB),B'00010000'                           0532 00295000
         BZ    @RT00532                                            0532 00296000
*               ;                   /* CCW ADDRESSES ALL TRANSLATED     00297000
*                                                            @OZ30168*/ 00298000
*             ELSE                  /* MAY HAVE TO TRANSLATE LAST CCW   00299000
*                                      IN CHAIN              @OZ30168*/ 00300000
*               DO;                                                0534 00301000
*                 RPARM=RCCW-LENGTH(IEDQCCW);/* BACK UP TO LAST CCW     00302000
*                                      TRANSLATED            @OZ30168*/ 00303000
         LR    RPARM,RCCW                                          0535 00304000
         SL    RPARM,@CF00046                                      0535 00305000
*                 IF RPARM->CCWCC=ON|RPARM->CCWCD=ON/*       @OZ30168*/ 00306000
*                   THEN            /* ONE MORE CCW TO TRANSLATE   0536 00307000
*                                                            @OZ30168*/ 00308000
         TM    CCWCC(RPARM),B'11000000'                            0536 00309000
         BZ    @RF00536                                            0536 00310000
*                   DO;             /*                       @OZ30168*/ 00311000
*                     RPARM=CCWADDR;/* REAL DATA ADDRESS     @OZ30168*/ 00312000
         SLR   RPARM,RPARM                                         0538 00313000
         ICM   RPARM,7,CCWADDR(RCCW)                               0538 00314000
*                     CALL CONVERT; /* GET VIRTUAL ADDR IN R1      0539 00315000
*                                                            @OZ30168*/ 00316000
         LR    @15,RWORK                                           0539 00317000
         BALR  @14,@15                                             0539 00318000
*                     RFY                                          0540 00319000
*                       RBRANCH RSTD;/*                      @OZ30168*/ 00320000
*                     IF RBRANCH=ZERO THEN/* CONVERT GOOD    @OZ30168*/ 00321000
         LTR   RBRANCH,RBRANCH                                     0541 00322000
         BNZ   @RF00541                                            0541 00323000
*                       CCWADDR=RPARM;/* STORE VIRTUAL ADDRESS     0542 00324000
*                                                            @OZ30168*/ 00325000
         STCM  RPARM,7,CCWADDR(RCCW)                               0542 00326000
*                     ELSE          /* TRANSLATE FAILED      @OZ30168*/ 00327000
*                       CALL CONVERR;/* ABEND                @OZ30168*/ 00328000
         B     @RC00541                                            0543 00329000
@RF00541 BAL   @14,CONVERR                                         0543 00330000
*                     RFY                                          0544 00331000
*                       RBRANCH UNRSTD;/*                    @OZ30168*/ 00332000
@RC00541 DS    0H                                                  0545 00333000
*                   END;            /*                       @OZ30168*/ 00334000
*                 ELSE                                             0546 00335000
*                   ;               /* ONLY 1 CCW IN CHAIN, ALL    0546 00336000
*                                      TRANSLATION DONE      @OZ30168*/ 00337000
@RF00536 DS    0H                                                  0547 00338000
*                 LCBRLAD=OFF;      /* TRANSLATION IS COMPLETE     0547 00339000
*                                                            @OZ30168*/ 00340000
         NI    LCBRLAD(RLCB),B'11101111'                           0547 00341000
*               END;                /*                       @OZ30168*/ 00342000
*           ELSE                                                   0549 00343000
*             ;                     /* MORE TO TRANSLATE IF NOT IPL     00344000
*                                      OR CLOSEDOWN          @OZ30168*/ 00345000
@RF00531 DS    0H                                                  0550 00346000
*       END;                                                       0550 00347000
@RC00531 DS    0H                                                  0550 00348000
@RT00529 DS    0H                                                  0550 00349000
@DE00505 TM    LCBRLAD(RLCB),B'00010000'                           0550 00350000
         BO    @DL00505                                            0550 00351000
*     END;                          /*                       @YM04622*/ 00352000
*   RFY                                                            0552 00353000
*    (RPARM,                                                       0552 00354000
*     RCCW,                                                        0552 00355000
*     RINT,                                                        0552 00356000
*     RWORK) UNRSTD;                /*                       @YM04622*/ 00357000
@RF00491 DS    0H                                                  0553 00358000
*                                                                  0553 00359000
*   /*****************************************************************/ 00360000
*   /*                                                               */ 00361000
*   /* CALL LINE TRACE (IF IT IS IN THE SYSTEM)                      */ 00362000
*   /*                                                               */ 00363000
*   /*****************************************************************/ 00364000
*                                                                  0553 00365000
*   RFY                                                            0553 00366000
*     RPARM RSTD;                   /*                       @YM02923*/ 00367000
*   IF LCBSOHR=OFF THEN             /* IF MDR PROCESSING IS NOT IN 0554 00368000
*                                      PROGRESS              @YM03744*/ 00369000
         TM    LCBSOHR(RLCB),B'00100000'                           0554 00370000
         BNZ   @RF00554                                            0554 00371000
*     IF AVTIOT^=ZERO THEN          /* IS LINE TRACE IN THE SYSTEM   */ 00372000
         L     @09,AVTIOT(,RAVT)                                   0555 00373000
         LTR   @09,@09                                             0555 00374000
         BZ    @RF00555                                            0555 00375000
*       DO;                         /* YES, THEN CALL IT             */ 00376000
*         IEDRQE=''B;               /* ZERO DUMMY RQE        @G36XRIB*/ 00377000
         LA    @03,DUMRQE                                          0557 00378000
         XC    IEDRQE(20,@03),IEDRQE(@03)                          0557 00379000
*         RQEUCB=DIOSUCBP;          /* UCB ADDRESS           @G36XRIB*/ 00380000
         L     @15,IOSBPTR-1(,RLCB)                                0558 00381000
         LH    @00,DIOSUCBP(,@15)                                  0558 00382000
         N     @00,@CF02869                                        0558 00383000
         STH   @00,RQEUCB(,@03)                                    0558 00384000
*         RQEIOB=RLCB+(ADDR(LCBFLAG1)-ADDR(IEDQLCB));/* IOB ADDR   0559 00385000
*                                                            @G36XRIB*/ 00386000
         LA    @00,32                                              0559 00387000
         ALR   @00,RLCB                                            0559 00388000
         STCM  @00,7,RQEIOB(@03)                                   0559 00389000
*         RPARM=ADDR(IEDRQE);       /* ADDRESS OF DUMMY RQE  @G36XRIB*/ 00390000
         LR    RPARM,@03                                           0560 00391000
*         CALL LNTRACE;             /* GO DO LINE TRACE      @G36XRIB*/ 00392000
         LR    @15,@09                                             0561 00393000
         BALR  @14,@15                                             0561 00394000
*       END;                                                       0562 00395000
*     ELSE                                                         0563 00396000
*       ;                           /*                       @YM03744*/ 00397000
@RF00555 DS    0H                                                  0564 00398000
*   ELSE                                                           0564 00399000
*     LCBSOHR=OFF;                  /* RESET MDR RECORDING IN      0564 00400000
*                                      PROGRESS              @YM03744*/ 00401000
         B     @RC00554                                            0564 00402000
@RF00554 NI    LCBSOHR(RLCB),B'11011111'                           0564 00403000
*   RFY                                                            0565 00404000
*     RPARM UNRSTD;                 /*                       @YM02923*/ 00405000
@RC00554 DS    0H                                                  0566 00406000
*   RFY                                                            0566 00407000
*    (RSTATE,                                                      0566 00408000
*     RCCW,                                                        0566 00409000
*     RWORK,                                                       0566 00410000
*     RPRF) RSTD;                                                  0566 00411000
         SPACE 1                                                        00412000
*   RSTATE=ZERO;                    /* INITIALIZE LOCAL STATE VALUE  */ 00413000
         SLR   RSTATE,RSTATE                                       0567 00414000
         SPACE 1                                                        00415000
*   IF LCBSTAT1=CLOSDOWN&LCBOBRCH=ZERO THEN/* ARE WE IN CLOSE      0568 00416000
*                                                            @YM07304*/ 00417000
         CLI   LCBSTAT1(RLCB),X'FF'                                0568 00418000
         BNE   @RF00568                                            0568 00419000
         L     @11,LCBOBRCH(,RLCB)                                 0568 00420000
         LTR   @11,@11                                             0568 00421000
         BNZ   @RF00568                                            0568 00422000
*     DO;                                                          0569 00423000
*       RFY                                                        0570 00424000
*         RECB RSTD;                /*                       @YM07304*/ 00425000
*       RECB=LCBECBPT;              /* GET ADDRESS OF CLOSE ECB    0571 00426000
*                                                            @YM07304*/ 00427000
         L     RECB,LCBECBPT-1(,RLCB)                              0571 00428000
         LA    RECB,0(,RECB)                                       0571 00429000
*       CALL POSTECB;               /* POST IT               @YM07304*/ 00430000
         BAL   @14,POSTECB                                         0572 00431000
*       RFY                                                        0573 00432000
*         RECB UNRSTD;              /*                       @YM07304*/ 00433000
*     END;                                                         0574 00434000
*   ELSE                            /*                       @YM07304*/ 00435000
*     DO;                           /*                       @YM07304*/ 00436000
         B     @RC00568                                            0575 00437000
@RF00568 DS    0H                                                  0576 00438000
*       IF TRMIPLDM=OFF&            /* IF IPL/DUMP NOT IN PROGRESS 0576 00439000
*                                      ...                   @YM08552*/ 00440000
*           LCBCSWCA-LENGTH(IEDQCCW)=ADDR(CPARNOOP)&/* ... AND WE  0576 00441000
*                                      HAVE TAKEN AN INTERRUPT ON THE   00442000
*                                      NOP CCW AFTER THE READ CHANNEL   00443000
*                                      PROGRAM ...           @YM08552*/ 00444000
*           LCBUSAT=OFF&            /* ... BUT HAVE NO ATTENTION   0576 00445000
*                                      STATUS ...            @YM08552*/ 00446000
*           LCBUSUE=OFF THEN        /* ...AND NO UNIT EXCEPTION    0576 00447000
*                                      STATUS THEN...        @YM08552*/ 00448000
         TM    TRMIPLDM(RTRM),B'10000000'                          0576 00449000
         BNZ   @RF00576                                            0576 00450000
         L     @11,LCBCSWCA-1(,RLCB)                               0576 00451000
         LA    @11,0(,@11)                                         0576 00452000
         SL    @11,@CF00046                                        0576 00453000
         LA    @07,CPARNOOP(,RLCB)                                 0576 00454000
         CR    @11,@07                                             0576 00455000
         BNE   @RF00576                                            0576 00456000
         TM    LCBUSAT(RLCB),B'10000001'                           0576 00457000
         BNZ   @RF00576                                            0576 00458000
*         DO;                       /* THE NCP IS OUT OF SYNCH AND 0577 00459000
*                                      MUST BE IPL'ED        @YM08552*/ 00460000
*           LCBECBCC=LCBECB41;      /* FORCE PERMANENT ERROR       0578 00461000
*                                      INDICATION            @YM08552*/ 00462000
         MVI   LCBECBCC(RLCB),X'41'                                0578 00463000
*           LCBNOTIN=ON;            /* FORCE CLEANUP TO CHECK      0579 00464000
*                                      DMPAUTO/IPLAUTO       @YM08552*/ 00465000
         OI    LCBNOTIN(RLCB),B'00000010'                          0579 00466000
*           LCBNX142=ON;            /* IEDQNX WILL DISPLAY IED142A 0580 00467000
*                                                            @YM08552*/ 00468000
         OI    LCBNX142(RLCB),B'01000000'                          0580 00469000
*         END;                      /* PROCEED TO BUILD A CHANNEL  0581 00470000
*                                      INOP                  @YM08552*/ 00471000
*       IF LCBECBCC=LCBECB41 THEN   /* PERMANENT ERROR               */ 00472000
*                                                                  0582 00473000
@RF00576 CLI   LCBECBCC(RLCB),X'41'                                0582 00474000
         BNE   @RF00582                                            0582 00475000
*         /***********************************************************/ 00476000
*         /*                                                         */ 00477000
*         /* PERMANENT ERROR ON I/O                                  */ 00478000
*         /*                                                         */ 00479000
*         /***********************************************************/ 00480000
*                                                                  0583 00481000
*         IF TRMIPLDM=ON THEN       /* IS IPL OR DUMP IN PROGRESS    */ 00482000
*                                                                  0583 00483000
         TM    TRMIPLDM(RTRM),B'10000000'                          0583 00484000
         BNO   @RF00583                                            0583 00485000
*           /*********************************************************/ 00486000
*           /*                                                       */ 00487000
*           /* IPL OR DUMP IS IN PROGRESS                            */ 00488000
*           /*                                                       */ 00489000
*           /*********************************************************/ 00490000
*                                                                  0584 00491000
*           DO;                     /* POST LCB TO FIRST LEVEL DATA     00492000
*                                      HANDLER               @YM02949*/ 00493000
*             LCBQCBA=SAVTFLDH;     /* QCB ADDRESS           @YM02949*/ 00494000
         L     @11,AVTSAVTP(,RAVT)                                 0585 00495000
         MVC   LCBQCBA(3,RLCB),SAVTFLDH+1(@11)                     0585 00496000
*             LCBPRI=PRIAIPL;       /* AND PRIORITY          @YM02949*/ 00497000
         MVI   LCBPRI(RLCB),X'DE'                                  0586 00498000
*             RPRF=RLCB;            /* PARAMETER TO POST     @YM02949*/ 00499000
         LR    RPRF,RLCB                                           0587 00500000
*             CALL READYQ;          /* PUT LCB ON TCX READY QUE    0588 00501000
*                                                            @YM02949*/ 00502000
         BAL   @14,READYQ                                          0588 00503000
*           END;                    /*                       @YM02949*/ 00504000
*         ELSE                                                     0590 00505000
*                                                                  0590 00506000
*           /*********************************************************/ 00507000
*           /*                                                       */ 00508000
*           /* IPL OR DUMP NOT IN PROGRESS                           */ 00509000
*           /*                                                       */ 00510000
*           /*********************************************************/ 00511000
*                                                                  0590 00512000
*           DO;                                                    0590 00513000
         B     @RC00583                                            0590 00514000
@RF00583 DS    0H                                                  0591 00515000
*             LCBTSTSW=ZERO;        /* FREE LCB FOR I/O      @YM08173*/ 00516000
         MVI   LCBTSTSW(RLCB),X'00'                                0591 00517000
*             TRMINOP=ON;           /* SET NCP INOPERATIVE   @YM08120*/ 00518000
         OI    TRMINOP(RTRM),B'10000000'                           0592 00519000
*             IF LCBSENDN=ON THEN   /* IS 'SENDING' SET              */ 00520000
         TM    LCBSENDN(RLCB),B'00000001'                          0593 00521000
         BNO   @RF00593                                            0593 00522000
*               DO;                 /* YES                           */ 00523000
*                 RPRF=CPAWRTBK;    /* GET ADDR OF THE UNIT THAT   0595 00524000
*                                      POINTS TO THE WRITE BREAK UNIT*/ 00525000
         L     RPRF,CPAWRTBK-1(,RLCB)                              0595 00526000
         LA    RPRF,0(,RPRF)                                       0595 00527000
*                 RWORK=PRFTI0;     /* GET ADDR OF PREFIX OF WRITE 0596 00528000
*                                      BREAK UNIT                    */ 00529000
         L     @07,PRFTI0-1(,RPRF)                                 0596 00530000
         LA    @07,0(,@07)                                         0596 00531000
         LR    RWORK,@07                                           0596 00532000
*                 PRFTI0=PRFTI0+LENGTH(IEDQCCW);/* UPDATE THE ADDR TO   00533000
*                                      POINT TO THE UNIT ITSELF      */ 00534000
         AL    @07,@CF00046                                        0597 00535000
         STCM  @07,7,PRFTI0(RPRF)                                  0597 00536000
*                 RPRF=PRFTI0;      /* POINT TO THE WRITE BREAK UNIT */ 00537000
         LR    RPRF,@07                                            0598 00538000
*                 RPRF->CCW=RWORK->CCW;/* MOVE WRITE BREAK CCW INTO     00539000
*                                      THE UNIT                      */ 00540000
         MVC   CCW(8,RPRF),CCW(RWORK)                              0599 00541000
*                 PRFTIC=PRFINTIC;  /* MAKE TIC ADDR INVALID         */ 00542000
         MVC   PRFTIC(4,RPRF),@CB02288                             0600 00543000
*                 LCBFSBFR=CPAWRTBF;/* SET FIRST WRITE BUFFER      0601 00544000
*                                                            @YM03709*/ 00545000
         MVC   LCBFSBFR(3,RLCB),CPAWRTBF(RLCB)                     0601 00546000
*               END;                                               0602 00547000
*             ELSE                  /* ELSE NOT SENDING      @YM07760*/ 00548000
*               LCBFSBFR=0;         /* INDICATE NO WRITE BTU PRESENT    00549000
*                                                            @YM07760*/ 00550000
         B     @RC00593                                            0603 00551000
@RF00593 SLR   @11,@11                                             0603 00552000
         STCM  @11,7,LCBFSBFR(RLCB)                                0603 00553000
*             INOPAREA=INOPAREA&&INOPAREA;/* CLEAR INOP AREA         */ 00554000
@RC00593 LA    @11,152                                             0604 00555000
         ALR   @11,RLCB                                            0604 00556000
         XC    INOPAREA(48,@11),INOPAREA(@11)                      0604 00557000
*             RPRF=ADDR(INOPAREA);  /* OVERLAY INOP AREA WITH BUFFER    00558000
*                                      STRUCTURE                     */ 00559000
         LR    RPRF,@11                                            0605 00560000
*             PRFPIUO=ADDR(PRFSHDR)-ADDR(PRFSUNIT)-LENGTH(IEDTH)-LENGTH 00561000
*                 (IEDRH);          /* SET OFFSET TO TH              */ 00562000
         LA    @11,17                                              0606 00563000
         STC   @11,PRFPIUO(,RPRF)                                  0606 00564000
*             RWORK=PRFPIUO+ADDR(PRFPIUO);/* POINT TO THE TH IN THE     00565000
*                                      PIU                           */ 00566000
         LA    RWORK,PRFPIUO(,RPRF)                                0607 00567000
         ALR   @11,RWORK                                           0607 00568000
         LR    RWORK,@11                                           0607 00569000
*             TTHFTYPE=TTHFID1;     /* FORMAT TYPE = FID1            */ 00570000
         NI    TTHFTYPE(RWORK),B'00011111'                         0608 00571000
         OI    TTHFTYPE(RWORK),B'00010000'                         0608 00572000
*             TTHBBIU=ON;           /* BEGIN SEGMENT                 */ 00573000
*             TTHEBIU=ON;           /* END SEGMENT                   */ 00574000
         OI    TTHBBIU(RWORK),B'00001100'                          0610 00575000
*             TTHDAF=SAVTSCPT;      /* SET SSCP MH TNT INDEX         */ 00576000
         L     @11,AVTSAVTP(,RAVT)                                 0611 00577000
         MVC   TTHDAF(2,RWORK),SAVTSCPT(@11)                       0611 00578000
*             TTHOAF=LCBTTCIN;      /* 3705 TTE TNT INDEX            */ 00579000
         LH    @07,LCBTTCIN(,RLCB)                                 0612 00580000
         N     @07,@CF02869                                        0612 00581000
         STCM  @07,3,TTHOAF(RWORK)                                 0612 00582000
*             TTHDCF=DCF;           /* SET DATA COUNT                */ 00583000
         MVC   TTHDCF(2,RWORK),@CH02768                            0613 00584000
*             RWORK=RWORK+LENGTH(IEDTH);/* POINT TO THE RH IN THE PIU*/ 00585000
         AL    RWORK,@CF02851                                      0614 00586000
*             TRHFI=ON;             /* FORMAT INDICATOR              */ 00587000
*             TRHBC=ON;             /* BEGIN CHAIN                   */ 00588000
*             TRHEC=ON;             /* END CHAIN                     */ 00589000
         OI    TRHFI(RWORK),B'00001011'                            0617 00590000
*             RWORK=RWORK+LENGTH(IEDRH);/* POINT TO THE RU IN THE PIU*/ 00591000
         AL    RWORK,@CF00075                                      0618 00592000
*             INOPNS=CD1NETS;       /* SET NETWORK SERVICES INDICATOR*/ 00593000
         MVI   INOPNS(RWORK),X'01'                                 0619 00594000
*             INOPPC=CD1CONFS;      /* SET PHYSICAL CONFIGURATION  0620 00595000
*                                      INDICATOR                     */ 00596000
         MVI   INOPPC(RWORK),X'02'                                 0620 00597000
*             INOPCMD=CD1INOP;      /* SET INOPERATIVE COMMAND       */ 00598000
         MVI   INOPCMD(RWORK),X'81'                                0621 00599000
*             RFY                                                  0622 00600000
*               RPARM RSTD;                                        0622 00601000
*             RPARM=LCBTTCIN;       /* GET NCP TNT OFFSET            */ 00602000
         LR    RPARM,@07                                           0623 00603000
*             CALL NAADDR;          /* CALL TNT INDEX TO NETWORK   0624 00604000
*                                      ADDRESS CONVERSION ROUTINE  0624 00605000
*                                      WITH R1=TNT INDEX. R0, R1, AND   00606000
*                                      R15 ARE NOT PRESERVED         */ 00607000
         L     @15,SAVTTNTX(,@11)                                  0624 00608000
         BALR  @14,@15                                             0624 00609000
*             RFY                                                  0625 00610000
*               RBRANCH RSTD;                                      0625 00611000
*             INOPNA=RBRANCH;       /* SET NETWORK ADDR IN RU        */ 00612000
         STCM  RBRANCH,3,INOPNA(RWORK)                             0626 00613000
*             RFY                                                  0627 00614000
*              (RPARM,                                             0627 00615000
*               RBRANCH) UNRSTD;                                   0627 00616000
*             INOPDATA=LINKFAIL;    /* DATA = LINK FAILURE           */ 00617000
         MVI   INOPDATA(RWORK),X'02'                               0628 00618000
*             PRFQCBA=SAVTSSRQ;     /* QUEUE TO SSCP REQUEST HANDLER */ 00619000
         L     @11,AVTSAVTP(,RAVT)                                 0629 00620000
         MVC   PRFQCBA(3,RPRF),SAVTSSRQ+1(@11)                     0629 00621000
*             PRFPRI=PRISCPIN;      /* SET PRIORITY                  */ 00622000
         MVI   PRFPRI(RPRF),X'E5'                                  0630 00623000
*             PRFTIC=PRFINTIC;      /* SET INVALID TIC               */ 00624000
         MVC   PRFTIC(4,RPRF),@CB02288                             0631 00625000
*             CALL READYQ;          /* PUT INOP ON TCX READY QUEUE 0632 00626000
*                                                            @YM03692*/ 00627000
         BAL   @14,READYQ                                          0632 00628000
*           END;                                                   0633 00629000
*       ELSE                                                       0634 00630000
*                                                                  0634 00631000
*         /***********************************************************/ 00632000
*         /*                                                         */ 00633000
*         /* NOT PERMANENT ERROR ON I/O                              */ 00634000
*         /*                                                         */ 00635000
*         /***********************************************************/ 00636000
*                                                                  0634 00637000
*         DO;                                                      0634 00638000
*                                                                  0634 00639000
         B     @RC00582                                            0634 00640000
@RF00582 DS    0H                                                  0635 00641000
*           /*********************************************************/ 00642000
*           /*                                                       */ 00643000
*           /* DETERMINE NEED FOR ERP                                */ 00644000
*           /*                                                       */ 00645000
*           /*********************************************************/ 00646000
*                                                                  0635 00647000
*           IF LCBSTAT1^=DUMPFINL THEN/* IF NOT DUMP FINAL CHANNEL 0635 00648000
*                                      PROGRAM THEN          @YM08434*/ 00649000
         CLI   LCBSTAT1(RLCB),X'FE'                                0635 00650000
         BE    @RF00635                                            0635 00651000
*             DO;                   /* DETERMINE NEED FOR ERROR    0636 00652000
*                                      RECOVERY              @YN08434*/ 00653000
*               IF(LCBSIOC1=ON|LCBSIOC2=ON)|/* IS CONDITION CODE   0637 00654000
*                                      NON-ZERO OR...        @YM02920   00655000
*                                                            @YM06897*/ 00656000
*                   LCBUSUC=ON|     /* ... UNIT CHECK OR ... @YM02920*/ 00657000
*                   LCBCSPCI=ON|    /* ... PROGRAM-CONTROLLED      0637 00658000
*                                      INTERRUPTION OR ...           */ 00659000
*                   LCBCSIL=ON|     /* ... INCORRECT LENGTH OR ...   */ 00660000
*                   LCBCSPGC=ON|    /* ... PROGRAM CHECK OR ...      */ 00661000
*                   LCBCSPTC=ON|    /* ... PROTECTION CHECK OR ...   */ 00662000
*                   LCBCSCDC=ON|    /* ... CHANNEL DATA CHECK OR ... */ 00663000
*                   LCBCSCCC=ON|    /* ... CHANNEL CONTROL CHECK OR     00664000
*                                      ...                           */ 00665000
*                   LCBCSICC=ON|    /* ... INTERFACE CONTROL CHECK OR   00666000
*                                      ...                           */ 00667000
*                   LCBCSCHC=ON THEN/* ... CHAINING CHECK SET ?      */ 00668000
         TM    LCBSIOC1(RLCB),B'00110000'                          0637 00669000
         BNZ   @RT00637                                            0637 00670000
         TM    LCBUSUC(RLCB),B'00000010'                           0637 00671000
         BO    @RT00637                                            0637 00672000
         TM    LCBCSPCI(RLCB),B'11111111'                          0637 00673000
         BZ    @RF00637                                            0637 00674000
@RT00637 DS    0H                                                  0638 00675000
*                 DO;               /* YES, DETERMINE IF ERP REQUEST    00676000
*                                      IS NEEDED                     */ 00677000
*                   RCCW=LCBCSWCA-LENGTH(IEDQCCW);/* INTERRUPT CCW 0639 00678000
*                                      ADDRESS               @OY20744*/ 00679000
         L     RCCW,LCBCSWCA-1(,RLCB)                              0639 00680000
         LA    RCCW,0(,RCCW)                                       0639 00681000
         SL    RCCW,@CF00046                                       0639 00682000
*                   IF(LCBUSUC=ON&  /* IF UNIT CHECK..       @OY20744*/ 00683000
*                       LCBABORT=ON)|/* ..WITH ABORT SENSE(NCP HAS 0640 00684000
*                                      ENTERED ANS)          @OY20744*/ 00685000
*                       (LCBCSIL=ON&/* ..OR INCORRECT LENGTH @OY20744*/ 00686000
*                       LCBUSUE=ON& /* ..AND UNIT EXCEPTION  @OY20744*/ 00687000
*                       (CCWOPCDE=CCWWS0|/* ..AND WRITE START 0    0640 00688000
*                                                            @OY20744*/ 00689000
*                       CCWOPCDE=CCWWS1|/* ..OR WRITE START 1      0640 00690000
*                                                            @OY20744*/ 00691000
*                       CCWOPCDE=CCWWRITE|/* ..OR WRITE      @OY20744*/ 00692000
*                       CCWOPCDE=CCWBRK))/* ..OR WRITE BREAK(NCP IS     00693000
*                                      SIGNALLING SLOWDOWN DURING  0640 00694000
*                                      CHANNEL DATA CHAINING       0640 00695000
*                                      OPERATION)            @OY20744*/ 00696000
*                     THEN                                         0640 00697000
         TM    LCBUSUC(RLCB),B'00000010'                           0640 00698000
         BNO   @GL00012                                            0640 00699000
         TM    LCBABORT(RLCB),B'00000001'                          0640 00700000
         BO    @RT00640                                            0640 00701000
@GL00012 TM    LCBCSIL(RLCB),B'01000000'                           0640 00702000
         BNO   @RF00640                                            0640 00703000
         TM    LCBUSUE(RLCB),B'00000001'                           0640 00704000
         BNO   @RF00640                                            0640 00705000
         CLI   CCWOPCDE(RCCW),X'31'                                0640 00706000
         BE    @RT00640                                            0640 00707000
         CLI   CCWOPCDE(RCCW),X'51'                                0640 00708000
         BE    @RT00640                                            0640 00709000
         CLI   CCWOPCDE(RCCW),X'01'                                0640 00710000
         BE    @RT00640                                            0640 00711000
         CLI   CCWOPCDE(RCCW),X'09'                                0640 00712000
         BNE   @RF00640                                            0640 00713000
@RT00640 DS    0H                                                  0641 00714000
*                     DO;           /* ..THEN TREAT AS SLOWDOWN TO 0641 00715000
*                                      PREVENT WRITES AND CAUSE WAIT    00716000
*                                      FOR ATTENTION TO READ 'EXITING   00717000
*                                      SLOWDOWN' OR 'ANS COMPLETE' 0641 00718000
*                                                            @OY20744*/ 00719000
*                       TRMSLOWN=ON;/* INDICATE SLOWDOWN STATE     0642 00720000
*                                                            @OY20744*/ 00721000
         LA    @04,TRMSLOWN(,RTRM)                                 0642 00722000
         LR    @03,@04                                             0642 00723000
         LA    @11,3                                               0642 00724000
         NR    @03,@11                                             0642 00725000
         LCR   @03,@03                                             0642 00726000
         ALR   @04,@03                                             0642 00727000
         L     @11,0(,@04)                                         0642 00728000
@GL00019 LR    @07,@11                                             0642 00729000
         O     @07,@CB02877+3(@03)                                 0642 00730000
         CS    @11,@07,0(@04)                                      0642 00731000
         BNE   @GL00019                                            0642 00732000
*                       LCBRECVN=OFF;/* PREVENT READ BTU PROCESSING     00733000
*                                                            @YM06060*/ 00734000
         NI    LCBRECVN(RLCB),B'11111101'                          0643 00735000
*                       IF CCWOPCDE=CCWWS0|/* CHECK FOR WRITE START 0   00736000
*                                      ...                           */ 00737000
*                           CCWOPCDE=CCWWS1|/* ... OR WRITE START 1     00738000
*                                      ...                           */ 00739000
*                           CCWOPCDE=CCWWRITE|/* ... OR WRITE DATA 0644 00740000
*                                      ...                           */ 00741000
*                           CCWOPCDE=CCWBRK THEN/* ... OR WRITE BREAK*/ 00742000
         CLI   CCWOPCDE(RCCW),X'31'                                0644 00743000
         BE    @RT00644                                            0644 00744000
         CLI   CCWOPCDE(RCCW),X'51'                                0644 00745000
         BE    @RT00644                                            0644 00746000
         CLI   CCWOPCDE(RCCW),X'01'                                0644 00747000
         BE    @RT00644                                            0644 00748000
         CLI   CCWOPCDE(RCCW),X'09'                                0644 00749000
         BNE   @RF00644                                            0644 00750000
@RT00644 DS    0H                                                  0645 00751000
*                         DO;       /* TREAT INTERRUPT ON WRITE AS 0645 00752000
*                                      UNIT EXCEPTION(SLOWDOWN)    0645 00753000
*                                                            @OY20744*/ 00754000
*                           LCBUSUC=OFF;/* RESET UNIT CHECK ...      */ 00755000
*                           LCBUSUE=ON;/* ... AND SET UNIT EXCEPTION */ 00756000
         OI    LCBUSUE(RLCB),B'00000001'                           0647 00757000
         NI    LCBUSUC(RLCB),B'11111101'                           0647 00758000
*                         END;                                     0648 00759000
*                       ELSE        /* INTERRUPT NOT ON A WRITE    0649 00760000
*                                                            @OY20744*/ 00761000
*                         IF LCBSENDN=ON THEN/* IF WRITE BTU EXISTS     00762000
*                                      IGNORE READ BTU AND FORCE   0649 00763000
*                                      INTERRUPT TO APPEAR AS IF ON     00764000
*                                      NOP IN WRITE BREAK UNIT       */ 00765000
         B     @RC00644                                            0649 00766000
@RF00644 TM    LCBSENDN(RLCB),B'00000001'                          0649 00767000
         BNO   @RF00649                                            0649 00768000
*                           DO;                                    0650 00769000
*                             RPRF=CPAWRTBK;/* POINT TO UNIT WHICH 0651 00770000
*                                      TICS TO WRITE BREAK           */ 00771000
         L     RPRF,CPAWRTBK-1(,RLCB)                              0651 00772000
         LA    RPRF,0(,RPRF)                                       0651 00773000
*                             RPRF=PRFTI0;/* GET WRITE BREAK UNIT  0652 00774000
*                                      ADDRESS                       */ 00775000
         L     @11,PRFTI0-1(,RPRF)                                 0652 00776000
         LA    @11,0(,@11)                                         0652 00777000
         LR    RPRF,@11                                            0652 00778000
*                             LCBCSWCA=RPRF+2*LENGTH(IEDQCCW);/*   0653 00779000
*                                      POINT CSW PAST NOP            */ 00780000
         LA    @11,16                                              0653 00781000
         ALR   @11,RPRF                                            0653 00782000
         STCM  @11,7,LCBCSWCA(RLCB)                                0653 00783000
*                             LCBUSUC=OFF;/* HANDLE AS NORMAL FROM 0654 00784000
*                                      HERE ON                       */ 00785000
         NI    LCBUSUC(RLCB),B'11111101'                           0654 00786000
*                           END;                                   0655 00787000
*                         ELSE      /* ELSE NOT SENDING, MUST TREAT     00788000
*                                      AS IF READ ENDED NORMALLY BUT    00789000
*                                      WITH NO DATA                  */ 00790000
*                           LCBCSWCA=LCBSTART+LENGTH(IEDQCCW);/*   0656 00791000
*                                      TREAT AS INTERRUPT ON READ  0656 00792000
*                                      START                         */ 00793000
         B     @RC00649                                            0656 00794000
@RF00649 LA    @11,8                                               0656 00795000
         L     @07,LCBSTART-1(,RLCB)                               0656 00796000
         LA    @07,0(,@07)                                         0656 00797000
         ALR   @11,@07                                             0656 00798000
         STCM  @11,7,LCBCSWCA(RLCB)                                0656 00799000
*                     END;                                         0657 00800000
*                   ELSE            /* ELSE NOT UNIT CHECK ABORT OR     00801000
*                                      SLOWDOWN              @OY20744*/ 00802000
*                     IF LCBSIOC2=ON&LCBSIOC1=OFF&/* IF CSW STORED ON   00803000
*                                      NOP                   @XM05727*/ 00804000
*                         LCBSTART->CCWOPCDE=CCWNOP THEN/*   @OZ26027*/ 00805000
         B     @RC00640                                            0658 00806000
@RF00640 TM    LCBSIOC2(RLCB),B'00010000'                          0658 00807000
         BNO   @RF00658                                            0658 00808000
         TM    LCBSIOC1(RLCB),B'00100000'                          0658 00809000
         BNZ   @RF00658                                            0658 00810000
         L     @11,LCBSTART-1(,RLCB)                               0658 00811000
         CLI   CCWOPCDE(@11),X'03'                                 0658 00812000
         BNE   @RF00658                                            0658 00813000
*                       IF LCBOBRCH^=ZERO THEN/* ANY MDR RECORDS   0659 00814000
*                                                            @OZ26027*/ 00815000
         L     @11,LCBOBRCH(,RLCB)                                 0659 00816000
         LTR   @11,@11                                             0659 00817000
         BZ    @RF00659                                            0659 00818000
*                         DO;       /*                       @OZ26027*/ 00819000
*                           LCBSOHR=ON;/* INDICATE MDR PROCESSING  0661 00820000
*                                                            @OZ26027*/ 00821000
         OI    LCBSOHR(RLCB),B'00100000'                           0661 00822000
*                           RSTATE=ERP;/* YES, REQUEST ERP   @OZ26027*/ 00823000
         LA    RSTATE,4                                            0662 00824000
*                         END;      /*                       @OZ26027*/ 00825000
*                       ELSE                                       0664 00826000
*                         ;         /*                       @OZ26027*/ 00827000
@RF00659 DS    0H                                                  0665 00828000
*                     ELSE          /* IT IS NOT CSW STORED ON NOP 0665 00829000
*                                                            @XM05727*/ 00830000
*                       RSTATE=ERP; /* REQUEST EXIT TO ERROR RECOVERY*/ 00831000
         B     @RC00658                                            0665 00832000
@RF00658 LA    RSTATE,4                                            0665 00833000
*                 END;                                             0666 00834000
*               ELSE                /* NO CSW ERROR BITS SET         */ 00835000
*                 IF LCBOBRCH^=ZERO THEN/* ANY MDR RECORDS           */ 00836000
         B     @RC00637                                            0667 00837000
@RF00637 L     @11,LCBOBRCH(,RLCB)                                 0667 00838000
         LTR   @11,@11                                             0667 00839000
         BZ    @RF00667                                            0667 00840000
*                   DO;             /*                       @YM03744*/ 00841000
*                     LCBSOHR=ON;   /* INDICATE MDR PROCESSING     0669 00842000
*                                                            @YM03744*/ 00843000
         OI    LCBSOHR(RLCB),B'00100000'                           0669 00844000
*                     RSTATE=ERP;   /* YES, REQUEST ERP              */ 00845000
         LA    RSTATE,4                                            0670 00846000
*                   END;            /*                       @YM03744*/ 00847000
*             END;                  /*                       @YM08434*/ 00848000
@RF00667 DS    0H                                                  0672 00849000
@RC00637 DS    0H                                                  0673 00850000
*           IF RSTATE=ERP           /* IS ERP REQUESTED              */ 00851000
*                                                                  0673 00852000
*           /*********************************************************/ 00853000
*           /*                                                       */ 00854000
*           /* ERP IS REQUESTED                                      */ 00855000
*           /*                                                       */ 00856000
*           /*********************************************************/ 00857000
*                                                                  0673 00858000
*             THEN                                                 0673 00859000
@RF00635 C     RSTATE,@CF00257                                     0673 00860000
         BE    @RT00673                                            0673 00861000
*             ;                     /* YES, NO PROCESSING            */ 00862000
*           ELSE                                                   0675 00863000
*                                                                  0675 00864000
*             /*******************************************************/ 00865000
*             /*                                                     */ 00866000
*             /* NO ERP IS REQUESTED                                 */ 00867000
*             /*                                                     */ 00868000
*             /*******************************************************/ 00869000
*                                                                  0675 00870000
*             IF TRMIPLDM=ON THEN   /* IS IPL OR DUMP IN PROGRESS    */ 00871000
*                                                                  0675 00872000
         TM    TRMIPLDM(RTRM),B'10000000'                          0675 00873000
         BNO   @RF00675                                            0675 00874000
*               /*****************************************************/ 00875000
*               /*                                                   */ 00876000
*               /* IPL OR DUMP IS IN PROGRESS                        */ 00877000
*               /*                                                   */ 00878000
*               /*****************************************************/ 00879000
*                                                                  0676 00880000
*               DO;                 /* YES                           */ 00881000
*                 LCBQCBA=SAVTFLDH; /* QCB ADDRESS FOR POST  @YM02949*/ 00882000
         L     @11,AVTSAVTP(,RAVT)                                 0677 00883000
         MVC   LCBQCBA(3,RLCB),SAVTFLDH+1(@11)                     0677 00884000
*                 LCBPRI=PRIAIPL;   /* AND PRIORITY          @YM02949*/ 00885000
         MVI   LCBPRI(RLCB),X'DE'                                  0678 00886000
*                 RPRF=RLCB;        /* PARAMETER TO POST     @YM02949*/ 00887000
         LR    RPRF,RLCB                                           0679 00888000
*                 CALL READYQ;      /* PUT ELEMENT ON DISABLED READY    00889000
*                                      QUEUE                         */ 00890000
         BAL   @14,READYQ                                          0680 00891000
*               END;                                               0681 00892000
*             ELSE                                                 0682 00893000
*                                                                  0682 00894000
*               /*****************************************************/ 00895000
*               /*                                                   */ 00896000
*               /* NO IPL OR DUMP IN PROGRESS                        */ 00897000
*               /*                                                   */ 00898000
*               /*****************************************************/ 00899000
*                                                                  0682 00900000
*               DO;                                                0682 00901000
*                                                                  0682 00902000
         B     @RC00675                                            0682 00903000
@RF00675 DS    0H                                                  0683 00904000
*                 /***************************************************/ 00905000
*                 /*                                                 */ 00906000
*                 /* SET SLOWDOWN IF UNIT EXCEPTION ON A WRITE       */ 00907000
*                 /*                                                 */ 00908000
*                 /***************************************************/ 00909000
*                                                                  0683 00910000
*                 RCCW=LCBCSWCA-LENGTH(IEDQCCW);/* POINT TO        0683 00911000
*                                      INTERRUPTED CCW               */ 00912000
         L     RCCW,LCBCSWCA-1(,RLCB)                              0683 00913000
         LA    RCCW,0(,RCCW)                                       0683 00914000
         SL    RCCW,@CF00046                                       0683 00915000
*                 IF LCBUSUE=ON THEN/* UNIT EXCEPTION SET            */ 00916000
         TM    LCBUSUE(RLCB),B'00000001'                           0684 00917000
         BNO   @RF00684                                            0684 00918000
*                   IF CCWOPCDE=CCWWS0|/* YES, IS THIS               */ 00919000
*                       CCWOPCDE=CCWWS1|/* ... A                     */ 00920000
*                       CCWOPCDE=CCWWRITE|/* ... WRITE               */ 00921000
*                       CCWOPCDE=CCWBRK THEN/* ... OPERATION         */ 00922000
         CLI   CCWOPCDE(RCCW),X'31'                                0685 00923000
         BE    @RT00685                                            0685 00924000
         CLI   CCWOPCDE(RCCW),X'51'                                0685 00925000
         BE    @RT00685                                            0685 00926000
         CLI   CCWOPCDE(RCCW),X'01'                                0685 00927000
         BE    @RT00685                                            0685 00928000
         CLI   CCWOPCDE(RCCW),X'09'                                0685 00929000
         BNE   @RF00685                                            0685 00930000
@RT00685 DS    0H                                                  0686 00931000
*                     DO;           /*                       @YM06060*/ 00932000
*                       TRMSLOWN=ON;/* YES ,SET SLOWDOWN             */ 00933000
         LA    @04,TRMSLOWN(,RTRM)                                 0687 00934000
         LR    @03,@04                                             0687 00935000
         LA    @11,3                                               0687 00936000
         NR    @03,@11                                             0687 00937000
         LCR   @03,@03                                             0687 00938000
         ALR   @04,@03                                             0687 00939000
         L     @11,0(,@04)                                         0687 00940000
@GL00027 LR    @07,@11                                             0687 00941000
         O     @07,@CB02877+3(@03)                                 0687 00942000
         CS    @11,@07,0(@04)                                      0687 00943000
         BNE   @GL00027                                            0687 00944000
*                       LCBRECVN=OFF;/* PREVENT READ BTU PROCESSING     00945000
*                                                            @YM06060*/ 00946000
*                                                                  0688 00947000
         NI    LCBRECVN(RLCB),B'11111101'                          0688 00948000
*                       /*********************************************/ 00949000
*                       /*                                           */ 00950000
*                       /* FORCE ATTENTION - NCP MUST BE READ BEFORE */ 00951000
*                       /* IT WILL BE ABLE TO RECEIVE THE ACTPU      */ 00952000
*                       /* REQUEST                           @XM05839*/ 00953000
*                       /*                                           */ 00954000
*                       /*********************************************/ 00955000
*                                                                  0689 00956000
*                       RFY                                        0689 00957000
*                        (REG7,                                    0689 00958000
*                         REG11) RSTD;/*                     @XM05839*/ 00959000
*                       GEN REFS(LCBBFRAV,CSMASK2,CSMASK3) SETS(REG7,   00960000
*                           REG11,LCBBFRAV);                       0690 00961000
         L     REG11,LCBBFRAV-3(,RLCB)   WORD CONTAINING BITS @XM05839  00962000
CSLOOP5  EQU   *                                              @XM05839  00963000
         LR    REG7,REG11                PREPARE WORK REG     @XM05839  00964000
         O     REG7,CSMASK2              TURN ON  LCBATTN     @XM05839  00965000
         O     REG7,CSMASK3              TURN ON LCBBFRAV     @XM05839  00966000
         CS    REG11,REG7,LCBBFRAV-3(RLCB) TURN ON IN LCB     @XM05839  00967000
         BNE   CSLOOP5                   DID NOT WORK         @XM05839  00968000
*                       RFY                                        0691 00969000
*                        (REG7,                                    0691 00970000
*                         REG11) UNRSTD;/*                   @XM05839*/ 00971000
*                     END;          /*                       @YM06060*/ 00972000
*                 IF LCBSENDN=ON THEN/* IS 'SENDING' SET             */ 00973000
*                                                                  0693 00974000
@RF00685 DS    0H                                                  0693 00975000
@RF00684 TM    LCBSENDN(RLCB),B'00000001'                          0693 00976000
         BNO   @RF00693                                            0693 00977000
*                   /*************************************************/ 00978000
*                   /*                                               */ 00979000
*                   /* SENDING - THEN REBUILD THE WRITE BREAK. RPRF  */ 00980000
*                   /* IS INITIALIZED FOR LATER REFERENCE TO POINT TO*/ 00981000
*                   /* THE UNIT THAT CONTAINS THE WRITE BREAK CCW IN */ 00982000
*                   /* ITS PREFIX.                                   */ 00983000
*                   /*                                               */ 00984000
*                   /*************************************************/ 00985000
*                                                                  0694 00986000
*                   DO;             /* YES                           */ 00987000
*                     IF CCWOPCDE=CCWWS0|/* DO NOT FLIP WRITE START     00988000
*                                                            @YM09094*/ 00989000
*                         CCWOPCDE=CCWWS1 THEN                     0695 00990000
         CLI   CCWOPCDE(RCCW),X'31'                                0695 00991000
         BE    @RT00695                                            0695 00992000
         CLI   CCWOPCDE(RCCW),X'51'                                0695 00993000
         BE    @RT00695                                            0695 00994000
*                       ;           /* CODE IF INTERRUPT ON WRITE  0696 00995000
*                                      START                 @YM09094*/ 00996000
*                     ELSE          /*                       @YM09094*/ 00997000
*                       CPAWRTS=CPAWRTS&&FLIP;/* CHANGE THE WRITE  0697 00998000
*                                      START VALUE                   */ 00999000
         XI    CPAWRTS(RLCB),X'60'                                 0697 01000000
*                     RPRF=CPAWRTBK;/* GET ADDR OF THE UNIT THAT   0698 01001000
*                                      POINTS TO THE WRITE BREAK UNIT*/ 01002000
@RT00695 L     RPRF,CPAWRTBK-1(,RLCB)                              0698 01003000
         LA    RPRF,0(,RPRF)                                       0698 01004000
*                     RWORK=PRFTI0; /* GET ADDR OF PREFIX OF WRITE 0699 01005000
*                                      BREAK UNIT                    */ 01006000
         L     @07,PRFTI0-1(,RPRF)                                 0699 01007000
         LA    @07,0(,@07)                                         0699 01008000
         LR    RWORK,@07                                           0699 01009000
*                     PRFTI0=PRFTI0+LENGTH(IEDQCCW);/* UPDATE THE  0700 01010000
*                                      ADDR TO POINT TO THE UNIT   0700 01011000
*                                      ITSELF                        */ 01012000
         AL    @07,@CF00046                                        0700 01013000
         STCM  @07,7,PRFTI0(RPRF)                                  0700 01014000
*                     RPRF=PRFTI0;  /* POINT TO THE WRITE BREAK UNIT */ 01015000
         LR    RPRF,@07                                            0701 01016000
*                     RPRF->CCW=RWORK->CCW;/* MOVE WRITE BREAK CCW 0702 01017000
*                                      INTO THE UNIT                 */ 01018000
         MVC   CCW(8,RPRF),CCW(RWORK)                              0702 01019000
*                     PRFTIC=PRFINTIC;/* MAKE TIC ADDR INVALID       */ 01020000
         MVC   PRFTIC(4,RPRF),@CB02288                             0703 01021000
*                     LCBFSBFR=CPAWRTBF;/* SET FIRST WRITE BUFFER  0704 01022000
*                                                            @YM03709*/ 01023000
         MVC   LCBFSBFR(3,RLCB),CPAWRTBF(RLCB)                     0704 01024000
*                   END;                                           0705 01025000
*                 IF LCBRECVN=ON THEN/* IS 'RECEIVING' SET           */ 01026000
*                                                                  0706 01027000
@RF00693 TM    LCBRECVN(RLCB),B'00000010'                          0706 01028000
         BNO   @RF00706                                            0706 01029000
*                   /*************************************************/ 01030000
*                   /*                                               */ 01031000
*                   /* RECEIVING IS SET                              */ 01032000
*                   /*                                               */ 01033000
*                   /*************************************************/ 01034000
*                                                                  0707 01035000
*                   DO;             /* YES                           */ 01036000
*                     IF(LCBUSUC=ON&/* CHECK FOR UNIT CHECK        0708 01037000
*                                      ...@ZM46688                   */ 01038000
*                         LCBABORT=ON) THEN/* .. WITH SENSE OF ABORT    01039000
*                                                            @ZM46688*/ 01040000
         TM    LCBUSUC(RLCB),B'00000010'                           0708 01041000
         BNO   @RF00708                                            0708 01042000
         TM    LCBABORT(RLCB),B'00000001'                          0708 01043000
         BNO   @RF00708                                            0708 01044000
*                       DO;         /* NCP IS IN ANS         @ZM46688*/ 01045000
*                         RFY                                      0710 01046000
*                          (REG7,                                  0710 01047000
*                           REG11) RSTD;/* RESTRICT REGISTERS FOR CS    01048000
*                                      LOOP                  @YM04622*/ 01049000
*                         GEN REFS(LCBBFRAV,CSMASK3) SETS(REG7,REG11,   01050000
*                             LCBBFRAV);                           0711 01051000
*                                                     /* @YM04622*/     01052000
         L     REG11,LCBBFRAV-3(,RLCB)  WORD CONTAINS LCBBFRAV @YM04622 01053000
CSLOOP4  EQU   *                                               @YM04622 01054000
         LR    REG7,REG11               COPY WORD TO UPDATE    @YM04622 01055000
         O     REG7,CSMASK3             SET LCBBFRAV           @YM04622 01056000
         CS    REG11,REG7,LCBBFRAV-3(RLCB) CS LCBBFRAV         @YM04622 01057000
         BNE   CSLOOP4                  LOOP IF CS FAILED      @YM04622 01058000
*                         RFY                                      0712 01059000
*                          (REG7,                                  0712 01060000
*                           REG11) UNRSTD;/*                 @YM04622*/ 01061000
*                         LCBTSTSW=ZERO;/* FREE LCB FOR I/O          */ 01062000
         MVI   LCBTSTSW(RLCB),X'00'                                0713 01063000
*                       END;                                       0714 01064000
*                     ELSE          /* CHEK FOR NULL READ    @ZM47776*/ 01065000
*                       IF CCWOPCDE=CCWRS0|CCWOPCDE=CCWRS1 THEN/*  0715 01066000
*                                      NULL READ             @ZM47776*/ 01067000
         B     @RC00708                                            0715 01068000
@RF00708 CLI   CCWOPCDE(RCCW),X'32'                                0715 01069000
         BE    @RT00715                                            0715 01070000
         CLI   CCWOPCDE(RCCW),X'52'                                0715 01071000
         BNE   @RF00715                                            0715 01072000
@RT00715 DS    0H                                                  0716 01073000
*                         DO;                                      0716 01074000
*                           RFY                                    0717 01075000
*                            (REG7,                                0717 01076000
*                             REG11) RSTD;/* RESTRICT FOR COMP SWAP     01077000
*                                                            @ZM47776*/ 01078000
*                           GEN REFS(LCBBFRAV,CSMASK3,CSMASK4,CSMASK5)  01079000
*                               SETS(REG7,REG11,LCBBFRAV);         0718 01080000
*               /* @ZM47776*/                                           01081000
         L     REG11,LCBBFRAV-3(RLCB)   WORD CONTAINS BITS     @ZM47776 01082000
CSLOOP6  LR    REG7,REG11               COPY WORD TO UPDATE    @ZM47776 01083000
         O     REG7,CSMASK3             SET LCBBFRAV           @ZM47776 01084000
         O     REG7,CSMASK5             SET LCBFREEN           @ZM47776 01085000
         N     REG7,CSMASK4             TURN OFF LCBRECVN      @ZM47776 01086000
         CS    REG11,REG7,LCBBFRAV-3(RLCB) CS LCBBFRAV         @ZM47776 01087000
         BNE   CSLOOP6                  TRY AGAIN              @ZM47776 01088000
*                           RFY                                    0719 01089000
*                            (REG7,                                0719 01090000
*                             REG11) UNRSTD;/*               @ZM47776*/ 01091000
*                           LCBTSTSW=ZERO;/* FREE LCB FOR I/O      0720 01092000
*                                                            @ZM47776*/ 01093000
         MVI   LCBTSTSW(RLCB),X'00'                                0720 01094000
*                         END;      /* END NULL READ         @ZM47776*/ 01095000
*                       ELSE        /* NORMAL PROCESSING     @ZM47776*/ 01096000
*                         IF LCBSENDN=ON&/* IS 'SENDING' SET AND ... */ 01097000
*                             RCCW=RPRF THEN/* ... WAS INTERRUPT ON     01098000
*                                      NO-OP IN WRITE BREAK          */ 01099000
*                                                                  0722 01100000
         B     @RC00715                                            0722 01101000
@RF00715 TM    LCBSENDN(RLCB),B'00000001'                          0722 01102000
         BNO   @RF00722                                            0722 01103000
         CR    RCCW,RPRF                                           0722 01104000
         BNE   @RF00722                                            0722 01105000
*                           /*****************************************/ 01106000
*                           /*                                       */ 01107000
*                           /* INTERRUPT WAS ON THE NO-OP OF THE     */ 01108000
*                           /* WRITE BREAK UNIT. IN THE 'REBUILD     */ 01109000
*                           /* WRITE BREAK' CODE, RPRF WAS SET TO    */ 01110000
*                           /* POINT TO THE UNIT THAT CONTAINS THE   */ 01111000
*                           /* WRITE BREAK CCW.                      */ 01112000
*                           /*                                       */ 01113000
*                           /*****************************************/ 01114000
*                                                                  0723 01115000
*                           DO;     /*                       @YM04622*/ 01116000
*                             RFY                                  0724 01117000
*                              (REG7,                              0724 01118000
*                               REG11) RSTD;/* RESTRICT REGISTERS FOR   01119000
*                                      CS LOOP               @YM04622*/ 01120000
*                             GEN REFS(LCBBFRAV,CSMASK3) SETS(REG7,     01121000
*                                 REG11,LCBBFRAV);                 0725 01122000
*                                                     /* @YM04622*/     01123000
         L     REG11,LCBBFRAV-3(,RLCB)  WORD CONTAINS LCBBFRAV @YM04622 01124000
CSLOOP3  EQU   *                                               @YM04622 01125000
         LR    REG7,REG11               COPY WORD TO UPDATE    @YM04622 01126000
         O     REG7,CSMASK3             SET LCBBFRAV           @YM04622 01127000
         CS    REG11,REG7,LCBBFRAV-3(RLCB) CS LCBBFRAV         @YM04622 01128000
         BNE   CSLOOP3                  LOOP IF CS FAILED      @YM04622 01129000
*                             RFY                                  0726 01130000
*                              (REG7,                              0726 01131000
*                               REG11) UNRSTD;/*             @YM04622*/ 01132000
*                           END;    /*                       @YM04622*/ 01133000
*                         ELSE                                     0728 01134000
*                                                                  0728 01135000
*                           /*****************************************/ 01136000
*                           /*                                       */ 01137000
*                           /* INTERRUPT NOT ON WRITE BREAK NO-OP    */ 01138000
*                           /*                                       */ 01139000
*                           /*****************************************/ 01140000
*                                                                  0728 01141000
*                           DO;                                    0728 01142000
         B     @RC00722                                            0728 01143000
@RF00722 DS    0H                                                  0729 01144000
*                             IF CCWCOUNT=LCBCSWRC&/* DOES ORIGINAL     01145000
*                                      COUNT IN CCW EQUAL THE      0729 01146000
*                                      RESIDUAL COUNT IN THE CSW ... */ 01147000
*                                 CCWOPCDE=CCWREAD THEN/* ... FOR A     01148000
*                                      READ CCW                      */ 01149000
*                                                                  0729 01150000
         LH    @11,LCBCSWRC(,RLCB)                                 0729 01151000
         N     @11,@CF02869                                        0729 01152000
         ICM   @07,12,CCWCOUNT(RCCW)                               0729 01153000
         SRA   @07,16                                              0729 01154000
         CR    @11,@07                                             0729 01155000
         BNE   @RF00729                                            0729 01156000
         CLI   CCWOPCDE(RCCW),X'02'                                0729 01157000
         BNE   @RF00729                                            0729 01158000
*                               /*************************************/ 01159000
*                               /*                                   */ 01160000
*                               /* INTERRUPTED READ CCW CONTAINS NO  */ 01161000
*                               /* DATA. UPDATE CSW SO THAT PREVIOUS */ 01162000
*                               /* READ APPEARS TO BE INTERRUPTED    */ 01163000
*                               /* CCW.                              */ 01164000
*                               /*                                   */ 01165000
*                               /*************************************/ 01166000
*                                                                  0730 01167000
*                               DO; /* YES                           */ 01168000
*                                 RWORK=CPARDU;/* GET ADDRESS OF 1ST    01169000
*                                      READ                          */ 01170000
         L     RWORK,CPARDU-1(,RLCB)                               0731 01171000
         LA    RWORK,0(,RWORK)                                     0731 01172000
*                                 DO UNTIL LCBCSWRC=ZERO;/* LOOP   0732 01173000
*                                      THROUGH READS UNTIL CCW THAT     01174000
*                                      PRECEEDS THE INTERRUPTED ONE     01175000
*                                      IS FOUND                      */ 01176000
@DL00732 DS    0H                                                  0733 01177000
*                                   IF RCCW=RWORK->PRFTI0 THEN/* DOES   01178000
*                                      THIS UNIT TIC TO THE        0733 01179000
*                                      INTERRUPTED CCW               */ 01180000
         L     @11,PRFTI0-1(,RWORK)                                0733 01181000
         LA    @11,0(,@11)                                         0733 01182000
         CR    RCCW,@11                                            0733 01183000
         BNE   @RF00733                                            0733 01184000
*                                    DO;/* YES                       */ 01185000
*                                     LCBCSWCA=RWORK+LENGTH(IEDQCCW);   01186000
         LA    @11,8                                               0735 01187000
         ALR   @11,RWORK                                           0735 01188000
         STCM  @11,7,LCBCSWCA(RLCB)                                0735 01189000
*                                     /* UPDATE CSW TO POINT TO CCW     01190000
*                                      AFTER LAST EXECUTED READ CCW  */ 01191000
*                                     RCCW=RWORK;/* SAVE NEW       0736 01192000
*                                      INTERRUPTED CCW ADDRESS       */ 01193000
         LR    RCCW,RWORK                                          0736 01194000
*                                     LCBCSWRC=ZERO;/* CLEAR RESIDUAL   01195000
*                                      COUNT                         */ 01196000
         SLR   @11,@11                                             0737 01197000
         STH   @11,LCBCSWRC(,RLCB)                                 0737 01198000
*                                    END;                          0738 01199000
*                                   ELSE                           0739 01200000
*                                    RWORK=RWORK->PRFTI0;/* POINT TO    01201000
*                                      NEXT UNIT                     */ 01202000
         B     @RC00733                                            0739 01203000
@RF00733 L     @11,PRFTI0-1(,RWORK)                                0739 01204000
         LA    @11,0(,@11)                                         0739 01205000
         LR    RWORK,@11                                           0739 01206000
*                                 END;                             0740 01207000
@RC00733 DS    0H                                                  0740 01208000
@DE00732 LH    @11,LCBCSWRC(,RLCB)                                 0740 01209000
         N     @11,@CF02869                                        0740 01210000
         LTR   @11,@11                                             0740 01211000
         BNZ   @DL00732                                            0740 01212000
*                               END;                               0741 01213000
*                             CPARDS=CPARDS&&FLIP;/* CHANGE THE READ    01214000
*                                      START VALUE                   */ 01215000
@RF00729 XI    CPARDS(RLCB),X'60'                                  0742 01216000
*                             IF LCBSENDN=ON THEN/* IS 'SENDING' SET */ 01217000
*                                                                  0743 01218000
         TM    LCBSENDN(RLCB),B'00000001'                          0743 01219000
         BNO   @RF00743                                            0743 01220000
*                               /*************************************/ 01221000
*                               /*                                   */ 01222000
*                               /* 'SENDING' IS SET. IN THE 'REBUILD */ 01223000
*                               /* WRITE BREAK' CODE, RPRF WAS SET TO*/ 01224000
*                               /* POINT TO THE UNIT THAT CONTAINS   */ 01225000
*                               /* THE WRITE BREAK CCW.              */ 01226000
*                               /*                                   */ 01227000
*                               /*************************************/ 01228000
*                                                                  0744 01229000
*                               PRFTI0=CPARDU;/* TIC THE WRITE BREAK    01230000
*                                      UNIT TO THE 1ST READ UNIT     */ 01231000
         MVC   PRFTI0(3,RPRF),CPARDU(RLCB)                         0744 01232000
*                             ELSE                                 0745 01233000
*                                                                  0745 01234000
*                               /*************************************/ 01235000
*                               /*                                   */ 01236000
*                               /* 'SENDING' IS NOT SET              */ 01237000
*                               /*                                   */ 01238000
*                               /*************************************/ 01239000
*                                                                  0745 01240000
*                               LCBFSBFR=CPARDU;/* POINT TO FIRST  0745 01241000
*                                      READ UNIT                     */ 01242000
         B     @RC00743                                            0745 01243000
@RF00743 MVC   LCBFSBFR(3,RLCB),CPARDU(RLCB)                       0745 01244000
*                             IF CCWOPCDE=CCWREAD THEN/* WAS       0746 01245000
*                                      INTERRUPTED CCW A READ        */ 01246000
@RC00743 CLI   CCWOPCDE(RCCW),X'02'                                0746 01247000
         BNE   @RF00746                                            0746 01248000
*                               DO; /* YES                           */ 01249000
*                                 LCBRDBFR=RCCW->PRFTI0;/* SAVE NEXT    01250000
*                                      AVAILABLE READ UNIT           */ 01251000
         MVC   LCBRDBFR(3,RLCB),PRFTI0(RCCW)                       0748 01252000
*                                 RCCW->PRFTIC=PRFINTIC;/* SET     0749 01253000
*                                      INVALID TIC                   */ 01254000
         MVC   PRFTIC(4,RCCW),@CB02288                             0749 01255000
*                                 IF TRMINPG=ON THEN/* ARE WE IN   0750 01256000
*                                      ACTIVATE/DEACT PROCESS      0750 01257000
*                                                            @ZM47844*/ 01258000
         TM    TRMINPG(RTRM),B'00100000'                           0750 01259000
         BNO   @RF00750                                            0750 01260000
*                                   TRMSLOWN=OFF;/* TURN OFF SLOWDOWN   01261000
*                                      IF ON                 @ZM47844*/ 01262000
         LA    @04,TRMSLOWN(,RTRM)                                 0751 01263000
         LR    @03,@04                                             0751 01264000
         LA    @11,3                                               0751 01265000
         NR    @03,@11                                             0751 01266000
         LCR   @03,@03                                             0751 01267000
         ALR   @04,@03                                             0751 01268000
         L     @11,0(,@04)                                         0751 01269000
@GL00033 LR    @07,@11                                             0751 01270000
         N     @07,@CB02883+3(@03)                                 0751 01271000
         CS    @11,@07,0(@04)                                      0751 01272000
         BNE   @GL00033                                            0751 01273000
*                                 ELSE                             0752 01274000
*                                   ;/* LEAVE SLOWDOWN ALONE @ZM47844*/ 01275000
@RF00750 DS    0H                                                  0753 01276000
*                               END;                               0753 01277000
*                             ELSE  /*                       @YM03710*/ 01278000
*                               DO; /*                       @YM03710*/ 01279000
         B     @RC00746                                            0754 01280000
@RF00746 DS    0H                                                  0755 01281000
*                                 RWORK=LCBRDBFR;/* GET ADDR OF 1ST     01282000
*                                      READ UNIT             @YM03710*/ 01283000
         L     RWORK,LCBRDBFR-1(,RLCB)                             0755 01284000
         LA    RWORK,0(,RWORK)                                     0755 01285000
*                                 DO UNTIL RWORK->PRFTI0=ADDR(CPARNOOP) 01286000
*                                       ;/* SCAN READ CHAIN UNTIL  0756 01287000
*                                      LAST UNIT IS FOUND            */ 01288000
@DL00756 DS    0H                                                  0757 01289000
*                                   RWORK=RWORK->PRFTI0;/* GET ADDR     01290000
*                                      OF NEXT UNIT                  */ 01291000
         L     @11,PRFTI0-1(,RWORK)                                0757 01292000
         LA    @11,0(,@11)                                         0757 01293000
         LR    RWORK,@11                                           0757 01294000
*                                 END;                             0758 01295000
@DE00756 LA    @11,CPARNOOP(,RLCB)                                 0758 01296000
         L     @07,PRFTI0-1(,RWORK)                                0758 01297000
         LA    @07,0(,@07)                                         0758 01298000
         CR    @11,@07                                             0758 01299000
         BNE   @DL00756                                            0758 01300000
*                                 RWORK->PRFTIC=PRFINTIC;/* END THE     01301000
*                                      READ CHAIN WITH AN INVALID TIC*/ 01302000
         MVC   PRFTIC(4,RWORK),@CB02288                            0759 01303000
*                                 LCBRDBFR=ADDR(CPARNOOP);/* POINT 0760 01304000
*                                      START OF READ CHANNEL PROGRAM    01305000
*                                      TO THE NO-OP CCW              */ 01306000
         STCM  @11,7,LCBRDBFR(RLCB)                                0760 01307000
*                               END;                               0761 01308000
*                           END;                                   0762 01309000
*                   END;            /*                       @YM03694*/ 01310000
*                 ELSE                                             0764 01311000
*                                                                  0764 01312000
*                   /*************************************************/ 01313000
*                   /*                                               */ 01314000
*                   /* RECEIVING WAS NOT SET                         */ 01315000
*                   /*                                               */ 01316000
*                   /*************************************************/ 01317000
*                                                                  0764 01318000
*                   IF RCCW=ADDR(CPAWNOOP) THEN/* WAS STATUS MODIFIER   01319000
*                                      RECEIVED                      */ 01320000
         B     @RC00706                                            0764 01321000
@RF00706 LA    @11,CPAWNOOP(,RLCB)                                 0764 01322000
         CR    RCCW,@11                                            0764 01323000
         BNE   @RF00764                                            0764 01324000
*                     DO;           /*                       @YM04622*/ 01325000
*                       RFY                                        0766 01326000
*                        (REG7,                                    0766 01327000
*                         REG11) RSTD;/* RESTRICT REGISTERS FOR CS 0766 01328000
*                                      LOOP                  @YM04622*/ 01329000
*                       GEN REFS(LCBATTN,CSMASK2) SETS(REG7,REG11, 0767 01330000
*                           LCBATTN);                              0767 01331000
*                                                   /* @YM04622*/       01332000
         L     REG11,LCBATTN-3(,RLCB)   WORD CONTAINS LCBATTN  @YM04622 01333000
CSLOOP2  EQU   *                                               @YM04622 01334000
         LR    REG7,REG11               COPY WORD TO UPDATE    @YM04622 01335000
         O     REG7,CSMASK2             SET LCBATTN            @YM04622 01336000
         CS    REG11,REG7,LCBATTN-3(RLCB) CS LCBATTN           @YM04622 01337000
         BNE   CSLOOP2                  LOOP IF CS FAILED      @YM04622 01338000
*                       RFY                                        0768 01339000
*                        (REG7,                                    0768 01340000
*                         REG11) UNRSTD;/*                   @YM04622*/ 01341000
*                     END;          /*                       @YM04622*/ 01342000
*                                                                  0770 01343000
*                 /***************************************************/ 01344000
*                 /*                                                 */ 01345000
*                 /* POST BTU TO FLDH                                */ 01346000
*                 /*                                                 */ 01347000
*                 /***************************************************/ 01348000
*                                                                  0770 01349000
*                 IF LCBFSBFR^=ZERO THEN/* CHECK FOR BTU TO POST     */ 01350000
@RF00764 DS    0H                                                  0770 01351000
@RC00706 L     @11,LCBFSBFR-1(,RLCB)                               0770 01352000
         LA    @11,0(,@11)                                         0770 01353000
         LTR   @11,@11                                             0770 01354000
         BZ    @RF00770                                            0770 01355000
*                   DO;                                            0771 01356000
*                     RPRF=LCBFSBFR;/* GET ADDR OF BTU               */ 01357000
         LR    RPRF,@11                                            0772 01358000
*                     RCCW=RPRF-LENGTH(IEDQCCW);/* POINT TO NEGATIVE    01359000
*                                      PREFIX OF UNIT CONTAINING THE    01360000
*                                      BTU                           */ 01361000
         LR    @11,RPRF                                            0773 01362000
         SL    @11,@CF00046                                        0773 01363000
         LR    RCCW,@11                                            0773 01364000
*                     IEDQCCW=RPRF->IEDQCCW;/* MOVE THE CCW OF THE 0774 01365000
*                                      1ST UNIT TO THE NEGATIVE    0774 01366000
*                                      PREFIX                        */ 01367000
         MVC   IEDQCCW(8,RCCW),IEDQCCW(RPRF)                       0774 01368000
*                     PRFQCBA=SAVTFLDH;/* QUEUE FOR FLDH             */ 01369000
         L     @07,AVTSAVTP(,RAVT)                                 0775 01370000
         MVC   PRFQCBA(3,RPRF),SAVTFLDH+1(@07)                     0775 01371000
*                     PRFPRI=PRIFLDH;/* SET PRIORITY                 */ 01372000
         MVI   PRFPRI(RPRF),X'E4'                                  0776 01373000
*                     PRF1WD2=RLCB; /* SAVE 3705 LCB ADDR    @OZ26333*/ 01374000
         ST    RLCB,PRF1WD2(,@11)                                  0777 01375000
*                     CALL READYQ;  /* PUT ELEMENT ON DISABLED READY    01376000
*                                      QUEUE                         */ 01377000
         BAL   @14,READYQ                                          0778 01378000
*                   END;                                           0779 01379000
*               END;                /* END OF 'NOT A SENSE'          */ 01380000
@RF00770 DS    0H                                                  0781 01381000
*         END;                      /* END OF 'NO IPL OR DUMP IN   0781 01382000
*                                      PROGRESS'                     */ 01383000
@RC00675 DS    0H                                                  0781 01384000
@RT00673 DS    0H                                                  0782 01385000
*     END;                          /* END OF 'NOT PERMANENT ERROR ON   01386000
*                                      I/O'                          */ 01387000
@RC00582 DS    0H                                                  0783 01388000
*   RFY                                                            0783 01389000
*    (RCCW,                                                        0783 01390000
*     RPRF,                                                        0783 01391000
*     RWORK) UNRSTD;                                               0783 01392000
@RC00568 DS    0H                                                  0784 01393000
*                                                                  0784 01394000
*   /*****************************************************************/ 01395000
*   /*                                                               */ 01396000
*   /* POST THE MCP IF REQUESTED                                     */ 01397000
*   /*                                                               */ 01398000
*   /*****************************************************************/ 01399000
*                                                                  0784 01400000
*   IF RSTATE=MCPPOST THEN          /* IS MCP POST REQUESTED         */ 01401000
         C     RSTATE,@CF00046                                     0784 01402000
         BNE   @RF00784                                            0784 01403000
*     DO;                           /* POST MCP'S ECB IF NEEDED      */ 01404000
*       RFY                                                        0786 01405000
*         RECB RSTD;                                               0786 01406000
*       RECB=ADDR(AVTOSECB);        /* GET ADDR OF MCP'S ECB         */ 01407000
         LA    RECB,AVTOSECB(,RAVT)                                0787 01408000
*       IF ECBWAIT=ON THEN          /* TCAM WAITING          @OZ26735*/ 01409000
         TM    ECBWAIT(RECB),B'10000000'                           0788 01410000
         BNO   @RF00788                                            0788 01411000
*         CALL POSTECB;             /* YES, POST THE ECB             */ 01412000
         BAL   @14,POSTECB                                         0789 01413000
*       ELSE                                                       0790 01414000
*         DO;                       /*                       @OZ27465*/ 01415000
         B     @RC00788                                            0790 01416000
@RF00788 DS    0H                                                  0791 01417000
*           RECB=AVTOSECB;          /* LOAD ECB              @OZ29080*/ 01418000
         L     RECB,AVTOSECB(,RAVT)                                0791 01419000
*           REG4='40000000'X;       /* POST BIT FOR C&S      @OZ27465*/ 01420000
         L     REG4,@CF02827                                       0792 01421000
*           CS(RECB,REG4,AVTOSECB); /* POST ECB VIA C&S      @OZ27465*/ 01422000
         CS    RECB,@04,AVTOSECB(RAVT)                             0793 01423000
*           BC(8,NOPOST);           /* C&S GOOD,NO POST      @OZ27465*/ 01424000
         BC    8,NOPOST                                            0794 01425000
*           RECB=ADDR(AVTOSECB);    /* LOAD ADDRESS ECB      @OZ29080*/ 01426000
         LA    RECB,AVTOSECB(,RAVT)                                0795 01427000
*           CALL POSTECB;           /* POST ECB              @OZ27465*/ 01428000
         BAL   @14,POSTECB                                         0796 01429000
*NOPOST:                            /*                       @OZ27465*/ 01430000
*         END;                      /*                       @OZ27465*/ 01431000
NOPOST   DS    0H                                                  0798 01432000
*       RFY                                                        0798 01433000
*         RECB UNRSTD;                                             0798 01434000
@RC00788 DS    0H                                                  0799 01435000
*     END;                                                         0799 01436000
*                                                                  0800 01437000
*   /*****************************************************************/ 01438000
*   /*                                                               */ 01439000
*   /* EXIT CODE                                                     */ 01440000
*   /*                                                               */ 01441000
*   /*****************************************************************/ 01442000
*                                                                  0800 01443000
*   RFY                                                            0800 01444000
*     RRETURN RSTD;                                                0800 01445000
@RF00784 DS    0H                                                  0801 01446000
*   IOSTSLL=ON;                     /* DONT WANT LOCK FOR TERM     0801 01447000
*                                      ROUTINE               @ZM46596*/ 01448000
         L     @15,IOSBPTR-1(,RLCB)                                0801 01449000
         LA    @15,0(,@15)                                         0801 01450000
         OI    IOSTSLL(@15),B'00000100'                            0801 01451000
*   IOSOPT2=OFF;                    /* CLEAR OPT2 BYTE       @ZM46596*/ 01452000
         MVI   IOSOPT2(@15),B'00000000'                            0802 01453000
*   IF RSTATE=ERP THEN              /* IS ERP REQUESTED              */ 01454000
         C     RSTATE,@CF00257                                     0803 01455000
         BNE   @RF00803                                            0803 01456000
*     IOSEX=ON;                     /* YES, SET EXCEPTION FLAG     0804 01457000
*                                                            @G36XRIB*/ 01458000
         OI    IOSEX(@15),B'00000100'                              0804 01459000
*   ELSE                            /* NO ERP REQUESTED              */ 01460000
*     IOSEX=OFF;                    /* CLEAR EXCEPTION FLAG IF ON  0805 01461000
*                                                            @ZM46596*/ 01462000
         B     @RC00803                                            0805 01463000
@RF00803 L     @15,IOSBPTR-1(,RLCB)                                0805 01464000
         NI    IOSEX(@15),B'11111011'                              0805 01465000
         SPACE 1                                                        01466000
*   LM(REG0,RBRANCH,SIOSAVE);       /* REST REGS SAVED FOR IOS     0806 01467000
*                                                            @ZM47611*/ 01468000
@RC00803 LM    REG0,RBRANCH,SIOSAVE                                0806 01469000
*   RFY                                                            0807 01470000
*     RRETURN UNRSTD;                                              0807 01471000
*                                                                  0808 01472000
*   /*****************************************************************/ 01473000
*   /*                                                               */ 01474000
*   /* INTENTIONAL PROGRAM CHECK DUE TO ERROR RETURN FROM REAL TO    */ 01475000
*   /* VIRTUAL ADDRESS TRANSLATION ROUTINE.                          */ 01476000
*   /*                                                               */ 01477000
*   /*****************************************************************/ 01478000
*                                                                  0808 01479000
*CONVERR:                                                          0808 01480000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0808 01481000
@EL00001 DS    0H                                                  0808 01482000
@EF00001 DS    0H                                                  0808 01483000
@ER00001 BR    @14                                                 0808 01484000
CONVERR  DS    0H                                                  0809 01485000
*   GEN NOREFS NOSETS NOEXIT SEQFLOW;                              0809 01486000
         DC    H'0'                                                     01487000
*   END CONVERR;                                                   0810 01488000
@EL00002 DS    0H                                                  0810 01489000
@EF00002 DS    0H                                                  0810 01490000
@ER00002 BR    @14                                                 0810 01491000
*                                                                  0811 01492000
*   /*****************************************************************/ 01493000
*   /*                                                               */ 01494000
*   /* USE BRANCH ENTRY POINT OF SYSTEM POST TO POST THE ECB         */ 01495000
*   /* ADDRESSED BY RECB.                                            */ 01496000
*   /*                                                               */ 01497000
*   /*****************************************************************/ 01498000
*                                                                  0811 01499000
*POSTECB:                                                          0811 01500000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0811 01501000
POSTECB  DS    0H                                                  0812 01502000
*   RFY                                                            0812 01503000
*    (REG3,                                                        0812 01504000
*     RECB,                                                        0812 01505000
*     RTCB,                                                        0812 01506000
*     RRETURN,                                                     0812 01507000
*     REG4,                                                        0812 01508000
*     REG7,                                                        0812 01509000
*     RWORK) RSTD;                  /*                       @G36XRIB*/ 01510000
*   REG4=RRETURN;                   /* SAVE RETURN ADDRESS           */ 01511000
         LR    REG4,RRETURN                                        0813 01512000
*   REG7=RAVT;                      /* SAVE AVT ADDR ACROSS CALL   0814 01513000
*                                                            @YM02922*/ 01514000
         LR    REG7,RAVT                                           0814 01515000
*   REG3=RBASE;                     /* SAVE BASE REGISTER            */ 01516000
         LR    REG3,RBASE                                          0815 01517000
*   RFY                                                            0816 01518000
*     RRETURN UNRSTD;                                              0816 01519000
*                                                                  0816 01520000
*   /*****************************************************************/ 01521000
*   /*                                                               */ 01522000
*   /* CALL BRANCH ENTRY POINT OF POST WITH FOLLOWING INPUT -        */ 01523000
*   /* REG11=ADDR OF ECB, REG10=COMPLETION CODE, R14=RETURN ADDR, AND*/ 01524000
*   /* REG15=ADDR OF POST ROUTINE.                           @G36XRIB*/ 01525000
*   /*                                                               */ 01526000
*   /*****************************************************************/ 01527000
*                                                                  0817 01528000
*   RWORK=0;                        /* 0 COMPLETION CODE IN REG 10 0817 01529000
*                                                            @G36XRIB*/ 01530000
         SLR   RWORK,RWORK                                         0817 01531000
*   CALL POST;                      /* BRANCH TO SYSTEM POST         */ 01532000
         L     @06,CVTPTR                                          0818 01533000
         L     @15,CVT0PT01(,@06)                                  0818 01534000
         BALR  @14,@15                                             0818 01535000
*   RBASE=REG3;                     /* RESTORE BASE ADDRESS          */ 01536000
         LR    RBASE,REG3                                          0819 01537000
*   RFY                                                            0820 01538000
*     RRETURN RSTD;                                                0820 01539000
*   RRETURN=REG4;                   /* RESTORE RETURN ADDRESS        */ 01540000
         LR    RRETURN,REG4                                        0821 01541000
*   RAVT=REG7;                      /* RESTORE AVT ADDRESS   @YM02922*/ 01542000
         LR    RAVT,REG7                                           0822 01543000
*   RFY                                                            0823 01544000
*    (REG3,                                                        0823 01545000
*     RECB,                                                        0823 01546000
*     RTCB,                                                        0823 01547000
*     RRETURN,                                                     0823 01548000
*     REG4,                                                        0823 01549000
*     REG7,                                                        0823 01550000
*     RWORK) UNRSTD;                /*                       @G36XRIB*/ 01551000
*   END POSTECB;                                                   0824 01552000
@EL00003 DS    0H                                                  0824 01553000
@EF00003 DS    0H                                                  0824 01554000
@ER00003 BR    @14                                                 0824 01555000
*                                                                  0825 01556000
*   /*****************************************************************/ 01557000
*   /*                                                               */ 01558000
*   /* SUBROUTINE TO PLACE ELEMENT ON ASYNCHRONOUS READY QUEUE. RPRF */ 01559000
*   /* CONTAINS THE ADDRESS OF THE ELEMENT. RWORK AND RBRANCH ARE    */ 01560000
*   /* USED AS WORK REGISTERS.                                       */ 01561000
*   /*                                                               */ 01562000
*   /*****************************************************************/ 01563000
*                                                                  0825 01564000
*READYQ:                                                           0825 01565000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0825 01566000
READYQ   DS    0H                                                  0826 01567000
*   DCL                                                            0826 01568000
*     TRYAGAIN LABEL;               /* LABEL NEEDED FOR CS ON      0826 01569000
*                                      TCXREADY                      */ 01570000
*   RFY                                                            0827 01571000
*    (RRETURN,                                                     0827 01572000
*     RPRF,                                                        0827 01573000
*     RWORK,                                                       0827 01574000
*     RBRANCH) RSTD;                                               0827 01575000
*   RFY                                                            0828 01576000
*     IEDQTCXD BASED(RBRANCH);      /* CHANGE BASE FOR TCX           */ 01577000
*   RBRANCH=CVTAQAVT;               /* GET TCX ADDRESS               */ 01578000
         L     @11,CVTPTR                                          0829 01579000
         L     RBRANCH,CVTAQAVT(,@11)                              0829 01580000
*   RWORK=TCXREADY;                 /* GET TOP ELEMENT ON          0830 01581000
*                                      ASYNCHRONOUS READY QUEUE      */ 01582000
         L     RWORK,TCXREADY(,RBRANCH)                            0830 01583000
*TRYAGAIN:                                                         0831 01584000
*   PRFLINK=RWORK;                  /* LINK ELEMENT TO 1ST ON READY     01585000
*                                      QUEUE                         */ 01586000
TRYAGAIN STCM  RWORK,7,PRFLINK(RPRF)                               0831 01587000
*   CS(RWORK,RPRF,TCXREADY);        /* PUT ELEMENT AS TOP ON READY 0832 01588000
*                                      QUEUE                         */ 01589000
         CS    RWORK,@06,TCXREADY(RBRANCH)                         0832 01590000
*   BC(NE,TRYAGAIN);                /* IF QUEUE WAS UPDATED        0833 01591000
*                                      ASYNCHRONOUSLY, THEN TRY AGAIN*/ 01592000
         BC    7,TRYAGAIN                                          0833 01593000
*   RSTATE=MCPPOST;                 /* REQUEST MCP POST              */ 01594000
         LA    RSTATE,8                                            0834 01595000
*   RFY                                                            0835 01596000
*     IEDQTCXD BASED(TCXPTR);       /* RESET BASE FOR TCX            */ 01597000
*   RFY                                                            0836 01598000
*    (RRETURN,                                                     0836 01599000
*     RPRF,                                                        0836 01600000
*     RWORK,                                                       0836 01601000
*     RBRANCH) UNRSTD;                                             0836 01602000
*   END READYQ;                                                    0837 01603000
@EL00004 DS    0H                                                  0837 01604000
@EF00004 DS    0H                                                  0837 01605000
@ER00004 BR    @14                                                 0837 01606000
*                                                                  0838 01607000
*   /*****************************************************************/ 01608000
*   /*                                                               */ 01609000
*   /* SECONDARY ENTRY POINT - SIO APPENDAGE                         */ 01610000
*   /*                                                               */ 01611000
*   /*****************************************************************/ 01612000
*                                                                  0838 01613000
*SIOAPNDG:                                                         0838 01614000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0838 01615000
SIOAPNDG DS    0H                                                  0839 01616000
*   GEN NOEXIT NOFLOWS SEQFLOW NOREFS NOSETS;                      0839 01617000
         USING SIOAPNDG,RBRANCH         SIOAPNDG ADDRESSABILITY         01618000
*   RFY                                                            0840 01619000
*    (REG0,                                                        0840 01620000
*     RPARM,                                                       0840 01621000
*     RLCB,                                                        0840 01622000
*     REG3,                                                        0840 01623000
*     REG4,                                                        0840 01624000
*     RCCW,                                                        0840 01625000
*     RPRF,                                                        0840 01626000
*     REG7,                                                        0840 01627000
*     RTRM) RSTD;                                                  0840 01628000
*   RFY                                                            0841 01629000
*    (REG9,                                                        0841 01630000
*     RWORK,                                                       0841 01631000
*     RVIRT,                                                       0841 01632000
*     RBASE,                                                       0841 01633000
*     RAVT,                                                        0841 01634000
*     RRETURN,                                                     0841 01635000
*     RBRANCH) RSTD;                /*                       @YM04622*/ 01636000
*                                                                  0842 01637000
*   /*****************************************************************/ 01638000
*   /*                                                               */ 01639000
*   /* IF THE CCW'S ARE VIRTUAL, THEN TRANSLATE THE CCW'S TO REAL    */ 01640000
*   /* ADDRESSES. REGISTERS ON ENTRY HERE CONTAIN: R1-ADDR OF IOSB,  */ 01641000
*   /* R14-RETURN ADDRESS, R15-SIO APPENDAGE ENTRY ADDRESS   @G36XRIB*/ 01642000
*   /*                                                               */ 01643000
*   /*****************************************************************/ 01644000
*                                                                  0842 01645000
*   STM(REG0,RBRANCH,SIOSAVE);      /* SAVE CALLERS REGISTERS      0842 01646000
*                                                            @G36XRIB*/ 01647000
         STM   REG0,RBRANCH,SIOSAVE                                0842 01648000
*   RFY                                                            0843 01649000
*    (REG3,                                                        0843 01650000
*     REG4,                                                        0843 01651000
*     REG7,                                                        0843 01652000
*     REG9) UNRSTD;                 /* GIVE PLS SOME REGISTERS     0843 01653000
*                                                            @YM06506*/ 01654000
*   RLCB=RPARM->IOSUSE;             /* GET ADDRESS OF THE LCB      0844 01655000
*                                                            @G36XRIB*/ 01656000
         L     RLCB,IOSUSE(,RPARM)                                 0844 01657000
*   GEN REFS(LCBATTN,CSMASK1) SETS(RPARM,RWORK,LCBATTN);           0845 01658000
*                                                         /* @YM07757*/ 01659000
         L     RWORK,LCBATTN-3(,RLCB)   WORD CONTAINS LCBATTN  @YM07757 01660000
CSLOOP1  EQU   *                                               @YM07757 01661000
         LR    RPARM,RWORK              COPY WORD TO UPDATE    @YM07757 01662000
         N     RPARM,CSMASK1            RESET LCBATTN          @YM07757 01663000
         CS    RWORK,RPARM,LCBATTN-3(RLCB) CS LCBATTN          @YM07757 01664000
         BNE   CSLOOP1                  LOOP IF CS FAILED      @YM07757 01665000
*   RAVT=TCXAVT;                    /* GET TCAM AVT ADDRESS  @YM06506*/ 01666000
         L     @07,CVTPTR                                          0846 01667000
         L     @07,TCXPTR(,@07)                                    0846 01668000
         L     RAVT,TCXAVT(,@07)                                   0846 01669000
*   RPARM=LCBTTCIN;                 /* PARAMETER TO IEDQTNT  @YM04622*/ 01670000
         LH    RPARM,LCBTTCIN(,RLCB)                               0847 01671000
         N     RPARM,@CF02869                                      0847 01672000
*   RWORK=RBRANCH;                  /* SAVE REGISTER 15 CONTENTS   0848 01673000
*                                                            @YM06506*/ 01674000
         LR    RWORK,RBRANCH                                       0848 01675000
*   CALL TNTCODE;                   /* GET TTE ADDRESS       @YM04622*/ 01676000
         L     @15,IEDQNPTR(,RAVT)                                 0849 01677000
         BALR  @14,@15                                             0849 01678000
*   RBRANCH=RWORK;                  /* RESTORE REGISTER 15 CONTENTS     01679000
*                                                            @YM06506*/ 01680000
         LR    RBRANCH,RWORK                                       0850 01681000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* GET TTE PREFIX        @YM04622*/ 01682000
         LR    RTRM,RPARM                                          0851 01683000
         SL    RTRM,@CF02521                                       0851 01684000
*   IF LCBREAL=OFF&                 /* IF 'PERMANENT' CCWS IN THE LCB   01685000
*                                      HAVE NOT BEEN TRANSLATED TO 0852 01686000
*                                      REAL ...              @YM04622*/ 01687000
*       TRMIPLDM=OFF&               /* ... AND IPL/DUMP IS NOT IN  0852 01688000
*                                      PROGRESS ...          @YM04622*/ 01689000
*       LCBSTAT1^=CLOSDOWN THEN     /* ... AND NOT CLOSE CHAN PROG 0852 01690000
*                                      THEN                  @YM04622*/ 01691000
         TM    LCBREAL(RLCB),B'00000100'                           0852 01692000
         BNZ   @RF00852                                            0852 01693000
         TM    TRMIPLDM(RTRM),B'10000000'                          0852 01694000
         BNZ   @RF00852                                            0852 01695000
         CLI   LCBSTAT1(RLCB),X'FF'                                0852 01696000
         BE    @RF00852                                            0852 01697000
*     DO;                           /* ... TRANSLATE LCB CCWS      0853 01698000
*                                                            @YM04622*/ 01699000
*       RCCW=ADDR(LCBCCW1);         /* POINT TO WRITE START CCW    0854 01700000
*                                                            @YM04622*/ 01701000
         LA    RCCW,LCBCCW1(,RLCB)                                 0854 01702000
*       GEN(LRA  RWORK,0(,RCCW));   /* TRANSLATE TO REAL     @YM06506*/ 01703000
         LRA  RWORK,0(,RCCW)                                            01704000
*       CCWADDR=RWORK;              /* SAVE REAL ADDRESS     @YM06506*/ 01705000
         STCM  RWORK,7,CCWADDR(RCCW)                               0856 01706000
*       RCCW=ADDR(LCBCCW3);         /* POINT TO READ START CCW     0857 01707000
*                                                            @YM04622*/ 01708000
         LA    RCCW,LCBCCW3(,RLCB)                                 0857 01709000
*       GEN(LRA  RWORK,0(,RCCW));   /* TRANSLATE TO REAL     @YM06506*/ 01710000
         LRA  RWORK,0(,RCCW)                                            01711000
*       CCWADDR=RWORK;              /* SAVE REAL ADDRESS     @YM06506*/ 01712000
         STCM  RWORK,7,CCWADDR(RCCW)                               0859 01713000
*       RCCW=ADDR(LCBCCW6);         /* POINT TO NO-OP AFTER WRITES 0860 01714000
*                                                            @YM04622*/ 01715000
         LA    RCCW,LCBCCW6(,RLCB)                                 0860 01716000
*       GEN(LRA  RWORK,0(,RCCW));   /* TRANSLATE TO REAL     @YM06506*/ 01717000
         LRA  RWORK,0(,RCCW)                                            01718000
*       CCWADDR=RWORK;              /* SAVE REAL ADDRESS     @YM06506*/ 01719000
         STCM  RWORK,7,CCWADDR(RCCW)                               0862 01720000
*       RCCW=ADDR(LCBCCW7);         /* POINT TO NO-OP AFTER READS  0863 01721000
*                                                            @YM04622*/ 01722000
         LA    RCCW,LCBCCW7(,RLCB)                                 0863 01723000
*       GEN(LRA  RWORK,0(,RCCW));   /* TRANSLATE TO REAL     @YM06506*/ 01724000
         LRA  RWORK,0(,RCCW)                                            01725000
*       CCWADDR=RWORK;              /* SAVE REAL ADDRESS     @YM06506*/ 01726000
         STCM  RWORK,7,CCWADDR(RCCW)                               0865 01727000
*       LCBREAL=ON;                 /* INDICATE LCB CCWS ARE NOW REAL   01728000
*                                                            @YM04622*/ 01729000
         OI    LCBREAL(RLCB),B'00000100'                           0866 01730000
*     END;                          /*                       @YM04622*/ 01731000
*   IF LCBRLAD=OFF THEN             /* IF CCWS HAVE NOT BEEN       0868 01732000
*                                      TRANSLATED THEN ...   @YM04622*/ 01733000
@RF00852 TM    LCBRLAD(RLCB),B'00010000'                           0868 01734000
         BNZ   @RF00868                                            0868 01735000
*     DO;                           /* HANDLE CCW TRANSLATION      0869 01736000
*                                                            @YM04622*/ 01737000
*       RCCW=LCBSTART;              /* GET START CCW ADDRESS @YM04622*/ 01738000
         L     RCCW,LCBSTART-1(,RLCB)                              0870 01739000
         LA    RCCW,0(,RCCW)                                       0870 01740000
*       IF CCWOPCDE=CCWRRS THEN     /* IF FIRST CCW IS WRITE START 0871 01741000
*                                      RESET THEN...         @YM04622*/ 01742000
         CLI   CCWOPCDE(RCCW),X'93'                                0871 01743000
         BNE   @RF00871                                            0871 01744000
*         DO;                       /* TRANSLATE WRITE START RESET 0872 01745000
*                                      CCW                   @YM04622*/ 01746000
*           GEN(LRA  RWORK,0(,RCCW));/* TRANSLATE TO REAL    @YM06506*/ 01747000
         LRA  RWORK,0(,RCCW)                                            01748000
*           CCWADDR=RWORK;          /* SAVE REAL ADDRESS     @YM06506*/ 01749000
         STCM  RWORK,7,CCWADDR(RCCW)                               0874 01750000
*         END;                      /*                       @YM04622*/ 01751000
*       IF TRMIPLDM=ON|             /* IF IPL/DUMP IN PROGRESS ... 0876 01752000
*                                                            @YM04622*/ 01753000
*           LCBSTAT1=CLOSDOWN THEN  /* ... OR CLOSE CHANNEL PROGRAM     01754000
*                                      THEN                  @YM04622*/ 01755000
@RF00871 TM    TRMIPLDM(RTRM),B'10000000'                          0876 01756000
         BO    @RT00876                                            0876 01757000
         CLI   LCBSTAT1(RLCB),X'FF'                                0876 01758000
         BNE   @RF00876                                            0876 01759000
@RT00876 DS    0H                                                  0877 01760000
*         RCCW=LCBSTART;            /* TRANSLATE ENTIRE CHANNEL    0877 01761000
*                                      PROGRAM               @YM04622*/ 01762000
         L     RCCW,LCBSTART-1(,RLCB)                              0877 01763000
         LA    RCCW,0(,RCCW)                                       0877 01764000
*       ELSE                        /*                       @YM04622*/ 01765000
*         DO;                       /* ELSE DETERMINE WHICH CCWS NEED   01766000
*                                      TRANSLATION           @YM04622*/ 01767000
         B     @RC00876                                            0878 01768000
@RF00876 DS    0H                                                  0879 01769000
*           RCCW=ADDR(LCBCCW2);     /* ASSUME SENDING        @YM04622*/ 01770000
         LA    RCCW,LCBCCW2(,RLCB)                                 0879 01771000
*           IF LCBSENDN=OFF THEN    /* IF NOT SENDING ...    @YM04622*/ 01772000
         TM    LCBSENDN(RLCB),B'00000001'                          0880 01773000
         BNZ   @RF00880                                            0880 01774000
*             RCCW=ADDR(LCBCCW4);   /* ... ASSUME RECEIVING  @YM04622*/ 01775000
         LA    RCCW,LCBCCW4(,RLCB)                                 0881 01776000
*         END;                      /*                       @YM04622*/ 01777000
@RF00880 DS    0H                                                  0883 01778000
*       DO UNTIL LCBRLAD=ON;        /* TRANSLATE ADDRESSES UNTIL ALL    01779000
*                                      CCW'S ARE REAL        @YM04622*/ 01780000
@RC00876 DS    0H                                                  0883 01781000
@DL00883 DS    0H                                                  0884 01782000
*         RVIRT=CCWADDR;            /* GET VIRTUAL ADDRESS FROM CCW  */ 01783000
         SLR   RVIRT,RVIRT                                         0884 01784000
         ICM   RVIRT,7,CCWADDR(RCCW)                               0884 01785000
*         GEN(LRA  RWORK,0(,RVIRT));/* TRANSLATE TO REAL     @YM06506*/ 01786000
         LRA  RWORK,0(,RVIRT)                                           01787000
*         CCWADDR=RWORK;            /* SAVE REAL ADDRESS     @YM06506*/ 01788000
         STCM  RWORK,7,CCWADDR(RCCW)                               0886 01789000
*         IF NOTTIC1=OFF&           /* IS COMMAND ...                */ 01790000
*             NOTTIC2=OFF&          /* ... A ...                     */ 01791000
*             NOTTIC3=OFF THEN      /* ... TIC                       */ 01792000
         TM    NOTTIC1(RCCW),B'00000111'                           0887 01793000
         BNZ   @RF00887                                            0887 01794000
*           DO;                     /*                       @YM03703*/ 01795000
*             CCWOPCDE=CCWTICR;     /* INDICATE CCW CONTAINS REAL  0889 01796000
*                                      ADDRESSES             @YM04622*/ 01797000
         MVI   CCWOPCDE(RCCW),X'88'                                0889 01798000
*             RWORK=RVIRT;          /* YES, GET ADDR OF CCW THAT IS     01799000
*                                      TIC'ED TO             @YM06506*/ 01800000
         LR    RWORK,RVIRT                                         0890 01801000
*             RCCW=RCCW-LENGTH(IEDQCCW);/* BACK UP TO PREVIOUS CCW 0891 01802000
*                                                            @YM04622*/ 01803000
         SL    RCCW,@CF00046                                       0891 01804000
*             IF CCWOPCDE=CCWNOP THEN/* IF NO-OP CCW REACHED THEN  0892 01805000
*                                                            @YM04622*/ 01806000
         CLI   CCWOPCDE(RCCW),X'03'                                0892 01807000
         BNE   @RF00892                                            0892 01808000
*               IF LCBRECVN=ON THEN /* IF RECEIVING CHANNEL PROGRAM     01809000
*                                      EXISTS                @YM04622*/ 01810000
         TM    LCBRECVN(RLCB),B'00000010'                          0893 01811000
         BNO   @RF00893                                            0893 01812000
*                 RCCW=ADDR(LCBCCW4);/* RESUME TRANSLATION ON READ 0894 01813000
*                                      CCWS                  @YM04622*/ 01814000
         LA    RCCW,LCBCCW4(,RLCB)                                 0894 01815000
*               ELSE                /*                       @YM04622*/ 01816000
*                 LCBRLAD=ON;       /* ELSE INDICATE TRANSLATION   0895 01817000
*                                      COMPLETE              @YM04622*/ 01818000
         B     @RC00893                                            0895 01819000
@RF00893 OI    LCBRLAD(RLCB),B'00010000'                           0895 01820000
*             ELSE                  /*                       @YM04622*/ 01821000
*               DO;                 /*                       @YM04622*/ 01822000
         B     @RC00892                                            0896 01823000
@RF00892 DS    0H                                                  0897 01824000
*                 RCCW=RWORK;       /* COPY VIRTUAL TIC TO ADDRESS 0897 01825000
*                                                            @YM06506*/ 01826000
         LR    RCCW,RWORK                                          0897 01827000
*                 IF CCWOPCDE=CCWNOP THEN/* IF NO-OP CCW REACHED THEN   01828000
*                                      ...                   @YM04622*/ 01829000
         CLI   CCWOPCDE(RCCW),X'03'                                0898 01830000
         BNE   @RF00898                                            0898 01831000
*                   LCBRLAD=ON;     /* INDICATE TRANSLATION COMPLETE    01832000
*                                                            @YM04622*/ 01833000
         OI    LCBRLAD(RLCB),B'00010000'                           0899 01834000
*                 ELSE              /*                       @YM04622*/ 01835000
*                   DO;             /* PREVENT TRANSLATION ON ANY  0900 01836000
*                                      READ ALREADY TRANSLATED     0900 01837000
*                                                            @YM04622*/ 01838000
         B     @RC00898                                            0900 01839000
@RF00898 DS    0H                                                  0901 01840000
*                     IF CCWOPCDE=CCWREAD&/* IF THIS IS A READ UNIT     01841000
*                                      ...                   @YM04622*/ 01842000
*                         (RCCW+LENGTH(IEDQCCW))->CCWOPCDE=CCWTICR THEN 01843000
         CLI   CCWOPCDE(RCCW),X'02'                                0901 01844000
         BNE   @RF00901                                            0901 01845000
         CLI   CCWOPCDE+8(RCCW),X'88'                              0901 01846000
         BNE   @RF00901                                            0901 01847000
*                                   /* ... AND THIS UNIT IS ALREADY     01848000
*                                      IN REAL ADDRESS FORM  @YM04622*/ 01849000
*                       LCBRLAD=ON; /* INDICATE TRANSLATION COMPLETE    01850000
*                                                            @YM04622*/ 01851000
         OI    LCBRLAD(RLCB),B'00010000'                           0902 01852000
*                   END;            /*                       @YM04622*/ 01853000
*               END;                /*                       @YM04622*/ 01854000
*           END;                    /*                       @YM03703*/ 01855000
*         ELSE                      /* COMMAND IS NOT A TIC          */ 01856000
*           DO;                     /*                       @YM04622*/ 01857000
         B     @RC00887                                            0906 01858000
@RF00887 DS    0H                                                  0907 01859000
*             IF CCWCD=ON|          /* IF CHAINING THEN ...  @YM04622*/ 01860000
*                 CCWCC=ON THEN     /*                       @YM04622*/ 01861000
         TM    CCWCD(RCCW),B'11000000'                             0907 01862000
         BZ    @RF00907                                            0907 01863000
*               RCCW=RCCW+LENGTH(IEDQCCW);/* YES, NEXT CCW FOLLOWS 0908 01864000
*                                      CURRENT                       */ 01865000
         AL    RCCW,@CF00046                                       0908 01866000
*             ELSE                  /*                       @YM04622*/ 01867000
*               IF CCWOPCDE=CCWNOP& /* IF THIS IS A NO-OP CCW ...  0909 01868000
*                                                            @YM04622*/ 01869000
*                   (RCCW-LENGTH(IEDQCCW))->CCWOPCDE=CCWBRK&/* ... 0909 01870000
*                                      PRECEDED BY A WRITE BREAK CCW    01871000
*                                      THEN                  @YM06506*/ 01872000
*                   TRMIPLDM=OFF THEN/* AND NOT IPL OR DUMP  @ZM47611*/ 01873000
         B     @RC00907                                            0909 01874000
@RF00907 CLI   CCWOPCDE(RCCW),X'03'                                0909 01875000
         BNE   @RF00909                                            0909 01876000
         LA    @07,8                                               0909 01877000
         LR    @04,RCCW                                            0909 01878000
         SLR   @04,@07                                             0909 01879000
         CLI   CCWOPCDE(@04),X'09'                                 0909 01880000
         BNE   @RF00909                                            0909 01881000
         TM    TRMIPLDM(RTRM),B'10000000'                          0909 01882000
         BNZ   @RF00909                                            0909 01883000
*                 RCCW=RCCW+LENGTH(IEDQCCW);/* TRANSLATE TIC AFTER 0910 01884000
*                                      WRITE BREAK           @YM04622*/ 01885000
         ALR   RCCW,@07                                            0910 01886000
*               ELSE                /*                       @YM04622*/ 01887000
*                 LCBRLAD=ON;       /* ELSE INDICATE TRANSLATION   0911 01888000
*                                      COMPLETE              @YM04622*/ 01889000
         B     @RC00909                                            0911 01890000
@RF00909 OI    LCBRLAD(RLCB),B'00010000'                           0911 01891000
*           END;                    /*                       @YM04622*/ 01892000
@RC00909 DS    0H                                                  0912 01893000
@RC00907 DS    0H                                                  0913 01894000
*       END;                        /*                       @YM04622*/ 01895000
@RC00887 DS    0H                                                  0913 01896000
@DE00883 TM    LCBRLAD(RLCB),B'00010000'                           0913 01897000
         BNO   @DL00883                                            0913 01898000
*     END;                                                         0914 01899000
*   RFY                                                            0915 01900000
*    (REG3,                                                        0915 01901000
*     REG4,                                                        0915 01902000
*     REG7,                                                        0915 01903000
*     REG9) RSTD;                   /* TAKE BACK REGISTERS   @YM06506*/ 01904000
@RF00868 DS    0H                                                  0916 01905000
*   LM(REG0,RBRANCH,SIOSAVE);       /* RESTORE IOS REGISTERS @YM06506*/ 01906000
         LM    REG0,RBRANCH,SIOSAVE                                0916 01907000
*   RFY                                                            0917 01908000
*    (REG0,                                                        0917 01909000
*     RPARM,                                                       0917 01910000
*     RLCB,                                                        0917 01911000
*     REG3,                                                        0917 01912000
*     REG4,                                                        0917 01913000
*     RCCW,                                                        0917 01914000
*     RPRF,                                                        0917 01915000
*     REG7,                                                        0917 01916000
*     RTRM) UNRSTD;                                                0917 01917000
*   RFY                                                            0918 01918000
*    (REG9,                                                        0918 01919000
*     RWORK,                                                       0918 01920000
*     RBASE,                                                       0918 01921000
*     RAVT,                                                        0918 01922000
*     RRETURN,                                                     0918 01923000
*     RBRANCH) UNRSTD;                                             0918 01924000
*                                                                  0918 01925000
*   /*****************************************************************/ 01926000
*   /*                                                               */ 01927000
*   /*                                                       @YM03703*/ 01928000
*   /*                                                               */ 01929000
*   /*****************************************************************/ 01930000
*                                                                  0919 01931000
*   END SIOAPNDG;                                                  0919 01932000
@EL00005 DS    0H                                                  0919 01933000
@EF00005 DS    0H                                                  0919 01934000
@ER00005 BR    @14                                                 0919 01935000
*   END IGG019TH                                                   0920 01936000
*                                                                  0920 01937000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01938000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 01939000
*/*%INCLUDE SYSLIB  (TCCWD   )                                       */ 01940000
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */ 01941000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01942000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 01943000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 01944000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 01945000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 01946000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 01947000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01948000
*/*%INCLUDE SYSLIB  (TTCXD   )                                       */ 01949000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 01950000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 01951000
*/*%INCLUDE SYSLIB  (TRQED   )                                       */ 01952000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01953000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 01954000
*                                                                  0920 01955000
*       ;                                                          0920 01956000
@DATA    DS    0H                                                       01957000
@CH02768 DC    H'9'                                                     01958000
         DS    0F                                                       01959000
         DS    0F                                                       01960000
@CF00075 DC    F'3'                                                     01961000
@CF00257 DC    F'4'                                                     01962000
@CF00046 DC    F'8'                                                     01963000
@CF02851 DC    F'10'                                                    01964000
@CF02521 DC    F'14'                                                    01965000
@CF02827 DC    XL4'40000000'                                            01966000
@CF02869 DC    XL4'0000FFFF'                                            01967000
         DS    0D                                                       01968000
@CB02288 DC    X'08000002'                                              01969000
@CB02877 DC    B'000000000000000000000000000100000000000000000000000000C01970000
               00'                                                      01971000
@CB02883 DC    B'111111111111111111111111111011111111111111111111111111C01972000
               11'                                                      01973000
         DS    CL2                                                      01974000
DUMRQE   DS    CL20                                                     01975000
SIOSAVE  DS    CL72                                                     01976000
CSMASK1  DC    X'FFFFFFFB'                                              01977000
CSMASK2  DC    X'00000004'                                              01978000
CSMASK3  DC    X'00000002'                                              01979000
CSMASK4  DC    X'FFFFFDFF'                                              01980000
CSMASK5  DC    X'00000400'                                              01981000
IGG019TH CSECT                                                          01982000
END19TH  DC    H'0'                     LABEL FOR END OF MODULE         01983000
IGG019TH CSECT                                                          01984000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01985000
@01      EQU   01                                                       01986000
@02      EQU   02                                                       01987000
@03      EQU   03                                                       01988000
@04      EQU   04                                                       01989000
@05      EQU   05                                                       01990000
@06      EQU   06                                                       01991000
@07      EQU   07                                                       01992000
@08      EQU   08                                                       01993000
@09      EQU   09                                                       01994000
@10      EQU   10                                                       01995000
@11      EQU   11                                                       01996000
@12      EQU   12                                                       01997000
@13      EQU   13                                                       01998000
@14      EQU   14                                                       01999000
@15      EQU   15                                                       02000000
TEMPBASE EQU   @15                                                      02001000
IEDQAPTR EQU   @13                                                      02002000
DCBPTR   EQU   @02                                                      02003000
IEDQLPTR EQU   @02                                                      02004000
LCBXPTR  EQU   @05                                                      02005000
IEDQPPTR EQU   @06                                                      02006000
RTRM     EQU   @08                                                      02007000
RECB     EQU   @11                                                      02008000
RWORK    EQU   @10                                                      02009000
RCCW     EQU   @05                                                      02010000
RPRF     EQU   @06                                                      02011000
RAVT     EQU   @13                                                      02012000
RLCB     EQU   @02                                                      02013000
REG0     EQU   @00                                                      02014000
RPARM    EQU   @01                                                      02015000
REG3     EQU   @03                                                      02016000
REG4     EQU   @04                                                      02017000
REG7     EQU   @07                                                      02018000
RSTATE   EQU   @09                                                      02019000
REG9     EQU   @09                                                      02020000
RINT     EQU   @09                                                      02021000
RVIRT    EQU   @11                                                      02022000
REG11    EQU   @11                                                      02023000
RTCB     EQU   @12                                                      02024000
RBASE    EQU   @12                                                      02025000
RRETURN  EQU   @14                                                      02026000
RBRANCH  EQU   @15                                                      02027000
IEDQTPTR EQU   @08                                                      02028000
CVTPTR   EQU   16                                                       02029000
IEDQAVTD EQU   0                                                        02030000
AVTSAVEX EQU   IEDQAVTD+288                                             02031000
AVTDPARM EQU   IEDQAVTD+332                                             02032000
AVTREADD EQU   IEDQAVTD+380                                             02033000
AVTBUFSW EQU   IEDQAVTD+384                                             02034000
@NM00004 EQU   IEDQAVTD+388                                             02035000
AVTCKFLG EQU   @NM00004                                                 02036000
AVTBASE  EQU   IEDQAVTD+412                                             02037000
AVTPKF   EQU   AVTBASE                                                  02038000
AVTRNMPT EQU   IEDQAVTD+424                                             02039000
AVTOSECB EQU   IEDQAVTD+492                                             02040000
AVTECB1  EQU   AVTOSECB                                                 02041000
AVTHG02  EQU   IEDQAVTD+528                                             02042000
AVTDISP  EQU   IEDQAVTD+552                                             02043000
AVTHD    EQU   IEDQAVTD+556                                             02044000
AVTSCOPT EQU   AVTHD                                                    02045000
AVTSAVTP EQU   IEDQAVTD+612                                             02046000
AVTSAVTF EQU   AVTSAVTP                                                 02047000
AVTIOT   EQU   IEDQAVTD+640                                             02048000
AVTCKPEL EQU   IEDQAVTD+652                                             02049000
AVTCKRMV EQU   AVTCKPEL                                                 02050000
AVTCKELF EQU   IEDQAVTD+680                                             02051000
AVTCKBYT EQU   IEDQAVTD+691                                             02052000
AVTHG01  EQU   IEDQAVTD+692                                             02053000
AVTCKLNK EQU   IEDQAVTD+696                                             02054000
AVTCRELE EQU   IEDQAVTD+708                                             02055000
AVTCCELE EQU   AVTCRELE                                                 02056000
AVTCLRHI EQU   IEDQAVTD+716                                             02057000
AVTADBUF EQU   IEDQAVTD+720                                             02058000
AVTSYSER EQU   IEDQAVTD+728                                             02059000
AVTBFRFG EQU   IEDQAVTD+784                                             02060000
AVTCKPQB EQU   IEDQAVTD+804                                             02061000
AVTCKPTB EQU   AVTCKPQB                                                 02062000
AVTCKPEC EQU   AVTCKPQB+4                                               02063000
AVTCKPCC EQU   AVTCKPEC                                                 02064000
AVTOPCQB EQU   IEDQAVTD+816                                             02065000
AVTOPCOB EQU   AVTOPCQB                                                 02066000
AVTOPCEC EQU   AVTOPCQB+4                                               02067000
AVTOPCCC EQU   AVTOPCEC                                                 02068000
AVTOLTQB EQU   IEDQAVTD+828                                             02069000
AVTCWFL1 EQU   IEDQAVTD+924                                             02070000
AVTCWFL2 EQU   IEDQAVTD+925                                             02071000
AVTSUBT  EQU   IEDQAVTD+948                                             02072000
AVTIOTR  EQU   IEDQAVTD+949                                             02073000
AVTBIT1  EQU   IEDQAVTD+1050                                            02074000
AVTBIT2  EQU   IEDQAVTD+1051                                            02075000
AVTBIT3  EQU   IEDQAVTD+1052                                            02076000
AVTBIT4  EQU   IEDQAVTD+1136                                            02077000
@NM00086 EQU   IEDQAVTD+1232                                            02078000
IEDNSVTD EQU   0                                                        02079000
SAVTDIAG EQU   IEDNSVTD                                                 02080000
SAVTDIAF EQU   SAVTDIAG                                                 02081000
SAVTFLDH EQU   IEDNSVTD+52                                              02082000
SAVTLUSQ EQU   IEDNSVTD+88                                              02083000
SAVTSSRQ EQU   IEDNSVTD+172                                             02084000
SAVTTCPU EQU   IEDNSVTD+238                                             02085000
SAVTSCPT EQU   SAVTTCPU                                                 02086000
SAVTTNTX EQU   IEDNSVTD+252                                             02087000
SAVTZELM EQU   IEDNSVTD+270                                             02088000
SAVTRDRV EQU   IEDNSVTD+284                                             02089000
SAVTCKQB EQU   IEDNSVTD+300                                             02090000
SAVTCKTB EQU   SAVTCKQB                                                 02091000
SAVTCKEC EQU   SAVTCKQB+4                                               02092000
SAVTCKCC EQU   SAVTCKEC                                                 02093000
IEDQCCW  EQU   0                                                        02094000
CCW      EQU   IEDQCCW                                                  02095000
CCWOPCDE EQU   CCW                                                      02096000
CCWADDR  EQU   CCW+1                                                    02097000
CCWFLAGS EQU   CCW+4                                                    02098000
CCWCD    EQU   CCWFLAGS                                                 02099000
CCWCC    EQU   CCWFLAGS                                                 02100000
CCWCOUNT EQU   CCW+6                                                    02101000
CVTMAP   EQU   0                                                        02102000
CVTDAR   EQU   CVTMAP+72                                                02103000
CVTFLGS1 EQU   CVTDAR                                                   02104000
CVTDCB   EQU   CVTMAP+116                                               02105000
CVTIOQET EQU   CVTMAP+120                                               02106000
CVTIERLC EQU   CVTMAP+144                                               02107000
CVT0PT01 EQU   CVTMAP+152                                               02108000
CVTHEAD  EQU   CVTMAP+160                                               02109000
CVTSV76C EQU   CVTHEAD                                                  02110000
CVTOPTA  EQU   CVTMAP+182                                               02111000
CVTOPTB  EQU   CVTMAP+183                                               02112000
CVTGTF   EQU   CVTMAP+236                                               02113000
CVTGTFST EQU   CVTGTF                                                   02114000
CVTGTFS  EQU   CVTGTFST                                                 02115000
CVTSTATE EQU   CVTGTFST                                                 02116000
CVTTMODE EQU   CVTGTFST                                                 02117000
CVTFORM  EQU   CVTGTFST                                                 02118000
CVTAQAVT EQU   CVTMAP+240                                               02119000
CVTTCMFG EQU   CVTAQAVT                                                 02120000
CVTVOLM2 EQU   CVTMAP+244                                               02121000
CVTTATA  EQU   CVTVOLM2                                                 02122000
CVTTSKS  EQU   CVTTATA                                                  02123000
CVTVOLF2 EQU   CVTTSKS                                                  02124000
CVTTAT   EQU   CVTTATA+1                                                02125000
CVTATER  EQU   CVTMAP+248                                               02126000
CVTEXT1  EQU   CVTMAP+252                                               02127000
CVTPURG  EQU   CVTMAP+260                                               02128000
CVTQMSG  EQU   CVTMAP+268                                               02129000
CVTDMSR  EQU   CVTMAP+272                                               02130000
CVTRSV37 EQU   CVTDMSR                                                  02131000
CVTDMSRF EQU   CVTRSV37                                                 02132000
CVTPTRV  EQU   CVTMAP+288                                               02133000
CVTERPV  EQU   CVTMAP+316                                               02134000
CVTINTLA EQU   CVTMAP+320                                               02135000
CVTAPF   EQU   CVTMAP+324                                               02136000
CVTEXT2  EQU   CVTMAP+328                                               02137000
CVTHJES  EQU   CVTMAP+332                                               02138000
CVTPGSIA EQU   CVTMAP+348                                               02139000
CVTA1F1  EQU   CVTMAP+356                                               02140000
CVTSYSK  EQU   CVTMAP+357                                               02141000
CVTVOLM1 EQU   CVTMAP+380                                               02142000
CVTVOLF1 EQU   CVTVOLM1                                                 02143000
CVTATMCT EQU   CVTMAP+388                                               02144000
CVTXTNT1 EQU   0                                                        02145000
CVTXTNT2 EQU   0                                                        02146000
CVTDSSV  EQU   CVTXTNT2                                                 02147000
CVTFLGBT EQU   CVTXTNT2+5                                               02148000
CVTQID   EQU   CVTXTNT2+24                                              02149000
CVTRV400 EQU   CVTXTNT2+52                                              02150000
CVTRV409 EQU   CVTXTNT2+53                                              02151000
CVTATCVT EQU   CVTXTNT2+64                                              02152000
CVTRV429 EQU   CVTXTNT2+84                                              02153000
CVTRV438 EQU   CVTXTNT2+85                                              02154000
CVTRV457 EQU   CVTXTNT2+112                                             02155000
CVTRV466 EQU   CVTXTNT2+113                                             02156000
CVTFIX   EQU   0                                                        02157000
CVTRELNO EQU   CVTFIX+252                                               02158000
IHADCB   EQU   0                                                        02159000
IHADCS1A EQU   0                                                        02160000
DCBBCKUP EQU   IHADCS1A+8                                               02161000
IHADCS2K EQU   0                                                        02162000
DCBDUMPD EQU   IHADCS2K                                                 02163000
DCBTRSTA EQU   IHADCS2K+5                                               02164000
DCBDSORG EQU   IHADCS2K+6                                               02165000
DCBDSRG2 EQU   DCBDSORG+1                                               02166000
DCBRNCKD EQU   IHADCS2K+12                                              02167000
DCBEXLST EQU   IHADCS2K+16                                              02168000
DCBEIOBX EQU   DCBEXLST                                                 02169000
IHADCS24 EQU   0                                                        02170000
DCBOFLGS EQU   IHADCS24+8                                               02171000
DCBOFLWR EQU   DCBOFLGS                                                 02172000
DCBIFLG  EQU   IHADCS24+9                                               02173000
DCBIBPCT EQU   DCBIFLG                                                  02174000
DCBMACR  EQU   IHADCS24+10                                              02175000
DCBMACR1 EQU   DCBMACR                                                  02176000
DCBMRFE  EQU   DCBMACR1                                                 02177000
DCBMRGET EQU   DCBMRFE                                                  02178000
DCBMRAPG EQU   DCBMACR1                                                 02179000
DCBMRRD  EQU   DCBMRAPG                                                 02180000
DCBMRCI  EQU   DCBMACR1                                                 02181000
DCBMRMVG EQU   DCBMRCI                                                  02182000
DCBMRLCG EQU   DCBMACR1                                                 02183000
DCBMRABC EQU   DCBMACR1                                                 02184000
DCBMRPT1 EQU   DCBMRABC                                                 02185000
DCBMRSBG EQU   DCBMRPT1                                                 02186000
DCBMRCRL EQU   DCBMACR1                                                 02187000
DCBMRCHK EQU   DCBMRCRL                                                 02188000
DCBMRRDX EQU   DCBMRCHK                                                 02189000
DCBMRDMG EQU   DCBMACR1                                                 02190000
DCBMACR2 EQU   DCBMACR+1                                                02191000
DCBMRPUT EQU   DCBMACR2                                                 02192000
DCBMRWRT EQU   DCBMACR2                                                 02193000
DCBMRMVP EQU   DCBMACR2                                                 02194000
DCBMR5WD EQU   DCBMACR2                                                 02195000
DCBMRLDM EQU   DCBMR5WD                                                 02196000
DCBMRLCP EQU   DCBMRLDM                                                 02197000
DCBMR4WD EQU   DCBMACR2                                                 02198000
DCBMRPT2 EQU   DCBMR4WD                                                 02199000
DCBMRTMD EQU   DCBMRPT2                                                 02200000
DCBMR3WD EQU   DCBMACR2                                                 02201000
DCBMRCTL EQU   DCBMR3WD                                                 02202000
DCBMRSTK EQU   DCBMRCTL                                                 02203000
DCBMR1WD EQU   DCBMACR2                                                 02204000
DCBMRSWA EQU   DCBMR1WD                                                 02205000
DCBMRDMD EQU   DCBMRSWA                                                 02206000
IHADCS25 EQU   0                                                        02207000
DCBMACRF EQU   IHADCS25+2                                               02208000
DCBMACF1 EQU   DCBMACRF                                                 02209000
DCBMFFE  EQU   DCBMACF1                                                 02210000
DCBMFGET EQU   DCBMFFE                                                  02211000
DCBMFAPG EQU   DCBMACF1                                                 02212000
DCBMFRD  EQU   DCBMFAPG                                                 02213000
DCBMFCI  EQU   DCBMACF1                                                 02214000
DCBMFMVG EQU   DCBMFCI                                                  02215000
DCBMFLCG EQU   DCBMACF1                                                 02216000
DCBMFABC EQU   DCBMACF1                                                 02217000
DCBMFPT1 EQU   DCBMFABC                                                 02218000
DCBMFSBG EQU   DCBMFPT1                                                 02219000
DCBMFCRL EQU   DCBMACF1                                                 02220000
DCBMFCHK EQU   DCBMFCRL                                                 02221000
DCBMFDMG EQU   DCBMACF1                                                 02222000
DCBMACF2 EQU   DCBMACRF+1                                               02223000
DCBMFPUT EQU   DCBMACF2                                                 02224000
DCBMFWRT EQU   DCBMACF2                                                 02225000
DCBMFMVP EQU   DCBMACF2                                                 02226000
DCBMF5WD EQU   DCBMACF2                                                 02227000
DCBMFLDM EQU   DCBMF5WD                                                 02228000
DCBMFLCP EQU   DCBMFLDM                                                 02229000
DCBMF4WD EQU   DCBMACF2                                                 02230000
DCBMFPT2 EQU   DCBMF4WD                                                 02231000
DCBMFTMD EQU   DCBMFPT2                                                 02232000
DCBMF3WD EQU   DCBMACF2                                                 02233000
DCBMFCTL EQU   DCBMF3WD                                                 02234000
DCBMFSTK EQU   DCBMFCTL                                                 02235000
DCBMF1WD EQU   DCBMACF2                                                 02236000
DCBMFSWA EQU   DCBMF1WD                                                 02237000
DCBMFDMD EQU   DCBMFSWA                                                 02238000
DCBDEBAD EQU   IHADCS25+4                                               02239000
DCBIFLGS EQU   DCBDEBAD                                                 02240000
DCBIFPCT EQU   DCBIFLGS                                                 02241000
IHADCS27 EQU   0                                                        02242000
DCBGET   EQU   IHADCS27                                                 02243000
DCBPUT   EQU   DCBGET                                                   02244000
DCBGETA  EQU   DCBPUT+1                                                 02245000
IHADCS43 EQU   0                                                        02246000
DCBSCTAB EQU   IHADCS43                                                 02247000
IOSB     EQU   0                                                        02248000
IOSFLA   EQU   IOSB                                                     02249000
IOSACHN  EQU   IOSFLA                                                   02250000
IOSEX    EQU   IOSFLA                                                   02251000
IOSFLB   EQU   IOSB+1                                                   02252000
IOSFLC   EQU   IOSB+2                                                   02253000
IOSDVALT EQU   IOSFLC                                                   02254000
IOSPKEY  EQU   IOSB+12                                                  02255000
IOSCOD   EQU   IOSB+13                                                  02256000
IOSOPT   EQU   IOSB+14                                                  02257000
IOSTSLL  EQU   IOSOPT                                                   02258000
IOSOPT2  EQU   IOSB+15                                                  02259000
IOSUCB   EQU   IOSB+16                                                  02260000
@NM00119 EQU   IOSB+20                                                  02261000
IOSCC    EQU   @NM00119                                                 02262000
IOSCSW   EQU   @NM00119+1                                               02263000
IOSCSWCA EQU   IOSCSW                                                   02264000
IOSTATUS EQU   IOSCSW+3                                                 02265000
IOSUSE   EQU   IOSB+32                                                  02266000
IOSSNS   EQU   IOSB+42                                                  02267000
IOSIPIB  EQU   IOSB+44                                                  02268000
IOSPATH  EQU   IOSB+86                                                  02269000
IOSCHN   EQU   IOSPATH                                                  02270000
IOSCKEY  EQU   IOSB+89                                                  02271000
IOSEEKA  EQU   IOSB+100                                                 02272000
IOSCCHH  EQU   IOSEEKA+3                                                02273000
IOSSKHH  EQU   IOSCCHH+2                                                02274000
IEDQLCB  EQU   0                                                        02275000
LCBRCB   EQU   IEDQLCB                                                  02276000
LCBQCBA  EQU   LCBRCB+1                                                 02277000
LCBPRI   EQU   LCBRCB+4                                                 02278000
LCBTSOB  EQU   IEDQLCB+19                                               02279000
LCBCHAIN EQU   IEDQLCB+20                                               02280000
LCBSCRNN EQU   LCBCHAIN                                                 02281000
LCBTETEN EQU   LCBCHAIN                                                 02282000
LCBINSRC EQU   IEDQLCB+21                                               02283000
LCBLKMDE EQU   LCBINSRC+2                                               02284000
LCBNTXT  EQU   IEDQLCB+24                                               02285000
LCBSTAT4 EQU   LCBNTXT                                                  02286000
LCBPHASE EQU   LCBSTAT4                                                 02287000
LCBREAL  EQU   LCBPHASE                                                 02288000
LCBSCBDA EQU   IEDQLCB+25                                               02289000
LCBMHA   EQU   IEDQLCB+29                                               02290000
LCBFSBFR EQU   LCBMHA                                                   02291000
LCBFLAG1 EQU   IEDQLCB+32                                               02292000
LCBIOBSN EQU   IEDQLCB+33                                               02293000
LCBFLAG2 EQU   LCBIOBSN                                                 02294000
LCBSNS   EQU   LCBIOBSN+1                                               02295000
LCBSENS0 EQU   LCBSNS                                                   02296000
LCBLOSDT EQU   LCBSENS0                                                 02297000
LCBNOTIN EQU   LCBLOSDT                                                 02298000
LCBTMOUT EQU   LCBSENS0                                                 02299000
LCBABORT EQU   LCBTMOUT                                                 02300000
LCBECBCC EQU   LCBIOBSN+3                                               02301000
LCBECBPT EQU   LCBIOBSN+4                                               02302000
LCBFLAG3 EQU   LCBIOBSN+7                                               02303000
LCBSOHR  EQU   LCBFLAG3                                                 02304000
LCBRLAD  EQU   LCBFLAG3                                                 02305000
LCBCSW   EQU   LCBIOBSN+8                                               02306000
LCBCSWCA EQU   LCBCSW                                                   02307000
LCBCSWST EQU   LCBCSW+3                                                 02308000
LCBCSWUS EQU   LCBCSWST                                                 02309000
LCBUSAT  EQU   LCBCSWUS                                                 02310000
LCBUSUC  EQU   LCBCSWUS                                                 02311000
LCBUSUE  EQU   LCBCSWUS                                                 02312000
LCBCSWCS EQU   LCBCSWST+1                                               02313000
LCBCSPCI EQU   LCBCSWCS                                                 02314000
LCBCSIL  EQU   LCBCSWCS                                                 02315000
LCBCSPGC EQU   LCBCSWCS                                                 02316000
LCBCSPTC EQU   LCBCSWCS                                                 02317000
LCBCSCDC EQU   LCBCSWCS                                                 02318000
LCBCSCCC EQU   LCBCSWCS                                                 02319000
LCBCSICC EQU   LCBCSWCS                                                 02320000
LCBCSCHC EQU   LCBCSWCS                                                 02321000
LCBCSWRC EQU   LCBCSW+5                                                 02322000
LCBSIOCC EQU   LCBIOBSN+15                                              02323000
LCBSIOC1 EQU   LCBSIOCC                                                 02324000
LCBSIOC2 EQU   LCBSIOCC                                                 02325000
LCBSTART EQU   LCBIOBSN+16                                              02326000
LCBDCBPT EQU   IEDQLCB+52                                               02327000
LCBRCQCB EQU   IEDQLCB+56                                               02328000
LCBRESTR EQU   LCBRCQCB                                                 02329000
LCBTHSQ  EQU   IEDQLCB+60                                               02330000
LCBINCAM EQU   LCBTHSQ                                                  02331000
LCBERRCT EQU   IEDQLCB+62                                               02332000
LCBLSPCI EQU   IEDQLCB+65                                               02333000
LCBRCBFR EQU   LCBLSPCI                                                 02334000
LCBRDBFR EQU   LCBRCBFR                                                 02335000
LCBSTATE EQU   IEDQLCB+70                                               02336000
LCBSTAT1 EQU   LCBSTATE                                                 02337000
LCBRECVN EQU   LCBSTAT1                                                 02338000
LCBSENDN EQU   LCBSTAT1                                                 02339000
LCBSTAT2 EQU   LCBSTATE+1                                               02340000
LCBBEOTN EQU   LCBSTAT2                                                 02341000
LCBSYNC  EQU   LCBSTAT2                                                 02342000
LCBATTN  EQU   LCBSYNC                                                  02343000
LCBDIAL  EQU   LCBSTAT2                                                 02344000
LCBBFRAV EQU   LCBDIAL                                                  02345000
LCBTSTSW EQU   IEDQLCB+72                                               02346000
LCBERB   EQU   IEDQLCB+76                                               02347000
LCBERBST EQU   IEDQLCB+84                                               02348000
LCBDLNKN EQU   LCBERBST                                                 02349000
LCBERBCT EQU   IEDQLCB+88                                               02350000
LCBRBCT2 EQU   LCBERBCT+1                                               02351000
LCBTTCIN EQU   IEDQLCB+90                                               02352000
LCBMSGFM EQU   IEDQLCB+92                                               02353000
LCBOBRCH EQU   IEDQLCB+96                                               02354000
LCBINVPT EQU   LCBOBRCH+1                                               02355000
LCBBFRW  EQU   LCBINVPT                                                 02356000
LCBTPCD  EQU   IEDQLCB+100                                              02357000
LCBSTAT5 EQU   LCBTPCD                                                  02358000
LCBSTAT6 EQU   LCBTPCD+4                                                02359000
LCBRSPSV EQU   LCBTPCD+8                                                02360000
LCBSAVSN EQU   IEDQLCB+112                                              02361000
LCBERCCW EQU   IEDQLCB+120                                              02362000
LCBCPA   EQU   IEDQLCB+144                                              02363000
LCBCCW1  EQU   LCBCPA                                                   02364000
LCBCCW2  EQU   LCBCPA+8                                                 02365000
LCBCCW3  EQU   LCBCPA+16                                                02366000
LCBCCW4  EQU   LCBCPA+24                                                02367000
LCBCCW5  EQU   LCBCPA+32                                                02368000
LCBATTEL EQU   LCBCCW5                                                  02369000
LCBQEBPL EQU   LCBATTEL                                                 02370000
LCBIOSB  EQU   LCBQEBPL+1                                               02371000
LCBCCW6  EQU   LCBCPA+40                                                02372000
LCBCCW7  EQU   LCBCPA+48                                                02373000
IEDQLCBX EQU   0                                                        02374000
LCBXCON  EQU   IEDQLCBX                                                 02375000
LCBXFLAG EQU   LCBXCON                                                  02376000
LCBXDCT  EQU   LCBXCON+1                                                02377000
LCBXRADR EQU   LCBXCON+4                                                02378000
IEDQPRF  EQU   0                                                        02379000
PRFRCB   EQU   IEDQPRF                                                  02380000
PRFKEY   EQU   PRFRCB                                                   02381000
PRFQCBA  EQU   PRFRCB+1                                                 02382000
PRFPRI   EQU   PRFRCB+4                                                 02383000
PRFLINK  EQU   PRFRCB+5                                                 02384000
PRFTIC   EQU   IEDQPRF+8                                                02385000
PRFTICC  EQU   PRFTIC                                                   02386000
PRFTI0   EQU   PRFTIC+1                                                 02387000
PRFNBUNT EQU   IEDQPRF+12                                               02388000
PRFSUNIT EQU   PRFNBUNT                                                 02389000
PRFPLQCB EQU   PRFSUNIT                                                 02390000
PRFPIUO  EQU   PRFPLQCB                                                 02391000
@NM00172 EQU   IEDQPRF+16                                               02392000
PRFSVFFO EQU   @NM00172                                                 02393000
PRFSTAT1 EQU   IEDQPRF+20                                               02394000
PRFEOFN  EQU   PRFSTAT1                                                 02395000
PRFCORE  EQU   IEDQPRF+21                                               02396000
PRFXTRA  EQU   PRFCORE                                                  02397000
PRFSCAN  EQU   IEDQPRF+24                                               02398000
PRFTQBCK EQU   IEDQPRF+26                                               02399000
PRFNTXT  EQU   PRFTQBCK                                                 02400000
PRFEOBOF EQU   PRFNTXT                                                  02401000
PRFCHDR  EQU   IEDQPRF+32                                               02402000
PRFHQBCK EQU   IEDQPRF+35                                               02403000
IEDPF1   EQU   0                                                        02404000
PRF1FLG1 EQU   IEDPF1+3                                                 02405000
PRF1WD2  EQU   IEDPF1+4                                                 02406000
PRF1SEQP EQU   PRF1WD2                                                  02407000
PRF1SQID EQU   PRF1SEQP                                                 02408000
PRF1TAG1 EQU   PRF1SQID                                                 02409000
IEDPF2   EQU   0                                                        02410000
PRF2FLG2 EQU   IEDPF2                                                   02411000
PRF2WD2  EQU   IEDPF2+4                                                 02412000
IEDQTCXD EQU   0                                                        02413000
TCXAVT   EQU   IEDQTCXD                                                 02414000
TCXATTEN EQU   IEDQTCXD+4                                               02415000
TCXREADY EQU   IEDQTCXD+24                                              02416000
TCXFLAG1 EQU   IEDQTCXD+34                                              02417000
TCXBUFA  EQU   IEDQTCXD+80                                              02418000
TCXDSAVE EQU   IEDQTCXD+104                                             02419000
TCXQE8   EQU   IEDQTCXD+216                                             02420000
IEDQTNTD EQU   0                                                        02421000
IEDQTCDE EQU   IEDQTNTD                                                 02422000
IEDQTDCE EQU   IEDQTNTD+46                                              02423000
TNTCODE  EQU   0                                                        02424000
IEDTNTA  EQU   0                                                        02425000
IEDRH    EQU   0                                                        02426000
TRHBYTE0 EQU   IEDRH                                                    02427000
TRHFI    EQU   TRHBYTE0                                                 02428000
TRHBC    EQU   TRHBYTE0                                                 02429000
TRHEC    EQU   TRHBYTE0                                                 02430000
TRHBYTE1 EQU   IEDRH+1                                                  02431000
TRHBYTE2 EQU   IEDRH+2                                                  02432000
IEDRQE   EQU   0                                                        02433000
RQEUCB   EQU   IEDRQE+2                                                 02434000
RQEIOB   EQU   IEDRQE+5                                                 02435000
RRQE     EQU   0                                                        02436000
IEDTRM   EQU   0                                                        02437000
IEDNTRM  EQU   IEDTRM                                                   02438000
TRMBYTE4 EQU   IEDNTRM                                                  02439000
TRMBYTE3 EQU   IEDNTRM+1                                                02440000
TRMBYTE2 EQU   IEDNTRM+2                                                02441000
TRMINPG  EQU   TRMBYTE2                                                 02442000
TRMBYTE1 EQU   IEDNTRM+3                                                02443000
TRMSCPRQ EQU   TRMBYTE1                                                 02444000
TRMBYTE0 EQU   IEDNTRM+6                                                02445000
TRMSIBPT EQU   IEDNTRM+7                                                02446000
IEDQTRM  EQU   IEDTRM+14                                                02447000
TRMSTATE EQU   IEDQTRM                                                  02448000
TRMLOG   EQU   TRMSTATE                                                 02449000
TRMINSEQ EQU   IEDQTRM+4                                                02450000
TLISTCNT EQU   TRMINSEQ                                                 02451000
TRMOUTSQ EQU   IEDQTRM+6                                                02452000
TLISTEN  EQU   TRMOUTSQ                                                 02453000
TRMDSORG EQU   TLISTEN                                                  02454000
TRMALTD  EQU   IEDQTRM+8                                                02455000
TRMDEVFL EQU   IEDQTRM+10                                               02456000
TRMSTAT  EQU   IEDQTRM+12                                               02457000
IEDTH    EQU   0                                                        02458000
TTHBYTE0 EQU   IEDTH                                                    02459000
TTHFTYPE EQU   TTHBYTE0                                                 02460000
TTHBBIU  EQU   TTHBYTE0                                                 02461000
TTHEBIU  EQU   TTHBYTE0                                                 02462000
TTHDAF   EQU   IEDTH+2                                                  02463000
TTHOAF   EQU   IEDTH+4                                                  02464000
TTHSNF   EQU   IEDTH+6                                                  02465000
TTHTAG   EQU   TTHSNF                                                   02466000
TTHTAG1  EQU   TTHTAG                                                   02467000
TTHDCF   EQU   IEDTH+8                                                  02468000
ECB      EQU   0                                                        02469000
ECBCC    EQU   ECB                                                      02470000
ECBWAIT  EQU   ECBCC                                                    02471000
INOPRU   EQU   0                                                        02472000
INOPNS   EQU   INOPRU                                                   02473000
INOPPC   EQU   INOPRU+1                                                 02474000
INOPCMD  EQU   INOPRU+2                                                 02475000
INOPNA   EQU   INOPRU+3                                                 02476000
INOPDATA EQU   INOPRU+5                                                 02477000
LNTRACE  EQU   0                                                        02478000
CONVERT  EQU   0                                                        02479000
NAADDR   EQU   0                                                        02480000
POST     EQU   0                                                        02481000
INOPAREA EQU   0                                                        02482000
TNTDCODE EQU   0                                                        02483000
TNTFIRST EQU   0                                                        02484000
CVTS01   EQU   CVTPGSIA                                                 02485000
CVTLPDIA EQU   CVTS01+12                                                02486000
CVTDIRST EQU   CVTLPDIA                                                 02487000
CVTSLIDA EQU   CVTS01+24                                                02488000
CVTCTLFG EQU   CVTS01+50                                                02489000
CVTRV210 EQU   CVTS01+424                                               02490000
CVTRV219 EQU   CVTS01+425                                               02491000
CVTRV228 EQU   CVTS01+426                                               02492000
CVTRV237 EQU   CVTS01+427                                               02493000
CVTMFRTR EQU   CVTS01+452                                               02494000
CVTRV262 EQU   CVTS01+468                                               02495000
CVTRV271 EQU   CVTS01+469                                               02496000
CVTRV280 EQU   CVTS01+470                                               02497000
CVTRV289 EQU   CVTS01+471                                               02498000
CVTGSDA  EQU   CVTS01+600                                               02499000
IOSBPTR  EQU   LCBIOSB                                                  02500000
IOSATTSC EQU   IOSIPIB                                                  02501000
IOSWTOWA EQU   IOSIPIB                                                  02502000
IOSPCISC EQU   IOSIPIB                                                  02503000
LCBRSPIN EQU   LCBIOBSN                                                 02504000
LCBLUSNS EQU   LCBRSPIN+5                                               02505000
LCBSCPRS EQU   LCBRSPIN+9                                               02506000
LCBCSWU1 EQU   LCBSCPRS+2                                               02507000
LCBRSPFG EQU   LCBRSPIN+15                                              02508000
LCBCOREQ EQU   LCBTPCD                                                  02509000
@NM00152 EQU   LCBCPA+40                                                02510000
LCBQNX   EQU   LCBERCCW                                                 02511000
LCBQNXMN EQU   LCBQNX                                                   02512000
LCBNX142 EQU   LCBQNXMN                                                 02513000
LCBCANCL EQU   LCBSAVSN                                                 02514000
LCBCANFG EQU   LCBCANCL                                                 02515000
PRFSHDR  EQU   IEDQPRF+42                                               02516000
TCXPTR   EQU   CVTAQAVT                                                 02517000
IEDQNPTR EQU   AVTRNMPT                                                 02518000
TRMPRE1  EQU   TRMBYTE4                                                 02519000
TRMNCP1  EQU   TRMBYTE4                                                 02520000
TRMINOP  EQU   TRMNCP1                                                  02521000
TRMPRE   EQU   TRMBYTE3                                                 02522000
TRMNCP   EQU   TRMBYTE3                                                 02523000
TRMIPLDM EQU   TRMNCP                                                   02524000
TRMSLOWN EQU   TRMNCP                                                   02525000
TRMPU    EQU   TRMBYTE3                                                 02526000
TRMLU    EQU   TRMBYTE3                                                 02527000
TRMLINK  EQU   TRMBYTE3                                                 02528000
TICCHK   EQU   CCWOPCDE                                                 02529000
NOTTIC1  EQU   TICCHK                                                   02530000
NOTTIC2  EQU   TICCHK                                                   02531000
NOTTIC3  EQU   TICCHK                                                   02532000
CPA      EQU   LCBCPA                                                   02533000
@NM00200 EQU   CPA                                                      02534000
CPAWRTS  EQU   @NM00200                                                 02535000
@NM00203 EQU   CPA+8                                                    02536000
CPAWRTBF EQU   @NM00203+1                                               02537000
CPAWRTBK EQU   @NM00203+5                                               02538000
@NM00206 EQU   CPA+16                                                   02539000
CPARDS   EQU   @NM00206                                                 02540000
@NM00209 EQU   CPA+24                                                   02541000
CPARDU   EQU   @NM00209+1                                               02542000
CPAWNOOP EQU   CPA+40                                                   02543000
CPARNOOP EQU   CPA+48                                                   02544000
REGSVE   EQU   AVTSAVEX                                                 02545000
DIOSUCB  EQU   IOSUCB                                                   02546000
DIOSUCBP EQU   DIOSUCB+2                                                02547000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02548000
@NM00212 EQU   DIOSUCB                                                  02549000
REG1SVE  EQU   REGSVE+4                                                 02550000
REG0SVE  EQU   REGSVE                                                   02551000
@NM00211 EQU   CPA+32                                                   02552000
@NM00210 EQU   @NM00209                                                 02553000
@NM00208 EQU   @NM00206+4                                               02554000
@NM00207 EQU   @NM00206+1                                               02555000
@NM00205 EQU   @NM00203+4                                               02556000
@NM00204 EQU   @NM00203                                                 02557000
CPAOPRE  EQU   @NM00200+5                                               02558000
@NM00202 EQU   @NM00200+4                                               02559000
@NM00201 EQU   @NM00200+1                                               02560000
@NM00199 EQU   TICCHK                                                   02561000
@NM00194 EQU   TRMLINK                                                  02562000
TRMLSTAT EQU   TRMLINK                                                  02563000
TRMLINT  EQU   TRMLINK                                                  02564000
TRMEPMOD EQU   TRMLINK                                                  02565000
TRMLULOG EQU   TRMLU                                                    02566000
TRMINERR EQU   TRMLU                                                    02567000
TRMLUREQ EQU   TRMLU                                                    02568000
TRMSESRQ EQU   TRMLU                                                    02569000
TRMTDIFF EQU   TRMLU                                                    02570000
TRMLUTM  EQU   TRMLU                                                    02571000
TRMLUIT  EQU   TRMLU                                                    02572000
TRMAUTO  EQU   TRMLU                                                    02573000
TRMPCONT EQU   TRMPU                                                    02574000
@NM00193 EQU   TRMPU                                                    02575000
TRMNCONT EQU   TRMNCP                                                   02576000
TRMQUCKN EQU   TRMNCP                                                   02577000
TRMSYGEN EQU   TRMNCP                                                   02578000
TRMNCPCL EQU   TRMNCP                                                   02579000
TRMINOUT EQU   TRMPRE                                                   02580000
TRMRDOUT EQU   TRMPRE                                                   02581000
TRMNLOUT EQU   TRMPRE                                                   02582000
TRMWROUT EQU   TRMPRE                                                   02583000
TRMASNXI EQU   TRMPRE                                                   02584000
TRMSTMM  EQU   TRMPRE                                                   02585000
TRMCMODE EQU   TRMPRE                                                   02586000
TRMSTPND EQU   TRMPRE                                                   02587000
@NM00192 EQU   TRMNCP1                                                  02588000
TRMLYNCH EQU   TRMPRE1                                                  02589000
TRMSPOUT EQU   TRMPRE1                                                  02590000
TRMERLCK EQU   TRMPRE1                                                  02591000
TRMQNPL  EQU   TRMPRE1                                                  02592000
TRMSPACT EQU   TRMPRE1                                                  02593000
TRMOCNI  EQU   TRMPRE1                                                  02594000
TRMSESSN EQU   TRMPRE1                                                  02595000
TRMCONT  EQU   TRMPRE1                                                  02596000
@NM00160 EQU   LCBCANCL+3                                               02597000
LCBCANTH EQU   LCBCANCL+1                                               02598000
@NM00159 EQU   LCBCANFG                                                 02599000
LCBCANCD EQU   LCBCANFG                                                 02600000
@NM00158 EQU   LCBCANFG                                                 02601000
LCBCANEB EQU   LCBCANFG                                                 02602000
LCBCANXT EQU   LCBCANFG                                                 02603000
LCBUNADD EQU   LCBQNX+21                                                02604000
LCBUASZE EQU   LCBQNX+20                                                02605000
LCBDSTEA EQU   LCBQNX+16                                                02606000
@NM00157 EQU   LCBQNX+8                                                 02607000
LCBIOSBS EQU   LCBQNX+5                                                 02608000
@NM00156 EQU   LCBQNX+4                                                 02609000
LCBSTSAV EQU   LCBQNX+1                                                 02610000
@NM00155 EQU   LCBQNXMN                                                 02611000
LCBNX509 EQU   LCBQNXMN                                                 02612000
LCBNX162 EQU   LCBQNXMN                                                 02613000
LCBNX064 EQU   LCBQNXMN                                                 02614000
@NM00154 EQU   @NM00152+4                                               02615000
LCBNCPPT EQU   @NM00152+1                                               02616000
@NM00153 EQU   @NM00152                                                 02617000
LCBWRSCH EQU   LCBCOREQ+8                                               02618000
LCBCQLNK EQU   LCBCOREQ+4                                               02619000
LCBCQELE EQU   LCBCOREQ                                                 02620000
LCBPAKCH EQU   LCBRSPIN+16                                              02621000
@NM00151 EQU   LCBRSPFG                                                 02622000
LCBRSRH  EQU   LCBRSPFG                                                 02623000
LCBEXPI  EQU   LCBRSPFG                                                 02624000
@NM00150 EQU   LCBRSPIN+12                                              02625000
LCBUSUE1 EQU   LCBCSWU1                                                 02626000
@NM00149 EQU   LCBCSWU1                                                 02627000
@NM00148 EQU   LCBSCPRS+1                                               02628000
LCBDFCMD EQU   LCBSCPRS                                                 02629000
LCBUSER  EQU   LCBLUSNS+2                                               02630000
LCBSMIN  EQU   LCBLUSNS+1                                               02631000
LCBSMAJ  EQU   LCBLUSNS                                                 02632000
LCBRHSV  EQU   LCBRSPIN+2                                               02633000
LCBSNS0  EQU   LCBRSPIN+1                                               02634000
@NM00147 EQU   LCBRSPIN                                                 02635000
IOSPCIWA EQU   IOSPCISC+44                                              02636000
IOSPCIRS EQU   IOSPCISC+8                                               02637000
@NM00124 EQU   IOSPCISC+4                                               02638000
@NM00123 EQU   IOSPCISC                                                 02639000
IOSWRNDR EQU   IOSWTOWA+4                                               02640000
IOSWTOPT EQU   IOSWTOWA+3                                               02641000
IOSWTOCP EQU   IOSWTOWA+2                                               02642000
IOSWTOCH EQU   IOSWTOWA                                                 02643000
IOSATTWA EQU   IOSATTSC+40                                              02644000
@NM00122 EQU   IOSATTSC+24                                              02645000
IOSATTSN EQU   IOSATTSC                                                 02646000
CVTRV628 EQU   CVTS01+728                                               02647000
CVTRV627 EQU   CVTS01+724                                               02648000
CVTRV626 EQU   CVTS01+720                                               02649000
CVTRV625 EQU   CVTS01+716                                               02650000
CVTRV624 EQU   CVTS01+712                                               02651000
CVTRV623 EQU   CVTS01+708                                               02652000
CVTRV622 EQU   CVTS01+704                                               02653000
CVTRV621 EQU   CVTS01+700                                               02654000
CVTIHASU EQU   CVTS01+696                                               02655000
CVTRV619 EQU   CVTS01+692                                               02656000
CVTRV618 EQU   CVTS01+688                                               02657000
CVTRV617 EQU   CVTS01+684                                               02658000
CVTRV616 EQU   CVTS01+680                                               02659000
CVTRV615 EQU   CVTS01+676                                               02660000
CVTRV614 EQU   CVTS01+672                                               02661000
CVTRV613 EQU   CVTS01+668                                               02662000
CVTTCASP EQU   CVTS01+664                                               02663000
CVT0PT03 EQU   CVTS01+660                                               02664000
CVT0PT0E EQU   CVTS01+656                                               02665000
CVTRV609 EQU   CVTS01+652                                               02666000
CVTCGK   EQU   CVTS01+648                                               02667000
CVTRAC   EQU   CVTS01+644                                               02668000
CVTHSM   EQU   CVTS01+640                                               02669000
CVTRV605 EQU   CVTS01+636                                               02670000
CVTRV604 EQU   CVTS01+632                                               02671000
CVTEFF02 EQU   CVTS01+628                                               02672000
CVTCBBR  EQU   CVTS01+624                                               02673000
CVTSSCR  EQU   CVTS01+620                                               02674000
CVTEVENT EQU   CVTS01+616                                               02675000
CVTCRCA  EQU   CVTS01+612                                               02676000
CVTTPIO  EQU   CVTS01+608                                               02677000
CVTADV   EQU   CVTS01+604                                               02678000
CVTGSDAB EQU   CVTGSDA                                                  02679000
CVTQV3   EQU   CVTS01+596                                               02680000
CVTQV2   EQU   CVTS01+592                                               02681000
CVTQV1   EQU   CVTS01+588                                               02682000
CVTRPT   EQU   CVTS01+584                                               02683000
CVTSSRB  EQU   CVTS01+580                                               02684000
CVTCSDRL EQU   CVTS01+576                                               02685000
CVTEXP1  EQU   CVTS01+572                                               02686000
CVTRMPMT EQU   CVTS01+568                                               02687000
CVTRMPTT EQU   CVTS01+564                                               02688000
CVTVPSA  EQU   CVTS01+560                                               02689000
CVTVSTOP EQU   CVTS01+556                                               02690000
CVTGTFR8 EQU   CVTS01+552                                               02691000
CVTQUIT  EQU   CVTS01+548                                               02692000
CVTVACR  EQU   CVTS01+544                                               02693000
CVTWTCB  EQU   CVTS01+540                                               02694000
CVTSTPRS EQU   CVTS01+536                                               02695000
CVT0PT02 EQU   CVTS01+532                                               02696000
CVTDARCM EQU   CVTS01+528                                               02697000
CVTIRECM EQU   CVTS01+524                                               02698000
CVTJRECM EQU   CVTS01+520                                               02699000
CVTVEMS0 EQU   CVTS01+516                                               02700000
CVTSPFRR EQU   CVTS01+512                                               02701000
CVTRLSTG EQU   CVTS01+508                                               02702000
CVT0TC0A EQU   CVTS01+504                                               02703000
CVTGMBR  EQU   CVTS01+500                                               02704000
CVTLFRM  EQU   CVTS01+496                                               02705000
CVTRMBR  EQU   CVTS01+492                                               02706000
CVTVIOP  EQU   CVTS01+488                                               02707000
CVTRV307 EQU   CVTS01+486                                               02708000
CVTRV306 EQU   CVTS01+484                                               02709000
CVTRV305 EQU   CVTS01+482                                               02710000
CVTRV304 EQU   CVTS01+480                                               02711000
CVTRV303 EQU   CVTS01+478                                               02712000
CVTRV302 EQU   CVTS01+476                                               02713000
CVTTRCA  EQU   CVTS01+472                                               02714000
CVTRV297 EQU   CVTRV289                                                 02715000
CVTRV296 EQU   CVTRV289                                                 02716000
CVTRV295 EQU   CVTRV289                                                 02717000
CVTRV294 EQU   CVTRV289                                                 02718000
CVTRV293 EQU   CVTRV289                                                 02719000
CVTRV292 EQU   CVTRV289                                                 02720000
CVTRV291 EQU   CVTRV289                                                 02721000
CVTRV290 EQU   CVTRV289                                                 02722000
CVTRV288 EQU   CVTRV280                                                 02723000
CVTRV287 EQU   CVTRV280                                                 02724000
CVTRV286 EQU   CVTRV280                                                 02725000
CVTRV285 EQU   CVTRV280                                                 02726000
CVTRV284 EQU   CVTRV280                                                 02727000
CVTRV283 EQU   CVTRV280                                                 02728000
CVTRV282 EQU   CVTRV280                                                 02729000
CVTRV281 EQU   CVTRV280                                                 02730000
CVTRV279 EQU   CVTRV271                                                 02731000
CVTRV278 EQU   CVTRV271                                                 02732000
CVTRV277 EQU   CVTRV271                                                 02733000
CVTRV276 EQU   CVTRV271                                                 02734000
CVTRV275 EQU   CVTRV271                                                 02735000
CVTRV274 EQU   CVTRV271                                                 02736000
CVTRV273 EQU   CVTRV271                                                 02737000
CVTRV272 EQU   CVTRV271                                                 02738000
CVTRV270 EQU   CVTRV262                                                 02739000
CVTRV269 EQU   CVTRV262                                                 02740000
CVTRV268 EQU   CVTRV262                                                 02741000
CVTRV267 EQU   CVTRV262                                                 02742000
CVTRV266 EQU   CVTRV262                                                 02743000
CVTRV265 EQU   CVTRV262                                                 02744000
CVTRV264 EQU   CVTRV262                                                 02745000
CVTRV263 EQU   CVTRV262                                                 02746000
CVTVFP   EQU   CVTS01+464                                               02747000
CVTVSI   EQU   CVTS01+460                                               02748000
CVTVPSIB EQU   CVTS01+456                                               02749000
CVTMFACT EQU   CVTMFRTR                                                 02750000
CVTMFCTL EQU   CVTS01+448                                               02751000
CVTPVBP  EQU   CVTS01+444                                               02752000
CVTPWI   EQU   CVTS01+440                                               02753000
CVTRV254 EQU   CVTS01+438                                               02754000
CVTRV253 EQU   CVTS01+436                                               02755000
CVTRV252 EQU   CVTS01+434                                               02756000
CVTRV251 EQU   CVTS01+433                                               02757000
CVTRV250 EQU   CVTS01+432                                               02758000
CVTRV249 EQU   CVTS01+431                                               02759000
CVTRV248 EQU   CVTS01+430                                               02760000
CVTRV247 EQU   CVTS01+429                                               02761000
CVTRV246 EQU   CVTS01+428                                               02762000
CVTRV245 EQU   CVTRV237                                                 02763000
CVTRV244 EQU   CVTRV237                                                 02764000
CVTRV243 EQU   CVTRV237                                                 02765000
CVTRV242 EQU   CVTRV237                                                 02766000
CVTRV241 EQU   CVTRV237                                                 02767000
CVTRV240 EQU   CVTRV237                                                 02768000
CVTRV239 EQU   CVTRV237                                                 02769000
CVTRV238 EQU   CVTRV237                                                 02770000
CVTRV236 EQU   CVTRV228                                                 02771000
CVTRV235 EQU   CVTRV228                                                 02772000
CVTRV234 EQU   CVTRV228                                                 02773000
CVTRV233 EQU   CVTRV228                                                 02774000
CVTRV232 EQU   CVTRV228                                                 02775000
CVTRV231 EQU   CVTRV228                                                 02776000
CVTRV230 EQU   CVTRV228                                                 02777000
CVTRV229 EQU   CVTRV228                                                 02778000
CVTRV227 EQU   CVTRV219                                                 02779000
CVTRV226 EQU   CVTRV219                                                 02780000
CVTRV225 EQU   CVTRV219                                                 02781000
CVTRV224 EQU   CVTRV219                                                 02782000
CVTRV223 EQU   CVTRV219                                                 02783000
CVTRV222 EQU   CVTRV219                                                 02784000
CVTRV221 EQU   CVTRV219                                                 02785000
CVTRV220 EQU   CVTRV219                                                 02786000
CVTRV218 EQU   CVTRV210                                                 02787000
CVTRV217 EQU   CVTRV210                                                 02788000
CVTRV216 EQU   CVTRV210                                                 02789000
CVTRV215 EQU   CVTRV210                                                 02790000
CVTRV214 EQU   CVTRV210                                                 02791000
CVTRV213 EQU   CVTRV210                                                 02792000
CVTRV212 EQU   CVTRV210                                                 02793000
CVTRV211 EQU   CVTRV210                                                 02794000
CVTLCCAT EQU   CVTS01+420                                               02795000
CVTPCCAT EQU   CVTS01+416                                               02796000
CVTIPCRP EQU   CVTS01+412                                               02797000
CVTIPCRI EQU   CVTS01+408                                               02798000
CVTIPCDS EQU   CVTS01+404                                               02799000
CVTAIDVT EQU   CVTS01+400                                               02800000
CVTSSAP  EQU   CVTS01+396                                               02801000
CVTEHCIR EQU   CVTS01+392                                               02802000
CVTEHDEF EQU   CVTS01+388                                               02803000
CVTDAIR  EQU   CVTS01+384                                               02804000
CVTPERFM EQU   CVTS01+380                                               02805000
CVT044R2 EQU   CVTS01+376                                               02806000
CVTFETCH EQU   CVTS01+372                                               02807000
CVTRSTWD EQU   CVTS01+368                                               02808000
CVTSPOST EQU   CVTS01+364                                               02809000
CVTIOBP  EQU   CVTS01+360                                               02810000
CVTASMVT EQU   CVTS01+356                                               02811000
CVTRECRQ EQU   CVTS01+352                                               02812000
CVTWSAC  EQU   CVTS01+348                                               02813000
CVTRV149 EQU   CVTS01+344                                               02814000
CVTWSAL  EQU   CVTS01+340                                               02815000
CVTSPSA  EQU   CVTS01+336                                               02816000
CVTGLMN  EQU   CVTS01+332                                               02817000
CVTVEAC0 EQU   CVTS01+328                                               02818000
CVT062R1 EQU   CVTS01+324                                               02819000
CVTRPOST EQU   CVTS01+320                                               02820000
CVTDQIQE EQU   CVTS01+316                                               02821000
CVTCSD   EQU   CVTS01+312                                               02822000
CVTLKRMA EQU   CVTS01+308                                               02823000
CVTRSPIE EQU   CVTS01+304                                               02824000
CVTRENQ  EQU   CVTS01+300                                               02825000
CVTLQCB  EQU   CVTS01+296                                               02826000
CVTFQCB  EQU   CVTS01+292                                               02827000
CVTQCS01 EQU   CVTS01+288                                               02828000
CVTAPFT  EQU   CVTS01+284                                               02829000
CVTPARRL EQU   CVTS01+280                                               02830000
CVTVWAIT EQU   CVTS01+276                                               02831000
CVTGSPL  EQU   CVTS01+272                                               02832000
CVTLSMQ  EQU   CVTS01+268                                               02833000
CVTGSMQ  EQU   CVTS01+264                                               02834000
CVTEXPRO EQU   CVTS01+260                                               02835000
CVTOPCTP EQU   CVTS01+256                                               02836000
CVTSIC   EQU   CVTS01+252                                               02837000
CVTTPIOS EQU   CVTS01+248                                               02838000
CVTRTMS  EQU   CVTS01+244                                               02839000
CVTSDBF  EQU   CVTS01+240                                               02840000
CVTSCBP  EQU   CVTS01+236                                               02841000
CVTSDMP  EQU   CVTS01+232                                               02842000
CVTSV60  EQU   CVTS01+228                                               02843000
CVTRTMCT EQU   CVTS01+224                                               02844000
CVTASCBL EQU   CVTS01+220                                               02845000
CVTASCBH EQU   CVTS01+216                                               02846000
CVTGDA   EQU   CVTS01+212                                               02847000
CVTASVT  EQU   CVTS01+208                                               02848000
CVTVVMDI EQU   CVTS01+204                                               02849000
CVTAQTOP EQU   CVTS01+200                                               02850000
CVTIOSCS EQU   CVTS01+196                                               02851000
CVTSDRM  EQU   CVTS01+192                                               02852000
CVTOPTE  EQU   CVTS01+188                                               02853000
CVTSTXU  EQU   CVTS01+184                                               02854000
CVTQUIS  EQU   CVTS01+180                                               02855000
CVTPARS  EQU   CVTS01+176                                               02856000
CVTS1EE  EQU   CVTS01+172                                               02857000
CVTFRAS  EQU   CVTS01+168                                               02858000
CVTQSAS  EQU   CVTS01+164                                               02859000
CVTCRAS  EQU   CVTS01+160                                               02860000
CVTCRMN  EQU   CVTS01+156                                               02861000
CVTDELCP EQU   CVTS01+152                                               02862000
CVTFRECL EQU   CVTS01+148                                               02863000
CVTGETCL EQU   CVTS01+144                                               02864000
CVTBLDCP EQU   CVTS01+140                                               02865000
CVTAUTHL EQU   CVTS01+136                                               02866000
CVTSCAN  EQU   CVTS01+132                                               02867000
CVTRV144 EQU   CVTS01+130                                               02868000
CVTMAXMP EQU   CVTS01+128                                               02869000
CVTSTCK  EQU   CVTS01+124                                               02870000
CVTRV139 EQU   CVTS01+123                                               02871000
CVTDSSAC EQU   CVTS01+122                                               02872000
CVTRV513 EQU   CVTS01+121                                               02873000
CVTIOSPL EQU   CVTS01+120                                               02874000
CVTPTGT  EQU   CVTS01+116                                               02875000
CVTCSPIE EQU   CVTS01+112                                               02876000
CVTSMFEX EQU   CVTS01+108                                               02877000
CVTOLT0A EQU   CVTS01+104                                               02878000
CVTSRBRT EQU   CVTS01+100                                               02879000
CVTPUTL  EQU   CVTS01+96                                                02880000
CVTASCRL EQU   CVTS01+92                                                02881000
CVTASCRF EQU   CVTS01+88                                                02882000
CVTRV326 EQU   CVTS01+84                                                02883000
CVTRV325 EQU   CVTS01+80                                                02884000
CVTRV324 EQU   CVTS01+76                                                02885000
CVT0VL01 EQU   CVTS01+72                                                02886000
CVTSHRVM EQU   CVTS01+68                                                02887000
CVTRV332 EQU   CVTS01+64                                                02888000
CVTTAS   EQU   CVTS01+60                                                02889000
CVTRSCN  EQU   CVTS01+56                                                02890000
CVTTRAC2 EQU   CVTS01+54                                                02891000
CVTTRACE EQU   CVTS01+52                                                02892000
CVTAPG   EQU   CVTS01+51                                                02893000
CVTSDTRC EQU   CVTCTLFG                                                 02894000
CVTGTRCE EQU   CVTCTLFG                                                 02895000
CVTNOMP  EQU   CVTCTLFG                                                 02896000
CVTRSV79 EQU   CVTCTLFG                                                 02897000
CVTDSTAT EQU   CVTCTLFG                                                 02898000
CVTRSV78 EQU   CVTCTLFG                                                 02899000
CVTRV333 EQU   CVTCTLFG                                                 02900000
CVTRV323 EQU   CVTCTLFG                                                 02901000
CVTSPVLK EQU   CVTS01+49                                                02902000
CVTRSV77 EQU   CVTS01+48                                                02903000
CVTRV331 EQU   CVTS01+44                                                02904000
CVTRV330 EQU   CVTS01+40                                                02905000
CVTRV329 EQU   CVTS01+36                                                02906000
CVTRV328 EQU   CVTS01+32                                                02907000
CVTRV322 EQU   CVTS01+28                                                02908000
CVTSLID  EQU   CVTSLIDA+1                                               02909000
CVTSYLK  EQU   CVTSLIDA                                                 02910000
CVTRV321 EQU   CVTS01+20                                                02911000
CVTRV320 EQU   CVTS01+16                                                02912000
CVTLPDIR EQU   CVTLPDIA+1                                               02913000
CVTRSV69 EQU   CVTDIRST                                                 02914000
CVTRSV68 EQU   CVTDIRST                                                 02915000
CVTRSV67 EQU   CVTDIRST                                                 02916000
CVTRSV66 EQU   CVTDIRST                                                 02917000
CVTRSV65 EQU   CVTDIRST                                                 02918000
CVTRSV64 EQU   CVTDIRST                                                 02919000
CVTRSV63 EQU   CVTDIRST                                                 02920000
CVTDICOM EQU   CVTDIRST                                                 02921000
CVTPVTP  EQU   CVTS01+8                                                 02922000
CVTLPDSR EQU   CVTS01+4                                                 02923000
CVTGETL  EQU   CVTS01                                                   02924000
@NM00198 EQU   ECB+1                                                    02925000
@NM00197 EQU   ECBCC                                                    02926000
ECBPOST  EQU   ECBCC                                                    02927000
TTHTAG2  EQU   TTHTAG+1                                                 02928000
@NM00196 EQU   TTHTAG1                                                  02929000
TTHTAGS  EQU   TTHTAG1                                                  02930000
TTHBYTE1 EQU   IEDTH+1                                                  02931000
TTHEFI   EQU   TTHBYTE0                                                 02932000
@NM00195 EQU   TTHBYTE0                                                 02933000
TRMOPT   EQU   IEDTRM+34                                                02934000
TRMOPTBL EQU   IEDQTRM+18                                               02935000
TRMOPNO  EQU   IEDQTRM+17                                               02936000
TRMCHCIN EQU   IEDQTRM+16                                               02937000
TRMSENSE EQU   TRMSTAT+3                                                02938000
TRMTEMPR EQU   TRMSTAT+2                                                02939000
TRMSIO   EQU   TRMSTAT                                                  02940000
@NM00191 EQU   TRMDEVFL+1                                               02941000
TRMTPIN  EQU   TRMDEVFL+1                                               02942000
TRMNCPI  EQU   TRMDEVFL+1                                               02943000
TRMRNTRM EQU   TRMDEVFL+1                                               02944000
@NM00190 EQU   TRMDEVFL+1                                               02945000
TRMLMD   EQU   TRMDEVFL+1                                               02946000
TRMCONC  EQU   TRMDEVFL+1                                               02947000
TRMTSOB  EQU   TRMDEVFL                                                 02948000
TRMBFDY  EQU   TRMDEVFL                                                 02949000
TRMTBLK  EQU   TRMDEVFL                                                 02950000
TRMSBLK  EQU   TRMDEVFL                                                 02951000
TRMBLKS  EQU   TRMDEVFL                                                 02952000
TRMADDC  EQU   TRMDEVFL                                                 02953000
TRMDDIG  EQU   TRMDEVFL                                                 02954000
TRMBUFS  EQU   TRMDEVFL                                                 02955000
TRMPRILK EQU   TRMALTD                                                  02956000
TRMLGB   EQU   TRMDSORG                                                 02957000
TRMUTERM EQU   TLISTCNT                                                 02958000
TRMDESTQ EQU   IEDQTRM+1                                                02959000
TRMSCNYN EQU   TRMSTATE                                                 02960000
TRMOPTFN EQU   TRMSTATE                                                 02961000
TRMHELDN EQU   TRMSTATE                                                 02962000
TRMACPTN EQU   TRMSTATE                                                 02963000
TRMPREF  EQU   TRMSTATE                                                 02964000
TRMPROC  EQU   TRMLOG                                                   02965000
TRMLIST  EQU   TRMLOG                                                   02966000
TRMLINE  EQU   TRMSTATE                                                 02967000
TRMSUBST EQU   IEDNTRM+12                                               02968000
TRMTYPE  EQU   IEDNTRM+11                                               02969000
TRMRLMCT EQU   IEDNTRM+10                                               02970000
TRMCOHTG EQU   TRMSIBPT+1                                               02971000
TRMGPCNT EQU   TRMSIBPT                                                 02972000
TRMBUFRD EQU   TRMBYTE0                                                 02973000
TRMSNA   EQU   TRMBYTE0                                                 02974000
TRMGP    EQU   TRMBYTE0                                                 02975000
TRMDIAL  EQU   TRMBYTE0                                                 02976000
@NM00189 EQU   TRMBYTE0                                                 02977000
TRMOUTPT EQU   TRMBYTE0                                                 02978000
TRMINPUT EQU   TRMBYTE0                                                 02979000
TRMUDEF  EQU   TRMBYTE0                                                 02980000
TRMCOHRT EQU   IEDNTRM+4                                                02981000
TRMSTOTE EQU   TRMBYTE1                                                 02982000
TRMCKPRN EQU   TRMBYTE1                                                 02983000
TRMTSATN EQU   TRMBYTE1                                                 02984000
TRMTRACE EQU   TRMBYTE1                                                 02985000
TRMSWBCK EQU   TRMBYTE1                                                 02986000
TRMAUTOC EQU   TRMBYTE1                                                 02987000
TRMINPTP EQU   TRMBYTE1                                                 02988000
TRMWTNEG EQU   TRMSCPRQ                                                 02989000
TRMWRBRK EQU   TRMBYTE2                                                 02990000
TRMNOSND EQU   TRMBYTE2                                                 02991000
TRMPREP  EQU   TRMBYTE2                                                 02992000
TRMGPACT EQU   TRMBYTE2                                                 02993000
TRMANDL  EQU   TRMBYTE2                                                 02994000
TRMCLOSN EQU   TRMINPG                                                  02995000
TRMREMB  EQU   TRMBYTE2                                                 02996000
TRMRSACT EQU   TRMBYTE2                                                 02997000
RQEHDR   EQU   IEDRQE+16                                                02998000
RQETCBAD EQU   IEDRQE+13                                                02999000
RQEKEY   EQU   IEDRQE+12                                                03000000
RQEDEB   EQU   IEDRQE+9                                                 03001000
RQEPR    EQU   IEDRQE+8                                                 03002000
RQETCB   EQU   IEDRQE+4                                                 03003000
RQELNK   EQU   IEDRQE                                                   03004000
@NM00188 EQU   TRHBYTE2                                                 03005000
@NM00187 EQU   TRHBYTE2                                                 03006000
@NM00186 EQU   TRHBYTE2                                                 03007000
TRHCSI   EQU   TRHBYTE2                                                 03008000
@NM00185 EQU   TRHBYTE2                                                 03009000
TRHCDI   EQU   TRHBYTE2                                                 03010000
TRHEB    EQU   TRHBYTE2                                                 03011000
TRHBB    EQU   TRHBYTE2                                                 03012000
TRHPI    EQU   TRHBYTE1                                                 03013000
@NM00184 EQU   TRHBYTE1                                                 03014000
@NM00183 EQU   TRHBYTE1                                                 03015000
@NM00182 EQU   TRHBYTE1                                                 03016000
TRHER    EQU   TRHBYTE1                                                 03017000
TRHDR2   EQU   TRHBYTE1                                                 03018000
@NM00181 EQU   TRHBYTE1                                                 03019000
TRHDR1   EQU   TRHBYTE1                                                 03020000
TRHSDI   EQU   TRHBYTE0                                                 03021000
@NM00180 EQU   TRHBYTE0                                                 03022000
TRHRUCAT EQU   TRHBYTE0                                                 03023000
TRHTYPE  EQU   TRHBYTE0                                                 03024000
TNTTRMAD EQU   IEDTNTA                                                  03025000
TNTLEN   EQU   IEDQTNTD+44                                              03026000
TNTMIDEN EQU   IEDQTNTD+41                                              03027000
TNTENLEN EQU   IEDQTNTD+40                                              03028000
TNTSRCHX EQU   IEDQTNTD+38                                              03029000
TCXEND   EQU   IEDQTCXD+224                                             03030000
TCXNCPIO EQU   IEDQTCXD+220                                             03031000
TCXACTE8 EQU   TCXQE8                                                   03032000
TCXABEPL EQU   IEDQTCXD+212                                             03033000
TCXSRBS  EQU   IEDQTCXD+208                                             03034000
TCXSIOSB EQU   IEDQTCXD+204                                             03035000
TCXESAVE EQU   IEDQTCXD+132                                             03036000
TCXERPPM EQU   IEDQTCXD+128                                             03037000
TCXERPSV EQU   IEDQTCXD+116                                             03038000
TCXSATTN EQU   IEDQTCXD+112                                             03039000
@NM00179 EQU   TCXDSAVE+4                                               03040000
@NM00178 EQU   TCXDSAVE                                                 03041000
TCXPLCB  EQU   IEDQTCXD+100                                             03042000
TCXBITS  EQU   IEDQTCXD+98                                              03043000
TCXSCBSZ EQU   IEDQTCXD+97                                              03044000
TCXBIT1  EQU   IEDQTCXD+96                                              03045000
TCXCOMPT EQU   IEDQTCXD+92                                              03046000
TCXAVAIL EQU   IEDQTCXD+88                                              03047000
TCXBUFL  EQU   IEDQTCXD+84                                              03048000
TCXTOTE  EQU   TCXBUFA                                                  03049000
TCXCKPM  EQU   IEDQTCXD+79                                              03050000
TCXNCKPR EQU   IEDQTCXD+78                                              03051000
TCXSZAIB EQU   IEDQTCXD+76                                              03052000
TCXAIBC  EQU   IEDQTCXD+72                                              03053000
TCXPEBC  EQU   IEDQTCXD+68                                              03054000
TCXPEWAC EQU   IEDQTCXD+64                                              03055000
TCXQRQ   EQU   IEDQTCXD+60                                              03056000
TCXOCQ   EQU   IEDQTCXD+56                                              03057000
TCXPNTQ  EQU   IEDQTCXD+52                                              03058000
TCXPUTQ  EQU   IEDQTCXD+48                                              03059000
TCXGETQ  EQU   IEDQTCXD+44                                              03060000
TCXTSI   EQU   IEDQTCXD+40                                              03061000
TCXRPT   EQU   IEDQTCXD+36                                              03062000
TCXCC3TS EQU   IEDQTCXD+35                                              03063000
TCXAPDMP EQU   TCXFLAG1                                                 03064000
TCXAPPL  EQU   TCXFLAG1                                                 03065000
TCXRTM   EQU   TCXFLAG1                                                 03066000
TCXMCPCD EQU   TCXFLAG1                                                 03067000
TCXAUTH  EQU   TCXFLAG1                                                 03068000
TCXASID  EQU   IEDQTCXD+32                                              03069000
TCXASCB  EQU   IEDQTCXD+28                                              03070000
TCXPASWD EQU   IEDQTCXD+16                                              03071000
TCXDISP  EQU   IEDQTCXD+12                                              03072000
TCXTCB   EQU   IEDQTCXD+8                                               03073000
TCXATTLN EQU   TCXATTEN                                                 03074000
PRF2SEQP EQU   PRF2WD2                                                  03075000
@NM00177 EQU   IEDPF2+1                                                 03076000
@NM00176 EQU   PRF2FLG2                                                 03077000
PRF2TERM EQU   PRF2FLG2                                                 03078000
PRF2SMI  EQU   PRF2FLG2                                                 03079000
PRF2FORM EQU   PRF2FLG2                                                 03080000
PRF2TNTI EQU   PRF2FLG2                                                 03081000
PRF1RULN EQU   PRF1SEQP+2                                               03082000
PRF1TAG2 EQU   PRF1SQID+1                                               03083000
@NM00175 EQU   PRF1TAG1                                                 03084000
PRF1TAGS EQU   PRF1TAG1                                                 03085000
@NM00174 EQU   PRF1FLG1                                                 03086000
PRF1LOGD EQU   PRF1FLG1                                                 03087000
PRF1USS  EQU   PRF1FLG1                                                 03088000
PRF1FORM EQU   PRF1FLG1                                                 03089000
PRF1EXPI EQU   PRF1FLG1                                                 03090000
PRF1FIDI EQU   PRF1FLG1                                                 03091000
PRF1RH   EQU   IEDPF1                                                   03092000
PRFDEST  EQU   IEDQPRF+40                                               03093000
PRFISEQ  EQU   IEDQPRF+38                                               03094000
PRFSTXT  EQU   PRFHQBCK                                                 03095000
PRFNHDR  EQU   PRFCHDR                                                  03096000
PRFCRCD  EQU   IEDQPRF+29                                               03097000
PRFSVSEQ EQU   PRFNTXT+1                                                03098000
PRFSVPRI EQU   PRFEOBOF                                                 03099000
PRFISIZE EQU   PRFSCAN+1                                                03100000
@NM00173 EQU   PRFSCAN                                                  03101000
PRFEOB   EQU   PRFXTRA+1                                                03102000
PRFSTSO  EQU   PRFXTRA                                                  03103000
PRFNHDRN EQU   PRFSTAT1                                                 03104000
PRFNLSTN EQU   PRFSTAT1                                                 03105000
PRFLOCK  EQU   PRFEOFN                                                  03106000
PRFDUPLN EQU   PRFSTAT1                                                 03107000
PRFTSMSG EQU   PRFSTAT1                                                 03108000
PRFITCPN EQU   PRFSTAT1                                                 03109000
PRFERMGN EQU   PRFSTAT1                                                 03110000
PRFCNCLN EQU   PRFSTAT1                                                 03111000
PRFSVFLG EQU   @NM00172+3                                               03112000
PRFSIZE  EQU   PRFSVFFO+2                                               03113000
PRFSRCE  EQU   PRFSVFFO                                                 03114000
PRFLCB   EQU   IEDQPRF+13                                               03115000
@NM00171 EQU   PRFTICC                                                  03116000
@NM00170 EQU   PRFTICC                                                  03117000
@NM00169 EQU   PRFTICC                                                  03118000
PRFTICON EQU   PRFTICC                                                  03119000
@NM00168 EQU   PRFTICC                                                  03120000
@NM00167 EQU   PRFTICC                                                  03121000
PRFBFMM  EQU   PRFTICC                                                  03122000
PRFEOMSG EQU   PRFTICC                                                  03123000
PRFCOUNT EQU   PRFLINK+1                                                03124000
@NM00166 EQU   PRFLINK                                                  03125000
PRFFLAGS EQU   PRFPRI                                                   03126000
PRFIOADR EQU   PRFQCBA                                                  03127000
PRFOPCDE EQU   PRFKEY                                                   03128000
LCBERADR EQU   LCBXRADR+1                                               03129000
LCBPCIRC EQU   LCBXRADR                                                 03130000
LCBDCT3  EQU   LCBXDCT+2                                                03131000
LCBDCT2  EQU   LCBXDCT+1                                                03132000
LCBDCT1  EQU   LCBXDCT                                                  03133000
@NM00165 EQU   LCBXFLAG                                                 03134000
LCBERPND EQU   LCBXFLAG                                                 03135000
LCBSRCPF EQU   LCBXFLAG                                                 03136000
LCBGPCTV EQU   LCBXFLAG                                                 03137000
@NM00164 EQU   LCBXFLAG                                                 03138000
@NM00163 EQU   LCBXFLAG                                                 03139000
@NM00162 EQU   LCBXFLAG                                                 03140000
@NM00161 EQU   LCBXFLAG                                                 03141000
LCBCCW10 EQU   LCBCPA+72                                                03142000
LCBCCW9  EQU   LCBCPA+64                                                03143000
LCBCCW8  EQU   LCBCPA+56                                                03144000
LCBCP    EQU   LCBQEBPL+4                                               03145000
LCBSIO   EQU   LCBQEBPL                                                 03146000
@NM00146 EQU   LCBERCCW+16                                              03147000
LCBATL05 EQU   LCBERCCW+8                                               03148000
@NM00145 EQU   LCBERCCW                                                 03149000
LCBCSWSV EQU   LCBSAVSN+1                                               03150000
LCBSNSV  EQU   LCBSAVSN                                                 03151000
LCBBFSNS EQU   LCBRSPSV                                                 03152000
LCBWAITC EQU   LCBTPCD+5                                                03153000
LCBINPAK EQU   LCBSTAT6                                                 03154000
LCBMHBID EQU   LCBSTAT6                                                 03155000
LCBRTRRO EQU   LCBSTAT6                                                 03156000
LCBHDRPD EQU   LCBSTAT6                                                 03157000
LCBCHN   EQU   LCBSTAT6                                                 03158000
LCBBFRSV EQU   LCBTPCD+1                                                03159000
@NM00144 EQU   LCBSTAT5                                                 03160000
LCBLUS   EQU   LCBSTAT5                                                 03161000
LCBLUNIT EQU   LCBSTAT5                                                 03162000
LCBPERM  EQU   LCBSTAT5                                                 03163000
LCBNXCMD EQU   LCBBFRW                                                  03164000
LCBERMSK EQU   LCBOBRCH                                                 03165000
LCBSCBA  EQU   IEDQLCB+93                                               03166000
LCBOLT   EQU   LCBMSGFM                                                 03167000
LCBEOT   EQU   LCBMSGFM                                                 03168000
LCBENQ   EQU   LCBMSGFM                                                 03169000
LCBTTD   EQU   LCBMSGFM                                                 03170000
LCBRSTRT EQU   LCBMSGFM                                                 03171000
LCBVSTRT EQU   LCBMSGFM                                                 03172000
LCBACKI  EQU   LCBMSGFM                                                 03173000
LCBNAK   EQU   LCBMSGFM                                                 03174000
@NM00143 EQU   LCBRBCT2                                                 03175000
LCBDCNT  EQU   LCBRBCT2                                                 03176000
LCBRBCT1 EQU   LCBERBCT                                                 03177000
LCBERBCH EQU   IEDQLCB+85                                               03178000
LCBCOMPL EQU   LCBDLNKN                                                 03179000
LCBPRCPG EQU   LCBERBST                                                 03180000
LCBERROR EQU   LCBERBST                                                 03181000
LCBLOGDV EQU   LCBERBST                                                 03182000
LCBINQ   EQU   LCBERBST                                                 03183000
LCBRDERR EQU   LCBERBST                                                 03184000
LCBEOMSG EQU   LCBERBST                                                 03185000
LCBMSG   EQU   LCBERBST                                                 03186000
LCBERBLK EQU   IEDQLCB+81                                               03187000
LCBERBPY EQU   IEDQLCB+80                                               03188000
LCBERBQB EQU   LCBERB+1                                                 03189000
LCBERBKY EQU   LCBERB                                                   03190000
LCBRECAD EQU   IEDQLCB+73                                               03191000
@NM00142 EQU   LCBTSTSW                                                 03192000
@NM00141 EQU   LCBTSTSW                                                 03193000
@NM00140 EQU   LCBTSTSW                                                 03194000
@NM00139 EQU   LCBTSTSW                                                 03195000
@NM00138 EQU   LCBTSTSW                                                 03196000
@NM00137 EQU   LCBTSTSW                                                 03197000
@NM00136 EQU   LCBTSTSW                                                 03198000
LCBCONCT EQU   LCBTSTSW                                                 03199000
LCBRESP  EQU   LCBSTAT2                                                 03200000
LCBNEGRP EQU   LCBSTAT2                                                 03201000
LCBSNDPR EQU   LCBSTAT2                                                 03202000
LCBCONNN EQU   LCBBEOTN                                                 03203000
LCBMSGNN EQU   LCBSTAT2                                                 03204000
LCBTRACE EQU   LCBSTAT2                                                 03205000
LCBFREEN EQU   LCBSTAT1                                                 03206000
LCBCONT  EQU   LCBSTAT1                                                 03207000
LCBINITN EQU   LCBSTAT1                                                 03208000
LCBOCNI  EQU   LCBSTAT1                                                 03209000
LCBOCWTN EQU   LCBSTAT1                                                 03210000
LCBRCLLN EQU   LCBSTAT1                                                 03211000
LCBRECOF EQU   IEDQLCB+68                                               03212000
LCBUCBX  EQU   IEDQLCB+64                                               03213000
LCBTTBIN EQU   LCBERRCT                                                 03214000
@NM00135 EQU   LCBINCAM                                                 03215000
LCBGETMN EQU   LCBINCAM                                                 03216000
@NM00134 EQU   LCBRESTR+1                                               03217000
LCBCMDSV EQU   LCBRESTR                                                 03218000
LCBPCILK EQU   LCBDCBPT                                                 03219000
LCBAP4OL EQU   LCBSIOCC                                                 03220000
LCBAP3OL EQU   LCBSIOCC                                                 03221000
LCBAP2OL EQU   LCBSIOCC                                                 03222000
LCBAP1OL EQU   LCBSIOCC                                                 03223000
@NM00133 EQU   LCBSIOCC                                                 03224000
LCBUSDE  EQU   LCBCSWUS                                                 03225000
LCBUSCE  EQU   LCBCSWUS                                                 03226000
LCBUSBSY EQU   LCBCSWUS                                                 03227000
LCBUSCUE EQU   LCBCSWUS                                                 03228000
LCBUSSM  EQU   LCBCSWUS                                                 03229000
LCBOBR   EQU   LCBFLAG3                                                 03230000
LCBOBRRD EQU   LCBFLAG3                                                 03231000
LCBIOMSG EQU   LCBFLAG3                                                 03232000
LCBSOHC  EQU   LCBFLAG3                                                 03233000
@NM00132 EQU   LCBFLAG3                                                 03234000
LCBSENS1 EQU   LCBSNS+1                                                 03235000
LCBOVRUN EQU   LCBSENS0                                                 03236000
LCBDATCK EQU   LCBSENS0                                                 03237000
LCBEQUCK EQU   LCBSENS0                                                 03238000
LCBBUSCK EQU   LCBSENS0                                                 03239000
LCBINTRQ EQU   LCBSENS0                                                 03240000
LCBCMDRJ EQU   LCBSENS0                                                 03241000
@NM00131 EQU   LCBFLAG1                                                 03242000
LCBUNREL EQU   LCBFLAG1                                                 03243000
LCBEXCPN EQU   LCBFLAG1                                                 03244000
@NM00130 EQU   LCBFLAG1                                                 03245000
LCBERPIN EQU   LCBFLAG1                                                 03246000
@NM00129 EQU   LCBFLAG1                                                 03247000
LCBISZE  EQU   IEDQLCB+28                                               03248000
LCBLNENT EQU   LCBSCBDA+1                                               03249000
@NM00128 EQU   LCBSCBDA                                                 03250000
LCBCPGMH EQU   LCBSTAT4                                                 03251000
@NM00127 EQU   LCBSTAT4                                                 03252000
LCBACTRQ EQU   LCBSTAT4                                                 03253000
LCBIPLRQ EQU   LCBSTAT4                                                 03254000
LCBDACRQ EQU   LCBSTAT4                                                 03255000
LCBDMPRQ EQU   LCBSTAT4                                                 03256000
@NM00126 EQU   LCBLKMDE                                                 03257000
LCBLOCKI EQU   LCBLKMDE                                                 03258000
LCBLOCKR EQU   LCBLKMDE                                                 03259000
LCBHMFLG EQU   LCBLKMDE                                                 03260000
LCBBDFLG EQU   LCBLKMDE                                                 03261000
@NM00125 EQU   LCBINSRC                                                 03262000
LCBABRTN EQU   LCBCHAIN                                                 03263000
LCBCTLMD EQU   LCBTETEN                                                 03264000
LCBBFRSZ EQU   LCBCHAIN                                                 03265000
LCBUREQN EQU   LCBCHAIN                                                 03266000
LCBNORTY EQU   LCBCHAIN                                                 03267000
LCBERMSG EQU   LCBCHAIN                                                 03268000
LCBEXCP  EQU   LCBCHAIN                                                 03269000
LCBINVRQ EQU   LCBSCRNN                                                 03270000
LCB2741N EQU   LCBTSOB                                                  03271000
LCBINHBN EQU   LCBTSOB                                                  03272000
LCBCIRCD EQU   LCBTSOB                                                  03273000
LCBPREP  EQU   LCBTSOB                                                  03274000
LCBSOPL  EQU   LCBTSOB                                                  03275000
LCBSATRD EQU   LCBTSOB                                                  03276000
LCBTSBUF EQU   LCBTSOB                                                  03277000
LCBWRBRK EQU   LCBTSOB                                                  03278000
LCBTDL   EQU   IEDQLCB+18                                               03279000
LCBEOLTD EQU   IEDQLCB+16                                               03280000
LCBRSLNK EQU   IEDQLCB+13                                               03281000
LCBRSPRI EQU   IEDQLCB+12                                               03282000
LCBSTCBA EQU   IEDQLCB+9                                                03283000
LCBRSKEY EQU   IEDQLCB+8                                                03284000
LCBLINK  EQU   LCBRCB+5                                                 03285000
LCBKEY   EQU   LCBRCB                                                   03286000
IOSEND   EQU   IOSB+108                                                 03287000
IOSSKR   EQU   IOSEEKA+7                                                03288000
IOSSKH2  EQU   IOSSKHH+1                                                03289000
IOSSKH1  EQU   IOSSKHH                                                  03290000
IOSSKCC  EQU   IOSCCHH                                                  03291000
IOSSKBB  EQU   IOSEEKA+1                                                03292000
IOSSKM   EQU   IOSEEKA                                                  03293000
IOSEEK   EQU   IOSB+92                                                  03294000
IOSMDM   EQU   IOSB+91                                                  03295000
IOSMDB   EQU   IOSB+90                                                  03296000
IOSCKEY7 EQU   IOSCKEY                                                  03297000
IOSCKEY6 EQU   IOSCKEY                                                  03298000
IOSCKEY5 EQU   IOSCKEY                                                  03299000
IOSCKEY4 EQU   IOSCKEY                                                  03300000
@NM00121 EQU   IOSCKEY                                                  03301000
IOSFMSK  EQU   IOSB+88                                                  03302000
IOSCUDEV EQU   IOSPATH+1                                                03303000
@NM00120 EQU   IOSCHN                                                   03304000
IOSPATH3 EQU   IOSCHN                                                   03305000
IOSPATH2 EQU   IOSCHN                                                   03306000
IOSEXP   EQU   IOSCHN                                                   03307000
IOSGDP   EQU   IOSCHN                                                   03308000
IOSAFF   EQU   IOSB+85                                                  03309000
IOSRSS1B EQU   IOSB+84                                                  03310000
IOSDSID  EQU   IOSB+80                                                  03311000
IOSVST   EQU   IOSB+76                                                  03312000
IOSRST   EQU   IOSB+72                                                  03313000
IOSDIE   EQU   IOSB+68                                                  03314000
IOSABN   EQU   IOSB+64                                                  03315000
IOSNRM   EQU   IOSB+60                                                  03316000
IOSPCI   EQU   IOSB+56                                                  03317000
IOSERP   EQU   IOSB+52                                                  03318000
IOSPCHN  EQU   IOSB+48                                                  03319000
IOSAPMSK EQU   IOSB+40                                                  03320000
IOSRES4A EQU   IOSB+36                                                  03321000
IOSSRB   EQU   IOSB+28                                                  03322000
IOSCSWRC EQU   IOSCSW+5                                                 03323000
IOSTSB   EQU   IOSTATUS+1                                               03324000
IOSTSA   EQU   IOSTATUS                                                 03325000
IOSOPT2X EQU   IOSOPT2                                                  03326000
IOSIGP   EQU   IOSOPT2                                                  03327000
IOSHTP   EQU   IOSOPT2                                                  03328000
IOSRELSE EQU   IOSOPT                                                   03329000
IOSAPR   EQU   IOSOPT                                                   03330000
IOSNERP  EQU   IOSOPT                                                   03331000
IOSPSLL  EQU   IOSOPT                                                   03332000
IOSQISCE EQU   IOSOPT                                                   03333000
IOSDEP   EQU   IOSOPT                                                   03334000
IOSBYP   EQU   IOSOPT                                                   03335000
IOSPKY7  EQU   IOSPKEY                                                  03336000
IOSPGDPX EQU   IOSPKEY                                                  03337000
IOSIDR   EQU   IOSPKEY                                                  03338000
IOSLCL   EQU   IOSPKEY                                                  03339000
@NM00118 EQU   IOSPKEY                                                  03340000
IOSPGAD  EQU   IOSB+8                                                   03341000
IOSASID  EQU   IOSB+6                                                   03342000
IOSPRLVL EQU   IOSB+5                                                   03343000
IOSDVRID EQU   IOSB+4                                                   03344000
IOSPROC  EQU   IOSB+3                                                   03345000
IOSFLC7  EQU   IOSFLC                                                   03346000
IOSCTCNR EQU   IOSFLC                                                   03347000
IOSRWAIT EQU   IOSFLC                                                   03348000
IOSTP    EQU   IOSFLC                                                   03349000
IOSCC3WE EQU   IOSFLC                                                   03350000
IOSVERIF EQU   IOSDVALT                                                 03351000
IOSDVMNT EQU   IOSFLC                                                   03352000
IOSLOG   EQU   IOSFLB                                                   03353000
IOSBDCST EQU   IOSFLB                                                   03354000
IOSMSG   EQU   IOSFLB                                                   03355000
IOSFLB4  EQU   IOSFLB                                                   03356000
IOSFLB3  EQU   IOSFLB                                                   03357000
IOSNOTRS EQU   IOSFLB                                                   03358000
IOSSDR   EQU   IOSFLB                                                   03359000
IOSDIESE EQU   IOSFLB                                                   03360000
IOSIOSB  EQU   IOSFLA                                                   03361000
IOSDOM   EQU   IOSFLA                                                   03362000
IOSSMDB  EQU   IOSFLA                                                   03363000
IOSSMDA  EQU   IOSFLA                                                   03364000
IOSERR   EQU   IOSFLA                                                   03365000
IOSCCHN  EQU   IOSACHN                                                  03366000
IOSDCHN  EQU   IOSACHN                                                  03367000
DCBBUFSI EQU   IHADCS43+6                                               03368000
DCBUNTCT EQU   IHADCS43+5                                               03369000
DCBILCT  EQU   IHADCS43+4                                               03370000
DCBSCTAD EQU   DCBSCTAB+1                                               03371000
@NM00117 EQU   DCBSCTAB                                                 03372000
DCBPUTA  EQU   DCBGETA                                                  03373000
@NM00116 EQU   DCBPUT                                                   03374000
DCBDEBA  EQU   DCBDEBAD+1                                               03375000
@NM00115 EQU   DCBIFLGS                                                 03376000
DCBIFIOE EQU   DCBIFLGS                                                 03377000
DCBCH12  EQU   DCBIFPCT                                                 03378000
DCBCH9   EQU   DCBIFPCT                                                 03379000
DCBIFEC  EQU   DCBIFLGS                                                 03380000
DCBMFSTI EQU   DCBMFDMD                                                 03381000
DCBMFAWR EQU   DCBMFSTK                                                 03382000
DCBMFUIP EQU   DCBMFTMD                                                 03383000
DCBMFIDW EQU   DCBMFLCP                                                 03384000
DCBMFWRK EQU   DCBMFMVP                                                 03385000
DCBMFRDQ EQU   DCBMFWRT                                                 03386000
DCBMFGTQ EQU   DCBMFPUT                                                 03387000
DCBMFSTL EQU   DCBMACF2                                                 03388000
DCBMFCK  EQU   DCBMFDMG                                                 03389000
DCBMFRDX EQU   DCBMFCHK                                                 03390000
DCBMFDBF EQU   DCBMFSBG                                                 03391000
DCBMFRDI EQU   DCBMFLCG                                                 03392000
DCBMFRDK EQU   DCBMFMVG                                                 03393000
DCBMFWRQ EQU   DCBMFRD                                                  03394000
DCBMFPTQ EQU   DCBMFGET                                                 03395000
DCBMFECP EQU   DCBMACF1                                                 03396000
DCBTIOT  EQU   IHADCS25                                                 03397000
DCBMRSTI EQU   DCBMRDMD                                                 03398000
DCBMRAWR EQU   DCBMRSTK                                                 03399000
DCBMRUIP EQU   DCBMRTMD                                                 03400000
DCBMRIDW EQU   DCBMRLCP                                                 03401000
DCBMRWRK EQU   DCBMRMVP                                                 03402000
DCBMRRDQ EQU   DCBMRWRT                                                 03403000
DCBMRGTQ EQU   DCBMRPUT                                                 03404000
DCBMRSTL EQU   DCBMACR2                                                 03405000
DCBMRCK  EQU   DCBMRDMG                                                 03406000
DCBPGFXA EQU   DCBMRRDX                                                 03407000
DCBMRDBF EQU   DCBMRSBG                                                 03408000
DCBMRRDI EQU   DCBMRLCG                                                 03409000
DCBMRRDK EQU   DCBMRMVG                                                 03410000
DCBMRWRQ EQU   DCBMRRD                                                  03411000
DCBMRPTQ EQU   DCBMRGET                                                 03412000
DCBMRECP EQU   DCBMACR1                                                 03413000
@NM00114 EQU   DCBIFLG                                                  03414000
DCBIBIOE EQU   DCBIFLG                                                  03415000
DCBICH12 EQU   DCBIBPCT                                                 03416000
DCBICH9  EQU   DCBIBPCT                                                 03417000
DCBIBEC  EQU   DCBIFLG                                                  03418000
DCBOFIOF EQU   DCBOFLGS                                                 03419000
DCBOFUEX EQU   DCBOFLGS                                                 03420000
DCBOFTM  EQU   DCBOFLGS                                                 03421000
DCBOFPPC EQU   DCBOFLGS                                                 03422000
DCBOFOPN EQU   DCBOFLGS                                                 03423000
DCBOFEOV EQU   DCBOFLGS                                                 03424000
DCBOFLRB EQU   DCBOFLGS                                                 03425000
DCBOFIOD EQU   DCBOFLWR                                                 03426000
DCBDDNAM EQU   IHADCS24                                                 03427000
DCBEXLSA EQU   DCBEXLST+1                                               03428000
DCBRNCKA EQU   DCBRNCKD+1                                               03429000
@NM00113 EQU   DCBRNCKD                                                 03430000
DCBIOBAD EQU   IHADCS2K+8                                               03431000
DCBDSGTR EQU   DCBDSRG2                                                 03432000
@NM00112 EQU   DCBDSRG2                                                 03433000
DCBDSRG1 EQU   DCBDSORG                                                 03434000
DCBCHNGL EQU   DCBTRSTA                                                 03435000
DCBNIDLE EQU   DCBTRSTA                                                 03436000
DCBBAKUP EQU   DCBTRSTA                                                 03437000
DCBIPLED EQU   DCBTRSTA                                                 03438000
DCBRSTRT EQU   DCBTRSTA                                                 03439000
DCBINITL EQU   DCBTRSTA                                                 03440000
DCBAUTOD EQU   DCBTRSTA                                                 03441000
DCBAUTOI EQU   DCBTRSTA                                                 03442000
@NM00111 EQU   IHADCS2K+4                                               03443000
DCBDUMPA EQU   DCBDUMPD+1                                               03444000
DCBUNITN EQU   DCBDUMPD                                                 03445000
DCBBCKUA EQU   DCBBCKUP+1                                               03446000
@NM00110 EQU   DCBBCKUP                                                 03447000
DCBIPLTX EQU   IHADCS1A                                                 03448000
@NM00109 EQU   IHADCB                                                   03449000
CVTLEVL  EQU   CVTRELNO+2                                               03450000
CVTNUMB  EQU   CVTRELNO                                                 03451000
CVTMDL   EQU   CVTFIX+250                                               03452000
@NM00108 EQU   CVTFIX+248                                               03453000
@NM00107 EQU   CVTFIX                                                   03454000
CVTRV482 EQU   CVTXTNT2+128                                             03455000
CVTRV481 EQU   CVTXTNT2+124                                             03456000
CVTRV480 EQU   CVTXTNT2+120                                             03457000
CVTRV479 EQU   CVTXTNT2+118                                             03458000
CVTRV478 EQU   CVTXTNT2+117                                             03459000
CVTRV477 EQU   CVTXTNT2+116                                             03460000
CVTRV476 EQU   CVTXTNT2+115                                             03461000
CVTRV475 EQU   CVTXTNT2+114                                             03462000
CVTRV474 EQU   CVTRV466                                                 03463000
CVTRV473 EQU   CVTRV466                                                 03464000
CVTRV472 EQU   CVTRV466                                                 03465000
CVTRV471 EQU   CVTRV466                                                 03466000
CVTRV470 EQU   CVTRV466                                                 03467000
CVTRV469 EQU   CVTRV466                                                 03468000
CVTRV468 EQU   CVTRV466                                                 03469000
CVTRV467 EQU   CVTRV466                                                 03470000
CVTRV465 EQU   CVTRV457                                                 03471000
CVTRV464 EQU   CVTRV457                                                 03472000
CVTRV463 EQU   CVTRV457                                                 03473000
CVTRV462 EQU   CVTRV457                                                 03474000
CVTRV461 EQU   CVTRV457                                                 03475000
CVTRV460 EQU   CVTRV457                                                 03476000
CVTRV459 EQU   CVTRV457                                                 03477000
CVTRV458 EQU   CVTRV457                                                 03478000
CVTRV456 EQU   CVTXTNT2+108                                             03479000
CVTRV455 EQU   CVTXTNT2+104                                             03480000
CVTRV454 EQU   CVTXTNT2+100                                             03481000
CVTRV453 EQU   CVTXTNT2+96                                              03482000
CVTRV452 EQU   CVTXTNT2+94                                              03483000
CVTRV451 EQU   CVTXTNT2+92                                              03484000
CVTRV450 EQU   CVTXTNT2+90                                              03485000
CVTRV449 EQU   CVTXTNT2+88                                              03486000
CVTRV448 EQU   CVTXTNT2+87                                              03487000
CVTRV447 EQU   CVTXTNT2+86                                              03488000
CVTRV446 EQU   CVTRV438                                                 03489000
CVTRV445 EQU   CVTRV438                                                 03490000
CVTRV444 EQU   CVTRV438                                                 03491000
CVTRV443 EQU   CVTRV438                                                 03492000
CVTRV442 EQU   CVTRV438                                                 03493000
CVTRV441 EQU   CVTRV438                                                 03494000
CVTRV440 EQU   CVTRV438                                                 03495000
CVTRV439 EQU   CVTRV438                                                 03496000
CVTRV437 EQU   CVTRV429                                                 03497000
CVTRV436 EQU   CVTRV429                                                 03498000
CVTRV435 EQU   CVTRV429                                                 03499000
CVTRV434 EQU   CVTRV429                                                 03500000
CVTRV433 EQU   CVTRV429                                                 03501000
CVTRV432 EQU   CVTRV429                                                 03502000
CVTRV431 EQU   CVTRV429                                                 03503000
CVTRV430 EQU   CVTRV429                                                 03504000
CVTRV428 EQU   CVTXTNT2+80                                              03505000
CVTRV427 EQU   CVTXTNT2+76                                              03506000
CVTRV426 EQU   CVTXTNT2+72                                              03507000
CVTRV425 EQU   CVTXTNT2+68                                              03508000
CVTATACT EQU   CVTATCVT                                                 03509000
CVTRV423 EQU   CVTXTNT2+62                                              03510000
CVTRV422 EQU   CVTXTNT2+60                                              03511000
CVTRV421 EQU   CVTXTNT2+58                                              03512000
CVTRV420 EQU   CVTXTNT2+56                                              03513000
CVTRV419 EQU   CVTXTNT2+55                                              03514000
CVTRV418 EQU   CVTXTNT2+54                                              03515000
CVTRV417 EQU   CVTRV409                                                 03516000
CVTRV416 EQU   CVTRV409                                                 03517000
CVTRV415 EQU   CVTRV409                                                 03518000
CVTRV414 EQU   CVTRV409                                                 03519000
CVTRV413 EQU   CVTRV409                                                 03520000
CVTRV412 EQU   CVTRV409                                                 03521000
CVTRV411 EQU   CVTRV409                                                 03522000
CVTRV410 EQU   CVTRV409                                                 03523000
CVTRV408 EQU   CVTRV400                                                 03524000
CVTRV407 EQU   CVTRV400                                                 03525000
CVTRV406 EQU   CVTRV400                                                 03526000
CVTRV405 EQU   CVTRV400                                                 03527000
CVTRV404 EQU   CVTRV400                                                 03528000
CVTRV403 EQU   CVTRV400                                                 03529000
CVTRV402 EQU   CVTRV400                                                 03530000
CVTRV401 EQU   CVTRV400                                                 03531000
CVTICB   EQU   CVTXTNT2+48                                              03532000
CVTSKTA  EQU   CVTXTNT2+44                                              03533000
CVTCCVT  EQU   CVTXTNT2+40                                              03534000
CVTRSV98 EQU   CVTXTNT2+36                                              03535000
CVTRSV97 EQU   CVTXTNT2+34                                              03536000
CVTRSV96 EQU   CVTXTNT2+32                                              03537000
CVTOLTEP EQU   CVTXTNT2+28                                              03538000
CVTQIDA  EQU   CVTQID+1                                                 03539000
CVTRSV95 EQU   CVTQID                                                   03540000
CVTRSV94 EQU   CVTXTNT2+20                                              03541000
CVTRSV93 EQU   CVTXTNT2+16                                              03542000
CVTRSV92 EQU   CVTXTNT2+12                                              03543000
CVTDEBVR EQU   CVTXTNT2+8                                               03544000
CVTRSV91 EQU   CVTXTNT2+6                                               03545000
CVTRSV9H EQU   CVTFLGBT                                                 03546000
CVTRSV9G EQU   CVTFLGBT                                                 03547000
CVTRSV9F EQU   CVTFLGBT                                                 03548000
CVTRSV9E EQU   CVTFLGBT                                                 03549000
CVTRSV9D EQU   CVTFLGBT                                                 03550000
CVTRSV9C EQU   CVTFLGBT                                                 03551000
CVTVME   EQU   CVTFLGBT                                                 03552000
CVTNPE   EQU   CVTFLGBT                                                 03553000
CVTNUCLS EQU   CVTXTNT2+4                                               03554000
CVTDSSVA EQU   CVTDSSV+1                                                03555000
CVTRSV89 EQU   CVTDSSV                                                  03556000
CVTRSV88 EQU   CVTXTNT1+8                                               03557000
CVTRSV87 EQU   CVTXTNT1+4                                               03558000
CVTFACHN EQU   CVTXTNT1                                                 03559000
CVTRV488 EQU   CVTMAP+412                                               03560000
CVTRV487 EQU   CVTMAP+408                                               03561000
CVTRV486 EQU   CVTMAP+404                                               03562000
CVTRV485 EQU   CVTMAP+400                                               03563000
CVTACTAP EQU   CVTMAP+396                                               03564000
CVTAUTH  EQU   CVTMAP+392                                               03565000
CVTATMCA EQU   CVTATMCT+1                                               03566000
CVTATMST EQU   CVTATMCT                                                 03567000
CVTRSV61 EQU   CVTMAP+384                                               03568000
CVTVOLT1 EQU   CVTVOLM1+1                                               03569000
CVTVOLI1 EQU   CVTVOLF1                                                 03570000
CVTSTOA  EQU   CVTMAP+376                                               03571000
CVTRSV58 EQU   CVTMAP+374                                               03572000
CVTRSV57 EQU   CVTMAP+372                                               03573000
CVTDDCE  EQU   CVTMAP+368                                               03574000
CVTPNWFR EQU   CVTMAP+364                                               03575000
CVTSMF   EQU   CVTMAP+360                                               03576000
CVTSULK  EQU   CVTMAP+358                                               03577000
CVTSLKO  EQU   CVTSYSK                                                  03578000
CVTSLKP  EQU   CVTSYSK                                                  03579000
CVTSLKQ  EQU   CVTSYSK                                                  03580000
CVTSLKR  EQU   CVTSYSK                                                  03581000
CVTRSV56 EQU   CVTSYSK                                                  03582000
CVTRSV55 EQU   CVTSYSK                                                  03583000
CVTRSV54 EQU   CVTSYSK                                                  03584000
CVTRSV53 EQU   CVTSYSK                                                  03585000
CVTRSV52 EQU   CVTA1F1                                                  03586000
CVTRSV51 EQU   CVTA1F1                                                  03587000
CVTRSV50 EQU   CVTA1F1                                                  03588000
CVTRSV49 EQU   CVTA1F1                                                  03589000
CVTRSV48 EQU   CVTA1F1                                                  03590000
CVTRSV47 EQU   CVTA1F1                                                  03591000
CVTSRSW  EQU   CVTA1F1                                                  03592000
CVTPFSW  EQU   CVTA1F1                                                  03593000
CVTPCVT  EQU   CVTMAP+352                                               03594000
CVTRSV46 EQU   CVTMAP+344                                               03595000
CVTRSV45 EQU   CVTMAP+340                                               03596000
CVTRSV44 EQU   CVTMAP+338                                               03597000
CVTRSV43 EQU   CVTMAP+336                                               03598000
CVTHJESA EQU   CVTHJES+1                                                03599000
CVTRSV42 EQU   CVTHJES                                                  03600000
CVTEXT2A EQU   CVTEXT2+1                                                03601000
CVTRSV41 EQU   CVTEXT2                                                  03602000
CVTAPFA  EQU   CVTAPF+1                                                 03603000
CVTRSV40 EQU   CVTAPF                                                   03604000
CVTRV518 EQU   CVTINTLA                                                 03605000
CVTRV517 EQU   CVTERPV                                                  03606000
CVTEORM  EQU   CVTMAP+312                                               03607000
CVTMCHPR EQU   CVTMAP+308                                               03608000
CVTTZ    EQU   CVTMAP+304                                               03609000
CVTJEPS  EQU   CVTMAP+300                                               03610000
CVTJESCT EQU   CVTMAP+296                                               03611000
CVTMODE  EQU   CVTMAP+292                                               03612000
CVTREAL  EQU   CVTMAP+284                                               03613000
CVTRSV39 EQU   CVTMAP+280                                               03614000
CVTRSV38 EQU   CVTMAP+276                                               03615000
CVTDMSRA EQU   CVTDMSR+1                                                03616000
CVTRV634 EQU   CVTDMSRF                                                 03617000
CVTRV633 EQU   CVTDMSRF                                                 03618000
CVTRV632 EQU   CVTDMSRF                                                 03619000
CVTRV631 EQU   CVTDMSRF                                                 03620000
CVTRV630 EQU   CVTDMSRF                                                 03621000
CVTRV629 EQU   CVTDMSRF                                                 03622000
CVTUDUMP EQU   CVTDMSRF                                                 03623000
CVTSDUMP EQU   CVTDMSRF                                                 03624000
CVTQMSGA EQU   CVTQMSG+1                                                03625000
CVTRSV36 EQU   CVTQMSG                                                  03626000
CVTAMFF  EQU   CVTMAP+264                                               03627000
CVTPURGA EQU   CVTPURG+1                                                03628000
CVTRSV35 EQU   CVTPURG                                                  03629000
CVTCBSP  EQU   CVTMAP+256                                               03630000
CVTATERA EQU   CVTATER+1                                                03631000
CVTSYST  EQU   CVTATER                                                  03632000
CVTVOLT2 EQU   CVTTAT                                                   03633000
CVTVOLI2 EQU   CVTVOLF2                                                 03634000
CVTAQAVB EQU   CVTAQAVT+1                                               03635000
CVTRSV34 EQU   CVTTCMFG                                                 03636000
CVTRSV33 EQU   CVTTCMFG                                                 03637000
CVTRSV32 EQU   CVTTCMFG                                                 03638000
CVTRSV31 EQU   CVTTCMFG                                                 03639000
CVTRSV30 EQU   CVTTCMFG                                                 03640000
CVTRSV29 EQU   CVTTCMFG                                                 03641000
CVTRSV28 EQU   CVTTCMFG                                                 03642000
CVTTCRDY EQU   CVTTCMFG                                                 03643000
CVTGTFA  EQU   CVTGTF+1                                                 03644000
CVTRSV27 EQU   CVTGTFST                                                 03645000
CVTRNIO  EQU   CVTGTFST                                                 03646000
CVTUSR   EQU   CVTGTFST                                                 03647000
CVTRV318 EQU   CVTFORM                                                  03648000
CVTRV317 EQU   CVTTMODE                                                 03649000
CVTRV316 EQU   CVTSTATE                                                 03650000
CVTRV315 EQU   CVTGTFS                                                  03651000
CVTGTFAV EQU   CVTGTFS                                                  03652000
CVT0SCR1 EQU   CVTMAP+232                                               03653000
CVTRV515 EQU   CVTMAP+228                                               03654000
CVTRMS   EQU   CVTMAP+224                                               03655000
CVTPATCH EQU   CVTMAP+220                                               03656000
CVTTSCE  EQU   CVTMAP+216                                               03657000
CVTLNKSC EQU   CVTMAP+214                                               03658000
CVTQABST EQU   CVTMAP+212                                               03659000
CVTMDLDS EQU   CVTMAP+208                                               03660000
CVTUSER  EQU   CVTMAP+204                                               03661000
CVTABEND EQU   CVTMAP+200                                               03662000
CVTSMCA  EQU   CVTMAP+196                                               03663000
CVTRSV18 EQU   CVTMAP+192                                               03664000
CVTQLPAQ EQU   CVTMAP+188                                               03665000
CVTQCDSR EQU   CVTMAP+184                                               03666000
CVTRSV17 EQU   CVTOPTB                                                  03667000
CVTRSV16 EQU   CVTOPTB                                                  03668000
CVTFP    EQU   CVTOPTB                                                  03669000
CVTAPTHR EQU   CVTOPTB                                                  03670000
CVTNLOG  EQU   CVTOPTB                                                  03671000
CVTTOD   EQU   CVTOPTB                                                  03672000
CVTCTIMS EQU   CVTOPTB                                                  03673000
CVTPROT  EQU   CVTOPTB                                                  03674000
CVTXPFP  EQU   CVTOPTA                                                  03675000
CVTASCII EQU   CVTOPTA                                                  03676000
CVTRSV13 EQU   CVTOPTA                                                  03677000
CVTRSV12 EQU   CVTOPTA                                                  03678000
CVTNIP   EQU   CVTOPTA                                                  03679000
CVTDDR   EQU   CVTOPTA                                                  03680000
CVTAPR   EQU   CVTOPTA                                                  03681000
CVTCCH   EQU   CVTOPTA                                                  03682000
CVTSNCTR EQU   CVTMAP+180                                               03683000
CVTQMWR  EQU   CVTMAP+176                                               03684000
CVTQOCR  EQU   CVTMAP+172                                               03685000
CVT1EF00 EQU   CVTMAP+168                                               03686000
CVTMZ00  EQU   CVTMAP+164                                               03687000
CVTSV76Q EQU   CVTSV76C                                                 03688000
CVTRSV11 EQU   CVTMAP+156                                               03689000
CVTMSER  EQU   CVTMAP+148                                               03690000
CVTRV516 EQU   CVTIERLC                                                 03691000
CVTILCH  EQU   CVTMAP+140                                               03692000
CVT0DS   EQU   CVTMAP+136                                               03693000
CVTFBOSV EQU   CVTMAP+132                                               03694000
CVTNUCB  EQU   CVTMAP+128                                               03695000
CVTIXAVL EQU   CVTMAP+124                                               03696000
CVTSV76M EQU   CVTIOQET                                                 03697000
CVTDCBA  EQU   CVTMAP+117                                               03698000
CVTMVS2  EQU   CVTDCB                                                   03699000
CVT6DAT  EQU   CVTDCB                                                   03700000
CVT4MPS  EQU   CVTDCB                                                   03701000
CVTRSV09 EQU   CVTDCB                                                   03702000
CVT4MS1  EQU   CVTDCB                                                   03703000
CVT2SPS  EQU   CVTDCB                                                   03704000
CVT1SSS  EQU   CVTDCB                                                   03705000
CVTRSV08 EQU   CVTDCB                                                   03706000
CVTSTB   EQU   CVTMAP+112                                               03707000
CVTQTD00 EQU   CVTMAP+108                                               03708000
CVTQTE00 EQU   CVTMAP+104                                               03709000
CVTCUCB  EQU   CVTMAP+100                                               03710000
CVTSJQ   EQU   CVTMAP+96                                                03711000
CVTPBLDL EQU   CVTMAP+92                                                03712000
CVTTPC   EQU   CVTMAP+88                                                03713000
CVTSVDCB EQU   CVTMAP+84                                                03714000
CVTBRET  EQU   CVTMAP+82                                                03715000
CVTEXIT  EQU   CVTMAP+80                                                03716000
CVT0FN00 EQU   CVTMAP+76                                                03717000
CVTDARA  EQU   CVTDAR+1                                                 03718000
CVTRSV07 EQU   CVTFLGS1                                                 03719000
CVTRSV06 EQU   CVTFLGS1                                                 03720000
CVTRSV05 EQU   CVTFLGS1                                                 03721000
CVTRSV04 EQU   CVTFLGS1                                                 03722000
CVTRSV03 EQU   CVTFLGS1                                                 03723000
CVTRSV02 EQU   CVTFLGS1                                                 03724000
CVTRSV01 EQU   CVTFLGS1                                                 03725000
CVTDMPLK EQU   CVTFLGS1                                                 03726000
CVTXITP  EQU   CVTMAP+68                                                03727000
CVTZDTAB EQU   CVTMAP+64                                                03728000
CVTMSLT  EQU   CVTMAP+60                                                03729000
CVTDATE  EQU   CVTMAP+56                                                03730000
CVTBTERM EQU   CVTMAP+52                                                03731000
CVTSYSAD EQU   CVTMAP+48                                                03732000
CVTXTLER EQU   CVTMAP+44                                                03733000
CVTILK2  EQU   CVTMAP+40                                                03734000
CVTILK1  EQU   CVTMAP+36                                                03735000
CVTPRLTV EQU   CVTMAP+32                                                03736000
CVTPCNVT EQU   CVTMAP+28                                                03737000
CVT0VL00 EQU   CVTMAP+24                                                03738000
CVTXAPG  EQU   CVTMAP+20                                                03739000
CVTBUF   EQU   CVTMAP+16                                                03740000
CVTJOB   EQU   CVTMAP+12                                                03741000
CVTLINK  EQU   CVTMAP+8                                                 03742000
CVT0EF00 EQU   CVTMAP+4                                                 03743000
CVTTCBP  EQU   CVTMAP                                                   03744000
CVT      EQU   CVTMAP                                                   03745000
CCWRSV   EQU   CCW+5                                                    03746000
@NM00106 EQU   CCWFLAGS                                                 03747000
CCWIDA   EQU   CCWFLAGS                                                 03748000
CCWPCI   EQU   CCWFLAGS                                                 03749000
CCWSKIP  EQU   CCWFLAGS                                                 03750000
CCWSLI   EQU   CCWFLAGS                                                 03751000
SAVTLLCB EQU   IEDNSVTD+316                                             03752000
SAVTBITN EQU   IEDNSVTD+312                                             03753000
@NM00105 EQU   SAVTCKQB+8                                               03754000
@NM00104 EQU   SAVTCKEC+1                                               03755000
@NM00103 EQU   SAVTCKCC                                                 03756000
SAVTCKPO EQU   SAVTCKCC                                                 03757000
SAVTCKWA EQU   SAVTCKCC                                                 03758000
SAVTCKCH EQU   SAVTCKTB+1                                               03759000
SAVTCKVT EQU   SAVTCKTB                                                 03760000
@NM00102 EQU   IEDNSVTD+297                                             03761000
SAVTRDFG EQU   SAVTRDRV+12                                              03762000
@NM00101 EQU   SAVTRDRV+5                                               03763000
SAVTRDPY EQU   SAVTRDRV+4                                               03764000
SAVTRDQB EQU   SAVTRDRV+1                                               03765000
SAVTRDKY EQU   SAVTRDRV                                                 03766000
SAVTNID  EQU   IEDNSVTD+280                                             03767000
SAVTDVAS EQU   IEDNSVTD+276                                             03768000
SAVTPLSZ EQU   IEDNSVTD+274                                             03769000
@NM00100 EQU   IEDNSVTD+273                                             03770000
SAVTSUBL EQU   IEDNSVTD+272                                             03771000
@NM00099 EQU   SAVTZELM+1                                               03772000
SAVTSUBM EQU   SAVTZELM                                                 03773000
SAVTMHDX EQU   IEDNSVTD+268                                             03774000
SAVTNAT1 EQU   IEDNSVTD+266                                             03775000
SAVTSH20 EQU   IEDNSVTD+264                                             03776000
SAVTLCBS EQU   IEDNSVTD+260                                             03777000
SAVTRNMP EQU   IEDNSVTD+256                                             03778000
SAVTNAX  EQU   IEDNSVTD+248                                             03779000
SAVTSUBV EQU   IEDNSVTD+247                                             03780000
SAVTSUBA EQU   IEDNSVTD+246                                             03781000
SAVTSIBC EQU   IEDNSVTD+244                                             03782000
SAVTBSM  EQU   IEDNSVTD+240                                             03783000
SAVTRQTG EQU   IEDNSVTD+236                                             03784000
SAVTRQCH EQU   IEDNSVTD+232                                             03785000
SAVTMAND EQU   IEDNSVTD+228                                             03786000
SAVTSPLN EQU   IEDNSVTD+224                                             03787000
SAVTNADL EQU   IEDNSVTD+222                                             03788000
SAVTNATL EQU   IEDNSVTD+220                                             03789000
SAVTMHTB EQU   IEDNSVTD+216                                             03790000
SAVTSSMH EQU   IEDNSVTD+212                                             03791000
SAVTQRS  EQU   IEDNSVTD+208                                             03792000
SAVTRQIN EQU   IEDNSVTD+204                                             03793000
SAVTDFCO EQU   IEDNSVTD+200                                             03794000
SAVTSAO  EQU   IEDNSVTD+196                                             03795000
SAVTSARI EQU   IEDNSVTD+192                                             03796000
SAVTSAC  EQU   IEDNSVTD+188                                             03797000
SAVTSAI  EQU   IEDNSVTD+184                                             03798000
SAVTCSCI EQU   IEDNSVTD+180                                             03799000
SAVTSSRP EQU   IEDNSVTD+176                                             03800000
SAVTSCLU EQU   IEDNSVTD+168                                             03801000
SAVTXTRQ EQU   IEDNSVTD+164                                             03802000
SAVTMVBF EQU   IEDNSVTD+160                                             03803000
@NM00098 EQU   IEDNSVTD+148                                             03804000
SAVTIPCQ EQU   IEDNSVTD+144                                             03805000
@NM00097 EQU   IEDNSVTD+136                                             03806000
SAVTXFMI EQU   IEDNSVTD+132                                             03807000
@NM00096 EQU   IEDNSVTD+124                                             03808000
SAVTXFMO EQU   IEDNSVTD+120                                             03809000
@NM00095 EQU   IEDNSVTD+116                                             03810000
SAVTSSSR EQU   IEDNSVTD+112                                             03811000
SAVTSCPQ EQU   IEDNSVTD+108                                             03812000
SAVTSLCB EQU   IEDNSVTD+104                                             03813000
SAVTLUSR EQU   IEDNSVTD+100                                             03814000
@NM00094 EQU   SAVTLUSQ+8                                               03815000
SAVTLUSP EQU   SAVTLUSQ+4                                               03816000
SAVTLUSB EQU   SAVTLUSQ                                                 03817000
@NM00093 EQU   IEDNSVTD+84                                              03818000
SAVTSAT  EQU   IEDNSVTD+80                                              03819000
SAVTNAT  EQU   IEDNSVTD+76                                              03820000
SAVTCLUP EQU   IEDNSVTD+72                                              03821000
SAVTPIUT EQU   IEDNSVTD+68                                              03822000
SAVTRNTA EQU   IEDNSVTD+64                                              03823000
SAVTDNIR EQU   IEDNSVTD+60                                              03824000
SAVTCNIR EQU   IEDNSVTD+56                                              03825000
SAVTSRTN EQU   IEDNSVTD+48                                              03826000
SAVTSREQ EQU   IEDNSVTD+44                                              03827000
SAVTFAIL EQU   IEDNSVTD+42                                              03828000
SAVTSUSE EQU   IEDNSVTD+40                                              03829000
SAVTSIB  EQU   IEDNSVTD+36                                              03830000
SAVTPRTN EQU   IEDNSVTD+32                                              03831000
@NM00092 EQU   IEDNSVTD+28                                              03832000
SAVTWH20 EQU   IEDNSVTD+26                                              03833000
SAVTPWT  EQU   IEDNSVTD+24                                              03834000
SAVTPRTQ EQU   IEDNSVTD+20                                              03835000
SAVTPREQ EQU   IEDNSVTD+16                                              03836000
SAVTPH20 EQU   IEDNSVTD+14                                              03837000
SAVTPUSE EQU   IEDNSVTD+12                                              03838000
SAVTPLCB EQU   IEDNSVTD+8                                               03839000
SAVTPOOL EQU   IEDNSVTD+4                                               03840000
SAVTPRMT EQU   SAVTDIAF                                                 03841000
SAVTVIRT EQU   SAVTDIAF                                                 03842000
AVTCPBNO EQU   IEDQAVTD+1244                                            03843000
AVTHRESS EQU   IEDQAVTD+1243                                            03844000
@NM00091 EQU   IEDQAVTD+1242                                            03845000
@NM00090 EQU   IEDQAVTD+1241                                            03846000
@NM00089 EQU   IEDQAVTD+1240                                            03847000
@NM00088 EQU   IEDQAVTD+1237                                            03848000
@NM00087 EQU   IEDQAVTD+1236                                            03849000
AVTHRESE EQU   @NM00086                                                 03850000
AVTRADDR EQU   IEDQAVTD+1228                                            03851000
AVTNADDR EQU   IEDQAVTD+1224                                            03852000
AVTHRESN EQU   IEDQAVTD+1220                                            03853000
AVTVOLRN EQU   IEDQAVTD+1216                                            03854000
AVTTOTNN EQU   IEDQAVTD+1212                                            03855000
AVTTRCYN EQU   IEDQAVTD+1208                                            03856000
AVTRCTRN EQU   IEDQAVTD+1204                                            03857000
AVTNOVON EQU   IEDQAVTD+1200                                            03858000
AVTADEBN EQU   IEDQAVTD+1196                                            03859000
AVTVOLRR EQU   IEDQAVTD+1192                                            03860000
AVTTOTNR EQU   IEDQAVTD+1188                                            03861000
AVTTRCYR EQU   IEDQAVTD+1184                                            03862000
AVTRCTRR EQU   IEDQAVTD+1180                                            03863000
AVTNOVOR EQU   IEDQAVTD+1176                                            03864000
AVTADEBR EQU   IEDQAVTD+1172                                            03865000
AVTLODPT EQU   IEDQAVTD+1168                                            03866000
AVTIOBN  EQU   IEDQAVTD+1164                                            03867000
AVTIOBR  EQU   IEDQAVTD+1160                                            03868000
AVTCPBPT EQU   IEDQAVTD+1156                                            03869000
AVTFCPB  EQU   IEDQAVTD+1152                                            03870000
@NM00085 EQU   IEDQAVTD+1148                                            03871000
AVTINCPQ EQU   IEDQAVTD+1144                                            03872000
@NM00084 EQU   IEDQAVTD+1140                                            03873000
@NM00083 EQU   IEDQAVTD+1137                                            03874000
@NM00082 EQU   AVTBIT4                                                  03875000
@NM00081 EQU   AVTBIT4                                                  03876000
@NM00080 EQU   AVTBIT4                                                  03877000
@NM00079 EQU   AVTBIT4                                                  03878000
@NM00078 EQU   AVTBIT4                                                  03879000
@NM00077 EQU   AVTBIT4                                                  03880000
@NM00076 EQU   AVTBIT4                                                  03881000
AVTRUFTN EQU   AVTBIT4                                                  03882000
@NM00075 EQU   IEDQAVTD+1132                                            03883000
AVTNOBFQ EQU   IEDQAVTD+1128                                            03884000
@NM00074 EQU   IEDQAVTD+1124                                            03885000
AVTDKENQ EQU   IEDQAVTD+1120                                            03886000
@NM00073 EQU   IEDQAVTD+1116                                            03887000
AVTDKAPQ EQU   IEDQAVTD+1112                                            03888000
AVTCOPY  EQU   IEDQAVTD+1108                                            03889000
AVTIA    EQU   IEDQAVTD+1104                                            03890000
AVTFL    EQU   IEDQAVTD+1100                                            03891000
@NM00072 EQU   IEDQAVTD+1096                                            03892000
AVTNCPBQ EQU   IEDQAVTD+1092                                            03893000
AVTTOTNC EQU   IEDQAVTD+1088                                            03894000
AVTCMAX  EQU   IEDQAVTD+1084                                            03895000
AVTCMIN  EQU   IEDQAVTD+1080                                            03896000
AVTHM02  EQU   IEDQAVTD+1076                                            03897000
AVTOPCIN EQU   IEDQAVTD+1074                                            03898000
AVTDCTLN EQU   IEDQAVTD+1072                                            03899000
AVTOPMSK EQU   IEDQAVTD+1068                                            03900000
AVTDDFT  EQU   IEDQAVTD+1064                                            03901000
AVTSTEAL EQU   IEDQAVTD+1060                                            03902000
AVTOPTN  EQU   IEDQAVTD+1056                                            03903000
AVTDSKCT EQU   IEDQAVTD+1054                                            03904000
AVTCKRST EQU   IEDQAVTD+1053                                            03905000
AVTSTAN  EQU   AVTBIT3                                                  03906000
AVTSTACN EQU   AVTBIT3                                                  03907000
AVTSTAIN EQU   AVTBIT3                                                  03908000
AVTSTAYN EQU   AVTBIT3                                                  03909000
AVTOLTBN EQU   AVTBIT3                                                  03910000
AVTTSAB  EQU   AVTBIT3                                                  03911000
AVTRFULN EQU   AVTBIT3                                                  03912000
AVTRECVN EQU   AVTBIT3                                                  03913000
@NM00071 EQU   AVTBIT2                                                  03914000
@NM00070 EQU   AVTBIT2                                                  03915000
AVTOPEIN EQU   AVTBIT2                                                  03916000
AVTSTRTN EQU   AVTBIT2                                                  03917000
AVTTOPOL EQU   AVTBIT2                                                  03918000
AVTCOPYN EQU   AVTBIT2                                                  03919000
AVTREUSN EQU   AVTBIT2                                                  03920000
AVTEXTSC EQU   AVTBIT2                                                  03921000
AVTDISKN EQU   AVTBIT1                                                  03922000
AVTQUCKN EQU   AVTBIT1                                                  03923000
AVTCLOSN EQU   AVTBIT1                                                  03924000
AVTREADN EQU   AVTBIT1                                                  03925000
AVTDLAYN EQU   AVTBIT1                                                  03926000
AVTAQTAN EQU   AVTBIT1                                                  03927000
AVTTSON  EQU   AVTBIT1                                                  03928000
AVTAPLKN EQU   AVTBIT1                                                  03929000
AVTDUMBR EQU   IEDQAVTD+1048                                            03930000
AVTDLQX  EQU   IEDQAVTD+1046                                            03931000
AVTINTLV EQU   IEDQAVTD+1044                                            03932000
AVTSMCNT EQU   IEDQAVTD+1042                                            03933000
AVTAVFCT EQU   IEDQAVTD+1040                                            03934000
AVTOPCON EQU   IEDQAVTD+1038                                            03935000
AVTOPCNT EQU   IEDQAVTD+1036                                            03936000
AVTLNCNT EQU   IEDQAVTD+1034                                            03937000
AVTKEYLE EQU   IEDQAVTD+1032                                            03938000
AVTHA16  EQU   IEDQAVTD+1030                                            03939000
AVTHA7   EQU   IEDQAVTD+1028                                            03940000
AVTHA4   EQU   IEDQAVTD+1026                                            03941000
AVTHA3   EQU   IEDQAVTD+1024                                            03942000
AVTHA2   EQU   IEDQAVTD+1022                                            03943000
AVTGETMS EQU   IEDQAVTD+1021                                            03944000
@NM00069 EQU   IEDQAVTD+1020                                            03945000
AVTGETMD EQU   IEDQAVTD+1016                                            03946000
AVTGETMN EQU   IEDQAVTD+1012                                            03947000
AVTCWTOT EQU   IEDQAVTD+1008                                            03948000
AVTCWINT EQU   IEDQAVTD+956                                             03949000
AVTDTRAP EQU   IEDQAVTD+952                                             03950000
@NM00068 EQU   IEDQAVTD+950                                             03951000
@NM00067 EQU   AVTIOTR                                                  03952000
AVTIOTRH EQU   AVTIOTR                                                  03953000
AVTIOTRE EQU   AVTIOTR                                                  03954000
@NM00066 EQU   AVTSUBT                                                  03955000
AVTSUBPT EQU   AVTSUBT                                                  03956000
AVTSUBON EQU   AVTSUBT                                                  03957000
AVTAFE30 EQU   IEDQAVTD+944                                             03958000
AVTAFE20 EQU   IEDQAVTD+940                                             03959000
AVTAFE10 EQU   IEDQAVTD+936                                             03960000
AVTCWEC2 EQU   IEDQAVTD+932                                             03961000
AVTCWPM2 EQU   IEDQAVTD+928                                             03962000
AVTCWTS2 EQU   IEDQAVTD+927                                             03963000
AVTCWTS1 EQU   IEDQAVTD+926                                             03964000
AVTCWCLD EQU   AVTCWFL2                                                 03965000
AVTCWRAP EQU   AVTCWFL2                                                 03966000
@NM00065 EQU   AVTCWFL2                                                 03967000
@NM00064 EQU   AVTCWFL2                                                 03968000
@NM00063 EQU   AVTCWFL2                                                 03969000
@NM00062 EQU   AVTCWFL2                                                 03970000
@NM00061 EQU   AVTCWFL2                                                 03971000
AVTCWACT EQU   AVTCWFL2                                                 03972000
@NM00060 EQU   AVTCWFL1                                                 03973000
@NM00059 EQU   AVTCWFL1                                                 03974000
@NM00058 EQU   AVTCWFL1                                                 03975000
@NM00057 EQU   AVTCWFL1                                                 03976000
@NM00056 EQU   AVTCWFL1                                                 03977000
@NM00055 EQU   AVTCWFL1                                                 03978000
@NM00054 EQU   AVTCWFL1                                                 03979000
AVTCOMWN EQU   AVTCWFL1                                                 03980000
AVTCWEC1 EQU   IEDQAVTD+920                                             03981000
AVTCWPM1 EQU   IEDQAVTD+916                                             03982000
AVTCAREA EQU   IEDQAVTD+912                                             03983000
AVTFZERO EQU   IEDQAVTD+908                                             03984000
AVTCADDR EQU   IEDQAVTD+904                                             03985000
AVTCOREC EQU   IEDQAVTD+900                                             03986000
@NM00053 EQU   IEDQAVTD+892                                             03987000
AVTCPBCB EQU   IEDQAVTD+888                                             03988000
@NM00052 EQU   IEDQAVTD+880                                             03989000
AVTDSIOB EQU   IEDQAVTD+876                                             03990000
@NM00051 EQU   IEDQAVTD+868                                             03991000
AVTCPRMB EQU   IEDQAVTD+864                                             03992000
@NM00050 EQU   IEDQAVTD+856                                             03993000
AVTCLOSB EQU   IEDQAVTD+852                                             03994000
@NM00049 EQU   IEDQAVTD+844                                             03995000
AVTACTIB EQU   IEDQAVTD+840                                             03996000
@NM00048 EQU   IEDQAVTD+836                                             03997000
AVTOLTEB EQU   IEDQAVTD+832                                             03998000
AVTOLTCH EQU   AVTOLTQB+1                                               03999000
AVTOLTVT EQU   AVTOLTQB                                                 04000000
@NM00047 EQU   AVTOPCQB+8                                               04001000
@NM00046 EQU   AVTOPCEC+1                                               04002000
@NM00045 EQU   AVTOPCCC                                                 04003000
AVTOPCPO EQU   AVTOPCCC                                                 04004000
AVTOPCWA EQU   AVTOPCCC                                                 04005000
AVTOPCCH EQU   AVTOPCOB+1                                               04006000
AVTOPCVT EQU   AVTOPCOB                                                 04007000
@NM00044 EQU   AVTCKPQB+9                                               04008000
AVTCKPTS EQU   AVTCKPQB+8                                               04009000
@NM00043 EQU   AVTCKPEC+1                                               04010000
@NM00042 EQU   AVTCKPCC                                                 04011000
AVTCKPPO EQU   AVTCKPCC                                                 04012000
AVTCKPWA EQU   AVTCKPCC                                                 04013000
AVTCKPCH EQU   AVTCKPTB+1                                               04014000
AVTCKPVT EQU   AVTCKPTB                                                 04015000
@NM00041 EQU   IEDQAVTD+796                                             04016000
AVTBFRTB EQU   IEDQAVTD+792                                             04017000
@NM00040 EQU   IEDQAVTD+788                                             04018000
AVTSELCH EQU   IEDQAVTD+785                                             04019000
AVTBFRTN EQU   AVTBFRFG                                                 04020000
AVTBFREB EQU   IEDQAVTD+780                                             04021000
AVTTIMQ  EQU   IEDQAVTD+776                                             04022000
@NM00039 EQU   IEDQAVTD+772                                             04023000
AVTIMQPS EQU   IEDQAVTD+768                                             04024000
AVTINOUT EQU   IEDQAVTD+766                                             04025000
AVTREFTM EQU   IEDQAVTD+764                                             04026000
@NM00038 EQU   IEDQAVTD+752                                             04027000
AVTDELYB EQU   IEDQAVTD+748                                             04028000
AVTOCQPT EQU   IEDQAVTD+744                                             04029000
AVTTSOPT EQU   IEDQAVTD+740                                             04030000
AVTSUPPT EQU   IEDQAVTD+736                                             04031000
AVTCBQCB EQU   IEDQAVTD+732                                             04032000
AVTMSGS  EQU   IEDQAVTD+729                                             04033000
@NM00037 EQU   AVTSYSER                                                 04034000
@NM00036 EQU   AVTSYSER                                                 04035000
@NM00035 EQU   AVTSYSER                                                 04036000
@NM00034 EQU   AVTSYSER                                                 04037000
@NM00033 EQU   AVTSYSER                                                 04038000
@NM00032 EQU   AVTSYSER                                                 04039000
AVTCMAXN EQU   AVTSYSER                                                 04040000
AVTCMINN EQU   AVTSYSER                                                 04041000
AVT2260L EQU   IEDQAVTD+724                                             04042000
AVTABEPL EQU   AVTADBUF                                                 04043000
AVTHFF   EQU   AVTCLRHI+2                                               04044000
@NM00031 EQU   AVTCLRHI                                                 04045000
AVTCCLNK EQU   AVTCRELE+5                                               04046000
AVTCCPRI EQU   AVTCRELE+4                                               04047000
AVTCCQCB EQU   AVTCCELE+1                                               04048000
AVTCCKEY EQU   AVTCCELE                                                 04049000
AVTDELAD EQU   IEDQAVTD+704                                             04050000
AVTDELEM EQU   IEDQAVTD+700                                             04051000
AVTBSX   EQU   AVTCKLNK                                                 04052000
AVTOPETR EQU   AVTHG01                                                  04053000
@NM00030 EQU   AVTCKBYT                                                 04054000
AVTCKONQ EQU   AVTCKBYT                                                 04055000
@NM00029 EQU   AVTCKBYT                                                 04056000
@NM00028 EQU   AVTCKBYT                                                 04057000
@NM00027 EQU   AVTCKBYT                                                 04058000
@NM00026 EQU   AVTCKBYT                                                 04059000
@NM00025 EQU   AVTCKBYT                                                 04060000
@NM00024 EQU   AVTCKBYT                                                 04061000
AVTOPERT EQU   IEDQAVTD+690                                             04062000
AVTOPXCL EQU   IEDQAVTD+688                                             04063000
AVTOPERL EQU   IEDQAVTD+687                                             04064000
@NM00023 EQU   IEDQAVTD+686                                             04065000
AVTCKTIM EQU   IEDQAVTD+684                                             04066000
AVTCKELV EQU   IEDQAVTD+682                                             04067000
AVTCPRCD EQU   IEDQAVTD+681                                             04068000
AVTWARMN EQU   AVTCKELF                                                 04069000
AVTCRTLN EQU   AVTCKELF                                                 04070000
AVTCPIPN EQU   AVTCKELF                                                 04071000
AVTCCLCN EQU   AVTCKELF                                                 04072000
AVTCINCN EQU   AVTCKELF                                                 04073000
@NM00022 EQU   AVTCKELF                                                 04074000
AVTCMCPN EQU   AVTCKELF                                                 04075000
AVTNQBCK EQU   AVTCKELF                                                 04076000
AVTCKQAD EQU   IEDQAVTD+677                                             04077000
AVTSCBSZ EQU   IEDQAVTD+676                                             04078000
@NM00021 EQU   IEDQAVTD+672                                             04079000
AVTCKELE EQU   IEDQAVTD+668                                             04080000
@NM00020 EQU   AVTCKPEL+8                                               04081000
AVTCKRLK EQU   AVTCKPEL+5                                               04082000
AVTCKRPR EQU   AVTCKPEL+4                                               04083000
AVTCKRMQ EQU   AVTCKRMV+1                                               04084000
AVTCKRKY EQU   AVTCKRMV                                                 04085000
AVTHK    EQU   IEDQAVTD+648                                             04086000
AVTHI    EQU   IEDQAVTD+644                                             04087000
AVTNX    EQU   IEDQAVTD+636                                             04088000
AVTTONE  EQU   IEDQAVTD+632                                             04089000
AVTA3TL  EQU   IEDQAVTD+628                                             04090000
AVTDMECB EQU   IEDQAVTD+624                                             04091000
AVTABEND EQU   IEDQAVTD+618                                             04092000
AVTPLCBN EQU   IEDQAVTD+616                                             04093000
@NM00019 EQU   AVTSAVTP+1                                               04094000
@NM00018 EQU   AVTSAVTF                                                 04095000
AVTSNA   EQU   AVTSAVTF                                                 04096000
AVTONSNA EQU   AVTSAVTF                                                 04097000
AVTVTMCP EQU   AVTSAVTF                                                 04098000
@NM00017 EQU   IEDQAVTD+608                                             04099000
AVTCMBSS EQU   IEDQAVTD+604                                             04100000
AVTRCV   EQU   IEDQAVTD+600                                             04101000
AVTSEND  EQU   IEDQAVTD+596                                             04102000
AVTCSCH  EQU   IEDQAVTD+592                                             04103000
AVTQ1    EQU   IEDQAVTD+588                                             04104000
AVTE7    EQU   IEDQAVTD+584                                             04105000
AVTHB    EQU   IEDQAVTD+580                                             04106000
AVTR1    EQU   IEDQAVTD+576                                             04107000
AVTBZ    EQU   IEDQAVTD+572                                             04108000
AVTEZ    EQU   IEDQAVTD+568                                             04109000
AVTEC    EQU   IEDQAVTD+564                                             04110000
AVTEW    EQU   IEDQAVTD+560                                             04111000
AVTNDIAL EQU   AVTSCOPT                                                 04112000
AVTN2741 EQU   AVTSCOPT                                                 04113000
AVTCONCO EQU   AVTSCOPT                                                 04114000
AVTCONC  EQU   AVTSCOPT                                                 04115000
AVTCMBUF EQU   AVTSCOPT                                                 04116000
AVTAPDMP EQU   AVTSCOPT                                                 04117000
@NM00016 EQU   AVTSCOPT                                                 04118000
AVTHA    EQU   AVTDISP                                                  04119000
AVTEA    EQU   IEDQAVTD+548                                             04120000
AVTAX    EQU   IEDQAVTD+544                                             04121000
AVTA3    EQU   IEDQAVTD+540                                             04122000
AVTGD    EQU   IEDQAVTD+536                                             04123000
AVTAL    EQU   IEDQAVTD+532                                             04124000
AVTOLTST EQU   AVTHG02                                                  04125000
AVTE8    EQU   IEDQAVTD+524                                             04126000
AVTUI    EQU   IEDQAVTD+520                                             04127000
AVTCOMPT EQU   IEDQAVTD+516                                             04128000
AVTCRSRF EQU   IEDQAVTD+512                                             04129000
@NM00015 EQU   IEDQAVTD+508                                             04130000
AVTKA02  EQU   IEDQAVTD+504                                             04131000
AVTOPTPT EQU   IEDQAVTD+500                                             04132000
AVTPCBPT EQU   IEDQAVTD+496                                             04133000
@NM00014 EQU   AVTECB1                                                  04134000
AVTCOMP  EQU   AVTECB1                                                  04135000
@NM00013 EQU   AVTECB1                                                  04136000
AVTOPECA EQU   IEDQAVTD+488                                             04137000
AVTOLECA EQU   IEDQAVTD+484                                             04138000
AVTCKECA EQU   IEDQAVTD+480                                             04139000
AVTCWECA EQU   IEDQAVTD+476                                             04140000
AVTCWTCB EQU   IEDQAVTD+472                                             04141000
AVTOLTCB EQU   IEDQAVTD+468                                             04142000
AVTOCTCB EQU   IEDQAVTD+464                                             04143000
AVTCKTCB EQU   IEDQAVTD+460                                             04144000
AVTAS    EQU   IEDQAVTD+456                                             04145000
AVTNOLBF EQU   IEDQAVTD+454                                             04146000
AVTNCKPR EQU   IEDQAVTD+453                                             04147000
AVTCIB   EQU   IEDQAVTD+452                                             04148000
AVTSPLPT EQU   IEDQAVTD+448                                             04149000
AVTMVBFR EQU   IEDQAVTD+444                                             04150000
AVTSBTA  EQU   IEDQAVTD+440                                             04151000
AVTRARTN EQU   IEDQAVTD+436                                             04152000
AVTBSCAN EQU   IEDQAVTD+432                                             04153000
AVTRDYA  EQU   IEDQAVTD+428                                             04154000
AVTDISTR EQU   IEDQAVTD+420                                             04155000
AVTPARM3 EQU   IEDQAVTD+416                                             04156000
@NM00012 EQU   AVTPKF                                                   04157000
@NM00011 EQU   AVTPKF                                                   04158000
@NM00010 EQU   AVTPKF                                                   04159000
AVTFTCHF EQU   AVTPKF                                                   04160000
@NM00009 EQU   AVTPKF                                                   04161000
@NM00008 EQU   AVTPKF                                                   04162000
@NM00007 EQU   AVTPKF                                                   04163000
@NM00006 EQU   AVTPKF                                                   04164000
AVTPARM  EQU   IEDQAVTD+408                                             04165000
AVTEXS2A EQU   IEDQAVTD+402                                             04166000
AVTEXA2S EQU   IEDQAVTD+396                                             04167000
AVTOCGET EQU   IEDQAVTD+392                                             04168000
AVTCKAVT EQU   @NM00004+1                                               04169000
@NM00005 EQU   AVTCKFLG                                                 04170000
AVTCKHLT EQU   AVTCKFLG                                                 04171000
AVTCKREQ EQU   AVTCKFLG                                                 04172000
AVTCKENV EQU   AVTCKFLG                                                 04173000
AVTCKNAC EQU   AVTCKFLG                                                 04174000
AVTCKTAC EQU   AVTCKFLG                                                 04175000
AVTBUENT EQU   IEDQAVTD+386                                             04176000
@NM00003 EQU   IEDQAVTD+385                                             04177000
AVTFULLT EQU   AVTBUFSW                                                 04178000
AVTUNCON EQU   AVTBUFSW                                                 04179000
@NM00002 EQU   AVTBUFSW                                                 04180000
AVTBUFTR EQU   AVTREADD                                                 04181000
AVTREADY EQU   IEDQAVTD+376                                             04182000
AVTRACE  EQU   IEDQAVTD+372                                             04183000
AVTTCB   EQU   IEDQAVTD+368                                             04184000
AVTPASWD EQU   IEDQAVTD+360                                             04185000
AVTCTLCH EQU   IEDQAVTD+352                                             04186000
AVTDOUBL EQU   IEDQAVTD+344                                             04187000
AVTDOUBX EQU   IEDQAVTD+336                                             04188000
AVTCSTCS EQU   IEDQAVTD+328                                             04189000
AVTDLQ   EQU   AVTSAVEX+32                                              04190000
@NM00001 EQU   AVTSAVEX                                                 04191000
AVTSAVE4 EQU   IEDQAVTD+216                                             04192000
AVTSAVE3 EQU   IEDQAVTD+144                                             04193000
AVTSAVE2 EQU   IEDQAVTD+72                                              04194000
AVTSAVE1 EQU   IEDQAVTD                                                 04195000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04196000
@RF00525 EQU   @RC00515                                                 04197000
@RC00523 EQU   @RC00515                                                 04198000
@RC00519 EQU   @RC00515                                                 04199000
@RT00532 EQU   @RC00531                                                 04200000
@RC00583 EQU   @RC00582                                                 04201000
@RC00658 EQU   @RC00637                                                 04202000
@RC00640 EQU   @RC00637                                                 04203000
@RC00722 EQU   @RC00706                                                 04204000
@RC00715 EQU   @RC00706                                                 04205000
@RC00708 EQU   @RC00706                                                 04206000
@RC00746 EQU   @RC00706                                                 04207000
@RC00892 EQU   @RC00887                                                 04208000
@RC00898 EQU   @RC00887                                                 04209000
@RF00901 EQU   @RC00887                                                 04210000
@PB00005 EQU   @EL00001                                                 04211000
@RC00649 EQU   @RC00640                                                 04212000
@RC00644 EQU   @RC00640                                                 04213000
@PB00004 EQU   @PB00005                                                 04214000
@RC00893 EQU   @RC00892                                                 04215000
@PB00003 EQU   @PB00004                                                 04216000
@PB00002 EQU   @PB00003                                                 04217000
@ENDDATA EQU   *                                                        04218000
         END   IGG019TH,(C'PLS1458',0701,78135)                         04219000
