./  ADD  SSI=83340430,NAME=HMASMXRF
         TITLE 'HMASMXRF - SMP CDS/ACDS XREF MOD'                       00001000
HMASMXRF CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMXRF  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         MVC   @PC00001(12),0(@01)                                 0001 00017000
*                                                                  0167 00018000
*   /*****************************************************************/ 00019000
*   /*                                                               */ 00020000
*   /* INITIALIZATION                                                */ 00021000
*   /*                                                               */ 00022000
*   /*****************************************************************/ 00023000
*                                                                  0168 00024000
*   XRFRTNCD=ZERO;                  /* INIT RETURN CODE              */ 00025000
         SLR   XRFRTNCD,XRFRTNCD                                   0168 00026000
*   IOPPTR=ADDR(XRFIOP);            /* ADDR OF IOP                   */ 00027000
         LA    IOPPTR,XRFIOP                                       0169 00028000
*   IOPPTR2=ZERO;                   /* NO SECOND IOP YET             */ 00029000
         SLR   IOPPTR2,IOPPTR2                                     0170 00030000
*   HMASMIOP=''B;                   /* ZERO IOP                      */ 00031000
         XC    HMASMIOP(68,IOPPTR),HMASMIOP(IOPPTR)                0171 00032000
*   GTPPTR=ADDR(XRFGTP);            /* PTR FOR XREF FILE             */ 00033000
         L     GTPPTR,@PC00001+4                                   0172 00034000
*   SETPTR=ADDR(SETGTP);            /* PTR FOR SET FILE              */ 00035000
         L     SETPTR,@PC00001+8                                   0173 00036000
*   CALL XRFINIT;                   /*                               */ 00037000
         BAL   @14,XRFINIT                                         0174 00038000
*   RFY                                                            0175 00039000
*     RTNCODE RSTD;                 /*                               */ 00040000
*   XRFRTNCD=MAX(XRFRTNCD,RTNCODE); /*                               */ 00041000
         CR    XRFRTNCD,RTNCODE                                    0176 00042000
         BNL   *+6                                                      00043000
         LR    XRFRTNCD,RTNCODE                                    0176 00044000
*   RFY                                                            0177 00045000
*     RTNCODE UNRSTD;               /*                               */ 00046000
*                                                                  0178 00047000
*   /*****************************************************************/ 00048000
*   /*                                                               */ 00049000
*   /* LOOP READING NEXT DIRECTORY ENTRY FROM SPECIFIED DATA SET FOR */ 00050000
*   /* EACH PTF ENTRY FOUND PROCESS EACH OF ITS SUB-ENTRIES          */ 00051000
*   /*                                                               */ 00052000
*   /*****************************************************************/ 00053000
*                                                                  0178 00054000
*   DO WHILE                        /* LOOP                          */ 00055000
*         (IOPRETRN=IOPGOOD         /* UNTIL EOF OR ERROR            */ 00056000
*         &XRFRTNCD<STOPFUNC);      /* OR ERROR IN WRITE             */ 00057000
         B     @DE00178                                            0178 00058000
@DL00178 DS    0H                                                  0179 00059000
*     IOPFUNCT=IOPGETN;             /* SET TO GET NEXT DIRECTORY RCD */ 00060000
         MVI   IOPFUNCT(IOPPTR),X'0A'                              0179 00061000
*     CALL HMASMIO(HMASMIOP);       /* GET NEXT DIRECTORY ENTRY      */ 00062000
*                                                                  0180 00063000
         ST    IOPPTR,@AL00001                                     0180 00064000
         L     @15,@CV01450                                        0180 00065000
         LA    @01,@AL00001                                        0180 00066000
         BALR  @14,@15                                             0180 00067000
*     /***************************************************************/ 00068000
*     /*                                                             */ 00069000
*     /* IF ENTRY IS MAC AND MAC RELATED DATA REQUESTED PROCESS IT   */ 00070000
*     /*                                                             */ 00071000
*     /***************************************************************/ 00072000
*                                                                  0181 00073000
*     IF IOPRETRN=IOPGOOD           /* IF ENTRY OBTAINED             */ 00074000
*       THEN                        /*                               */ 00075000
         CLI   IOPRETRN(IOPPTR),0                                  0181 00076000
         BNE   @RF00181                                            0181 00077000
*       DO;                         /*                               */ 00078000
*         IF IOPTYPE=IOPMAC         /* AND ITS MAC TYPE AND          */ 00079000
*             &(LISTASM=ON|LISTSRC=ON|LISTALL2=ON)/* RELATED REQUEST */ 00080000
*           THEN                    /*                               */ 00081000
         CLI   IOPTYPE(IOPPTR),3                                   0183 00082000
         BNE   @RF00183                                            0183 00083000
         L     @10,@PC00001                                        0183 00084000
         TM    LISTASM(@10),B'11000100'                            0183 00085000
         BZ    @RF00183                                            0183 00086000
*           DO;                     /*                               */ 00087000
*             IOPFUNCT=IOPXTND;     /* GET EXTENSION                 */ 00088000
         MVI   IOPFUNCT(IOPPTR),X'07'                              0185 00089000
*             CALL HMASMIO(HMASMIOP);/*                              */ 00090000
         ST    IOPPTR,@AL00001                                     0186 00091000
         L     @15,@CV01450                                        0186 00092000
         LA    @01,@AL00001                                        0186 00093000
         BALR  @14,@15                                             0186 00094000
*             IF IOPRETRN=IOPGOOD   /* IF EXTENDED OK                */ 00095000
*               THEN                /*                               */ 00096000
         CLI   IOPRETRN(IOPPTR),0                                  0187 00097000
         BNE   @RF00187                                            0187 00098000
*               DO;                 /*                               */ 00099000
*                 CALL XRFMACP1;    /* PROCESS MAC ENTRY             */ 00100000
         BAL   @14,XRFMACP1                                        0189 00101000
*                 RFY                                              0190 00102000
*                   RTNCODE RSTD;   /*                               */ 00103000
*                 XRFRTNCD=MAX(XRFRTNCD,RTNCODE);/* SAVE RC          */ 00104000
         CR    XRFRTNCD,RTNCODE                                    0191 00105000
         BNL   *+6                                                      00106000
         LR    XRFRTNCD,RTNCODE                                    0191 00107000
*                 RFY                                              0192 00108000
*                   RTNCODE UNRSTD; /*                               */ 00109000
*               END;                /* END EXTEND OK                 */ 00110000
*             ELSE                  /* IF EXTEND NOT OK              */ 00111000
*               XRFRTNCD=MAX(XRFRTNCD,IOPRETRN);/*                   */ 00112000
         B     @RC00187                                            0194 00113000
@RF00187 SLR   @10,@10                                             0194 00114000
         IC    @10,IOPRETRN(,IOPPTR)                               0194 00115000
         CR    XRFRTNCD,@10                                        0194 00116000
         BNL   *+6                                                      00117000
         LR    XRFRTNCD,@10                                        0194 00118000
*           END;                    /* END ENTRY IS PTF              */ 00119000
*                                                                  0195 00120000
*         /***********************************************************/ 00121000
*         /*                                                         */ 00122000
*         /* IF ENTRY IS MOD AND MOD RELATED DATA REQUESTED PROCESS  */ 00123000
*         /* IT                                                      */ 00124000
*         /*                                                         */ 00125000
*         /***********************************************************/ 00126000
*                                                                  0196 00127000
*         ELSE                      /*                               */ 00128000
*           IF IOPTYPE=IOPMOD       /* IF MAC TYPE ENTRY             */ 00129000
*               &(LISTLMD=ON|LISTALL2=ON)/* AND RELEATED REQUEST     */ 00130000
*             THEN                  /*                               */ 00131000
         B     @RC00183                                            0196 00132000
@RF00183 CLI   IOPTYPE(IOPPTR),5                                   0196 00133000
         BNE   @RF00196                                            0196 00134000
         L     @10,@PC00001                                        0196 00135000
         TM    LISTLMD(@10),B'10100000'                            0196 00136000
         BZ    @RF00196                                            0196 00137000
*             DO;                   /*                               */ 00138000
*               IOPFUNCT=IOPXTND;   /* GET EXTENSION                 */ 00139000
         MVI   IOPFUNCT(IOPPTR),X'07'                              0198 00140000
*               CALL HMASMIO(HMASMIOP);/*                            */ 00141000
         ST    IOPPTR,@AL00001                                     0199 00142000
         L     @15,@CV01450                                        0199 00143000
         LA    @01,@AL00001                                        0199 00144000
         BALR  @14,@15                                             0199 00145000
*               IF IOPRETRN=IOPGOOD /* IF EXTENDED OK                */ 00146000
*                 THEN              /*                               */ 00147000
         CLI   IOPRETRN(IOPPTR),0                                  0200 00148000
         BNE   @RF00200                                            0200 00149000
*                 DO;               /*                               */ 00150000
*                   CALL XRFMODP1;  /* PROCESS MOD ENTRY             */ 00151000
         BAL   @14,XRFMODP1                                        0202 00152000
*                   RFY                                            0203 00153000
*                     RTNCODE RSTD; /*                               */ 00154000
*                   XRFRTNCD=MAX(XRFRTNCD,RTNCODE);/* SAVE RC        */ 00155000
         CR    XRFRTNCD,RTNCODE                                    0204 00156000
         BNL   *+6                                                      00157000
         LR    XRFRTNCD,RTNCODE                                    0204 00158000
*                   RFY                                            0205 00159000
*                     RTNCODE UNRSTD;/*                              */ 00160000
*                 END;              /* END EXTEND OK                 */ 00161000
*               ELSE                /* IF EXTEND NOT OK              */ 00162000
*                 XRFRTNCD=MAX(XRFRTNCD,IOPRETRN);/*                 */ 00163000
         B     @RC00200                                            0207 00164000
@RF00200 SLR   @10,@10                                             0207 00165000
         IC    @10,IOPRETRN(,IOPPTR)                               0207 00166000
         CR    XRFRTNCD,@10                                        0207 00167000
         BNL   *+6                                                      00168000
         LR    XRFRTNCD,@10                                        0207 00169000
*             END;                  /* END ENTRY IS PTF              */ 00170000
*                                                                  0208 00171000
*         /***********************************************************/ 00172000
*         /*                                                         */ 00173000
*         /* IF ENTRY IS PTF AND PTF RELATED DATA REQUESTED          */ 00174000
*         /*                                                         */ 00175000
*         /***********************************************************/ 00176000
*                                                                  0209 00177000
*           ELSE                    /*                               */ 00178000
*             IF IOPTYPE=IOPSMD     /* IF SYSMOD TYPE RECORD         */ 00179000
*                 &IOPDUMMP=OFF     /* AND NOT DUMYY ONLY            */ 00180000
*                 &(LISTMOD=ON      /* AND A LIST REQUEST FOR        */ 00181000
*                 |LISTMAC=ON       /* TYPE ENTRY THAT IS RELATED    */ 00182000
*                 |LISTSRC=ON       /* TO SYSMODS                    */ 00183000
*                 |LISTSMD=ON       /*                               */ 00184000
*                 |LISTALL2=ON)     /*                               */ 00185000
*               THEN                /*                               */ 00186000
         B     @RC00196                                            0209 00187000
@RF00196 CLI   IOPTYPE(IOPPTR),11                                  0209 00188000
         BNE   @RF00209                                            0209 00189000
         TM    IOPDUMMP(IOPPTR),B'00000100'                        0209 00190000
         BNZ   @RF00209                                            0209 00191000
         L     @10,@PC00001                                        0209 00192000
         TM    LISTMOD(@10),B'00011100'                            0209 00193000
         BNZ   @RT00209                                            0209 00194000
         TM    LISTSMD(@10),B'10000000'                            0209 00195000
         BO    @RT00209                                            0209 00196000
         TM    LISTALL2(@10),B'10000000'                           0209 00197000
         BNO   @RF00209                                            0209 00198000
@RT00209 DS    0H                                                  0210 00199000
*               DO;                 /*                               */ 00200000
*                 IOPFUNCT=IOPXTND; /* GET EXTENSION                 */ 00201000
         MVI   IOPFUNCT(IOPPTR),X'07'                              0211 00202000
*                 CALL HMASMIO(HMASMIOP);/*                          */ 00203000
         ST    IOPPTR,@AL00001                                     0212 00204000
         L     @15,@CV01450                                        0212 00205000
         LA    @01,@AL00001                                        0212 00206000
         BALR  @14,@15                                             0212 00207000
*                 IF IOPRETRN=IOPGOOD/* IF EXTENDED OK               */ 00208000
*                   THEN            /*                               */ 00209000
         CLI   IOPRETRN(IOPPTR),0                                  0213 00210000
         BNE   @RF00213                                            0213 00211000
*                   DO;             /*                               */ 00212000
*                     CALL XRFPTFP1;/* PROCESS PTF ENTRY             */ 00213000
         BAL   @14,XRFPTFP1                                        0215 00214000
*                     RFY                                          0216 00215000
*                       RTNCODE RSTD;/*                              */ 00216000
*                     XRFRTNCD=MAX(XRFRTNCD,RTNCODE);/* SAVE RC      */ 00217000
         CR    XRFRTNCD,RTNCODE                                    0217 00218000
         BNL   *+6                                                      00219000
         LR    XRFRTNCD,RTNCODE                                    0217 00220000
*                     RFY                                          0218 00221000
*                       RTNCODE UNRSTD;/*                            */ 00222000
*                   END;            /* END EXTEND OK                 */ 00223000
*                 ELSE              /* IF EXTEND NOT OK              */ 00224000
*                   XRFRTNCD=MAX(XRFRTNCD,IOPRETRN);/*               */ 00225000
         B     @RC00213                                            0220 00226000
@RF00213 SLR   @10,@10                                             0220 00227000
         IC    @10,IOPRETRN(,IOPPTR)                               0220 00228000
         CR    XRFRTNCD,@10                                        0220 00229000
         BNL   *+6                                                      00230000
         LR    XRFRTNCD,@10                                        0220 00231000
*               END;                /* END ENTRY IS PTF              */ 00232000
@RC00213 DS    0H                                                  0222 00233000
*       END;                        /* END ENTRY FOUND               */ 00234000
*                                                                  0222 00235000
@RF00209 DS    0H                                                  0222 00236000
@RC00196 DS    0H                                                  0222 00237000
@RC00183 DS    0H                                                  0223 00238000
*     /***************************************************************/ 00239000
*     /*                                                             */ 00240000
*     /* END OF PROCESSING ONE MEMBER OF DS. GO TO TOP OF READ LOOP  */ 00241000
*     /*                                                             */ 00242000
*     /***************************************************************/ 00243000
*                                                                  0223 00244000
*   END;                            /* END DIRECTORY READ LOOP       */ 00245000
@RF00181 DS    0H                                                  0223 00246000
@DE00178 CLI   IOPRETRN(IOPPTR),0                                  0223 00247000
         BNE   @DC00178                                            0223 00248000
         CH    XRFRTNCD,@CH00235                                   0223 00249000
         BL    @DL00178                                            0223 00250000
@DC00178 DS    0H                                                  0224 00251000
         EJECT                                                          00252000
*                                                                  0224 00253000
*   /*****************************************************************/ 00254000
*   /*                                                               */ 00255000
*   /* IF READ ERROR ENDED LOOP SET RC NOW                           */ 00256000
*   /*                                                               */ 00257000
*   /*****************************************************************/ 00258000
*                                                                  0224 00259000
*   IF IOPRETRN>IOPEOF              /* IF SEVERE ERROR               */ 00260000
*     THEN                          /*                               */ 00261000
         CLI   IOPRETRN(IOPPTR),4                                  0224 00262000
         BNH   @RF00224                                            0224 00263000
*     XRFRTNCD=MAX(XRFRTNCD,IOPRETRN);/* SAVE RC                     */ 00264000
*                                                                  0225 00265000
         SLR   @10,@10                                             0225 00266000
         IC    @10,IOPRETRN(,IOPPTR)                               0225 00267000
         CR    XRFRTNCD,@10                                        0225 00268000
         BNL   *+6                                                      00269000
         LR    XRFRTNCD,@10                                        0225 00270000
*   /*****************************************************************/ 00271000
*   /*                                                               */ 00272000
*   /* CALL ROUTINE TO FREE ALL WORK AREAS                           */ 00273000
*   /*                                                               */ 00274000
*   /*****************************************************************/ 00275000
*                                                                  0226 00276000
*   CALL XRFCLEAN;                  /*                               */ 00277000
@RF00224 BAL   @14,XRFCLEAN                                        0226 00278000
*   RFY                                                            0227 00279000
*     RTNCODE RSTD;                 /*                               */ 00280000
*   XRFRTNCD=MAX(XRFRTNCD,RTNCODE); /* SAVE RC                       */ 00281000
         CR    XRFRTNCD,RTNCODE                                    0228 00282000
         BNL   *+6                                                      00283000
         LR    XRFRTNCD,RTNCODE                                    0228 00284000
*   RFY                                                            0229 00285000
*     RTNCODE UNRSTD;               /*                               */ 00286000
*                                                                  0229 00287000
*   /*****************************************************************/ 00288000
*   /*                                                               */ 00289000
*   /* RETURN WITH CODE SET UP DURING PROCESSING                     */ 00290000
*   /*                                                               */ 00291000
*   /*****************************************************************/ 00292000
*                                                                  0230 00293000
*   RETURN CODE(XRFRTNCD);          /*                               */ 00294000
         LR    @15,XRFRTNCD                                        0230 00295000
         L     @13,4(,@13)                                         0230 00296000
         L     @14,12(,@13)                                        0230 00297000
         LM    @00,@12,20(@13)                                     0230 00298000
         BR    @14                                                 0230 00299000
         EJECT                                                          00300000
*                                                                  0231 00301000
*   /*****************************************************************/ 00302000
*   /*                                                               */ 00303000
*   /* HMASMXRF INITIALIZTATION CODE                                 */ 00304000
*   /*                                                               */ 00305000
*   /*****************************************************************/ 00306000
*                                                                  0231 00307000
*XRFINIT:                           /*                               */ 00308000
*   PROCEDURE;                      /*                               */ 00309000
XRFINIT  STM   @14,@01,@SA00002                                    0231 00310000
         ST    @03,@SA00002+16                                     0231 00311000
         STM   @05,@12,@SA00002+20                                 0231 00312000
*   DECLARE                         /*                               */ 00313000
*     INITRC FIXED(8);              /*                               */ 00314000
*   RFY                                                            0233 00315000
*     HMASMIOP BASED(IOPPTR);       /* MAIN IOP                      */ 00316000
*   INITRC=ZERO;                    /* INIT PROC RTN CODE            */ 00317000
*                                                                  0234 00318000
         SLR   INITRC,INITRC                                       0234 00319000
*   /*****************************************************************/ 00320000
*   /*                                                               */ 00321000
*   /* SAVE SET GTPBUFAD IF IN SELECT                                */ 00322000
*   /*                                                               */ 00323000
*   /*****************************************************************/ 00324000
*                                                                  0235 00325000
*   RFY                                                            0235 00326000
*     HMASMGTP BASED(SETPTR);       /* XRF GTP                       */ 00327000
*   IF LISTSEL=ON                   /* IF IN SELECT                  */ 00328000
*     THEN                          /*                               */ 00329000
         L     @10,@PC00001                                        0236 00330000
         TM    LISTSEL(@10),B'10000000'                            0236 00331000
         BNO   @RF00236                                            0236 00332000
*     DO;                           /*                               */ 00333000
*       SAVSETAD=GTPBUFAD;          /*                               */ 00334000
         MVC   SAVSETAD(4),GTPBUFAD(SETPTR)                        0238 00335000
*       GTPBUFAD=ADDR(HMASMSET);    /*                               */ 00336000
         LA    @10,HMASMSET                                        0239 00337000
         ST    @10,GTPBUFAD(,SETPTR)                               0239 00338000
*     END;                          /*                               */ 00339000
*                                                                  0240 00340000
*   /*****************************************************************/ 00341000
*   /*                                                               */ 00342000
*   /* INITIALIZE GTA FOR XRF RECORDS                                */ 00343000
*   /*                                                               */ 00344000
*   /*****************************************************************/ 00345000
*                                                                  0241 00346000
*   RFY                             /*                               */ 00347000
*     HMASMGTP BASED(GTPPTR);       /*                               */ 00348000
@RF00236 DS    0H                                                  0242 00349000
*   HMASMGTP=''B;                   /* ZERO GTA PARAMETER            */ 00350000
         XC    HMASMGTP(28,GTPPTR),HMASMGTP(GTPPTR)                0242 00351000
*   GTPBUFAD=ADDR(XRFRCD);          /* PTR TO BUFFER AREA            */ 00352000
         LA    @10,XRFRCD                                          0243 00353000
         ST    @10,GTPBUFAD(,GTPPTR)                               0243 00354000
*   GTPRCDLN=LENGTH(XRFRCD);        /* RCD LENGTH                    */ 00355000
         LA    @10,30                                              0244 00356000
         STH   @10,GTPRCDLN(,GTPPTR)                               0244 00357000
*   GTPKEYLN=LENGTH(XRFRCD);        /*                               */ 00358000
         STH   @10,GTPKEYLN(,GTPPTR)                               0245 00359000
*   GTPFUNCT=GTPADD;                /*                               */ 00360000
*                                                                  0246 00361000
         MVI   GTPFUNCT(GTPPTR),X'04'                              0246 00362000
*   /*****************************************************************/ 00363000
*   /*                                                               */ 00364000
*   /* GETMAIN IOP FOR MAIN DIRECTORY READ                           */ 00365000
*   /*                                                               */ 00366000
*   /*****************************************************************/ 00367000
*                                                                  0247 00368000
*   SPLFUNCT=SPLGMIOP;              /* SET TO GETMAIN IOP            */ 00369000
         MVI   SPLFUNCT,X'03'                                      0247 00370000
*   CALL HMASMSUB(HMASMSPL);        /* CALL GETMAIN IOP ROUTINE      */ 00371000
         L     @15,@CV01451                                        0248 00372000
         LA    @01,@AL00248                                        0248 00373000
         BALR  @14,@15                                             0248 00374000
*   RFY                                                            0249 00375000
*     RTNCODE RSTD;                 /*                               */ 00376000
*   IF RTNCODE=ZERO                 /* IF GETMAIN OK                 */ 00377000
*     THEN                          /*                               */ 00378000
         LTR   RTNCODE,RTNCODE                                     0250 00379000
         BNZ   @RF00250                                            0250 00380000
*     IOPPTR=SPLPMAD;               /* SET PTR TO IOP                */ 00381000
         L     IOPPTR,SPLPMAD                                      0251 00382000
*   ELSE                            /*                               */ 00383000
*     INITRC=STOPFUNC;              /* STOP LIST                     */ 00384000
         B     @RC00250                                            0252 00385000
@RF00250 LA    INITRC,12                                           0252 00386000
*   RFY                                                            0253 00387000
*     RTNCODE UNRSTD;               /*                               */ 00388000
*                                                                  0253 00389000
@RC00250 DS    0H                                                  0254 00390000
*   /*****************************************************************/ 00391000
*   /*                                                               */ 00392000
*   /* GETMAIN SECOND IOP FOR MACRO LOCATES                          */ 00393000
*   /*                                                               */ 00394000
*   /*****************************************************************/ 00395000
*                                                                  0254 00396000
*   IF INITRC=ZERO                  /*                               */ 00397000
*     THEN                          /*                               */ 00398000
         CH    INITRC,@CH00307                                     0254 00399000
         BNE   @RF00254                                            0254 00400000
*     DO;                           /*                               */ 00401000
*       CALL HMASMSUB(HMASMSPL);    /* CALL GETMAIN IOP ROUTINE      */ 00402000
         L     @15,@CV01451                                        0256 00403000
         LA    @01,@AL00256                                        0256 00404000
         BALR  @14,@15                                             0256 00405000
*       RFY                                                        0257 00406000
*         RTNCODE RSTD;             /*                               */ 00407000
*       IF RTNCODE=ZERO             /* IF GETMAIN OK                 */ 00408000
*         THEN                      /*                               */ 00409000
         LTR   RTNCODE,RTNCODE                                     0258 00410000
         BNZ   @RF00258                                            0258 00411000
*         IOPPTR2=SPLPMAD;          /* SET IOP2 PTR                  */ 00412000
         L     IOPPTR2,SPLPMAD                                     0259 00413000
*       ELSE                        /*                               */ 00414000
*         INITRC=STOPFUNC;          /* STOP LIST                     */ 00415000
         B     @RC00258                                            0260 00416000
@RF00258 LA    INITRC,12                                           0260 00417000
*     END;                          /*                               */ 00418000
@RC00258 DS    0H                                                  0262 00419000
*   RFY                                                            0262 00420000
*     RTNCODE UNRSTD;               /*                               */ 00421000
*                                                                  0262 00422000
@RF00254 DS    0H                                                  0263 00423000
*   /*****************************************************************/ 00424000
*   /*                                                               */ 00425000
*   /* CLOSE SPECIFIED DATA SET FOR GET NEXT PROCESSING              */ 00426000
*   /*                                                               */ 00427000
*   /*****************************************************************/ 00428000
*                                                                  0263 00429000
*   IF INITRC=ZERO                  /* IF IOP GETMAINED OK           */ 00430000
*     THEN                          /*                               */ 00431000
         CH    INITRC,@CH00307                                     0263 00432000
         BNE   @RF00263                                            0263 00433000
*     DO;                           /*                               */ 00434000
*       IF LISTCDS=ON               /* IF LIST OF CDS                */ 00435000
*         THEN                      /*                               */ 00436000
         L     @10,@PC00001                                        0265 00437000
         TM    LISTCDS(@10),B'01000000'                            0265 00438000
         BNO   @RF00265                                            0265 00439000
*         IOPDSID=IOPCDS;           /* SET DATASET ID                */ 00440000
         MVI   IOPDSID(IOPPTR),X'02'                               0266 00441000
*       ELSE                        /*                               */ 00442000
*         IOPDSID=IOPACDS;          /* SET DATASET ID                */ 00443000
         B     @RC00265                                            0267 00444000
@RF00265 MVI   IOPDSID(IOPPTR),X'0C'                               0267 00445000
*       IOPFUNCT=IOPCLOSN;          /* SET TO CLOSE DIRECTORY        */ 00446000
@RC00265 MVI   IOPFUNCT(IOPPTR),X'0C'                              0268 00447000
*       CALL HMASMIO(HMASMIOP);     /* DO CLOSE                      */ 00448000
         ST    IOPPTR,@AL00001                                     0269 00449000
         L     @15,@CV01450                                        0269 00450000
         LA    @01,@AL00001                                        0269 00451000
         BALR  @14,@15                                             0269 00452000
*       INITRC=MAX(INITRC,IOPRETRN);/* SAVE RC                       */ 00453000
         SLR   @10,@10                                             0270 00454000
         IC    @10,IOPRETRN(,IOPPTR)                               0270 00455000
         CR    INITRC,@10                                          0270 00456000
         BNL   *+6                                                      00457000
         LR    INITRC,@10                                          0270 00458000
*     END;                          /*                               */ 00459000
*   RETURN CODE(INITRC);            /*                               */ 00460000
@RF00263 LR    @15,INITRC                                          0272 00461000
         L     @14,@SA00002                                        0272 00462000
         LM    @00,@01,@SA00002+8                                  0272 00463000
         L     @03,@SA00002+16                                     0272 00464000
         LM    @05,@12,@SA00002+20                                 0272 00465000
         BR    @14                                                 0272 00466000
*   END XRFINIT;                    /*                               */ 00467000
         EJECT                                                          00468000
*                                                                  0274 00469000
*   /*****************************************************************/ 00470000
*   /*                                                               */ 00471000
*   /* ROUTINE TO BUILD RECORDS FOR MACS USED IN ASSEMS. NOTE THAT   */ 00472000
*   /* TWO RECORDS ARE BUILT FOR EACH MACRO NAME, ONE FOR THE ASSEM  */ 00473000
*   /* CDS ENTRY AND ONE FOR THE SRC CDS ENTRY SINCE AT THIS TIME IT */ 00474000
*   /* IS NOT KNOWN WHICH ONE WILL BE PRESENT IN THE CDS. ONLY THE   */ 00475000
*   /* ONE PRESENT WILL BE FORMATTED.                                */ 00476000
*   /*                                                               */ 00477000
*   /*****************************************************************/ 00478000
*                                                                  0274 00479000
*XRFMACP1:                          /*                               */ 00480000
*   PROCEDURE;                      /*                               */ 00481000
XRFMACP1 STM   @14,@12,@SA00003                                    0274 00482000
*   DECLARE                         /*                               */ 00483000
*     MACRC FIXED(8);               /*                               */ 00484000
*   DECLARE                         /*                               */ 00485000
*     MACX1 FIXED(31);              /*                               */ 00486000
*   RFY                                                            0277 00487000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00488000
*   MACRC=ZERO;                     /*                               */ 00489000
         SLR   MACRC,MACRC                                         0278 00490000
*   XRFRCD1=''B;                    /*                               */ 00491000
         XC    XRFRCD1(30),XRFRCD1                                 0279 00492000
*   XRF1MAC=IOPNAME;                /*                               */ 00493000
         MVC   XRF1MAC(8),IOPNAME(IOPPTR)                          0280 00494000
*   DO MACX1=1 BY 1 WHILE(          /*                               */ 00495000
*         IOPMACND(MACX1)¬=IOPEOLST /* LOOP THRU MAC                 */ 00496000
*         &MACRC=ZERO);             /*                               */ 00497000
         LA    MACX1,1                                             0281 00498000
         B     @DE00281                                            0281 00499000
@DL00281 DS    0H                                                  0282 00500000
*     IF IOPMCIND(MACX1)=IOPMASMS   /* IF ASSEMBLY                   */ 00501000
*       THEN                        /*                               */ 00502000
         LR    @10,MACX1                                           0282 00503000
         MH    @10,@CH00490                                        0282 00504000
         SLR   @07,@07                                             0282 00505000
         IC    @07,IOPMCIND-9(@10,IOPPTR)                          0282 00506000
         CH    @07,@CH00041                                        0282 00507000
         BNE   @RF00282                                            0282 00508000
*       DO;                         /*                               */ 00509000
*         XRFETYPE=IOPASM;          /*                               */ 00510000
         MVI   XRFETYPE,X'01'                                      0284 00511000
*         XRFRTYPE=XRFASMMC;        /* MAC TO ASSEM TYPE RCD         */ 00512000
         MVI   XRFRTYPE,X'0A'                                      0285 00513000
*         XRF1ASM=IOPMCASM(MACX1);  /*                               */ 00514000
         ALR   @10,IOPPTR                                          0286 00515000
         MVC   XRF1ASM(8),IOPMCASM-9(@10)                          0286 00516000
*         CALL XRFRCDAD;            /* ADD RCD TO FILE               */ 00517000
         BAL   @14,XRFRCDAD                                        0287 00518000
*         RFY                                                      0288 00519000
*           RTNCODE RSTD;           /*                               */ 00520000
*         MACRC=MAX(MACRC,RTNCODE); /* SAVE RC                       */ 00521000
         CR    MACRC,RTNCODE                                       0289 00522000
         BNL   *+6                                                      00523000
         LR    MACRC,RTNCODE                                       0289 00524000
*         RFY                                                      0290 00525000
*           RTNCODE UNRSTD;         /*                               */ 00526000
*         IF MACRC=ZERO             /* BUILD SAME IN CASE SRC        */ 00527000
*           THEN                    /*                               */ 00528000
         CH    MACRC,@CH00307                                      0291 00529000
         BNE   @RF00291                                            0291 00530000
*           DO;                     /*                               */ 00531000
*             XRFETYPE=IOPSRC;      /*                               */ 00532000
         MVI   XRFETYPE,X'08'                                      0293 00533000
*             XRFRTYPE=XRFSRCMC;    /* MAC TO ASSEM TYPE RCD         */ 00534000
         MVI   XRFRTYPE,X'35'                                      0294 00535000
*             CALL XRFRCDAD;        /* ADD RCD TO FILE               */ 00536000
         BAL   @14,XRFRCDAD                                        0295 00537000
*             RFY                                                  0296 00538000
*               RTNCODE RSTD;       /*                               */ 00539000
*             MACRC=MAX(MACRC,RTNCODE);/* SAVE RC                    */ 00540000
         CR    MACRC,RTNCODE                                       0297 00541000
         BNL   *+6                                                      00542000
         LR    MACRC,RTNCODE                                       0297 00543000
*             RFY                                                  0298 00544000
*               RTNCODE UNRSTD;     /*                               */ 00545000
*           END;                    /*                               */ 00546000
*       END;                        /*                               */ 00547000
@RF00291 DS    0H                                                  0301 00548000
*   END;                            /*                               */ 00549000
@RF00282 AH    MACX1,@CH00041                                      0301 00550000
@DE00281 LR    @10,MACX1                                           0301 00551000
         MH    @10,@CH00490                                        0301 00552000
         SLR   @07,@07                                             0301 00553000
         IC    @07,IOPMACND-9(@10,IOPPTR)                          0301 00554000
         CH    @07,@CH00679                                        0301 00555000
         BE    @DC00281                                            0301 00556000
         CH    MACRC,@CH00307                                      0301 00557000
         BE    @DL00281                                            0301 00558000
@DC00281 DS    0H                                                  0302 00559000
*   RETURN CODE(MACRC);             /*                               */ 00560000
         LR    @15,MACRC                                           0302 00561000
         L     @14,@SA00003                                        0302 00562000
         LM    @00,@12,@SA00003+8                                  0302 00563000
         BR    @14                                                 0302 00564000
*   END XRFMACP1;                   /*                               */ 00565000
         EJECT                                                          00566000
*                                                                  0304 00567000
*   /*****************************************************************/ 00568000
*   /*                                                               */ 00569000
*   /* ROUTINE TO BUILD RECORDS FOR MODS USED IN LMODS               */ 00570000
*   /*                                                               */ 00571000
*   /*****************************************************************/ 00572000
*                                                                  0304 00573000
*XRFMODP1:                          /*                               */ 00574000
*   PROCEDURE;                      /*                               */ 00575000
XRFMODP1 STM   @14,@12,@SA00004                                    0304 00576000
*   DECLARE                         /*                               */ 00577000
*     MODRC FIXED(8);               /*                               */ 00578000
*   DECLARE                         /*                               */ 00579000
*     MODX1 FIXED(31);              /*                               */ 00580000
*   RFY                                                            0307 00581000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00582000
*   MODRC=ZERO;                     /*                               */ 00583000
         SLR   MODRC,MODRC                                         0308 00584000
*   XRFRCD2=''B;                    /*                               */ 00585000
         XC    XRFRCD2(30),XRFRCD2                                 0309 00586000
*   XRFETYPE=IOPLMD;                /*                               */ 00587000
         MVI   XRFETYPE,X'02'                                      0310 00588000
*   XRF2MOD=IOPNAME;                /*                               */ 00589000
         MVC   XRF2MOD(8),IOPNAME(IOPPTR)                          0311 00590000
*   XRFRTYPE=XRFLMDMD;              /* LMOD TO MOD TYPE              */ 00591000
         MVI   XRFRTYPE,X'14'                                      0312 00592000
*   DO MODX1=1 BY 1 WHILE(          /*                               */ 00593000
*         IOPMODND(MODX1)¬=IOPEOLST /* LOOP THRU MOD                 */ 00594000
*         &MODRC=ZERO);             /*                               */ 00595000
         LA    MODX1,1                                             0313 00596000
         B     @DE00313                                            0313 00597000
@DL00313 DS    0H                                                  0314 00598000
*     IF IOPMDIND(MODX1)=IOPMDLMD   /* IF LMOD                       */ 00599000
*       THEN                        /*                               */ 00600000
         LR    @10,MODX1                                           0314 00601000
         MH    @10,@CH00490                                        0314 00602000
         SLR   @07,@07                                             0314 00603000
         IC    @07,IOPMDIND-9(@10,IOPPTR)                          0314 00604000
         CH    @07,@CH00041                                        0314 00605000
         BNE   @RF00314                                            0314 00606000
*       DO;                         /*                               */ 00607000
*         XRF2LMD=IOPLMODS(MODX1);  /*                               */ 00608000
         ALR   @10,IOPPTR                                          0316 00609000
         MVC   XRF2LMD(8),IOPLMODS-9(@10)                          0316 00610000
*         CALL XRFRCDAD;            /* ADD RCD TO FILE               */ 00611000
         BAL   @14,XRFRCDAD                                        0317 00612000
*         RFY                                                      0318 00613000
*           RTNCODE RSTD;           /*                               */ 00614000
*         MODRC=MAX(MODRC,RTNCODE); /* SAVE RC                       */ 00615000
         CR    MODRC,RTNCODE                                       0319 00616000
         BNL   *+6                                                      00617000
         LR    MODRC,RTNCODE                                       0319 00618000
*         RFY                                                      0320 00619000
*           RTNCODE UNRSTD;         /*                               */ 00620000
*       END;                        /*                               */ 00621000
*   END;                            /*                               */ 00622000
@RF00314 AH    MODX1,@CH00041                                      0322 00623000
@DE00313 LR    @10,MODX1                                           0322 00624000
         MH    @10,@CH00490                                        0322 00625000
         SLR   @07,@07                                             0322 00626000
         IC    @07,IOPMODND-9(@10,IOPPTR)                          0322 00627000
         CH    @07,@CH00679                                        0322 00628000
         BE    @DC00313                                            0322 00629000
         CH    MODRC,@CH00307                                      0322 00630000
         BE    @DL00313                                            0322 00631000
@DC00313 DS    0H                                                  0323 00632000
*   RETURN CODE(MODRC);             /*                               */ 00633000
         LR    @15,MODRC                                           0323 00634000
         L     @14,@SA00004                                        0323 00635000
         LM    @00,@12,@SA00004+8                                  0323 00636000
         BR    @14                                                 0323 00637000
*   END XRFMODP1;                   /*                               */ 00638000
         EJECT                                                          00639000
*                                                                  0325 00640000
*   /*****************************************************************/ 00641000
*   /*                                                               */ 00642000
*   /* ROUTINE CALLED TO BUILD RCD FOR EACH SUB-ELENT IN THE PASSED  */ 00643000
*   /* PTF ENTRY                                                     */ 00644000
*   /*                                                               */ 00645000
*   /*****************************************************************/ 00646000
*                                                                  0325 00647000
*XRFPTFP1:                          /*                               */ 00648000
*   PROCEDURE;                      /*                               */ 00649000
XRFPTFP1 STM   @14,@12,@SA00005                                    0325 00650000
*   DECLARE                         /*                               */ 00651000
*     PTFRC FIXED(8);               /*                               */ 00652000
*   DECLARE                         /*                               */ 00653000
*     PASS1X FIXED(31),             /* LOOP INDEX                    */ 00654000
*     PASS1Y FIXED(31);             /* LOOP INDEX                    */ 00655000
*   RFY                                                            0328 00656000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00657000
*                                                                  0328 00658000
*   /*****************************************************************/ 00659000
*   /*                                                               */ 00660000
*   /* CHECK STATUS OF PTF AND SET FIELD IN RCD                      */ 00661000
*   /*                                                               */ 00662000
*   /*****************************************************************/ 00663000
*                                                                  0329 00664000
*   PTFRC=ZERO;                     /*                               */ 00665000
*                                                                  0329 00666000
         SLR   PTFRC,PTFRC                                         0329 00667000
*   /*****************************************************************/ 00668000
*   /*                                                               */ 00669000
*   /* LOOP THRU PTF PROCESSING EACH SUB-ELEMENT PROCESS EACH        */ 00670000
*   /* SUB-ELEMENT IF ITS TYPE WAS SPECIFIED TO BE PROCESSED ON THE  */ 00671000
*   /* PARAMETER. FOR MAC AND SRC INSURE THAT IF MOD WAS SPECIFIED IN*/ 00672000
*   /* THE PARAMETER THAT THEY ARE PROCESSED FOR THE RESULTING       */ 00673000
*   /* ASSEMBLIES                                                    */ 00674000
*   /*                                                               */ 00675000
*   /*****************************************************************/ 00676000
*                                                                  0330 00677000
*   DO PASS1X=1 BY 1 WHILE          /* LOOP THRU PTF                 */ 00678000
*         (IOPPTFND(PASS1X)¬=IOPEOLST/* TILL END                     */ 00679000
*         &PTFRC<STOPFUNC);         /* AND FILE RCD STORED OK        */ 00680000
         LA    PASS1X,1                                            0330 00681000
         B     @DE00330                                            0330 00682000
@DL00330 DS    0H                                                  0331 00683000
*     XRFRCD=''B;                   /* ZERO XREF RCD                 */ 00684000
         XC    XRFRCD(30),XRFRCD                                   0331 00685000
*     XRFENAME=IOPPMODS(PASS1X);    /* MOVE NAME TO ENTRY            */ 00686000
         LR    @10,PASS1X                                          0332 00687000
         MH    @10,@CH00490                                        0332 00688000
         ALR   @10,IOPPTR                                          0332 00689000
         MVC   XRFENAME(8),IOPPMODS-9(@10)                         0332 00690000
*     IF LISTCDS=ON                 /* IF CDS LIST                   */ 00691000
*       THEN                        /*                               */ 00692000
         L     @10,@PC00001                                        0333 00693000
         TM    LISTCDS(@10),B'01000000'                            0333 00694000
         BNO   @RF00333                                            0333 00695000
*       DO;                         /*                               */ 00696000
*         XRF3DAT=IOPAPPD;          /* USE APPLY DATE                */ 00697000
         MVC   XRF3DAT(3),IOPAPPD(IOPPTR)                          0335 00698000
*         XRF3TIM=IOPAPPT;          /* AND TIME                      */ 00699000
         MVC   XRF3TIM(3),IOPAPPT(IOPPTR)                          0336 00700000
*       END;                        /*                               */ 00701000
*     ELSE                          /* IF ACDS                       */ 00702000
*       DO;                         /*                               */ 00703000
         B     @RC00333                                            0338 00704000
@RF00333 DS    0H                                                  0339 00705000
*         XRF3DAT=IOPACCD;          /* USE ACCEPT DATE               */ 00706000
         MVC   XRF3DAT(3),IOPACCD(IOPPTR)                          0339 00707000
*         XRF3TIM=IOPACCT;          /* AND TIME                      */ 00708000
         MVC   XRF3TIM(3),IOPACCT(IOPPTR)                          0340 00709000
*       END;                        /*                               */ 00710000
*     XRF3PF1=IOPPTFF1;             /* PTF STATUS BYTE               */ 00711000
@RC00333 MVC   XRF3PF1(1),IOPPTFF1(IOPPTR)                         0342 00712000
*     XRF3PF3=IOPPTFF3;             /* PTF OTHER FLAGS               */ 00713000
         MVC   XRF3PF3(1),IOPPTFF3(IOPPTR)                         0343 00714000
*     XRF3PTF=IOPNAM17;             /* PTF NUMBER                    */ 00715000
         MVC   XRF3PTF(7),IOPNAM17(IOPPTR)                         0344 00716000
*     XRF3PIND=IOPPIND(PASS1X);     /* SAVE ACTUAL TYPE CODE         */ 00717000
         LR    @10,PASS1X                                          0345 00718000
         MH    @10,@CH00490                                        0345 00719000
         SLR   @07,@07                                             0345 00720000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0345 00721000
         STC   @07,XRF3PIND                                        0345 00722000
*                                                                  0346 00723000
*     /***************************************************************/ 00724000
*     /*                                                             */ 00725000
*     /* IF MOD TYPE SUBELENT AND MOD XREF REQUESTED                 */ 00726000
*     /*                                                             */ 00727000
*     /***************************************************************/ 00728000
*                                                                  0346 00729000
*     IF(LISTMOD=ON|LISTALL2=ON)    /* IF MOD LIST REQUESTED         */ 00730000
*         &                         /* AND                           */ 00731000
*         (IOPPIND(PASS1X)=IOPPMOD  /* THIS IS MOD REP               */ 00732000
*         |IOPPIND(PASS1X)=IOPPZAP  /* OR ZAP                        */ 00733000
*         |IOPPIND(PASS1X)=IOPPXPD  /* OR EXPAND ZAP                 */ 00734000
*         |IOPPIND(PASS1X)=IOPPASM  /* OR ASSEMBLY                   */ 00735000
*         |IOPPIND(PASS1X)=IOPPRMOD /* THIS IS REG MOD REP   @ZA26723*/ 00736000
*         |IOPPIND(PASS1X)=IOPPRZAP /* OR REG ZAP            @ZA26723*/ 00737000
*         |IOPPIND(PASS1X)=IOPPRXPD)/* OR REG EXPAND ZAP     @ZA26723*/ 00738000
*       THEN                        /*                               */ 00739000
         L     @10,@PC00001                                        0346 00740000
         TM    LISTMOD(@10),B'10001000'                            0346 00741000
         BZ    @RF00346                                            0346 00742000
         CH    @07,@CH00041                                        0346 00743000
         BE    @RT00346                                            0346 00744000
         CH    @07,@CH00049                                        0346 00745000
         BE    @RT00346                                            0346 00746000
         CH    @07,@CH00082                                        0346 00747000
         BE    @RT00346                                            0346 00748000
         CH    @07,@CH00084                                        0346 00749000
         BE    @RT00346                                            0346 00750000
         CH    @07,@CH00571                                        0346 00751000
         BE    @RT00346                                            0346 00752000
         CH    @07,@CH00573                                        0346 00753000
         BE    @RT00346                                            0346 00754000
         CH    @07,@CH00575                                        0346 00755000
         BNE   @RF00346                                            0346 00756000
@RT00346 DS    0H                                                  0347 00757000
*       DO;                         /*                               */ 00758000
*         SKIP=OFF;                 /* DO NOT SKIP THIS ELEMENT      */ 00759000
         NI    SKIP,B'01111111'                                    0348 00760000
*         IF IOPPIND(PASS1X)=IOPPMOD/* IF MOD                        */ 00761000
*             |IOPPIND(PASS1X)=IOPPRMOD/* OR REGRESSED MOD           */ 00762000
*           THEN                    /*                               */ 00763000
         LR    @10,PASS1X                                          0349 00764000
         MH    @10,@CH00490                                        0349 00765000
         SLR   @07,@07                                             0349 00766000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0349 00767000
         CH    @07,@CH00041                                        0349 00768000
         BE    @RT00349                                            0349 00769000
         CH    @07,@CH00571                                        0349 00770000
         BNE   @RF00349                                            0349 00771000
@RT00349 DS    0H                                                  0350 00772000
*           DO;                     /*                               */ 00773000
*             DO PASS1Y=1 BY 1 WHILE(/* CHECK TO SEE IF THERE IS     */ 00774000
*                   IOPPTFND(PASS1Y)¬=IOPEOLST/* AN ASSEM ENTRY IN 0351 00775000
*                                      PTF                           */ 00776000
*                   &(IOPPIND(PASS1Y)¬=IOPPASM/* FOR SAME ELEMENT    */ 00777000
*                   |IOPPMODS(PASS1Y)¬=IOPPMODS(PASS1X)));/*         */ 00778000
         LA    PASS1Y,1                                            0351 00779000
         B     @DE00351                                            0351 00780000
@DL00351 DS    0H                                                  0352 00781000
*             END;                  /*                               */ 00782000
         AH    PASS1Y,@CH00041                                     0352 00783000
@DE00351 LA    @10,9                                               0352 00784000
         LR    @01,PASS1Y                                          0352 00785000
         MR    @00,@10                                             0352 00786000
         SLR   @00,@00                                             0352 00787000
         IC    @00,IOPPTFND-9(@01,IOPPTR)                          0352 00788000
         CH    @00,@CH00679                                        0352 00789000
         BE    @DC00351                                            0352 00790000
         SLR   @00,@00                                             0352 00791000
         IC    @00,IOPPIND-9(@01,IOPPTR)                           0352 00792000
         CH    @00,@CH00084                                        0352 00793000
         BNE   @DL00351                                            0352 00794000
         LR    @09,@10                                             0352 00795000
         MR    @08,PASS1X                                          0352 00796000
         ALR   @01,IOPPTR                                          0352 00797000
         ALR   @09,IOPPTR                                          0352 00798000
         CLC   IOPPMODS-9(8,@01),IOPPMODS-9(@09)                   0352 00799000
         BNE   @DL00351                                            0352 00800000
@DC00351 DS    0H                                                  0353 00801000
*             IF IOPPTFND(PASS1Y)¬=IOPEOLST/* IF FOUND THEN          */ 00802000
*               THEN                /*                               */ 00803000
         LR    @10,PASS1Y                                          0353 00804000
         MH    @10,@CH00490                                        0353 00805000
         SLR   @15,@15                                             0353 00806000
         IC    @15,IOPPTFND-9(@10,IOPPTR)                          0353 00807000
         CH    @15,@CH00679                                        0353 00808000
         BE    @RF00353                                            0353 00809000
*               SKIP=ON;            /* SET TO SKIP THIS ELEMENT      */ 00810000
         OI    SKIP,B'10000000'                                    0354 00811000
*           END;                    /* END MOD/RMOD                  */ 00812000
@RF00353 DS    0H                                                  0356 00813000
*         IF SKIP=OFF               /* IF OK TO BUILD RECORD THEN    */ 00814000
*           THEN                    /*                               */ 00815000
@RF00349 TM    SKIP,B'10000000'                                    0356 00816000
         BNZ   @RF00356                                            0356 00817000
*           DO;                     /*                               */ 00818000
*             XRFETYPE=IOPMOD;      /* TYPE ELEMENT NAME             */ 00819000
         MVI   XRFETYPE,X'05'                                      0358 00820000
*             XRFRTYPE=XRFPBYMD;    /* PTFBY TYPE RECORD             */ 00821000
         MVI   XRFRTYPE,X'2F'                                      0359 00822000
*             XRF3PTYP=IOPPTYPE;    /* SYSMOD TYPE                   */ 00823000
         MVC   XRF3PTYP(1),IOPPTYPE(IOPPTR)                        0360 00824000
*             CALL XRFRCDAD;        /* ADD RCD TO FILE               */ 00825000
         BAL   @14,XRFRCDAD                                        0361 00826000
*             RFY                                                  0362 00827000
*               RTNCODE RSTD;       /*                               */ 00828000
*             PTFRC=MAX(PTFRC,RTNCODE);/* SAVE RC                    */ 00829000
         CR    PTFRC,RTNCODE                                       0363 00830000
         BNL   *+6                                                      00831000
         LR    PTFRC,RTNCODE                                       0363 00832000
*             RFY                                                  0364 00833000
*               RTNCODE UNRSTD;     /*                               */ 00834000
*           END;                    /*                               */ 00835000
*       END;                        /*                               */ 00836000
@RF00356 DS    0H                                                  0367 00837000
*                                                                  0367 00838000
*     /***************************************************************/ 00839000
*     /*                                                             */ 00840000
*     /* IF MAC TYPE SUBELENT AND MAC XREF REQUESTED                 */ 00841000
*     /*                                                             */ 00842000
*     /***************************************************************/ 00843000
*                                                                  0367 00844000
*     IF(LISTMAC=ON|LISTALL2=ON)    /* IF MAC LIST REQUEST           */ 00845000
*         &                         /* AND                           */ 00846000
*         (IOPPIND(PASS1X)=IOPPMACR /* THIS IS MAC REP               */ 00847000
*         |IOPPIND(PASS1X)=IOPPMACU /* OR MAC UPDATE                 */ 00848000
*         |IOPPIND(PASS1X)=IOPPRMCR /* THIS IS REG MAC REP   @ZA26723*/ 00849000
*         |IOPPIND(PASS1X)=IOPPRMCU)/* OR REG MAC UPDATE     @ZA26723*/ 00850000
*       THEN                        /*                               */ 00851000
@RF00346 L     @10,@PC00001                                        0367 00852000
         TM    LISTMAC(@10),B'10010000'                            0367 00853000
         BZ    @RF00367                                            0367 00854000
         LR    @10,PASS1X                                          0367 00855000
         MH    @10,@CH00490                                        0367 00856000
         SLR   @07,@07                                             0367 00857000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0367 00858000
         CH    @07,@CH00100                                        0367 00859000
         BE    @RT00367                                            0367 00860000
         CH    @07,@CH00066                                        0367 00861000
         BE    @RT00367                                            0367 00862000
         CH    @07,@CH00577                                        0367 00863000
         BE    @RT00367                                            0367 00864000
         CH    @07,@CH00579                                        0367 00865000
         BNE   @RF00367                                            0367 00866000
@RT00367 DS    0H                                                  0368 00867000
*       DO;                         /*                               */ 00868000
*         XRFETYPE=IOPMAC;          /* TYPE ELEMENT NAME             */ 00869000
         MVI   XRFETYPE,X'03'                                      0369 00870000
*         XRFRTYPE=XRFPBYMC;        /* PTFBY TYPE RECORD             */ 00871000
         MVI   XRFRTYPE,X'25'                                      0370 00872000
*         XRF3PTYP=IOPPTYPE;        /* SYSMOD TYPE                   */ 00873000
         MVC   XRF3PTYP(1),IOPPTYPE(IOPPTR)                        0371 00874000
*         CALL XRFRCDAD;            /* ADD RCD TO FILE               */ 00875000
         BAL   @14,XRFRCDAD                                        0372 00876000
*         RFY                                                      0373 00877000
*           RTNCODE RSTD;           /*                               */ 00878000
*         PTFRC=MAX(PTFRC,RTNCODE); /* SAVE RC                       */ 00879000
         CR    PTFRC,RTNCODE                                       0374 00880000
         BNL   *+6                                                      00881000
         LR    PTFRC,RTNCODE                                       0374 00882000
*         RFY                                                      0375 00883000
*           RTNCODE UNRSTD;         /*                               */ 00884000
*       END;                        /*                               */ 00885000
*                                                                  0377 00886000
*     /***************************************************************/ 00887000
*     /*                                                             */ 00888000
*     /* IF SRC TYPE SUBELENT AND SRC XREF REQUESTED                 */ 00889000
*     /*                                                             */ 00890000
*     /***************************************************************/ 00891000
*                                                                  0377 00892000
*     IF(LISTSRC=ON|LISTALL2=ON)    /* IF SRC LIST REQUEST           */ 00893000
*         &                         /* AND                           */ 00894000
*         (IOPPIND(PASS1X)=IOPPSRCR /* THIS IS SRC REP               */ 00895000
*         |IOPPIND(PASS1X)=IOPPSRCU /* OR SRC UPDATE                 */ 00896000
*         |IOPPIND(PASS1X)=IOPPRSCR /* THIS IS REG SRC REP   @ZA26723*/ 00897000
*         |IOPPIND(PASS1X)=IOPPRSCU)/* OR REG SRC UPDATE     @ZA26723*/ 00898000
*       THEN                        /*                               */ 00899000
@RF00367 L     @10,@PC00001                                        0377 00900000
         TM    LISTSRC(@10),B'10000100'                            0377 00901000
         BZ    @RF00377                                            0377 00902000
         LR    @10,PASS1X                                          0377 00903000
         MH    @10,@CH00490                                        0377 00904000
         SLR   @07,@07                                             0377 00905000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0377 00906000
         CH    @07,@CH00052                                        0377 00907000
         BE    @RT00377                                            0377 00908000
         CH    @07,@CH00295                                        0377 00909000
         BE    @RT00377                                            0377 00910000
         CH    @07,@CH00581                                        0377 00911000
         BE    @RT00377                                            0377 00912000
         CH    @07,@CH00583                                        0377 00913000
         BNE   @RF00377                                            0377 00914000
@RT00377 DS    0H                                                  0378 00915000
*       DO;                         /*                               */ 00916000
*         XRFETYPE=IOPSRC;          /* TYPE ELEMENT NAME             */ 00917000
         MVI   XRFETYPE,X'08'                                      0379 00918000
*         XRFRTYPE=XRFPBYSC;        /* PTFBY TYPE RECORD             */ 00919000
         MVI   XRFRTYPE,X'39'                                      0380 00920000
*         XRF3PTYP=IOPPTYPE;        /* SYSMOD TYPE                   */ 00921000
         MVC   XRF3PTYP(1),IOPPTYPE(IOPPTR)                        0381 00922000
*         CALL XRFRCDAD;            /* ADD RCD TO FILE               */ 00923000
         BAL   @14,XRFRCDAD                                        0382 00924000
*         RFY                                                      0383 00925000
*           RTNCODE RSTD;           /*                               */ 00926000
*         PTFRC=MAX(PTFRC,RTNCODE); /* SAVE RC                       */ 00927000
         CR    PTFRC,RTNCODE                                       0384 00928000
         BNL   *+6                                                      00929000
         LR    PTFRC,RTNCODE                                       0384 00930000
*         RFY                                                      0385 00931000
*           RTNCODE UNRSTD;         /*                               */ 00932000
*       END;                        /*                               */ 00933000
*                                                                  0387 00934000
*     /***************************************************************/ 00935000
*     /*                                                             */ 00936000
*     /* IF SYSMOD TYPE SUBELENT                                     */ 00937000
*     /*                                                             */ 00938000
*     /***************************************************************/ 00939000
*                                                                  0387 00940000
*     IF(LISTSMD=ON|LISTALL2=ON)    /* IF SYSMOD LIST                */ 00941000
*         &                         /* AND                           */ 00942000
*         IOPPIND(PASS1X)>IOPPTFS   /* SYSMOD TYPE SUBELEMENT        */ 00943000
*       THEN                        /*                               */ 00944000
@RF00377 L     @10,@PC00001                                        0387 00945000
         TM    LISTSMD(@10),B'10000000'                            0387 00946000
         BO    @GL00028                                            0387 00947000
         TM    LISTALL2(@10),B'10000000'                           0387 00948000
         BNO   @RF00387                                            0387 00949000
@GL00028 LR    @10,PASS1X                                          0387 00950000
         MH    @10,@CH00490                                        0387 00951000
         SLR   @07,@07                                             0387 00952000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0387 00953000
         CH    @07,@CH00916                                        0387 00954000
         BNH   @RF00387                                            0387 00955000
*       DO;                         /*                               */ 00956000
*         XRFRCD4=''B;              /* ZERO PTF BY RECORD            */ 00957000
         XC    XRFRCD4(29),XRFRCD4                                 0389 00958000
*         XRFETYPE=IOPSMD;          /* SYSMOD TYPE XRF RECORD        */ 00959000
         MVI   XRFETYPE,X'0B'                                      0390 00960000
*         XRF4PTF=IOPPMODS(PASS1X,1:7);/* MOVE RELATED SYSMOD NUM    */ 00961000
         MVI   XRF4PTF+7,C' '                                      0391 00962000
         ALR   @10,IOPPTR                                          0391 00963000
         MVC   XRF4PTF(7),IOPPMODS-9(@10)                          0391 00964000
*         XRFX4PTF=IOPNAM17;        /* MOVE MAIN SYSMOD NUMBER       */ 00965000
         MVC   XRFX4PTF(7),IOPNAM17(IOPPTR)                        0392 00966000
*         IF IOPPIND(PASS1X)=IOPPPRE/* CHECK TYPE SYSMOD NUMBER AND  */ 00967000
*           THEN                    /* SET XRF RCD TYPE              */ 00968000
         CH    @07,@CH01107                                        0393 00969000
         BNE   @RF00393                                            0393 00970000
*           XRFRTYPE=XRFPTPRE;      /*                               */ 00971000
         MVI   XRFRTYPE,X'73'                                      0394 00972000
*         ELSE                      /*                               */ 00973000
*           IF IOPPIND(PASS1X)=IOPPSUPV/*                            */ 00974000
*             THEN                  /* SET XRF RCD TYPE              */ 00975000
         B     @RC00393                                            0395 00976000
@RF00393 LR    @10,PASS1X                                          0395 00977000
         MH    @10,@CH00490                                        0395 00978000
         SLR   @07,@07                                             0395 00979000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0395 00980000
         CH    @07,@CH01111                                        0395 00981000
         BNE   @RF00395                                            0395 00982000
*             XRFRTYPE=XRFPTSUP;    /*                               */ 00983000
         MVI   XRFRTYPE,X'7D'                                      0396 00984000
*           ELSE                    /*                               */ 00985000
*             IF IOPPIND(PASS1X)=IOPPNPR/*                           */ 00986000
*               THEN                /* SET XRF RCD TYPE              */ 00987000
         B     @RC00395                                            0397 00988000
@RF00395 LR    @10,PASS1X                                          0397 00989000
         MH    @10,@CH00490                                        0397 00990000
         SLR   @07,@07                                             0397 00991000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0397 00992000
         CH    @07,@CH01109                                        0397 00993000
         BNE   @RF00397                                            0397 00994000
*               XRFRTYPE=XRFPTNPR;  /*                               */ 00995000
         MVI   XRFRTYPE,X'6E'                                      0398 00996000
*             ELSE                  /*                               */ 00997000
*               IF IOPPIND(PASS1X)=IOPPREQ/*                         */ 00998000
*                 THEN              /* SET XRF RCD TYPE              */ 00999000
         B     @RC00397                                            0399 01000000
@RF00397 LR    @10,PASS1X                                          0399 01001000
         MH    @10,@CH00490                                        0399 01002000
         SLR   @07,@07                                             0399 01003000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0399 01004000
         CH    @07,@CH01113                                        0399 01005000
         BNE   @RF00399                                            0399 01006000
*                 XRFRTYPE=XRFPTREQ;/*                               */ 01007000
         MVI   XRFRTYPE,X'78'                                      0400 01008000
*               ELSE                /*                               */ 01009000
*                 IF IOPPIND(PASS1X)=IOPPIRQ/*                       */ 01010000
*                   THEN            /* SET XRF RCD TYPE              */ 01011000
         B     @RC00399                                            0401 01012000
@RF00399 LR    @10,PASS1X                                          0401 01013000
         MH    @10,@CH00490                                        0401 01014000
         SLR   @07,@07                                             0401 01015000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0401 01016000
         CH    @07,@CH01115                                        0401 01017000
         BNE   @RF00401                                            0401 01018000
*                   XRFRTYPE=XRFPTIRQ;/*                             */ 01019000
         MVI   XRFRTYPE,X'69'                                      0402 01020000
*                 ELSE              /*                               */ 01021000
*                   IF IOPPIND(PASS1X)=IOPPDEL/* IF DELBY            */ 01022000
*                     THEN          /*                               */ 01023000
         B     @RC00401                                            0403 01024000
@RF00401 LR    @10,PASS1X                                          0403 01025000
         MH    @10,@CH00490                                        0403 01026000
         SLR   @07,@07                                             0403 01027000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0403 01028000
         CH    @07,@CH01119                                        0403 01029000
         BNE   @RF00403                                            0403 01030000
*                     XRFRTYPE=XRFPTDEL;/*                           */ 01031000
         MVI   XRFRTYPE,X'82'                                      0404 01032000
*                   ELSE            /*                               */ 01033000
*                     IF IOPPIND(PASS1X)=IOPPVER/* IF VERSION        */ 01034000
*                       THEN        /*                               */ 01035000
         B     @RC00403                                            0405 01036000
@RF00403 LR    @10,PASS1X                                          0405 01037000
         MH    @10,@CH00490                                        0405 01038000
         SLR   @07,@07                                             0405 01039000
         IC    @07,IOPPIND-9(@10,IOPPTR)                           0405 01040000
         CH    @07,@CH01121                                        0405 01041000
         BNE   @RF00405                                            0405 01042000
*                       XRFRTYPE=XRFPTVER;/*                         */ 01043000
         MVI   XRFRTYPE,X'87'                                      0406 01044000
*                     ELSE          /*                               */ 01045000
*                       XRFRTYPE=ZERO;/*                             */ 01046000
         B     @RC00405                                            0407 01047000
@RF00405 MVI   XRFRTYPE,X'00'                                      0407 01048000
*         IF XRFRTYPE¬=ZERO         /* IF RCD CREATED                */ 01049000
*           THEN                    /*                               */ 01050000
@RC00405 DS    0H                                                  0408 01051000
@RC00403 DS    0H                                                  0408 01052000
@RC00401 DS    0H                                                  0408 01053000
@RC00399 DS    0H                                                  0408 01054000
@RC00397 DS    0H                                                  0408 01055000
@RC00395 DS    0H                                                  0408 01056000
@RC00393 CLI   XRFRTYPE,0                                          0408 01057000
         BE    @RF00408                                            0408 01058000
*           DO;                     /*                               */ 01059000
*             CALL XRFRCDAD;        /* ADD RCD TO FILE               */ 01060000
         BAL   @14,XRFRCDAD                                        0410 01061000
*             RFY                                                  0411 01062000
*               RTNCODE RSTD;       /*                               */ 01063000
*             PTFRC=MAX(PTFRC,RTNCODE);/* SAVE RC                    */ 01064000
         CR    PTFRC,RTNCODE                                       0412 01065000
         BNL   *+6                                                      01066000
         LR    PTFRC,RTNCODE                                       0412 01067000
*             RFY                                                  0413 01068000
*               RTNCODE UNRSTD;     /*                               */ 01069000
*           END;                    /*                               */ 01070000
*       END;                        /*                               */ 01071000
@RF00408 DS    0H                                                  0416 01072000
*   END;                            /* END LOOP THRU PTFS            */ 01073000
@RF00387 AH    PASS1X,@CH00041                                     0416 01074000
@DE00330 LR    @10,PASS1X                                          0416 01075000
         MH    @10,@CH00490                                        0416 01076000
         SLR   @07,@07                                             0416 01077000
         IC    @07,IOPPTFND-9(@10,IOPPTR)                          0416 01078000
         CH    @07,@CH00679                                        0416 01079000
         BE    @DC00330                                            0416 01080000
         CH    PTFRC,@CH00235                                      0416 01081000
         BL    @DL00330                                            0416 01082000
@DC00330 DS    0H                                                  0417 01083000
*   RETURN CODE(PTFRC);             /*                               */ 01084000
         LR    @15,PTFRC                                           0417 01085000
         L     @14,@SA00005                                        0417 01086000
         LM    @00,@12,@SA00005+8                                  0417 01087000
         BR    @14                                                 0417 01088000
*   END XRFPTFP1;                   /*                               */ 01089000
         EJECT                                                          01090000
         EJECT                                                          01091000
*                                                                  0419 01092000
*   /*****************************************************************/ 01093000
*   /*                                                               */ 01094000
*   /* ROUTINE TO ADD XRF RCDS TO GTA FILE                           */ 01095000
*   /*                                                               */ 01096000
*   /*****************************************************************/ 01097000
*                                                                  0419 01098000
*XRFRCDAD:                          /*                               */ 01099000
*   PROCEDURE;                      /*                               */ 01100000
XRFRCDAD STM   @14,@12,@SA00006                                    0419 01101000
*   DECLARE                         /*                               */ 01102000
*     ADDRC FIXED(8);               /*                               */ 01103000
*   DECLARE                         /*                               */ 01104000
*     1 * BIT(8),                   /*                               */ 01105000
*       3 ADDSW BIT(1),             /* XRF RCD TO BE ADDED           */ 01106000
*       3 * BIT(7);                 /*                               */ 01107000
*   RFY                                                            0422 01108000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 01109000
*   RFY                                                            0423 01110000
*     HMASMGTP BASED(SETPTR);       /*                               */ 01111000
*                                                                  0423 01112000
*   /*****************************************************************/ 01113000
*   /*                                                               */ 01114000
*   /* IF IN SELECT MODE ATTEMPT TO FIND MEMBER IN SELECT LIST. IF   */ 01115000
*   /* NOT FOUND THEN XRF RCD SHOULD NOT BE WRITTEN.                 */ 01116000
*   /*                                                               */ 01117000
*   /*****************************************************************/ 01118000
*                                                                  0424 01119000
*   ADDRC=ZERO;                     /* INIT RETURN CODE              */ 01120000
         SLR   ADDRC,ADDRC                                         0424 01121000
*   ADDSW=ON;                       /* SET SW TO ADD XRF RCD TO FILE */ 01122000
         OI    ADDSW,B'10000000'                                   0425 01123000
*   IF LISTSEL=ON                   /* IF IN SELECT MODE             */ 01124000
*     THEN                          /*                               */ 01125000
         L     @10,@PC00001                                        0426 01126000
         TM    LISTSEL(@10),B'10000000'                            0426 01127000
         BNO   @RF00426                                            0426 01128000
*     DO;                           /*                               */ 01129000
*       HMASMSET=''B;               /*                               */ 01130000
         XC    HMASMSET(12),HMASMSET                               0428 01131000
*       IF XRFETYPE=IOPASM          /* CHECK XRF RCD TYPE AND SET    */ 01132000
*         THEN                      /*                               */ 01133000
         CLI   XRFETYPE,1                                          0429 01134000
         BNE   @RF00429                                            0429 01135000
*         SEASM=ON;                 /* SELECT TYPE                   */ 01136000
         OI    SEASM,B'00000100'                                   0430 01137000
*       ELSE                        /*                               */ 01138000
*         IF XRFETYPE=IOPLMD        /*                               */ 01139000
*           THEN                    /*                               */ 01140000
         B     @RC00429                                            0431 01141000
@RF00429 CLI   XRFETYPE,2                                          0431 01142000
         BNE   @RF00431                                            0431 01143000
*           SELMD=ON;               /*                               */ 01144000
         OI    SELMD,B'00001000'                                   0432 01145000
*         ELSE                      /*                               */ 01146000
*           IF XRFETYPE=IOPMAC      /*                               */ 01147000
*             THEN                  /*                               */ 01148000
         B     @RC00431                                            0433 01149000
@RF00431 CLI   XRFETYPE,3                                          0433 01150000
         BNE   @RF00433                                            0433 01151000
*             SEMAC=ON;             /*                               */ 01152000
         OI    SEMAC,B'00010000'                                   0434 01153000
*           ELSE                    /*                               */ 01154000
*             IF XRFETYPE=IOPMOD    /*                               */ 01155000
*               THEN                /*                               */ 01156000
         B     @RC00433                                            0435 01157000
@RF00433 CLI   XRFETYPE,5                                          0435 01158000
         BNE   @RF00435                                            0435 01159000
*               SEMOD=ON;           /*                               */ 01160000
         OI    SEMOD,B'00100000'                                   0436 01161000
*             ELSE                  /*                               */ 01162000
*               IF XRFETYPE=IOPSMD  /*                               */ 01163000
*                 THEN              /*                               */ 01164000
         B     @RC00435                                            0437 01165000
@RF00435 CLI   XRFETYPE,11                                         0437 01166000
         BNE   @RF00437                                            0437 01167000
*                 SESMD=ON;         /*                               */ 01168000
         OI    SESMD,B'00000001'                                   0438 01169000
*       SENAME=XRFENAME;            /* MOVE MEMBER NAME              */ 01170000
@RF00437 DS    0H                                                  0439 01171000
@RC00435 DS    0H                                                  0439 01172000
@RC00433 DS    0H                                                  0439 01173000
@RC00431 DS    0H                                                  0439 01174000
@RC00429 MVC   SENAME(8),XRFENAME                                  0439 01175000
*       GTPRCDLN=LENGTH(HMASMSET);  /*                               */ 01176000
         MVC   GTPRCDLN(2,SETPTR),@CH00235                         0440 01177000
*       GTPKEYLN=LENGTH(SELSTENT);  /*                               */ 01178000
         MVC   GTPKEYLN(2,SETPTR),@CH00383                         0441 01179000
*       GTPFUNCT=GTPLOC;            /*                               */ 01180000
         MVI   GTPFUNCT(SETPTR),X'03'                              0442 01181000
*       CALL HMASMGTA(HMASMGTP);    /* WAS ENTRY SELECTED?           */ 01182000
         ST    SETPTR,@AL00001                                     0443 01183000
         L     @15,@CV01449                                        0443 01184000
         LA    @01,@AL00001                                        0443 01185000
         BALR  @14,@15                                             0443 01186000
*       IF GTPRETRN¬=GTPGOOD        /* NO                            */ 01187000
*         THEN                      /* THEN SET DONT ADD SW          */ 01188000
         CLI   GTPRETRN(SETPTR),0                                  0444 01189000
         BE    @RF00444                                            0444 01190000
*         ADDSW=OFF;                /*                               */ 01191000
         NI    ADDSW,B'01111111'                                   0445 01192000
*     END;                          /* END IN SELECT MODE            */ 01193000
@RF00444 DS    0H                                                  0447 01194000
*   IF ADDSW=ON                     /*                               */ 01195000
*     THEN                          /*                               */ 01196000
@RF00426 TM    ADDSW,B'10000000'                                   0447 01197000
         BNO   @RF00447                                            0447 01198000
*     DO;                           /*                               */ 01199000
*       RFY                                                        0449 01200000
*         HMASMGTP BASED(GTPPTR);   /* XRF FILE                      */ 01201000
*       CALL HMASMGTA(HMASMGTP);    /*                               */ 01202000
         ST    GTPPTR,@AL00001                                     0450 01203000
         L     @15,@CV01449                                        0450 01204000
         LA    @01,@AL00001                                        0450 01205000
         BALR  @14,@15                                             0450 01206000
*       ADDRC=MAX(ADDRC,GTPRETRN);  /* SAVE RC                       */ 01207000
         SLR   @10,@10                                             0451 01208000
         IC    @10,GTPRETRN(,GTPPTR)                               0451 01209000
         CR    ADDRC,@10                                           0451 01210000
         BNL   *+6                                                      01211000
         LR    ADDRC,@10                                           0451 01212000
*     END;                          /*                               */ 01213000
*   RETURN CODE(ADDRC);             /*                               */ 01214000
@RF00447 LR    @15,ADDRC                                           0453 01215000
         L     @14,@SA00006                                        0453 01216000
         LM    @00,@12,@SA00006+8                                  0453 01217000
         BR    @14                                                 0453 01218000
*   END XRFRCDAD;                   /*                               */ 01219000
         EJECT                                                          01220000
*                                                                  0455 01221000
*   /*****************************************************************/ 01222000
*   /*                                                               */ 01223000
*   /* ROUTINE CALLED TO DO ALL TERMINATION PROCESSING               */ 01224000
*   /*                                                               */ 01225000
*   /*****************************************************************/ 01226000
*                                                                  0455 01227000
*XRFCLEAN:                          /*                               */ 01228000
*   PROCEDURE;                      /*                               */ 01229000
XRFCLEAN STM   @14,@12,@SA00007                                    0455 01230000
*   DECLARE                         /*                               */ 01231000
*     CLEANRC FIXED(8);             /*                               */ 01232000
*   RFY                                                            0457 01233000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 01234000
*   CLEANRC=ZERO;                   /*                               */ 01235000
*                                                                  0458 01236000
         SLR   CLEANRC,CLEANRC                                     0458 01237000
*   /*****************************************************************/ 01238000
*   /*                                                               */ 01239000
*   /* CLOSE DIRECTORY FOR GET NEXT PROCESSING                       */ 01240000
*   /*                                                               */ 01241000
*   /*****************************************************************/ 01242000
*                                                                  0459 01243000
*   IF IOPPTR¬=ADDR(XRFIOP)         /* IF IOP OBTAINED               */ 01244000
*     THEN                          /*                               */ 01245000
         LA    @10,XRFIOP                                          0459 01246000
         CR    IOPPTR,@10                                          0459 01247000
         BE    @RF00459                                            0459 01248000
*     DO;                           /*                               */ 01249000
*       IF LISTCDS=ON               /* IF LIST OF CDS                */ 01250000
*         THEN                      /*                               */ 01251000
         L     @10,@PC00001                                        0461 01252000
         TM    LISTCDS(@10),B'01000000'                            0461 01253000
         BNO   @RF00461                                            0461 01254000
*         IOPDSID=IOPCDS;           /* SET DATA SET ID               */ 01255000
         MVI   IOPDSID(IOPPTR),X'02'                               0462 01256000
*       ELSE                        /*                               */ 01257000
*         IOPDSID=IOPACDS;          /* SET DATA SET ID               */ 01258000
         B     @RC00461                                            0463 01259000
@RF00461 MVI   IOPDSID(IOPPTR),X'0C'                               0463 01260000
*       IOPFUNCT=IOPCLOSN;          /* SET TO CLOSE DIRECTORY        */ 01261000
@RC00461 MVI   IOPFUNCT(IOPPTR),X'0C'                              0464 01262000
*       CALL HMASMIO(HMASMIOP);     /* DO CLOSE                      */ 01263000
         ST    IOPPTR,@AL00001                                     0465 01264000
         L     @15,@CV01450                                        0465 01265000
         LA    @01,@AL00001                                        0465 01266000
         BALR  @14,@15                                             0465 01267000
*       CLEANRC=MAX(CLEANRC,IOPRETRN);/*                             */ 01268000
*                                                                  0466 01269000
         SLR   @10,@10                                             0466 01270000
         IC    @10,IOPRETRN(,IOPPTR)                               0466 01271000
         CR    CLEANRC,@10                                         0466 01272000
         BNL   *+6                                                      01273000
         LR    CLEANRC,@10                                         0466 01274000
*       /*************************************************************/ 01275000
*       /*                                                           */ 01276000
*       /* FREE MAIN IOP                                             */ 01277000
*       /*                                                           */ 01278000
*       /*************************************************************/ 01279000
*                                                                  0467 01280000
*       SPLFUNCT=SPLFMIOP;          /* FREE IOP                      */ 01281000
         MVI   SPLFUNCT,X'04'                                      0467 01282000
*       SPLPMAD=IOPPTR;             /* ADDR OF IOP                   */ 01283000
         ST    IOPPTR,SPLPMAD                                      0468 01284000
*       CALL HMASMSUB(HMASMSPL);    /* FREE IOP                      */ 01285000
         L     @15,@CV01451                                        0469 01286000
         LA    @01,@AL00469                                        0469 01287000
         BALR  @14,@15                                             0469 01288000
*       RFY                                                        0470 01289000
*         RTNCODE RSTD;             /*                               */ 01290000
*       CLEANRC=MAX(CLEANRC,RTNCODE);/*                              */ 01291000
         CR    CLEANRC,RTNCODE                                     0471 01292000
         BNL   *+6                                                      01293000
         LR    CLEANRC,RTNCODE                                     0471 01294000
*       RFY                                                        0472 01295000
*         RTNCODE UNRSTD;           /*                               */ 01296000
*     END;                          /*                               */ 01297000
*                                                                  0473 01298000
*   /*****************************************************************/ 01299000
*   /*                                                               */ 01300000
*   /* FREE SECOND IOP                                               */ 01301000
*   /*                                                               */ 01302000
*   /*****************************************************************/ 01303000
*                                                                  0474 01304000
*   IF IOPPTR2¬=ZERO                /* IF IOP OBTAINED               */ 01305000
*     THEN                          /*                               */ 01306000
@RF00459 LTR   IOPPTR2,IOPPTR2                                     0474 01307000
         BZ    @RF00474                                            0474 01308000
*     DO;                           /*                               */ 01309000
*       SPLFUNCT=SPLFMIOP;          /* FREE IOP                      */ 01310000
         MVI   SPLFUNCT,X'04'                                      0476 01311000
*       SPLPMAD=IOPPTR2;            /* ADDR OF IOP                   */ 01312000
         ST    IOPPTR2,SPLPMAD                                     0477 01313000
*       CALL HMASMSUB(HMASMSPL);    /* FREE IOP                      */ 01314000
         L     @15,@CV01451                                        0478 01315000
         LA    @01,@AL00478                                        0478 01316000
         BALR  @14,@15                                             0478 01317000
*       RFY                                                        0479 01318000
*         RTNCODE RSTD;             /*                               */ 01319000
*       CLEANRC=MAX(CLEANRC,RTNCODE);/*                              */ 01320000
         CR    CLEANRC,RTNCODE                                     0480 01321000
         BNL   *+6                                                      01322000
         LR    CLEANRC,RTNCODE                                     0480 01323000
*       RFY                                                        0481 01324000
*         RTNCODE UNRSTD;           /*                               */ 01325000
*     END;                          /*                               */ 01326000
*                                                                  0482 01327000
*   /*****************************************************************/ 01328000
*   /*                                                               */ 01329000
*   /* RESET SET GTPBUFAD IF IN SELECT                               */ 01330000
*   /*                                                               */ 01331000
*   /*****************************************************************/ 01332000
*                                                                  0483 01333000
*   RFY                                                            0483 01334000
*     HMASMGTP BASED(SETPTR);       /* XRF GTP                       */ 01335000
@RF00474 DS    0H                                                  0484 01336000
*   IF LISTSEL=ON                   /* IF IN SELECT                  */ 01337000
*     THEN                          /*                               */ 01338000
         L     @10,@PC00001                                        0484 01339000
         TM    LISTSEL(@10),B'10000000'                            0484 01340000
         BNO   @RF00484                                            0484 01341000
*     GTPBUFAD=SAVSETAD;            /*                               */ 01342000
         MVC   GTPBUFAD(4,SETPTR),SAVSETAD                         0485 01343000
*   RETURN CODE(CLEANRC);           /*                               */ 01344000
@RF00484 LR    @15,CLEANRC                                         0486 01345000
         L     @14,@SA00007                                        0486 01346000
         LM    @00,@12,@SA00007+8                                  0486 01347000
         BR    @14                                                 0486 01348000
*   END XRFCLEAN;                   /*                               */ 01349000
*   END HMASMXRF                    /*                               */ 01350000
*                                                                  0488 01351000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01352000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 01353000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 01354000
*/*%INCLUDE SYSLIB  (HMASMSET)                                       */ 01355000
*/*%INCLUDE SYSLIB  (HMASMGTP)                                       */ 01356000
*/*%INCLUDE SYSLIB  (HMASMSPL)                                       */ 01357000
*                                                                  0488 01358000
*       ;                                                          0488 01359000
@DATA    DS    0H                                                       01360000
@CH00307 DC    H'0'                                                     01361000
@CH00041 DC    H'1'                                                     01362000
@CH00049 DC    H'2'                                                     01363000
@CH00082 DC    H'3'                                                     01364000
@CH00100 DC    H'4'                                                     01365000
@CH00066 DC    H'5'                                                     01366000
@CH00052 DC    H'6'                                                     01367000
@CH00295 DC    H'7'                                                     01368000
@CH00084 DC    H'8'                                                     01369000
@CH00490 DC    H'9'                                                     01370000
@CH00383 DC    H'10'                                                    01371000
@CH00235 DC    H'12'                                                    01372000
@CH00571 DC    H'81'                                                    01373000
@CH00573 DC    H'82'                                                    01374000
@CH00575 DC    H'83'                                                    01375000
@CH00577 DC    H'84'                                                    01376000
@CH00579 DC    H'85'                                                    01377000
@CH00581 DC    H'86'                                                    01378000
@CH00583 DC    H'87'                                                    01379000
@CH00916 DC    H'160'                                                   01380000
@CH01107 DC    H'162'                                                   01381000
@CH01109 DC    H'163'                                                   01382000
@CH01111 DC    H'164'                                                   01383000
@CH01113 DC    H'165'                                                   01384000
@CH01115 DC    H'166'                                                   01385000
@CH01119 DC    H'168'                                                   01386000
@CH01121 DC    H'169'                                                   01387000
@CH00679 DC    H'255'                                                   01388000
         DS    0F                                                       01389000
@AL00248 EQU   *                       LIST WITH   1 ARGUMENT(S)        01390000
@AL00256 EQU   *                       LIST WITH   1 ARGUMENT(S)        01391000
@AL00469 EQU   *                       LIST WITH   1 ARGUMENT(S)        01392000
@AL00478 DC    A(HMASMSPL)             LIST WITH   1 ARGUMENT(S)        01393000
         DS    0F                                                       01394000
@SA00001 DS    18F                                                      01395000
@PC00001 DS    3F                                                       01396000
@SA00003 DS    15F                                                      01397000
@SA00004 DS    15F                                                      01398000
@SA00005 DS    15F                                                      01399000
@SA00006 DS    0F                                                       01400000
@SA00007 DS    0F                                                       01401000
@SA00002 DS    0F                                                       01402000
         DS    15F                                                      01403000
@AL00001 DS    1A                                                       01404000
         DS    0F                                                       01405000
@CV01449 DC    V(HMASMGTA)                                              01406000
@CV01450 DC    V(HMASMIO)                                               01407000
@CV01451 DC    V(HMASMSUB)                                              01408000
         DS    0D                                                       01409000
SAVSETAD DS    A                                                        01410000
HMASMSET DS    CL12                                                     01411000
         ORG   HMASMSET                                                 01412000
SELSTENT DS    CL10                                                     01413000
         ORG   SELSTENT                                                 01414000
SELSTFLG DS    BL2                                                      01415000
         ORG   SELSTFLG                                                 01416000
@NM00176 DS    BL1                                                      01417000
SEMCS    EQU   SELSTFLG+0                                               01418000
SESMD    EQU   SELSTFLG+0                                               01419000
SESRC    DS    BL1                                                      01420000
SEDLB    EQU   SELSTFLG+1                                               01421000
SEMOD    EQU   SELSTFLG+1                                               01422000
SEMAC    EQU   SELSTFLG+1                                               01423000
SELMD    EQU   SELSTFLG+1                                               01424000
SEASM    EQU   SELSTFLG+1                                               01425000
SEFMD    EQU   SELSTFLG+1                                               01426000
SESYS    EQU   SELSTFLG+1                                               01427000
         ORG   SELSTENT+2                                               01428000
SENAME   DS    CL8                                                      01429000
         ORG   SENAME                                                   01430000
SESMDNO  DS    CL7                                                      01431000
         ORG   SESMDNO                                                  01432000
SEPTFNO  DS    CL7                                                      01433000
         ORG   SENAME+7                                                 01434000
@NM00177 DS    CL1                                                      01435000
         ORG   HMASMSET+10                                              01436000
SEFLAGS  DS    BL1                                                      01437000
         ORG   SEFLAGS                                                  01438000
SEGROUP  DS    BL1                                                      01439000
SESELECT EQU   SEFLAGS+0                                                01440000
SEEXCLUD EQU   SEFLAGS+0                                                01441000
SENOJCL  EQU   SEFLAGS+0                                                01442000
SEFMID   EQU   SEFLAGS+0                                                01443000
@NM00178 EQU   SEFLAGS+0                                                01444000
SEFOUND  EQU   SEFLAGS+0                                                01445000
         ORG   HMASMSET+11                                              01446000
SEFLAG2  DS    BL1                                                      01447000
         ORG   SEFLAG2                                                  01448000
SEFLAG2A DS    BL1                                                      01449000
SEFLAG2B EQU   SEFLAG2+0                                                01450000
SEFLAG2C EQU   SEFLAG2+0                                                01451000
SEFLAG2D EQU   SEFLAG2+0                                                01452000
SEFLAG2E EQU   SEFLAG2+0                                                01453000
SEFLAG2F EQU   SEFLAG2+0                                                01454000
SEFLAG2G EQU   SEFLAG2+0                                                01455000
SEFLAG2H EQU   SEFLAG2+0                                                01456000
         ORG   HMASMSET+12                                              01457000
HMASMSPL DS    CL5                                                      01458000
         ORG   HMASMSPL                                                 01459000
SPLPMAD  DS    AL4                                                      01460000
SPLFUNCT DS    FL1                                                      01461000
         ORG   HMASMSPL+5                                               01462000
XRFRCD   DS    CL30                                                     01463000
         ORG   XRFRCD                                                   01464000
XRFKEY1  DS    CL29                                                     01465000
         ORG   XRFKEY1                                                  01466000
XRFETYPE DS    FL1                                                      01467000
XRFENAME DS    CL8                                                      01468000
XRFRTYPE DS    FL1                                                      01469000
XRFUKEY1 DS    FL1                                                      01470000
@NM00182 DS    CL18                                                     01471000
         ORG   XRFRCD+29                                                01472000
XRFNKEY1 DS    CL1                                                      01473000
         ORG   XRFNKEY1                                                 01474000
XRFFLAG1 DS    BL1                                                      01475000
         ORG   XRFFLAG1                                                 01476000
XRFFLGA  DS    BL1                                                      01477000
XRFFLGB  EQU   XRFFLAG1+0                                               01478000
XRFFLGC  EQU   XRFFLAG1+0                                               01479000
XRFFLGD  EQU   XRFFLAG1+0                                               01480000
XRFFLGE  EQU   XRFFLAG1+0                                               01481000
XRFFLGF  EQU   XRFFLAG1+0                                               01482000
XRFFLGG  EQU   XRFFLAG1+0                                               01483000
XRFFLGH  EQU   XRFFLAG1+0                                               01484000
         ORG   XRFRCD+30                                                01485000
XRFIOP   DS    CL68                                                     01486000
XRFSW    DS    BL1                                                      01487000
         ORG   XRFSW                                                    01488000
SKIP     DS    BL1                                                      01489000
@NM00203 EQU   XRFSW+0                                                  01490000
         ORG   XRFSW+1                                                  01491000
PATCHXRF DS    CL80                                                     01492000
         ORG   PATCHXRF                                                 01493000
@NM00204 DC    80X'FF'                                                  01494000
         ORG   PATCHXRF+80                                              01495000
@NM00205 DS    BL1                                                      01496000
         ORG   @NM00205                                                 01497000
ADDSW    DS    BL1                                                      01498000
@NM00206 EQU   @NM00205+0                                               01499000
         ORG   @NM00205+1                                               01500000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01501000
@01      EQU   01                                                       01502000
@02      EQU   02                                                       01503000
@03      EQU   03                                                       01504000
@04      EQU   04                                                       01505000
@05      EQU   05                                                       01506000
@06      EQU   06                                                       01507000
@07      EQU   07                                                       01508000
@08      EQU   08                                                       01509000
@09      EQU   09                                                       01510000
@10      EQU   10                                                       01511000
@11      EQU   11                                                       01512000
@12      EQU   12                                                       01513000
@13      EQU   13                                                       01514000
@14      EQU   14                                                       01515000
@15      EQU   15                                                       01516000
CLEANRC  EQU   @03                                                      01517000
ADDRC    EQU   @02                                                      01518000
PASS1Y   EQU   @07                                                      01519000
PASS1X   EQU   @03                                                      01520000
PTFRC    EQU   @04                                                      01521000
MODX1    EQU   @04                                                      01522000
MODRC    EQU   @03                                                      01523000
MACX1    EQU   @04                                                      01524000
MACRC    EQU   @03                                                      01525000
INITRC   EQU   @03                                                      01526000
XRFRTNCD EQU   @03                                                      01527000
SETPTR   EQU   @05                                                      01528000
GTPPTR   EQU   @06                                                      01529000
IOPPTR2  EQU   @04                                                      01530000
IOPPTR   EQU   @02                                                      01531000
CCAPTR   EQU   @11                                                      01532000
RTNCODE  EQU   @15                                                      01533000
RTNREG   EQU   @14                                                      01534000
HMASMCCA EQU   0                                                        01535000
CCAFBUFR EQU   HMASMCCA+4                                               01536000
CCADSAD  EQU   CCAFBUFR+124                                             01537000
CCATPAD  EQU   CCAFBUFR+128                                             01538000
CCAFLAG7 EQU   CCAFBUFR+132                                             01539000
CCAFIOP  EQU   HMASMCCA+140                                             01540000
CCAFSYS  EQU   HMASMCCA+148                                             01541000
CCASREL  EQU   CCAFSYS+12                                               01542000
CCAFLAGA EQU   CCAFSYS+21                                               01543000
CCAFSTA  EQU   HMASMCCA+188                                             01544000
CCAFICT  EQU   HMASMCCA+192                                             01545000
CCAFPGM  EQU   HMASMCCA+208                                             01546000
CCABLDLP EQU   CCAFPGM                                                  01547000
CCADBLDL EQU   CCAFPGM+4                                                01548000
CCAFGTP  EQU   HMASMCCA+224                                             01549000
CCASEGTP EQU   CCAFGTP                                                  01550000
@NM00014 EQU   HMASMCCA+244                                             01551000
CCAFFUNC EQU   HMASMCCA+264                                             01552000
CCAFLAG1 EQU   CCAFFUNC+8                                               01553000
CCAFLAG2 EQU   CCAFFUNC+11                                              01554000
CCAFPROC EQU   HMASMCCA+276                                             01555000
CCAFLAG3 EQU   CCAFPROC                                                 01556000
CCAFDIS  EQU   HMASMCCA+278                                             01557000
CCAFLAG4 EQU   CCAFDIS                                                  01558000
CCAFLAG5 EQU   CCAFDIS+1                                                01559000
CCAFLAG6 EQU   CCAFDIS+2                                                01560000
CCAFCNV  EQU   HMASMCCA+281                                             01561000
CCAFLAG8 EQU   CCAFCNV                                                  01562000
CCAFCTL  EQU   HMASMCCA+282                                             01563000
CCAFLAG9 EQU   CCAFCTL                                                  01564000
CCAFDSNG EQU   HMASMCCA+298                                             01565000
CCAFLAGB EQU   CCAFDSNG                                                 01566000
CCABLDLA EQU   0                                                        01567000
@NM00030 EQU   CCABLDLA                                                 01568000
CCABLDLL EQU   0                                                        01569000
@NM00032 EQU   CCABLDLL                                                 01570000
CCALKDRC EQU   @NM00032+20                                              01571000
@NM00034 EQU   CCABLDLL+124                                             01572000
CCAASMRC EQU   @NM00034+20                                              01573000
@NM00036 EQU   CCABLDLL+248                                             01574000
CCACPYRC EQU   @NM00036+20                                              01575000
@NM00038 EQU   CCABLDLL+372                                             01576000
CCACOMRC EQU   @NM00038+20                                              01577000
@NM00040 EQU   CCABLDLL+496                                             01578000
CCAZAPRC EQU   @NM00040+20                                              01579000
@NM00042 EQU   CCABLDLL+620                                             01580000
CCASUPRC EQU   @NM00042+20                                              01581000
@NM00044 EQU   CCABLDLL+744                                             01582000
CCAUPDRC EQU   @NM00044+20                                              01583000
CCABLDLM EQU   0                                                        01584000
CCABELMT EQU   CCABLDLM+4                                               01585000
CCABMPOS EQU   CCABELMT                                                 01586000
HMASMIOP EQU   0                                                        01587000
IOPDSID  EQU   HMASMIOP                                                 01588000
IOPFUNCT EQU   HMASMIOP+1                                               01589000
IOPRETRN EQU   HMASMIOP+2                                               01590000
IOPTYPE  EQU   HMASMIOP+3                                               01591000
IOPNAME  EQU   HMASMIOP+4                                               01592000
IOPNAM17 EQU   IOPNAME                                                  01593000
@NM00048 EQU   HMASMIOP+12                                              01594000
@NM00049 EQU   @NM00048                                                 01595000
IOPDDNAM EQU   HMASMIOP+24                                              01596000
IOPBUFAD EQU   HMASMIOP+52                                              01597000
IOPDRMAP EQU   HMASMIOP+56                                              01598000
IOPINAME EQU   IOPDRMAP                                                 01599000
IOPINAM  EQU   IOPINAME                                                 01600000
IOPITYP  EQU   IOPINAM                                                  01601000
IOPUSERL EQU   IOPDRMAP+11                                              01602000
IOPEND   EQU   IOPDRMAP+12                                              01603000
IOPLMCTL EQU   0                                                        01604000
IOPQSMIF EQU   0                                                        01605000
@NM00159 EQU   IOPQSMIF                                                 01606000
IOPQSMLS EQU   IOPQSMIF+8                                               01607000
IOPQSMNM EQU   IOPQSMLS                                                 01608000
IOPBS02  EQU   0                                                        01609000
IOPBS04  EQU   0                                                        01610000
IOPBAPF  EQU   IOPBS04                                                  01611000
HMASMGTP EQU   0                                                        01612000
GTPFUNCT EQU   HMASMGTP                                                 01613000
GTPRETRN EQU   HMASMGTP+1                                               01614000
GTPRCDLN EQU   HMASMGTP+4                                               01615000
GTPKEYLN EQU   HMASMGTP+6                                               01616000
GTPBUFAD EQU   HMASMGTP+12                                              01617000
GTPRESTR EQU   HMASMGTP+16                                              01618000
GTPFLGS1 EQU   HMASMGTP+26                                              01619000
SPLPPACK EQU   0                                                        01620000
SPLPUNPK EQU   0                                                        01621000
SPLPDSN  EQU   0                                                        01622000
SPLODSN  EQU   SPLPDSN                                                  01623000
CCADSIDA EQU   0                                                        01624000
CCATYPEA EQU   0                                                        01625000
IOPBS01  EQU   0                                                        01626000
IOPBS03  EQU   0                                                        01627000
LISTPARM EQU   0                                                        01628000
LISTPRM1 EQU   LISTPARM                                                 01629000
LISTCDS  EQU   LISTPRM1                                                 01630000
LISTPRM2 EQU   LISTPARM+2                                               01631000
LISTALL2 EQU   LISTPRM2                                                 01632000
LISTASM  EQU   LISTPRM2                                                 01633000
LISTLMD  EQU   LISTPRM2                                                 01634000
LISTMAC  EQU   LISTPRM2                                                 01635000
LISTMOD  EQU   LISTPRM2                                                 01636000
LISTSRC  EQU   LISTPRM2                                                 01637000
LISTSMD  EQU   LISTPRM2+1                                               01638000
LISTPRM3 EQU   LISTPARM+4                                               01639000
LISTPRM4 EQU   LISTPARM+6                                               01640000
LISTSEL  EQU   LISTPRM4                                                 01641000
LISTDATE EQU   LISTPARM+7                                               01642000
LISTBDAT EQU   LISTDATE                                                 01643000
LISTEDAT EQU   LISTDATE+6                                               01644000
XRFGTP   EQU   0                                                        01645000
SETGTP   EQU   0                                                        01646000
IOPUDATA EQU   IOPEND                                                   01647000
IOPINAM3 EQU   IOPINAME                                                 01648000
@NM00055 EQU   IOPINAM3                                                 01649000
IOPSTCMP EQU   IOPUDATA                                                 01650000
IOPDYNDT EQU   IOPUDATA                                                 01651000
IOPSPACE EQU   IOPDYNDT+44                                              01652000
IOPDTYPE EQU   IOPDYNDT+50                                              01653000
IOPNTMAX EQU   IOPDRMAP                                                 01654000
IOPNTMAP EQU   IOPDRMAP                                                 01655000
IOPCDMAP EQU   IOPNTMAP                                                 01656000
IOPPTMAP EQU   IOPCDMAP                                                 01657000
IOPSCMAP EQU   IOPPTMAP                                                 01658000
IOPDIRCT EQU   IOPSCMAP+12                                              01659000
IOPCDMAX EQU   IOPDIRCT                                                 01660000
IOPCQMAP EQU   IOPDRMAP                                                 01661000
@NM00066 EQU   IOPUDATA                                                 01662000
@NM00067 EQU   IOPUDATA                                                 01663000
IOPASMNT EQU   IOPUDATA                                                 01664000
IOPASMDR EQU   IOPASMNT                                                 01665000
IOPABUNT EQU   IOPASMDR+1                                               01666000
IOPLMDNT EQU   IOPUDATA                                                 01667000
IOPLMDDR EQU   IOPLMDNT                                                 01668000
IOPLMLEP EQU   IOPLMDDR+1                                               01669000
IOPLMDF1 EQU   IOPLMLEP                                                 01670000
IOPFLGS2 EQU   IOPLMDF1                                                 01671000
IOPLMDF2 EQU   IOPLMLEP+1                                               01672000
IOPLMDF3 EQU   IOPLMLEP+2                                               01673000
IOPLMDF4 EQU   IOPLMLEP+3                                               01674000
IOPLMDF5 EQU   IOPLMDDR+5                                               01675000
IOPFLGS3 EQU   IOPLMDF5                                                 01676000
IOPLMDFX EQU   IOPLMDNT+24                                              01677000
@NM00076 EQU   IOPLMDFX                                                 01678000
IOPLNTRY EQU   IOPLMDFX+8                                               01679000
IOPLSYS  EQU   IOPLNTRY                                                 01680000
IOPSYSLB EQU   IOPLSYS                                                  01681000
IOPMACNT EQU   IOPUDATA                                                 01682000
IOPMACDR EQU   IOPMACNT                                                 01683000
IOPRMIDE EQU   IOPMACDR+1                                               01684000
IOPRMST  EQU   IOPRMIDE+7                                               01685000
IOPFMIDE EQU   IOPMACDR+9                                               01686000
IOPMACFX EQU   IOPMACNT+24                                              01687000
IOPBUNT  EQU   IOPMACFX                                                 01688000
IOPMCEND EQU   IOPMACNT+104                                             01689000
IOPMACVR EQU   IOPMCEND                                                 01690000
IOPMCENT EQU   IOPMACVR                                                 01691000
IOPMCDTA EQU   IOPMCENT                                                 01692000
IOPMCASM EQU   IOPMCDTA                                                 01693000
IOPMACID EQU   IOPMCASM                                                 01694000
IOPMACND EQU   IOPMACID                                                 01695000
IOPMACST EQU   IOPMCASM+7                                               01696000
IOPMCIND EQU   IOPMCENT+8                                               01697000
IOPEOFNT EQU   IOPUDATA                                                 01698000
IOPSRCNT EQU   IOPUDATA                                                 01699000
IOPSRCDR EQU   IOPSRCNT                                                 01700000
@NM00087 EQU   IOPSRCDR+1                                               01701000
@NM00089 EQU   @NM00087+7                                               01702000
@NM00093 EQU   IOPSRCDR+9                                               01703000
IOPSRCFX EQU   IOPSRCNT+24                                              01704000
@NM00097 EQU   IOPSRCFX                                                 01705000
IOPSREND EQU   IOPSRCNT+104                                             01706000
IOPSRCVR EQU   IOPSREND                                                 01707000
IOPSNTRY EQU   IOPSRCVR                                                 01708000
IOPSRDTA EQU   IOPSNTRY                                                 01709000
IOPSRCID EQU   IOPSRDTA                                                 01710000
IOPSRCST EQU   IOPSRDTA+7                                               01711000
IOPMODNT EQU   IOPUDATA                                                 01712000
IOPMODDR EQU   IOPMODNT                                                 01713000
@NM00103 EQU   IOPMODDR+1                                               01714000
@NM00105 EQU   @NM00103+7                                               01715000
@NM00109 EQU   IOPMODDR+9                                               01716000
IOPMODFX EQU   IOPMODNT+24                                              01717000
@NM00113 EQU   IOPMODFX                                                 01718000
IOPMDLEP EQU   IOPMODFX+8                                               01719000
IOPMODF1 EQU   IOPMDLEP                                                 01720000
IOPMODF2 EQU   IOPMDLEP+1                                               01721000
IOPMODF3 EQU   IOPMDLEP+2                                               01722000
IOPMODF4 EQU   IOPMDLEP+3                                               01723000
IOPMDEND EQU   IOPMODNT+104                                             01724000
IOPMODVR EQU   IOPMDEND                                                 01725000
IOPMNTRY EQU   IOPMODVR                                                 01726000
IOPMDDTA EQU   IOPMNTRY                                                 01727000
IOPLMODS EQU   IOPMDDTA                                                 01728000
IOPMODID EQU   IOPLMODS                                                 01729000
IOPMODND EQU   IOPMODID                                                 01730000
IOPMODST EQU   IOPLMODS+7                                               01731000
IOPMDIND EQU   IOPMNTRY+8                                               01732000
IOPDLBNT EQU   IOPUDATA                                                 01733000
IOPDLBDR EQU   IOPDLBNT                                                 01734000
IOPDLBFX EQU   IOPDLBNT+24                                              01735000
@NM00124 EQU   IOPDLBFX                                                 01736000
IOPDLEND EQU   IOPDLBNT+104                                             01737000
IOPDLBVR EQU   IOPDLEND                                                 01738000
IOPDNTRY EQU   IOPDLBVR                                                 01739000
IOPDSYS  EQU   IOPDNTRY                                                 01740000
IOPSYSNT EQU   IOPUDATA                                                 01741000
IOPSYSDR EQU   IOPSYSNT                                                 01742000
IOPSYSF1 EQU   IOPSYSDR+4                                               01743000
IOPFLGS7 EQU   IOPSYSF1                                                 01744000
IOPSYSFX EQU   IOPSYSNT+24                                              01745000
@NM00131 EQU   IOPSYSFX                                                 01746000
IOPSYEND EQU   IOPSYSNT+184                                             01747000
IOPSYSVR EQU   IOPSYEND                                                 01748000
IOPSYSTR EQU   IOPSYSVR                                                 01749000
IOPSYNTR EQU   IOPSYSTR                                                 01750000
IOPPTFNT EQU   IOPUDATA                                                 01751000
IOPPTFDR EQU   IOPPTFNT                                                 01752000
IOPPTYPE EQU   IOPPTFDR+1                                               01753000
IOPPSTAT EQU   IOPPTFDR+2                                               01754000
IOPPTFF1 EQU   IOPPSTAT                                                 01755000
IOPFLGS5 EQU   IOPPTFF1                                                 01756000
IOPDUMMP EQU   IOPFLGS5                                                 01757000
IOPPTFF2 EQU   IOPPSTAT+1                                               01758000
IOPPTFF3 EQU   IOPPSTAT+3                                               01759000
IOPPTFFX EQU   IOPPTFNT+24                                              01760000
@NM00140 EQU   IOPPTFFX                                                 01761000
@NM00141 EQU   @NM00140                                                 01762000
IOPPDTES EQU   IOPPTFFX+41                                              01763000
@NM00144 EQU   IOPPDTES                                                 01764000
IOPPTPFX EQU   IOPPDTES+6                                               01765000
IOPDATES EQU   IOPPTPFX                                                 01766000
IOPAPPD  EQU   IOPDATES                                                 01767000
IOPAPPT  EQU   IOPDATES+3                                               01768000
IOPACCD  EQU   IOPDATES+12                                              01769000
IOPACCT  EQU   IOPDATES+15                                              01770000
IOPPTEND EQU   IOPPTFNT+104                                             01771000
IOPPTFVR EQU   IOPPTEND                                                 01772000
IOPPNTRY EQU   IOPPTFVR                                                 01773000
IOPPMODS EQU   IOPPNTRY                                                 01774000
IOPPTFND EQU   IOPPMODS                                                 01775000
IOPPIND  EQU   IOPPNTRY+8                                               01776000
IOPENTNT EQU   IOPUDATA+104                                             01777000
IOPSRLNT EQU   IOPUDATA+104                                             01778000
IOPPRENT EQU   IOPUDATA+104                                             01779000
IOPNPRNT EQU   IOPUDATA+104                                             01780000
IOPSUPNT EQU   IOPUDATA+104                                             01781000
IOPREQNT EQU   IOPUDATA+104                                             01782000
IOPIRQNT EQU   IOPUDATA+104                                             01783000
IOPFIDNT EQU   IOPUDATA+104                                             01784000
IOPDELNT EQU   IOPUDATA+104                                             01785000
IOPVERNT EQU   IOPUDATA+104                                             01786000
IOPSBYNT EQU   IOPUDATA+104                                             01787000
IOPQSMNT EQU   IOPUDATA                                                 01788000
IOPQSMDR EQU   IOPQSMNT                                                 01789000
IOPQFMNT EQU   IOPUDATA                                                 01790000
IOPQFMDR EQU   IOPQFMNT                                                 01791000
IOPQFEND EQU   IOPQFMNT+2                                               01792000
IOPQFMVR EQU   IOPQFEND                                                 01793000
IOPQFMLS EQU   IOPQFMVR                                                 01794000
IOPQFMNM EQU   IOPQFMLS                                                 01795000
IOPPTSYS EQU   IOPUDATA                                                 01796000
IOPPTSDR EQU   IOPPTSYS                                                 01797000
IOPPTSFX EQU   IOPPTSYS+24                                              01798000
IOPDSSPC EQU   IOPPTSFX                                                 01799000
IOPPTFG1 EQU   IOPPTSFX+34                                              01800000
IOPPSEND EQU   IOPPTSYS+1064                                            01801000
IOPPTSVR EQU   IOPPSEND                                                 01802000
IOPPTNTR EQU   IOPPTSVR                                                 01803000
@NM00169 EQU   IOPPTNTR                                                 01804000
IOPPTFMD EQU   @NM00169                                                 01805000
IOPPTREL EQU   IOPPTFMD                                                 01806000
IOPBPDS  EQU   IOPUDATA                                                 01807000
IOPBLEP1 EQU   IOPBPDS+8                                                01808000
IOPBLEP2 EQU   IOPBPDS+9                                                01809000
@NM00173 EQU   IOPBPDS+18                                               01810000
IOPBFTB0 EQU   @NM00173                                                 01811000
IOPBFTB1 EQU   IOPBFTB0                                                 01812000
XRFRCD1  EQU   XRFRCD                                                   01813000
XRF1ASM  EQU   XRFRCD1+1                                                01814000
XRF1MAC  EQU   XRFRCD1+11                                               01815000
XRFRCD2  EQU   XRFRCD                                                   01816000
XRF2LMD  EQU   XRFRCD2+1                                                01817000
XRF2MOD  EQU   XRFRCD2+11                                               01818000
XRFRCD3  EQU   XRFRCD                                                   01819000
XRF3MAC  EQU   XRFRCD3+1                                                01820000
XRF3MOD  EQU   XRF3MAC                                                  01821000
XRF3DAT  EQU   XRFRCD3+11                                               01822000
XRF3TIM  EQU   XRFRCD3+14                                               01823000
XRF3PTF  EQU   XRFRCD3+17                                               01824000
XRF3PF1  EQU   XRFRCD3+24                                               01825000
XRF3PTYP EQU   XRFRCD3+25                                               01826000
XRF3PIND EQU   XRFRCD3+26                                               01827000
XRF3PF3  EQU   XRFRCD3+27                                               01828000
XRFRCD4  EQU   XRFRCD                                                   01829000
XRF4PTF  EQU   XRFRCD4+1                                                01830000
XRFX4PTF EQU   XRFRCD4+11                                               01831000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01832000
@NM00202 EQU   XRFRCD4+28                                               01833000
@NM00201 EQU   XRFRCD4+18                                               01834000
@NM00200 EQU   XRFRCD4+10                                               01835000
@NM00199 EQU   XRFRCD4+9                                                01836000
@NM00198 EQU   XRFRCD4                                                  01837000
@NM00197 EQU   XRFRCD3+29                                               01838000
@NM00196 EQU   XRFRCD3+28                                               01839000
XRF3STAT EQU   XRF3PF1                                                  01840000
@NM00195 EQU   XRFRCD3+10                                               01841000
@NM00194 EQU   XRFRCD3+9                                                01842000
XRF3SRC  EQU   XRF3MOD                                                  01843000
@NM00193 EQU   XRFRCD3                                                  01844000
@NM00192 EQU   XRFRCD2+29                                               01845000
@NM00191 EQU   XRFRCD2+19                                               01846000
@NM00190 EQU   XRFRCD2+10                                               01847000
@NM00189 EQU   XRFRCD2+9                                                01848000
@NM00188 EQU   XRFRCD2                                                  01849000
@NM00187 EQU   XRFRCD1+29                                               01850000
@NM00186 EQU   XRFRCD1+19                                               01851000
@NM00185 EQU   XRFRCD1+10                                               01852000
@NM00184 EQU   XRFRCD1+9                                                01853000
@NM00183 EQU   XRFRCD1                                                  01854000
IOPBCEND EQU   IOPBPDS+21                                               01855000
IOPBFTB3 EQU   IOPBFTB0+2                                               01856000
IOPBFTB2 EQU   IOPBFTB0+1                                               01857000
@NM00175 EQU   IOPBFTB1                                                 01858000
IOPBAPFP EQU   IOPBFTB1                                                 01859000
IOPBSSI  EQU   IOPBFTB1                                                 01860000
IOPBPAGA EQU   IOPBFTB1                                                 01861000
@NM00174 EQU   IOPBFTB1                                                 01862000
IOPBAOSL EQU   IOPBFTB1                                                 01863000
IOPBSEPA EQU   IOPBPDS+15                                               01864000
IOPBFTBL EQU   IOPBPDS+13                                               01865000
IOPBSTOR EQU   IOPBPDS+10                                               01866000
IOPBREFR EQU   IOPBLEP2                                                 01867000
IOPBLEF  EQU   IOPBLEP2                                                 01868000
IOPBTEST EQU   IOPBLEP2                                                 01869000
IOPBNE   EQU   IOPBLEP2                                                 01870000
@NM00172 EQU   IOPBLEP2                                                 01871000
IOPBDC   EQU   IOPBLEP2                                                 01872000
@NM00171 EQU   IOPBLEP1                                                 01873000
IOPBSCTR EQU   IOPBLEP1                                                 01874000
IOPBOL   EQU   IOPBLEP1                                                 01875000
@NM00170 EQU   IOPBLEP1                                                 01876000
IOPBOVLY EQU   IOPBLEP1                                                 01877000
IOPBREUS EQU   IOPBLEP1                                                 01878000
IOPBRENT EQU   IOPBLEP1                                                 01879000
IOPBNL   EQU   IOPBPDS+7                                                01880000
IOPBTTRN EQU   IOPBPDS+4                                                01881000
IOPBZERO EQU   IOPBPDS+3                                                01882000
IOPBTTRT EQU   IOPBPDS                                                  01883000
IOPPTIND EQU   IOPPTNTR+8                                               01884000
IOPPTSND EQU   IOPPTREL                                                 01885000
@NM00168 EQU   IOPPTSFX+872                                             01886000
IOPSYZPP EQU   IOPPTSFX+772                                             01887000
IOPSYZPR EQU   IOPPTSFX+771                                             01888000
IOPSYZPS EQU   IOPPTSFX+763                                             01889000
IOPSYZAP EQU   IOPPTSFX+755                                             01890000
IOPSYUPP EQU   IOPPTSFX+655                                             01891000
IOPSYUPR EQU   IOPPTSFX+654                                             01892000
IOPSYUPS EQU   IOPPTSFX+646                                             01893000
IOPSYUPD EQU   IOPPTSFX+638                                             01894000
IOPSYSPP EQU   IOPPTSFX+538                                             01895000
IOPSYSPR EQU   IOPPTSFX+537                                             01896000
IOPSYSPS EQU   IOPPTSFX+529                                             01897000
IOPSYSUP EQU   IOPPTSFX+521                                             01898000
IOPSYLKP EQU   IOPPTSFX+421                                             01899000
IOPSYLKR EQU   IOPPTSFX+420                                             01900000
IOPSYLKS EQU   IOPPTSFX+412                                             01901000
IOPSYLKD EQU   IOPPTSFX+404                                             01902000
IOPSYCPP EQU   IOPPTSFX+304                                             01903000
IOPSYCPR EQU   IOPPTSFX+303                                             01904000
IOPSYCPS EQU   IOPPTSFX+295                                             01905000
IOPSYCPY EQU   IOPPTSFX+287                                             01906000
IOPSYCOP EQU   IOPPTSFX+187                                             01907000
IOPSYCOR EQU   IOPPTSFX+186                                             01908000
IOPSYCOS EQU   IOPPTSFX+178                                             01909000
IOPSYCOM EQU   IOPPTSFX+170                                             01910000
IOPSYASP EQU   IOPPTSFX+70                                              01911000
IOPSYASR EQU   IOPPTSFX+69                                              01912000
IOPSYASS EQU   IOPPTSFX+61                                              01913000
IOPSYASM EQU   IOPPTSFX+53                                              01914000
@NM00167 EQU   IOPPTSFX+35                                              01915000
@NM00166 EQU   IOPPTFG1                                                 01916000
IOPPTSNJ EQU   IOPPTFG1                                                 01917000
IOPPTSNP EQU   IOPPTFG1                                                 01918000
IOPSYPLN EQU   IOPPTSFX+32                                              01919000
IOPDSPFX EQU   IOPPTSFX+6                                               01920000
IOPDSDIR EQU   IOPDSSPC+4                                               01921000
IOPDSSEC EQU   IOPDSSPC+2                                               01922000
IOPDSPRM EQU   IOPDSSPC                                                 01923000
@NM00165 EQU   IOPPTSDR+4                                               01924000
IOPPTPEM EQU   IOPPTSDR+2                                               01925000
IOPPCNVL EQU   IOPPTSDR+1                                               01926000
@NM00164 EQU   IOPPTSDR                                                 01927000
IOPQFMTP EQU   IOPQFMLS+8                                               01928000
@NM00163 EQU   IOPQFMLS+7                                               01929000
IOPQFMND EQU   IOPQFMNM                                                 01930000
@NM00162 EQU   IOPQFMDR                                                 01931000
@NM00158 EQU   IOPQSMDR                                                 01932000
@NM00157 EQU   IOPSBYNT+8                                               01933000
IOPSBYST EQU   IOPSBYNT+7                                               01934000
IOPSBYNM EQU   IOPSBYNT                                                 01935000
@NM00156 EQU   IOPVERNT+8                                               01936000
IOPVERST EQU   IOPVERNT+7                                               01937000
IOPVERNM EQU   IOPVERNT                                                 01938000
@NM00155 EQU   IOPDELNT+8                                               01939000
IOPDELST EQU   IOPDELNT+7                                               01940000
IOPDELNM EQU   IOPDELNT                                                 01941000
@NM00154 EQU   IOPFIDNT+8                                               01942000
IOPFIDST EQU   IOPFIDNT+7                                               01943000
IOPFIDNM EQU   IOPFIDNT                                                 01944000
@NM00153 EQU   IOPIRQNT+8                                               01945000
IOPIRQST EQU   IOPIRQNT+7                                               01946000
IOPIRQNM EQU   IOPIRQNT                                                 01947000
@NM00152 EQU   IOPREQNT+8                                               01948000
IOPREQST EQU   IOPREQNT+7                                               01949000
IOPREQNM EQU   IOPREQNT                                                 01950000
@NM00151 EQU   IOPSUPNT+8                                               01951000
IOPSUPST EQU   IOPSUPNT+7                                               01952000
IOPSUPNM EQU   IOPSUPNT                                                 01953000
@NM00150 EQU   IOPNPRNT+8                                               01954000
IOPNPRST EQU   IOPNPRNT+7                                               01955000
IOPNPRNM EQU   IOPNPRNT                                                 01956000
@NM00149 EQU   IOPPRENT+8                                               01957000
IOPPREST EQU   IOPPRENT+7                                               01958000
IOPPRENM EQU   IOPPRENT                                                 01959000
@NM00148 EQU   IOPSRLNT+8                                               01960000
IOPSRLST EQU   IOPSRLNT+7                                               01961000
@NM00147 EQU   IOPSRLNT+4                                               01962000
IOPSRLNM EQU   IOPSRLNT                                                 01963000
@NM00146 EQU   IOPENTNT+8                                               01964000
IOPENTST EQU   IOPENTNT+7                                               01965000
IOPENTNM EQU   IOPENTNT                                                 01966000
IOPPFMID EQU   IOPPTFFX+73                                              01967000
@NM00145 EQU   IOPPTPFX+24                                              01968000
IOPUCLT  EQU   IOPDATES+21                                              01969000
IOPUCLD  EQU   IOPDATES+18                                              01970000
IOPRSTT  EQU   IOPDATES+9                                               01971000
IOPRSTD  EQU   IOPDATES+6                                               01972000
IOPRECT  EQU   @NM00144+3                                               01973000
IOPRECD  EQU   @NM00144                                                 01974000
@NM00143 EQU   IOPPTFFX+8                                               01975000
@NM00142 EQU   @NM00140+7                                               01976000
IOPPRELN EQU   @NM00141                                                 01977000
@NM00139 EQU   IOPPTFDR+20                                              01978000
IOPSBYNO EQU   IOPPTFDR+13                                              01979000
IOPDBYNO EQU   IOPPTFDR+6                                               01980000
@NM00138 EQU   IOPPTFF3                                                 01981000
IOPFLF   EQU   IOPPTFF3                                                 01982000
IOPDBYP  EQU   IOPPTFF3                                                 01983000
IOPSBYP  EQU   IOPPTFF3                                                 01984000
IOPPMDLP EQU   IOPPTFF2+1                                               01985000
IOPPADDP EQU   IOPPTFF2+1                                               01986000
@NM00137 EQU   IOPPTFF2+1                                               01987000
IOPLRFP  EQU   IOPPTFF2                                                 01988000
IOPJCLP  EQU   IOPPTFF2                                                 01989000
IOPSUPP  EQU   IOPPTFF2                                                 01990000
IOPREQP  EQU   IOPPTFF2                                                 01991000
IOPPREP  EQU   IOPPTFF2                                                 01992000
IOPNPRP  EQU   IOPPTFF2                                                 01993000
IOPIRQP  EQU   IOPPTFF2                                                 01994000
IOPDELP  EQU   IOPPTFF2                                                 01995000
IOPREGEN EQU   IOPFLGS5                                                 01996000
IOPBYP   EQU   IOPFLGS5                                                 01997000
@NM00136 EQU   IOPFLGS5                                                 01998000
IOPERROR EQU   IOPFLGS5                                                 01999000
IOPACC   EQU   IOPFLGS5                                                 02000000
IOPRES   EQU   IOPFLGS5                                                 02001000
IOPAPP   EQU   IOPFLGS5                                                 02002000
@NM00135 EQU   IOPPTFDR                                                 02003000
IOPSYSTP EQU   IOPSYSTR+8                                               02004000
IOPSYSND EQU   IOPSYNTR                                                 02005000
@NM00134 EQU   IOPSYSFX+21                                              02006000
IOPSYSID EQU   IOPSYSFX+13                                              02007000
IOPNUCID EQU   IOPSYSFX+12                                              02008000
IOPSREL  EQU   IOPSYSFX+8                                               02009000
@NM00133 EQU   @NM00131+7                                               02010000
@NM00132 EQU   @NM00131                                                 02011000
@NM00130 EQU   IOPSYSDR+5                                               02012000
@NM00129 EQU   IOPFLGS7                                                 02013000
IOPSYNG  EQU   IOPFLGS7                                                 02014000
IOPSYDL  EQU   IOPFLGS7                                                 02015000
IOPSTSNP EQU   IOPFLGS7                                                 02016000
IOPMTSNP EQU   IOPFLGS7                                                 02017000
IOPPEMAX EQU   IOPSYSDR+2                                               02018000
IOPSCNVL EQU   IOPSYSDR+1                                               02019000
@NM00128 EQU   IOPSYSDR                                                 02020000
IOPDLIND EQU   IOPDNTRY+8                                               02021000
IOPDLBND EQU   IOPDSYS                                                  02022000
@NM00127 EQU   IOPDLBFX+8                                               02023000
@NM00126 EQU   @NM00124+7                                               02024000
@NM00125 EQU   @NM00124                                                 02025000
@NM00123 EQU   IOPDLBDR+1                                               02026000
@NM00122 EQU   IOPDLBDR                                                 02027000
@NM00121 EQU   IOPMODST                                                 02028000
IOPDLIB  EQU   IOPMODFX+72                                              02029000
@NM00120 EQU   IOPMODFX+12                                              02030000
@NM00119 EQU   IOPMODF4                                                 02031000
@NM00118 EQU   IOPMODF3                                                 02032000
@NM00117 EQU   IOPMODF2                                                 02033000
IOPMPAGA EQU   IOPMODF2                                                 02034000
IOPMNE   EQU   IOPMODF2                                                 02035000
@NM00116 EQU   IOPMODF1                                                 02036000
IOPMDC   EQU   IOPMODF1                                                 02037000
IOPMREFR EQU   IOPMODF1                                                 02038000
IOPMOVLY EQU   IOPMODF1                                                 02039000
IOPMSCTR EQU   IOPMODF1                                                 02040000
IOPMREUS EQU   IOPMODF1                                                 02041000
IOPMRENT EQU   IOPMODF1                                                 02042000
IOPMAPF  EQU   IOPMODF1                                                 02043000
@NM00115 EQU   @NM00113+7                                               02044000
@NM00114 EQU   @NM00113                                                 02045000
@NM00112 EQU   IOPMODDR+17                                              02046000
@NM00111 EQU   @NM00109+7                                               02047000
@NM00110 EQU   @NM00109                                                 02048000
@NM00108 EQU   @NM00105                                                 02049000
@NM00107 EQU   @NM00105                                                 02050000
@NM00106 EQU   @NM00105                                                 02051000
@NM00104 EQU   @NM00103                                                 02052000
@NM00102 EQU   IOPMODDR                                                 02053000
IOPSRIND EQU   IOPSNTRY+8                                               02054000
@NM00101 EQU   IOPSRCST                                                 02055000
IOPSRCND EQU   IOPSRCID                                                 02056000
IOPSRDLB EQU   IOPSRCFX+72                                              02057000
IOPSRSYS EQU   IOPSRCFX+64                                              02058000
@NM00100 EQU   IOPSRCFX+8                                               02059000
@NM00099 EQU   @NM00097+7                                               02060000
@NM00098 EQU   @NM00097                                                 02061000
@NM00096 EQU   IOPSRCDR+18                                              02062000
IOPSRLNG EQU   IOPSRCDR+17                                              02063000
@NM00095 EQU   @NM00093+7                                               02064000
@NM00094 EQU   @NM00093                                                 02065000
@NM00092 EQU   @NM00089                                                 02066000
@NM00091 EQU   @NM00089                                                 02067000
@NM00090 EQU   @NM00089                                                 02068000
@NM00088 EQU   @NM00087                                                 02069000
@NM00086 EQU   IOPSRCDR                                                 02070000
IOPEOFND EQU   IOPEOFNT                                                 02071000
IOPMCTYP EQU   IOPMCIND                                                 02072000
@NM00085 EQU   IOPMACST                                                 02073000
IOPMCDLB EQU   IOPMACFX+72                                              02074000
IOPMCSYS EQU   IOPMACFX+64                                              02075000
@NM00084 EQU   IOPMACFX+8                                               02076000
IOPBUTYP EQU   IOPBUNT+7                                                02077000
IOPBUSMD EQU   IOPBUNT                                                  02078000
@NM00083 EQU   IOPMACDR+18                                              02079000
IOPMCLNG EQU   IOPMACDR+17                                              02080000
IOPFMST  EQU   IOPFMIDE+7                                               02081000
IOPFMID  EQU   IOPFMIDE                                                 02082000
@NM00082 EQU   IOPRMST                                                  02083000
IOPRMASM EQU   IOPRMST                                                  02084000
@NM00081 EQU   IOPRMST                                                  02085000
IOPRMID  EQU   IOPRMIDE                                                 02086000
@NM00080 EQU   IOPMACDR                                                 02087000
IOPLMIND EQU   IOPLNTRY+8                                               02088000
IOPLMDND EQU   IOPSYSLB                                                 02089000
@NM00078 EQU   @NM00076+7                                               02090000
@NM00077 EQU   @NM00076                                                 02091000
@NM00075 EQU   IOPLMDDR+6                                               02092000
@NM00074 EQU   IOPFLGS3                                                 02093000
IOPCHREP EQU   IOPFLGS3                                                 02094000
IOPLINK  EQU   IOPFLGS3                                                 02095000
IOPCOPY  EQU   IOPFLGS3                                                 02096000
@NM00073 EQU   IOPLMDF4                                                 02097000
@NM00072 EQU   IOPLMDF3                                                 02098000
@NM00071 EQU   IOPLMDF2                                                 02099000
IOPPAGA  EQU   IOPLMDF2                                                 02100000
IOPNE    EQU   IOPLMDF2                                                 02101000
@NM00070 EQU   IOPFLGS2                                                 02102000
IOPDC    EQU   IOPFLGS2                                                 02103000
IOPREFR  EQU   IOPFLGS2                                                 02104000
IOPOVLY  EQU   IOPFLGS2                                                 02105000
IOPSCTR  EQU   IOPFLGS2                                                 02106000
IOPREUS  EQU   IOPFLGS2                                                 02107000
IOPRENT  EQU   IOPFLGS2                                                 02108000
IOPAPF   EQU   IOPFLGS2                                                 02109000
@NM00069 EQU   IOPLMDDR                                                 02110000
@NM00068 EQU   IOPASMDR+9                                               02111000
IOPABUTP EQU   IOPABUNT+7                                               02112000
IOPABUPT EQU   IOPABUNT                                                 02113000
IOPNTLVL EQU   IOPASMDR                                                 02114000
IOPALLOC EQU   @NM00067+4                                               02115000
IOPUSED  EQU   @NM00067                                                 02116000
IOPTPSEQ EQU   @NM00066+8                                               02117000
IOPVLSER EQU   @NM00066+2                                               02118000
IOPBLKSI EQU   @NM00066                                                 02119000
IOPCQMAX EQU   IOPCQMAP+12                                              02120000
@NM00065 EQU   IOPCQMAP+11                                              02121000
@NM00064 EQU   IOPCQMAP+8                                               02122000
@NM00063 EQU   IOPCQMAP                                                 02123000
IOPPTMAX EQU   IOPCDMAX                                                 02124000
@NM00062 EQU   IOPSCMAP+11                                              02125000
@NM00061 EQU   IOPSCMAP+8                                               02126000
@NM00060 EQU   IOPSCMAP                                                 02127000
IOPDIRMX EQU   IOPNTMAX+12                                              02128000
@NM00059 EQU   IOPNTMAX+11                                              02129000
@NM00058 EQU   IOPNTMAX+8                                               02130000
@NM00057 EQU   IOPNTMAX                                                 02131000
@NM00056 EQU   IOPDTYPE                                                 02132000
IOPDMOD  EQU   IOPDTYPE                                                 02133000
IOPDJCL  EQU   IOPDTYPE                                                 02134000
IOPDSRC  EQU   IOPDTYPE                                                 02135000
IOPDMAC  EQU   IOPDTYPE                                                 02136000
IOPSDIR  EQU   IOPSPACE+4                                               02137000
IOPSSCND EQU   IOPSPACE+2                                               02138000
IOPSPRIM EQU   IOPSPACE                                                 02139000
IOPDSN   EQU   IOPDYNDT                                                 02140000
IOPNTYPE EQU   IOPSTCMP+17                                              02141000
IOPNNAME EQU   IOPSTCMP+9                                               02142000
IOPOTYPE EQU   IOPSTCMP+8                                               02143000
IOPONAME EQU   IOPSTCMP                                                 02144000
IOPISEQ3 EQU   IOPINAM3+6                                               02145000
IOPITYP3 EQU   @NM00055+5                                               02146000
IOPIPTF3 EQU   @NM00055                                                 02147000
LISTEYY  EQU   LISTEDAT+4                                               02148000
LISTEDD  EQU   LISTEDAT+2                                               02149000
LISTEMM  EQU   LISTEDAT                                                 02150000
LISTBYY  EQU   LISTBDAT+4                                               02151000
LISTBDD  EQU   LISTBDAT+2                                               02152000
LISTBMM  EQU   LISTBDAT                                                 02153000
@NM00005 EQU   LISTPRM4                                                 02154000
LISTXREF EQU   LISTPRM4                                                 02155000
@NM00004 EQU   LISTPRM3+1                                               02156000
LISTERR  EQU   LISTPRM3+1                                               02157000
LISTBYP  EQU   LISTPRM3+1                                               02158000
LISTDEL  EQU   LISTPRM3+1                                               02159000
LISTNSUP EQU   LISTPRM3+1                                               02160000
LISTSUP  EQU   LISTPRM3+1                                               02161000
LISTUSER EQU   LISTPRM3                                                 02162000
LISTAPAR EQU   LISTPRM3                                                 02163000
LISTPTF  EQU   LISTPRM3                                                 02164000
LISTFUNC EQU   LISTPRM3                                                 02165000
LISTRES  EQU   LISTPRM3                                                 02166000
LISTNOAC EQU   LISTPRM3                                                 02167000
LISTNOAP EQU   LISTPRM3                                                 02168000
LISTALL3 EQU   LISTPRM3                                                 02169000
@NM00003 EQU   LISTPRM2+1                                               02170000
LISTMCS  EQU   LISTPRM2+1                                               02171000
LISTFMD  EQU   LISTPRM2+1                                               02172000
LISTSYS  EQU   LISTPRM2                                                 02173000
LISTDLB  EQU   LISTPRM2                                                 02174000
@NM00002 EQU   LISTPRM1+1                                               02175000
LISTLOG  EQU   LISTPRM1+1                                               02176000
@NM00001 EQU   LISTPRM1                                                 02177000
LISTPTS  EQU   LISTPRM1                                                 02178000
LISTACRQ EQU   LISTPRM1                                                 02179000
LISTCRQ  EQU   LISTPRM1                                                 02180000
LISTSCDS EQU   LISTPRM1                                                 02181000
LISTACDS EQU   LISTPRM1                                                 02182000
LISTALL1 EQU   LISTPRM1                                                 02183000
SPLIFIL  EQU   SPLODSN+33                                               02184000
SPLISMD  EQU   SPLODSN+26                                               02185000
SPLIPFX  EQU   SPLODSN                                                  02186000
SPLIUNPK EQU   SPLPUNPK+8                                               02187000
SPLOUNPK EQU   SPLPUNPK                                                 02188000
SPLOPACK EQU   SPLPPACK+8                                               02189000
SPLIPACK EQU   SPLPPACK                                                 02190000
@NM00181 EQU   HMASMGTP+27                                              02191000
GTPPSIZE EQU   GTPFLGS1                                                 02192000
@NM00180 EQU   GTPFLGS1                                                 02193000
GTPRCDNF EQU   GTPFLGS1                                                 02194000
GTPNOSPM EQU   GTPFLGS1                                                 02195000
GTPPOS   EQU   GTPRESTR+8                                               02196000
GTPRCD   EQU   GTPRESTR+4                                               02197000
GTPPAG   EQU   GTPRESTR                                                 02198000
GTPWKAD  EQU   HMASMGTP+8                                               02199000
@NM00179 EQU   HMASMGTP+2                                               02200000
IOPBS04E EQU   IOPBS04+2                                                02201000
IOPBAPFC EQU   IOPBAPF+1                                                02202000
IOPBAPFL EQU   IOPBAPF                                                  02203000
IOPBS2NM EQU   IOPBS02+3                                                02204000
IOPBS2EP EQU   IOPBS02                                                  02205000
IOPQSMTP EQU   IOPQSMLS+8                                               02206000
@NM00161 EQU   IOPQSMLS+7                                               02207000
IOPQSMND EQU   IOPQSMNM                                                 02208000
@NM00160 EQU   @NM00159+7                                               02209000
IOPQSMFM EQU   @NM00159                                                 02210000
@NM00079 EQU   IOPLMCTL+17                                              02211000
IOPLMCRD EQU   IOPLMCTL+9                                               02212000
IOPLMCRN EQU   IOPLMCTL+1                                               02213000
IOPLMCC  EQU   IOPLMCTL                                                 02214000
@NM00054 EQU   IOPUSERL                                                 02215000
@NM00053 EQU   IOPUSERL                                                 02216000
IOPALIS  EQU   IOPUSERL                                                 02217000
IOPTTR   EQU   IOPDRMAP+8                                               02218000
IOPINAM2 EQU   IOPINAM+1                                                02219000
IOPITYP2 EQU   IOPITYP                                                  02220000
@NM00052 EQU   HMASMIOP+32                                              02221000
IOPDELDD EQU   IOPDDNAM                                                 02222000
@NM00051 EQU   @NM00048+10                                              02223000
IOPSEQNO EQU   @NM00048+8                                               02224000
@NM00050 EQU   @NM00049+7                                               02225000
IOPPTFNM EQU   @NM00049                                                 02226000
CCABMREC EQU   CCABELMT+10                                              02227000
CCABPOS  EQU   CCABMPOS+8                                               02228000
CCABNAME EQU   CCABMPOS                                                 02229000
@NM00047 EQU   CCABLDLM+2                                               02230000
@NM00046 EQU   CCABLDLM                                                 02231000
CCAUPDPM EQU   @NM00044+24                                              02232000
@NM00045 EQU   @NM00044+21                                              02233000
CCARUPDT EQU   CCAUPDRC                                                 02234000
CCAUPDSP EQU   @NM00044+12                                              02235000
CCAUPDTE EQU   @NM00044+8                                               02236000
CCAUPDNM EQU   @NM00044                                                 02237000
CCASUPPM EQU   @NM00042+24                                              02238000
@NM00043 EQU   @NM00042+21                                              02239000
CCARSUP  EQU   CCASUPRC                                                 02240000
CCASUPSP EQU   @NM00042+12                                              02241000
CCAIOSUP EQU   @NM00042+8                                               02242000
CCASUPNM EQU   @NM00042                                                 02243000
CCAZAPPM EQU   @NM00040+24                                              02244000
@NM00041 EQU   @NM00040+21                                              02245000
CCARZAP  EQU   CCAZAPRC                                                 02246000
CCAZAPSP EQU   @NM00040+12                                              02247000
CCASPZAP EQU   @NM00040+8                                               02248000
CCAZAPNM EQU   @NM00040                                                 02249000
CCACOMPM EQU   @NM00038+24                                              02250000
@NM00039 EQU   @NM00038+21                                              02251000
CCARCOMP EQU   CCACOMRC                                                 02252000
CCACOMSP EQU   @NM00038+12                                              02253000
CCACOMRS EQU   @NM00038+8                                               02254000
CCACOMNM EQU   @NM00038                                                 02255000
CCACPYPM EQU   @NM00036+24                                              02256000
@NM00037 EQU   @NM00036+21                                              02257000
CCARCOPY EQU   CCACPYRC                                                 02258000
CCACPYSP EQU   @NM00036+12                                              02259000
CCACOPY  EQU   @NM00036+8                                               02260000
CCACPYNM EQU   @NM00036                                                 02261000
CCAASMPM EQU   @NM00034+24                                              02262000
@NM00035 EQU   @NM00034+21                                              02263000
CCARASM  EQU   CCAASMRC                                                 02264000
CCAASMSP EQU   @NM00034+12                                              02265000
CCAASM   EQU   @NM00034+8                                               02266000
CCAASMNM EQU   @NM00034                                                 02267000
CCALKDPM EQU   @NM00032+24                                              02268000
@NM00033 EQU   @NM00032+21                                              02269000
CCARLINK EQU   CCALKDRC                                                 02270000
CCALKDSP EQU   @NM00032+12                                              02271000
CCALKED  EQU   @NM00032+8                                               02272000
CCALKDNM EQU   @NM00032                                                 02273000
CCAPGMPM EQU   @NM00030+24                                              02274000
@NM00031 EQU   @NM00030+21                                              02275000
CCABPGRC EQU   @NM00030+20                                              02276000
CCABPGSP EQU   @NM00030+12                                              02277000
CCABPGAD EQU   @NM00030+8                                               02278000
CCABPGNM EQU   @NM00030                                                 02279000
CCAEND   EQU   HMASMCCA+371                                             02280000
@NM00029 EQU   HMASMCCA+309                                             02281000
CCACURDD EQU   CCAFDSNG+3                                               02282000
CCACURDS EQU   CCAFDSNG+2                                               02283000
@NM00028 EQU   CCAFLAGB                                                 02284000
CCAOUTNG EQU   CCAFLAGB                                                 02285000
CCALOGNG EQU   CCAFLAGB                                                 02286000
CCAFMID  EQU   HMASMCCA+291                                             02287000
CCALSTDS EQU   CCAFCTL+8                                                02288000
CCARPTDS EQU   CCAFCTL+7                                                02289000
CCATIME  EQU   CCAFCTL+4                                                02290000
CCADATE  EQU   CCAFCTL+1                                                02291000
@NM00027 EQU   CCAFLAG9                                                 02292000
CCARVCAN EQU   CCAFLAG9                                                 02293000
CCARVEST EQU   CCAFLAG9                                                 02294000
CCAPTSNJ EQU   CCAFLAG9                                                 02295000
CCASTSNP EQU   CCAFLAG9                                                 02296000
CCAMTSNP EQU   CCAFLAG9                                                 02297000
CCAPTSNP EQU   CCAFLAG9                                                 02298000
@NM00026 EQU   CCAFLAG8                                                 02299000
CCAACDSC EQU   CCAFLAG8                                                 02300000
CCACDSC  EQU   CCAFLAG8                                                 02301000
@NM00025 EQU   CCAFLAG6                                                 02302000
CCAACRUP EQU   CCAFLAG6                                                 02303000
CCACRQUP EQU   CCAFLAG6                                                 02304000
CCAACDUP EQU   CCAFLAG6                                                 02305000
CCACDSUP EQU   CCAFLAG6                                                 02306000
@NM00024 EQU   CCAFLAG5                                                 02307000
CCAACROS EQU   CCAFLAG5                                                 02308000
CCACRQOS EQU   CCAFLAG5                                                 02309000
CCAACDOS EQU   CCAFLAG5                                                 02310000
CCACDSOS EQU   CCAFLAG5                                                 02311000
@NM00023 EQU   CCAFLAG4                                                 02312000
CCAACRIS EQU   CCAFLAG4                                                 02313000
CCACRQIS EQU   CCAFLAG4                                                 02314000
CCAACDIS EQU   CCAFLAG4                                                 02315000
CCACDSIS EQU   CCAFLAG4                                                 02316000
@NM00022 EQU   CCAFLAG3+1                                               02317000
CCARGNP  EQU   CCAFLAG3+1                                               02318000
CCADISRQ EQU   CCAFLAG3+1                                               02319000
CCAICTOK EQU   CCAFLAG3                                                 02320000
CCADELP  EQU   CCAFLAG3                                                 02321000
CCACMPRS EQU   CCAFLAG3                                                 02322000
CCAZAPP  EQU   CCAFLAG3                                                 02323000
CCALINKP EQU   CCAFLAG3                                                 02324000
CCACOPYP EQU   CCAFLAG3                                                 02325000
CCAASIP  EQU   CCAFLAG3                                                 02326000
CCAUPDP  EQU   CCAFLAG3                                                 02327000
CCAEOSMP EQU   CCAFLAG2                                                 02328000
CCAEOFNC EQU   CCAFLAG2                                                 02329000
@NM00021 EQU   CCAFLAG2                                                 02330000
CCACHECK EQU   CCAFLAG2                                                 02331000
CCATERM  EQU   CCAFLAG2                                                 02332000
CCASVCLB EQU   CCAFLAG2                                                 02333000
CCANCPTF EQU   CCAFLAG2                                                 02334000
@NM00020 EQU   CCAFLAG1+1                                               02335000
CCAUNL   EQU   CCAFLAG1+1                                               02336000
CCARESET EQU   CCAFLAG1+1                                               02337000
CCALOG   EQU   CCAFLAG1+1                                               02338000
CCACNV   EQU   CCAFLAG1+1                                               02339000
CCALIST  EQU   CCAFLAG1                                                 02340000
CCAUPDU  EQU   CCAFLAG1                                                 02341000
CCAUPDJ  EQU   CCAFLAG1                                                 02342000
CCARES   EQU   CCAFLAG1                                                 02343000
CCAREJ   EQU   CCAFLAG1                                                 02344000
CCAACCPT EQU   CCAFLAG1                                                 02345000
CCAAPPLY EQU   CCAFLAG1                                                 02346000
CCAREC   EQU   CCAFLAG1                                                 02347000
CCAFUNCT EQU   CCAFFUNC                                                 02348000
@NM00019 EQU   @NM00014+18                                              02349000
@NM00018 EQU   @NM00014+16                                              02350000
CCATBLPA EQU   @NM00014+12                                              02351000
@NM00017 EQU   @NM00014+8                                               02352000
@NM00016 EQU   @NM00014+4                                               02353000
@NM00015 EQU   @NM00014                                                 02354000
CCAIFGTP EQU   CCAFGTP+16                                               02355000
CCAGTP3  EQU   CCAFGTP+12                                               02356000
CCAGTP2  EQU   CCAFGTP+8                                                02357000
CCAGTP1  EQU   CCAFGTP+4                                                02358000
CCASETAD EQU   CCASEGTP                                                 02359000
CCACLST  EQU   CCAFPGM+12                                               02360000
CCASPDCB EQU   CCAFPGM+8                                                02361000
CCAICLMD EQU   CCAFICT+12                                               02362000
CCAICMOD EQU   CCAFICT+8                                                02363000
CCAICPTF EQU   CCAFICT+4                                                02364000
CCAICT   EQU   CCAFICT                                                  02365000
CCARVAD  EQU   CCAFSTA                                                  02366000
CCAACDID EQU   CCAFSYS+32                                               02367000
CCACDSID EQU   CCAFSYS+24                                               02368000
CCALNLEN EQU   CCAFSYS+22                                               02369000
@NM00013 EQU   CCAFLAGA                                                 02370000
CCAPSYSF EQU   CCAFLAGA                                                 02371000
CCAASYSF EQU   CCAFLAGA                                                 02372000
CCACSYSF EQU   CCAFLAGA                                                 02373000
CCANUCID EQU   CCAFSYS+20                                               02374000
CCAASREL EQU   CCAFSYS+16                                               02375000
CCACSREL EQU   CCASREL                                                  02376000
CCAPEMAX EQU   CCAFSYS+10                                               02377000
CCAPGLEN EQU   CCAFSYS+8                                                02378000
CCAIOPAS EQU   CCAFSYS+4                                                02379000
CCAIOPCS EQU   CCAFSYS                                                  02380000
CCAPESIZ EQU   CCAFIOP+4                                                02381000
CCAIOPTR EQU   CCAFIOP                                                  02382000
@NM00012 EQU   CCAFLAG7+3                                               02383000
CCALOGP  EQU   CCAFLAG7+2                                               02384000
CCAOUTP  EQU   CCAFLAG7+2                                               02385000
CCASLBP  EQU   CCAFLAG7+2                                               02386000
CCARPTP  EQU   CCAFLAG7+2                                               02387000
CCALISTP EQU   CCAFLAG7+2                                               02388000
CCAJCLP  EQU   CCAFLAG7+2                                               02389000
CCAPTFP  EQU   CCAFLAG7+2                                               02390000
CCATLBP  EQU   CCAFLAG7+2                                               02391000
CCAUT3P  EQU   CCAFLAG7+1                                               02392000
CCAUT2P  EQU   CCAFLAG7+1                                               02393000
CCAUT1P  EQU   CCAFLAG7+1                                               02394000
CCAWK5P  EQU   CCAFLAG7+1                                               02395000
CCAWK4P  EQU   CCAFLAG7+1                                               02396000
CCAWK3P  EQU   CCAFLAG7+1                                               02397000
CCAWK2P  EQU   CCAFLAG7+1                                               02398000
CCAWK1P  EQU   CCAFLAG7+1                                               02399000
CCAACRQP EQU   CCAFLAG7                                                 02400000
CCACRQP  EQU   CCAFLAG7                                                 02401000
CCASTSP  EQU   CCAFLAG7                                                 02402000
CCAMTSP  EQU   CCAFLAG7                                                 02403000
CCAPTSP  EQU   CCAFLAG7                                                 02404000
CCASCDSP EQU   CCAFLAG7                                                 02405000
CCAACDSP EQU   CCAFLAG7                                                 02406000
CCACDSP  EQU   CCAFLAG7                                                 02407000
@NM00011 EQU   CCAFBUFR+122                                             02408000
@NM00010 EQU   CCAFBUFR+120                                             02409000
@NM00009 EQU   CCAFBUFR+118                                             02410000
CCATBFMX EQU   CCAFBUFR+116                                             02411000
CCA4BFMX EQU   CCAFBUFR+114                                             02412000
CCA3BFMX EQU   CCAFBUFR+112                                             02413000
CCA2BFMX EQU   CCAFBUFR+110                                             02414000
CCA1BFMX EQU   CCAFBUFR+108                                             02415000
CCAXBFMX EQU   CCAFBUFR+106                                             02416000
CCAQBFMX EQU   CCAFBUFR+104                                             02417000
CCASBFMX EQU   CCAFBUFR+102                                             02418000
CCAMBFMX EQU   CCAFBUFR+100                                             02419000
CCAPBFMX EQU   CCAFBUFR+98                                              02420000
CCAVBFMX EQU   CCAFBUFR+96                                              02421000
CCAABFMX EQU   CCAFBUFR+94                                              02422000
CCACBFMX EQU   CCAFBUFR+92                                              02423000
@NM00008 EQU   CCAFBUFR+88                                              02424000
@NM00007 EQU   CCAFBUFR+84                                              02425000
CCA4BFSZ EQU   CCAFBUFR+80                                              02426000
CCATBFSZ EQU   CCAFBUFR+76                                              02427000
CCAWBFSZ EQU   CCAFBUFR+72                                              02428000
CCAQBFSZ EQU   CCAFBUFR+68                                              02429000
CCAPBFSZ EQU   CCAFBUFR+64                                              02430000
CCAVBFSZ EQU   CCAFBUFR+60                                              02431000
CCACBFSZ EQU   CCAFBUFR+56                                              02432000
@NM00006 EQU   CCAFBUFR+52                                              02433000
CCA4BFOA EQU   CCAFBUFR+48                                              02434000
CCA4BFIA EQU   CCAFBUFR+44                                              02435000
CCATBFIA EQU   CCAFBUFR+40                                              02436000
CCAWBFOA EQU   CCAFBUFR+36                                              02437000
CCAWBFIA EQU   CCAFBUFR+32                                              02438000
CCAQBFOA EQU   CCAFBUFR+28                                              02439000
CCAQBFIA EQU   CCAFBUFR+24                                              02440000
CCAPBFOA EQU   CCAFBUFR+20                                              02441000
CCAPBFIA EQU   CCAFBUFR+16                                              02442000
CCAVBFOA EQU   CCAFBUFR+12                                              02443000
CCAVBFIA EQU   CCAFBUFR+8                                               02444000
CCACBFOA EQU   CCAFBUFR+4                                               02445000
CCACBFIA EQU   CCAFBUFR                                                 02446000
CCAID    EQU   HMASMCCA                                                 02447000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02448000
@RC00187 EQU   @RC00183                                                 02449000
@RC00200 EQU   @RC00196                                                 02450000
@ENDDATA EQU   *                                                        02451000
         END   HMASMXRF,(C'PLS2240',0802,78334)                         02452000
./  ADD  SSI=83340431,NAME=HMASMZAP
         TITLE 'HMASMZAP - SMP SUPERZAP INTERFACE'                      00001000
HMASMZAP CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMZAP  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  LA    @10,4095(,@12)                                      0001 00011000
         USING @PSTART,@12                                         0001 00012000
         USING @PSTART+4095,@10                                    0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @08,@SA00001                                        0001 00015000
         ST    @08,8(,@13)                                         0001 00016000
         LR    @13,@08                                             0001 00017000
*   ZAPRTNCD=ZERO;                  /* INIT RC AREA          @YA07506*/ 00018000
         MVI   ZAPRTNCD,X'00'                                      0211 00019000
*   IOPPTR=CCAIOPTR;                /* INITIALIZE POINTER TO IOP     */ 00020000
         L     IOPPTR,CCAIOPTR(,CCAPTR)                            0212 00021000
*   HMASMMGP=''B;                   /* CLEAR MESSAGE PARAMETER LIST     00022000
*                                                            @Z67SP00*/ 00023000
         XC    HMASMMGP(40),HMASMMGP                               0213 00024000
*   MGPPRINT=ON;                    /* INDICATE PRINTER              */ 00025000
*   MGPHLDS=ON;                     /*                       @PI04500*/ 00026000
         OI    MGPPRINT,B'10010000'                                0215 00027000
*   SAVBUFAD=IOPBUFAD;              /* * SAVE IOP BUFFER ADDRESS     */ 00028000
         L     @15,IOPBUFAD(,IOPPTR)                               0216 00029000
         ST    @15,SAVBUFAD                                        0216 00030000
         EJECT                                                          00031000
*                                                                  0217 00032000
*   /*****************************************************************/ 00033000
*   /*                                                               */ 00034000
*   /* LOOP THROUGH PTFS THAT CONTAIN ZAPS, THAT ARE NOT COMPLETE AND*/ 00035000
*   /* NOT NOGO. SET VERIFY PASS. PROCESS EACH MODULE, BY LOAD       */ 00036000
*   /* MODULE, BY READING SUPERZAP CONTROL STATEMENTS FROM ENTRY ON  */ 00037000
*   /* SMPWRK, VALIDITY CHECKING STATEMENTS, AND WRITTING STATEMENTS */ 00038000
*   /* REQUIRED FOR VERIFY PASS TO SYSUT1. INVOKE SUPERZAP WITH      */ 00039000
*   /* SYSUT1 AS SYSIN FOR EACH LIBRARY REQUIRED. REPEAT FOR EACH    */ 00040000
*   /* LOAD MODULE. THEN SWITCH TO REPLACE PASS AND REPEAT ENTIRE    */ 00041000
*   /* PROCESS. IF PTF LEVEL ERROR, MARK PTF NOGO AND PROCESS NEXT   */ 00042000
*   /* PTF. IF SMP LEVEL, MARK PTF NOGO AND PERFORM EXIT PROCESSING. */ 00043000
*   /* AFTER ALL PTFS ARE PROCESSED, PERFORM EXIT PROCESSING.        */ 00044000
*   /*                                                       @Z40SP00*/ 00045000
*   /*                                                               */ 00046000
*   /*****************************************************************/ 00047000
*                                                                  0217 00048000
*   DO I=1 TO MX WHILE ICTPEND(I)¬=ICTENDNT/* TILL END OF PTFS     0217 00049000
*                                                            @Z40SP00*/ 00050000
*         &ZAPRTNCD<STOPFUNC;       /*                       @Z67SP00*/ 00051000
         LA    @15,1                                               0217 00052000
         STH   @15,I                                               0217 00053000
@DL00217 MH    @15,@CH01885                                        0217 00054000
         L     @08,CCAICPTF(,CCAPTR)                               0217 00055000
         ST    @15,@TF00001                                        0217 00056000
         ALR   @15,@08                                             0217 00057000
         AL    @15,@CF01901                                        0217 00058000
         MVC   @TF00002(4),ICTPEND(@15)                            0217 00059000
         L     @15,@TF00002                                        0217 00060000
         CL    @15,ICTENDNT                                        0217 00061000
         BE    @DC00217                                            0217 00062000
         CLI   ZAPRTNCD,12                                         0217 00063000
         BNL   @DC00217                                            0217 00064000
*     ZFLAGS1=ZERO;                 /* ZERO FLAGS                    */ 00065000
         MVI   ZFLAGS1,X'00'                                       0218 00066000
*     ZFLAGS2=ZERO;                 /* ZERO FLAGS                    */ 00067000
         MVI   ZFLAGS2,X'00'                                       0219 00068000
*     VERPASS=ON;                   /* INDICATE NOW IN VERIFY PASS   */ 00069000
         OI    VERPASS,B'00000100'                                 0220 00070000
*     IF ICTPNOGO(I)=ON             /* OR THE MODULE IS MARKED NOGO  */ 00071000
*         |ICTPECPL(I)=ON           /* OR THE PTF MARKED COMPLETE  0221 00072000
*                                                            @Z67SP00*/ 00073000
*       THEN                                                       0221 00074000
         LR    @15,@08                                             0221 00075000
         AL    @15,@TF00001                                        0221 00076000
         AL    @15,@CF01903                                        0221 00077000
         TM    ICTPNOGO-8(@15),B'01000000'                         0221 00078000
         BO    @RT00221                                            0221 00079000
         AL    @08,@TF00001                                        0221 00080000
         AL    @08,@CF01904                                        0221 00081000
         TM    ICTPECPL-14(@08),B'01000000'                        0221 00082000
         BO    @RT00221                                            0221 00083000
*       GO TO HMAZP050;             /* GET NEXT PTF                  */ 00084000
         EJECT                                                          00085000
*                                                                  0223 00086000
*     /***************************************************************/ 00087000
*     /*                                                             */ 00088000
*     /* MODULE LOOP. PROCESS EACH MODULE THAT IS ZAP TYPE, NOT NOGO,*/ 00089000
*     /* AND NOT COMPLETE.                                   @Z40SP00*/ 00090000
*     /*                                                             */ 00091000
*     /***************************************************************/ 00092000
*                                                                  0223 00093000
*HMAZP010:                                                         0223 00094000
*     DO J=1 TO MX WHILE ICTIXP(J)¬=ICTENDIX;/* TILL END OF MODS   0223 00095000
*                                                            @Z40SP00*/ 00096000
HMAZP010 LA    @15,1                                               0223 00097000
         STH   @15,J                                               0223 00098000
@DL00223 SLA   @15,2                                               0223 00099000
         LH    @08,I                                               0223 00100000
         MH    @08,@CH01885                                        0223 00101000
         L     @01,CCAICPTF(,CCAPTR)                               0223 00102000
         AL    @01,@CF01905                                        0223 00103000
         L     @08,ICTPCHN-64(@08,@01)                             0223 00104000
         AL    @08,@CF01906                                        0223 00105000
         L     @15,ICTIXP(@15,@08)                                 0223 00106000
         CL    @15,ICTENDIX                                        0223 00107000
         BE    @DC00223                                            0223 00108000
*       IF ICTMZAP(1)=ON&           /* IF THIS MODULE CONTAINS A   0224 00109000
*                                      SUPERZAP                      */ 00110000
*           ICTMISEL(1)=ON          /* SELECTED ELEMENT      @Z67SP00*/ 00111000
*           &ICTMCPL(1)=OFF         /* AND THE MODULE IS NOT COMPLETE*/ 00112000
*         THEN                                                     0224 00113000
         TM    ICTMZAP(@15),B'00100000'                            0224 00114000
         BNO   @RF00224                                            0224 00115000
         TM    ICTMISEL(@15),B'10000000'                           0224 00116000
         BNO   @RF00224                                            0224 00117000
         TM    ICTMCPL(@15),B'00100000'                            0224 00118000
         BNZ   @RF00224                                            0224 00119000
*         DO;                                                      0225 00120000
*           ICTMPROC(1)=ON;         /* MOD BEING PROCESSED   @Z67SP00*/ 00121000
         OI    ICTMPROC(@15),B'10000000'                           0226 00122000
*           DODUMP=OFF;             /* RESET DUMP CARD FOUND SW IN 0227 00123000
*                                      CASE OF BAD LMOD WHICH WOULD     00124000
*                                      NOT GO THRU NAME LOGIC      0227 00125000
*                                                            @ZA01311*/ 00126000
*                                                                  0227 00127000
         NI    DODUMP,B'11111011'                                  0227 00128000
*           /*********************************************************/ 00129000
*           /*                                                       */ 00130000
*           /* LOAD MODULE LOOP. PROCESS EACH LOAD MODULE FOR THIS   */ 00131000
*           /* MODULE.                                       @Z40SP00*/ 00132000
*           /*                                                       */ 00133000
*           /*********************************************************/ 00134000
*                                                                  0228 00135000
*           DO K=1 TO MX WHILE ICTIXM(K)¬=ICTENDIX;/* TILL END LMODS    00136000
*                                                            @Z40SP00*/ 00137000
         LA    @15,1                                               0228 00138000
         STH   @15,K                                               0228 00139000
@DL00228 SLA   @15,2                                               0228 00140000
         LH    @08,J                                               0228 00141000
         SLA   @08,2                                               0228 00142000
         LH    @07,I                                               0228 00143000
         MH    @07,@CH01885                                        0228 00144000
         L     @01,CCAICPTF(,CCAPTR)                               0228 00145000
         AL    @01,@CF01905                                        0228 00146000
         L     @01,ICTPCHN-64(@07,@01)                             0228 00147000
         AL    @01,@CF01906                                        0228 00148000
         L     @08,ICTIXP(@08,@01)                                 0228 00149000
         MVC   @TF00001(4),ICTMCHN(@08)                            0228 00150000
         L     @01,@TF00001                                        0228 00151000
         AL    @01,@CF01906                                        0228 00152000
         L     @15,ICTIXM(@15,@01)                                 0228 00153000
         CL    @15,ICTENDIX                                        0228 00154000
         BE    @DC00228                                            0228 00155000
*             ANYUT1=OFF;           /* ASSUME POSSIBILITY THAT SYSUT1   00156000
*                                      NOT WRITTEN           @SA71755*/ 00157000
*             ZAPFLSH=OFF;          /* IN CASE PREVIOUS LMOD ZAP WAS    00158000
*                                      FLUSHED TO EOF        @SA71755*/ 00159000
         NI    ANYUT1,B'11011110'                                  0230 00160000
*             TWONAME=OFF;          /* CANNOT ASSUME TWO OPERAND NAME   00161000
*                                      CARD                  @Z40SP00*/ 00162000
*             ONENAME=OFF;          /* CANNOT ASSUME ONE OPERAND NAME   00163000
*                                      CARD                  @Z40SP00*/ 00164000
*             NAMESCH=OFF;          /* ASSUME NAME CARD NOT SCANNED     00165000
*                                                            @Z40SP00*/ 00166000
*             BRSW=OFF;             /* ASSUME NAME CARD NOT SCANNED     00167000
*                                      AND WRITTEN           @Z40SP00*/ 00168000
         NI    TWONAME,B'00001111'                                 0234 00169000
*                                                                  0235 00170000
*             /*******************************************************/ 00171000
*             /*                                                     */ 00172000
*             /* LOCATE MODULE ON SMPWRK. WRITE A SUPERZAP COMMENT   */ 00173000
*             /* STATEMENT ON SYSUT1 FOR INPUT TO IMASPZAP.  @Z40SP00*/ 00174000
*             /*                                                     */ 00175000
*             /*******************************************************/ 00176000
*                                                                  0235 00177000
*             IOPRETRN=IOPGOOD;     /* INSURE RETURN CODE IS ZERO TO    00178000
*                                      START                 @Z40SP00*/ 00179000
         MVI   IOPRETRN(IOPPTR),X'00'                              0235 00180000
*             IOPDSID=IOPWKX;       /* SET DATA SET TO WRK   @Z67SP00*/ 00181000
         MVI   IOPDSID(IOPPTR),X'28'                               0236 00182000
*             IOPFUNCT=IOPLOC;      /* INDICATE LOCATE FUNCTION      */ 00183000
         MVI   IOPFUNCT(IOPPTR),X'03'                              0237 00184000
*             IOPNAME=ICTMNAME(1);  /* INDICATE NAME TO READ         */ 00185000
         MVC   IOPNAME(8,IOPPTR),ICTMNAME(@08)                     0238 00186000
*             IOPTYPE=IOPZAP;       /* SET WRK ENTRY TYPE    @Z67SP00*/ 00187000
         MVI   IOPTYPE(IOPPTR),X'0C'                               0239 00188000
*             CALL HMASMIO(HMASMIOP);/* CALL IO ROUTINE              */ 00189000
         ST    IOPPTR,@AL00001                                     0240 00190000
         L     @15,@CV01807                                        0240 00191000
         LA    @01,@AL00001                                        0240 00192000
         BALR  @14,@15                                             0240 00193000
*             IF IOPRETRN¬=IOPGOOD  /* ERROR?                @YA07506*/ 00194000
*               THEN                                               0241 00195000
         CLI   IOPRETRN(IOPPTR),0                                  0241 00196000
         BE    @RF00241                                            0241 00197000
*               DO;                 /* YES --                @YA07506*/ 00198000
*                 ZAPRTNCD=MAX(ZAPRTNCD,STOPSMP);/*          @Z67SP00*/ 00199000
         SLR   @15,@15                                             0243 00200000
         IC    @15,ZAPRTNCD                                        0243 00201000
         LA    @08,16                                              0243 00202000
         CR    @15,@08                                             0243 00203000
         BNL   *+6                                                      00204000
         LR    @15,@08                                             0243 00205000
         STC   @15,ZAPRTNCD                                        0243 00206000
*                 ZAPERROR=ON;      /* I/O ERROR             @Z67SP00*/ 00207000
         OI    ZAPERROR,B'00000001'                                0244 00208000
*                 GO TO HMAZP050;   /* FLUXH EXIT            @Z67SP00*/ 00209000
         B     HMAZP050                                            0245 00210000
*               END;                /*                       @YA07506*/ 00211000
*             ELSE                  /* OK TO CONTINUE        @Z67SP00*/ 00212000
*               DO;                 /*                       @Z67SP00*/ 00213000
@RF00241 DS    0H                                                  0248 00214000
*                 IOPFUNCT=IOPPOSI; /* POSITION WRK FOR INPUT        */ 00215000
         MVI   IOPFUNCT(IOPPTR),X'02'                              0248 00216000
*                 CALL HMASMIO(HMASMIOP);/* DO IO                    */ 00217000
         ST    IOPPTR,@AL00001                                     0249 00218000
         L     @15,@CV01807                                        0249 00219000
         LA    @01,@AL00001                                        0249 00220000
         BALR  @14,@15                                             0249 00221000
*                 IF IOPRETRN=IOPGOOD/* OK ?                 @Z67SP00*/ 00222000
*                   THEN            /* YES                   @YA07506*/ 00223000
         CLI   IOPRETRN(IOPPTR),0                                  0250 00224000
         BNE   @RF00250                                            0250 00225000
*                   DO;             /*                       @Z67SP00*/ 00226000
*                     HDRPTF=ICTPTFS(I);/* PUT PTF NUM IN HDR      0252 00227000
*                                                            @YA06930*/ 00228000
         LH    @15,I                                               0252 00229000
         MH    @15,@CH01885                                        0252 00230000
         L     @08,CCAICPTF(,CCAPTR)                               0252 00231000
         ST    @15,@TF00001                                        0252 00232000
         ALR   @15,@08                                             0252 00233000
         AL    @15,@CF01901                                        0252 00234000
         MVC   HDRPTF(7),ICTPTFS(@15)                              0252 00235000
*                     HDRMOD=ICTMNAME(1);/* PUT MOD NAME IN HDR    0253 00236000
*                                                            @YA06930*/ 00237000
         LH    @15,J                                               0253 00238000
         SLA   @15,2                                               0253 00239000
         L     @01,@TF00001                                        0253 00240000
         AL    @08,@CF01905                                        0253 00241000
         L     @08,ICTPCHN-64(@01,@08)                             0253 00242000
         AL    @08,@CF01906                                        0253 00243000
         L     @15,ICTIXP(@15,@08)                                 0253 00244000
         MVC   HDRMOD(8),ICTMNAME(@15)                             0253 00245000
*                     IOPBUFAD=ADDR(HDRRCD);/* PTR TO RCD TO WRITE 0254 00246000
*                                                            @YA06930*/ 00247000
         LA    @15,HDRRCD                                          0254 00248000
         ST    @15,IOPBUFAD(,IOPPTR)                               0254 00249000
*                     IOPFUNCT=IOPWRITE;/* SET TO WRITE HEADER RCD 0255 00250000
*                                                            @YA06930*/ 00251000
         MVI   IOPFUNCT(IOPPTR),X'51'                              0255 00252000
*                     IOPDSID=IOPSCR1;/* INDICATE UTILITY SYSUT1   0256 00253000
*                                                            @YA06930*/ 00254000
         MVI   IOPDSID(IOPPTR),X'03'                               0256 00255000
*                     CALL HMASMIO(HMASMIOP);/* ENSURE SYSUT1 OPEN IN   00256000
*                                      CASE OF MISSING ZAP NAME CARD    00257000
*                                                            @YA06930*/ 00258000
         ST    IOPPTR,@AL00001                                     0257 00259000
         L     @15,@CV01807                                        0257 00260000
         LA    @01,@AL00001                                        0257 00261000
         BALR  @14,@15                                             0257 00262000
*                     IOPBUFAD=SAVBUFAD;/* RESTORE BUF PTR TO DRV BUF   00263000
*                                                            @YA06930*/ 00264000
         L     @15,SAVBUFAD                                        0258 00265000
         ST    @15,IOPBUFAD(,IOPPTR)                               0258 00266000
*                   END;            /*                       @Z67SP00*/ 00267000
*                 IF IOPRETRN>IOPGOOD/* WRITE OK?            @YA07506*/ 00268000
*                   THEN                                           0260 00269000
@RF00250 CLI   IOPRETRN(IOPPTR),0                                  0260 00270000
         BNH   @RF00260                                            0260 00271000
*                   DO;             /* NO - MESSAGE AND TERMINATE  0261 00272000
*                                                            @YA06930*/ 00273000
*                     ZAPERROR=ON;  /* CONTROL SW            @Z67SP00*/ 00274000
         OI    ZAPERROR,B'00000001'                                0262 00275000
*                     ZAPRTNCD=MAX(ZAPRTNCD,IOPRETRN);/* SET RC    0263 00276000
*                                                            @YA07506*/ 00277000
         SLR   @15,@15                                             0263 00278000
         IC    @15,ZAPRTNCD                                        0263 00279000
         SLR   @08,@08                                             0263 00280000
         IC    @08,IOPRETRN(,IOPPTR)                               0263 00281000
         CR    @15,@08                                             0263 00282000
         BNL   *+6                                                      00283000
         LR    @15,@08                                             0263 00284000
         STC   @15,ZAPRTNCD                                        0263 00285000
*                     IOPBUFAD=SAVBUFAD;/* RESTORE BUFFER ADDRES   0264 00286000
*                                                            @YA06930*/ 00287000
         L     @15,SAVBUFAD                                        0264 00288000
         ST    @15,IOPBUFAD(,IOPPTR)                               0264 00289000
*                     GO TO HMAZP050;/* EXIT                 @Z67SP00*/ 00290000
         B     HMAZP050                                            0265 00291000
*                   END;            /*                       @YA06930*/ 00292000
*               END;                /*                       @Z67SP00*/ 00293000
@RF00260 DS    0H                                                  0268 00294000
*                                                                  0268 00295000
*             /*******************************************************/ 00296000
*             /*                                                     */ 00297000
*             /* READ MODULES SUPERZAP STATEMENTS FROM SMPWRK TILL   */ 00298000
*             /* EOF, WRITING STATEMENTS TO SYSUT1. AFTER EOF ON     */ 00299000
*             /* SMPWRK, INVOKE SUPERZAP WITH SYSUT1 AS SYSIN.       */ 00300000
*             /*                                             @Z40SP00*/ 00301000
*             /*                                                     */ 00302000
*             /*******************************************************/ 00303000
*                                                                  0268 00304000
*             DO WHILE IOPRETRN¬=IOPEOF;/* DO UNTIL END OF FILE    0268 00305000
*                                                            @YA07506*/ 00306000
         B     @DE00268                                            0268 00307000
@DL00268 DS    0H                                                  0269 00308000
*               IOPDSID=IOPWKX;     /* INDICATE WRK DATA SET @Z67SP00*/ 00309000
         MVI   IOPDSID(IOPPTR),X'28'                               0269 00310000
*               IOPFUNCT=IOPREAD;   /* READ FUNCTION                 */ 00311000
         MVI   IOPFUNCT(IOPPTR),X'01'                              0270 00312000
*               CALL HMASMIO(HMASMIOP);/* DO THE READ                */ 00313000
         ST    IOPPTR,@AL00001                                     0271 00314000
         L     @15,@CV01807                                        0271 00315000
         LA    @01,@AL00001                                        0271 00316000
         BALR  @14,@15                                             0271 00317000
*               IF IOPRETRN=IOPEOF  /* IS IT EOF?            @YA07506*/ 00318000
*                 THEN                                             0272 00319000
         CLI   IOPRETRN(IOPPTR),4                                  0272 00320000
         BE    @RT00272                                            0272 00321000
*                 GO TO HMAZP040;   /* YES - INVOKE SUPERZAP         */ 00322000
*               IF IOPRETRN>IOPEOF  /* IF AN IO ERROR        @YA07506*/ 00323000
*                 THEN                                             0274 00324000
         CLI   IOPRETRN(IOPPTR),4                                  0274 00325000
         BNH   @RF00274                                            0274 00326000
*                 DO;               /*                       @YA07506*/ 00327000
*                   ZAPERROR=ON;    /* ERROR SW              @Z67SP00*/ 00328000
         OI    ZAPERROR,B'00000001'                                0276 00329000
*                   ZAPRTNCD=MAX(ZAPRTNCD,IOPRETRN,/* SET RC @YA07506*/ 00330000
*                       STOPPTF);   /*                       @Z67SP00*/ 00331000
         SLR   @15,@15                                             0277 00332000
         IC    @15,ZAPRTNCD                                        0277 00333000
         SLR   @08,@08                                             0277 00334000
         IC    @08,IOPRETRN(,IOPPTR)                               0277 00335000
         CR    @15,@08                                             0277 00336000
         BNL   *+6                                                      00337000
         LR    @15,@08                                             0277 00338000
         LA    @08,8                                               0277 00339000
         CR    @15,@08                                             0277 00340000
         BNL   *+6                                                      00341000
         LR    @15,@08                                             0277 00342000
         STC   @15,ZAPRTNCD                                        0277 00343000
*                   IOPFUNCT=IOPCLOSE;/* INDICATE CLOSE OPERATION    */ 00344000
         MVI   IOPFUNCT(IOPPTR),X'50'                              0278 00345000
*                   IOPDSID=IOPSCR1;/* INDICATE SCRATCH DATA SET     */ 00346000
         MVI   IOPDSID(IOPPTR),X'03'                               0279 00347000
*                   CALL HMASMIO(HMASMIOP);/* CLOSE SYSUT1           */ 00348000
         ST    IOPPTR,@AL00001                                     0280 00349000
         L     @15,@CV01807                                        0280 00350000
         LA    @01,@AL00001                                        0280 00351000
         BALR  @14,@15                                             0280 00352000
*                   GO TO HMAZP050; /* GET NEXT PTF                  */ 00353000
         B     HMAZP050                                            0281 00354000
*                 END;                                             0282 00355000
*                                                                  0282 00356000
*               /*****************************************************/ 00357000
*               /*                                                   */ 00358000
*               /* SCAN RECORD FOR TYPE                              */ 00359000
*               /*                                                   */ 00360000
*               /*****************************************************/ 00361000
*                                                                  0283 00362000
*               CMNTSW=OFF;         /* SET SW TO NOT COMMENT SETTING    00363000
*                                                            @OY01955*/ 00364000
@RF00274 DS    0H                                                  0284 00365000
*               DUMPSW=OFF;         /* SET DUMP SW TO NOT DUMP     0284 00366000
*                                      SETTING               @OY01965*/ 00367000
         NI    CMNTSW,B'11100111'                                  0284 00368000
*               ANYTWO=OFF;         /* SET NO SECOND NAME    @ZA01311*/ 00369000
         NI    ANYTWO,B'11111101'                                  0285 00370000
*               SCPEOR=ZERO;        /* CLEAR SCAN END OF RECORD FLAGS*/ 00371000
         MVI   SCPEOR,X'00'                                        0286 00372000
*               SCPCHAR=IOPBUFAD;   /* ADDRESS OF RECORD TO SCAN     */ 00373000
         L     @15,IOPBUFAD(,IOPPTR)                               0287 00374000
         ST    @15,SCPCHAR                                         0287 00375000
*               SCPSRCH=ADDR(KCMNT);/* POINTER TO DSCAN ARGUMENTS    */ 00376000
         LA    @15,KCMNT                                           0288 00377000
         ST    @15,SCPSRCH                                         0288 00378000
*               LMNAME=BLANK;       /* BLANK LMOD FILLER     @YA08143*/ 00379000
         MVI   LMNAME+1,C' '                                       0289 00380000
         MVC   LMNAME+2(6),LMNAME+1                                0289 00381000
         MVI   LMNAME,C' '                                         0289 00382000
*               SECNAME=BLANK;      /* BLANK CSECT FILLER    @YA08143*/ 00383000
         MVI   SECNAME+1,C' '                                      0290 00384000
         MVC   SECNAME+2(6),SECNAME+1                              0290 00385000
         MVI   SECNAME,C' '                                        0290 00386000
*               SCPINLN=71;         /* LENGTH OF RECORD TO SCAN      */ 00387000
         MVC   SCPINLN(2),@CH01036                                 0291 00388000
*               CALL HMASMSCN(HMASMSCP);/* CALL SCAN ROUTINE         */ 00389000
         L     @15,@CV01804                                        0292 00390000
         LA    @01,@AL00292                                        0292 00391000
         BALR  @14,@15                                             0292 00392000
*               IF SCPRET>SCPGOOD   /* IF BAD RETURN CODE FROM SCAN     00393000
*                                                            @YA07506*/ 00394000
*                 THEN                                             0293 00395000
         CLI   SCPRET,0                                            0293 00396000
         BNH   @RF00293                                            0293 00397000
*                 DO;               /*                       @YA07506*/ 00398000
*                   ZAPERROR=ON;    /* ERROR SW              @Z67SP00*/ 00399000
         OI    ZAPERROR,B'00000001'                                0295 00400000
*                   IF SCPRET¬>SCPBAD/* SYNTAX ERROR?        @YA07506*/ 00401000
*                     THEN                                         0296 00402000
         CLI   SCPRET,4                                            0296 00403000
         BH    @RF00296                                            0296 00404000
*                     ZAPRTNCD=MAX(ZAPRTNCD,STOPPTF);/* SET RC TO  0297 00405000
*                                      STOPPTF               @YA07506*/ 00406000
         SLR   @15,@15                                             0297 00407000
         IC    @15,ZAPRTNCD                                        0297 00408000
         LA    @08,8                                               0297 00409000
         CR    @15,@08                                             0297 00410000
         BNL   *+6                                                      00411000
         LR    @15,@08                                             0297 00412000
         STC   @15,ZAPRTNCD                                        0297 00413000
*                   ELSE                                           0298 00414000
*                     ZAPRTNCD=MAX(ZAPRTNCD,SCPRET);/* ELSE SET TO 0298 00415000
*                                      SCAN ERR              @YA07506*/ 00416000
         B     @RC00296                                            0298 00417000
@RF00296 SLR   @15,@15                                             0298 00418000
         IC    @15,ZAPRTNCD                                        0298 00419000
         SLR   @08,@08                                             0298 00420000
         IC    @08,SCPRET                                          0298 00421000
         CR    @15,@08                                             0298 00422000
         BNL   *+6                                                      00423000
         LR    @15,@08                                             0298 00424000
         STC   @15,ZAPRTNCD                                        0298 00425000
*                   IF ZAPRTNCD>=STOPFUNC/* KILL FUNCTION?   @YA07506*/ 00426000
*                     THEN                                         0299 00427000
@RC00296 CLI   ZAPRTNCD,12                                         0299 00428000
         BNL   @RT00299                                            0299 00429000
*                     GO TO HMAZP050;/* EXIT                 @Z67SP00*/ 00430000
*                   GO TO HMAZP032; /* PRINT MESSAGE AND GET NEXT PTF*/ 00431000
         B     HMAZP032                                            0301 00432000
*                 END;              /*                       @YA07506*/ 00433000
*                                                                  0302 00434000
*               /*****************************************************/ 00435000
*               /*                                                   */ 00436000
*               /* VALIDITY CHECK SUPERZAP NAME STATEMENTS   @Z40SP00*/ 00437000
*               /*                                                   */ 00438000
*               /*****************************************************/ 00439000
*                                                                  0303 00440000
*               IF NAMESCH=ON       /* JUST SCANNED NAME CRD @ZA01311*/ 00441000
*                   &ANYTWO=OFF     /* AND DID NOT HIT SECOND OPERAND   00442000
*                                      ON NAME CARD          @ZA01311*/ 00443000
*                 THEN              /* THEN MUST BE ONE OPER @ZA01311*/ 00444000
@RF00293 TM    NAMESCH,B'10000000'                                 0303 00445000
         BNO   @RF00303                                            0303 00446000
         TM    ANYTWO,B'00000010'                                  0303 00447000
         BNZ   @RF00303                                            0303 00448000
*                 ONENAME=ON;       /* ONLY, SET SW          @ZA01311*/ 00449000
         OI    ONENAME,B'01000000'                                 0304 00450000
*               IF SCPRET=SCPGOOD   /* IF RETURN FROM SCAN IS ZERO 0305 00451000
*                                                            @YA07506*/ 00452000
*                 THEN                                             0305 00453000
@RF00303 CLI   SCPRET,0                                            0305 00454000
         BNE   @RF00305                                            0305 00455000
*                 DO;                                              0306 00456000
*                   IF NOWRITE=ON   /* IF NOWRITE TO SYSUT1 IS ON    */ 00457000
*                     THEN                                         0307 00458000
         TM    NOWRITE,B'10000000'                                 0307 00459000
         BNO   @RF00307                                            0307 00460000
*                     DO;                                          0308 00461000
*                       NOWRITE=OFF;/* CLEAR NOWRITE SW              */ 00462000
         NI    NOWRITE,B'01111111'                                 0309 00463000
*                       GO TO HMAZP035;/* GET NEXT RECORD            */ 00464000
         B     HMAZP035                                            0310 00465000
*                     END;                                         0311 00466000
*                   IF DUMPSW=ON    /* WAS THIS DUMP CARD?   @SA70966*/ 00467000
*                     THEN          /* YES                   @SA70966*/ 00468000
@RF00307 TM    DUMPSW,B'00001000'                                  0312 00469000
         BO    @RT00312                                            0312 00470000
*                     GO TO HMAZP110;/* GO TO NAME/DUMP BUILD ROUT 0313 00471000
*                                                            @SA70966*/ 00472000
*                   IF BRSW=ON      /* IF NAME PROCCESSED AND      0314 00473000
*                                      WRITTEN, THEN THIS CARD IS  0314 00474000
*                                      VALID,                @Z40SP00*/ 00475000
*                       |CMNTSW=ON  /* OR, THIS WAS ZAP COMMENT CARD    00476000
*                                                            @OY01955*/ 00477000
*                     THEN                                         0314 00478000
         TM    BRSW,B'00010000'                                    0314 00479000
         BO    @RT00314                                            0314 00480000
         TM    CMNTSW,B'00010000'                                  0314 00481000
         BO    @RT00314                                            0314 00482000
*                     GO TO HMAZP120;/* GO WRITE THIS RECORD         */ 00483000
*                 END;                                             0316 00484000
*               IF TWONAME=ON       /* JUST SCANNED A TWO OPERAND  0317 00485000
*                                      NAME CARD                     */ 00486000
*                   &ZAPKILL=OFF    /* AND NOT INVALID LMOD? @SA71755*/ 00487000
*                 THEN              /* YES --                @OS70966*/ 00488000
@RF00305 TM    TWONAME,B'00100000'                                 0317 00489000
         BNO   @RF00317                                            0317 00490000
         TM    ZAPKILL,B'00000010'                                 0317 00491000
         BZ    @RT00317                                            0317 00492000
*                 GO TO HMAZP110;   /* GO TO NAME CARD BUILD ROUTINE    00493000
*                                                            @OS70966*/ 00494000
*               IF NAMESCH=ON       /* IF A VALID ONE OPERAND NAME 0319 00495000
*                                      CARD OR AN INVALID TWO OPERAND   00496000
*                                      NAME CARD JUST SCANNED      0319 00497000
*                                                            @Z40SP00*/ 00498000
*                 THEN              /* THEN -----            @Z40SP00*/ 00499000
@RF00317 TM    NAMESCH,B'10000000'                                 0319 00500000
         BNO   @RF00319                                            0319 00501000
*                 DO;                                              0320 00502000
*                   IF ZAPFLSH=ON   /* IS THIS NAME CARD BEING     0321 00503000
*                                      FLUSHED BECAUSE IT DOES NOT 0321 00504000
*                                      BELONG TO THE LMOD IN PROCESS?   00505000
*                                                            @Z40SP00*/ 00506000
*                     THEN          /* YES - IGNORE CONTROL CARDS    */ 00507000
         TM    ZAPFLSH,B'00100000'                                 0321 00508000
         BNO   @RF00321                                            0321 00509000
*                     DO;                                          0322 00510000
*                       IF ZAPKILL=ON/* IF LMOD IS INVALID ON TWO  0323 00511000
*                                      OPERAND NAME CARD     @SA71755*/ 00512000
*                         THEN                                     0323 00513000
         TM    ZAPKILL,B'00000010'                                 0323 00514000
         BNO   @RF00323                                            0323 00515000
*                         DO;       /* THEN KILL THIS PTF AND CLOSE     00516000
*                                      UTILITY SYSUT1        @SA71755*/ 00517000
*                           ZAPKILL=OFF;/* RST THE MOD FLUSH @SA71755*/ 00518000
         NI    ZAPKILL,B'11111101'                                 0325 00519000
*                           MGPCLEAR=''B;/* CLEAR MSG LIST   @Z67SP00*/ 00520000
         XC    MGPCLEAR(6),MGPCLEAR                                0326 00521000
*                           MGPMGNO1=HMA284I;/* PRIM. MSG.   @SA71755*/ 00522000
         MVC   MGPMGNO1(2),@CH00521                                0327 00523000
*                           MGPMGNO2=PART015;/* SECON. MSG.  @SA71755*/ 00524000
         MVC   MGPMGNO2(2),@CH00064                                0328 00525000
*                           MGPVARPT(1)=ADDR(ICTPTF(I));/* ADDR OF 0329 00526000
*                                      PTF NAME              @SA71755*/ 00527000
         LH    @15,I                                               0329 00528000
         MH    @15,@CH01885                                        0329 00529000
         L     @08,CCAICPTF(,CCAPTR)                               0329 00530000
         LA    @01,0(@15,@08)                                      0329 00531000
         AL    @01,@CF01901                                        0329 00532000
         ST    @01,MGPVARPT                                        0329 00533000
*                           MGPVARPT(2)=ADDR(ICTMOD(1));/* ADDR OF 0330 00534000
*                                      MOD NAME              @SA71755*/ 00535000
         LH    @07,J                                               0330 00536000
         SLA   @07,2                                               0330 00537000
         AL    @08,@CF01905                                        0330 00538000
         L     @15,ICTPCHN-64(@15,@08)                             0330 00539000
         AL    @15,@CF01906                                        0330 00540000
         L     @15,ICTIXP(@07,@15)                                 0330 00541000
         ST    @15,MGPVARPT+4                                      0330 00542000
*                           MGPTYPE=MGPERR;/* MESSAGE SEVERITY     0331 00543000
*                                                            @ZD00001*/ 00544000
         MVI   MGPTYPE,X'03'                                       0331 00545000
*                           CALL HMASMMSG(HMASMMGP);/* CALL MESS   0332 00546000
*                                      ROUTINE               @SA71755*/ 00547000
         L     @15,@CV01808                                        0332 00548000
         LA    @01,@AL00332                                        0332 00549000
         BALR  @14,@15                                             0332 00550000
*                           ZAPERROR=ON;/* ERROR SW          @Z67SP00*/ 00551000
         OI    ZAPERROR,B'00000001'                                0333 00552000
*                           ICTPVERJ(I)=ON;/* PTF HAS VERIFY REJECT     00553000
*                                                            @Z40SP00*/ 00554000
         LH    @15,I                                               0334 00555000
         MH    @15,@CH01885                                        0334 00556000
         L     @08,CCAICPTF(,CCAPTR)                               0334 00557000
         ALR   @08,@15                                             0334 00558000
         AL    @08,@CF01903                                        0334 00559000
         OI    ICTPVERJ-8(@08),B'00001000'                         0334 00560000
*                           ZAPRTNCD=MAX(ZAPRTNCD,STOPPTF);/* SET RC    00561000
*                                      TO STOPPTF            @YA07506*/ 00562000
         SLR   @15,@15                                             0335 00563000
         IC    @15,ZAPRTNCD                                        0335 00564000
         LA    @08,8                                               0335 00565000
         CR    @15,@08                                             0335 00566000
         BNL   *+6                                                      00567000
         LR    @15,@08                                             0335 00568000
         STC   @15,ZAPRTNCD                                        0335 00569000
*                           IOPDSID=IOPSCR1;/* INDICATE SCRATCH DATA    00570000
*                                      SET                   @SA71755*/ 00571000
         MVI   IOPDSID(IOPPTR),X'03'                               0336 00572000
*                           IOPFUNCT=IOPCLOSE;/* INDICATE CLOSE    0337 00573000
*                                      OPERATION             @SA71755*/ 00574000
         MVI   IOPFUNCT(IOPPTR),X'50'                              0337 00575000
*                           CALL HMASMIO(HMASMIOP);/* CLOSE SYSUT1 0338 00576000
*                                      UTILITY               @SA71755*/ 00577000
         ST    IOPPTR,@AL00001                                     0338 00578000
         L     @15,@CV01807                                        0338 00579000
         LA    @01,@AL00001                                        0338 00580000
         BALR  @14,@15                                             0338 00581000
*                           ZAPRTNCD=MAX(ZAPRTNCD,IOPRETRN);/* SET RC   00582000
*                                                            @Z67SP00*/ 00583000
         SLR   @15,@15                                             0339 00584000
         IC    @15,ZAPRTNCD                                        0339 00585000
         SLR   @08,@08                                             0339 00586000
         IC    @08,IOPRETRN(,IOPPTR)                               0339 00587000
         CR    @15,@08                                             0339 00588000
         BNL   *+6                                                      00589000
         LR    @15,@08                                             0339 00590000
         STC   @15,ZAPRTNCD                                        0339 00591000
*                           IF ZAPRTNCD>=STOPFUNC/* KILL FUNCTION OR    00592000
*                                      SMP?                  @YA07506*/ 00593000
*                             THEN                                 0340 00594000
         CLI   ZAPRTNCD,12                                         0340 00595000
         BNL   @RT00340                                            0340 00596000
*                             GO TO HMAZP050;/* EXIT         @Z67SP00*/ 00597000
*                           GO TO HMAZP048;/* GO TO NEXT MOD TO FLAG    00598000
*                                      ANY OTHERS THAT MAY BE IN   0342 00599000
*                                      ERROR FOR THIS PTF.   @SA71755*/ 00600000
         B     HMAZP048                                            0342 00601000
*                         END;      /*                       @SA71755*/ 00602000
*                       ELSE        /* LMOD ZAP FLUSH ONLY   @SA71755*/ 00603000
*                         GO TO HMAZP035;/* GO GET NEXT RCRD @SA71755*/ 00604000
*                     END;                                         0345 00605000
*                   GO TO HMAZP110; /* GO TO NAME ROUTINE            */ 00606000
         B     HMAZP110                                            0346 00607000
*                 END;                                             0347 00608000
*               ELSE                /* MUST BE VALID NON-NAME CARD 0348 00609000
*                                      BEFORE ANY VALID NAME CARD  0348 00610000
*                                      FOUND                 @Z40SP00*/ 00611000
*                 IF ZAPFLSH=OFF    /* HOWEVER, IF THIS ZAP CARD IS     00612000
*                                      BEING FLUSHED BECAUSE IT DOES    00613000
*                                      NOT BELONG TO THE LMOD IN   0348 00614000
*                                      PROCESS, THEN FLUSHED CARDS 0348 00615000
*                                      SHOULD NOT GIVE ERROR MESSAGES   00616000
*                                                            @SA71755*/ 00617000
*                   THEN            /*                       @SA71755*/ 00618000
@RF00319 TM    ZAPFLSH,B'00100000'                                 0348 00619000
         BNZ   @RF00348                                            0348 00620000
*HMAZP032:                                                         0349 00621000
*                   DO;             /* PRINT ZAP CARD IN ERROR AND   */ 00622000
HMAZP032 DS    0H                                                  0350 00623000
*                     ZAPERROR=ON;  /* ERROR SW              @Z67SP00*/ 00624000
         OI    ZAPERROR,B'00000001'                                0350 00625000
*                     PRLFLGS=ZERO; /* ZERO OUT FLAG BITS    @OY01956*/ 00626000
         LA    @15,PRLBUF                                          0351 00627000
         MVI   PRLFLGS(@15),X'00'                                  0351 00628000
*                     PRLDATA(LENGTH(DASHES)+1:LENGTH(DASHES)+LENGTH(   00629000
*                         BUFFER))=BUFFER;/* MOVE ZAP CONTROL CARD TO   00630000
*                                      OUTPUT BUFFER         @OY01956*/ 00631000
         L     @08,IOPBUFAD(,IOPPTR)                               0352 00632000
         MVC   PRLDATA+10(80,@15),BUFFER(@08)                      0352 00633000
*                     PRLRLEN=LENGTH(DASHES)+LENGTH(BUFFER);/* SET 0353 00634000
*                                      LINE LENGTH           @OY01956*/ 00635000
         MVC   PRLRLEN(2,@15),@CH00531                             0353 00636000
*                     IOPBUFAD=ADDR(HMASMPRL);/* SET IO PARM LIST TO    00637000
*                                      BUFFER                @OY01956*/ 00638000
         ST    @15,IOPBUFAD(,IOPPTR)                               0354 00639000
*                     IOPFUNCT=IOPWRITE;/* SET TO WRITE      @OY01956*/ 00640000
         MVI   IOPFUNCT(IOPPTR),X'51'                              0355 00641000
*                     IOPDSID=IOPPRINT;/* WRITE TO PRINTER   @OY01956*/ 00642000
         MVI   IOPDSID(IOPPTR),X'0B'                               0356 00643000
*                     CALL HMASMIO(HMASMIOP);/* DO WRITE     @OY01956*/ 00644000
         ST    IOPPTR,@AL00001                                     0357 00645000
         L     @15,@CV01807                                        0357 00646000
         LA    @01,@AL00001                                        0357 00647000
         BALR  @14,@15                                             0357 00648000
*                     ZAPRTNCD=MAX(ZAPRTNCD,IOPRETRN);/* SET RC    0358 00649000
*                                                            @Z67SP00*/ 00650000
         SLR   @15,@15                                             0358 00651000
         IC    @15,ZAPRTNCD                                        0358 00652000
         SLR   @08,@08                                             0358 00653000
         IC    @08,IOPRETRN(,IOPPTR)                               0358 00654000
         CR    @15,@08                                             0358 00655000
         BNL   *+6                                                      00656000
         LR    @15,@08                                             0358 00657000
         STC   @15,ZAPRTNCD                                        0358 00658000
*                     IF ZAPRTNCD>=STOPFUNC/* KILL FUNCTION OR SMP?     00659000
*                                                            @YA07506*/ 00660000
*                       THEN                                       0359 00661000
         CLI   ZAPRTNCD,12                                         0359 00662000
         BNL   @RT00359                                            0359 00663000
*                       GOTO HMAZP050;/* EXIT                @Z67SP00*/ 00664000
*                     IOPBUFAD=SAVBUFAD;/* RESET BUFFER      @OY01956*/ 00665000
         L     @15,SAVBUFAD                                        0361 00666000
         ST    @15,IOPBUFAD(,IOPPTR)                               0361 00667000
*                     OUTREC='';    /* REINIT. BUFFER AREA   @OY01956*/ 00668000
         MVI   OUTREC,C' '                                         0362 00669000
         MVC   OUTREC+1(79),OUTREC                                 0362 00670000
*                     MGPCLEAR=''B; /* CLEAR MESSAGE PARAMETER LIST     00671000
*                                                            @Z67SP00*/ 00672000
         XC    MGPCLEAR(6),MGPCLEAR                                0363 00673000
*                     MGPMGNO1=HMA231I;/* INDICATE MESSAGE NUMBER 4  */ 00674000
         MVC   MGPMGNO1(2),@CH00083                                0364 00675000
*                     MGPMGNO2=PART015;/* PART TWO OF MESSAGE        */ 00676000
         MVC   MGPMGNO2(2),@CH00064                                0365 00677000
*                     MGPMGNO3=PART011;/* PART THREE OF MESSAGE      */ 00678000
         MVC   MGPMGNO3(2),@CH00435                                0366 00679000
*                     MGPVARPT(1)=ADDR(ICTMOD(1));/* ADDRESS OF MOD  */ 00680000
         LH    @15,J                                               0367 00681000
         SLA   @15,2                                               0367 00682000
         LH    @08,I                                               0367 00683000
         MH    @08,@CH01885                                        0367 00684000
         L     @07,CCAICPTF(,CCAPTR)                               0367 00685000
         LA    @01,0(@08,@07)                                      0367 00686000
         AL    @01,@CF01905                                        0367 00687000
         L     @01,ICTPCHN-64(,@01)                                0367 00688000
         AL    @01,@CF01906                                        0367 00689000
         L     @15,ICTIXP(@15,@01)                                 0367 00690000
         ST    @15,MGPVARPT                                        0367 00691000
*                     MGPVARPT(2)=ADDR(ICTPTF(I));/* ADDRESS OF PTF  */ 00692000
         AL    @07,@CF01901                                        0368 00693000
         LA    @15,ICTPTF(@08,@07)                                 0368 00694000
         ST    @15,MGPVARPT+4                                      0368 00695000
*                     MGPTYPE=MGPERR;/* MESSAGE SEVERITY     @ZD00001*/ 00696000
         MVI   MGPTYPE,X'03'                                       0369 00697000
*                     CALL HMASMMSG(HMASMMGP);/* CALL MESSAGE ROUTINE*/ 00698000
         L     @15,@CV01808                                        0370 00699000
         LA    @01,@AL00370                                        0370 00700000
         BALR  @14,@15                                             0370 00701000
*                     MGPMGNO3=ZERO;/* SET TERCIARY MSG BACK TO 0  0371 00702000
*                                                            @SA71276*/ 00703000
         SLR   @15,@15                                             0371 00704000
         STH   @15,MGPMGNO3                                        0371 00705000
*                     ICTPVERJ(I)=ON;/* PTF HAS VERIFY REJECT      0372 00706000
*                                                            @Z40SP00*/ 00707000
         LH    @15,I                                               0372 00708000
         MH    @15,@CH01885                                        0372 00709000
         L     @08,CCAICPTF(,CCAPTR)                               0372 00710000
         ALR   @08,@15                                             0372 00711000
         AL    @08,@CF01903                                        0372 00712000
         OI    ICTPVERJ-8(@08),B'00001000'                         0372 00713000
*                     GO TO HMAZP050;/* MARK PTF IN ERROR            */ 00714000
         B     HMAZP050                                            0373 00715000
*                   END;                                           0374 00716000
*HMAZP035:                                                         0375 00717000
*             END;                  /* END OF WRK READ LOOP          */ 00718000
@RF00348 DS    0H                                                  0375 00719000
HMAZP035 DS    0H                                                  0375 00720000
@DE00268 CLI   IOPRETRN(IOPPTR),4                                  0375 00721000
         BNE   @DL00268                                            0375 00722000
*                                                                  0376 00723000
*             /*******************************************************/ 00724000
*             /*                                                     */ 00725000
*             /* AT THIS POINT ALL SUPERZAP CONTROL STATEMENTS FOR A */ 00726000
*             /* GIVEN MODULE HAVE BEEN SCANNED. IT MAY BE THE FIRST */ 00727000
*             /* (VER) PASS, OR THE SECOND(REP) PASS. THE UTILITY    */ 00728000
*             /* FILE CONTAINS SUPERZAP SYSIN AND MUST BE CLOSED AND */ 00729000
*             /* SUPERZAP INVOKED. IF THE RETURN CODE FROM SUPERZAP  */ 00730000
*             /* INDICATES SUCCESSFUL COMPLETION THEN THE NEXT PTF   */ 00731000
*             /* WILL BE CHECKED IF IN REP PASS. OR THE REP PASS WILL*/ 00732000
*             /* BE INITIATED IF IN THE VER PASS. IF IN VERIFY PASS  */ 00733000
*             /* AND SUPERZAP RETURN CODE IS GREATER THAN ZERO THE   */ 00734000
*             /* PTF IS MARKED IN ERROR AND PROCESSING CONTINUES. IF */ 00735000
*             /* IN THE REP PASS AND THE RETURN CODE IS GREATER THAN */ 00736000
*             /* THE IMASPZAP RETURN CODE THRESHOLD, THEN THE PTF IS */ 00737000
*             /* MARKED IN ERROR AND PROCESSING CONTINUES.   @Z40SP00*/ 00738000
*             /*                                                     */ 00739000
*             /*******************************************************/ 00740000
*                                                                  0376 00741000
*HMAZP040:                                                         0376 00742000
*             IOPDSID=IOPSCR1;      /* INDICATE SCRATCH DATA SET     */ 00743000
HMAZP040 MVI   IOPDSID(IOPPTR),X'03'                               0376 00744000
*             IOPFUNCT=IOPCLOSE;    /* INDICATE CLOSE FUNCTION       */ 00745000
         MVI   IOPFUNCT(IOPPTR),X'50'                              0377 00746000
*             CALL HMASMIO(HMASMIOP);/* CALL IO ROUTINE TO CLOSE DATA   00747000
*                                      SET                           */ 00748000
         ST    IOPPTR,@AL00001                                     0378 00749000
         L     @15,@CV01807                                        0378 00750000
         LA    @01,@AL00001                                        0378 00751000
         BALR  @14,@15                                             0378 00752000
*             ZAPRTNCD=MAX(ZAPRTNCD,IOPRETRN);/* SET RC      @Z67SP00*/ 00753000
         SLR   @15,@15                                             0379 00754000
         IC    @15,ZAPRTNCD                                        0379 00755000
         SLR   @08,@08                                             0379 00756000
         IC    @08,IOPRETRN(,IOPPTR)                               0379 00757000
         CR    @15,@08                                             0379 00758000
         BNL   *+6                                                      00759000
         LR    @15,@08                                             0379 00760000
         STC   @15,ZAPRTNCD                                        0379 00761000
*             IF ZAPRTNCD>=STOPFUNC /* KILL FUNCTION OR SMP? @YA07506*/ 00762000
*               THEN                /*                       @Z67SP00*/ 00763000
         CLI   ZAPRTNCD,12                                         0380 00764000
         BL    @RF00380                                            0380 00765000
*               DO;                 /*                       @Z67SP00*/ 00766000
*                 ZAPERROR=ON;      /*                       @Z67SP00*/ 00767000
         OI    ZAPERROR,B'00000001'                                0382 00768000
*                 GOTO HMAZP050;    /* EXIT                  @Z67SP00*/ 00769000
         B     HMAZP050                                            0383 00770000
*               END;                /*                       @Z67SP00*/ 00771000
*             IF ANYUT1=ON          /* IF SYSUT1 IS WRITTEN - INVOKE    00772000
*                                      ZAP                   @SA71755*/ 00773000
*               THEN                                               0385 00774000
@RF00380 TM    ANYUT1,B'00000001'                                  0385 00775000
         BNO   @RF00385                                            0385 00776000
*               DO;                 /* OTHERWISE SYSUT1 NULL - NO  0386 00777000
*                                      NEED FOR ZAP          @SA71755*/ 00778000
*                 RFY                                              0387 00779000
*                  (R2) RSTD;       /* RESTRICT REG 2                */ 00780000
*HMAZP045:                                                         0388 00781000
*                                                                  0388 00782000
*                 /***************************************************/ 00783000
*                 /*                                                 */ 00784000
*                 /* CREATE CDS/ACDS SYSMOD ENTRIES.         @Z67SP00*/ 00785000
*                 /*                                                 */ 00786000
*                 /***************************************************/ 00787000
*                                                                  0388 00788000
*                 CALL HMASMSEC(ICTPTFS(I),ADDR(HMASMIOP));/*      0388 00789000
*                                                            @Z67SP00*/ 00790000
HMAZP045 LH    @15,I                                               0388 00791000
         MH    @15,@CH01885                                        0388 00792000
         L     @08,CCAICPTF(,CCAPTR)                               0388 00793000
         AL    @08,@CF01901                                        0388 00794000
         LA    @15,ICTPTFS(@15,@08)                                0388 00795000
         ST    @15,@AL00001                                        0388 00796000
         ST    IOPPTR,@TF00001                                     0388 00797000
         LA    @15,@TF00001                                        0388 00798000
         ST    @15,@AL00001+4                                      0388 00799000
         L     @15,@CV01805                                        0388 00800000
         LA    @01,@AL00001                                        0388 00801000
         BALR  @14,@15                                             0388 00802000
*                 RFY               /*                       @Z67SP00*/ 00803000
*                   RTNCODE RSTD;   /*                       @Z67SP00*/ 00804000
*                 ZAPRTNCD=MAX(ZAPRTNCD,RTNCODE);/* SET ERROR CODE 0390 00805000
*                                                            @Z67SP00*/ 00806000
         SLR   @08,@08                                             0390 00807000
         IC    @08,ZAPRTNCD                                        0390 00808000
         CR    @08,RTNCODE                                         0390 00809000
         BNL   *+6                                                      00810000
         LR    @08,RTNCODE                                         0390 00811000
         STC   @08,ZAPRTNCD                                        0390 00812000
*                 ICTPROCS(I)=ON;   /* SET PTF IN PROCESS            */ 00813000
         LH    @08,I                                               0391 00814000
         MH    @08,@CH01885                                        0391 00815000
         L     @03,CCAICPTF(,CCAPTR)                               0391 00816000
         ALR   @03,@08                                             0391 00817000
         AL    @03,@CF01903                                        0391 00818000
         OI    ICTPROCS-8(@03),B'10000000'                         0391 00819000
*                 IF RTNCODE¬=ZERO THEN/*                    @Z67SP00*/ 00820000
         LTR   RTNCODE,RTNCODE                                     0392 00821000
         BZ    @RF00392                                            0392 00822000
*                   DO;             /* IF ERROR SET SW, EXIT @Z67SP00*/ 00823000
*                     ZAPERROR=ON;  /*                       @Z67SP00*/ 00824000
         OI    ZAPERROR,B'00000001'                                0394 00825000
*                     GO TO HMAZP050;/* GET NEXT PTF         @Z67SP00*/ 00826000
         B     HMAZP050                                            0395 00827000
*                   END;            /*                       @Z67SP00*/ 00828000
*                 RFY               /*                       @Z67SP00*/ 00829000
*                   RTNCODE UNRSTD; /*                       @Z67SP00*/ 00830000
@RF00392 DS    0H                                                  0398 00831000
*                 IF ICTTIND1(1)=ON /* IS TARGET 1 AVAILABLE?        */ 00832000
*                   THEN            /* YES - SET PRIMARY TARGET      */ 00833000
         LH    @15,K                                               0398 00834000
         SLA   @15,2                                               0398 00835000
         LH    @08,J                                               0398 00836000
         SLA   @08,2                                               0398 00837000
         LH    @03,I                                               0398 00838000
         MH    @03,@CH01885                                        0398 00839000
         L     @01,CCAICPTF(,CCAPTR)                               0398 00840000
         AL    @01,@CF01905                                        0398 00841000
         L     @03,ICTPCHN-64(@03,@01)                             0398 00842000
         AL    @03,@CF01906                                        0398 00843000
         L     @08,ICTIXP(@08,@03)                                 0398 00844000
         MVC   @TF00001(4),ICTMCHN(@08)                            0398 00845000
         L     @08,@TF00001                                        0398 00846000
         AL    @08,@CF01906                                        0398 00847000
         L     @15,ICTIXM(@15,@08)                                 0398 00848000
         TM    ICTTIND1(@15),B'10000000'                           0398 00849000
         BNO   @RF00398                                            0398 00850000
*                   SYSLIB=ICTTG1(1);/* GET PRIMARY TARGET LIBRARY   */ 00851000
         MVC   SYSLIB(8),ICTTG1(@15)                               0399 00852000
*                 ELSE              /* OTHERWISE - WE'RE ON SECOND   */ 00853000
*                   DO;                                            0400 00854000
         B     @RC00398                                            0400 00855000
@RF00398 DS    0H                                                  0401 00856000
*                     SYSLIB=ICTTG2(1);/* GET SECONDARY TARGET       */ 00857000
         LH    @15,K                                               0401 00858000
         SLA   @15,2                                               0401 00859000
         LH    @08,J                                               0401 00860000
         SLA   @08,2                                               0401 00861000
         LH    @03,I                                               0401 00862000
         MH    @03,@CH01885                                        0401 00863000
         L     @01,CCAICPTF(,CCAPTR)                               0401 00864000
         AL    @01,@CF01905                                        0401 00865000
         L     @03,ICTPCHN-64(@03,@01)                             0401 00866000
         AL    @03,@CF01906                                        0401 00867000
         L     @08,ICTIXP(@08,@03)                                 0401 00868000
         MVC   @TF00001(4),ICTMCHN(@08)                            0401 00869000
         L     @08,@TF00001                                        0401 00870000
         AL    @08,@CF01906                                        0401 00871000
         L     @15,ICTIXM(@15,@08)                                 0401 00872000
         MVC   SYSLIB(8),ICTTG2(@15)                               0401 00873000
*                     ICTTIND1(1)=ON;/* RESET TARGET ONE AVAILABLE   */ 00874000
*                     ICTTIND2(1)=OFF;/* SET TARGET TWO NOT AVAILABLE*/ 00875000
         OI    ICTTIND1(@15),B'10000000'                           0403 00876000
         NI    ICTTIND2(@15),B'10111111'                           0403 00877000
*                   END;                                           0404 00878000
*                                                                  0404 00879000
*                 /***************************************************/ 00880000
*                 /*                                                 */ 00881000
*                 /* GET PARMS AND SYSPRINT DD FROM CCA      @Z67SP00*/ 00882000
*                 /*                                                 */ 00883000
*                 /***************************************************/ 00884000
*                                                                  0405 00885000
*                 OPTVAR=''B;       /*                       @Z67SP00*/ 00886000
@RC00398 XC    OPTVAR(91),OPTVAR                                   0405 00887000
*                 DO P=1 BY 1 WHILE CCAZAPPM(P)¬=BLANK;/* MOVE PARMS    00888000
*                                                            @Z67SP00*/ 00889000
         LA    @15,1                                               0406 00890000
         STH   @15,P                                               0406 00891000
         B     @DE00406                                            0406 00892000
@DL00406 DS    0H                                                  0407 00893000
*                   OPTVAR(P)=CCAZAPPM(P);/*                 @Z67SP00*/ 00894000
         LH    @15,P                                               0407 00895000
         LA    @08,OPTVAR-1(@15)                                   0407 00896000
         L     @03,CCABLDLP(,CCAPTR)                               0407 00897000
         ALR   @03,@15                                             0407 00898000
         MVC   0(1,@08),CCAZAPPM-1(@03)                            0407 00899000
*                 END;              /*                       @Z67SP00*/ 00900000
         AL    @15,@CF00085                                        0408 00901000
         STH   @15,P                                               0408 00902000
@DE00406 LH    @15,P                                               0408 00903000
         L     @08,CCABLDLP(,CCAPTR)                               0408 00904000
         ALR   @15,@08                                             0408 00905000
         CLI   CCAZAPPM-1(@15),C' '                                0408 00906000
         BNE   @DL00406                                            0408 00907000
*                 OPTLGTH=P-1;      /* PARM LIST LENGTH      @Z67SP00*/ 00908000
         LH    @15,P                                               0409 00909000
         BCTR  @15,0                                               0409 00910000
         STH   @15,OPTLGTH                                         0409 00911000
*                 SYSPRINT=CCAZAPSP;/* USER SYSPRINT DD      @Z67SP00*/ 00912000
*                                                                  0410 00913000
         MVC   SYSPRINT(8),CCAZAPSP(@08)                           0410 00914000
*                 /***************************************************/ 00915000
*                 /*                                                 */ 00916000
*                 /* STAE PARMS                              @Z67SP00*/ 00917000
*                 /*                                                 */ 00918000
*                 /***************************************************/ 00919000
*                                                                  0411 00920000
*                 SAVRVANM=RVAEPRNM;/* SAVE RVA PROC NM      @Z67SP00*/ 00921000
         L     @15,CCARVAD(,CCAPTR)                                0411 00922000
         MVC   SAVRVANM(8),RVAEPRNM(@15)                           0411 00923000
*                 RVAEPRNM=CCAZAPNM;/* SUPERZAP NM           @Z67SP00*/ 00924000
         MVC   RVAEPRNM(8,@15),CCAZAPNM(@08)                       0412 00925000
*                 R2=CCASPZAP;      /* GET BLDL FOR SUPERZAP         */ 00926000
*                                                                  0413 00927000
         L     R2,CCASPZAP(,@08)                                   0413 00928000
*                 /***************************************************/ 00929000
*                 /*                                                 */ 00930000
*                 /* INVOKE SUPERZAP                         @Z67SP00*/ 00931000
*                 /*                                                 */ 00932000
*                 /***************************************************/ 00933000
*                                                                  0414 00934000
*                 GEN(LINK  DE=(R2),PARAM=(OPTLST,ZAPLIST),VL=1)   0414 00935000
*                 REFS(OPTLST,ZAPLIST,R2);/* LINK TO SUPERZAP      0414 00936000
*                                                            @Z40SP00*/ 00937000
         LINK  DE=(R2),PARAM=(OPTLST,ZAPLIST),VL=1                      00938000
*                 RFY               /*                       @Z67SP00*/ 00939000
*                   RTNCODE RSTD;   /*                       @Z67SP00*/ 00940000
*                 RFY                                              0416 00941000
*                  (R2) UNRSTD;     /* UNRESTRICT REG 2              */ 00942000
*                 RVAEPRNM=SAVRVANM;/* RESTORE RVA NAME      @Z67SP00*/ 00943000
         L     @08,CCARVAD(,CCAPTR)                                0417 00944000
         MVC   RVAEPRNM(8,@08),SAVRVANM                            0417 00945000
*                 IF RTNCODE¬=ZERO  /* IF ZAP NOT ALL OK     @ZD00001*/ 00946000
*                     |REPPASS=ON   /* OR IF GOOD REP        @ZD00001*/ 00947000
*                   THEN                                           0418 00948000
         LTR   RTNCODE,RTNCODE                                     0418 00949000
         BNZ   @RT00418                                            0418 00950000
         TM    REPPASS,B'00001000'                                 0418 00951000
         BNO   @RF00418                                            0418 00952000
@RT00418 DS    0H                                                  0419 00953000
*                   DO;                                            0419 00954000
*                     MGPTYPE=MGPINFO;/* DEFAULT MSG TYPE    @ZD00001*/ 00955000
         MVI   MGPTYPE,X'01'                                       0420 00956000
*                     IF RTNCODE¬=ZERO/* IF NON-ZERO RETURN  @YA07506*/ 00957000
*                         &RTNCODE<=CCARZAP/* BUT LESS THEN MAX    0421 00958000
*                                                            @ZD00001*/ 00959000
*                       THEN                                       0421 00960000
         LTR   RTNCODE,RTNCODE                                     0421 00961000
         BZ    @RF00421                                            0421 00962000
         L     @08,CCABLDLP(,CCAPTR)                               0421 00963000
         MVC   @ZT00003+3(1),CCARZAP(@08)                          0421 00964000
         C     RTNCODE,@ZT00003                                    0421 00965000
         BH    @RF00421                                            0421 00966000
*                       DO;                                        0422 00967000
*                         MGPTYPE=MGPWARN;/* SET MSG TYPE    @ZD00001*/ 00968000
         MVI   MGPTYPE,X'02'                                       0423 00969000
*                         ZAPRTNCD=MAX(ZAPRTNCD,PTFWARN);/* SET RC 0424 00970000
*                                                            @YA07506*/ 00971000
         SLR   @08,@08                                             0424 00972000
         IC    @08,ZAPRTNCD                                        0424 00973000
         LA    @07,4                                               0424 00974000
         CR    @08,@07                                             0424 00975000
         BNL   *+6                                                      00976000
         LR    @08,@07                                             0424 00977000
         STC   @08,ZAPRTNCD                                        0424 00978000
*                       END;                                       0425 00979000
*                     IF RTNCODE>CCARZAP/* IF ERR IN ZAP     @ZD00001*/ 00980000
*                       THEN        /*                       @YA07506*/ 00981000
@RF00421 L     @08,CCABLDLP(,CCAPTR)                               0426 00982000
         MVC   @ZT00003+3(1),CCARZAP(@08)                          0426 00983000
         C     RTNCODE,@ZT00003                                    0426 00984000
         BNH   @RF00426                                            0426 00985000
*                       DO;         /*                       @ZD00001*/ 00986000
*                         ZAPERROR=ON;/* ERROR SE            @Z67SP00*/ 00987000
         OI    ZAPERROR,B'00000001'                                0428 00988000
*                         MGPTYPE=MGPERR;/* SET MSG TYPE     @ZD00001*/ 00989000
         MVI   MGPTYPE,X'03'                                       0429 00990000
*                         IF VERPASS=ON/* IF PTF STOP ERR IN @ZD00001*/ 00991000
*                           THEN    /* VER PASS SET          @ZD00001*/ 00992000
         TM    VERPASS,B'00000100'                                 0430 00993000
         BNO   @RF00430                                            0430 00994000
*                           ICTPVERJ(I)=ON;/* PTF HAD VER REJ      0431 00995000
*                                                            @YA07506*/ 00996000
         LH    @08,I                                               0431 00997000
         MH    @08,@CH01885                                        0431 00998000
         L     @01,CCAICPTF(,CCAPTR)                               0431 00999000
         ALR   @01,@08                                             0431 01000000
         AL    @01,@CF01903                                        0431 01001000
         OI    ICTPVERJ-8(@01),B'00001000'                         0431 01002000
*                         ZAPRTNCD=MAX(ZAPRTNCD,STOPPTF);/*  @ZD00001*/ 01003000
@RF00430 SLR   @08,@08                                             0432 01004000
         IC    @08,ZAPRTNCD                                        0432 01005000
         LA    @07,8                                               0432 01006000
         CR    @08,@07                                             0432 01007000
         BNL   *+6                                                      01008000
         LR    @08,@07                                             0432 01009000
         STC   @08,ZAPRTNCD                                        0432 01010000
*                       END;                                       0433 01011000
*                     CVD(RTNCODE,DECNO);/*                  @ZD00001*/ 01012000
@RF00426 CVD   RTNCODE,DECNO                                       0434 01013000
*                     UNPK(RETURNCD(1:2),DECNO(7:8));/*      @ZD00001*/ 01014000
         UNPK  RETURNCD(2),DECNO+6(2)                              0435 01015000
*                     RETURNCD(2)=RETURNCD(2)|ZONE;/*        @ZD00001*/ 01016000
         OI    RETURNCD+1,C'0'                                     0436 01017000
*                     MGPCLEAR=MGPCLEAR&&MGPCLEAR;/* ZERO MSG PARM 0437 01018000
*                                                            @ZD00001*/ 01019000
         XC    MGPCLEAR(6),MGPCLEAR                                0437 01020000
*                     MGPMGNO1=HMA237I;/* ZAP XXXXXX XXXXXXXXXX -  0438 01021000
*                                      MOD= XXXXXXXX - LMOD=XXXXXXXX    01022000
*                                      - LIBRARY=XXXXXXXX -        0438 01023000
*                                      PTF=XXXXXXX - RETURN CODE=XX     01024000
*                                                            @ZD00001*/ 01025000
         MVC   MGPMGNO1(2),@CH00483                                0438 01026000
*                     IF REPPASS=ON /* IF REPLACE            @ZD00001*/ 01027000
*                       THEN        /*                       @ZD00001*/ 01028000
         TM    REPPASS,B'00001000'                                 0439 01029000
         BNO   @RF00439                                            0439 01030000
*                       MGPVARPT(1)=ADDR(TXTREP);/*          @ZD00001*/ 01031000
         LA    @08,@CC01702                                        0440 01032000
         ST    @08,MGPVARPT                                        0440 01033000
*                     ELSE          /* IF VERIFY PASS        @ZD00001*/ 01034000
*                       MGPVARPT(1)=ADDR(TXTVER);/*          @ZD00001*/ 01035000
         B     @RC00439                                            0441 01036000
@RF00439 LA    @08,@CC01700                                        0441 01037000
         ST    @08,MGPVARPT                                        0441 01038000
*                     IF RTNCODE>CCARZAP/* IF ZAP FAILED     @ZD00001*/ 01039000
*                       THEN        /*                       @ZD00001*/ 01040000
@RC00439 L     @08,CCABLDLP(,CCAPTR)                               0442 01041000
         MVC   @ZT00003+3(1),CCARZAP(@08)                          0442 01042000
         C     RTNCODE,@ZT00003                                    0442 01043000
         BNH   @RF00442                                            0442 01044000
*                       MGPVARPT(2)=ADDR(TXTFAIL);/*         @ZD00001*/ 01045000
         LA    @08,@CC01707                                        0443 01046000
         ST    @08,MGPVARPT+4                                      0443 01047000
*                     ELSE          /* IF ZAP OK             @ZD00001*/ 01048000
*                       MGPVARPT(2)=ADDR(TXTSUCC);/*         @ZD00001*/ 01049000
         B     @RC00442                                            0444 01050000
@RF00442 LA    @08,@CC01704                                        0444 01051000
         ST    @08,MGPVARPT+4                                      0444 01052000
*                     MGPVARPT(3)=ADDR(ICTMNAME(1));/* MODULE NAME 0445 01053000
*                                                            @ZD00001*/ 01054000
@RC00442 LH    @08,J                                               0445 01055000
         SLA   @08,2                                               0445 01056000
         LH    @07,I                                               0445 01057000
         MH    @07,@CH01885                                        0445 01058000
         L     @06,CCAICPTF(,CCAPTR)                               0445 01059000
         LA    @01,0(@07,@06)                                      0445 01060000
         AL    @01,@CF01905                                        0445 01061000
         L     @01,ICTPCHN-64(,@01)                                0445 01062000
         AL    @01,@CF01906                                        0445 01063000
         L     @08,ICTIXP(@08,@01)                                 0445 01064000
         ST    @08,MGPVARPT+8                                      0445 01065000
*                     MGPVARPT(4)=ADDR(ICTLMNAM(1));/* LOAD MODULE 0446 01066000
*                                      NAME                  @ZD00001*/ 01067000
         LH    @05,K                                               0446 01068000
         SLA   @05,2                                               0446 01069000
         MVC   @TF00001(4),ICTMCHN(@08)                            0446 01070000
         L     @08,@TF00001                                        0446 01071000
         AL    @08,@CF01906                                        0446 01072000
         L     @08,ICTIXM(@05,@08)                                 0446 01073000
         ST    @08,MGPVARPT+12                                     0446 01074000
*                     MGPVARPT(5)=ADDR(SYSLIB);/* LIBRARY NAME     0447 01075000
*                                                            @ZD00001*/ 01076000
         LA    @08,SYSLIB                                          0447 01077000
         ST    @08,MGPVARPT+16                                     0447 01078000
*                     MGPVARPT(6)=ADDR(ICTPTFS(I));/* PTF NUMBER   0448 01079000
*                                                            @ZD00001*/ 01080000
         AL    @06,@CF01901                                        0448 01081000
         LA    @08,ICTPTFS(@07,@06)                                0448 01082000
         ST    @08,MGPVARPT+20                                     0448 01083000
*                     MGPVARPT(7)=ADDR(RETURNCD);/* RETURN CODE    0449 01084000
*                                                            @ZD00001*/ 01085000
         LA    @08,RETURNCD                                        0449 01086000
         ST    @08,MGPVARPT+24                                     0449 01087000
*                     CALL HMASMMSG(HMASMMGP);/* WRITE MESSAGE     0450 01088000
*                                                            @ZD00001*/ 01089000
         L     @15,@CV01808                                        0450 01090000
         LA    @01,@AL00450                                        0450 01091000
         BALR  @14,@15                                             0450 01092000
*                   END;                                           0451 01093000
*                 RFY               /*                       @Z67SP00*/ 01094000
*                   RTNCODE UNRSTD; /*                       @Z67SP00*/ 01095000
@RF00418 DS    0H                                                  0453 01096000
*                 IF ICTTIND2(1)=ON /* IS SECOND TARGET AVAILABLE    */ 01097000
*                   THEN            /* YES - SET UP FOR NEXT LINK    */ 01098000
         LH    @15,K                                               0453 01099000
         SLA   @15,2                                               0453 01100000
         LH    @08,J                                               0453 01101000
         SLA   @08,2                                               0453 01102000
         LH    @07,I                                               0453 01103000
         MH    @07,@CH01885                                        0453 01104000
         L     @01,CCAICPTF(,CCAPTR)                               0453 01105000
         AL    @01,@CF01905                                        0453 01106000
         L     @01,ICTPCHN-64(@07,@01)                             0453 01107000
         AL    @01,@CF01906                                        0453 01108000
         L     @08,ICTIXP(@08,@01)                                 0453 01109000
         MVC   @TF00001(4),ICTMCHN(@08)                            0453 01110000
         L     @08,@TF00001                                        0453 01111000
         AL    @08,@CF01906                                        0453 01112000
         L     @15,ICTIXM(@15,@08)                                 0453 01113000
         TM    ICTTIND2(@15),B'01000000'                           0453 01114000
         BNO   @RF00453                                            0453 01115000
*                   DO;                                            0454 01116000
*                     ICTTIND1(1)=OFF;/* INDICATE TARGET ONE IS DONE */ 01117000
         NI    ICTTIND1(@15),B'01111111'                           0455 01118000
*                     GO TO HMAZP045;/* GO LINK TO NEXT LIBRARY      */ 01119000
         B     HMAZP045                                            0456 01120000
*                   END;                                           0457 01121000
*                 ELSE              /* OTHERWISE - CHECK FOR RESET   */ 01122000
*                   IF ICTTG2(1,1)¬=BLANK/* OF TARGET TWO            */ 01123000
*                     THEN          /* RESET IT                      */ 01124000
@RF00453 LH    @15,K                                               0458 01125000
         SLA   @15,2                                               0458 01126000
         LH    @08,J                                               0458 01127000
         SLA   @08,2                                               0458 01128000
         LH    @07,I                                               0458 01129000
         MH    @07,@CH01885                                        0458 01130000
         L     @01,CCAICPTF(,CCAPTR)                               0458 01131000
         AL    @01,@CF01905                                        0458 01132000
         L     @01,ICTPCHN-64(@07,@01)                             0458 01133000
         AL    @01,@CF01906                                        0458 01134000
         L     @08,ICTIXP(@08,@01)                                 0458 01135000
         MVC   @TF00001(4),ICTMCHN(@08)                            0458 01136000
         L     @08,@TF00001                                        0458 01137000
         AL    @08,@CF01906                                        0458 01138000
         L     @15,ICTIXM(@15,@08)                                 0458 01139000
         CLI   ICTTG2(@15),C' '                                    0458 01140000
         BE    @RF00458                                            0458 01141000
*                     ICTTIND2(1)=ON;/* RESET TARGET AVAILABILITY    */ 01142000
         OI    ICTTIND2(@15),B'01000000'                           0459 01143000
*               END;                /* END OF ROUTINE INVOKING     0460 01144000
*                                      SUPERZAP              @SA71755*/ 01145000
@RF00458 DS    0H                                                  0461 01146000
*HMAZP047:                          /* ENTRY TO END OF LMOD LOOP     */ 01147000
*           END;                    /* END OF LOAD MODULE SCAN       */ 01148000
@RF00385 DS    0H                                                  0461 01149000
HMAZP047 LA    @15,1                                               0461 01150000
         AH    @15,K                                               0461 01151000
         STH   @15,K                                               0461 01152000
         C     @15,@CF01724                                        0461 01153000
         BNH   @DL00228                                            0461 01154000
@DC00228 DS    0H                                                  0462 01155000
*           IF REPPASS=ON           /* IS REPPASS COMPLETE ON MODULE */ 01156000
*             THEN                  /* YES - DONE WITH THIS MODULE   */ 01157000
         TM    REPPASS,B'00001000'                                 0462 01158000
         BNO   @RF00462                                            0462 01159000
*             CALLCPL=ON;           /* HMASMCPL NEEDED       @Z67SP00*/ 01160000
         OI    CALLCPL,B'01000000'                                 0463 01161000
*         END;                      /* END OF MOD IS SELECTED ZAP    */ 01162000
@RF00462 DS    0H                                                  0465 01163000
*HMAZP048:                          /* ENTRY TO END OF MOD LOOP    0465 01164000
*                                                            @SA71755*/ 01165000
*       OUTREC='';                  /* INIT OUTPUT AREA FOR NAME CARD   01166000
*                                      AND DUMP CARD IN CASE NEXT  0465 01167000
*                                      TIME THRU DUMP CARD COMES   0465 01168000
*                                      BEFORE NAME CARD. LMOD NAME 0465 01169000
*                                      FROM PREV ZAP WILL NOT BE USED   01170000
*                                      THIS TIME             @OY01965*/ 01171000
@RF00224 DS    0H                                                  0465 01172000
HMAZP048 MVI   OUTREC,C' '                                         0465 01173000
         MVC   OUTREC+1(79),OUTREC                                 0465 01174000
*     END;                          /* END OF LOOP THRU ZAPS FOR ONE    01175000
*                                      PTF                   @Z67SP00*/ 01176000
         LA    @15,1                                               0466 01177000
         AH    @15,J                                               0466 01178000
         STH   @15,J                                               0466 01179000
         C     @15,@CF01724                                        0466 01180000
         BNH   @DL00223                                            0466 01181000
@DC00223 DS    0H                                                  0467 01182000
         EJECT                                                          01183000
*                                                                  0467 01184000
*     /***************************************************************/ 01185000
*     /*                                                             */ 01186000
*     /* ALL MODULES FOR A PTF HAVE BEEN PROCESSED. SWITCH TO REPLACE*/ 01187000
*     /* PASS IF IN VERIFY. SWITCH TO VERIFY PASS IF IN REPLACE PASS */ 01188000
*     /* OR IF VERIFY PASS FAILED.                           @Z40SP00*/ 01189000
*     /*                                                             */ 01190000
*     /***************************************************************/ 01191000
*                                                                  0467 01192000
*     IF VERPASS=ON                 /* IF THIS IS A VERIFY PASS      */ 01193000
*         &ZAPERROR=OFF             /* AND NO ERRORS         @Z67PS00*/ 01194000
*       THEN                                                       0467 01195000
         TM    VERPASS,B'00000100'                                 0467 01196000
         BNO   @RF00467                                            0467 01197000
         TM    ZAPERROR,B'00000001'                                0467 01198000
         BNZ   @RF00467                                            0467 01199000
*       DO;                                                        0468 01200000
*         VERPASS=OFF;              /* RESET VERIFY PASS             */ 01201000
*         REPPASS=ON;               /* INDICATE REPLACE PASS         */ 01202000
         OI    REPPASS,B'00001000'                                 0470 01203000
         NI    VERPASS,B'11111011'                                 0470 01204000
*         GO TO HMAZP010;           /* REPEAT MOD PROCESSING FOR REP    01205000
*                                      PASS                          */ 01206000
         B     HMAZP010                                            0471 01207000
*       END;                                                       0472 01208000
*HMAZP050:                                                         0473 01209000
*     IF ZAPERROR=OFF               /* IF NO ERROR           @Z67SP00*/ 01210000
*       THEN                        /*                       @Z67SP00*/ 01211000
@RF00467 DS    0H                                                  0473 01212000
HMAZP050 TM    ZAPERROR,B'00000001'                                0473 01213000
         BNZ   @RF00473                                            0473 01214000
*       STATUS=GOOD;                /* CPL PARM              @Z67SP00*/ 01215000
         MVC   STATUS(1),GOOD                                      0474 01216000
*     ELSE                          /* GOOD ZAPS             @Z67SP00*/ 01217000
*       STATUS=BAD;                 /* CPL PARM              @Z67SP00*/ 01218000
         B     @RC00473                                            0475 01219000
@RF00473 MVC   STATUS(1),BAD                                       0475 01220000
*     REPPASS=OFF;                  /* RESET BACK TO VERIFY PASS     */ 01221000
*                                                                  0476 01222000
@RC00473 NI    REPPASS,B'11110111'                                 0476 01223000
*     /***************************************************************/ 01224000
*     /*                                                             */ 01225000
*     /* SYSMOD COMPLETION                                   @Z67SP00*/ 01226000
*     /*                                                             */ 01227000
*     /***************************************************************/ 01228000
*                                                                  0477 01229000
*     IF CALLCPL=ON                 /* IF ZAP INVOKED        @Z67SP00*/ 01230000
*         |ZAPERROR=ON              /* OR ERROR FOUND        @Z67SP00*/ 01231000
*       THEN                        /*                       @Z67SP00*/ 01232000
         TM    CALLCPL,B'01000000'                                 0477 01233000
         BO    @RT00477                                            0477 01234000
         TM    ZAPERROR,B'00000001'                                0477 01235000
         BNO   @RF00477                                            0477 01236000
@RT00477 DS    0H                                                  0478 01237000
*       DO;                         /*                       @Z67SP00*/ 01238000
*         CALL HMASMCPL(STATUS);    /*                       @Z67SP00*/ 01239000
         L     @15,@CV01806                                        0479 01240000
         LA    @01,@AL00479                                        0479 01241000
         BALR  @14,@15                                             0479 01242000
*         RFY                       /*                       @Z67SP00*/ 01243000
*           RTNCODE RSTD;           /*                       @Z67SP00*/ 01244000
*         ZAPRTNCD=MAX(ZAPRTNCD,RTNCODE);/* ERROR CODE       @Z67SP00*/ 01245000
         SLR   @08,@08                                             0481 01246000
         IC    @08,ZAPRTNCD                                        0481 01247000
         CR    @08,RTNCODE                                         0481 01248000
         BNL   *+6                                                      01249000
         LR    @08,RTNCODE                                         0481 01250000
         STC   @08,ZAPRTNCD                                        0481 01251000
*         CALLCPL=OFF;              /* RESET INDICATOR       @Z67SP00*/ 01252000
         NI    CALLCPL,B'10111111'                                 0482 01253000
*         RFY                       /*                       @Z67SP00*/ 01254000
*           RTNCODE UNRSTD;         /*                       @Z67SP00*/ 01255000
*       END;                        /*                               */ 01256000
*   END;                            /* END OF MAIN PTF LOOP  @Z40SP00*/ 01257000
@RF00477 LA    @15,1                                               0485 01258000
         AH    @15,I                                               0485 01259000
         STH   @15,I                                               0485 01260000
         C     @15,@CF01724                                        0485 01261000
         BNH   @DL00217                                            0485 01262000
@DC00217 DS    0H                                                  0486 01263000
*   GO TO HMAZP970;                 /* CLEANUP AND RETURN            */ 01264000
         B     HMAZP970                                            0486 01265000
         EJECT                                                          01266000
*                                                                  0487 01267000
*   /*****************************************************************/ 01268000
*   /*                                                               */ 01269000
*   /* ZAP COMMENT CARD ROUTINE --- SCN_ROUT                         */ 01270000
*   /*                                                               */ 01271000
*   /*****************************************************************/ 01272000
*                                                                  0487 01273000
*RCMNT:                             /* ZAP COMMENT CARD RTN  @OY01955*/ 01274000
*   RESPECIFY                                                      0487 01275000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01276000
RCMNT    DS    0H                                                  0488 01277000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01278000
         ST    R1,PARSAV                                           0488 01279000
*   RESPECIFY                                                      0489 01280000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01281000
*   CMNTSW=ON;                      /* INDICATE THIS IS A COMMENT  0490 01282000
*                                      CARD                  @OY01955*/ 01283000
         OI    CMNTSW,B'00010000'                                  0490 01284000
*   GO TO HMAZP700;                 /* RETURN TO SCAN        @OY01955*/ 01285000
         B     HMAZP700                                            0491 01286000
         EJECT                                                          01287000
*                                                                  0492 01288000
*   /*****************************************************************/ 01289000
*   /*                                                               */ 01290000
*   /* NAME CARD ROUTINE. THIS ROUTINE IS ENTERED AFTER THE FIRST    */ 01291000
*   /* NAME CARD OPERAND IS PROCESSED. --- SCN_ROUT          @Z40SP00*/ 01292000
*   /*                                                               */ 01293000
*   /*****************************************************************/ 01294000
*                                                                  0492 01295000
*RNAME:                                                            0492 01296000
*   RESPECIFY                                                      0492 01297000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01298000
RNAME    DS    0H                                                  0493 01299000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01300000
         ST    R1,PARSAV                                           0493 01301000
*   RESPECIFY                                                      0494 01302000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01303000
*   SCPRET=ZERO;                    /* INDICATE GOOD ENTRY           */ 01304000
         MVI   SCPRET,X'00'                                        0495 01305000
*   ZAPFLSH=OFF;                    /* RESET ZAP FLUSH FOR EACH NAME    01306000
*                                      CARD                  @SA71755*/ 01307000
         NI    ZAPFLSH,B'11011111'                                 0496 01308000
*   BRSW=OFF;                       /* RESET NAME CARD SCANNED AND 0497 01309000
*                                      WRITTEN SW OFF        @Z40SP00*/ 01310000
*   NAMESCH=ON;                     /* SET NAME CARD SEARCH          */ 01311000
         OI    NAMESCH,B'10000000'                                 0498 01312000
         NI    BRSW,B'11101111'                                    0498 01313000
*   RESPECIFY                                                      0499 01314000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01315000
*   R1=PARSAV;                      /* RESTORE REGISTER 1    @Z67SP00*/ 01316000
         L     @15,PARSAV                                          0500 01317000
         LR    R1,@15                                              0500 01318000
*   GO TO SCANRETN;                 /* RETURN TO HMASMSCN    @ZD00001*/ 01319000
         BR    R14                                                 0501 01320000
*   RESPECIFY                                                      0502 01321000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01322000
         EJECT                                                          01323000
*                                                                  0503 01324000
*   /*****************************************************************/ 01325000
*   /*                                                               */ 01326000
*   /* AN ENTIRE NAME CARD OR DUMP CARD HAS BEEN SCANNED.            */ 01327000
*   /*                                                               */ 01328000
*   /*****************************************************************/ 01329000
*                                                                  0503 01330000
*HMAZP110:                                                         0503 01331000
*   IF DUMPSW=ON                    /* WAS THIS A DUMP CARD? @OS70966*/ 01332000
*     THEN                          /* YES                   @OS70966*/ 01333000
HMAZP110 TM    DUMPSW,B'00001000'                                  0503 01334000
         BNO   @RF00503                                            0503 01335000
*     IF BRSW=OFF                   /* NAME CARD SCANNED AND WRITTEN    01336000
*                                      YET?                  @OS70966*/ 01337000
*       THEN                        /* NO                    @OS70966*/ 01338000
         TM    BRSW,B'00010000'                                    0504 01339000
         BNZ   @RF00504                                            0504 01340000
*       DO;                         /* REMEMBER DUMP CARD FOUND    0505 01341000
*                                                            @OS70966*/ 01342000
*         DODUMP=ON;                /* INDICATE PUT OUT DUMP CARD  0506 01343000
*                                                            @OS70966*/ 01344000
         OI    DODUMP,B'00000100'                                  0506 01345000
*         GO TO HMAZP035;           /* IGNORE DUMP CARD AT THIS TIME    01346000
*                                      GO TO READ NXT RECORD @OS70966*/ 01347000
         B     HMAZP035                                            0507 01348000
*       END;                        /* END NO NAME YET       @OS70966*/ 01349000
*     ELSE                          /* NAME CARD HAS BEEN FOUND.   0509 01350000
*                                                            @OS70966*/ 01351000
*       GO TO HMAZP115;             /* GO TO SET THE NAME CARD AREA     01352000
*                                      TO INDICATE DUMP      @OS70966*/ 01353000
*   ELSE                            /* NOT DUMP CARD MUST BE NAME  0510 01354000
*                                      CARD                  @OS70966*/ 01355000
*     BRSW=ON;                      /* TURN ON SW TO INDICATE NAME 0510 01356000
*                                      CARD SCANNED AND WRITTEN SINCE   01357000
*                                      IT WILL BE WRITTEN TO SYSUT1     01358000
*                                      BEFORE BEING TESTED NEXT    0510 01359000
*                                                            @OS70966*/ 01360000
@RF00503 OI    BRSW,B'00010000'                                    0510 01361000
*   IF ONENAME=ON&                  /* IF ONE OPERAND NAME CARD FOUND*/ 01362000
*       TWONAME=ON                  /* AND TWO OPERAND NAME CARD   0511 01363000
*                                      FOUND                         */ 01364000
*     THEN                          /* THEN ---                      */ 01365000
         TM    ONENAME,B'01100000'                                 0511 01366000
         BNO   @RF00511                                            0511 01367000
*     DO;                           /* INVALID ZAP CARD COMBINATION  */ 01368000
*       ZAPERROR=ON;                /* ERROR SE              @Z67SP00*/ 01369000
         OI    ZAPERROR,B'00000001'                                0513 01370000
*       MGPMGNO1=HMA249I;           /* PRIMARY MESSAGE               */ 01371000
         MVC   MGPMGNO1(2),@CH00730                                0514 01372000
*       MGPMGNO2=PART015;           /* SECONDARY MESSAGE             */ 01373000
         MVC   MGPMGNO2(2),@CH00064                                0515 01374000
*       MGPVARPT(1)=ADDR(ICTPTF(I));/* ADDRESS OF PTF NAME           */ 01375000
         LH    @15,I                                               0516 01376000
         MH    @15,@CH01885                                        0516 01377000
         L     @08,CCAICPTF(,CCAPTR)                               0516 01378000
         LA    @01,0(@15,@08)                                      0516 01379000
         AL    @01,@CF01901                                        0516 01380000
         ST    @01,MGPVARPT                                        0516 01381000
*       MGPVARPT(2)=ADDR(ICTMOD(1));/* ADDRESS OF MODULE NAME        */ 01382000
         LH    @07,J                                               0517 01383000
         SLA   @07,2                                               0517 01384000
         AL    @08,@CF01905                                        0517 01385000
         L     @15,ICTPCHN-64(@15,@08)                             0517 01386000
         AL    @15,@CF01906                                        0517 01387000
         L     @15,ICTIXP(@07,@15)                                 0517 01388000
         ST    @15,MGPVARPT+4                                      0517 01389000
*       MGPTYPE=MGPERR;             /* MESSAGE SEVERITY      @ZD00001*/ 01390000
         MVI   MGPTYPE,X'03'                                       0518 01391000
*       CALL HMASMMSG(HMASMMGP);    /* CALL MESSAGE ROUTINE          */ 01392000
         L     @15,@CV01808                                        0519 01393000
         LA    @01,@AL00519                                        0519 01394000
         BALR  @14,@15                                             0519 01395000
*       ICTPVERJ(I)=ON;             /* PTF HAS VERIFY REJECT @Z40SP00*/ 01396000
         LH    @15,I                                               0520 01397000
         MH    @15,@CH01885                                        0520 01398000
         L     @08,CCAICPTF(,CCAPTR)                               0520 01399000
         ALR   @08,@15                                             0520 01400000
         AL    @08,@CF01903                                        0520 01401000
         OI    ICTPVERJ-8(@08),B'00001000'                         0520 01402000
*       GO TO HMAZP050;             /* GO MARK PTF AS BAD    @Z67SP00*/ 01403000
         B     HMAZP050                                            0521 01404000
*     END;                                                         0522 01405000
*   IF TWONAME=ON                   /* IF LOADMOD AND CSECT EXIST    */ 01406000
*     THEN                                                         0523 01407000
@RF00511 TM    TWONAME,B'00100000'                                 0523 01408000
         BNO   @RF00523                                            0523 01409000
*     DO;                                                          0524 01410000
*       TGNAME=LMNAME;              /* MOVE IN LOAD MODULE NAME      */ 01411000
         MVC   TGNAME(8),LMNAME                                    0525 01412000
*       CSNAME=SECNAME;             /* MOVE IN CSECT NAME            */ 01413000
         MVC   CSNAME(8),SECNAME                                   0526 01414000
*     END;                                                         0527 01415000
*   ELSE                                                           0528 01416000
*     DO;                                                          0528 01417000
         B     @RC00523                                            0528 01418000
@RF00523 DS    0H                                                  0529 01419000
*       TGNAME=ICTLMOD(1);          /* MOVE IN LOAD MODULE NAME FROM    01420000
*                                      ICT LMOD IN PROCESS           */ 01421000
         LH    @15,K                                               0529 01422000
         SLA   @15,2                                               0529 01423000
         LH    @08,J                                               0529 01424000
         SLA   @08,2                                               0529 01425000
         LH    @07,I                                               0529 01426000
         MH    @07,@CH01885                                        0529 01427000
         L     @01,CCAICPTF(,CCAPTR)                               0529 01428000
         AL    @01,@CF01905                                        0529 01429000
         L     @01,ICTPCHN-64(@07,@01)                             0529 01430000
         AL    @01,@CF01906                                        0529 01431000
         L     @08,ICTIXP(@08,@01)                                 0529 01432000
         MVC   @TF00001(4),ICTMCHN(@08)                            0529 01433000
         L     @08,@TF00001                                        0529 01434000
         AL    @08,@CF01906                                        0529 01435000
         L     @15,ICTIXM(@15,@08)                                 0529 01436000
         MVC   TGNAME(8),ICTLMOD(@15)                              0529 01437000
*       CSNAME=LMNAME;              /* MOVE IN CSECT NAME            */ 01438000
         MVC   CSNAME(8),LMNAME                                    0530 01439000
*     END;                                                         0531 01440000
*   IF DODUMP=ON                    /* DUMP CARD TO BE PUT OUT BEFORE   01441000
*                                      NAME CARD ?           @OS70966*/ 01442000
*     THEN                          /* YES                   @OS70966*/ 01443000
@RC00523 TM    DODUMP,B'00000100'                                  0532 01444000
         BNO   @RF00532                                            0532 01445000
*HMAZP115:                          /*                       @OS70966*/ 01446000
*     OUTNAME=CODUMP;               /* MOVE DUMP/ABSDUMP TO NAME AREA   01447000
*                                                            @OS70966*/ 01448000
HMAZP115 MVC   OUTNAME(8),CODUMP                                   0533 01449000
*   ELSE                            /* NO DUMP CARD FOUND    @OS70966*/ 01450000
*     OUTNAME=CONAME;               /* SET NAME CARD TO NAME @OS70966*/ 01451000
         B     @RC00532                                            0534 01452000
@RF00532 MVC   OUTNAME(8),CONAME                                   0534 01453000
*   IOPBUFAD=ADDR(OUTREC);          /* POINT AT NAME CARD            */ 01454000
@RC00532 LA    @15,OUTREC                                          0535 01455000
         ST    @15,IOPBUFAD(,IOPPTR)                               0535 01456000
         EJECT                                                          01457000
*                                                                  0536 01458000
*   /*****************************************************************/ 01459000
*   /*                                                               */ 01460000
*   /* WRITE RECORD TO UTILITY FILE FOR SUPERZAP SYSIN               */ 01461000
*   /*                                                               */ 01462000
*   /*****************************************************************/ 01463000
*                                                                  0536 01464000
*HMAZP120:                                                         0536 01465000
*   IF ZAPFLSH=OFF                  /* BYPASS WRITE TO SYSUT1 IF THIS   01466000
*                                      LMOD BEING FLUSHED    @SA71755*/ 01467000
*     THEN                          /*                       @SA71755*/ 01468000
HMAZP120 TM    ZAPFLSH,B'00100000'                                 0536 01469000
         BNZ   @RF00536                                            0536 01470000
*     DO;                           /* NORMAL WRITE TO SYSUT1      0537 01471000
*                                                            @SA71755*/ 01472000
*       ANYUT1=ON;                  /* INDICATE UTILITY SYSUT1 IS  0538 01473000
*                                      WRITTEN               @SA71755*/ 01474000
         OI    ANYUT1,B'00000001'                                  0538 01475000
*       IOPDSID=IOPSCR1;            /* DATA SET ID TO SYSUT1         */ 01476000
         MVI   IOPDSID(IOPPTR),X'03'                               0539 01477000
*       IOPFUNCT=IOPWRITE;          /* SET FUNCTION TO WRITE         */ 01478000
         MVI   IOPFUNCT(IOPPTR),X'51'                              0540 01479000
*       CALL HMASMIO(HMASMIOP);     /* CALL IO ROUTINE               */ 01480000
         ST    IOPPTR,@AL00001                                     0541 01481000
         L     @15,@CV01807                                        0541 01482000
         LA    @01,@AL00001                                        0541 01483000
         BALR  @14,@15                                             0541 01484000
*       IF IOPRETRN>IOPGOOD         /* IF AN IO ERROR OCCURED      0542 01485000
*                                                            @YA07506*/ 01486000
*         THEN                                                     0542 01487000
         CLI   IOPRETRN(IOPPTR),0                                  0542 01488000
         BNH   @RF00542                                            0542 01489000
*         DO;                                                      0543 01490000
*           ZAPERROR=ON;            /* ERROR SW              @Z67SP00*/ 01491000
         OI    ZAPERROR,B'00000001'                                0544 01492000
*           ZAPRTNCD=MAX(ZAPRTNCD,IOPRETRN);/* SET RC TO I/O ERR   0545 01493000
*                                                            @YA07506*/ 01494000
         SLR   @15,@15                                             0545 01495000
         IC    @15,ZAPRTNCD                                        0545 01496000
         SLR   @08,@08                                             0545 01497000
         IC    @08,IOPRETRN(,IOPPTR)                               0545 01498000
         CR    @15,@08                                             0545 01499000
         BNL   *+6                                                      01500000
         LR    @15,@08                                             0545 01501000
         STC   @15,ZAPRTNCD                                        0545 01502000
*           GOTO HMAZP050;          /* EXIT                  @Z67SP00*/ 01503000
         B     HMAZP050                                            0546 01504000
*           IOPBUFAD=SAVBUFAD;      /* RESTORE BUFFER ADDRESS        */ 01505000
*         END;                                                     0548 01506000
*       IF DODUMP=ON&NAMESCH=ON     /* WAS THIS SAVED DUMP CARD THAT    01507000
*                                      WAS JUST PUT OUT NOW? @OS70966*/ 01508000
*         THEN                      /* YES                   @OS70966*/ 01509000
@RF00542 TM    DODUMP,B'00000100'                                  0549 01510000
         BNO   @RF00549                                            0549 01511000
         TM    NAMESCH,B'10000000'                                 0549 01512000
         BNO   @RF00549                                            0549 01513000
*         DO;                       /* THEN STILL NEED TO PUT OUT  0550 01514000
*                                      NAME                  @OS70966*/ 01515000
*           OUTNAME=CONAME;         /* SET CARD AREA TO NAME @OS70966*/ 01516000
         MVC   OUTNAME(8),CONAME                                   0551 01517000
*           DODUMP=OFF;             /* RESET DUMP SW         @OS70966*/ 01518000
         NI    DODUMP,B'11111011'                                  0552 01519000
*           GO TO HMAZP120;         /* GO TO PUT OUT NAME CARD     0553 01520000
*                                                            @OS70966*/ 01521000
         B     HMAZP120                                            0553 01522000
*         END;                      /* END NEED NAME CARD    @OS70966*/ 01523000
*     END;                          /* END OF WRITE TO SYSUT1      0555 01524000
*                                                            @SA71755*/ 01525000
@RF00549 DS    0H                                                  0556 01526000
*   IOPBUFAD=SAVBUFAD;              /* RESTORE BUFFER ADDRESS        */ 01527000
@RF00536 L     @15,SAVBUFAD                                        0556 01528000
         ST    @15,IOPBUFAD(,IOPPTR)                               0556 01529000
*   GO TO HMAZP035;                 /* READ NEXT RECORD              */ 01530000
         B     HMAZP035                                            0557 01531000
         EJECT                                                          01532000
*                                                                  0558 01533000
*   /*****************************************************************/ 01534000
*   /*                                                               */ 01535000
*   /* VERIFY ROUTINE, THE VERIFY ROUTINE WILL OUTPUT CARDS TO SYSUT1*/ 01536000
*   /* AS LONG AS THE REPPASS SW. IS NOT ON --- SCN_ROUT             */ 01537000
*   /*                                                               */ 01538000
*   /*****************************************************************/ 01539000
*                                                                  0558 01540000
*RVER:                                                             0558 01541000
*   RESPECIFY                                                      0558 01542000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01543000
RVER     DS    0H                                                  0559 01544000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01545000
         ST    R1,PARSAV                                           0559 01546000
*   RESPECIFY                                                      0560 01547000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01548000
*   NAMESCH=OFF;                    /* RESET NAME SCANNED SW OFF     */ 01549000
         NI    NAMESCH,B'01111111'                                 0561 01550000
*   IF REPPASS=ON                   /* IF IN REPLACE PASS            */ 01551000
*     THEN                                                         0562 01552000
         TM    REPPASS,B'00001000'                                 0562 01553000
         BNO   @RF00562                                            0562 01554000
*     NOWRITE=ON;                   /* SET NOWRITE TO SYSUT1 SW ON   */ 01555000
         OI    NOWRITE,B'10000000'                                 0563 01556000
*   GO TO HMAZP700;                                                0564 01557000
         B     HMAZP700                                            0564 01558000
         EJECT                                                          01559000
*                                                                  0565 01560000
*   /*****************************************************************/ 01561000
*   /*                                                               */ 01562000
*   /* REPLACE ROUTINE, THE REPLACE ROUTINE WILL OUTPUT REPLACE CARDS*/ 01563000
*   /* TO SYSUT1 AS LONG AS THE REPPASS SW. IS SET --- SCN_ROUT      */ 01564000
*   /*                                                               */ 01565000
*   /*****************************************************************/ 01566000
*                                                                  0565 01567000
*RREP:                                                             0565 01568000
*   RESPECIFY                                                      0565 01569000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01570000
RREP     DS    0H                                                  0566 01571000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01572000
         ST    R1,PARSAV                                           0566 01573000
*   RESPECIFY                                                      0567 01574000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01575000
*   NAMESCH=OFF;                    /* RESET NAME SCANNED SW OFF     */ 01576000
         NI    NAMESCH,B'01111111'                                 0568 01577000
*   IF REPPASS=OFF                  /* IF THE REPLACE SWITCH IS NOT     01578000
*                                      SET                           */ 01579000
*     THEN                                                         0569 01580000
         TM    REPPASS,B'00001000'                                 0569 01581000
         BNZ   @RF00569                                            0569 01582000
*     NOWRITE=ON;                   /* SET NOWRITE TO SYSUT1 SW ON   */ 01583000
         OI    NOWRITE,B'10000000'                                 0570 01584000
*   GO TO HMAZP700;                                                0571 01585000
         B     HMAZP700                                            0571 01586000
         EJECT                                                          01587000
*                                                                  0572 01588000
*   /*****************************************************************/ 01589000
*   /*                                                               */ 01590000
*   /* COMMON RETURN TO SCAN ROUTINE                                 */ 01591000
*   /*                                                               */ 01592000
*   /*****************************************************************/ 01593000
*                                                                  0572 01594000
*HMAZP700:                                                         0572 01595000
*   SCPRET=SCPNDSCN;                /* INDICATE GOOD SCAN    @Z40SP00*/ 01596000
HMAZP700 MVI   SCPRET,X'04'                                        0572 01597000
*   RFY                                                            0573 01598000
*     R1 RSTD;                      /*                       @ZD00001*/ 01599000
*   R1=PARSAV;                      /* RESTORE R1 FOR SCAN   @Z67SP00*/ 01600000
         L     R1,PARSAV                                           0574 01601000
*   GO TO SCANRETN;                 /* RETURN TO HMASMSCN    @ZD00001*/ 01602000
         BR    R14                                                 0575 01603000
*   RFY                                                            0576 01604000
*     R1 UNRSTD;                    /*                       @ZD00001*/ 01605000
         EJECT                                                          01606000
*                                                                  0577 01607000
*   /*****************************************************************/ 01608000
*   /*                                                               */ 01609000
*   /* ENTERED FROM SCAN ROUTINE WHEN THE FIRST PARAMETER ON A NAME  */ 01610000
*   /* CARD IS FOUND- THIS MAY BE A LOAD MODULE NAME OR CSECT NAME   */ 01611000
*   /* --- SCN_ROUT                                                  */ 01612000
*   /*                                                               */ 01613000
*   /*****************************************************************/ 01614000
*                                                                  0577 01615000
*RLMOD:                                                            0577 01616000
*   RESPECIFY                                                      0577 01617000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01618000
RLMOD    DS    0H                                                  0578 01619000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01620000
         ST    R1,PARSAV                                           0578 01621000
*   LMNAME=SCANRCD(1:SCPPMLN);      /* SAVE FIRST OPERAND AS LMOD, 0579 01622000
*                                      MAY BE LMOD OR CSECT  @Z40SP00*/ 01623000
         MVI   LMNAME+1,C' '                                       0579 01624000
         MVC   LMNAME+2(6),LMNAME+1                                0579 01625000
         LH    @15,SCPPMLN                                         0579 01626000
         BCTR  @15,0                                               0579 01627000
         L     @08,SCPCHAR                                         0579 01628000
         EX    @15,@SM01918                                        0579 01629000
*   GO TO RNAME;                    /* RETURN TO SCAN VIA NAME     0580 01630000
*                                      ROUTINE                       */ 01631000
         B     RNAME                                               0580 01632000
*   RESPECIFY                                                      0581 01633000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01634000
         EJECT                                                          01635000
*                                                                  0582 01636000
*   /*****************************************************************/ 01637000
*   /*                                                               */ 01638000
*   /* THIS ROUTINE IS ENTERED WHEN A SECOND PARAMETER IS FOUND ON A */ 01639000
*   /* NAME CARD --- SCN_ROUT                                        */ 01640000
*   /*                                                               */ 01641000
*   /*****************************************************************/ 01642000
*                                                                  0582 01643000
*RMOD:                                                             0582 01644000
*   RESPECIFY                                                      0582 01645000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01646000
RMOD     DS    0H                                                  0583 01647000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01648000
         ST    R1,PARSAV                                           0583 01649000
*   RESPECIFY                                                      0584 01650000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01651000
*   ANYTWO=ON;                      /* SET TWO OPERAND NAME CARD   0585 01652000
*                                      FOUND SW ON           @ZA01311*/ 01653000
         OI    ANYTWO,B'00000010'                                  0585 01654000
*   IF CCAACCPT=ON                  /* ARE WE IN ACCEPT MODE?        */ 01655000
*     THEN                          /* YES - SET TO DLIB NAME        */ 01656000
         TM    CCAACCPT(CCAPTR),B'00100000'                        0586 01657000
         BNO   @RF00586                                            0586 01658000
*     LMNAME=SCANRCD(1:SCPPMLN);    /* IGNORE PREVIOUS LM NAME       */ 01659000
         MVI   LMNAME+1,C' '                                       0587 01660000
         MVC   LMNAME+2(6),LMNAME+1                                0587 01661000
         LH    @15,SCPPMLN                                         0587 01662000
         BCTR  @15,0                                               0587 01663000
         L     @08,SCPCHAR                                         0587 01664000
         EX    @15,@SM01918                                        0587 01665000
*   ELSE                            /* OTHERWISE - CHECK IF LOAD MODS*/ 01666000
*     IF LMNAME¬=ICTLMNAM(1)        /* AGREE - IF NOT IGNORE THIS    */ 01667000
*       THEN                        /* LOAD MOD AND WAIT FOR NEXT    */ 01668000
         B     @RC00586                                            0588 01669000
@RF00586 LH    @15,K                                               0588 01670000
         SLA   @15,2                                               0588 01671000
         LH    @08,J                                               0588 01672000
         SLA   @08,2                                               0588 01673000
         LH    @07,I                                               0588 01674000
         MH    @07,@CH01885                                        0588 01675000
         L     @01,CCAICPTF(,CCAPTR)                               0588 01676000
         AL    @01,@CF01905                                        0588 01677000
         L     @01,ICTPCHN-64(@07,@01)                             0588 01678000
         AL    @01,@CF01906                                        0588 01679000
         L     @08,ICTIXP(@08,@01)                                 0588 01680000
         MVC   @TF00001(4),ICTMCHN(@08)                            0588 01681000
         L     @08,@TF00001                                        0588 01682000
         AL    @08,@CF01906                                        0588 01683000
         L     @15,ICTIXM(@15,@08)                                 0588 01684000
         CLC   LMNAME(8),ICTLMNAM(@15)                             0588 01685000
         BE    @RF00588                                            0588 01686000
*       DO;                         /*                       @SA71755*/ 01687000
*         ZAPFLSH=ON;               /* FLUSH ZAP FOR THIS LMOD     0590 01688000
*                                                            @SA71755*/ 01689000
*         RFY                       /*                       @SA71755*/ 01690000
*          (ICTLMOD) BASED(ICTIXM(L));/*                     @Z40SP00*/ 01691000
*         ZAPKILL=ON;               /* ASSUME POSSIBILITY OF INVALID    01692000
*                                      LMOD NAME             @SA71755*/ 01693000
         OI    ZAPFLSH,B'00100010'                                 0592 01694000
*         DO L=1 TO MX WHILE ICTIXM(L)¬=ICTENDIX;/* SCAN THRU ALL  0593 01695000
*                                      LMODS FOR THIS MOD    @Z40SP00*/ 01696000
         LA    @15,1                                               0593 01697000
         STH   @15,L                                               0593 01698000
@DL00593 SLA   @15,2                                               0593 01699000
         LH    @08,J                                               0593 01700000
         SLA   @08,2                                               0593 01701000
         LH    @07,I                                               0593 01702000
         MH    @07,@CH01885                                        0593 01703000
         L     @01,CCAICPTF(,CCAPTR)                               0593 01704000
         AL    @01,@CF01905                                        0593 01705000
         L     @01,ICTPCHN-64(@07,@01)                             0593 01706000
         AL    @01,@CF01906                                        0593 01707000
         L     @08,ICTIXP(@08,@01)                                 0593 01708000
         MVC   @TF00001(4),ICTMCHN(@08)                            0593 01709000
         L     @08,@TF00001                                        0593 01710000
         AL    @08,@CF01906                                        0593 01711000
         L     @15,ICTIXM(@15,@08)                                 0593 01712000
         CL    @15,ICTENDIX                                        0593 01713000
         BE    @DC00593                                            0593 01714000
*           IF LMNAME=ICTLMNAM(1)   /*                       @SA71755*/ 01715000
*             THEN                  /* IF ANY LMOD MATCHES LMOD ON 0594 01716000
*                                      NAME CARD             @SA71755*/ 01717000
         CLC   LMNAME(8),ICTLMNAM(@15)                             0594 01718000
         BNE   @RF00594                                            0594 01719000
*             ZAPKILL=OFF;          /* THEN ALLOW PROCESSING TO    0595 01720000
*                                      CONTINUE              @SA71755*/ 01721000
         NI    ZAPKILL,B'11111101'                                 0595 01722000
*         END;                      /* ELSE ZAPKILL IS LEFT ON -   0596 01723000
*                                      FLUSH PTF AFTER VERIFY PASS 0596 01724000
*                                                            @SA71755*/ 01725000
@RF00594 LA    @15,1                                               0596 01726000
         AH    @15,L                                               0596 01727000
         STH   @15,L                                               0596 01728000
         C     @15,@CF01724                                        0596 01729000
         BNH   @DL00593                                            0596 01730000
@DC00593 DS    0H                                                  0597 01731000
*         RFY                       /*                       @SA71755*/ 01732000
*          (ICTLMOD) BASED(ICTIXM(K));/*                     @Z40SP00*/ 01733000
*       END;                        /*                       @SA71755*/ 01734000
*     ELSE                          /* OTHERWISE - ACCEPT BOTH NAMES */ 01735000
*       DO;                                                        0599 01736000
         B     @RC00588                                            0599 01737000
@RF00588 DS    0H                                                  0600 01738000
*         TWONAME=ON;               /* SET SECOND NAME SWITCH        */ 01739000
         OI    TWONAME,B'00100000'                                 0600 01740000
*         SECNAME=SCANRCD(1:SCPPMLN);/* EXIT TO NAME ROUTINE         */ 01741000
         MVI   SECNAME+1,C' '                                      0601 01742000
         MVC   SECNAME+2(6),SECNAME+1                              0601 01743000
         LH    @15,SCPPMLN                                         0601 01744000
         BCTR  @15,0                                               0601 01745000
         L     @08,SCPCHAR                                         0601 01746000
         EX    @15,@SM01922                                        0601 01747000
*       END;                                                       0602 01748000
*   GO TO HMAZP700;                                                0603 01749000
         B     HMAZP700                                            0603 01750000
         EJECT                                                          01751000
*                                                                  0604 01752000
*   /*****************************************************************/ 01753000
*   /*                                                               */ 01754000
*   /* IDR DATA ROUTINE, THE IDR DATA ROUTINE WILL OUTPUT A CARD ON  */ 01755000
*   /* THE REPLACE PASS ONLY --- SCN_ROUT                            */ 01756000
*   /*                                                               */ 01757000
*   /*****************************************************************/ 01758000
*                                                                  0604 01759000
*RIDR:                                                             0604 01760000
*   RESPECIFY                                                      0604 01761000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01762000
RIDR     DS    0H                                                  0605 01763000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01764000
         ST    R1,PARSAV                                           0605 01765000
*   RESPECIFY                                                      0606 01766000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01767000
*   IF REPPASS=OFF                  /* IS THIS REPLACE PASS? @Z40SP00*/ 01768000
*     THEN                                                         0607 01769000
         TM    REPPASS,B'00001000'                                 0607 01770000
         BNZ   @RF00607                                            0607 01771000
*     NOWRITE=ON;                   /* NO - BYPASS CARD IF VERIFY  0608 01772000
*                                      PASS                  @Z40SP00*/ 01773000
         OI    NOWRITE,B'10000000'                                 0608 01774000
*   GO TO HMAZP700;                 /* IDRDATA CARD WRITTEN ONLY IF     01775000
*                                      REP PASS              @Z40SP00*/ 01776000
         B     HMAZP700                                            0609 01777000
         EJECT                                                          01778000
*                                                                  0610 01779000
*   /*****************************************************************/ 01780000
*   /*                                                               */ 01781000
*   /* ABSDUMP AND DUMP ROUTINE IF A DUMP OR ABSDUMP IS FOUND        */ 01782000
*   /* PREVIOUS TO A VERIFY CARD THEN THIS CARD WILL BE PLACED IN THE*/ 01783000
*   /* VERIFY RUN. IF IT IS FOUND SUBSEQUENT TO A VERIFY OR A REP    */ 01784000
*   /* CARD IT WILL BE PLACED IN THE REPLACE RUN --- SCN_ROUT        */ 01785000
*   /*                                                               */ 01786000
*   /*****************************************************************/ 01787000
*                                                                  0610 01788000
*RABSD:                                                            0610 01789000
*RDUMP:                                                            0610 01790000
*   RESPECIFY                                                      0610 01791000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01792000
RABSD    DS    0H                                                  0610 01793000
RDUMP    DS    0H                                                  0611 01794000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01795000
         ST    R1,PARSAV                                           0611 01796000
*   RESPECIFY                                                      0612 01797000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01798000
*   IF(NAMESCH=ON&                  /* IF NAME WAS PREV. SCANNED     */ 01799000
*       VERPASS=ON)                 /* AND THIS IS VERIFY PASS OR    */ 01800000
*       |(NAMESCH=OFF&              /* IF NAME CARD WAS NOT PREV.  0613 01801000
*                                      SCANNED                       */ 01802000
*       REPPASS=ON)                 /* AND THIS IS REPLACE PASS      */ 01803000
*     THEN                                                         0613 01804000
         TM    NAMESCH,B'10000100'                                 0613 01805000
         BO    @RT00613                                            0613 01806000
         TM    REPPASS,B'00001000'                                 0613 01807000
         BNO   @RF00613                                            0613 01808000
         TM    NAMESCH,B'10000000'                                 0613 01809000
         BNZ   @RF00613                                            0613 01810000
@RT00613 DS    0H                                                  0614 01811000
*     DO;                                                          0614 01812000
*       CODUMP=SCANRCD(1:SCPPMLN+1);/* MOVE IN FUNCTION TO RCD     0615 01813000
*                                                            @OS70966*/ 01814000
         MVI   CODUMP+1,C' '                                       0615 01815000
         MVC   CODUMP+2(6),CODUMP+1                                0615 01816000
         LH    @15,SCPPMLN                                         0615 01817000
         L     @08,SCPCHAR                                         0615 01818000
         EX    @15,@SM01924                                        0615 01819000
*       DUMPSW=ON;                  /* SET DUMP CARD B4 NAME CARD AT    01820000
*                                      REP                   @OY01965*/ 01821000
         OI    DUMPSW,B'00001000'                                  0616 01822000
*     END;                                                         0617 01823000
*   ELSE                            /* OTHERWISE - DON'T WANT THIS 0618 01824000
*                                      CARD                          */ 01825000
*     NOWRITE=ON;                   /* SET NOWRITE TO SYSUT1 SW ON   */ 01826000
         B     @RC00613                                            0618 01827000
@RF00613 OI    NOWRITE,B'10000000'                                 0618 01828000
*   GO TO HMAZP700;                                                0619 01829000
         B     HMAZP700                                            0619 01830000
         EJECT                                                          01831000
*                                                                  0620 01832000
*   /*****************************************************************/ 01833000
*   /*                                                               */ 01834000
*   /* BASE CARD ROUTINE --- SCN_ROUT                                */ 01835000
*   /*                                                               */ 01836000
*   /*****************************************************************/ 01837000
*                                                                  0620 01838000
*RBASE:                                                            0620 01839000
*   RESPECIFY                                                      0620 01840000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01841000
RBASE    DS    0H                                                  0621 01842000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01843000
         ST    R1,PARSAV                                           0621 01844000
*   IF NAMESCH=OFF                  /* IF NAME CARD WAS NOT PREV.  0622 01845000
*                                      SCANNED                       */ 01846000
*     THEN                                                         0622 01847000
         TM    NAMESCH,B'10000000'                                 0622 01848000
         BZ    @RT00622                                            0622 01849000
*     GO TO RCCHHR;                 /* INDICATE ERROR        @YA07506*/ 01850000
*   ELSE                                                           0624 01851000
*     GO TO HMAZP700;                                              0624 01852000
         B     HMAZP700                                            0624 01853000
*   RESPECIFY                                                      0625 01854000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01855000
         EJECT                                                          01856000
*                                                                  0626 01857000
*   /*****************************************************************/ 01858000
*   /*                                                               */ 01859000
*   /* SETSSI ROUTINE THE SETSSI CARD WILL BE OUTPUT ON A REPLACE    */ 01860000
*   /* PASS ONLY --- SCN_ROUT                                        */ 01861000
*   /*                                                               */ 01862000
*   /*****************************************************************/ 01863000
*                                                                  0626 01864000
*RSETSSI:                                                          0626 01865000
*   RESPECIFY                                                      0626 01866000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01867000
RSETSSI  DS    0H                                                  0627 01868000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01869000
         ST    R1,PARSAV                                           0627 01870000
*   RESPECIFY                                                      0628 01871000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01872000
*   IF REPPASS=OFF                  /* IS THIS REPLACE PASS? @Z40SP00*/ 01873000
*     THEN                                                         0629 01874000
         TM    REPPASS,B'00001000'                                 0629 01875000
         BNZ   @RF00629                                            0629 01876000
*     NOWRITE=ON;                   /* NO - BYPASS SETSSI CARD ON  0630 01877000
*                                      VERIFY PASS           @Z40SP00*/ 01878000
         OI    NOWRITE,B'10000000'                                 0630 01879000
*   GO TO HMAZP700;                 /* SETSSI CARD IS WRITTEN ONLY 0631 01880000
*                                      FOR REP PASS          @Z40SP00*/ 01881000
         B     HMAZP700                                            0631 01882000
         EJECT                                                          01883000
*                                                                  0632 01884000
*   /*****************************************************************/ 01885000
*   /*                                                               */ 01886000
*   /* CONSIDERED BAD INPUT TO SMP SUPERZAP INVOKING ROUTINE ---     */ 01887000
*   /* SCN_ROUT                                                      */ 01888000
*   /*                                                               */ 01889000
*   /*****************************************************************/ 01890000
*                                                                  0632 01891000
*RCCHHR:                                                           0632 01892000
*RCONS:                                                            0632 01893000
*HMAZP920:                                                         0632 01894000
*   RESPECIFY                                                      0632 01895000
*     R1 RSTD;                      /*                       @Z67SP00*/ 01896000
RCCHHR   DS    0H                                                  0632 01897000
RCONS    DS    0H                                                  0632 01898000
HMAZP920 DS    0H                                                  0633 01899000
*   PARSAV=R1;                      /* SAVE REGISTER 1       @Z67SP00*/ 01900000
         ST    R1,PARSAV                                           0633 01901000
*   RESPECIFY                                                      0634 01902000
*     R1 UNRSTD;                    /*                       @Z67SP00*/ 01903000
*   SCPRET=SCPSTOP;                 /* SET HIGH RETURN CODE FOR SCAN    01904000
*                                                            @Z40SP00*/ 01905000
         MVI   SCPRET,X'08'                                        0635 01906000
*   RFY                                                            0636 01907000
*     R1 RSTD;                      /*                       @ZD00001*/ 01908000
*   R1=PARSAV;                      /* RESTORE R1 FOR SCAN   @Z67SP00*/ 01909000
         L     @15,PARSAV                                          0637 01910000
         LR    R1,@15                                              0637 01911000
*   GO TO SCANRETN;                 /* RETURN TO HMASMSCN    @ZD00001*/ 01912000
         BR    R14                                                 0638 01913000
*   RFY                                                            0639 01914000
*     R1 UNRSTD;                    /*                       @ZD00001*/ 01915000
*                                                                  0640 01916000
*   /*****************************************************************/ 01917000
*   /*                                                               */ 01918000
*   /* COMMON RETURN TO CALLER                               @Z67SP00*/ 01919000
*   /*                                                               */ 01920000
*   /*****************************************************************/ 01921000
*                                                                  0640 01922000
*HMAZP970:                                                         0640 01923000
*   RETURN CODE(ZAPRTNCD);          /* RETURN TO CALLER WITH HIGHEST    01924000
*                                      RETURN CODE ENCOUNTERED.    0640 01925000
*                                                            @YA07506*/ 01926000
HMAZP970 SLR   @15,@15                                             0640 01927000
         IC    @15,ZAPRTNCD                                        0640 01928000
         L     @13,4(,@13)                                         0640 01929000
         L     @14,12(,@13)                                        0640 01930000
         LM    @00,@12,20(@13)                                     0640 01931000
         BR    @14                                                 0640 01932000
*   END HMASMZAP                                                   0641 01933000
*                                                                  0641 01934000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01935000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 01936000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 01937000
*/*%INCLUDE SYSLIB  (HMASMICT)                                       */ 01938000
*/*%INCLUDE SYSLIB  (HMASMSCP)                                       */ 01939000
*/*%INCLUDE SYSLIB  (HMASMPRL)                                       */ 01940000
*/*%INCLUDE SYSLIB  (HMASMMGP)                                       */ 01941000
*                                                                  0641 01942000
*       ;                                                          0641 01943000
@DATA    DS    0H                                                       01944000
@CH00435 DC    H'11'                                                    01945000
@CH00064 DC    H'15'                                                    01946000
@CH00083 DC    H'32'                                                    01947000
@CH00483 DC    H'38'                                                    01948000
@CH00730 DC    H'50'                                                    01949000
@CH01036 DC    H'71'                                                    01950000
@CH00521 DC    H'85'                                                    01951000
@CH00531 DC    H'90'                                                    01952000
@CH01885 DC    H'116'                                                   01953000
@SM01918 MVC   LMNAME(0),SCANRCD(@08)                                   01954000
@SM01922 MVC   SECNAME(0),SCANRCD(@08)                                  01955000
@SM01924 MVC   CODUMP(0),SCANRCD(@08)                                   01956000
         DS    0F                                                       01957000
@AL00292 DC    A(HMASMSCP)             LIST WITH   1 ARGUMENT(S)        01958000
@AL00332 EQU   *                       LIST WITH   1 ARGUMENT(S)        01959000
@AL00370 EQU   *                       LIST WITH   1 ARGUMENT(S)        01960000
@AL00450 EQU   *                       LIST WITH   1 ARGUMENT(S)        01961000
@AL00519 DC    A(HMASMMGP)             LIST WITH   1 ARGUMENT(S)        01962000
@AL00479 DC    A(STATUS)               LIST WITH   1 ARGUMENT(S)        01963000
         DS    0F                                                       01964000
@SA00001 DS    18F                                                      01965000
@AL00001 DS    2A                                                       01966000
@TF00001 DS    F                                                        01967000
@TF00002 DS    F                                                        01968000
@ZTEMPS  DS    0F                                                       01969000
@ZT00003 DC    F'0'                                                     01970000
@ZTEMPND EQU   *                                                        01971000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         01972000
         DS    0F                                                       01973000
@CF00085 DC    F'1'                                                     01974000
@CF01724 DC    F'10000'                                                 01975000
@CF01901 DC    F'-116'                                                  01976000
@CF01903 DC    F'-108'                                                  01977000
@CF01904 DC    F'-102'                                                  01978000
@CF01905 DC    F'-52'                                                   01979000
@CF01906 DC    F'-4'                                                    01980000
@CV01804 DC    V(HMASMSCN)                                              01981000
@CV01805 DC    V(HMASMSEC)                                              01982000
@CV01806 DC    V(HMASMCPL)                                              01983000
@CV01807 DC    V(HMASMIO)                                               01984000
@CV01808 DC    V(HMASMMSG)                                              01985000
         DS    0D                                                       01986000
SAVBUFAD DS    A                                                        01987000
PARSAV   DS    A                                                        01988000
I        DS    H                                                        01989000
J        DS    H                                                        01990000
K        DS    H                                                        01991000
L        DS    H                                                        01992000
P        DS    H                                                        01993000
ZAPRTNCD DC    AL1(0)                                                   01994000
@CC01704 DC    C'SUCCESSFUL'                                            01995000
@CC01707 DC    C'FAILED    '                                            01996000
@CC01700 DC    C'VERIFY '                                               01997000
@CC01702 DC    C'REPLACE'                                               01998000
         DS    CL3                                                      01999000
ICTENDCH DC    X'FFFFFFFF'                                              02000000
HMASMSCP DS    CL26                                                     02001000
         ORG   HMASMSCP                                                 02002000
SCPCHAR  DS    AL4                                                      02003000
SCPSRCH  DS    AL4                                                      02004000
SCPWKAR  DS    AL4                                                      02005000
SCPIORTN DS    AL4                                                      02006000
SCPIOPAD DS    AL4                                                      02007000
SCPINLN  DS    FL2                                                      02008000
SCPPMLN  DS    FL2                                                      02009000
SCPEOR   DS    BL1                                                      02010000
         ORG   SCPEOR                                                   02011000
SCPCONT  DS    BL1                                                      02012000
SCPNOCT  EQU   SCPEOR+0                                                 02013000
SCPCOMNT EQU   SCPEOR+0                                                 02014000
SCPRTERR EQU   SCPEOR+0                                                 02015000
SCPNOSUC EQU   SCPEOR+0                                                 02016000
SCPNORT  EQU   SCPEOR+0                                                 02017000
@NM00225 EQU   SCPEOR+0                                                 02018000
         ORG   HMASMSCP+25                                              02019000
SCPRETRN DS    FL1                                                      02020000
         ORG   SCPRETRN                                                 02021000
SCPRET   DS    FL1                                                      02022000
         ORG   HMASMSCP+26                                              02023000
         DS    CL2                                                      02024000
HMASMMGP DS    CL40                                                     02025000
         ORG   HMASMMGP                                                 02026000
MGPFIXED DS    CL12                                                     02027000
         ORG   MGPFIXED                                                 02028000
MGPCLEAR DS    CL6                                                      02029000
         ORG   MGPCLEAR                                                 02030000
MGPMGNO1 DS    FL2                                                      02031000
MGPMGNO2 DS    FL2                                                      02032000
MGPMGNO3 DS    FL2                                                      02033000
         ORG   MGPFIXED+6                                               02034000
MGPFLAGS DS    BL2                                                      02035000
         ORG   MGPFLAGS                                                 02036000
MGPPRINT DS    BL1                                                      02037000
MGPLIST  EQU   MGPFLAGS+0                                               02038000
MGPRPT   EQU   MGPFLAGS+0                                               02039000
MGPHLDS  EQU   MGPFLAGS+0                                               02040000
MGPWTOR  EQU   MGPFLAGS+0                                               02041000
MGPWTO   EQU   MGPFLAGS+0                                               02042000
MGPWTP   EQU   MGPFLAGS+0                                               02043000
@NM00228 EQU   MGPFLAGS+0                                               02044000
         ORG   MGPFIXED+8                                               02045000
MGPTYPE  DS    FL1                                                      02046000
@NM00229 DS    CL3                                                      02047000
         ORG   HMASMMGP+12                                              02048000
MGPVAR   DS    CL28                                                     02049000
         ORG   MGPVAR                                                   02050000
MGPVARPT DS    7A                                                       02051000
         ORG   HMASMMGP+40                                              02052000
SAVRVANM DS    CL8                                                      02053000
RETURNCD DS    CL2                                                      02054000
         DS    CL6                                                      02055000
DECNO    DS    CL8                                                      02056000
PATCHZAP DS    CL80                                                     02057000
         ORG   PATCHZAP                                                 02058000
@NM00233 DC    80X'FF'                                                  02059000
         ORG   PATCHZAP+80                                              02060000
CONAME   DC    CL8'NAME    '                                            02061000
CODUMP   DC    CL8'DUMP    '                                            02062000
LMNAME   DC    CL8' '                                                   02063000
SECNAME  DC    CL8' '                                                   02064000
OUTBUF   DS    CL100                                                    02065000
         ORG   OUTBUF                                                   02066000
PRLBUF   DC    CL10' '                                                  02067000
DASHES   DC    CL10'----------'                                         02068000
OUTREC   DC    CL80' '                                                  02069000
         ORG   OUTREC                                                   02070000
@NM00234 DS    CL1                                                      02071000
OUTNAME  DS    CL8                                                      02072000
@NM00235 DS    CL1                                                      02073000
TGNAME   DS    CL8                                                      02074000
@NM00236 DS    CL1                                                      02075000
CSNAME   DS    CL8                                                      02076000
@NM00237 DS    CL53                                                     02077000
         ORG   OUTBUF+100                                               02078000
HDRRCD   DS    CL80                                                     02079000
         ORG   HDRRCD                                                   02080000
@NM00238 DC    CL20'* ***** ZAP FOR MOD '                               02081000
HDRMOD   DS    CL8                                                      02082000
@NM00239 DC    CL8' IN PTF '                                            02083000
HDRPTF   DS    CL7                                                      02084000
@NM00240 DC    CL6' *****'                                              02085000
@NM00241 DC    CL31' '                                                  02086000
         ORG   HDRRCD+80                                                02087000
STATUS   DS    CL1                                                      02088000
GOOD     DC    CL1'G'                                                   02089000
BAD      DC    CL1'B'                                                   02090000
         DS    CL1                                                      02091000
OPTLST   DS    CL93                                                     02092000
         ORG   OPTLST                                                   02093000
OPTLGTH  DS    FL2                                                      02094000
OPTVAR   DS    CL91                                                     02095000
         ORG   OPTLST+93                                                02096000
         DS    CL1                                                      02097000
ZAPLIST  DS    CL50                                                     02098000
         ORG   ZAPLIST                                                  02099000
LISTLEN  DC    H'48'                                                    02100000
@NM00242 DS    CL8                                                      02101000
         ORG   @NM00242                                                 02102000
@NM00243 DC    8X'00'                                                   02103000
         ORG   ZAPLIST+10                                               02104000
@NM00244 DS    CL8                                                      02105000
         ORG   @NM00244                                                 02106000
@NM00245 DC    8X'00'                                                   02107000
         ORG   ZAPLIST+18                                               02108000
@NM00246 DS    CL8                                                      02109000
         ORG   @NM00246                                                 02110000
@NM00247 DC    8X'00'                                                   02111000
         ORG   ZAPLIST+26                                               02112000
SYSLIB   DC    CL8' '                                                   02113000
SYSIN    DC    CL8'SYSUT1  '                                            02114000
SYSPRINT DS    CL8                                                      02115000
         ORG   SYSPRINT                                                 02116000
@NM00248 DC    8X'00'                                                   02117000
         ORG   ZAPLIST+50                                               02118000
ZFLAGS1  DC    B'00000000'                                              02119000
         ORG   ZFLAGS1                                                  02120000
NAMESCH  DS    BL1                                                      02121000
ONENAME  EQU   ZFLAGS1+0                                                02122000
TWONAME  EQU   ZFLAGS1+0                                                02123000
BRSW     EQU   ZFLAGS1+0                                                02124000
REPPASS  EQU   ZFLAGS1+0                                                02125000
VERPASS  EQU   ZFLAGS1+0                                                02126000
ANYTWO   EQU   ZFLAGS1+0                                                02127000
ZAPERROR EQU   ZFLAGS1+0                                                02128000
         ORG   ZFLAGS1+1                                                02129000
ZFLAGS2  DC    B'00000000'                                              02130000
         ORG   ZFLAGS2                                                  02131000
NOWRITE  DS    BL1                                                      02132000
CALLCPL  EQU   ZFLAGS2+0                                                02133000
ZAPFLSH  EQU   ZFLAGS2+0                                                02134000
CMNTSW   EQU   ZFLAGS2+0                                                02135000
DUMPSW   EQU   ZFLAGS2+0                                                02136000
DODUMP   EQU   ZFLAGS2+0                                                02137000
ZAPKILL  EQU   ZFLAGS2+0                                                02138000
ANYUT1   EQU   ZFLAGS2+0                                                02139000
         ORG   ZFLAGS2+1                                                02140000
HMASMZAP CSECT                                                          02141000
KCMNT    DSCAN KEY='*',ALT=KVER,ROUT=RCMNT,IO=NO                        02142000
KVER     DSCAN KEY='VER',ALT=KREP,ROUT=RVER,IO=NO                       02143000
KREP     DSCAN KEY='REP',ALT=KNAME,ROUT=RREP,IO=NO                      02144000
KNAME    DSCAN KEY='NAME',ALT=KIDR,SUCC=KLMOD,ROUT=RNAME,IO=NO          02145000
KLMOD    DSCAN MAXLEN=8,ROUT=RLMOD,SUCC=KMOD,IO=NO                      02146000
KMOD     DSCAN MAXLEN=8,ROUT=RMOD,IO=NO                                 02147000
KIDR     DSCAN KEY='IDRDATA',ALT=KABSD,ROUT=RIDR,IO=NO                  02148000
KABSD    DSCAN KEY='ABSDUMP',ALT=KDUMP,ROUT=RABSD,IO=NO                 02149000
KDUMP    DSCAN KEY='DUMP',ALT=KBASE,ROUT=RDUMP,IO=NO                    02150000
KBASE    DSCAN KEY='BASE',ALT=KSETSSI,ROUT=RBASE,IO=NO                  02151000
KSETSSI  DSCAN KEY='SETSSI',ALT=KCCHHR,ROUT=RSETSSI,IO=NO               02152000
KCCHHR   DSCAN KEY='CCHHR',ALT=KCONS,ROUT=RCCHHR,IO=NO                  02153000
KCONS    DSCAN KEY='CONSOLE',ROUT=RCONS,IO=NO                           02154000
HMASMZAP CSECT                                                          02155000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02156000
@01      EQU   01                                                       02157000
@02      EQU   02                                                       02158000
@03      EQU   03                                                       02159000
@04      EQU   04                                                       02160000
@05      EQU   05                                                       02161000
@06      EQU   06                                                       02162000
@07      EQU   07                                                       02163000
@08      EQU   08                                                       02164000
@09      EQU   09                                                       02165000
@10      EQU   10                                                       02166000
@11      EQU   11                                                       02167000
@12      EQU   12                                                       02168000
@13      EQU   13                                                       02169000
@14      EQU   14                                                       02170000
@15      EQU   15                                                       02171000
CCAPTR   EQU   @11                                                      02172000
IOPPTR   EQU   @09                                                      02173000
RTNCODE  EQU   @15                                                      02174000
R1       EQU   @01                                                      02175000
R2       EQU   @02                                                      02176000
R14      EQU   @14                                                      02177000
RTNREG   EQU   @14                                                      02178000
HMASMCCA EQU   0                                                        02179000
CCAFBUFR EQU   HMASMCCA+4                                               02180000
CCADSAD  EQU   CCAFBUFR+124                                             02181000
CCATPAD  EQU   CCAFBUFR+128                                             02182000
CCAFLAG7 EQU   CCAFBUFR+132                                             02183000
CCAFIOP  EQU   HMASMCCA+140                                             02184000
CCAIOPTR EQU   CCAFIOP                                                  02185000
CCAFSYS  EQU   HMASMCCA+148                                             02186000
CCASREL  EQU   CCAFSYS+12                                               02187000
CCAFLAGA EQU   CCAFSYS+21                                               02188000
CCAFSTA  EQU   HMASMCCA+188                                             02189000
CCARVAD  EQU   CCAFSTA                                                  02190000
CCAFICT  EQU   HMASMCCA+192                                             02191000
CCAICT   EQU   CCAFICT                                                  02192000
CCAICPTF EQU   CCAFICT+4                                                02193000
CCAICMOD EQU   CCAFICT+8                                                02194000
CCAICLMD EQU   CCAFICT+12                                               02195000
CCAFPGM  EQU   HMASMCCA+208                                             02196000
CCABLDLP EQU   CCAFPGM                                                  02197000
CCADBLDL EQU   CCAFPGM+4                                                02198000
CCAFGTP  EQU   HMASMCCA+224                                             02199000
CCASEGTP EQU   CCAFGTP                                                  02200000
@NM00009 EQU   HMASMCCA+244                                             02201000
CCAFFUNC EQU   HMASMCCA+264                                             02202000
CCAFLAG1 EQU   CCAFFUNC+8                                               02203000
CCAACCPT EQU   CCAFLAG1                                                 02204000
CCAFLAG2 EQU   CCAFFUNC+11                                              02205000
CCAFPROC EQU   HMASMCCA+276                                             02206000
CCAFLAG3 EQU   CCAFPROC                                                 02207000
CCAFDIS  EQU   HMASMCCA+278                                             02208000
CCAFLAG4 EQU   CCAFDIS                                                  02209000
CCAFLAG5 EQU   CCAFDIS+1                                                02210000
CCAFLAG6 EQU   CCAFDIS+2                                                02211000
CCAFCNV  EQU   HMASMCCA+281                                             02212000
CCAFLAG8 EQU   CCAFCNV                                                  02213000
CCAFCTL  EQU   HMASMCCA+282                                             02214000
CCAFLAG9 EQU   CCAFCTL                                                  02215000
CCAFDSNG EQU   HMASMCCA+298                                             02216000
CCAFLAGB EQU   CCAFDSNG                                                 02217000
CCABLDLA EQU   0                                                        02218000
@NM00025 EQU   CCABLDLA                                                 02219000
CCABLDLL EQU   0                                                        02220000
@NM00027 EQU   CCABLDLL                                                 02221000
CCALKDRC EQU   @NM00027+20                                              02222000
@NM00029 EQU   CCABLDLL+124                                             02223000
CCAASMRC EQU   @NM00029+20                                              02224000
@NM00031 EQU   CCABLDLL+248                                             02225000
CCACPYRC EQU   @NM00031+20                                              02226000
@NM00033 EQU   CCABLDLL+372                                             02227000
CCACOMRC EQU   @NM00033+20                                              02228000
@NM00035 EQU   CCABLDLL+496                                             02229000
CCAZAPNM EQU   @NM00035                                                 02230000
CCASPZAP EQU   @NM00035+8                                               02231000
CCAZAPSP EQU   @NM00035+12                                              02232000
CCAZAPRC EQU   @NM00035+20                                              02233000
CCARZAP  EQU   CCAZAPRC                                                 02234000
CCAZAPPM EQU   @NM00035+24                                              02235000
@NM00037 EQU   CCABLDLL+620                                             02236000
CCASUPRC EQU   @NM00037+20                                              02237000
@NM00039 EQU   CCABLDLL+744                                             02238000
CCAUPDRC EQU   @NM00039+20                                              02239000
CCABLDLM EQU   0                                                        02240000
CCABELMT EQU   CCABLDLM+4                                               02241000
CCABMPOS EQU   CCABELMT                                                 02242000
HMASMIOP EQU   0                                                        02243000
IOPDSID  EQU   HMASMIOP                                                 02244000
IOPFUNCT EQU   HMASMIOP+1                                               02245000
IOPRETRN EQU   HMASMIOP+2                                               02246000
IOPTYPE  EQU   HMASMIOP+3                                               02247000
IOPNAME  EQU   HMASMIOP+4                                               02248000
@NM00043 EQU   HMASMIOP+12                                              02249000
@NM00044 EQU   @NM00043                                                 02250000
IOPDDNAM EQU   HMASMIOP+24                                              02251000
IOPBUFAD EQU   HMASMIOP+52                                              02252000
IOPDRMAP EQU   HMASMIOP+56                                              02253000
IOPINAME EQU   IOPDRMAP                                                 02254000
IOPINAM  EQU   IOPINAME                                                 02255000
IOPITYP  EQU   IOPINAM                                                  02256000
IOPUSERL EQU   IOPDRMAP+11                                              02257000
IOPEND   EQU   IOPDRMAP+12                                              02258000
IOPLMCTL EQU   0                                                        02259000
IOPQSMIF EQU   0                                                        02260000
@NM00154 EQU   IOPQSMIF                                                 02261000
IOPQSMLS EQU   IOPQSMIF+8                                               02262000
IOPQSMNM EQU   IOPQSMLS                                                 02263000
IOPBS02  EQU   0                                                        02264000
IOPBS04  EQU   0                                                        02265000
IOPBAPF  EQU   IOPBS04                                                  02266000
HMASMICT EQU   0                                                        02267000
ICTCORE  EQU   HMASMICT                                                 02268000
ICTPSPLN EQU   ICTCORE                                                  02269000
ICTMSPLN EQU   ICTCORE+4                                                02270000
ICTLSPLN EQU   ICTCORE+8                                                02271000
ICTGMSPL EQU   0                                                        02272000
ICTPTF   EQU   0                                                        02273000
ICTPTFS  EQU   ICTPTF                                                   02274000
ICTPEND  EQU   ICTPTFS                                                  02275000
ICTPFLG1 EQU   ICTPTF+7                                                 02276000
ICTPFLG3 EQU   ICTPTF+8                                                 02277000
ICTPPROC EQU   ICTPFLG3                                                 02278000
ICTPROCS EQU   ICTPPROC                                                 02279000
ICTPNOGO EQU   ICTPFLG3                                                 02280000
ICTPVERJ EQU   ICTPFLG3                                                 02281000
ICTPFLG5 EQU   ICTPTF+9                                                 02282000
ICTPFLG6 EQU   ICTPTF+11                                                02283000
ICTPFLF  EQU   ICTPFLG6                                                 02284000
ICTPFLG2 EQU   ICTPTF+12                                                02285000
ICTPFLG4 EQU   ICTPTF+13                                                02286000
ICTPFLG8 EQU   ICTPTF+14                                                02287000
ICTPECPL EQU   ICTPFLG8                                                 02288000
ICTPFLG9 EQU   ICTPTF+15                                                02289000
@NM00181 EQU   ICTPFLG9                                                 02290000
ICTPFLGA EQU   ICTPTF+16                                                02291000
ICTPUSR1 EQU   ICTPFLGA                                                 02292000
ICTPCHN  EQU   ICTPTF+64                                                02293000
ICTPRCHN EQU   ICTPTF+68                                                02294000
ICTPSCHN EQU   ICTPTF+72                                                02295000
ICTPPCHN EQU   ICTPTF+76                                                02296000
ICTPICHN EQU   ICTPTF+80                                                02297000
ICTPNCHN EQU   ICTPTF+84                                                02298000
ICTPVCHN EQU   ICTPTF+88                                                02299000
ICTPDCHN EQU   ICTPTF+92                                                02300000
ICTPBCHN EQU   ICTPTF+96                                                02301000
ICTIXPF  EQU   0                                                        02302000
ICTIXP   EQU   ICTIXPF                                                  02303000
ICTENTLS EQU   0                                                        02304000
ICTENTNT EQU   ICTENTLS                                                 02305000
ICTENTNM EQU   ICTENTNT                                                 02306000
ICTENTST EQU   ICTENTNT+7                                               02307000
ICTREQLS EQU   0                                                        02308000
ICTREQNT EQU   ICTREQLS                                                 02309000
ICTREQNM EQU   ICTREQNT                                                 02310000
ICTREQST EQU   ICTREQNT+7                                               02311000
ICTSUPLS EQU   0                                                        02312000
ICTSUPNT EQU   ICTSUPLS                                                 02313000
ICTSUPNM EQU   ICTSUPNT                                                 02314000
ICTPRELS EQU   0                                                        02315000
ICTPRENT EQU   ICTPRELS                                                 02316000
ICTPRENM EQU   ICTPRENT                                                 02317000
ICTPREST EQU   ICTPRENT+7                                               02318000
ICTIRQLS EQU   0                                                        02319000
ICTIRQNT EQU   ICTIRQLS                                                 02320000
ICTIRQNM EQU   ICTIRQNT                                                 02321000
ICTIRQST EQU   ICTIRQNT+7                                               02322000
ICTCSRST EQU   ICTIRQNT+15                                              02323000
ICTNPRLS EQU   0                                                        02324000
ICTNPRNT EQU   ICTNPRLS                                                 02325000
ICTNPRNM EQU   ICTNPRNT                                                 02326000
ICTVRSLS EQU   0                                                        02327000
ICTVRSNT EQU   ICTVRSLS                                                 02328000
ICTVRSNM EQU   ICTVRSNT                                                 02329000
ICTDELLS EQU   0                                                        02330000
ICTDELNT EQU   ICTDELLS                                                 02331000
ICTDELNM EQU   ICTDELNT                                                 02332000
ICTDELST EQU   ICTDELNT+7                                               02333000
ICTSBYLS EQU   0                                                        02334000
ICTSBYNT EQU   ICTSBYLS                                                 02335000
ICTSBYNM EQU   ICTSBYNT                                                 02336000
ICTMOD   EQU   0                                                        02337000
ICTMNAME EQU   ICTMOD                                                   02338000
ICTMFLG2 EQU   ICTMOD+8                                                 02339000
ICTMPROC EQU   ICTMFLG2                                                 02340000
ICTMCPL  EQU   ICTMFLG2                                                 02341000
ICTMFLG1 EQU   ICTMOD+9                                                 02342000
ICTMMODR EQU   ICTMFLG1                                                 02343000
ICTMZAP  EQU   ICTMFLG1                                                 02344000
ICTMFLG3 EQU   ICTMOD+10                                                02345000
ICTMFLG4 EQU   ICTMOD+11                                                02346000
ICTMISEL EQU   ICTMFLG4                                                 02347000
ICTMFLG5 EQU   ICTMOD+12                                                02348000
ICTMODF4 EQU   ICTMOD+13                                                02349000
ICTMLEP1 EQU   ICTMODF4                                                 02350000
ICTMODF5 EQU   ICTMOD+14                                                02351000
ICTMLEP2 EQU   ICTMODF5                                                 02352000
ICTMODF6 EQU   ICTMOD+15                                                02353000
ICTMLEP3 EQU   ICTMODF6                                                 02354000
ICTMODF7 EQU   ICTMOD+16                                                02355000
ICTMLEP4 EQU   ICTMODF7                                                 02356000
ICTMACF4 EQU   ICTMOD+17                                                02357000
ICTMCHN  EQU   ICTMOD+100                                               02358000
ICTMICHN EQU   ICTMOD+104                                               02359000
ICTMACHN EQU   ICTMOD+112                                               02360000
ICTMTCHN EQU   ICTMOD+116                                               02361000
ICTMVCHN EQU   ICTMOD+120                                               02362000
ICTMUCHN EQU   ICTMOD+124                                               02363000
ICTIXMF  EQU   0                                                        02364000
ICTIXM   EQU   ICTIXMF                                                  02365000
ICTMIDLS EQU   0                                                        02366000
ICTMID   EQU   ICTMIDLS                                                 02367000
ICTMODID EQU   ICTMID                                                   02368000
ICTMODST EQU   ICTMID+7                                                 02369000
ICTASMLS EQU   0                                                        02370000
ICTASMAD EQU   ICTASMLS                                                 02371000
ICTTALLS EQU   0                                                        02372000
ICTTALNM EQU   ICTTALLS                                                 02373000
ICTMVRLS EQU   0                                                        02374000
ICTMVRNT EQU   ICTMVRLS                                                 02375000
ICTMVRNM EQU   ICTMVRNT                                                 02376000
ICTMUMLS EQU   0                                                        02377000
ICTMUMNT EQU   ICTMUMLS                                                 02378000
ICTMUMNM EQU   ICTMUMNT                                                 02379000
ICTLMOD  EQU   0                                                        02380000
ICTLMNAM EQU   ICTLMOD                                                  02381000
ICTLNAME EQU   ICTLMNAM                                                 02382000
ICTLFLG4 EQU   ICTLMOD+8                                                02383000
ICTLFLG1 EQU   ICTLMOD+9                                                02384000
ICTLFLG5 EQU   ICTLMOD+10                                               02385000
ICTLFLG6 EQU   ICTLMOD+11                                               02386000
ICTLFLG7 EQU   ICTLMOD+12                                               02387000
ICTLFLG2 EQU   ICTLMOD+13                                               02388000
ICTLFLG3 EQU   ICTLMOD+14                                               02389000
ICTTIND1 EQU   ICTLFLG3                                                 02390000
ICTTIND2 EQU   ICTLFLG3                                                 02391000
ICTTG1   EQU   ICTLMOD+15                                               02392000
ICTTG2   EQU   ICTLMOD+23                                               02393000
ICTLCHN  EQU   ICTLMOD+34                                               02394000
ICTIXLF  EQU   0                                                        02395000
HMASMPRL EQU   0                                                        02396000
PRLRLEN  EQU   HMASMPRL                                                 02397000
PRLSPAN  EQU   HMASMPRL+2                                               02398000
PRLFLGS  EQU   PRLSPAN                                                  02399000
PRLDATE  EQU   HMASMPRL+4                                               02400000
PRLTIME  EQU   HMASMPRL+7                                               02401000
PRLEND   EQU   HMASMPRL+10                                              02402000
RVAPARM  EQU   0                                                        02403000
RVAINFO  EQU   RVAPARM                                                  02404000
RVAPASS  EQU   RVAPARM+12                                               02405000
RVASTAE  EQU   RVAPARM+20                                               02406000
RVAEPRNM EQU   RVASTAE+4                                                02407000
@NM00230 EQU   RVASTAE+16                                               02408000
@NM00231 EQU   RVASTAE+20                                               02409000
RVAFLAGS EQU   RVASTAE+24                                               02410000
SCANRETN EQU   0                                                        02411000
SCANRCD  EQU   0                                                        02412000
BUFFER   EQU   0                                                        02413000
CCADSIDA EQU   0                                                        02414000
CCATYPEA EQU   0                                                        02415000
IOPBS01  EQU   0                                                        02416000
IOPBS03  EQU   0                                                        02417000
SCPIOPRM EQU   0                                                        02418000
SCPSTRNG EQU   0                                                        02419000
IOPUDATA EQU   IOPEND                                                   02420000
IOPINAM3 EQU   IOPINAME                                                 02421000
@NM00050 EQU   IOPINAM3                                                 02422000
IOPSTCMP EQU   IOPUDATA                                                 02423000
IOPDYNDT EQU   IOPUDATA                                                 02424000
IOPSPACE EQU   IOPDYNDT+44                                              02425000
IOPDTYPE EQU   IOPDYNDT+50                                              02426000
IOPNTMAX EQU   IOPDRMAP                                                 02427000
IOPNTMAP EQU   IOPDRMAP                                                 02428000
IOPCDMAP EQU   IOPNTMAP                                                 02429000
IOPPTMAP EQU   IOPCDMAP                                                 02430000
IOPSCMAP EQU   IOPPTMAP                                                 02431000
IOPDIRCT EQU   IOPSCMAP+12                                              02432000
IOPCDMAX EQU   IOPDIRCT                                                 02433000
IOPCQMAP EQU   IOPDRMAP                                                 02434000
@NM00061 EQU   IOPUDATA                                                 02435000
@NM00062 EQU   IOPUDATA                                                 02436000
IOPASMNT EQU   IOPUDATA                                                 02437000
IOPASMDR EQU   IOPASMNT                                                 02438000
IOPABUNT EQU   IOPASMDR+1                                               02439000
IOPLMDNT EQU   IOPUDATA                                                 02440000
IOPLMDDR EQU   IOPLMDNT                                                 02441000
IOPLMLEP EQU   IOPLMDDR+1                                               02442000
IOPLMDF1 EQU   IOPLMLEP                                                 02443000
IOPFLGS2 EQU   IOPLMDF1                                                 02444000
IOPLMDF2 EQU   IOPLMLEP+1                                               02445000
IOPLMDF3 EQU   IOPLMLEP+2                                               02446000
IOPLMDF4 EQU   IOPLMLEP+3                                               02447000
IOPLMDF5 EQU   IOPLMDDR+5                                               02448000
IOPFLGS3 EQU   IOPLMDF5                                                 02449000
IOPLMDFX EQU   IOPLMDNT+24                                              02450000
@NM00071 EQU   IOPLMDFX                                                 02451000
IOPLNTRY EQU   IOPLMDFX+8                                               02452000
IOPLSYS  EQU   IOPLNTRY                                                 02453000
IOPSYSLB EQU   IOPLSYS                                                  02454000
IOPMACNT EQU   IOPUDATA                                                 02455000
IOPMACDR EQU   IOPMACNT                                                 02456000
IOPRMIDE EQU   IOPMACDR+1                                               02457000
IOPRMST  EQU   IOPRMIDE+7                                               02458000
IOPFMIDE EQU   IOPMACDR+9                                               02459000
IOPMACFX EQU   IOPMACNT+24                                              02460000
IOPBUNT  EQU   IOPMACFX                                                 02461000
IOPMCEND EQU   IOPMACNT+104                                             02462000
IOPMACVR EQU   IOPMCEND                                                 02463000
IOPMCENT EQU   IOPMACVR                                                 02464000
IOPMCDTA EQU   IOPMCENT                                                 02465000
IOPMCASM EQU   IOPMCDTA                                                 02466000
IOPMACID EQU   IOPMCASM                                                 02467000
IOPMACST EQU   IOPMCASM+7                                               02468000
IOPMCIND EQU   IOPMCENT+8                                               02469000
IOPEOFNT EQU   IOPUDATA                                                 02470000
IOPSRCNT EQU   IOPUDATA                                                 02471000
IOPSRCDR EQU   IOPSRCNT                                                 02472000
@NM00082 EQU   IOPSRCDR+1                                               02473000
@NM00084 EQU   @NM00082+7                                               02474000
@NM00088 EQU   IOPSRCDR+9                                               02475000
IOPSRCFX EQU   IOPSRCNT+24                                              02476000
@NM00092 EQU   IOPSRCFX                                                 02477000
IOPSREND EQU   IOPSRCNT+104                                             02478000
IOPSRCVR EQU   IOPSREND                                                 02479000
IOPSNTRY EQU   IOPSRCVR                                                 02480000
IOPSRDTA EQU   IOPSNTRY                                                 02481000
IOPSRCID EQU   IOPSRDTA                                                 02482000
IOPSRCST EQU   IOPSRDTA+7                                               02483000
IOPMODNT EQU   IOPUDATA                                                 02484000
IOPMODDR EQU   IOPMODNT                                                 02485000
@NM00098 EQU   IOPMODDR+1                                               02486000
@NM00100 EQU   @NM00098+7                                               02487000
@NM00104 EQU   IOPMODDR+9                                               02488000
IOPMODFX EQU   IOPMODNT+24                                              02489000
@NM00108 EQU   IOPMODFX                                                 02490000
IOPMDLEP EQU   IOPMODFX+8                                               02491000
IOPMODF1 EQU   IOPMDLEP                                                 02492000
IOPMODF2 EQU   IOPMDLEP+1                                               02493000
IOPMODF3 EQU   IOPMDLEP+2                                               02494000
IOPMODF4 EQU   IOPMDLEP+3                                               02495000
IOPMDEND EQU   IOPMODNT+104                                             02496000
IOPMODVR EQU   IOPMDEND                                                 02497000
IOPMNTRY EQU   IOPMODVR                                                 02498000
IOPMDDTA EQU   IOPMNTRY                                                 02499000
IOPLMODS EQU   IOPMDDTA                                                 02500000
IOPMODID EQU   IOPLMODS                                                 02501000
IOPMODST EQU   IOPLMODS+7                                               02502000
IOPDLBNT EQU   IOPUDATA                                                 02503000
IOPDLBDR EQU   IOPDLBNT                                                 02504000
IOPDLBFX EQU   IOPDLBNT+24                                              02505000
@NM00119 EQU   IOPDLBFX                                                 02506000
IOPDLEND EQU   IOPDLBNT+104                                             02507000
IOPDLBVR EQU   IOPDLEND                                                 02508000
IOPDNTRY EQU   IOPDLBVR                                                 02509000
IOPDSYS  EQU   IOPDNTRY                                                 02510000
IOPSYSNT EQU   IOPUDATA                                                 02511000
IOPSYSDR EQU   IOPSYSNT                                                 02512000
IOPSYSF1 EQU   IOPSYSDR+4                                               02513000
IOPFLGS7 EQU   IOPSYSF1                                                 02514000
IOPSYSFX EQU   IOPSYSNT+24                                              02515000
@NM00126 EQU   IOPSYSFX                                                 02516000
IOPSYEND EQU   IOPSYSNT+184                                             02517000
IOPSYSVR EQU   IOPSYEND                                                 02518000
IOPSYSTR EQU   IOPSYSVR                                                 02519000
IOPSYNTR EQU   IOPSYSTR                                                 02520000
IOPPTFNT EQU   IOPUDATA                                                 02521000
IOPPTFDR EQU   IOPPTFNT                                                 02522000
IOPPSTAT EQU   IOPPTFDR+2                                               02523000
IOPPTFF1 EQU   IOPPSTAT                                                 02524000
IOPFLGS5 EQU   IOPPTFF1                                                 02525000
IOPPTFF2 EQU   IOPPSTAT+1                                               02526000
IOPPTFF3 EQU   IOPPSTAT+3                                               02527000
IOPPTFFX EQU   IOPPTFNT+24                                              02528000
@NM00135 EQU   IOPPTFFX                                                 02529000
@NM00136 EQU   @NM00135                                                 02530000
IOPPDTES EQU   IOPPTFFX+41                                              02531000
@NM00139 EQU   IOPPDTES                                                 02532000
IOPPTPFX EQU   IOPPDTES+6                                               02533000
IOPDATES EQU   IOPPTPFX                                                 02534000
IOPPTEND EQU   IOPPTFNT+104                                             02535000
IOPPTFVR EQU   IOPPTEND                                                 02536000
IOPPNTRY EQU   IOPPTFVR                                                 02537000
IOPPMODS EQU   IOPPNTRY                                                 02538000
IOPENTNT EQU   IOPUDATA+104                                             02539000
IOPSRLNT EQU   IOPUDATA+104                                             02540000
IOPPRENT EQU   IOPUDATA+104                                             02541000
IOPNPRNT EQU   IOPUDATA+104                                             02542000
IOPSUPNT EQU   IOPUDATA+104                                             02543000
IOPREQNT EQU   IOPUDATA+104                                             02544000
IOPIRQNT EQU   IOPUDATA+104                                             02545000
IOPFIDNT EQU   IOPUDATA+104                                             02546000
IOPDELNT EQU   IOPUDATA+104                                             02547000
IOPVERNT EQU   IOPUDATA+104                                             02548000
IOPSBYNT EQU   IOPUDATA+104                                             02549000
IOPQSMNT EQU   IOPUDATA                                                 02550000
IOPQSMDR EQU   IOPQSMNT                                                 02551000
IOPQFMNT EQU   IOPUDATA                                                 02552000
IOPQFMDR EQU   IOPQFMNT                                                 02553000
IOPQFEND EQU   IOPQFMNT+2                                               02554000
IOPQFMVR EQU   IOPQFEND                                                 02555000
IOPQFMLS EQU   IOPQFMVR                                                 02556000
IOPQFMNM EQU   IOPQFMLS                                                 02557000
IOPPTSYS EQU   IOPUDATA                                                 02558000
IOPPTSDR EQU   IOPPTSYS                                                 02559000
IOPPTSFX EQU   IOPPTSYS+24                                              02560000
IOPDSSPC EQU   IOPPTSFX                                                 02561000
IOPPTFG1 EQU   IOPPTSFX+34                                              02562000
IOPPSEND EQU   IOPPTSYS+1064                                            02563000
IOPPTSVR EQU   IOPPSEND                                                 02564000
IOPPTNTR EQU   IOPPTSVR                                                 02565000
@NM00164 EQU   IOPPTNTR                                                 02566000
IOPPTFMD EQU   @NM00164                                                 02567000
IOPPTREL EQU   IOPPTFMD                                                 02568000
IOPBPDS  EQU   IOPUDATA                                                 02569000
IOPBLEP1 EQU   IOPBPDS+8                                                02570000
IOPBLEP2 EQU   IOPBPDS+9                                                02571000
@NM00168 EQU   IOPBPDS+18                                               02572000
IOPBFTB0 EQU   @NM00168                                                 02573000
IOPBFTB1 EQU   IOPBFTB0                                                 02574000
ICTENDNT EQU   ICTENDCH                                                 02575000
ICTENDIX EQU   ICTENDCH                                                 02576000
PRLDATA  EQU   PRLEND                                                   02577000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02578000
IOPBCEND EQU   IOPBPDS+21                                               02579000
IOPBFTB3 EQU   IOPBFTB0+2                                               02580000
IOPBFTB2 EQU   IOPBFTB0+1                                               02581000
@NM00170 EQU   IOPBFTB1                                                 02582000
IOPBAPFP EQU   IOPBFTB1                                                 02583000
IOPBSSI  EQU   IOPBFTB1                                                 02584000
IOPBPAGA EQU   IOPBFTB1                                                 02585000
@NM00169 EQU   IOPBFTB1                                                 02586000
IOPBAOSL EQU   IOPBFTB1                                                 02587000
IOPBSEPA EQU   IOPBPDS+15                                               02588000
IOPBFTBL EQU   IOPBPDS+13                                               02589000
IOPBSTOR EQU   IOPBPDS+10                                               02590000
IOPBREFR EQU   IOPBLEP2                                                 02591000
IOPBLEF  EQU   IOPBLEP2                                                 02592000
IOPBTEST EQU   IOPBLEP2                                                 02593000
IOPBNE   EQU   IOPBLEP2                                                 02594000
@NM00167 EQU   IOPBLEP2                                                 02595000
IOPBDC   EQU   IOPBLEP2                                                 02596000
@NM00166 EQU   IOPBLEP1                                                 02597000
IOPBSCTR EQU   IOPBLEP1                                                 02598000
IOPBOL   EQU   IOPBLEP1                                                 02599000
@NM00165 EQU   IOPBLEP1                                                 02600000
IOPBOVLY EQU   IOPBLEP1                                                 02601000
IOPBREUS EQU   IOPBLEP1                                                 02602000
IOPBRENT EQU   IOPBLEP1                                                 02603000
IOPBNL   EQU   IOPBPDS+7                                                02604000
IOPBTTRN EQU   IOPBPDS+4                                                02605000
IOPBZERO EQU   IOPBPDS+3                                                02606000
IOPBTTRT EQU   IOPBPDS                                                  02607000
IOPPTIND EQU   IOPPTNTR+8                                               02608000
IOPPTSND EQU   IOPPTREL                                                 02609000
@NM00163 EQU   IOPPTSFX+872                                             02610000
IOPSYZPP EQU   IOPPTSFX+772                                             02611000
IOPSYZPR EQU   IOPPTSFX+771                                             02612000
IOPSYZPS EQU   IOPPTSFX+763                                             02613000
IOPSYZAP EQU   IOPPTSFX+755                                             02614000
IOPSYUPP EQU   IOPPTSFX+655                                             02615000
IOPSYUPR EQU   IOPPTSFX+654                                             02616000
IOPSYUPS EQU   IOPPTSFX+646                                             02617000
IOPSYUPD EQU   IOPPTSFX+638                                             02618000
IOPSYSPP EQU   IOPPTSFX+538                                             02619000
IOPSYSPR EQU   IOPPTSFX+537                                             02620000
IOPSYSPS EQU   IOPPTSFX+529                                             02621000
IOPSYSUP EQU   IOPPTSFX+521                                             02622000
IOPSYLKP EQU   IOPPTSFX+421                                             02623000
IOPSYLKR EQU   IOPPTSFX+420                                             02624000
IOPSYLKS EQU   IOPPTSFX+412                                             02625000
IOPSYLKD EQU   IOPPTSFX+404                                             02626000
IOPSYCPP EQU   IOPPTSFX+304                                             02627000
IOPSYCPR EQU   IOPPTSFX+303                                             02628000
IOPSYCPS EQU   IOPPTSFX+295                                             02629000
IOPSYCPY EQU   IOPPTSFX+287                                             02630000
IOPSYCOP EQU   IOPPTSFX+187                                             02631000
IOPSYCOR EQU   IOPPTSFX+186                                             02632000
IOPSYCOS EQU   IOPPTSFX+178                                             02633000
IOPSYCOM EQU   IOPPTSFX+170                                             02634000
IOPSYASP EQU   IOPPTSFX+70                                              02635000
IOPSYASR EQU   IOPPTSFX+69                                              02636000
IOPSYASS EQU   IOPPTSFX+61                                              02637000
IOPSYASM EQU   IOPPTSFX+53                                              02638000
@NM00162 EQU   IOPPTSFX+35                                              02639000
@NM00161 EQU   IOPPTFG1                                                 02640000
IOPPTSNJ EQU   IOPPTFG1                                                 02641000
IOPPTSNP EQU   IOPPTFG1                                                 02642000
IOPSYPLN EQU   IOPPTSFX+32                                              02643000
IOPDSPFX EQU   IOPPTSFX+6                                               02644000
IOPDSDIR EQU   IOPDSSPC+4                                               02645000
IOPDSSEC EQU   IOPDSSPC+2                                               02646000
IOPDSPRM EQU   IOPDSSPC                                                 02647000
@NM00160 EQU   IOPPTSDR+4                                               02648000
IOPPTPEM EQU   IOPPTSDR+2                                               02649000
IOPPCNVL EQU   IOPPTSDR+1                                               02650000
@NM00159 EQU   IOPPTSDR                                                 02651000
IOPQFMTP EQU   IOPQFMLS+8                                               02652000
@NM00158 EQU   IOPQFMLS+7                                               02653000
IOPQFMND EQU   IOPQFMNM                                                 02654000
@NM00157 EQU   IOPQFMDR                                                 02655000
@NM00153 EQU   IOPQSMDR                                                 02656000
@NM00152 EQU   IOPSBYNT+8                                               02657000
IOPSBYST EQU   IOPSBYNT+7                                               02658000
IOPSBYNM EQU   IOPSBYNT                                                 02659000
@NM00151 EQU   IOPVERNT+8                                               02660000
IOPVERST EQU   IOPVERNT+7                                               02661000
IOPVERNM EQU   IOPVERNT                                                 02662000
@NM00150 EQU   IOPDELNT+8                                               02663000
IOPDELST EQU   IOPDELNT+7                                               02664000
IOPDELNM EQU   IOPDELNT                                                 02665000
@NM00149 EQU   IOPFIDNT+8                                               02666000
IOPFIDST EQU   IOPFIDNT+7                                               02667000
IOPFIDNM EQU   IOPFIDNT                                                 02668000
@NM00148 EQU   IOPIRQNT+8                                               02669000
IOPIRQST EQU   IOPIRQNT+7                                               02670000
IOPIRQNM EQU   IOPIRQNT                                                 02671000
@NM00147 EQU   IOPREQNT+8                                               02672000
IOPREQST EQU   IOPREQNT+7                                               02673000
IOPREQNM EQU   IOPREQNT                                                 02674000
@NM00146 EQU   IOPSUPNT+8                                               02675000
IOPSUPST EQU   IOPSUPNT+7                                               02676000
IOPSUPNM EQU   IOPSUPNT                                                 02677000
@NM00145 EQU   IOPNPRNT+8                                               02678000
IOPNPRST EQU   IOPNPRNT+7                                               02679000
IOPNPRNM EQU   IOPNPRNT                                                 02680000
@NM00144 EQU   IOPPRENT+8                                               02681000
IOPPREST EQU   IOPPRENT+7                                               02682000
IOPPRENM EQU   IOPPRENT                                                 02683000
@NM00143 EQU   IOPSRLNT+8                                               02684000
IOPSRLST EQU   IOPSRLNT+7                                               02685000
@NM00142 EQU   IOPSRLNT+4                                               02686000
IOPSRLNM EQU   IOPSRLNT                                                 02687000
@NM00141 EQU   IOPENTNT+8                                               02688000
IOPENTST EQU   IOPENTNT+7                                               02689000
IOPENTNM EQU   IOPENTNT                                                 02690000
IOPPIND  EQU   IOPPNTRY+8                                               02691000
IOPPTFND EQU   IOPPMODS                                                 02692000
IOPPFMID EQU   IOPPTFFX+73                                              02693000
@NM00140 EQU   IOPPTPFX+24                                              02694000
IOPUCLT  EQU   IOPDATES+21                                              02695000
IOPUCLD  EQU   IOPDATES+18                                              02696000
IOPACCT  EQU   IOPDATES+15                                              02697000
IOPACCD  EQU   IOPDATES+12                                              02698000
IOPRSTT  EQU   IOPDATES+9                                               02699000
IOPRSTD  EQU   IOPDATES+6                                               02700000
IOPAPPT  EQU   IOPDATES+3                                               02701000
IOPAPPD  EQU   IOPDATES                                                 02702000
IOPRECT  EQU   @NM00139+3                                               02703000
IOPRECD  EQU   @NM00139                                                 02704000
@NM00138 EQU   IOPPTFFX+8                                               02705000
@NM00137 EQU   @NM00135+7                                               02706000
IOPPRELN EQU   @NM00136                                                 02707000
@NM00134 EQU   IOPPTFDR+20                                              02708000
IOPSBYNO EQU   IOPPTFDR+13                                              02709000
IOPDBYNO EQU   IOPPTFDR+6                                               02710000
@NM00133 EQU   IOPPTFF3                                                 02711000
IOPFLF   EQU   IOPPTFF3                                                 02712000
IOPDBYP  EQU   IOPPTFF3                                                 02713000
IOPSBYP  EQU   IOPPTFF3                                                 02714000
IOPPMDLP EQU   IOPPTFF2+1                                               02715000
IOPPADDP EQU   IOPPTFF2+1                                               02716000
@NM00132 EQU   IOPPTFF2+1                                               02717000
IOPLRFP  EQU   IOPPTFF2                                                 02718000
IOPJCLP  EQU   IOPPTFF2                                                 02719000
IOPSUPP  EQU   IOPPTFF2                                                 02720000
IOPREQP  EQU   IOPPTFF2                                                 02721000
IOPPREP  EQU   IOPPTFF2                                                 02722000
IOPNPRP  EQU   IOPPTFF2                                                 02723000
IOPIRQP  EQU   IOPPTFF2                                                 02724000
IOPDELP  EQU   IOPPTFF2                                                 02725000
IOPREGEN EQU   IOPFLGS5                                                 02726000
IOPBYP   EQU   IOPFLGS5                                                 02727000
IOPDUMMP EQU   IOPFLGS5                                                 02728000
@NM00131 EQU   IOPFLGS5                                                 02729000
IOPERROR EQU   IOPFLGS5                                                 02730000
IOPACC   EQU   IOPFLGS5                                                 02731000
IOPRES   EQU   IOPFLGS5                                                 02732000
IOPAPP   EQU   IOPFLGS5                                                 02733000
IOPPTYPE EQU   IOPPTFDR+1                                               02734000
@NM00130 EQU   IOPPTFDR                                                 02735000
IOPSYSTP EQU   IOPSYSTR+8                                               02736000
IOPSYSND EQU   IOPSYNTR                                                 02737000
@NM00129 EQU   IOPSYSFX+21                                              02738000
IOPSYSID EQU   IOPSYSFX+13                                              02739000
IOPNUCID EQU   IOPSYSFX+12                                              02740000
IOPSREL  EQU   IOPSYSFX+8                                               02741000
@NM00128 EQU   @NM00126+7                                               02742000
@NM00127 EQU   @NM00126                                                 02743000
@NM00125 EQU   IOPSYSDR+5                                               02744000
@NM00124 EQU   IOPFLGS7                                                 02745000
IOPSYNG  EQU   IOPFLGS7                                                 02746000
IOPSYDL  EQU   IOPFLGS7                                                 02747000
IOPSTSNP EQU   IOPFLGS7                                                 02748000
IOPMTSNP EQU   IOPFLGS7                                                 02749000
IOPPEMAX EQU   IOPSYSDR+2                                               02750000
IOPSCNVL EQU   IOPSYSDR+1                                               02751000
@NM00123 EQU   IOPSYSDR                                                 02752000
IOPDLIND EQU   IOPDNTRY+8                                               02753000
IOPDLBND EQU   IOPDSYS                                                  02754000
@NM00122 EQU   IOPDLBFX+8                                               02755000
@NM00121 EQU   @NM00119+7                                               02756000
@NM00120 EQU   @NM00119                                                 02757000
@NM00118 EQU   IOPDLBDR+1                                               02758000
@NM00117 EQU   IOPDLBDR                                                 02759000
IOPMDIND EQU   IOPMNTRY+8                                               02760000
@NM00116 EQU   IOPMODST                                                 02761000
IOPMODND EQU   IOPMODID                                                 02762000
IOPDLIB  EQU   IOPMODFX+72                                              02763000
@NM00115 EQU   IOPMODFX+12                                              02764000
@NM00114 EQU   IOPMODF4                                                 02765000
@NM00113 EQU   IOPMODF3                                                 02766000
@NM00112 EQU   IOPMODF2                                                 02767000
IOPMPAGA EQU   IOPMODF2                                                 02768000
IOPMNE   EQU   IOPMODF2                                                 02769000
@NM00111 EQU   IOPMODF1                                                 02770000
IOPMDC   EQU   IOPMODF1                                                 02771000
IOPMREFR EQU   IOPMODF1                                                 02772000
IOPMOVLY EQU   IOPMODF1                                                 02773000
IOPMSCTR EQU   IOPMODF1                                                 02774000
IOPMREUS EQU   IOPMODF1                                                 02775000
IOPMRENT EQU   IOPMODF1                                                 02776000
IOPMAPF  EQU   IOPMODF1                                                 02777000
@NM00110 EQU   @NM00108+7                                               02778000
@NM00109 EQU   @NM00108                                                 02779000
@NM00107 EQU   IOPMODDR+17                                              02780000
@NM00106 EQU   @NM00104+7                                               02781000
@NM00105 EQU   @NM00104                                                 02782000
@NM00103 EQU   @NM00100                                                 02783000
@NM00102 EQU   @NM00100                                                 02784000
@NM00101 EQU   @NM00100                                                 02785000
@NM00099 EQU   @NM00098                                                 02786000
@NM00097 EQU   IOPMODDR                                                 02787000
IOPSRIND EQU   IOPSNTRY+8                                               02788000
@NM00096 EQU   IOPSRCST                                                 02789000
IOPSRCND EQU   IOPSRCID                                                 02790000
IOPSRDLB EQU   IOPSRCFX+72                                              02791000
IOPSRSYS EQU   IOPSRCFX+64                                              02792000
@NM00095 EQU   IOPSRCFX+8                                               02793000
@NM00094 EQU   @NM00092+7                                               02794000
@NM00093 EQU   @NM00092                                                 02795000
@NM00091 EQU   IOPSRCDR+18                                              02796000
IOPSRLNG EQU   IOPSRCDR+17                                              02797000
@NM00090 EQU   @NM00088+7                                               02798000
@NM00089 EQU   @NM00088                                                 02799000
@NM00087 EQU   @NM00084                                                 02800000
@NM00086 EQU   @NM00084                                                 02801000
@NM00085 EQU   @NM00084                                                 02802000
@NM00083 EQU   @NM00082                                                 02803000
@NM00081 EQU   IOPSRCDR                                                 02804000
IOPEOFND EQU   IOPEOFNT                                                 02805000
IOPMCTYP EQU   IOPMCIND                                                 02806000
@NM00080 EQU   IOPMACST                                                 02807000
IOPMACND EQU   IOPMACID                                                 02808000
IOPMCDLB EQU   IOPMACFX+72                                              02809000
IOPMCSYS EQU   IOPMACFX+64                                              02810000
@NM00079 EQU   IOPMACFX+8                                               02811000
IOPBUTYP EQU   IOPBUNT+7                                                02812000
IOPBUSMD EQU   IOPBUNT                                                  02813000
@NM00078 EQU   IOPMACDR+18                                              02814000
IOPMCLNG EQU   IOPMACDR+17                                              02815000
IOPFMST  EQU   IOPFMIDE+7                                               02816000
IOPFMID  EQU   IOPFMIDE                                                 02817000
@NM00077 EQU   IOPRMST                                                  02818000
IOPRMASM EQU   IOPRMST                                                  02819000
@NM00076 EQU   IOPRMST                                                  02820000
IOPRMID  EQU   IOPRMIDE                                                 02821000
@NM00075 EQU   IOPMACDR                                                 02822000
IOPLMIND EQU   IOPLNTRY+8                                               02823000
IOPLMDND EQU   IOPSYSLB                                                 02824000
@NM00073 EQU   @NM00071+7                                               02825000
@NM00072 EQU   @NM00071                                                 02826000
@NM00070 EQU   IOPLMDDR+6                                               02827000
@NM00069 EQU   IOPFLGS3                                                 02828000
IOPCHREP EQU   IOPFLGS3                                                 02829000
IOPLINK  EQU   IOPFLGS3                                                 02830000
IOPCOPY  EQU   IOPFLGS3                                                 02831000
@NM00068 EQU   IOPLMDF4                                                 02832000
@NM00067 EQU   IOPLMDF3                                                 02833000
@NM00066 EQU   IOPLMDF2                                                 02834000
IOPPAGA  EQU   IOPLMDF2                                                 02835000
IOPNE    EQU   IOPLMDF2                                                 02836000
@NM00065 EQU   IOPFLGS2                                                 02837000
IOPDC    EQU   IOPFLGS2                                                 02838000
IOPREFR  EQU   IOPFLGS2                                                 02839000
IOPOVLY  EQU   IOPFLGS2                                                 02840000
IOPSCTR  EQU   IOPFLGS2                                                 02841000
IOPREUS  EQU   IOPFLGS2                                                 02842000
IOPRENT  EQU   IOPFLGS2                                                 02843000
IOPAPF   EQU   IOPFLGS2                                                 02844000
@NM00064 EQU   IOPLMDDR                                                 02845000
@NM00063 EQU   IOPASMDR+9                                               02846000
IOPABUTP EQU   IOPABUNT+7                                               02847000
IOPABUPT EQU   IOPABUNT                                                 02848000
IOPNTLVL EQU   IOPASMDR                                                 02849000
IOPALLOC EQU   @NM00062+4                                               02850000
IOPUSED  EQU   @NM00062                                                 02851000
IOPTPSEQ EQU   @NM00061+8                                               02852000
IOPVLSER EQU   @NM00061+2                                               02853000
IOPBLKSI EQU   @NM00061                                                 02854000
IOPCQMAX EQU   IOPCQMAP+12                                              02855000
@NM00060 EQU   IOPCQMAP+11                                              02856000
@NM00059 EQU   IOPCQMAP+8                                               02857000
@NM00058 EQU   IOPCQMAP                                                 02858000
IOPPTMAX EQU   IOPCDMAX                                                 02859000
@NM00057 EQU   IOPSCMAP+11                                              02860000
@NM00056 EQU   IOPSCMAP+8                                               02861000
@NM00055 EQU   IOPSCMAP                                                 02862000
IOPDIRMX EQU   IOPNTMAX+12                                              02863000
@NM00054 EQU   IOPNTMAX+11                                              02864000
@NM00053 EQU   IOPNTMAX+8                                               02865000
@NM00052 EQU   IOPNTMAX                                                 02866000
@NM00051 EQU   IOPDTYPE                                                 02867000
IOPDMOD  EQU   IOPDTYPE                                                 02868000
IOPDJCL  EQU   IOPDTYPE                                                 02869000
IOPDSRC  EQU   IOPDTYPE                                                 02870000
IOPDMAC  EQU   IOPDTYPE                                                 02871000
IOPSDIR  EQU   IOPSPACE+4                                               02872000
IOPSSCND EQU   IOPSPACE+2                                               02873000
IOPSPRIM EQU   IOPSPACE                                                 02874000
IOPDSN   EQU   IOPDYNDT                                                 02875000
IOPNTYPE EQU   IOPSTCMP+17                                              02876000
IOPNNAME EQU   IOPSTCMP+9                                               02877000
IOPOTYPE EQU   IOPSTCMP+8                                               02878000
IOPONAME EQU   IOPSTCMP                                                 02879000
IOPISEQ3 EQU   IOPINAM3+6                                               02880000
IOPITYP3 EQU   @NM00050+5                                               02881000
IOPIPTF3 EQU   @NM00050                                                 02882000
RVAEND   EQU   RVASTAE+25                                               02883000
@NM00232 EQU   RVAFLAGS                                                 02884000
RVASDWFD EQU   RVAFLAGS                                                 02885000
RVAVS1   EQU   RVAFLAGS                                                 02886000
RVAMVS   EQU   RVAFLAGS                                                 02887000
RVAUSRCH EQU   @NM00231+2                                               02888000
RVASYSCH EQU   @NM00231                                                 02889000
RVAUSRCD EQU   @NM00230+2                                               02890000
RVASYSCD EQU   @NM00230                                                 02891000
RVAABNDC EQU   RVASTAE+12                                               02892000
RVASDWAP EQU   RVASTAE                                                  02893000
RVAREC   EQU   RVAPASS+4                                                02894000
RVATBL   EQU   RVAPASS                                                  02895000
RVAMAJNM EQU   RVAINFO+8                                                02896000
RVACCAP  EQU   RVAINFO+4                                                02897000
RVAHDR   EQU   RVAINFO                                                  02898000
PRLCONC  EQU   PRLTIME+2                                                02899000
@NM00227 EQU   PRLTIME                                                  02900000
PRLHDADR EQU   PRLDATE                                                  02901000
@NM00226 EQU   PRLFLGS                                                  02902000
PRLBLANK EQU   PRLFLGS                                                  02903000
PRLHEADO EQU   PRLFLGS                                                  02904000
PRLHEAD  EQU   PRLFLGS                                                  02905000
ICTIXL   EQU   ICTIXLF                                                  02906000
@NM00224 EQU   ICTLMOD+38                                               02907000
ICTLTTR  EQU   ICTLMOD+31                                               02908000
@NM00223 EQU   ICTLFLG3                                                 02909000
ICTLZAP  EQU   ICTLFLG3                                                 02910000
ICTLLKD  EQU   ICTLFLG3                                                 02911000
ICTLCPY  EQU   ICTLFLG3                                                 02912000
ICTLXPND EQU   ICTLFLG3                                                 02913000
@NM00222 EQU   ICTLFLG2                                                 02914000
ICTLDEL  EQU   ICTLFLG2                                                 02915000
@NM00221 EQU   ICTLFLG2                                                 02916000
ICTLTDEL EQU   ICTLFLG2                                                 02917000
ICTLINK  EQU   ICTLFLG2                                                 02918000
ICTCOPY  EQU   ICTLFLG2                                                 02919000
@NM00220 EQU   ICTLFLG7                                                 02920000
@NM00219 EQU   ICTLFLG6                                                 02921000
@NM00218 EQU   ICTLFLG5                                                 02922000
ICTLPAGA EQU   ICTLFLG5                                                 02923000
ICTLNE   EQU   ICTLFLG5                                                 02924000
@NM00217 EQU   ICTLFLG1                                                 02925000
ICTLDC   EQU   ICTLFLG1                                                 02926000
ICTLREFR EQU   ICTLFLG1                                                 02927000
ICTLOVLY EQU   ICTLFLG1                                                 02928000
ICTLSCTR EQU   ICTLFLG1                                                 02929000
ICTLREUS EQU   ICTLFLG1                                                 02930000
ICTLRENT EQU   ICTLFLG1                                                 02931000
ICTLAPF  EQU   ICTLFLG1                                                 02932000
@NM00216 EQU   ICTLFLG4                                                 02933000
ICTLPASS EQU   ICTLFLG4                                                 02934000
ICTLDDCK EQU   ICTLFLG4                                                 02935000
ICTLMSG  EQU   ICTLFLG4                                                 02936000
ICTLCPL  EQU   ICTLFLG4                                                 02937000
ICTLNOGO EQU   ICTLFLG4                                                 02938000
ICTLPROC EQU   ICTLFLG4                                                 02939000
ICTLEND  EQU   ICTLNAME                                                 02940000
@NM00215 EQU   ICTMUMNT+7                                               02941000
ICTMUMND EQU   ICTMUMNM                                                 02942000
@NM00214 EQU   ICTMVRNT+7                                               02943000
ICTMVRND EQU   ICTMVRNM                                                 02944000
ICTTALND EQU   ICTTALNM                                                 02945000
ICTASMND EQU   ICTASMAD                                                 02946000
ICTMIDTY EQU   ICTMODST                                                 02947000
ICTMIDAM EQU   ICTMODST                                                 02948000
ICTMIDRG EQU   ICTMODST                                                 02949000
ICTMIDF1 EQU   ICTMODST                                                 02950000
ICTMIDPL EQU   ICTMODST                                                 02951000
ICTMIDPS EQU   ICTMODST                                                 02952000
@NM00213 EQU   ICTMODST                                                 02953000
ICTMIDND EQU   ICTMODID                                                 02954000
@NM00212 EQU   ICTMOD+128                                               02955000
ICTMICHA EQU   ICTMOD+108                                               02956000
ICTPPTR  EQU   ICTMOD+96                                                02957000
@NM00211 EQU   ICTMOD+95                                                02958000
ICTMFMID EQU   ICTMOD+88                                                02959000
@NM00210 EQU   ICTMOD+87                                                02960000
ICTMRMID EQU   ICTMOD+80                                                02961000
ICTMSSI  EQU   ICTMOD+72                                                02962000
ICTMDOBJ EQU   ICTMOD+64                                                02963000
ICTMSYSL EQU   ICTMOD+56                                                02964000
ICTMDSTL EQU   ICTMOD+48                                                02965000
ICTMASLB EQU   ICTMOD+40                                                02966000
ICTTOLIB EQU   ICTMOD+32                                                02967000
ICTFMLIB EQU   ICTMOD+24                                                02968000
ICTMRELN EQU   ICTMOD+22                                                02969000
@NM00209 EQU   ICTMOD+21                                                02970000
ICTMLANG EQU   ICTMOD+20                                                02971000
@NM00208 EQU   ICTMOD+19                                                02972000
ICTMACF5 EQU   ICTMOD+18                                                02973000
ICTMZMPR EQU   ICTMACF4                                                 02974000
ICTMZOMZ EQU   ICTMACF4                                                 02975000
ICTMDOAS EQU   ICTMACF4                                                 02976000
ICTMXUPD EQU   ICTMACF4                                                 02977000
ICTMFXC  EQU   ICTMACF4                                                 02978000
ICTMFXBS EQU   ICTMACF4                                                 02979000
ICTMHASM EQU   ICTMACF4                                                 02980000
ICTMACDL EQU   ICTMACF4                                                 02981000
@NM00207 EQU   ICTMLEP4                                                 02982000
@NM00206 EQU   ICTMLEP3                                                 02983000
@NM00205 EQU   ICTMLEP2                                                 02984000
ICTMPAGA EQU   ICTMLEP2                                                 02985000
ICTMNE   EQU   ICTMLEP2                                                 02986000
@NM00204 EQU   ICTMLEP1                                                 02987000
ICTMDC   EQU   ICTMLEP1                                                 02988000
ICTMREFR EQU   ICTMLEP1                                                 02989000
ICTMOVLY EQU   ICTMLEP1                                                 02990000
ICTMSCTR EQU   ICTMLEP1                                                 02991000
ICTMREUS EQU   ICTMLEP1                                                 02992000
ICTMRENT EQU   ICTMLEP1                                                 02993000
ICTMAPF  EQU   ICTMLEP1                                                 02994000
@NM00203 EQU   ICTMFLG5                                                 02995000
ICTMNORL EQU   ICTMFLG5                                                 02996000
ICTMELCK EQU   ICTMFLG5                                                 02997000
ICTMCOPY EQU   ICTMFLG5                                                 02998000
ICTMPASS EQU   ICTMFLG5                                                 02999000
@NM00202 EQU   ICTMFLG4                                                 03000000
ICTMTSEL EQU   ICTMFLG4                                                 03001000
ICTMDSTE EQU   ICTMFLG4                                                 03002000
ICTMMIDE EQU   ICTMFLG4                                                 03003000
ICTMASOC EQU   ICTMFLG4                                                 03004000
ICTMSELM EQU   ICTMFLG4                                                 03005000
ICTMIDEL EQU   ICTMFLG4                                                 03006000
@NM00201 EQU   ICTMFLG3                                                 03007000
ICTMPRMS EQU   ICTMFLG3                                                 03008000
ICTMALIS EQU   ICTMFLG3                                                 03009000
ICTMWRK  EQU   ICTMFLG3                                                 03010000
ICTMTRX  EQU   ICTMFLG3                                                 03011000
ICTMRELF EQU   ICTMFLG3                                                 03012000
ICTLIBTX EQU   ICTMFLG3                                                 03013000
ICTLIBLK EQU   ICTMFLG3                                                 03014000
ICTMSRCU EQU   ICTMFLG1                                                 03015000
ICTMSRCR EQU   ICTMFLG1                                                 03016000
ICTMMACU EQU   ICTMFLG1                                                 03017000
ICTMMACR EQU   ICTMFLG1                                                 03018000
ICTMXPND EQU   ICTMFLG1                                                 03019000
ICTMASM  EQU   ICTMMODR                                                 03020000
ICTMMOD  EQU   ICTMMODR                                                 03021000
@NM00200 EQU   ICTMFLG2                                                 03022000
@NM00199 EQU   ICTMFLG2                                                 03023000
ICTMMIDU EQU   ICTMFLG2                                                 03024000
ICTMDEL  EQU   ICTMFLG2                                                 03025000
ICTMMSG  EQU   ICTMFLG2                                                 03026000
ICTMNOGO EQU   ICTMFLG2                                                 03027000
ICTMEND  EQU   ICTMNAME                                                 03028000
@NM00198 EQU   ICTSBYNT+7                                               03029000
ICTSBYND EQU   ICTSBYNM                                                 03030000
ICTDELEX EQU   ICTDELST                                                 03031000
ICTDELND EQU   ICTDELNM                                                 03032000
@NM00197 EQU   ICTVRSNT+7                                               03033000
ICTVRSND EQU   ICTVRSNM                                                 03034000
@NM00196 EQU   ICTNPRNT+7                                               03035000
ICTNPRND EQU   ICTNPRNM                                                 03036000
@NM00195 EQU   ICTCSRST                                                 03037000
@NM00194 EQU   ICTCSRST                                                 03038000
ICTCSRF  EQU   ICTCSRST                                                 03039000
@NM00193 EQU   ICTCSRST                                                 03040000
ICTCSRNM EQU   ICTIRQNT+8                                               03041000
@NM00192 EQU   ICTIRQST                                                 03042000
ICTIREQT EQU   ICTIRQST                                                 03043000
ICTIREQI EQU   ICTIRQST                                                 03044000
ICTIREQB EQU   ICTIRQST                                                 03045000
ICTIREQS EQU   ICTIRQST                                                 03046000
@NM00191 EQU   ICTIRQST                                                 03047000
ICTIRQND EQU   ICTIRQNM                                                 03048000
@NM00190 EQU   ICTPREST                                                 03049000
ICTPREQT EQU   ICTPREST                                                 03050000
ICTPREQI EQU   ICTPREST                                                 03051000
ICTPREQB EQU   ICTPREST                                                 03052000
ICTPREQS EQU   ICTPREST                                                 03053000
@NM00189 EQU   ICTPREST                                                 03054000
ICTPREND EQU   ICTPRENM                                                 03055000
@NM00188 EQU   ICTSUPNT+7                                               03056000
ICTSUPND EQU   ICTSUPNM                                                 03057000
@NM00187 EQU   ICTREQST                                                 03058000
ICTRREQT EQU   ICTREQST                                                 03059000
ICTRREQI EQU   ICTREQST                                                 03060000
ICTRREQB EQU   ICTREQST                                                 03061000
ICTRREQS EQU   ICTREQST                                                 03062000
@NM00186 EQU   ICTREQST                                                 03063000
ICTREQND EQU   ICTREQNM                                                 03064000
@NM00185 EQU   ICTENTST                                                 03065000
ICTEREQT EQU   ICTENTST                                                 03066000
ICTEREQI EQU   ICTENTST                                                 03067000
ICTEREQB EQU   ICTENTST                                                 03068000
ICTEREQS EQU   ICTENTST                                                 03069000
@NM00184 EQU   ICTENTST                                                 03070000
ICTENTND EQU   ICTENTNM                                                 03071000
@NM00183 EQU   ICTPTF+100                                               03072000
ICTPTPFX EQU   ICTPTF+38                                                03073000
ICTPRELN EQU   ICTPTF+36                                                03074000
ICTPRECT EQU   ICTPTF+33                                                03075000
ICTPRECD EQU   ICTPTF+30                                                03076000
ICTPVERN EQU   ICTPTF+29                                                03077000
ICTPFMID EQU   ICTPTF+22                                                03078000
ICTPSUPN EQU   ICTPTF+20                                                03079000
ICTPONUM EQU   ICTPTF+18                                                03080000
ICTPTYPE EQU   ICTPTF+17                                                03081000
ICTPUSR8 EQU   ICTPFLGA                                                 03082000
ICTPUSR7 EQU   ICTPFLGA                                                 03083000
ICTPUSR6 EQU   ICTPFLGA                                                 03084000
ICTPUSR5 EQU   ICTPFLGA                                                 03085000
ICTPUSR4 EQU   ICTPFLGA                                                 03086000
ICTPUSR3 EQU   ICTPFLGA                                                 03087000
ICTPUSR2 EQU   ICTPFLGA                                                 03088000
ICTPPASS EQU   ICTPUSR1                                                 03089000
@NM00182 EQU   @NM00181                                                 03090000
ICTPRQBY EQU   @NM00181                                                 03091000
ICTPRQOK EQU   @NM00181                                                 03092000
ICTPRQCK EQU   @NM00181                                                 03093000
@NM00180 EQU   ICTPFLG9                                                 03094000
ICTPPDEL EQU   ICTPFLG9                                                 03095000
ICTPWRKO EQU   ICTPFLG9                                                 03096000
ICTPMSL  EQU   ICTPFLG9                                                 03097000
@NM00179 EQU   ICTPFLG8                                                 03098000
ICTPDCPL EQU   ICTPFLG8                                                 03099000
ICTPGCPL EQU   ICTPFLG8                                                 03100000
@NM00178 EQU   ICTPFLG4                                                 03101000
@NM00177 EQU   ICTPFLG4                                                 03102000
@NM00176 EQU   ICTPFLG4                                                 03103000
ICTPGELM EQU   ICTPFLG4                                                 03104000
ICTPDIMP EQU   ICTPFLG4                                                 03105000
ICTPDEXP EQU   ICTPFLG4                                                 03106000
ICTPREDO EQU   ICTPFLG4                                                 03107000
ICTPCDSE EQU   ICTPFLG4                                                 03108000
@NM00175 EQU   ICTPFLG2                                                 03109000
ICTPRCND EQU   ICTPFLG2                                                 03110000
ICTPTPS  EQU   ICTPFLG2                                                 03111000
ICTPTR1  EQU   ICTPFLG2                                                 03112000
ICTPVRSP EQU   ICTPFLG2                                                 03113000
@NM00174 EQU   ICTPFLG6                                                 03114000
ICTFLF   EQU   ICTPFLF                                                  03115000
ICTPDBYP EQU   ICTPFLG6                                                 03116000
ICTPSBYP EQU   ICTPFLG6                                                 03117000
ICTPMDLP EQU   ICTPFLG5+1                                               03118000
ICTPADDP EQU   ICTPFLG5+1                                               03119000
@NM00173 EQU   ICTPFLG5+1                                               03120000
ICTPLRFP EQU   ICTPFLG5                                                 03121000
ICTPJCLP EQU   ICTPFLG5                                                 03122000
ICTPSUPP EQU   ICTPFLG5                                                 03123000
ICTPREQP EQU   ICTPFLG5                                                 03124000
ICTPPREP EQU   ICTPFLG5                                                 03125000
ICTPNPRP EQU   ICTPFLG5                                                 03126000
ICTPIRQP EQU   ICTPFLG5                                                 03127000
ICTPDELP EQU   ICTPFLG5                                                 03128000
@NM00172 EQU   ICTPFLG3                                                 03129000
ICTPSLST EQU   ICTPFLG3                                                 03130000
ICTPNOLB EQU   ICTPFLG3                                                 03131000
ICTPMSG  EQU   ICTPFLG3                                                 03132000
ICTPCPL  EQU   ICTPFLG3                                                 03133000
ICTREGEN EQU   ICTPFLG1                                                 03134000
ICTBYP   EQU   ICTPFLG1                                                 03135000
ICTDUMMP EQU   ICTPFLG1                                                 03136000
@NM00171 EQU   ICTPFLG1                                                 03137000
ICTERROR EQU   ICTPFLG1                                                 03138000
ICTACC   EQU   ICTPFLG1                                                 03139000
ICTRES   EQU   ICTPFLG1                                                 03140000
ICTAPP   EQU   ICTPFLG1                                                 03141000
ICTLEN   EQU   ICTGMSPL+1                                               03142000
ICTSP    EQU   ICTGMSPL                                                 03143000
ICTLLEN  EQU   ICTLSPLN+1                                               03144000
ICTLSP   EQU   ICTLSPLN                                                 03145000
ICTMLEN  EQU   ICTMSPLN+1                                               03146000
ICTMSP   EQU   ICTMSPLN                                                 03147000
ICTPLEN  EQU   ICTPSPLN+1                                               03148000
ICTPSP   EQU   ICTPSPLN                                                 03149000
IOPBS04E EQU   IOPBS04+2                                                03150000
IOPBAPFC EQU   IOPBAPF+1                                                03151000
IOPBAPFL EQU   IOPBAPF                                                  03152000
IOPBS2NM EQU   IOPBS02+3                                                03153000
IOPBS2EP EQU   IOPBS02                                                  03154000
IOPQSMTP EQU   IOPQSMLS+8                                               03155000
@NM00156 EQU   IOPQSMLS+7                                               03156000
IOPQSMND EQU   IOPQSMNM                                                 03157000
@NM00155 EQU   @NM00154+7                                               03158000
IOPQSMFM EQU   @NM00154                                                 03159000
@NM00074 EQU   IOPLMCTL+17                                              03160000
IOPLMCRD EQU   IOPLMCTL+9                                               03161000
IOPLMCRN EQU   IOPLMCTL+1                                               03162000
IOPLMCC  EQU   IOPLMCTL                                                 03163000
@NM00049 EQU   IOPUSERL                                                 03164000
@NM00048 EQU   IOPUSERL                                                 03165000
IOPALIS  EQU   IOPUSERL                                                 03166000
IOPTTR   EQU   IOPDRMAP+8                                               03167000
IOPINAM2 EQU   IOPINAM+1                                                03168000
IOPITYP2 EQU   IOPITYP                                                  03169000
@NM00047 EQU   HMASMIOP+32                                              03170000
IOPDELDD EQU   IOPDDNAM                                                 03171000
@NM00046 EQU   @NM00043+10                                              03172000
IOPSEQNO EQU   @NM00043+8                                               03173000
@NM00045 EQU   @NM00044+7                                               03174000
IOPPTFNM EQU   @NM00044                                                 03175000
IOPNAM17 EQU   IOPNAME                                                  03176000
CCABMREC EQU   CCABELMT+10                                              03177000
CCABPOS  EQU   CCABMPOS+8                                               03178000
CCABNAME EQU   CCABMPOS                                                 03179000
@NM00042 EQU   CCABLDLM+2                                               03180000
@NM00041 EQU   CCABLDLM                                                 03181000
CCAUPDPM EQU   @NM00039+24                                              03182000
@NM00040 EQU   @NM00039+21                                              03183000
CCARUPDT EQU   CCAUPDRC                                                 03184000
CCAUPDSP EQU   @NM00039+12                                              03185000
CCAUPDTE EQU   @NM00039+8                                               03186000
CCAUPDNM EQU   @NM00039                                                 03187000
CCASUPPM EQU   @NM00037+24                                              03188000
@NM00038 EQU   @NM00037+21                                              03189000
CCARSUP  EQU   CCASUPRC                                                 03190000
CCASUPSP EQU   @NM00037+12                                              03191000
CCAIOSUP EQU   @NM00037+8                                               03192000
CCASUPNM EQU   @NM00037                                                 03193000
@NM00036 EQU   @NM00035+21                                              03194000
CCACOMPM EQU   @NM00033+24                                              03195000
@NM00034 EQU   @NM00033+21                                              03196000
CCARCOMP EQU   CCACOMRC                                                 03197000
CCACOMSP EQU   @NM00033+12                                              03198000
CCACOMRS EQU   @NM00033+8                                               03199000
CCACOMNM EQU   @NM00033                                                 03200000
CCACPYPM EQU   @NM00031+24                                              03201000
@NM00032 EQU   @NM00031+21                                              03202000
CCARCOPY EQU   CCACPYRC                                                 03203000
CCACPYSP EQU   @NM00031+12                                              03204000
CCACOPY  EQU   @NM00031+8                                               03205000
CCACPYNM EQU   @NM00031                                                 03206000
CCAASMPM EQU   @NM00029+24                                              03207000
@NM00030 EQU   @NM00029+21                                              03208000
CCARASM  EQU   CCAASMRC                                                 03209000
CCAASMSP EQU   @NM00029+12                                              03210000
CCAASM   EQU   @NM00029+8                                               03211000
CCAASMNM EQU   @NM00029                                                 03212000
CCALKDPM EQU   @NM00027+24                                              03213000
@NM00028 EQU   @NM00027+21                                              03214000
CCARLINK EQU   CCALKDRC                                                 03215000
CCALKDSP EQU   @NM00027+12                                              03216000
CCALKED  EQU   @NM00027+8                                               03217000
CCALKDNM EQU   @NM00027                                                 03218000
CCAPGMPM EQU   @NM00025+24                                              03219000
@NM00026 EQU   @NM00025+21                                              03220000
CCABPGRC EQU   @NM00025+20                                              03221000
CCABPGSP EQU   @NM00025+12                                              03222000
CCABPGAD EQU   @NM00025+8                                               03223000
CCABPGNM EQU   @NM00025                                                 03224000
CCAEND   EQU   HMASMCCA+371                                             03225000
@NM00024 EQU   HMASMCCA+309                                             03226000
CCACURDD EQU   CCAFDSNG+3                                               03227000
CCACURDS EQU   CCAFDSNG+2                                               03228000
@NM00023 EQU   CCAFLAGB                                                 03229000
CCAOUTNG EQU   CCAFLAGB                                                 03230000
CCALOGNG EQU   CCAFLAGB                                                 03231000
CCAFMID  EQU   HMASMCCA+291                                             03232000
CCALSTDS EQU   CCAFCTL+8                                                03233000
CCARPTDS EQU   CCAFCTL+7                                                03234000
CCATIME  EQU   CCAFCTL+4                                                03235000
CCADATE  EQU   CCAFCTL+1                                                03236000
@NM00022 EQU   CCAFLAG9                                                 03237000
CCARVCAN EQU   CCAFLAG9                                                 03238000
CCARVEST EQU   CCAFLAG9                                                 03239000
CCAPTSNJ EQU   CCAFLAG9                                                 03240000
CCASTSNP EQU   CCAFLAG9                                                 03241000
CCAMTSNP EQU   CCAFLAG9                                                 03242000
CCAPTSNP EQU   CCAFLAG9                                                 03243000
@NM00021 EQU   CCAFLAG8                                                 03244000
CCAACDSC EQU   CCAFLAG8                                                 03245000
CCACDSC  EQU   CCAFLAG8                                                 03246000
@NM00020 EQU   CCAFLAG6                                                 03247000
CCAACRUP EQU   CCAFLAG6                                                 03248000
CCACRQUP EQU   CCAFLAG6                                                 03249000
CCAACDUP EQU   CCAFLAG6                                                 03250000
CCACDSUP EQU   CCAFLAG6                                                 03251000
@NM00019 EQU   CCAFLAG5                                                 03252000
CCAACROS EQU   CCAFLAG5                                                 03253000
CCACRQOS EQU   CCAFLAG5                                                 03254000
CCAACDOS EQU   CCAFLAG5                                                 03255000
CCACDSOS EQU   CCAFLAG5                                                 03256000
@NM00018 EQU   CCAFLAG4                                                 03257000
CCAACRIS EQU   CCAFLAG4                                                 03258000
CCACRQIS EQU   CCAFLAG4                                                 03259000
CCAACDIS EQU   CCAFLAG4                                                 03260000
CCACDSIS EQU   CCAFLAG4                                                 03261000
@NM00017 EQU   CCAFLAG3+1                                               03262000
CCARGNP  EQU   CCAFLAG3+1                                               03263000
CCADISRQ EQU   CCAFLAG3+1                                               03264000
CCAICTOK EQU   CCAFLAG3                                                 03265000
CCADELP  EQU   CCAFLAG3                                                 03266000
CCACMPRS EQU   CCAFLAG3                                                 03267000
CCAZAPP  EQU   CCAFLAG3                                                 03268000
CCALINKP EQU   CCAFLAG3                                                 03269000
CCACOPYP EQU   CCAFLAG3                                                 03270000
CCAASIP  EQU   CCAFLAG3                                                 03271000
CCAUPDP  EQU   CCAFLAG3                                                 03272000
CCAEOSMP EQU   CCAFLAG2                                                 03273000
CCAEOFNC EQU   CCAFLAG2                                                 03274000
@NM00016 EQU   CCAFLAG2                                                 03275000
CCACHECK EQU   CCAFLAG2                                                 03276000
CCATERM  EQU   CCAFLAG2                                                 03277000
CCASVCLB EQU   CCAFLAG2                                                 03278000
CCANCPTF EQU   CCAFLAG2                                                 03279000
@NM00015 EQU   CCAFLAG1+1                                               03280000
CCAUNL   EQU   CCAFLAG1+1                                               03281000
CCARESET EQU   CCAFLAG1+1                                               03282000
CCALOG   EQU   CCAFLAG1+1                                               03283000
CCACNV   EQU   CCAFLAG1+1                                               03284000
CCALIST  EQU   CCAFLAG1                                                 03285000
CCAUPDU  EQU   CCAFLAG1                                                 03286000
CCAUPDJ  EQU   CCAFLAG1                                                 03287000
CCARES   EQU   CCAFLAG1                                                 03288000
CCAREJ   EQU   CCAFLAG1                                                 03289000
CCAAPPLY EQU   CCAFLAG1                                                 03290000
CCAREC   EQU   CCAFLAG1                                                 03291000
CCAFUNCT EQU   CCAFFUNC                                                 03292000
@NM00014 EQU   @NM00009+18                                              03293000
@NM00013 EQU   @NM00009+16                                              03294000
CCATBLPA EQU   @NM00009+12                                              03295000
@NM00012 EQU   @NM00009+8                                               03296000
@NM00011 EQU   @NM00009+4                                               03297000
@NM00010 EQU   @NM00009                                                 03298000
CCAIFGTP EQU   CCAFGTP+16                                               03299000
CCAGTP3  EQU   CCAFGTP+12                                               03300000
CCAGTP2  EQU   CCAFGTP+8                                                03301000
CCAGTP1  EQU   CCAFGTP+4                                                03302000
CCASETAD EQU   CCASEGTP                                                 03303000
CCACLST  EQU   CCAFPGM+12                                               03304000
CCASPDCB EQU   CCAFPGM+8                                                03305000
CCAACDID EQU   CCAFSYS+32                                               03306000
CCACDSID EQU   CCAFSYS+24                                               03307000
CCALNLEN EQU   CCAFSYS+22                                               03308000
@NM00008 EQU   CCAFLAGA                                                 03309000
CCAPSYSF EQU   CCAFLAGA                                                 03310000
CCAASYSF EQU   CCAFLAGA                                                 03311000
CCACSYSF EQU   CCAFLAGA                                                 03312000
CCANUCID EQU   CCAFSYS+20                                               03313000
CCAASREL EQU   CCAFSYS+16                                               03314000
CCACSREL EQU   CCASREL                                                  03315000
CCAPEMAX EQU   CCAFSYS+10                                               03316000
CCAPGLEN EQU   CCAFSYS+8                                                03317000
CCAIOPAS EQU   CCAFSYS+4                                                03318000
CCAIOPCS EQU   CCAFSYS                                                  03319000
CCAPESIZ EQU   CCAFIOP+4                                                03320000
@NM00007 EQU   CCAFLAG7+3                                               03321000
CCALOGP  EQU   CCAFLAG7+2                                               03322000
CCAOUTP  EQU   CCAFLAG7+2                                               03323000
CCASLBP  EQU   CCAFLAG7+2                                               03324000
CCARPTP  EQU   CCAFLAG7+2                                               03325000
CCALISTP EQU   CCAFLAG7+2                                               03326000
CCAJCLP  EQU   CCAFLAG7+2                                               03327000
CCAPTFP  EQU   CCAFLAG7+2                                               03328000
CCATLBP  EQU   CCAFLAG7+2                                               03329000
CCAUT3P  EQU   CCAFLAG7+1                                               03330000
CCAUT2P  EQU   CCAFLAG7+1                                               03331000
CCAUT1P  EQU   CCAFLAG7+1                                               03332000
CCAWK5P  EQU   CCAFLAG7+1                                               03333000
CCAWK4P  EQU   CCAFLAG7+1                                               03334000
CCAWK3P  EQU   CCAFLAG7+1                                               03335000
CCAWK2P  EQU   CCAFLAG7+1                                               03336000
CCAWK1P  EQU   CCAFLAG7+1                                               03337000
CCAACRQP EQU   CCAFLAG7                                                 03338000
CCACRQP  EQU   CCAFLAG7                                                 03339000
CCASTSP  EQU   CCAFLAG7                                                 03340000
CCAMTSP  EQU   CCAFLAG7                                                 03341000
CCAPTSP  EQU   CCAFLAG7                                                 03342000
CCASCDSP EQU   CCAFLAG7                                                 03343000
CCAACDSP EQU   CCAFLAG7                                                 03344000
CCACDSP  EQU   CCAFLAG7                                                 03345000
@NM00006 EQU   CCAFBUFR+122                                             03346000
@NM00005 EQU   CCAFBUFR+120                                             03347000
@NM00004 EQU   CCAFBUFR+118                                             03348000
CCATBFMX EQU   CCAFBUFR+116                                             03349000
CCA4BFMX EQU   CCAFBUFR+114                                             03350000
CCA3BFMX EQU   CCAFBUFR+112                                             03351000
CCA2BFMX EQU   CCAFBUFR+110                                             03352000
CCA1BFMX EQU   CCAFBUFR+108                                             03353000
CCAXBFMX EQU   CCAFBUFR+106                                             03354000
CCAQBFMX EQU   CCAFBUFR+104                                             03355000
CCASBFMX EQU   CCAFBUFR+102                                             03356000
CCAMBFMX EQU   CCAFBUFR+100                                             03357000
CCAPBFMX EQU   CCAFBUFR+98                                              03358000
CCAVBFMX EQU   CCAFBUFR+96                                              03359000
CCAABFMX EQU   CCAFBUFR+94                                              03360000
CCACBFMX EQU   CCAFBUFR+92                                              03361000
@NM00003 EQU   CCAFBUFR+88                                              03362000
@NM00002 EQU   CCAFBUFR+84                                              03363000
CCA4BFSZ EQU   CCAFBUFR+80                                              03364000
CCATBFSZ EQU   CCAFBUFR+76                                              03365000
CCAWBFSZ EQU   CCAFBUFR+72                                              03366000
CCAQBFSZ EQU   CCAFBUFR+68                                              03367000
CCAPBFSZ EQU   CCAFBUFR+64                                              03368000
CCAVBFSZ EQU   CCAFBUFR+60                                              03369000
CCACBFSZ EQU   CCAFBUFR+56                                              03370000
@NM00001 EQU   CCAFBUFR+52                                              03371000
CCA4BFOA EQU   CCAFBUFR+48                                              03372000
CCA4BFIA EQU   CCAFBUFR+44                                              03373000
CCATBFIA EQU   CCAFBUFR+40                                              03374000
CCAWBFOA EQU   CCAFBUFR+36                                              03375000
CCAWBFIA EQU   CCAFBUFR+32                                              03376000
CCAQBFOA EQU   CCAFBUFR+28                                              03377000
CCAQBFIA EQU   CCAFBUFR+24                                              03378000
CCAPBFOA EQU   CCAFBUFR+20                                              03379000
CCAPBFIA EQU   CCAFBUFR+16                                              03380000
CCAVBFOA EQU   CCAFBUFR+12                                              03381000
CCAVBFIA EQU   CCAFBUFR+8                                               03382000
CCACBFOA EQU   CCAFBUFR+4                                               03383000
CCACBFIA EQU   CCAFBUFR                                                 03384000
CCAID    EQU   HMASMCCA                                                 03385000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03386000
@RT00221 EQU   HMAZP050                                                 03387000
@RT00272 EQU   HMAZP040                                                 03388000
@RT00299 EQU   HMAZP050                                                 03389000
@RT00312 EQU   HMAZP110                                                 03390000
@RT00314 EQU   HMAZP120                                                 03391000
@RT00317 EQU   HMAZP110                                                 03392000
@RT00340 EQU   HMAZP050                                                 03393000
@RF00323 EQU   HMAZP035                                                 03394000
@RF00321 EQU   HMAZP110                                                 03395000
@RT00359 EQU   HMAZP050                                                 03396000
@RF00504 EQU   HMAZP115                                                 03397000
@RF00562 EQU   HMAZP700                                                 03398000
@RF00569 EQU   HMAZP700                                                 03399000
@RC00588 EQU   HMAZP700                                                 03400000
@RC00586 EQU   HMAZP700                                                 03401000
@RF00607 EQU   HMAZP700                                                 03402000
@RC00613 EQU   HMAZP700                                                 03403000
@RT00622 EQU   RCCHHR                                                   03404000
@RF00622 EQU   HMAZP700                                                 03405000
@RF00629 EQU   HMAZP700                                                 03406000
@ENDDATA EQU   *                                                        03407000
         END   HMASMZAP,(C'PLS2240',0802,78334)                         03408000
