         TITLE '*** IKT93EST: TSO/VTAM ESTAE FOR SVC 93 ***'            00001000
IKT93EST CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'IKT93EST  78.336'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@12                                         0001 00011000
RBPRFXLN EQU 64                                                         00012000
RBPRFLNA EQU 32                                                         00013000
PRBLEN   EQU 136                                                        00014000
SIRBLEN  EQU 200                                                        00015000
TIRBLEN  EQU 136                                                        00016000
IRBLEN   EQU 128                                                        00017000
SVRBLEN  EQU 224                                                        00018000
*IF REG0 = 12 THEN;                  /* ANY SDWA ?                   */ 00019000
         C     REG0,@CF02134                                       0076 00020000
         BE    @RT00076                                            0076 00021000
*                                    /* NO, JUST RETURN              */ 00022000
*ELSE                                                              0078 00023000
*  DO;                               /* SDWA EXISTS                  */ 00024000
*    STM(RTNREG,BASEREG,ESTAESA);    /* SAVE REGS IN ESTAE SAVE AREA */ 00025000
         STM   RTNREG,BASEREG,ESTAESA(SAVEREG)                     0079 00026000
*    RFY REG0 UNRSTD;                                              0080 00027000
*    TSBPTR = ASCBTSB;               /* SET UP TSB ADDRESSABILITY    */ 00028000
         L     @07,ASCBPTR                                         0081 00029000
         L     TSBPTR,ASCBTSB(,@07)                                0081 00030000
*    SDWAPTR= REG1;                  /* SAVE ADDRESS OF SDWA         */ 00031000
         LR    SDWAPTR,REG1                                        0082 00032000
*    RFY REG1 UNRSTD;                                              0083 00033000
*    RBSECPTR = SDWAPARM;            /* ESTABLISH ADDRESSABILITY TO     00034000
*                                       EXTENDED SAVE AREA.          */ 00035000
         L     RBSECPTR,SDWAPARM(,SDWAPTR)                         0084 00036000
*    RFY TVCS BASED(XSATVCSP);                                     0085 00037000
*    IF SDWAPCHK = '1'B & XSADMOVE = '1'B THEN /* PGM CHECK DURING 0086 00038000
*                                                 DATA MOVE ?        */ 00039000
         TM    SDWAPCHK(SDWAPTR),B'01000000'                       0086 00040000
         BNO   @RF00086                                            0086 00041000
         TM    XSADMOVE(RBSECPTR),B'01000000'                      0086 00042000
         BNO   @RF00086                                            0086 00043000
*      SDWACMPC = CMPLCODE;          /* YES, CHANGE COMPLETION CODE  */ 00044000
         MVC   SDWACMPC(3,SDWAPTR),CMPLCODE+1                      0087 00045000
*    IF XSAPTGT = '0'B THEN          /* IF TPUT, THEN CLEAN UP TSB   */ 00046000
@RF00086 TM    XSAPTGT(RBSECPTR),B'10000000'                       0088 00047000
         BNZ   @RF00088                                            0088 00048000
*       CALL TSBCLEAN;               /* GO CLEAN UP PROPER TSB       */ 00049000
         BAL   @14,TSBCLEAN                                        0089 00050000
*    IF XSAIDENQ = '1'B THEN         /* WAS AN ASID ENQ'ED IN      0090 00051000
*                                       IKTASTPT ?                   */ 00052000
@RF00088 TM    XSAIDENQ(RBSECPTR),B'10000000'                      0090 00053000
         BNO   @RF00090                                            0090 00054000
*                                    /* YES, DEQUEUE THE ASID        */ 00055000
*        DO;                                                       0091 00056000
*          RFY (REG1,REG2,REG3) RSTD;                              0092 00057000
*          XSAWD5 =  'FF000000'X;    /* SET LIST FORM OF DEQ         */ 00058000
         MVC   XSAWD5(4,RBSECPTR),@CF02156                         0093 00059000
*          REG1 = ADDR(XSAENQAD);    /* ADDRESS OF DEQ WORK AREA     */ 00060000
         LA    REG1,XSAENQAD(,RBSECPTR)                            0094 00061000
*          REG2 = ADDR(QNAME);       /* GET QNAME ADDRESS FOR GEN    */ 00062000
         LA    REG2,QNAME                                          0095 00063000
*          REG3 = ADDR(XSAASID);     /* GET RNAME ADDRESS FOR GEN    */ 00064000
         LA    REG3,XSAASID(,RBSECPTR)                             0096 00065000
*          GEN                                                     0097 00066000
*              (DEQ ((REG2),(REG3),2,SYSTEM),RET=HAVE,MF=(E,(REG1)) );  00067000
         DEQ ((REG2),(REG3),2,SYSTEM),RET=HAVE,MF=(E,(REG1))            00068000
*        END;                                                      0098 00069000
*        RFY (REG1,REG2,REG3) UNRSTD;                              0099 00070000
@RF00090 DS    0H                                                  0100 00071000
*    SDWARCDE = SDWACWT;             /* INDICATE TO CONTINUE WITH  0100 00072000
*                                       TERMINATION                  */ 00073000
         MVI   SDWARCDE(SDWAPTR),X'00'                             0100 00074000
*    SDWARTYA =  0;                  /* CLEAR RETRY ADDRESS          */ 00075000
         SLR   @08,@08                                             0101 00076000
         ST    @08,SDWARTYA(,SDWAPTR)                              0101 00077000
*    LM(RTNREG,BASEREG,ESTAESA);     /* RESTORE REGS                 */ 00078000
         LM    RTNREG,BASEREG,ESTAESA(SAVEREG)                     0102 00079000
*  END;                              /* END 'SDWA EXISTS'            */ 00080000
*                                    /* RETURN TO RTN                */ 00081000
*RETURN CODE(0);                     /* RETURN TO RTM                */ 00082000
@RT00076 SLR   @15,@15                                             0104 00083000
@EL00001 DS    0H                                                  0104 00084000
@EF00001 DS    0H                                                  0104 00085000
@ER00001 BR    @14                                                 0104 00086000
*TSBCLEAN: PROC OPTIONS(NOSAVEAREA,NOSAVE);                        0105 00087000
TSBCLEAN DS    0H                                                  0106 00088000
*/*                                                                  */ 00089000
*/********************************************************************/ 00090000
*/*                                                                  */ 00091000
*/*                 TSBCLEAN IS AN INTERNAL PROC THAT CLEANS UP      */ 00092000
*/*             THE TSB ASSOCIATED WITH THE TPUT/TGET.               */ 00093000
*/*             FOR A TGET, NOTHING IS NECESSARY                     */ 00094000
*/*             FOR A TPUT TO THE TERMINAL ASSOCIATED WITH THIS      */ 00095000
*/*             ADDRESS SPACE, STATUS IS CALLED TO RE-DISPATCH       */ 00096000
*/*             WAITING TASKS IF THEY ARE WAITING ON THE TASK, AND   */ 00097000
*/*             TSB FIELDS ARE CLEARED.                              */ 00098000
*/*             FOR AN ASID TPUT, THE CSA AREAS ARE FREED IF THE     */ 00099000
*/*             DESTINATION TERMINAL HAS RELINQUISHED CONTROL OF     */ 00100000
*/*             THE AREAS....  IF THE DESTINATION HAS NOT            */ 00101000
*/*             RELINQUISHED CONTROL, THEN THIS TASK INDICATES THAT  */ 00102000
*/*             IT DOES,SO THAT THE DESTINATION WILL FREE THE AREAS  */ 00103000
*/*         ****TSBCLEAN SAVES RETURN ADDRESS IN XSASAVEA            */ 00104000
*/*                                                                  */ 00105000
*/********************************************************************/ 00106000
*/*                                                                 **/ 00107000
*RFY RTNREG RSTD;                                                  0106 00108000
*XSASAVEA = RTNREG;                  /* SAVE RETURN ADDRESS         **/ 00109000
         ST    RTNREG,XSASAVEA(,RBSECPTR)                          0107 00110000
*RFY RTNREG UNRSTD;                                                0108 00111000
*/********************************************************************/ 00112000
*/*      OBTAIN LOCAL LOCK                                           */ 00113000
*/********************************************************************/ 00114000
*                                                                  0109 00115000
*GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);            0109 00116000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,              --00117000
               RELATED=(TSB,TSBCLEAN(RETURN))                           00118000
*IF TSBPTR ^= 0 & TSBCTCB =CURNTTCB THEN /* IF FOREGROUND JOB, THEN     00119000
*                                           DOES THIS TASK 'OWN'   0110 00120000
*                                           THE TSB ?               **/ 00121000
         SLR   @08,@08                                             0110 00122000
         CR    TSBPTR,@08                                          0110 00123000
         BE    @RF00110                                            0110 00124000
         L     @07,CVTPTR                                          0110 00125000
         L     @04,CVTTCBP(,@07)                                   0110 00126000
         CLC   TSBCTCB(4,TSBPTR),CURNTTCB(@04)                     0110 00127000
         BNE   @RF00110                                            0110 00128000
*  DO;                                                             0111 00129000
*    TSBOWIP = '0'B;                 /* CLEAR 'OWAIT IN PROGRESS     */ 00130000
         NI    TSBOWIP(TSBPTR),B'11011111'                         0112 00131000
*    TSBCTCB =  0;                   /* SET TO NOT 'OWN' TSB         */ 00132000
         ST    @08,TSBCTCB(,TSBPTR)                                0113 00133000
*    /*                                                              */ 00134000
*    /*    CALL STATUS TO RE-DISPATCH TASKS WAITING ON THIS          */ 00135000
*    /*    TASK TO COMPLETE TPUT PROCESSING.                         */ 00136000
*    /*                                                              */ 00137000
*    IF TSBWOWIP = '1'B THEN         /* ANYBODY WAITING ?            */ 00138000
         TM    TSBWOWIP(TSBPTR),B'00010000'                        0114 00139000
         BNO   @RF00114                                            0114 00140000
*      DO;                           /* YES                          */ 00141000
*        TSBWOWIP = '0'B;            /* CLEAR OWAIT IN PROGRESS IND  */ 00142000
         NI    TSBWOWIP(TSBPTR),B'11101111'                        0116 00143000
*        RFY (REG0,REG1,REG2) RSTD;                                0117 00144000
*        REG2 = SAVEREG;             /* SAVE ESTAE SAVE AREA         */ 00145000
         LR    REG2,SAVEREG                                        0118 00146000
*        SAVEREG = NDISPBIT;         /* INDICATE THAT NON-DISPATCH-     00147000
*                                       ABILITY BIT TO RESET IS OWAIT*/ 00148000
         LA    SAVEREG,1024                                        0119 00149000
*        REG0 = ASCBASID*65536 | ALLTASKS; /* ALL TASKS WILL BE RESET*/ 00150000
         L     @08,ASCBPTR                                         0120 00151000
         LH    REG0,ASCBASID(,@08)                                 0120 00152000
         N     REG0,@CF02180                                       0120 00153000
         SLA   REG0,16                                             0120 00154000
         O     REG0,@CF00049                                       0120 00155000
*        REG1 = RESET;               /* INDICATE RESET VS. SET       */ 00156000
         L     REG1,RESET                                          0121 00157000
*        CALL STATUS;                                              0122 00158000
         L     @08,SCVTSPTR(,@07)                                  0122 00159000
         L     @15,SCVTSTAT(,@08)                                  0122 00160000
         BALR  @14,@15                                             0122 00161000
*        SAVEREG = REG2;             /* RESTORE SAVE AREA ADDR       */ 00162000
         LR    SAVEREG,REG2                                        0123 00163000
*        RFY (REG0,REG1,REG2) UNRSTD;                              0124 00164000
*      END;                                                        0125 00165000
*/*                                                                  */ 00166000
*/*      RELEASE LOCAL LOCK                                          */ 00167000
*/*                                                                  */ 00168000
*    GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);        0126 00169000
@RF00114 DS    0H                                                  0126 00170000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                         --00171000
               RELATED=(TSB,TSBCLEAN(ENTRY));                           00172000
*  END;                              /* END 'THIS TASKS OWNS TSB'    */ 00173000
*ELSE                                                              0128 00174000
*  /*                                                                */ 00175000
*  /******************************************************************/ 00176000
*  /*                                                                */ 00177000
*  /*   TEST IF ASID TPUT. IF SO, FREE STORAGE OR RELINQUISH         */ 00178000
*  /*   CONTROL OF STORAGE                                           */ 00179000
*  /*                                                                */ 00180000
*  /******************************************************************/ 00181000
*  /*                                                                */ 00182000
*  IF XSAASID  ^= 0 &                /*  IS AN ASID SPECIFIED ?      */ 00183000
*     XSAASID  ^= ASCBASID &         /*  IS ASID NOT THIS ADDR SPCS  */ 00184000
*     XSATVCSP ^= 0 THEN             /*  IS THERE A TVCS AREA        */ 00185000
         B     @RC00110                                            0128 00186000
@RF00110 LH    @08,XSAASID(,RBSECPTR)                              0128 00187000
         LTR   @08,@08                                             0128 00188000
         BZ    @RF00128                                            0128 00189000
         L     @07,ASCBPTR                                         0128 00190000
         LH    @07,ASCBASID(,@07)                                  0128 00191000
         N     @07,@CF02180                                        0128 00192000
         CR    @08,@07                                             0128 00193000
         BE    @RF00128                                            0128 00194000
         L     @08,XSATVCSP-1(,RBSECPTR)                           0128 00195000
         LA    @08,0(,@08)                                         0128 00196000
         LTR   @08,@08                                             0128 00197000
         BZ    @RF00128                                            0128 00198000
*   DO;                                                            0129 00199000
*    /****************************************************************/ 00200000
*    /*  YES. SEE IF TARGET RELINQUISHED CONTROL. THIS IS DONE BY A  */ 00201000
*    /*  COMPARE & SWAP ON THE BYTE TVCS                             */ 00202000
*    /*  IF TVCSTGRC IS ON, THEN THIS MODULE MUST FREE STORAGE       */ 00203000
*    /*  SINCE TARGET ADDRESS SPACE HAS RELINQUISHED CONTROL         */ 00204000
*    /*  IN THIS CASE, OBTAIN CMS LOCK, ENSURE THAT THE TARGET       */ 00205000
*    /*  TSB HAS NOT BEEN FREEMAINED, AND CLEAR TSB FIELDS.          */ 00206000
*    /*  THE ABOVE MUST ALSO BE PERFORMED IF THE SRB FOR IKTXMTPT    */ 00207000
*    /*  HAS NOT BEEN SCHEDULED.                                     */ 00208000
*    /*  IF TVCSTGRC IS NOT ON THEN TURN ON TVCSRCRC TO INDICATE     */ 00209000
*    /*  THAT THE SOURCE RELINQUISHES CONTROL.                       */ 00210000
*    /*                                                              */ 00211000
*    /****************************************************************/ 00212000
*      RFY (WORK1REG,WORK2REG) RSTD;                               0130 00213000
*      WORK1REG = TVCSINDS;          /* FIRST OPERAND FOR CS         */ 00214000
         L     WORK1REG,TVCSINDS(,@08)                             0131 00215000
*CSLOOP:                                                           0132 00216000
*      WORK2REG = WORK1REG;          /* THIRD OPERAND FOR CS         */ 00217000
CSLOOP   LR    WORK2REG,WORK1REG                                   0132 00218000
*      /**************************************************************/ 00219000
*      /*   TEST IF TARGET RELINQUISHED CONTROL OR IKTXMTPT          */ 00220000
*      /*   HAS NOT BEEN SCHEDULED                                   */ 00221000
*      /**************************************************************/ 00222000
*      IF TVCSTGRC = '1'B | XSASCHED = 0 THEN                      0133 00223000
         L     @08,XSATVCSP-1(,RBSECPTR)                           0133 00224000
         TM    TVCSTGRC(@08),B'01000000'                           0133 00225000
         BO    @RT00133                                            0133 00226000
         CLI   XSASCHED(RBSECPTR),0                                0133 00227000
         BNE   @RF00133                                            0133 00228000
@RT00133 DS    0H                                                  0134 00229000
*        DO;                                                       0134 00230000
*          /**********************************************************/ 00231000
*          /*      OBTAIN CMS LOCK FOR REFERENCING TARGET TSB        */ 00232000
*          /**********************************************************/ 00233000
*                                                                  0135 00234000
*          GEN SETS(RTNREG,ENTRYREG,REG0,REG1)                     0135 00235000
*              REFS(PSALITA,FLC);                                  0135 00236000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                --00237000
               RELATED=(TARGET-TSB)                                     00238000
*          /**********************************************************/ 00239000
*          /*       CHECK IF THE TARGET TSB HAS BEEN FREED. IF NOT   */ 00240000
*          /*       RE-SET TSB FIELDS.                               */ 00241000
*          /**********************************************************/ 00242000
*          CALL TERMSTAT;                                          0136 00243000
         BAL   @14,TERMSTAT                                        0136 00244000
*          IF XSARC ^= TERMCNCL THEN  /* OTHER TERMINAL STILL THERE? */ 00245000
         CLI   XSARC(RBSECPTR),20                                  0137 00246000
         BE    @RF00137                                            0137 00247000
*            DO;                     /* YES                          */ 00248000
*              TSBXCSAP = 0;         /* CLEAR POINTER TO TVCS        */ 00249000
         SLR   @08,@08                                             0139 00250000
         L     @07,TSBEXTNT(,TSBPTR)                               0139 00251000
         ST    @08,TSBXCSAP(,@07)                                  0139 00252000
*              TSBWTJID = 0;         /* CLEAR CALLING ASID FIELD     */ 00253000
         STH   @08,TSBWTJID(,TSBPTR)                               0140 00254000
*              TSBWTCB = 0;          /* CLEAR CALLING TCB FIELD      */ 00255000
         STCM  @08,7,TSBWTCB(TSBPTR)                               0141 00256000
*            END;                                                  0142 00257000
*          /**********************************************************/ 00258000
*          /*   FREE LOCAL AND CMS LOCKS NOW THAT TSB HAS BEEN RESET */ 00259000
*          /**********************************************************/ 00260000
*          GEN SETS(RTNREG,ENTRYREG,REG0,REG1)                     0143 00261000
*              REFS(PSALITA,FLC);                                  0143 00262000
@RF00137 DS    0H                                                  0143 00263000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,RELATED=(TARGET-TSB)         00264000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(CMS-LOCK)         00265000
*          CALL FREESTOR;            /* NOW FREE CSA STORAGE         */ 00266000
*                                                                  0144 00267000
         BAL   @14,FREESTOR                                        0144 00268000
*        END;                        /* END TARGET RELINQUISHED    0145 00269000
*                                      CONTROL 'DO'                  */ 00270000
*      ELSE                                                        0146 00271000
*        DO;                                                       0146 00272000
         B     @RC00133                                            0146 00273000
@RF00133 DS    0H                                                  0147 00274000
*          GEN SETS(WORK2REG) REFS(SOURCERC)                       0147 00275000
*            (O  WORK2REG,SOURCERC); /* TURN ON TVCSRCRC             */ 00276000
         O  WORK2REG,SOURCERC                                           00277000
*          CS(WORK1REG,WORK2REG,TVCSINDS); /* DO THE COMPARE & SWAP  */ 00278000
         L     @03,XSATVCSP-1(,RBSECPTR)                           0148 00279000
         CS    WORK1REG,@02,TVCSINDS(@03)                          0148 00280000
*          BC(NE,CSLOOP);            /* CONTINUE LOOP IF CS FAILED   */ 00281000
         BC    7,CSLOOP                                            0149 00282000
*          /* CS SUCCESSFUL...I.E., OTHER TERMINAL IS STILL AROUND   */ 00283000
*          /* FREE LOCAL LOCK                                        */ 00284000
*          GEN SETS(RTNREG,ENTRYREG,REG0,REG1)                     0150 00285000
*              REFS(PSALITA,FLC)                                   0150 00286000
*          (SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSB));    0150 00287000
*                                                                  0150 00288000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSB)              00289000
*        END;                        /* END OF CS FOR SETTING      0151 00290000
*                                       TVCSRCRC                     */ 00291000
*    RFY (WORK1REG,WORK2REG) UNRSTD;                        /*@ZA19923* 00292000
@RC00133 DS    0H                                                  0153 00293000
*   END;                             /* END 'XSATVCSP ^= 0'           * 00294000
*  ELSE                              /* IF XSATVCSP=0         @ZA19923* 00295000
*    GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC); /*@ZA19923* 00296000
         B     @RC00128                                            0154 00297000
@RF00128 DS    0H                                                  0154 00298000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSBCLEAN)         00299000
*RFY RTNREG RSTD;                                                  0155 00300000
@RC00128 DS    0H                                                  0155 00301000
@RC00110 DS    0H                                                  0156 00302000
*RTNREG = XSASAVEA;             /* RESTORE RETURN ADDRESS            */ 00303000
         L     RTNREG,XSASAVEA(,RBSECPTR)                          0156 00304000
*RETURN;                                                           0157 00305000
@EL00002 DS    0H                                                  0157 00306000
@EF00002 DS    0H                                                  0157 00307000
@ER00002 BR    @14                                                 0157 00308000
*RFY RTNREG UNRSTD;                                                0158 00309000
*END TSBCLEAN;                                                     0159 00310000
*FREESTOR: PROC OPTIONS(NOSAVEAREA,NOSAVE);                        0160 00311000
FREESTOR DS    0H                                                  0161 00312000
*/*                                                                  */ 00313000
*/********************************************************************/ 00314000
*/*                                                                  */ 00315000
*/*      FREESTOR ASSURES THAT A CROSS-MEMORY POST IS COMPLETE       */ 00316000
*/*      AND THEN FREES THE CSA AREAS THAT WERE ALLOCATED FOR        */ 00317000
*/*      THE SRB AND THE DATA AREA. BOTH AREAS ARE FREED USING       */ 00318000
*/*      THE GLOBAL,BRANCH ENTRY                                     */ 00319000
*/*      LOCAL LOCK IS NOT HELD                                      */ 00320000
*/*   **** THE RETURN ADDRESS IS STORED IN XSASAVEB                  */ 00321000
*/*                                                                  */ 00322000
*/********************************************************************/ 00323000
*/*                                                                  */ 00324000
*RFY RTNREG RSTD;                                                  0161 00325000
*XSASAVEB = RTNREG;                                                0162 00326000
         ST    RTNREG,XSASAVEB(,RBSECPTR)                          0162 00327000
*RFY RTNREG UNRSTD;                                                0163 00328000
*/*      INSURE THAT POST FROM OTHER ADDRESS SPACE HAS COMPLETED     */ 00329000
*GEN CODE SETS(REG1)                                               0164 00330000
*         REFS(CVTPTR,CVTSPOST,CVTMAP)                             0164 00331000
*        (SPOST );                                                 0164 00332000
         SPOST                                                          00333000
*/*       FREE SRB  AREA AFTER OBTAINING SALLOC LOCK                 */ 00334000
*RFY (REG0,REG2,REG7,REG8) RSTD;                                   0165 00335000
*REG2 = TVCSSRBA;                    /* GET ADDR FOR SRB FREEMAIN    */ 00336000
         L     @04,XSATVCSP-1(,RBSECPTR)                           0166 00337000
         LA    @04,0(,@04)                                         0166 00338000
         L     REG2,TVCSSRBA-1(,@04)                               0166 00339000
         LA    REG2,0(,REG2)                                       0166 00340000
*REG7 = TVCSGMSZ;                    /* GET SIZE FOR TVCS FREEMAIN   */ 00341000
         LH    REG7,TVCSGMSZ(,@04)                                 0167 00342000
*REG8 = XSATVCSP;                    /* GET ADDR FOR TVCS FREEMAIN   */ 00343000
         LR    REG8,@04                                            0168 00344000
*GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1)                          0169 00345000
*         REFS(PSALITA,FLC);                                       0169 00346000
         SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,REGS=USE,             --00347000
               RELATED=(TVCS,SRB)                                       00348000
*/********************************************************************/ 00349000
*/*                                                                  */ 00350000
*/*         FREE SRB IF THERE IS ONE. SHOULD BE UNLESS THE           */ 00351000
*/*         GETMAIN FOR THE SRB FAILED.                              */ 00352000
*/*         PURGEDQ IS NOT NECESSARY BECAUSE TVCSTGRC IS ONLY SET    */ 00353000
*/*         WHEN THE SRB IS DISPATCHED OR WHEN MEMTERM CAUSES        */ 00354000
*/*         IKTAY8 TO ISSUE A PURGEDQ.                               */ 00355000
*/*                                                                  */ 00356000
*/********************************************************************/ 00357000
*IF REG2 ^= 0 THEN                   /* IS THERE AN SRB ?            */ 00358000
         LTR   REG2,REG2                                           0170 00359000
         BZ    @RF00170                                            0170 00360000
*  DO;                               /* YES, FREE IT                 */ 00361000
*    REG0 = LENGTH(SRB);             /* GET LENGTH FOR FREEMAIN      */ 00362000
         LA    REG0,44                                             0172 00363000
*    GEN SETS(RTNREG,ENTRYREG,REG1,REG3,REG4)                      0173 00364000
*        REFS(CVTSPSA,CVTMAP,WSAGGMFM,WSAG,CVTGLMN);               0173 00365000
         FREEMAIN RU,LV=(0),A=(REG2),SP=239,KEY=0,                    --00366000
               BRANCH=(YES,GLOBAL),RELATED=(SRB)                        00367000
*  END;                                                            0174 00368000
*/********************************************************************/ 00369000
*/*         FREE TVCS AREA                                           */ 00370000
*/********************************************************************/ 00371000
*REG0 = REG7;                        /* GET LENGTH FOR FREEMAIN      */ 00372000
@RF00170 LR    REG0,REG7                                           0175 00373000
*GEN CODE SETS(RTNREG,ENTRYREG,REG1,REG3,REG4)                     0176 00374000
*         REFS(CVTSPSA,CVTMAP,WSAGGMFM,WSAG,CVTGLMN);              0176 00375000
         FREEMAIN RU,LV=(0),A=(REG8),SP=231,KEY=6,                    --00376000
               BRANCH=(YES,GLOBAL),RELATED=(TVCS,SRB)                   00377000
*/********************************************************************/ 00378000
*/*     RELEASE SALLOC LOCK                                          */ 00379000
*/********************************************************************/ 00380000
*GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1)                          0177 00381000
*         REFS(PSALITA,FLC);                                       0177 00382000
         SETLOCK RELEASE,TYPE=SALLOC,REGS=USE,RELATED=(TVCS,SRB)        00383000
*RFY (REG0,REG2) UNRSTD;                                           0178 00384000
*RFY RTNREG RSTD;                                                  0179 00385000
*RTNREG = XSASAVEB;                  /* RESTORE RETURN ADDRESS       */ 00386000
         L     RTNREG,XSASAVEB(,RBSECPTR)                          0180 00387000
*RETURN;                                                           0181 00388000
@EL00003 DS    0H                                                  0181 00389000
@EF00003 DS    0H                                                  0181 00390000
@ER00003 BR    @14                                                 0181 00391000
*RFY (RTNREG) UNRSTD;                                              0182 00392000
*END FREESTOR;                                                     0183 00393000
*TERMSTAT: PROC OPTIONS(NOSAVEAREA,NOSAVE);                        0184 00394000
TERMSTAT DS    0H                                                  0185 00395000
*/********************************************************************/ 00396000
*/*                                                                  */ 00397000
*/*     TERMSTAT IS AN INTERNAL PROCEDURE THAT EXAMINES THE          */ 00398000
*/*     STATUS OF THE TARGET TERMINAL.                               */ 00399000
*/*     IT RETURNS A CODE OF 14HEX IF THE TARGET TERMINAL HAS GONE   */ 00400000
*/*     AND A CODE OF 0 OTHERWISE.                                   */ 00401000
*/*  ****TERMSTAT SAVES RETURN ADDRESS IN SECOND LEVEL               */ 00402000
*/*      'SAVE WORD' - XSASAVEB                                      */ 00403000
*/*                                                                  */ 00404000
*/********************************************************************/ 00405000
*RFY RTNREG RSTD;                                                  0185 00406000
*XSASAVEB = RTNREG;                  /* SAVE RETURN ADDRESS          */ 00407000
         ST    RTNREG,XSASAVEB(,RBSECPTR)                          0186 00408000
*RFY RTNREG UNRSTD;                                                0187 00409000
*XSARC = TERMCNCL;                   /* INITIALIZE RETURN CODE       */ 00410000
         MVI   XSARC(RBSECPTR),X'14'                               0188 00411000
*RFY ASCB BASED(ASVTENTY(XSAASID));  /* THE ASVT POINTS TO THE ASCB S   00412000
*                                       ADDRESS. BASE THE ASCB ON THE   00413000
*                                       ENTRY SPECIFIED BY THE ASID  */ 00414000
*IF CVTTCASP ^= 0 THEN               /* IS TSO/VTAM UP ?             */ 00415000
         SLR   @04,@04                                             0190 00416000
         L     @15,CVTPTR                                          0190 00417000
         C     @04,CVTTCASP(,@15)                                  0190 00418000
         BE    @RF00190                                            0190 00419000
*                                    /* YES IT IS                    */ 00420000
*  IF ASVTAVAL(XSAASID) = '0'B THEN  /* CHECK IF ASID SLOT IN ASVT 0191 00421000
*                                       INDICATES IT IS ASSIGNED     */ 00422000
         LH    @14,XSAASID(,RBSECPTR)                              0191 00423000
         SLA   @14,2                                               0191 00424000
         L     @15,ASVTPTR(,@15)                                   0191 00425000
         ALR   @14,@15                                             0191 00426000
         TM    ASVTAVAL-4(@14),B'10000000'                         0191 00427000
         BNZ   @RF00191                                            0191 00428000
*    DO;                                                           0192 00429000
*      TSBPTR = ASCBTSB;             /* DEFINE TSB POINTER OF TARGET    00430000
*                                       ADDRESS SPACE                */ 00431000
         LH    @14,XSAASID(,RBSECPTR)                              0193 00432000
         SLA   @14,2                                               0193 00433000
         L     @01,ASVTENTY-4(@14,@15)                             0193 00434000
         L     TSBPTR,ASCBTSB(,@01)                                0193 00435000
*      RFY ASCB BASED(ASCBPTR);      /* NOW RE-BASE ASCB FOR THIS  0194 00436000
*                                       ADDRESS SPACE                */ 00437000
*      IF TSBPTR ^= 0 & TSBWTJID= ASCBASID THEN /*  IS THE ASID STORED  00438000
*                                                   THIS ASID?       */ 00439000
         CR    TSBPTR,@04                                          0195 00440000
         BE    @RF00195                                            0195 00441000
         L     @04,ASCBPTR                                         0195 00442000
         LH    @04,ASCBASID(,@04)                                  0195 00443000
         N     @04,@CF02180                                        0195 00444000
         CH    @04,TSBWTJID(,TSBPTR)                               0195 00445000
         BNE   @RF00195                                            0195 00446000
*        /* YES...THIS IS THE SAME TSB AS BEFORE. CONTINUE IF        */ 00447000
*        /* SESSION ISNT BEING CANCELLED.                            */ 00448000
*        IF TSBCANC = '0'B THEN                                    0196 00449000
         TM    TSBCANC(TSBPTR),B'00000100'                         0196 00450000
         BNZ   @RF00196                                            0196 00451000
*          XSARC = CONTINUE;                                       0197 00452000
         MVI   XSARC(RBSECPTR),X'00'                               0197 00453000
*    END;                                                          0198 00454000
@RF00196 DS    0H                                                  0198 00455000
@RF00195 DS    0H                                                  0199 00456000
*RFY RTNREG RSTD;                                                  0199 00457000
@RF00191 DS    0H                                                  0199 00458000
@RF00190 DS    0H                                                  0200 00459000
*RTNREG = XSASAVEB;                  /* RESTORE RETURN ADDRESS       */ 00460000
         L     RTNREG,XSASAVEB(,RBSECPTR)                          0200 00461000
*RFY RTNREG UNRSTD;                                                0201 00462000
*END TERMSTAT;                                                     0202 00463000
@EL00004 DS    0H                                                  0202 00464000
@EF00004 DS    0H                                                  0202 00465000
@ER00004 BR    @14                                                 0202 00466000
*END IKT93EST                                                      0203 00467000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00468000
*/*%INCLUDE SYSLIB  (IHASDWA )                                        * 00469000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00470000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                        * 00471000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 00472000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                        * 00473000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                        * 00474000
*/*%INCLUDE SYSLIB  (IHAASVT )                                        * 00475000
*/*%INCLUDE SYSLIB  (IHASCVT )                                        * 00476000
*/*%INCLUDE SYSLIB  (IHARB   )                                        * 00477000
*/*%INCLUDE SYSLIB  (IKJRB   )                                        * 00478000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00479000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00480000
*/*%INCLUDE SYSLIB  (IKTTVCS )                                        * 00481000
*;                                                                 0203 00482000
@DATA    DS    0H                                                       00483000
@DATD    DSECT                                                          00484000
         DS    0F                                                       00485000
IKT93EST CSECT                                                          00486000
         DS    0F                                                       00487000
@CF00049 DC    F'8'                                                     00488000
@CF02134 DC    F'12'                                                    00489000
@CF02156 DC    XL4'FF000000'                                            00490000
@CF02180 DC    XL4'0000FFFF'                                            00491000
@DATD    DSECT                                                          00492000
         DS    0D                                                       00493000
@ENDDATD EQU   *                                                        00494000
IKT93EST CSECT                                                          00495000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00496000
         DS    0F                                                       00497000
@SIZDATD DC    AL1(0)                                                   00498000
         DC    AL3(@ENDDATD-@DATD)                                      00499000
         DS    0D                                                       00500000
CMPLCODE DC    XL4'15D000'                                              00501000
RESET    DC    XL4'80000000'                                            00502000
SOURCERC DC    XL4'80000000'                                            00503000
QNAME    DC    CL8'SYSZIGGI'                                            00504000
PATCHLBL DS    CL50                                                     00505000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00506000
@01      EQU   01                                                       00507000
@02      EQU   02                                                       00508000
@03      EQU   03                                                       00509000
@04      EQU   04                                                       00510000
@05      EQU   05                                                       00511000
@06      EQU   06                                                       00512000
@07      EQU   07                                                       00513000
@08      EQU   08                                                       00514000
@09      EQU   09                                                       00515000
@10      EQU   10                                                       00516000
@11      EQU   11                                                       00517000
@12      EQU   12                                                       00518000
@13      EQU   13                                                       00519000
@14      EQU   14                                                       00520000
@15      EQU   15                                                       00521000
SDWAPTR  EQU   @06                                                      00522000
TSBPTR   EQU   @09                                                      00523000
RBSECPTR EQU   @05                                                      00524000
REG0     EQU   @00                                                      00525000
REG1     EQU   @01                                                      00526000
WORK1REG EQU   @01                                                      00527000
REG2     EQU   @02                                                      00528000
WORK2REG EQU   @02                                                      00529000
REG3     EQU   @03                                                      00530000
REG4     EQU   @04                                                      00531000
REG7     EQU   @07                                                      00532000
REG8     EQU   @08                                                      00533000
BASEREG  EQU   @12                                                      00534000
SAVEREG  EQU   @13                                                      00535000
RTNREG   EQU   @14                                                      00536000
ENTRYREG EQU   @15                                                      00537000
RCREG    EQU   @15                                                      00538000
WORK3REG EQU   @03                                                      00539000
PSA      EQU   0                                                        00540000
FLCRNPSW EQU   PSA                                                      00541000
FLCROPSW EQU   PSA+8                                                    00542000
FLCICCW2 EQU   PSA+16                                                   00543000
FLCCVT   EQU   FLCICCW2                                                 00544000
PSAEEPSW EQU   PSA+132                                                  00545000
PSAESPSW EQU   PSA+136                                                  00546000
FLCSVILC EQU   PSAESPSW+1                                               00547000
PSAEPPSW EQU   PSA+140                                                  00548000
FLCPIILC EQU   PSAEPPSW+1                                               00549000
FLCPICOD EQU   PSAEPPSW+2                                               00550000
PSAPICOD EQU   FLCPICOD+1                                               00551000
FLCTEA   EQU   PSAEPPSW+4                                               00552000
FLCPER   EQU   PSA+152                                                  00553000
FLCMCLA  EQU   PSA+168                                                  00554000
FLCIOEL  EQU   FLCMCLA+4                                                00555000
FLCIOA   EQU   FLCMCLA+16                                               00556000
FLCFSA   EQU   FLCMCLA+80                                               00557000
PSAAOLD  EQU   PSA+548                                                  00558000
PSASUPER EQU   PSA+552                                                  00559000
PSASUP1  EQU   PSASUPER                                                 00560000
PSASUP2  EQU   PSASUPER+1                                               00561000
PSASUP3  EQU   PSASUPER+2                                               00562000
PSASUP4  EQU   PSASUPER+3                                               00563000
PSACLHT  EQU   PSA+640                                                  00564000
PSALKSA  EQU   PSA+696                                                  00565000
PSAHLHI  EQU   PSA+760                                                  00566000
PSALITA  EQU   PSA+764                                                  00567000
PSADSSFL EQU   PSA+836                                                  00568000
PSADSSF1 EQU   PSADSSFL                                                 00569000
PSADSSF3 EQU   PSADSSFL+2                                               00570000
PSADSSF4 EQU   PSADSSFL+3                                               00571000
PSARSVT  EQU   PSA+896                                                  00572000
SDWA     EQU   0                                                        00573000
SDWAPARM EQU   SDWA                                                     00574000
SDWAFIOB EQU   SDWA+4                                                   00575000
SDWAABCC EQU   SDWAFIOB                                                 00576000
SDWACMPF EQU   SDWAABCC                                                 00577000
SDWACMPC EQU   SDWAABCC+1                                               00578000
SDWACTL1 EQU   SDWA+8                                                   00579000
SDWACMKA EQU   SDWACTL1                                                 00580000
SDWAMWPA EQU   SDWACTL1+1                                               00581000
SDWAPMKA EQU   SDWACTL1+4                                               00582000
SDWACTL2 EQU   SDWA+16                                                  00583000
SDWACMKP EQU   SDWACTL2                                                 00584000
SDWAMWPP EQU   SDWACTL2+1                                               00585000
SDWAPMKP EQU   SDWACTL2+4                                               00586000
SDWAGRSV EQU   SDWA+24                                                  00587000
SDWANAME EQU   SDWA+88                                                  00588000
SDWAEC1  EQU   SDWA+104                                                 00589000
SDWAEMK1 EQU   SDWAEC1                                                  00590000
SDWAMWP1 EQU   SDWAEC1+1                                                00591000
SDWAINT1 EQU   SDWAEC1+2                                                00592000
SDWANXT1 EQU   SDWAEC1+4                                                00593000
SDWAAEC1 EQU   SDWA+112                                                 00594000
SDWAILC1 EQU   SDWAAEC1+1                                               00595000
SDWAINC1 EQU   SDWAAEC1+2                                               00596000
SDWAICD1 EQU   SDWAINC1+1                                               00597000
SDWAEC2  EQU   SDWA+120                                                 00598000
SDWAEMK2 EQU   SDWAEC2                                                  00599000
SDWAMWP2 EQU   SDWAEC2+1                                                00600000
SDWAINT2 EQU   SDWAEC2+2                                                00601000
SDWANXT2 EQU   SDWAEC2+4                                                00602000
SDWAAEC2 EQU   SDWA+128                                                 00603000
SDWAILC2 EQU   SDWAAEC2+1                                               00604000
SDWAINC2 EQU   SDWAAEC2+2                                               00605000
SDWAICD2 EQU   SDWAINC2+1                                               00606000
SDWASRSV EQU   SDWA+136                                                 00607000
SDWAIDNT EQU   SDWA+200                                                 00608000
SDWAMCH  EQU   SDWA+204                                                 00609000
SDWASTCK EQU   SDWAMCH                                                  00610000
SDWAMCHI EQU   SDWAMCH+8                                                00611000
SDWAMCHS EQU   SDWAMCHI                                                 00612000
SDWAMCHD EQU   SDWAMCHI+1                                               00613000
SDWARSR1 EQU   SDWAMCH+12                                               00614000
SDWARSR2 EQU   SDWAMCH+13                                               00615000
SDWAFLGS EQU   SDWA+232                                                 00616000
SDWAERRA EQU   SDWAFLGS                                                 00617000
SDWAPCHK EQU   SDWAERRA                                                 00618000
SDWAERRB EQU   SDWAFLGS+1                                               00619000
SDWAERRC EQU   SDWAFLGS+2                                               00620000
SDWAERRD EQU   SDWAFLGS+3                                               00621000
SDWAIOFS EQU   SDWA+238                                                 00622000
SDWARTYA EQU   SDWA+240                                                 00623000
SDWACPUA EQU   SDWA+248                                                 00624000
SDWAPARQ EQU   SDWA+252                                                 00625000
SDWARCDE EQU   SDWAPARQ                                                 00626000
SDWAACF2 EQU   SDWAPARQ+1                                               00627000
SDWAACF3 EQU   SDWAPARQ+2                                               00628000
SDWAACF4 EQU   SDWAPARQ+3                                               00629000
SDWALKWA EQU   SDWA+256                                                 00630000
SDWALKWS EQU   SDWALKWA                                                 00631000
SDWARECP EQU   SDWA+292                                                 00632000
SDWASNPA EQU   SDWA+320                                                 00633000
SDWADUMP EQU   SDWASNPA                                                 00634000
SDWADPFS EQU   SDWADUMP+1                                               00635000
SDWADDAT EQU   SDWASNPA+4                                               00636000
SDWASDAT EQU   SDWADDAT                                                 00637000
SDWAPDAT EQU   SDWADDAT+2                                               00638000
SDWADPSA EQU   SDWA+328                                                 00639000
SDWADPSL EQU   SDWADPSA                                                 00640000
SDWARA   EQU   SDWA+400                                                 00641000
SDWADPVA EQU   SDWARA+2                                                 00642000
CVTMAP   EQU   0                                                        00643000
CVTTCBP  EQU   CVTMAP                                                   00644000
CVTDAR   EQU   CVTMAP+72                                                00645000
CVTFLGS1 EQU   CVTDAR                                                   00646000
CVTDCB   EQU   CVTMAP+116                                               00647000
CVTIERLC EQU   CVTMAP+144                                               00648000
CVTOPTA  EQU   CVTMAP+182                                               00649000
CVTOPTB  EQU   CVTMAP+183                                               00650000
CVTABEND EQU   CVTMAP+200                                               00651000
CVTGTF   EQU   CVTMAP+236                                               00652000
CVTGTFST EQU   CVTGTF                                                   00653000
CVTGTFS  EQU   CVTGTFST                                                 00654000
CVTSTATE EQU   CVTGTFST                                                 00655000
CVTTMODE EQU   CVTGTFST                                                 00656000
CVTFORM  EQU   CVTGTFST                                                 00657000
CVTAQAVT EQU   CVTMAP+240                                               00658000
CVTTCMFG EQU   CVTAQAVT                                                 00659000
CVTVOLM2 EQU   CVTMAP+244                                               00660000
CVTTATA  EQU   CVTVOLM2                                                 00661000
CVTTSKS  EQU   CVTTATA                                                  00662000
CVTVOLF2 EQU   CVTTSKS                                                  00663000
CVTTAT   EQU   CVTTATA+1                                                00664000
CVTATER  EQU   CVTMAP+248                                               00665000
CVTEXT1  EQU   CVTMAP+252                                               00666000
CVTPURG  EQU   CVTMAP+260                                               00667000
CVTQMSG  EQU   CVTMAP+268                                               00668000
CVTDMSR  EQU   CVTMAP+272                                               00669000
CVTRSV37 EQU   CVTDMSR                                                  00670000
CVTDMSRF EQU   CVTRSV37                                                 00671000
CVTERPV  EQU   CVTMAP+316                                               00672000
CVTINTLA EQU   CVTMAP+320                                               00673000
CVTAPF   EQU   CVTMAP+324                                               00674000
CVTEXT2  EQU   CVTMAP+328                                               00675000
CVTHJES  EQU   CVTMAP+332                                               00676000
CVTPGSIA EQU   CVTMAP+348                                               00677000
CVTA1F1  EQU   CVTMAP+356                                               00678000
CVTSYSK  EQU   CVTMAP+357                                               00679000
CVTVOLM1 EQU   CVTMAP+380                                               00680000
CVTVOLF1 EQU   CVTVOLM1                                                 00681000
CVTXTNT1 EQU   0                                                        00682000
CVTXTNT2 EQU   0                                                        00683000
CVTDSSV  EQU   CVTXTNT2                                                 00684000
CVTFLGBT EQU   CVTXTNT2+5                                               00685000
CVTQID   EQU   CVTXTNT2+24                                              00686000
CVTRV400 EQU   CVTXTNT2+52                                              00687000
CVTRV409 EQU   CVTXTNT2+53                                              00688000
CVTATCVT EQU   CVTXTNT2+64                                              00689000
CVTRV429 EQU   CVTXTNT2+84                                              00690000
CVTRV438 EQU   CVTXTNT2+85                                              00691000
CVTRV457 EQU   CVTXTNT2+112                                             00692000
CVTRV466 EQU   CVTXTNT2+113                                             00693000
CVTFIX   EQU   0                                                        00694000
CVTRELNO EQU   CVTFIX+252                                               00695000
WSAG     EQU   0                                                        00696000
WSAGGMFM EQU   WSAG+4                                                   00697000
ASCB     EQU   0                                                        00698000
ASCBSUPC EQU   ASCB+16                                                  00699000
ASCBASID EQU   ASCB+36                                                  00700000
ASCBTSB  EQU   ASCB+60                                                  00701000
ASCBFW1  EQU   ASCB+100                                                 00702000
ASCBRCTF EQU   ASCBFW1+2                                                00703000
ASCBFLG1 EQU   ASCBFW1+3                                                00704000
ASCBDSP1 EQU   ASCB+114                                                 00705000
ASCBFLG2 EQU   ASCB+115                                                 00706000
ASCBLKGP EQU   ASCB+128                                                 00707000
ASCBSRQ  EQU   ASCB+180                                                 00708000
ASCBSRQ1 EQU   ASCBSRQ                                                  00709000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00710000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00711000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00712000
TSB      EQU   0                                                        00713000
TSBASCBA EQU   TSB                                                      00714000
TSBSTAT  EQU   TSBASCBA                                                 00715000
TSBFLG1  EQU   TSB+4                                                    00716000
TSBOWIP  EQU   TSBFLG1                                                  00717000
TSBWOWIP EQU   TSBFLG1                                                  00718000
TSBWTCB  EQU   TSB+5                                                    00719000
TSBFLG2  EQU   TSB+16                                                   00720000
TSBFLG3  EQU   TSB+24                                                   00721000
TSBFLG5  EQU   TSB+25                                                   00722000
TSBTERMC EQU   TSB+26                                                   00723000
TSBTERM1 EQU   TSBTERMC                                                 00724000
TSBTERM2 EQU   TSBTERMC+1                                               00725000
TSBWTJID EQU   TSB+32                                                   00726000
TSBSTCC  EQU   TSB+34                                                   00727000
TSBFLG4  EQU   TSB+41                                                   00728000
TSBCANC  EQU   TSBFLG4                                                  00729000
TSBCTCB  EQU   TSB+60                                                   00730000
TSBRCB   EQU   TSB+64                                                   00731000
TSBLINKA EQU   TSBRCB+4                                                 00732000
TSBTPOST EQU   TSB+72                                                   00733000
TSBTPFLG EQU   TSBTPOST                                                 00734000
TSBMINL  EQU   TSB+84                                                   00735000
TSBEXTNT EQU   TSB+96                                                   00736000
TSBX     EQU   0                                                        00737000
TSBXFLG1 EQU   TSBX+32                                                  00738000
TSBXTIM  EQU   TSBX+40                                                  00739000
TSBXTOM  EQU   TSBX+44                                                  00740000
TSBXCSAP EQU   TSBX+60                                                  00741000
TSBXTERM EQU   TSBX+72                                                  00742000
ASVT     EQU   0                                                        00743000
ASVTFRST EQU   ASVT+524                                                 00744000
ASVTENTY EQU   ASVT+528                                                 00745000
ASVTAVAL EQU   ASVTENTY                                                 00746000
SCVTSECT EQU   0                                                        00747000
SCVTSTAT EQU   SCVTSECT+148                                             00748000
RBPRFX   EQU   0                                                        00749000
RBBASIC  EQU   0                                                        00750000
RBEXRTNM EQU   RBBASIC                                                  00751000
RBTMFLD  EQU   RBEXRTNM                                                 00752000
RBSTAB   EQU   RBBASIC+10                                               00753000
XSTAB    EQU   RBSTAB                                                   00754000
RBSTAB1  EQU   XSTAB                                                    00755000
XSTAB1   EQU   RBSTAB1                                                  00756000
RBFTCKPT EQU   XSTAB1                                                   00757000
RBSTAB2  EQU   XSTAB+1                                                  00758000
XSTAB2   EQU   RBSTAB2                                                  00759000
RBTCBNXT EQU   XSTAB2                                                   00760000
RBFACTV  EQU   XSTAB2                                                   00761000
RBFDYN   EQU   XSTAB2                                                   00762000
RBECBWT  EQU   XSTAB2                                                   00763000
RBOPSW   EQU   RBBASIC+16                                               00764000
XRBPSW   EQU   RBOPSW                                                   00765000
RBOPSWB2 EQU   XRBPSW+1                                                 00766000
RBLINK   EQU   RBBASIC+28                                               00767000
XRBLNK   EQU   RBLINK                                                   00768000
RBWCF    EQU   XRBLNK                                                   00769000
RBLINKB  EQU   XRBLNK+1                                                 00770000
RBGRSAVE EQU   RBBASIC+32                                               00771000
XRBREG   EQU   RBGRSAVE                                                 00772000
RBGRS0   EQU   XRBREG                                                   00773000
RBGRS1   EQU   XRBREG+4                                                 00774000
RBGRS2   EQU   XRBREG+8                                                 00775000
RBGRS3   EQU   XRBREG+12                                                00776000
RBGRS4   EQU   XRBREG+16                                                00777000
RBGRS5   EQU   XRBREG+20                                                00778000
RBGRS6   EQU   XRBREG+24                                                00779000
RBGRS7   EQU   XRBREG+28                                                00780000
RBGRS8   EQU   XRBREG+32                                                00781000
RBGRS9   EQU   XRBREG+36                                                00782000
RBGRS10  EQU   XRBREG+40                                                00783000
RBGRS11  EQU   XRBREG+44                                                00784000
RBGRS12  EQU   XRBREG+48                                                00785000
RBGRS13  EQU   XRBREG+52                                                00786000
RBGRS14  EQU   XRBREG+56                                                00787000
RBGRS15  EQU   XRBREG+60                                                00788000
XRBESA   EQU   RBBASIC+96                                               00789000
RBEXSAVE EQU   XRBESA                                                   00790000
RBPREFIX EQU   0                                                        00791000
RBRSV019 EQU   RBPREFIX+14                                              00792000
RBRSV028 EQU   RBPREFIX+15                                              00793000
RBRSV041 EQU   RBPREFIX+27                                              00794000
RBRSV054 EQU   RBPREFIX+39                                              00795000
RBRTOPSW EQU   RBPREFIX+40                                              00796000
RBRTPSW2 EQU   RBRTOPSW+8                                               00797000
RBRTICIL EQU   RBRTPSW2                                                 00798000
RBFLAGS1 EQU   RBPREFIX+56                                              00799000
RBINTCDA EQU   RBPREFIX+61                                              00800000
RBSECT   EQU   0                                                        00801000
RBPPSAV  EQU   RBSECT                                                   00802000
@NM00110 EQU   RBSECT+10                                                00803000
@NM00111 EQU   @NM00110                                                 00804000
RBTRSVRB EQU   @NM00111                                                 00805000
@NM00113 EQU   @NM00110+1                                               00806000
RBETXR   EQU   @NM00113                                                 00807000
RBEP     EQU   RBSECT+12                                                00808000
RBPGMQ   EQU   RBSECT+24                                                00809000
@NM00120 EQU   RBSECT+28                                                00810000
@NM00121 EQU   @NM00120                                                 00811000
IRBEND   EQU   RBSECT+96                                                00812000
@NM00124 EQU   RBSECT+96                                                00813000
RBRSV138 EQU   @NM00124+7                                               00814000
RBSCBB   EQU   RBSECT+144                                               00815000
RBSPARM  EQU   RBSCBB+8                                                 00816000
RBSFLGS1 EQU   RBSPARM                                                  00817000
RBSIOPRC EQU   RBSFLGS1                                                 00818000
RBSOWNR  EQU   RBSCBB+12                                                00819000
RBSFLGS2 EQU   RBSOWNR                                                  00820000
RBSDATA  EQU   RBSCBB+16                                                00821000
RBSFLG3  EQU   RBSDATA                                                  00822000
RBRSV150 EQU   RBSECT+167                                               00823000
SRBSECT  EQU   0                                                        00824000
SRBFLC   EQU   SRBSECT+12                                               00825000
TVCS     EQU   0                                                        00826000
TVCSECB  EQU   TVCS+96                                                  00827000
TVCSGMSZ EQU   TVCS+102                                                 00828000
TVCSOPTN EQU   TVCS+104                                                 00829000
TVCSSRBA EQU   TVCS+105                                                 00830000
TVCSINDS EQU   TVCS+112                                                 00831000
TVCSTGRC EQU   TVCSINDS                                                 00832000
ESTAESA  EQU   12                                                       00833000
STATUS   EQU   0                                                        00834000
CURNTTCB EQU   4                                                        00835000
CVTPTR   EQU   FLCCVT                                                   00836000
CVTS01   EQU   CVTPGSIA                                                 00837000
CVTLPDIA EQU   CVTS01+12                                                00838000
CVTDIRST EQU   CVTLPDIA                                                 00839000
CVTSLIDA EQU   CVTS01+24                                                00840000
CVTCTLFG EQU   CVTS01+50                                                00841000
CVTASVT  EQU   CVTS01+208                                               00842000
CVTGLMN  EQU   CVTS01+332                                               00843000
CVTSPSA  EQU   CVTS01+336                                               00844000
CVTSPOST EQU   CVTS01+364                                               00845000
CVTRV210 EQU   CVTS01+424                                               00846000
CVTRV219 EQU   CVTS01+425                                               00847000
CVTRV228 EQU   CVTS01+426                                               00848000
CVTRV237 EQU   CVTS01+427                                               00849000
CVTMFRTR EQU   CVTS01+452                                               00850000
CVTRV262 EQU   CVTS01+468                                               00851000
CVTRV271 EQU   CVTS01+469                                               00852000
CVTRV280 EQU   CVTS01+470                                               00853000
CVTRV289 EQU   CVTS01+471                                               00854000
CVTGSDA  EQU   CVTS01+600                                               00855000
CVTTCASP EQU   CVTS01+664                                               00856000
ASCBPTR  EQU   PSAAOLD                                                  00857000
ASVTPTR  EQU   CVTASVT                                                  00858000
SCVTSPTR EQU   CVTABEND                                                 00859000
RBSECS03 EQU   RBEP                                                     00860000
RBCDE    EQU   RBSECS03                                                 00861000
RBCDFLGS EQU   RBCDE                                                    00862000
RBSECS05 EQU   RBPGMQ                                                   00863000
RBSQE    EQU   RBSECS05                                                 00864000
RBSECS06 EQU   RBPGMQ                                                   00865000
RBIQE    EQU   RBSECS06                                                 00866000
RBSECS07 EQU   RBPGMQ                                                   00867000
RBIQE2   EQU   RBSECS07                                                 00868000
RBSECS08 EQU   IRBEND                                                   00869000
RBSECS09 EQU   IRBEND                                                   00870000
SRBPTR   EQU   TVCSSRBA                                                 00871000
SRB      EQU   SRBSECT                                                  00872000
FLC      EQU   PSA                                                      00873000
PSARSVTE EQU   PSARSVT                                                  00874000
XSA      EQU   RBEXSAVE                                                 00875000
XSAPRM0  EQU   XSA                                                      00876000
XSAASID  EQU   XSAPRM0                                                  00877000
XSAPRM1  EQU   XSA+4                                                    00878000
XSAOPTNS EQU   XSAPRM1                                                  00879000
XSAPTGT  EQU   XSAOPTNS                                                 00880000
XSAWD3   EQU   XSA+8                                                    00881000
XSAFLAG  EQU   XSAWD3                                                   00882000
XSAIDENQ EQU   XSAFLAG                                                  00883000
XSADMOVE EQU   XSAFLAG                                                  00884000
XSAWD4   EQU   XSA+12                                                   00885000
XSASAVEA EQU   XSAWD4                                                   00886000
XSAENQAD EQU   XSA+16                                                   00887000
XSAWD5   EQU   XSAENQAD                                                 00888000
XSAWD8   EQU   XSA+28                                                   00889000
XSASAVEB EQU   XSAWD8                                                   00890000
XSAUSERP EQU   XSA+32                                                   00891000
XSARETG  EQU   XSA+36                                                   00892000
XSAWD11  EQU   XSA+40                                                   00893000
XSARC    EQU   XSAWD11                                                  00894000
XSAWD12  EQU   XSA+44                                                   00895000
XSASCHED EQU   XSAWD12                                                  00896000
XSATVCSP EQU   XSAWD12+1                                                00897000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00898000
XSAIDAS  EQU   XSAWD11+2                                                00899000
@NM00155 EQU   XSAWD11+1                                                00900000
XSAWD10  EQU   XSARETG                                                  00901000
XSAWD9   EQU   XSAUSERP                                                 00902000
XSAWD7   EQU   XSAENQAD+8                                               00903000
XSAWD6   EQU   XSAENQAD+4                                               00904000
XSATCBA  EQU   XSAWD3+1                                                 00905000
XSARETY  EQU   XSAFLAG                                                  00906000
XSAAUTH  EQU   XSAFLAG                                                  00907000
XSALOCKS EQU   XSAFLAG                                                  00908000
XSADATVF EQU   XSAFLAG                                                  00909000
XSADOSWT EQU   XSAFLAG                                                  00910000
XSATCBFX EQU   XSAFLAG                                                  00911000
XSABFRAD EQU   XSAPRM1+1                                                00912000
XSAEDITO EQU   XSAOPTNS                                                 00913000
XSABRK   EQU   XSAOPTNS                                                 00914000
XSAHOLD  EQU   XSAOPTNS                                                 00915000
XSANOWT  EQU   XSAOPTNS                                                 00916000
XSAPRIOR EQU   XSAOPTNS                                                 00917000
XSAUSRID EQU   XSAOPTNS                                                 00918000
XSAPRMSZ EQU   XSAPRM0+2                                                00919000
PSARSAV  EQU   PSARSVTE+60                                              00920000
PSARSTK  EQU   PSARSVTE+56                                              00921000
PSAESAV3 EQU   PSARSVTE+52                                              00922000
PSAESTK3 EQU   PSARSVTE+48                                              00923000
PSAESAV2 EQU   PSARSVTE+44                                              00924000
PSAESTK2 EQU   PSARSVTE+40                                              00925000
PSAESAV1 EQU   PSARSVTE+36                                              00926000
PSAESTK1 EQU   PSARSVTE+32                                              00927000
PSAPSAV  EQU   PSARSVTE+28                                              00928000
PSAPSTK  EQU   PSARSVTE+24                                              00929000
PSAMSAV  EQU   PSARSVTE+20                                              00930000
PSAMSTK  EQU   PSARSVTE+16                                              00931000
PSASSAV  EQU   PSARSVTE+12                                              00932000
PSASSTK  EQU   PSARSVTE+8                                               00933000
PSANSTK  EQU   PSARSVTE+4                                               00934000
PSACSTK  EQU   PSARSVTE                                                 00935000
RBRSV161 EQU   RBSECS09+64                                              00936000
RBSIRBWA EQU   RBSECS09                                                 00937000
RBIQEWRK EQU   RBSECS08+4                                               00938000
RBNEXAV  EQU   RBSECS08                                                 00939000
RBIQEA   EQU   RBIQE2                                                   00940000
RBIQE1   EQU   RBIQE+1                                                  00941000
RBUSE    EQU   RBIQE                                                    00942000
RBSQEA   EQU   RBSQE+1                                                  00943000
@NM00125 EQU   RBSQE                                                    00944000
RBCDE1   EQU   RBCDE+1                                                  00945000
RBCDLOAD EQU   RBCDFLGS                                                 00946000
RBCDXCTL EQU   RBCDFLGS                                                 00947000
RBCDSYNC EQU   RBCDFLGS                                                 00948000
RBCDNODE EQU   RBCDFLGS                                                 00949000
RBRSV010 EQU   RBCDFLGS                                                 00950000
RBCDATCH EQU   RBCDFLGS                                                 00951000
RBRSV009 EQU   RBCDFLGS                                                 00952000
RBNOCELL EQU   RBCDFLGS                                                 00953000
CVTRV628 EQU   CVTS01+728                                               00954000
CVTRV627 EQU   CVTS01+724                                               00955000
CVTRV626 EQU   CVTS01+720                                               00956000
CVTRV625 EQU   CVTS01+716                                               00957000
CVTRV624 EQU   CVTS01+712                                               00958000
CVTRV623 EQU   CVTS01+708                                               00959000
CVTRV622 EQU   CVTS01+704                                               00960000
CVTRV621 EQU   CVTS01+700                                               00961000
CVTIHASU EQU   CVTS01+696                                               00962000
CVTSUSP  EQU   CVTS01+692                                               00963000
CVTT6SVC EQU   CVTS01+688                                               00964000
CVTCDAL  EQU   CVTS01+684                                               00965000
CVTTCTL  EQU   CVTS01+680                                               00966000
CVTRSUME EQU   CVTS01+676                                               00967000
CVTJTERM EQU   CVTS01+672                                               00968000
CVTASMRM EQU   CVTS01+668                                               00969000
CVT0PT03 EQU   CVTS01+660                                               00970000
CVT0PT0E EQU   CVTS01+656                                               00971000
CVTRV609 EQU   CVTS01+652                                               00972000
CVTCGK   EQU   CVTS01+648                                               00973000
CVTRAC   EQU   CVTS01+644                                               00974000
CVTRV606 EQU   CVTS01+640                                               00975000
CVTRV605 EQU   CVTS01+636                                               00976000
CVTRV604 EQU   CVTS01+632                                               00977000
CVTEFF02 EQU   CVTS01+628                                               00978000
CVTCBBR  EQU   CVTS01+624                                               00979000
CVTSSCR  EQU   CVTS01+620                                               00980000
CVTEVENT EQU   CVTS01+616                                               00981000
CVTCRCA  EQU   CVTS01+612                                               00982000
CVTTPIO  EQU   CVTS01+608                                               00983000
CVTADV   EQU   CVTS01+604                                               00984000
CVTGSDAB EQU   CVTGSDA                                                  00985000
CVTQV3   EQU   CVTS01+596                                               00986000
CVTQV2   EQU   CVTS01+592                                               00987000
CVTQV1   EQU   CVTS01+588                                               00988000
CVTRPT   EQU   CVTS01+584                                               00989000
CVTSSRB  EQU   CVTS01+580                                               00990000
CVTCSDRL EQU   CVTS01+576                                               00991000
CVTEXP1  EQU   CVTS01+572                                               00992000
CVTRMPMT EQU   CVTS01+568                                               00993000
CVTRMPTT EQU   CVTS01+564                                               00994000
CVTVPSA  EQU   CVTS01+560                                               00995000
CVTVSTOP EQU   CVTS01+556                                               00996000
CVTGTFR8 EQU   CVTS01+552                                               00997000
CVTQUIT  EQU   CVTS01+548                                               00998000
CVTVACR  EQU   CVTS01+544                                               00999000
CVTWTCB  EQU   CVTS01+540                                               01000000
CVTSTPRS EQU   CVTS01+536                                               01001000
CVT0PT02 EQU   CVTS01+532                                               01002000
CVTDARCM EQU   CVTS01+528                                               01003000
CVTIRECM EQU   CVTS01+524                                               01004000
CVTJRECM EQU   CVTS01+520                                               01005000
CVTVEMS0 EQU   CVTS01+516                                               01006000
CVTSPFRR EQU   CVTS01+512                                               01007000
CVTRLSTG EQU   CVTS01+508                                               01008000
CVT0TC0A EQU   CVTS01+504                                               01009000
CVTGMBR  EQU   CVTS01+500                                               01010000
CVTLFRM  EQU   CVTS01+496                                               01011000
CVTRMBR  EQU   CVTS01+492                                               01012000
CVTVIOP  EQU   CVTS01+488                                               01013000
CVTRV307 EQU   CVTS01+486                                               01014000
CVTRV306 EQU   CVTS01+484                                               01015000
CVTRV305 EQU   CVTS01+482                                               01016000
CVTRV304 EQU   CVTS01+480                                               01017000
CVTRV303 EQU   CVTS01+478                                               01018000
CVTRV302 EQU   CVTS01+476                                               01019000
CVTTRCA  EQU   CVTS01+472                                               01020000
CVTRV297 EQU   CVTRV289                                                 01021000
CVTRV296 EQU   CVTRV289                                                 01022000
CVTRV295 EQU   CVTRV289                                                 01023000
CVTRV294 EQU   CVTRV289                                                 01024000
CVTRV293 EQU   CVTRV289                                                 01025000
CVTRV292 EQU   CVTRV289                                                 01026000
CVTRV291 EQU   CVTRV289                                                 01027000
CVTRV290 EQU   CVTRV289                                                 01028000
CVTRV288 EQU   CVTRV280                                                 01029000
CVTRV287 EQU   CVTRV280                                                 01030000
CVTRV286 EQU   CVTRV280                                                 01031000
CVTRV285 EQU   CVTRV280                                                 01032000
CVTRV284 EQU   CVTRV280                                                 01033000
CVTRV283 EQU   CVTRV280                                                 01034000
CVTRV282 EQU   CVTRV280                                                 01035000
CVTRV281 EQU   CVTRV280                                                 01036000
CVTRV279 EQU   CVTRV271                                                 01037000
CVTRV278 EQU   CVTRV271                                                 01038000
CVTRV277 EQU   CVTRV271                                                 01039000
CVTRV276 EQU   CVTRV271                                                 01040000
CVTRV275 EQU   CVTRV271                                                 01041000
CVTRV274 EQU   CVTRV271                                                 01042000
CVTRV273 EQU   CVTRV271                                                 01043000
CVTRV272 EQU   CVTRV271                                                 01044000
CVTRV270 EQU   CVTRV262                                                 01045000
CVTRV269 EQU   CVTRV262                                                 01046000
CVTRV268 EQU   CVTRV262                                                 01047000
CVTRV267 EQU   CVTRV262                                                 01048000
CVTRV266 EQU   CVTRV262                                                 01049000
CVTRV265 EQU   CVTRV262                                                 01050000
CVTRV264 EQU   CVTRV262                                                 01051000
CVTRV263 EQU   CVTRV262                                                 01052000
CVTVFP   EQU   CVTS01+464                                               01053000
CVTVSI   EQU   CVTS01+460                                               01054000
CVTVPSIB EQU   CVTS01+456                                               01055000
CVTMFACT EQU   CVTMFRTR                                                 01056000
CVTMFCTL EQU   CVTS01+448                                               01057000
CVTPVBP  EQU   CVTS01+444                                               01058000
CVTPWI   EQU   CVTS01+440                                               01059000
CVTRV254 EQU   CVTS01+438                                               01060000
CVTRV253 EQU   CVTS01+436                                               01061000
CVTRV252 EQU   CVTS01+434                                               01062000
CVTRV251 EQU   CVTS01+433                                               01063000
CVTRV250 EQU   CVTS01+432                                               01064000
CVTRV249 EQU   CVTS01+431                                               01065000
CVTRV248 EQU   CVTS01+430                                               01066000
CVTRV247 EQU   CVTS01+429                                               01067000
CVTRV246 EQU   CVTS01+428                                               01068000
CVTRV245 EQU   CVTRV237                                                 01069000
CVTRV244 EQU   CVTRV237                                                 01070000
CVTRV243 EQU   CVTRV237                                                 01071000
CVTRV242 EQU   CVTRV237                                                 01072000
CVTRV241 EQU   CVTRV237                                                 01073000
CVTRV240 EQU   CVTRV237                                                 01074000
CVTRV239 EQU   CVTRV237                                                 01075000
CVTRV238 EQU   CVTRV237                                                 01076000
CVTRV236 EQU   CVTRV228                                                 01077000
CVTRV235 EQU   CVTRV228                                                 01078000
CVTRV234 EQU   CVTRV228                                                 01079000
CVTRV233 EQU   CVTRV228                                                 01080000
CVTRV232 EQU   CVTRV228                                                 01081000
CVTRV231 EQU   CVTRV228                                                 01082000
CVTRV230 EQU   CVTRV228                                                 01083000
CVTRV229 EQU   CVTRV228                                                 01084000
CVTRV227 EQU   CVTRV219                                                 01085000
CVTRV226 EQU   CVTRV219                                                 01086000
CVTRV225 EQU   CVTRV219                                                 01087000
CVTRV224 EQU   CVTRV219                                                 01088000
CVTRV223 EQU   CVTRV219                                                 01089000
CVTRV222 EQU   CVTRV219                                                 01090000
CVTRV221 EQU   CVTRV219                                                 01091000
CVTRV220 EQU   CVTRV219                                                 01092000
CVTRV218 EQU   CVTRV210                                                 01093000
CVTRV217 EQU   CVTRV210                                                 01094000
CVTRV216 EQU   CVTRV210                                                 01095000
CVTRV215 EQU   CVTRV210                                                 01096000
CVTRV214 EQU   CVTRV210                                                 01097000
CVTRV213 EQU   CVTRV210                                                 01098000
CVTRV212 EQU   CVTRV210                                                 01099000
CVTRV211 EQU   CVTRV210                                                 01100000
CVTLCCAT EQU   CVTS01+420                                               01101000
CVTPCCAT EQU   CVTS01+416                                               01102000
CVTIPCRP EQU   CVTS01+412                                               01103000
CVTIPCRI EQU   CVTS01+408                                               01104000
CVTIPCDS EQU   CVTS01+404                                               01105000
CVTAIDVT EQU   CVTS01+400                                               01106000
CVTSSAP  EQU   CVTS01+396                                               01107000
CVTEHCIR EQU   CVTS01+392                                               01108000
CVTEHDEF EQU   CVTS01+388                                               01109000
CVTDAIR  EQU   CVTS01+384                                               01110000
CVTPERFM EQU   CVTS01+380                                               01111000
CVT044R2 EQU   CVTS01+376                                               01112000
CVTFETCH EQU   CVTS01+372                                               01113000
CVTRSTWD EQU   CVTS01+368                                               01114000
CVTIOBP  EQU   CVTS01+360                                               01115000
CVTASMVT EQU   CVTS01+356                                               01116000
CVTRECRQ EQU   CVTS01+352                                               01117000
CVTWSAC  EQU   CVTS01+348                                               01118000
CVTRV149 EQU   CVTS01+344                                               01119000
CVTWSAL  EQU   CVTS01+340                                               01120000
CVTVEAC0 EQU   CVTS01+328                                               01121000
CVT062R1 EQU   CVTS01+324                                               01122000
CVTRPOST EQU   CVTS01+320                                               01123000
CVTDQIQE EQU   CVTS01+316                                               01124000
CVTCSD   EQU   CVTS01+312                                               01125000
CVTLKRMA EQU   CVTS01+308                                               01126000
CVTRSPIE EQU   CVTS01+304                                               01127000
CVTRENQ  EQU   CVTS01+300                                               01128000
CVTLQCB  EQU   CVTS01+296                                               01129000
CVTFQCB  EQU   CVTS01+292                                               01130000
CVTQCS01 EQU   CVTS01+288                                               01131000
CVTAPFT  EQU   CVTS01+284                                               01132000
CVTPARRL EQU   CVTS01+280                                               01133000
CVTVWAIT EQU   CVTS01+276                                               01134000
CVTGSPL  EQU   CVTS01+272                                               01135000
CVTLSMQ  EQU   CVTS01+268                                               01136000
CVTGSMQ  EQU   CVTS01+264                                               01137000
CVTEXPRO EQU   CVTS01+260                                               01138000
CVTOPCTP EQU   CVTS01+256                                               01139000
CVTSIC   EQU   CVTS01+252                                               01140000
CVTTPIOS EQU   CVTS01+248                                               01141000
CVTRTMS  EQU   CVTS01+244                                               01142000
CVTSDBF  EQU   CVTS01+240                                               01143000
CVTSCBP  EQU   CVTS01+236                                               01144000
CVTSDMP  EQU   CVTS01+232                                               01145000
CVTSV60  EQU   CVTS01+228                                               01146000
CVTRTMCT EQU   CVTS01+224                                               01147000
CVTASCBL EQU   CVTS01+220                                               01148000
CVTASCBH EQU   CVTS01+216                                               01149000
CVTGDA   EQU   CVTS01+212                                               01150000
CVTVVMDI EQU   CVTS01+204                                               01151000
CVTAQTOP EQU   CVTS01+200                                               01152000
CVTIOSCS EQU   CVTS01+196                                               01153000
CVTSDRM  EQU   CVTS01+192                                               01154000
CVTOPTE  EQU   CVTS01+188                                               01155000
CVTSTXU  EQU   CVTS01+184                                               01156000
CVTQUIS  EQU   CVTS01+180                                               01157000
CVTPARS  EQU   CVTS01+176                                               01158000
CVTS1EE  EQU   CVTS01+172                                               01159000
CVTFRAS  EQU   CVTS01+168                                               01160000
CVTQSAS  EQU   CVTS01+164                                               01161000
CVTCRAS  EQU   CVTS01+160                                               01162000
CVTCRMN  EQU   CVTS01+156                                               01163000
CVTDELCP EQU   CVTS01+152                                               01164000
CVTFRECL EQU   CVTS01+148                                               01165000
CVTGETCL EQU   CVTS01+144                                               01166000
CVTBLDCP EQU   CVTS01+140                                               01167000
CVTAUTHL EQU   CVTS01+136                                               01168000
CVTSCAN  EQU   CVTS01+132                                               01169000
CVTRV144 EQU   CVTS01+130                                               01170000
CVTMAXMP EQU   CVTS01+128                                               01171000
CVTSTCK  EQU   CVTS01+124                                               01172000
CVTRV139 EQU   CVTS01+123                                               01173000
CVTDSSAC EQU   CVTS01+122                                               01174000
CVTRV513 EQU   CVTS01+121                                               01175000
CVTIOSPL EQU   CVTS01+120                                               01176000
CVTPTGT  EQU   CVTS01+116                                               01177000
CVTCSPIE EQU   CVTS01+112                                               01178000
CVTSMFEX EQU   CVTS01+108                                               01179000
CVTOLT0A EQU   CVTS01+104                                               01180000
CVTSRBRT EQU   CVTS01+100                                               01181000
CVTPUTL  EQU   CVTS01+96                                                01182000
CVTASCRL EQU   CVTS01+92                                                01183000
CVTASCRF EQU   CVTS01+88                                                01184000
CVTRV326 EQU   CVTS01+84                                                01185000
CVTRV325 EQU   CVTS01+80                                                01186000
CVTRV324 EQU   CVTS01+76                                                01187000
CVT0VL01 EQU   CVTS01+72                                                01188000
CVTSHRVM EQU   CVTS01+68                                                01189000
CVTRV332 EQU   CVTS01+64                                                01190000
CVTTAS   EQU   CVTS01+60                                                01191000
CVTRSCN  EQU   CVTS01+56                                                01192000
CVTTRAC2 EQU   CVTS01+54                                                01193000
CVTTRACE EQU   CVTS01+52                                                01194000
CVTAPG   EQU   CVTS01+51                                                01195000
CVTSDTRC EQU   CVTCTLFG                                                 01196000
CVTGTRCE EQU   CVTCTLFG                                                 01197000
CVTNOMP  EQU   CVTCTLFG                                                 01198000
CVTRSV79 EQU   CVTCTLFG                                                 01199000
CVTDSTAT EQU   CVTCTLFG                                                 01200000
CVTRSV78 EQU   CVTCTLFG                                                 01201000
CVTRV333 EQU   CVTCTLFG                                                 01202000
CVTRV323 EQU   CVTCTLFG                                                 01203000
CVTSPVLK EQU   CVTS01+49                                                01204000
CVTRSV77 EQU   CVTS01+48                                                01205000
CVTRV331 EQU   CVTS01+44                                                01206000
CVTRV330 EQU   CVTS01+40                                                01207000
CVTRV329 EQU   CVTS01+36                                                01208000
CVTRV328 EQU   CVTS01+32                                                01209000
CVTRV322 EQU   CVTS01+28                                                01210000
CVTSLID  EQU   CVTSLIDA+1                                               01211000
CVTSYLK  EQU   CVTSLIDA                                                 01212000
CVTRV321 EQU   CVTS01+20                                                01213000
CVTRV320 EQU   CVTS01+16                                                01214000
CVTLPDIR EQU   CVTLPDIA+1                                               01215000
CVTRSV69 EQU   CVTDIRST                                                 01216000
CVTRSV68 EQU   CVTDIRST                                                 01217000
CVTRSV67 EQU   CVTDIRST                                                 01218000
CVTRSV66 EQU   CVTDIRST                                                 01219000
CVTRSV65 EQU   CVTDIRST                                                 01220000
CVTRSV64 EQU   CVTDIRST                                                 01221000
CVTRSV63 EQU   CVTDIRST                                                 01222000
CVTDICOM EQU   CVTDIRST                                                 01223000
CVTPVTP  EQU   CVTS01+8                                                 01224000
CVTLPDSR EQU   CVTS01+4                                                 01225000
CVTGETL  EQU   CVTS01                                                   01226000
TVCSDATA EQU   TVCS+116                                                 01227000
@NM00154 EQU   TVCSINDS                                                 01228000
TVCSRCRC EQU   TVCSINDS                                                 01229000
TVCSASCB EQU   TVCS+108                                                 01230000
TVCSEDIT EQU   TVCSOPTN                                                 01231000
TVCSBRK  EQU   TVCSOPTN                                                 01232000
TVCSHOLD EQU   TVCSOPTN                                                 01233000
TVCSNOWT EQU   TVCSOPTN                                                 01234000
TVCSPRIO EQU   TVCSOPTN                                                 01235000
@NM00153 EQU   TVCSOPTN                                                 01236000
TVCSPTGT EQU   TVCSOPTN                                                 01237000
TVCSDASZ EQU   TVCS+100                                                 01238000
TVCSCODE EQU   TVCSECB+1                                                01239000
@NM00152 EQU   TVCSECB                                                  01240000
TVCSPOST EQU   TVCSECB                                                  01241000
TVCSWAIT EQU   TVCSECB                                                  01242000
TVCSOPRM EQU   TVCS+76                                                  01243000
TVCSPARM EQU   TVCS+72                                                  01244000
TVCSAVEA EQU   TVCS                                                     01245000
@NM00127 EQU   SRBSECT+40                                               01246000
@NM00126 EQU   SRBSECT+38                                               01247000
SRBPRIOR EQU   SRBSECT+37                                               01248000
SRBPKF   EQU   SRBSECT+36                                               01249000
SRBSAVE  EQU   SRBSECT+32                                               01250000
SRBPARM  EQU   SRBSECT+28                                               01251000
SRBRMTR  EQU   SRBSECT+24                                               01252000
SRBEP    EQU   SRBSECT+20                                               01253000
SRBPTCB  EQU   SRBFLC+4                                                 01254000
SRBPASID EQU   SRBFLC+2                                                 01255000
SRBCPAFF EQU   SRBFLC                                                   01256000
SRBASCB  EQU   SRBSECT+8                                                01257000
SRBFLNK  EQU   SRBSECT+4                                                01258000
SRBID    EQU   SRBSECT                                                  01259000
SVRBEND  EQU   RBSECT+192                                               01260000
RBFEPARM EQU   RBSECT+168                                               01261000
SIRBEND  EQU   RBSECT+168                                               01262000
RBRSV158 EQU   RBRSV150                                                 01263000
RBRSV157 EQU   RBRSV150                                                 01264000
RBRSV156 EQU   RBRSV150                                                 01265000
RBRSV155 EQU   RBRSV150                                                 01266000
RBRSV154 EQU   RBRSV150                                                 01267000
RBRSV153 EQU   RBRSV150                                                 01268000
RBRSV152 EQU   RBRSV150                                                 01269000
RBRSV151 EQU   RBRSV150                                                 01270000
RBRSV149 EQU   RBSECT+166                                               01271000
RBRSV148 EQU   RBSECT+164                                               01272000
RBRSV169 EQU   RBSDATA+3                                                01273000
RBSID    EQU   RBSDATA+2                                                01274000
RBSPKEY  EQU   RBSDATA+1                                                01275000
RBRSV168 EQU   RBSFLG3                                                  01276000
RBSTERMO EQU   RBSFLG3                                                  01277000
RBSBRNTR EQU   RBSFLG3                                                  01278000
RBSPRNTR EQU   RBSFLG3                                                  01279000
RBSCNCEL EQU   RBSFLG3                                                  01280000
RBSRECRD EQU   RBSFLG3                                                  01281000
RBSTERMI EQU   RBSFLG3                                                  01282000
RBRSV167 EQU   RBSFLG3                                                  01283000
RBSOWNRA EQU   RBSOWNR+1                                                01284000
RBSSUPER EQU   RBSFLGS2                                                 01285000
RBSKEY0  EQU   RBSFLGS2                                                 01286000
RBRSV166 EQU   RBSFLGS2                                                 01287000
RBRSV165 EQU   RBSFLGS2                                                 01288000
RBSINUSE EQU   RBSFLGS2                                                 01289000
RBRSV164 EQU   RBSFLGS2                                                 01290000
RBSXCTL2 EQU   RBSFLGS2                                                 01291000
RBRSV163 EQU   RBSFLGS2                                                 01292000
RBSPARMA EQU   RBSPARM+1                                                01293000
RBSHALT  EQU   RBSIOPRC                                                 01294000
RBSNOIOP EQU   RBSIOPRC                                                 01295000
RBSASYNC EQU   RBSFLGS1                                                 01296000
RBRSV162 EQU   RBSFLGS1                                                 01297000
RBSESTAE EQU   RBSFLGS1                                                 01298000
RBSDUMMY EQU   RBSFLGS1                                                 01299000
RBSSTAR  EQU   RBSFLGS1                                                 01300000
RBSSTAI  EQU   RBSFLGS1                                                 01301000
RBSEXIT  EQU   RBSCBB+4                                                 01302000
RBSCHAIN EQU   RBSCBB                                                   01303000
TIRBEND  EQU   @NM00124+8                                               01304000
PRBEND   EQU   @NM00124+8                                               01305000
RBRSV146 EQU   RBRSV138                                                 01306000
RBRSV145 EQU   RBRSV138                                                 01307000
RBRSV144 EQU   RBRSV138                                                 01308000
RBRSV143 EQU   RBRSV138                                                 01309000
RBRSV142 EQU   RBRSV138                                                 01310000
RBRSV141 EQU   RBRSV138                                                 01311000
RBRSV140 EQU   RBRSV138                                                 01312000
RBRSV139 EQU   RBRSV138                                                 01313000
RBRSV137 EQU   @NM00124+6                                               01314000
RBRSV136 EQU   @NM00124+4                                               01315000
RBRSV135 EQU   @NM00124                                                 01316000
@NM00123 EQU   RBSECT+32                                                01317000
@NM00122 EQU   @NM00120+1                                               01318000
RBSCF    EQU   @NM00121                                                 01319000
RBPGMQ1  EQU   RBPGMQ+1                                                 01320000
@NM00119 EQU   RBPGMQ                                                   01321000
@NM00118 EQU   RBSECT+16                                                01322000
@NM00117 EQU   @NM00113                                                 01323000
@NM00116 EQU   @NM00113                                                 01324000
RBIQETP  EQU   @NM00113                                                 01325000
RBUSIQE  EQU   RBETXR                                                   01326000
RBATTN   EQU   @NM00113                                                 01327000
@NM00115 EQU   @NM00113                                                 01328000
@NM00114 EQU   @NM00113                                                 01329000
RBPMSVRB EQU   @NM00111                                                 01330000
RBATNXIT EQU   @NM00111                                                 01331000
@NM00112 EQU   @NM00111                                                 01332000
RBWAITP  EQU   @NM00111                                                 01333000
RBFNSVRB EQU   RBTRSVRB                                                 01334000
RBFTP    EQU   @NM00111                                                 01335000
RBSIZE   EQU   RBSECT+8                                                 01336000
RBABOPSW EQU   RBSECT+4                                                 01337000
RBPPSAV1 EQU   RBPPSAV+1                                                01338000
@NM00109 EQU   RBPPSAV                                                  01339000
RBPRFXND EQU   RBPREFIX+64                                              01340000
RBINTCOD EQU   RBINTCDA+1                                               01341000
RBINLNTH EQU   RBINTCDA                                                 01342000
RBWCSA   EQU   RBPREFIX+60                                              01343000
RBRSV004 EQU   RBPREFIX+57                                              01344000
RBSSSYN  EQU   RBFLAGS1                                                 01345000
RBSCB    EQU   RBFLAGS1                                                 01346000
RBLONGWT EQU   RBFLAGS1                                                 01347000
RBASIR   EQU   RBFLAGS1                                                 01348000
RBRSV159 EQU   RBFLAGS1                                                 01349000
RBABEND  EQU   RBFLAGS1                                                 01350000
RBXWAIT  EQU   RBFLAGS1                                                 01351000
RBSLOCK  EQU   RBFLAGS1                                                 01352000
RBRTRAN  EQU   RBRTPSW2+4                                               01353000
RBRTINCD EQU   RBRTICIL+2                                               01354000
RBRTILC  EQU   RBRTICIL+1                                               01355000
RBRSV160 EQU   RBRTICIL                                                 01356000
RBRTPSW1 EQU   RBRTOPSW                                                 01357000
RBRSV062 EQU   RBRSV054                                                 01358000
RBRSV061 EQU   RBRSV054                                                 01359000
RBRSV060 EQU   RBRSV054                                                 01360000
RBRSV059 EQU   RBRSV054                                                 01361000
RBRSV058 EQU   RBRSV054                                                 01362000
RBRSV057 EQU   RBRSV054                                                 01363000
RBRSV056 EQU   RBRSV054                                                 01364000
RBRSV055 EQU   RBRSV054                                                 01365000
RBRSV053 EQU   RBPREFIX+38                                              01366000
RBRSV052 EQU   RBPREFIX+36                                              01367000
RBRSV051 EQU   RBPREFIX+32                                              01368000
RBPRFXST EQU   RBPREFIX+32                                              01369000
RBRSV050 EQU   RBPREFIX+28                                              01370000
RBRSV049 EQU   RBRSV041                                                 01371000
RBRSV048 EQU   RBRSV041                                                 01372000
RBRSV047 EQU   RBRSV041                                                 01373000
RBRSV046 EQU   RBRSV041                                                 01374000
RBRSV045 EQU   RBRSV041                                                 01375000
RBRSV044 EQU   RBRSV041                                                 01376000
RBRSV043 EQU   RBRSV041                                                 01377000
RBRSV042 EQU   RBRSV041                                                 01378000
RBRSV040 EQU   RBPREFIX+26                                              01379000
RBRSV039 EQU   RBPREFIX+24                                              01380000
RBRSV038 EQU   RBPREFIX+20                                              01381000
RBRSV037 EQU   RBPREFIX+16                                              01382000
RBRSV036 EQU   RBRSV028                                                 01383000
RBRSV035 EQU   RBRSV028                                                 01384000
RBRSV034 EQU   RBRSV028                                                 01385000
RBRSV033 EQU   RBRSV028                                                 01386000
RBRSV032 EQU   RBRSV028                                                 01387000
RBRSV031 EQU   RBRSV028                                                 01388000
RBRSV030 EQU   RBRSV028                                                 01389000
RBRSV029 EQU   RBRSV028                                                 01390000
RBRSV027 EQU   RBRSV019                                                 01391000
RBRSV026 EQU   RBRSV019                                                 01392000
RBRSV025 EQU   RBRSV019                                                 01393000
RBRSV024 EQU   RBRSV019                                                 01394000
RBRSV023 EQU   RBRSV019                                                 01395000
RBRSV022 EQU   RBRSV019                                                 01396000
RBRSV021 EQU   RBRSV019                                                 01397000
RBRSV020 EQU   RBRSV019                                                 01398000
RBRSV018 EQU   RBPREFIX+13                                              01399000
RBRSV017 EQU   RBPREFIX+12                                              01400000
RBSRV016 EQU   RBPREFIX+11                                              01401000
RBRSV015 EQU   RBPREFIX+10                                              01402000
RBRSV014 EQU   RBPREFIX+8                                               01403000
RBRSV013 EQU   RBPREFIX+4                                               01404000
RBRSV012 EQU   RBPREFIX                                                 01405000
XRBREG15 EQU   RBGRS15                                                  01406000
XRBREG14 EQU   RBGRS14                                                  01407000
XRBREG13 EQU   RBGRS13                                                  01408000
XRBREG12 EQU   RBGRS12                                                  01409000
XRBREG11 EQU   RBGRS11                                                  01410000
XRBREG10 EQU   RBGRS10                                                  01411000
XRBREG9  EQU   RBGRS9                                                   01412000
XRBREG8  EQU   RBGRS8                                                   01413000
XRBREG7  EQU   RBGRS7                                                   01414000
XRBREG6  EQU   RBGRS6                                                   01415000
XRBREG5  EQU   RBGRS5                                                   01416000
XRBREG4  EQU   RBGRS4                                                   01417000
XRBREG3  EQU   RBGRS3                                                   01418000
XRBREG2  EQU   RBGRS2                                                   01419000
XRBREG1  EQU   RBGRS1                                                   01420000
XRBREG0  EQU   RBGRS0                                                   01421000
XRBLNKA  EQU   RBLINKB                                                  01422000
XRBWT    EQU   RBWCF                                                    01423000
@NM00108 EQU   RBBASIC+24                                               01424000
RBOPSWPS EQU   RBOPSWB2                                                 01425000
@NM00107 EQU   RBOPSWB2                                                 01426000
@NM00106 EQU   XRBPSW                                                   01427000
@NM00105 EQU   RBBASIC+12                                               01428000
XRBWAIT  EQU   RBECBWT                                                  01429000
XRBFRRB  EQU   RBFDYN                                                   01430000
@NM00104 EQU   XSTAB2                                                   01431000
XRBACTV  EQU   RBFACTV                                                  01432000
XRBTCBP  EQU   RBTCBNXT                                                 01433000
@NM00103 EQU   XSTAB1                                                   01434000
XRBCKPT  EQU   RBFTCKPT                                                 01435000
@NM00102 EQU   XSTAB1                                                   01436000
@NM00101 EQU   RBBASIC+8                                                01437000
@NM00100 EQU   RBEXRTNM+1                                               01438000
RBTMIND3 EQU   RBTMFLD                                                  01439000
RBTMIND2 EQU   RBTMFLD                                                  01440000
RBTMCMP  EQU   RBTMFLD                                                  01441000
RBWLIM   EQU   RBTMFLD                                                  01442000
RBRSV005 EQU   RBTMFLD                                                  01443000
RBTMTOD  EQU   RBTMFLD                                                  01444000
RBTMQUE  EQU   RBTMFLD                                                  01445000
@NM00099 EQU   RBPRFX                                                   01446000
@NM00098 EQU   SCVTSECT+180                                             01447000
@NM00097 EQU   SCVTSECT+176                                             01448000
SCVTPIQE EQU   SCVTSECT+172                                             01449000
@NM00096 EQU   SCVTSECT+168                                             01450000
SCVTPTRM EQU   SCVTSECT+164                                             01451000
@NM00095 EQU   SCVTSECT+160                                             01452000
@NM00094 EQU   SCVTSECT+156                                             01453000
SCVTQCBR EQU   SCVTSECT+152                                             01454000
@NM00093 EQU   SCVTSECT+144                                             01455000
SCVTTQE  EQU   SCVTSECT+140                                             01456000
@NM00092 EQU   SCVTSECT+136                                             01457000
SCVTSVCT EQU   SCVTSECT+132                                             01458000
@NM00091 EQU   SCVTSECT+128                                             01459000
@NM00090 EQU   SCVTSECT+124                                             01460000
SCVTRXLQ EQU   SCVTSECT+120                                             01461000
@NM00089 EQU   SCVTSECT+116                                             01462000
SCVTCTCB EQU   SCVTSECT+112                                             01463000
@NM00088 EQU   SCVTSECT+108                                             01464000
@NM00087 EQU   SCVTSECT+104                                             01465000
@NM00086 EQU   SCVTSECT+100                                             01466000
@NM00085 EQU   SCVTSECT+96                                              01467000
SCVTCOMM EQU   SCVTSECT+92                                              01468000
@NM00084 EQU   SCVTSECT+88                                              01469000
@NM00083 EQU   SCVTSECT+84                                              01470000
@NM00082 EQU   SCVTSECT+80                                              01471000
@NM00081 EQU   SCVTSECT+76                                              01472000
@NM00080 EQU   SCVTSECT+72                                              01473000
SCVTGMBR EQU   SCVTSECT+68                                              01474000
SCVTRPTR EQU   SCVTSECT+64                                              01475000
SCVTHSKP EQU   SCVTSECT+60                                              01476000
@NM00079 EQU   SCVTSECT+56                                              01477000
@NM00078 EQU   SCVTSECT+52                                              01478000
SCVTLFRM EQU   SCVTSECT+48                                              01479000
SCVTCDCL EQU   SCVTSECT+44                                              01480000
@NM00077 EQU   SCVTSECT+40                                              01481000
SCVTRACE EQU   SCVTSECT+36                                              01482000
@NM00076 EQU   SCVTSECT+32                                              01483000
SCVTRMBR EQU   SCVTSECT+28                                              01484000
@NM00075 EQU   SCVTSECT+24                                              01485000
@NM00074 EQU   SCVTSECT+20                                              01486000
@NM00073 EQU   SCVTSECT+16                                              01487000
@NM00072 EQU   SCVTSECT+14                                              01488000
SCVTBR14 EQU   SCVTSECT+12                                              01489000
SCVTSPET EQU   SCVTSECT+8                                               01490000
SCVTPGWR EQU   SCVTSECT+4                                               01491000
SCVTPGTM EQU   SCVTSECT                                                 01492000
ASVTEND  EQU   ASVT+528                                                 01493000
ASVTAVAI EQU   ASVTFRST                                                 01494000
ASVTRS00 EQU   ASVT+520                                                 01495000
ASVTMAXU EQU   ASVT+516                                                 01496000
ASVTASVT EQU   ASVT+512                                                 01497000
ASVTBEGN EQU   ASVT+512                                                 01498000
@NM00071 EQU   ASVT                                                     01499000
TSBXEND  EQU   TSBX+128                                                 01500000
@NM00070 EQU   TSBX+124                                                 01501000
TSBXDMMO EQU   TSBX+120                                                 01502000
TSBXDMMI EQU   TSBX+116                                                 01503000
TSBXBIND EQU   TSBX+80                                                  01504000
TSBXRPL  EQU   TSBX+76                                                  01505000
TSBXTMBF EQU   TSBXTERM+2                                               01506000
TSBXSUBT EQU   TSBXTERM+1                                               01507000
TSBXTMTP EQU   TSBXTERM                                                 01508000
TSBXAIND EQU   TSBX+70                                                  01509000
TSBXRSZO EQU   TSBX+69                                                  01510000
TSBXRSZI EQU   TSBX+68                                                  01511000
TSBXLBUF EQU   TSBX+64                                                  01512000
TSBXSRB  EQU   TSBX+56                                                  01513000
TSBXSRBI EQU   TSBX+52                                                  01514000
@NM00069 EQU   TSBX+48                                                  01515000
TSBXDPMO EQU   TSBXTOM                                                  01516000
TSBXDPMI EQU   TSBXTIM                                                  01517000
TSBXTVWA EQU   TSBX+36                                                  01518000
TSBXFLG4 EQU   TSBX+35                                                  01519000
TSBXFLG3 EQU   TSBX+34                                                  01520000
TSBXFLG2 EQU   TSBX+33                                                  01521000
@NM00068 EQU   TSBXFLG1                                                 01522000
TSBXNOSW EQU   TSBXFLG1                                                 01523000
TSBXWREC EQU   TSBXFLG1                                                 01524000
TSBXLOGF EQU   TSBXFLG1                                                 01525000
TSBXACTV EQU   TSBXFLG1                                                 01526000
TSBXASCI EQU   TSBXFLG1                                                 01527000
TSBXUID  EQU   TSBX+24                                                  01528000
@NM00067 EQU   TSBX+16                                                  01529000
@NM00066 EQU   TSBX+12                                                  01530000
TSBXECB  EQU   TSBX+8                                                   01531000
TSBXBCK  EQU   TSBX+4                                                   01532000
TSBXFWD  EQU   TSBX                                                     01533000
TSBEND   EQU   TSB+120                                                  01534000
TSBSF1   EQU   TSB+112                                                  01535000
TSBTRMID EQU   TSB+104                                                  01536000
TSBALTC  EQU   TSB+103                                                  01537000
TSBALTR  EQU   TSB+102                                                  01538000
TSBPRMC  EQU   TSB+101                                                  01539000
TSBPRMR  EQU   TSB+100                                                  01540000
TSBPSWD  EQU   TSB+88                                                   01541000
TSBLECB  EQU   TSBMINL                                                  01542000
TSBLINE  EQU   TSB+82                                                   01543000
TSBSTAX  EQU   TSB+81                                                   01544000
TSBATTNC EQU   TSB+80                                                   01545000
TSBF1V   EQU   TSBTPOST+7                                               01546000
TSBF1M   EQU   TSBTPOST+6                                               01547000
TSBF2V   EQU   TSBTPOST+5                                               01548000
TSBF2M   EQU   TSBTPOST+4                                               01549000
TSBFLAGV EQU   TSBTPOST+3                                               01550000
TSBFLAGM EQU   TSBTPOST+2                                               01551000
@NM00065 EQU   TSBTPOST+1                                               01552000
@NM00064 EQU   TSBTPFLG                                                 01553000
@NM00063 EQU   TSBTPFLG                                                 01554000
@NM00062 EQU   TSBTPFLG                                                 01555000
@NM00061 EQU   TSBTPFLG                                                 01556000
TSBNEWID EQU   TSBTPFLG                                                 01557000
TSBTPAYI EQU   TSBTPFLG                                                 01558000
TSBTPQCB EQU   TSBTPFLG                                                 01559000
TSBPOSTO EQU   TSBTPFLG                                                 01560000
TSBLINKB EQU   TSBLINKA+1                                               01561000
TSBPRI   EQU   TSBLINKA                                                 01562000
TSBRQCB  EQU   TSBRCB                                                   01563000
TSBERSDS EQU   TSB+56                                                   01564000
TSBAUTOI EQU   TSB+52                                                   01565000
TSBAUTOS EQU   TSB+48                                                   01566000
TSBATNCC EQU   TSB+44                                                   01567000
TSBASRCE EQU   TSB+42                                                   01568000
TSBHLDL  EQU   TSBFLG4                                                  01569000
TSBGETBF EQU   TSBFLG4                                                  01570000
TSBHOLD  EQU   TSBFLG4                                                  01571000
TSBHUNG  EQU   TSBFLG4                                                  01572000
TSBOWAIT EQU   TSBFLG4                                                  01573000
TSBIWAIT EQU   TSBFLG4                                                  01574000
TSBOCAB  EQU   TSBFLG4                                                  01575000
TSBLNNO  EQU   TSB+40                                                   01576000
TSBATNTC EQU   TSB+38                                                   01577000
TSBATNLC EQU   TSB+36                                                   01578000
TSBCHDCC EQU   TSBSTCC+1                                                01579000
TSBLNDCC EQU   TSBSTCC                                                  01580000
TSBECB   EQU   TSB+28                                                   01581000
TSBC1050 EQU   TSBTERM2                                                 01582000
@NM00060 EQU   TSBTERM2                                                 01583000
@NM00059 EQU   TSBTERM2                                                 01584000
@NM00058 EQU   TSBTERM2                                                 01585000
@NM00057 EQU   TSBTERM2                                                 01586000
TSBCTWX  EQU   TSBTERM2                                                 01587000
@NM00056 EQU   TSBTERM2                                                 01588000
@NM00055 EQU   TSBTERM2                                                 01589000
@NM00054 EQU   TSBTERM1                                                 01590000
@NM00053 EQU   TSBTERM1                                                 01591000
@NM00052 EQU   TSBTERM1                                                 01592000
TSBC2741 EQU   TSBTERM1                                                 01593000
TSBC5041 EQU   TSBTERM1                                                 01594000
TSBCATTN EQU   TSBTERM1                                                 01595000
TSBCBRK  EQU   TSBTERM1                                                 01596000
TSBCIHBN EQU   TSBTERM1                                                 01597000
TSBVTAM  EQU   TSBFLG5                                                  01598000
TSBKEYS  EQU   TSBFLG5                                                  01599000
TSBNEDIT EQU   TSBFLG5                                                  01600000
TSBQRY   EQU   TSBFLG5                                                  01601000
@NM00051 EQU   TSBFLG5                                                  01602000
TSBSPF   EQU   TSBFLG5                                                  01603000
TSBATMP  EQU   TSBFLG5                                                  01604000
TSBNFLOP EQU   TSBFLG3                                                  01605000
TSBNOBRK EQU   TSBFLG3                                                  01606000
TSBTPUT  EQU   TSBFLG3                                                  01607000
TSBAWOIP EQU   TSBFLG3                                                  01608000
TSBNBKSP EQU   TSBFLG3                                                  01609000
TSBSPIT  EQU   TSBFLG3                                                  01610000
TSBTJMSG EQU   TSBFLG3                                                  01611000
TSBATTN  EQU   TSBFLG3                                                  01612000
TSBIBFP  EQU   TSB+21                                                   01613000
TSBNIBF  EQU   TSB+20                                                   01614000
TSBITBFP EQU   TSB+17                                                   01615000
TSBSATN2 EQU   TSBFLG2                                                  01616000
TSBSATN1 EQU   TSBFLG2                                                  01617000
TSBSTAUT EQU   TSBFLG2                                                  01618000
TSBAUTOC EQU   TSBFLG2                                                  01619000
TSBAULST EQU   TSBFLG2                                                  01620000
TSBBRKIN EQU   TSBFLG2                                                  01621000
TSBAUTON EQU   TSBFLG2                                                  01622000
TSBBIPI  EQU   TSBFLG2                                                  01623000
TSBOBFP  EQU   TSB+13                                                   01624000
TSBNOBF  EQU   TSB+12                                                   01625000
TSBOTBFP EQU   TSB+9                                                    01626000
TSBLNSZ  EQU   TSB+8                                                    01627000
TSBTJBF  EQU   TSBFLG1                                                  01628000
TSBTJIP  EQU   TSBFLG1                                                  01629000
TSBTJOW  EQU   TSBFLG1                                                  01630000
TSBIFLSH EQU   TSBFLG1                                                  01631000
TSBOFLSH EQU   TSBFLG1                                                  01632000
TSBANSR  EQU   TSBFLG1                                                  01633000
TSBASCB  EQU   TSBASCBA+1                                               01634000
TSBATNLD EQU   TSBSTAT                                                  01635000
TSB3270  EQU   TSBSTAT                                                  01636000
TSBDISC  EQU   TSBSTAT                                                  01637000
TSBITOFF EQU   TSBSTAT                                                  01638000
TSBNOBUF EQU   TSBSTAT                                                  01639000
TSBDSPLY EQU   TSBSTAT                                                  01640000
TSBLWAIT EQU   TSBSTAT                                                  01641000
TSBINUSE EQU   TSBSTAT                                                  01642000
ASCBEND  EQU   ASCB+208                                                 01643000
ASCBSRBT EQU   ASCB+200                                                 01644000
ASCBSWTL EQU   ASCB+196                                                 01645000
ASCBRS14 EQU   ASCB+195                                                 01646000
ASCBSMCT EQU   ASCB+194                                                 01647000
ASCBRS12 EQU   ASCB+192                                                 01648000
ASCBPCTT EQU   ASCB+188                                                 01649000
ASCBVGTT EQU   ASCB+184                                                 01650000
ASCBRV43 EQU   ASCBSRQ4                                                 01651000
ASCBRV42 EQU   ASCBSRQ4                                                 01652000
ASCBRV41 EQU   ASCBSRQ4                                                 01653000
ASCBRV40 EQU   ASCBSRQ4                                                 01654000
ASCBRV39 EQU   ASCBSRQ4                                                 01655000
ASCBRV38 EQU   ASCBSRQ4                                                 01656000
ASCBRV37 EQU   ASCBSRQ4                                                 01657000
ASCBRV36 EQU   ASCBSRQ4                                                 01658000
ASCBRV35 EQU   ASCBSRQ3                                                 01659000
ASCBRV34 EQU   ASCBSRQ3                                                 01660000
ASCBRV33 EQU   ASCBSRQ3                                                 01661000
ASCBRV32 EQU   ASCBSRQ3                                                 01662000
ASCBRV31 EQU   ASCBSRQ3                                                 01663000
ASCBRV30 EQU   ASCBSRQ3                                                 01664000
ASCBRV29 EQU   ASCBSRQ3                                                 01665000
ASCBRV28 EQU   ASCBSRQ3                                                 01666000
ASCBRV27 EQU   ASCBSRQ2                                                 01667000
ASCBRV26 EQU   ASCBSRQ2                                                 01668000
ASCBRV25 EQU   ASCBSRQ2                                                 01669000
ASCBRV24 EQU   ASCBSRQ2                                                 01670000
ASCBRV23 EQU   ASCBSRQ2                                                 01671000
ASCBRV22 EQU   ASCBSRQ2                                                 01672000
ASCBRV21 EQU   ASCBSRQ2                                                 01673000
ASCBRV20 EQU   ASCBSRQ2                                                 01674000
ASCBRV19 EQU   ASCBSRQ1                                                 01675000
ASCBRV18 EQU   ASCBSRQ1                                                 01676000
ASCBRV17 EQU   ASCBSRQ1                                                 01677000
ASCBRV16 EQU   ASCBSRQ1                                                 01678000
ASCBRV15 EQU   ASCBSRQ1                                                 01679000
ASCBRV14 EQU   ASCBSRQ1                                                 01680000
ASCBRV13 EQU   ASCBSRQ1                                                 01681000
ASCBSTA  EQU   ASCBSRQ1                                                 01682000
ASCBJBNS EQU   ASCB+176                                                 01683000
ASCBJBNI EQU   ASCB+172                                                 01684000
ASCBMCC  EQU   ASCB+168                                                 01685000
ASCBRTWA EQU   ASCB+164                                                 01686000
ASCBIQEA EQU   ASCB+160                                                 01687000
ASCBXMPQ EQU   ASCB+156                                                 01688000
ASCBRS01 EQU   ASCB+154                                                 01689000
ASCBFMCT EQU   ASCB+152                                                 01690000
ASCBOUXB EQU   ASCB+148                                                 01691000
ASCBOUCB EQU   ASCB+144                                                 01692000
ASCBMECB EQU   ASCB+140                                                 01693000
ASCBQECB EQU   ASCB+136                                                 01694000
ASCBLSQH EQU   ASCBLKGP+4                                               01695000
ASCBLOCK EQU   ASCBLKGP                                                 01696000
ASCBTCBS EQU   ASCB+124                                                 01697000
ASCBNVSC EQU   ASCB+122                                                 01698000
ASCBVSC  EQU   ASCB+120                                                 01699000
ASCBSRBS EQU   ASCB+118                                                 01700000
ASCBSSRB EQU   ASCB+116                                                 01701000
ASCBRV06 EQU   ASCBFLG2                                                 01702000
ASCBRV05 EQU   ASCBFLG2                                                 01703000
ASCBRV04 EQU   ASCBFLG2                                                 01704000
ASCBSNQS EQU   ASCBFLG2                                                 01705000
ASCBS2S  EQU   ASCBFLG2                                                 01706000
ASCBCEXT EQU   ASCBFLG2                                                 01707000
ASCBPXMT EQU   ASCBFLG2                                                 01708000
ASCBXMPT EQU   ASCBFLG2                                                 01709000
ASCBRF07 EQU   ASCBDSP1                                                 01710000
ASCBRF06 EQU   ASCBDSP1                                                 01711000
ASCBRF05 EQU   ASCBDSP1                                                 01712000
ASCBRF04 EQU   ASCBDSP1                                                 01713000
ASCBRF03 EQU   ASCBDSP1                                                 01714000
ASCBRF02 EQU   ASCBDSP1                                                 01715000
ASCBFAIL EQU   ASCBDSP1                                                 01716000
ASCBNOQ  EQU   ASCBDSP1                                                 01717000
ASCBSWCT EQU   ASCB+112                                                 01718000
ASCBASXB EQU   ASCB+108                                                 01719000
ASCBTMCH EQU   ASCB+104                                                 01720000
ASCBNSWP EQU   ASCBFLG1                                                 01721000
ASCBTYP1 EQU   ASCBFLG1                                                 01722000
ASCBSTND EQU   ASCBFLG1                                                 01723000
ASCBABNT EQU   ASCBFLG1                                                 01724000
ASCBTERM EQU   ASCBFLG1                                                 01725000
ASCBS3S  EQU   ASCBFLG1                                                 01726000
ASCBCMSH EQU   ASCBFLG1                                                 01727000
ASCBTOFF EQU   ASCBFLG1                                                 01728000
ASCBRF01 EQU   ASCBRCTF                                                 01729000
ASCBTMLW EQU   ASCBRCTF                                                 01730000
ASCBOUT  EQU   ASCBRCTF                                                 01731000
ASCBWAIT EQU   ASCBRCTF                                                 01732000
ASCBRV08 EQU   ASCBRCTF                                                 01733000
ASCBFQU  EQU   ASCBRCTF                                                 01734000
ASCBFRS  EQU   ASCBRCTF                                                 01735000
ASCBTMNO EQU   ASCBRCTF                                                 01736000
ASCBAFFN EQU   ASCBFW1                                                  01737000
ASCBDUMP EQU   ASCB+96                                                  01738000
ASCBQSVC EQU   ASCB+92                                                  01739000
ASCBUBET EQU   ASCB+88                                                  01740000
ASCBECB  EQU   ASCB+84                                                  01741000
ASCBJSTL EQU   ASCB+80                                                  01742000
ASCBEWST EQU   ASCB+72                                                  01743000
ASCBEJST EQU   ASCB+64                                                  01744000
ASCBCSCB EQU   ASCB+56                                                  01745000
ASCBRSM  EQU   ASCB+52                                                  01746000
ASCBLDA  EQU   ASCB+48                                                  01747000
ASCBSTOR EQU   ASCB+44                                                  01748000
ASCBDP   EQU   ASCB+43                                                  01749000
ASCBRV07 EQU   ASCB+42                                                  01750000
ASCBIOSM EQU   ASCB+40                                                  01751000
ASCBSEQN EQU   ASCB+38                                                  01752000
ASCBCPUS EQU   ASCB+32                                                  01753000
ASCBSPL  EQU   ASCB+28                                                  01754000
ASCBIOSP EQU   ASCB+24                                                  01755000
ASCBSYNC EQU   ASCBSUPC+4                                               01756000
ASCBSVRB EQU   ASCBSUPC                                                 01757000
ASCBCMSF EQU   ASCB+12                                                  01758000
ASCBBWDP EQU   ASCB+8                                                   01759000
ASCBFWDP EQU   ASCB+4                                                   01760000
ASCBASCB EQU   ASCB                                                     01761000
ASCBEGIN EQU   ASCB                                                     01762000
WSAGSCHE EQU   WSAG+40                                                  01763000
WSAGREST EQU   WSAG+36                                                  01764000
WSAGNQDQ EQU   WSAG+32                                                  01765000
WSAGMEMT EQU   WSAG+28                                                  01766000
WSAGOPTM EQU   WSAG+24                                                  01767000
WSAGSTAT EQU   WSAG+20                                                  01768000
WSAGEMS0 EQU   WSAG+16                                                  01769000
WSAGSSRS EQU   WSAG+12                                                  01770000
WSAGRSM  EQU   WSAG+8                                                   01771000
WSAGPGIO EQU   WSAG                                                     01772000
CVTLEVL  EQU   CVTRELNO+2                                               01773000
CVTNUMB  EQU   CVTRELNO                                                 01774000
CVTMDL   EQU   CVTFIX+250                                               01775000
@NM00050 EQU   CVTFIX+248                                               01776000
@NM00049 EQU   CVTFIX                                                   01777000
CVTRV482 EQU   CVTXTNT2+128                                             01778000
CVTRV481 EQU   CVTXTNT2+124                                             01779000
CVTRV480 EQU   CVTXTNT2+120                                             01780000
CVTRV479 EQU   CVTXTNT2+118                                             01781000
CVTRV478 EQU   CVTXTNT2+117                                             01782000
CVTRV477 EQU   CVTXTNT2+116                                             01783000
CVTRV476 EQU   CVTXTNT2+115                                             01784000
CVTRV475 EQU   CVTXTNT2+114                                             01785000
CVTRV474 EQU   CVTRV466                                                 01786000
CVTRV473 EQU   CVTRV466                                                 01787000
CVTRV472 EQU   CVTRV466                                                 01788000
CVTRV471 EQU   CVTRV466                                                 01789000
CVTRV470 EQU   CVTRV466                                                 01790000
CVTRV469 EQU   CVTRV466                                                 01791000
CVTRV468 EQU   CVTRV466                                                 01792000
CVTRV467 EQU   CVTRV466                                                 01793000
CVTRV465 EQU   CVTRV457                                                 01794000
CVTRV464 EQU   CVTRV457                                                 01795000
CVTRV463 EQU   CVTRV457                                                 01796000
CVTRV462 EQU   CVTRV457                                                 01797000
CVTRV461 EQU   CVTRV457                                                 01798000
CVTRV460 EQU   CVTRV457                                                 01799000
CVTRV459 EQU   CVTRV457                                                 01800000
CVTRV458 EQU   CVTRV457                                                 01801000
CVTRV456 EQU   CVTXTNT2+108                                             01802000
CVTRV455 EQU   CVTXTNT2+104                                             01803000
CVTRV454 EQU   CVTXTNT2+100                                             01804000
CVTRV453 EQU   CVTXTNT2+96                                              01805000
CVTRV452 EQU   CVTXTNT2+94                                              01806000
CVTRV451 EQU   CVTXTNT2+92                                              01807000
CVTRV450 EQU   CVTXTNT2+90                                              01808000
CVTRV449 EQU   CVTXTNT2+88                                              01809000
CVTRV448 EQU   CVTXTNT2+87                                              01810000
CVTRV447 EQU   CVTXTNT2+86                                              01811000
CVTRV446 EQU   CVTRV438                                                 01812000
CVTRV445 EQU   CVTRV438                                                 01813000
CVTRV444 EQU   CVTRV438                                                 01814000
CVTRV443 EQU   CVTRV438                                                 01815000
CVTRV442 EQU   CVTRV438                                                 01816000
CVTRV441 EQU   CVTRV438                                                 01817000
CVTRV440 EQU   CVTRV438                                                 01818000
CVTRV439 EQU   CVTRV438                                                 01819000
CVTRV437 EQU   CVTRV429                                                 01820000
CVTRV436 EQU   CVTRV429                                                 01821000
CVTRV435 EQU   CVTRV429                                                 01822000
CVTRV434 EQU   CVTRV429                                                 01823000
CVTRV433 EQU   CVTRV429                                                 01824000
CVTRV432 EQU   CVTRV429                                                 01825000
CVTRV431 EQU   CVTRV429                                                 01826000
CVTRV430 EQU   CVTRV429                                                 01827000
CVTRV428 EQU   CVTXTNT2+80                                              01828000
CVTRV427 EQU   CVTXTNT2+76                                              01829000
CVTRV426 EQU   CVTXTNT2+72                                              01830000
CVTRV425 EQU   CVTXTNT2+68                                              01831000
CVTATACT EQU   CVTATCVT                                                 01832000
CVTRV423 EQU   CVTXTNT2+62                                              01833000
CVTRV422 EQU   CVTXTNT2+60                                              01834000
CVTRV421 EQU   CVTXTNT2+58                                              01835000
CVTRV420 EQU   CVTXTNT2+56                                              01836000
CVTRV419 EQU   CVTXTNT2+55                                              01837000
CVTRV418 EQU   CVTXTNT2+54                                              01838000
CVTRV417 EQU   CVTRV409                                                 01839000
CVTRV416 EQU   CVTRV409                                                 01840000
CVTRV415 EQU   CVTRV409                                                 01841000
CVTRV414 EQU   CVTRV409                                                 01842000
CVTRV413 EQU   CVTRV409                                                 01843000
CVTRV412 EQU   CVTRV409                                                 01844000
CVTRV411 EQU   CVTRV409                                                 01845000
CVTRV410 EQU   CVTRV409                                                 01846000
CVTRV408 EQU   CVTRV400                                                 01847000
CVTRV407 EQU   CVTRV400                                                 01848000
CVTRV406 EQU   CVTRV400                                                 01849000
CVTRV405 EQU   CVTRV400                                                 01850000
CVTRV404 EQU   CVTRV400                                                 01851000
CVTRV403 EQU   CVTRV400                                                 01852000
CVTRV402 EQU   CVTRV400                                                 01853000
CVTRV401 EQU   CVTRV400                                                 01854000
CVTICB   EQU   CVTXTNT2+48                                              01855000
CVTSKTA  EQU   CVTXTNT2+44                                              01856000
CVTCCVT  EQU   CVTXTNT2+40                                              01857000
CVTRSV98 EQU   CVTXTNT2+36                                              01858000
CVTRSV97 EQU   CVTXTNT2+34                                              01859000
CVTRSV96 EQU   CVTXTNT2+32                                              01860000
CVTOLTEP EQU   CVTXTNT2+28                                              01861000
CVTQIDA  EQU   CVTQID+1                                                 01862000
CVTRSV95 EQU   CVTQID                                                   01863000
CVTRSV94 EQU   CVTXTNT2+20                                              01864000
CVTRSV93 EQU   CVTXTNT2+16                                              01865000
CVTRSV92 EQU   CVTXTNT2+12                                              01866000
CVTDEBVR EQU   CVTXTNT2+8                                               01867000
CVTRSV91 EQU   CVTXTNT2+6                                               01868000
CVTRSV9H EQU   CVTFLGBT                                                 01869000
CVTRSV9G EQU   CVTFLGBT                                                 01870000
CVTRSV9F EQU   CVTFLGBT                                                 01871000
CVTRSV9E EQU   CVTFLGBT                                                 01872000
CVTRSV9D EQU   CVTFLGBT                                                 01873000
CVTBAH   EQU   CVTFLGBT                                                 01874000
CVTVME   EQU   CVTFLGBT                                                 01875000
CVTNPE   EQU   CVTFLGBT                                                 01876000
CVTNUCLS EQU   CVTXTNT2+4                                               01877000
CVTDSSVA EQU   CVTDSSV+1                                                01878000
CVTRSV89 EQU   CVTDSSV                                                  01879000
CVTRSV88 EQU   CVTXTNT1+8                                               01880000
CVTRSV87 EQU   CVTXTNT1+4                                               01881000
CVTFACHN EQU   CVTXTNT1                                                 01882000
CVTRV488 EQU   CVTMAP+412                                               01883000
CVTRV487 EQU   CVTMAP+408                                               01884000
CVTRV486 EQU   CVTMAP+404                                               01885000
CVTRV485 EQU   CVTMAP+400                                               01886000
CVTACTAP EQU   CVTMAP+396                                               01887000
CVTAUTH  EQU   CVTMAP+392                                               01888000
CVTRV490 EQU   CVTMAP+388                                               01889000
CVTSU    EQU   CVTMAP+384                                               01890000
CVTVOLT1 EQU   CVTVOLM1+1                                               01891000
CVTVOLI1 EQU   CVTVOLF1                                                 01892000
CVTSTOA  EQU   CVTMAP+376                                               01893000
CVTRSV58 EQU   CVTMAP+374                                               01894000
CVTRSV57 EQU   CVTMAP+372                                               01895000
CVTDDCE  EQU   CVTMAP+368                                               01896000
CVTPNWFR EQU   CVTMAP+364                                               01897000
CVTSMF   EQU   CVTMAP+360                                               01898000
CVTSULK  EQU   CVTMAP+358                                               01899000
CVTSLKO  EQU   CVTSYSK                                                  01900000
CVTSLKP  EQU   CVTSYSK                                                  01901000
CVTSLKQ  EQU   CVTSYSK                                                  01902000
CVTSLKR  EQU   CVTSYSK                                                  01903000
CVTRSV56 EQU   CVTSYSK                                                  01904000
CVTRSV55 EQU   CVTSYSK                                                  01905000
CVTRSV54 EQU   CVTSYSK                                                  01906000
CVTRSV53 EQU   CVTSYSK                                                  01907000
CVTRSV52 EQU   CVTA1F1                                                  01908000
CVTRSV51 EQU   CVTA1F1                                                  01909000
CVTRSV50 EQU   CVTA1F1                                                  01910000
CVTRSV49 EQU   CVTA1F1                                                  01911000
CVTRSV48 EQU   CVTA1F1                                                  01912000
CVTRSV47 EQU   CVTA1F1                                                  01913000
CVTSRSW  EQU   CVTA1F1                                                  01914000
CVTPFSW  EQU   CVTA1F1                                                  01915000
CVTPCVT  EQU   CVTMAP+352                                               01916000
CVTRSV46 EQU   CVTMAP+344                                               01917000
CVTRSV45 EQU   CVTMAP+340                                               01918000
CVTRSV44 EQU   CVTMAP+338                                               01919000
CVTRSV43 EQU   CVTMAP+336                                               01920000
CVTHJESA EQU   CVTHJES+1                                                01921000
CVTRSV42 EQU   CVTHJES                                                  01922000
CVTEXT2A EQU   CVTEXT2+1                                                01923000
CVTRSV41 EQU   CVTEXT2                                                  01924000
CVTAPFA  EQU   CVTAPF+1                                                 01925000
CVTRSV40 EQU   CVTAPF                                                   01926000
CVTRV518 EQU   CVTINTLA                                                 01927000
CVTRV517 EQU   CVTERPV                                                  01928000
CVTEORM  EQU   CVTMAP+312                                               01929000
CVTMCHPR EQU   CVTMAP+308                                               01930000
CVTTZ    EQU   CVTMAP+304                                               01931000
CVTJEPS  EQU   CVTMAP+300                                               01932000
CVTJESCT EQU   CVTMAP+296                                               01933000
CVTMODE  EQU   CVTMAP+292                                               01934000
CVTPTRV  EQU   CVTMAP+288                                               01935000
CVTREAL  EQU   CVTMAP+284                                               01936000
CVTRSV39 EQU   CVTMAP+280                                               01937000
CVTRSV38 EQU   CVTMAP+276                                               01938000
CVTDMSRA EQU   CVTDMSR+1                                                01939000
CVTRV634 EQU   CVTDMSRF                                                 01940000
CVTRV633 EQU   CVTDMSRF                                                 01941000
CVTRV632 EQU   CVTDMSRF                                                 01942000
CVTRV631 EQU   CVTDMSRF                                                 01943000
CVTRV630 EQU   CVTDMSRF                                                 01944000
CVTRV629 EQU   CVTDMSRF                                                 01945000
CVTUDUMP EQU   CVTDMSRF                                                 01946000
CVTSDUMP EQU   CVTDMSRF                                                 01947000
CVTQMSGA EQU   CVTQMSG+1                                                01948000
CVTRSV36 EQU   CVTQMSG                                                  01949000
CVTAMFF  EQU   CVTMAP+264                                               01950000
CVTPURGA EQU   CVTPURG+1                                                01951000
CVTRSV35 EQU   CVTPURG                                                  01952000
CVTCBSP  EQU   CVTMAP+256                                               01953000
CVTATERA EQU   CVTATER+1                                                01954000
CVTSYST  EQU   CVTATER                                                  01955000
CVTVOLT2 EQU   CVTTAT                                                   01956000
CVTVOLI2 EQU   CVTVOLF2                                                 01957000
CVTAQAVB EQU   CVTAQAVT+1                                               01958000
CVTRSV34 EQU   CVTTCMFG                                                 01959000
CVTRSV33 EQU   CVTTCMFG                                                 01960000
CVTRSV32 EQU   CVTTCMFG                                                 01961000
CVTRSV31 EQU   CVTTCMFG                                                 01962000
CVTRSV30 EQU   CVTTCMFG                                                 01963000
CVTRSV29 EQU   CVTTCMFG                                                 01964000
CVTLDEV  EQU   CVTTCMFG                                                 01965000
CVTTCRDY EQU   CVTTCMFG                                                 01966000
CVTGTFA  EQU   CVTGTF+1                                                 01967000
CVTRSV27 EQU   CVTGTFST                                                 01968000
CVTRNIO  EQU   CVTGTFST                                                 01969000
CVTUSR   EQU   CVTGTFST                                                 01970000
CVTRV318 EQU   CVTFORM                                                  01971000
CVTRV317 EQU   CVTTMODE                                                 01972000
CVTRV316 EQU   CVTSTATE                                                 01973000
CVTRV315 EQU   CVTGTFS                                                  01974000
CVTGTFAV EQU   CVTGTFS                                                  01975000
CVT0SCR1 EQU   CVTMAP+232                                               01976000
CVTRV515 EQU   CVTMAP+228                                               01977000
CVTRMS   EQU   CVTMAP+224                                               01978000
CVTPATCH EQU   CVTMAP+220                                               01979000
CVTTSCE  EQU   CVTMAP+216                                               01980000
CVTLNKSC EQU   CVTMAP+214                                               01981000
CVTQABST EQU   CVTMAP+212                                               01982000
CVTMDLDS EQU   CVTMAP+208                                               01983000
CVTUSER  EQU   CVTMAP+204                                               01984000
CVTSMCA  EQU   CVTMAP+196                                               01985000
CVTRSV18 EQU   CVTMAP+192                                               01986000
CVTQLPAQ EQU   CVTMAP+188                                               01987000
CVTQCDSR EQU   CVTMAP+184                                               01988000
CVTVS1B  EQU   CVTOPTB                                                  01989000
CVTVS1A  EQU   CVTOPTB                                                  01990000
CVTFP    EQU   CVTOPTB                                                  01991000
CVTAPTHR EQU   CVTOPTB                                                  01992000
CVTNLOG  EQU   CVTOPTB                                                  01993000
CVTTOD   EQU   CVTOPTB                                                  01994000
CVTCTIMS EQU   CVTOPTB                                                  01995000
CVTPROT  EQU   CVTOPTB                                                  01996000
CVTXPFP  EQU   CVTOPTA                                                  01997000
CVTASCII EQU   CVTOPTA                                                  01998000
CVTRSV13 EQU   CVTOPTA                                                  01999000
CVTRSV12 EQU   CVTOPTA                                                  02000000
CVTNIP   EQU   CVTOPTA                                                  02001000
CVTDDR   EQU   CVTOPTA                                                  02002000
CVTAPR   EQU   CVTOPTA                                                  02003000
CVTCCH   EQU   CVTOPTA                                                  02004000
CVTSNCTR EQU   CVTMAP+180                                               02005000
CVTQMWR  EQU   CVTMAP+176                                               02006000
CVTQOCR  EQU   CVTMAP+172                                               02007000
CVT1EF00 EQU   CVTMAP+168                                               02008000
CVTMZ00  EQU   CVTMAP+164                                               02009000
CVTHEAD  EQU   CVTMAP+160                                               02010000
CVTRSV11 EQU   CVTMAP+156                                               02011000
CVT0PT01 EQU   CVTMAP+152                                               02012000
CVTMSER  EQU   CVTMAP+148                                               02013000
CVTRV516 EQU   CVTIERLC                                                 02014000
CVTILCH  EQU   CVTMAP+140                                               02015000
CVT0DS   EQU   CVTMAP+136                                               02016000
CVTFBOSV EQU   CVTMAP+132                                               02017000
CVTNUCB  EQU   CVTMAP+128                                               02018000
CVTIXAVL EQU   CVTMAP+124                                               02019000
CVTIOQET EQU   CVTMAP+120                                               02020000
CVTDCBA  EQU   CVTMAP+117                                               02021000
CVTMVS2  EQU   CVTDCB                                                   02022000
CVT6DAT  EQU   CVTDCB                                                   02023000
CVT4MPS  EQU   CVTDCB                                                   02024000
CVTRSV09 EQU   CVTDCB                                                   02025000
CVT4MS1  EQU   CVTDCB                                                   02026000
CVT2SPS  EQU   CVTDCB                                                   02027000
CVT1SSS  EQU   CVTDCB                                                   02028000
CVTRSV08 EQU   CVTDCB                                                   02029000
CVTSTB   EQU   CVTMAP+112                                               02030000
CVTQTD00 EQU   CVTMAP+108                                               02031000
CVTQTE00 EQU   CVTMAP+104                                               02032000
CVTCUCB  EQU   CVTMAP+100                                               02033000
CVTSJQ   EQU   CVTMAP+96                                                02034000
CVTPBLDL EQU   CVTMAP+92                                                02035000
CVTTPC   EQU   CVTMAP+88                                                02036000
CVTSVDCB EQU   CVTMAP+84                                                02037000
CVTBRET  EQU   CVTMAP+82                                                02038000
CVTEXIT  EQU   CVTMAP+80                                                02039000
CVT0FN00 EQU   CVTMAP+76                                                02040000
CVTDARA  EQU   CVTDAR+1                                                 02041000
CVTRSV07 EQU   CVTFLGS1                                                 02042000
CVTRSV06 EQU   CVTFLGS1                                                 02043000
CVTRSV05 EQU   CVTFLGS1                                                 02044000
CVTRSV04 EQU   CVTFLGS1                                                 02045000
CVTRSV03 EQU   CVTFLGS1                                                 02046000
CVTRSV02 EQU   CVTFLGS1                                                 02047000
CVTRSV01 EQU   CVTFLGS1                                                 02048000
CVTDMPLK EQU   CVTFLGS1                                                 02049000
CVTXITP  EQU   CVTMAP+68                                                02050000
CVTZDTAB EQU   CVTMAP+64                                                02051000
CVTMSLT  EQU   CVTMAP+60                                                02052000
CVTDATE  EQU   CVTMAP+56                                                02053000
CVTBTERM EQU   CVTMAP+52                                                02054000
CVTSYSAD EQU   CVTMAP+48                                                02055000
CVTXTLER EQU   CVTMAP+44                                                02056000
CVTILK2  EQU   CVTMAP+40                                                02057000
CVTILK1  EQU   CVTMAP+36                                                02058000
CVTPRLTV EQU   CVTMAP+32                                                02059000
CVTPCNVT EQU   CVTMAP+28                                                02060000
CVT0VL00 EQU   CVTMAP+24                                                02061000
CVTXAPG  EQU   CVTMAP+20                                                02062000
CVTBUF   EQU   CVTMAP+16                                                02063000
CVTJOB   EQU   CVTMAP+12                                                02064000
CVTLINK  EQU   CVTMAP+8                                                 02065000
CVT0EF00 EQU   CVTMAP+4                                                 02066000
CVT      EQU   CVTMAP                                                   02067000
@NM00048 EQU   SDWA+512                                                 02068000
SDWAVRA  EQU   SDWARA+4                                                 02069000
SDWAURAL EQU   SDWARA+3                                                 02070000
@NM00047 EQU   SDWADPVA                                                 02071000
SDWAEBC  EQU   SDWADPVA                                                 02072000
SDWAHEX  EQU   SDWADPVA                                                 02073000
SDWAVRAL EQU   SDWARA                                                   02074000
@NM00046 EQU   SDWA+396                                                 02075000
SDWACOMP EQU   SDWA+392                                                 02076000
SDWARCPL EQU   SDWA+364                                                 02077000
@NM00045 EQU   SDWADPSA+32                                              02078000
SDWATO4  EQU   SDWADPSL+28                                              02079000
SDWAFRM4 EQU   SDWADPSL+24                                              02080000
SDWATO3  EQU   SDWADPSL+20                                              02081000
SDWAFRM3 EQU   SDWADPSL+16                                              02082000
SDWATO2  EQU   SDWADPSL+12                                              02083000
SDWAFRM2 EQU   SDWADPSL+8                                               02084000
SDWATO1  EQU   SDWADPSL+4                                               02085000
SDWAFRM1 EQU   SDWADPSL                                                 02086000
@NM00044 EQU   SDWADDAT+3                                               02087000
@NM00043 EQU   SDWAPDAT                                                 02088000
SDWAUSPL EQU   SDWAPDAT                                                 02089000
SDWADPSW EQU   SDWAPDAT                                                 02090000
SDWATJPA EQU   SDWAPDAT                                                 02091000
SDWATLPA EQU   SDWAPDAT                                                 02092000
SDWADREG EQU   SDWAPDAT                                                 02093000
SDWADSAH EQU   SDWAPDAT                                                 02094000
SDWADSAS EQU   SDWAPDAT                                                 02095000
@NM00042 EQU   SDWADDAT+1                                               02096000
@NM00041 EQU   SDWASDAT                                                 02097000
SDWAQQS  EQU   SDWASDAT                                                 02098000
SDWACBS  EQU   SDWASDAT                                                 02099000
SDWAGTF  EQU   SDWASDAT                                                 02100000
SDWASWA  EQU   SDWASDAT                                                 02101000
SDWALSQA EQU   SDWASDAT                                                 02102000
SDWASQA  EQU   SDWASDAT                                                 02103000
SDWANUC  EQU   SDWASDAT                                                 02104000
@NM00040 EQU   SDWADUMP+2                                               02105000
@NM00039 EQU   SDWADPFS                                                 02106000
SDWASLST EQU   SDWADPFS                                                 02107000
@NM00038 EQU   SDWADPFS                                                 02108000
SDWADLST EQU   SDWADPFS                                                 02109000
SDWADPT  EQU   SDWADPFS                                                 02110000
SDWADPID EQU   SDWADUMP                                                 02111000
SDWADPLA EQU   SDWA+316                                                 02112000
SDWAREXN EQU   SDWARECP+16                                              02113000
SDWACSCT EQU   SDWARECP+8                                               02114000
SDWAMODN EQU   SDWARECP                                                 02115000
@NM00037 EQU   SDWALKWA+32                                              02116000
SDWATALW EQU   SDWALKWS+28                                              02117000
SDWATDLW EQU   SDWALKWS+24                                              02118000
SDWATNLW EQU   SDWALKWS+20                                              02119000
SDWAAPLW EQU   SDWALKWS+16                                              02120000
SDWAIPLW EQU   SDWALKWS+12                                              02121000
SDWAILLW EQU   SDWALKWS+8                                               02122000
SDWAIULW EQU   SDWALKWS+4                                               02123000
SDWAICLW EQU   SDWALKWS                                                 02124000
SDWAFLLK EQU   SDWAACF4                                                 02125000
SDWACMS  EQU   SDWAACF4                                                 02126000
SDWAOPTM EQU   SDWAACF4                                                 02127000
SDWATADB EQU   SDWAACF4                                                 02128000
SDWATDNB EQU   SDWAACF4                                                 02129000
SDWATNCB EQU   SDWAACF4                                                 02130000
SDWAILCH EQU   SDWAACF4                                                 02131000
SDWAIUCB EQU   SDWAACF4                                                 02132000
SDWAICAT EQU   SDWAACF3                                                 02133000
SDWAIPRG EQU   SDWAACF3                                                 02134000
SDWASALL EQU   SDWAACF3                                                 02135000
SDWAASMP EQU   SDWAACF3                                                 02136000
SDWADISP EQU   SDWAACF3                                                 02137000
@NM00036 EQU   SDWAACF3                                                 02138000
@NM00035 EQU   SDWAACF2                                                 02139000
SDWAFREE EQU   SDWAACF2                                                 02140000
SDWAUPRG EQU   SDWAACF2                                                 02141000
@NM00034 EQU   SDWAACF2                                                 02142000
SDWASPIN EQU   SDWAACF2                                                 02143000
@NM00033 EQU   SDWAACF2                                                 02144000
SDWARCRD EQU   SDWAACF2                                                 02145000
SDWALCPU EQU   SDWACPUA+2                                               02146000
@NM00032 EQU   SDWACPUA                                                 02147000
SDWARECA EQU   SDWA+244                                                 02148000
@NM00031 EQU   SDWA+239                                                 02149000
@NM00030 EQU   SDWAIOFS                                                 02150000
SDWANIOP EQU   SDWAIOFS                                                 02151000
SDWANOIO EQU   SDWAIOFS                                                 02152000
SDWAIOHT EQU   SDWAIOFS                                                 02153000
SDWAIOQR EQU   SDWAIOFS                                                 02154000
SDWAFMID EQU   SDWA+236                                                 02155000
@NM00029 EQU   SDWAERRD                                                 02156000
SDWAMCIV EQU   SDWAERRD                                                 02157000
SDWARPIV EQU   SDWAERRD                                                 02158000
SDWAMABD EQU   SDWAERRD                                                 02159000
SDWACTS  EQU   SDWAERRD                                                 02160000
SDWASTAE EQU   SDWAERRD                                                 02161000
SDWANRBE EQU   SDWAERRD                                                 02162000
SDWACLUP EQU   SDWAERRD                                                 02163000
@NM00028 EQU   SDWAERRC                                                 02164000
SDWAEAS  EQU   SDWAERRC                                                 02165000
SDWAPERC EQU   SDWAERRC                                                 02166000
SDWAIRB  EQU   SDWAERRC                                                 02167000
SDWASTAI EQU   SDWAERRC                                                 02168000
SDWASTAF EQU   SDWAERRC                                                 02169000
SDWASRBM EQU   SDWAERRB                                                 02170000
SDWALDIS EQU   SDWAERRB                                                 02171000
SDWAENRB EQU   SDWAERRB                                                 02172000
SDWATYP1 EQU   SDWAERRB                                                 02173000
@NM00027 EQU   SDWAERRB                                                 02174000
SDWAPGIO EQU   SDWAERRA                                                 02175000
SDWATEXC EQU   SDWAERRA                                                 02176000
SDWASVCE EQU   SDWAERRA                                                 02177000
SDWAABTM EQU   SDWAERRA                                                 02178000
SDWASVCD EQU   SDWAERRA                                                 02179000
SDWARKEY EQU   SDWAERRA                                                 02180000
SDWAMCHK EQU   SDWAERRA                                                 02181000
SDWATIME EQU   SDWAMCH+20                                               02182000
SDWARFSA EQU   SDWAMCH+16                                               02183000
@NM00026 EQU   SDWAMCH+14                                               02184000
SDWAVEQR EQU   SDWARSR2                                                 02185000
SDWAPGFX EQU   SDWARSR2                                                 02186000
SDWAFLSQ EQU   SDWARSR2                                                 02187000
SDWAFSQA EQU   SDWARSR2                                                 02188000
SDWANUCL EQU   SDWARSR2                                                 02189000
SDWASPER EQU   SDWARSR2                                                 02190000
SDWAINTC EQU   SDWARSR2                                                 02191000
SDWAOFLN EQU   SDWARSR2                                                 02192000
SDWACHNG EQU   SDWARSR1                                                 02193000
SDWAMSER EQU   SDWARSR1                                                 02194000
@NM00025 EQU   SDWARSR1                                                 02195000
SDWACPID EQU   SDWAMCH+10                                               02196000
SDWATERR EQU   SDWAMCHD                                                 02197000
SDWAFPRX EQU   SDWAMCHD                                                 02198000
SDWAINSF EQU   SDWAMCHD                                                 02199000
SDWAACR  EQU   SDWAMCHD                                                 02200000
SDWASCK  EQU   SDWAMCHD                                                 02201000
SDWAPSWU EQU   SDWAMCHD                                                 02202000
SDWAREGU EQU   SDWAMCHD                                                 02203000
SDWASKYF EQU   SDWAMCHD                                                 02204000
@NM00024 EQU   SDWAMCHS                                                 02205000
SDWARSRF EQU   SDWAMCHS                                                 02206000
SDWARSRC EQU   SDWAMCHS                                                 02207000
SDWAINVP EQU   SDWAMCHS                                                 02208000
SDWATSVL EQU   SDWAMCHS                                                 02209000
SDWARCDF EQU   SDWAMCHS                                                 02210000
SDWASRVL EQU   SDWAMCHS                                                 02211000
SDWASCKE EQU   SDWASTCK+4                                               02212000
SDWASCKB EQU   SDWASTCK                                                 02213000
SDWALNTH EQU   SDWAIDNT+1                                               02214000
SDWASPID EQU   SDWAIDNT                                                 02215000
SDWASR15 EQU   SDWASRSV+60                                              02216000
SDWASR14 EQU   SDWASRSV+56                                              02217000
SDWASR13 EQU   SDWASRSV+52                                              02218000
SDWASR12 EQU   SDWASRSV+48                                              02219000
SDWASR11 EQU   SDWASRSV+44                                              02220000
SDWASR10 EQU   SDWASRSV+40                                              02221000
SDWASR09 EQU   SDWASRSV+36                                              02222000
SDWASR08 EQU   SDWASRSV+32                                              02223000
SDWASR07 EQU   SDWASRSV+28                                              02224000
SDWASR06 EQU   SDWASRSV+24                                              02225000
SDWASR05 EQU   SDWASRSV+20                                              02226000
SDWASR04 EQU   SDWASRSV+16                                              02227000
SDWASR03 EQU   SDWASRSV+12                                              02228000
SDWASR02 EQU   SDWASRSV+8                                               02229000
SDWASR01 EQU   SDWASRSV+4                                               02230000
SDWASR00 EQU   SDWASRSV                                                 02231000
SDWATRN2 EQU   SDWAAEC2+4                                               02232000
SDWAIPC2 EQU   SDWAICD2                                                 02233000
SDWAIMC2 EQU   SDWAICD2                                                 02234000
SDWAIPR2 EQU   SDWAICD2                                                 02235000
@NM00023 EQU   SDWAINC2                                                 02236000
@NM00022 EQU   SDWAILC2                                                 02237000
SDWAIL2  EQU   SDWAILC2                                                 02238000
@NM00021 EQU   SDWAILC2                                                 02239000
@NM00020 EQU   SDWAAEC2                                                 02240000
SDWAADD2 EQU   SDWANXT2+1                                               02241000
@NM00019 EQU   SDWANXT2                                                 02242000
@NM00018 EQU   SDWAEC2+3                                                02243000
SDWASGN2 EQU   SDWAINT2                                                 02244000
SDWAEXP2 EQU   SDWAINT2                                                 02245000
SDWADEC2 EQU   SDWAINT2                                                 02246000
SDWAFPO2 EQU   SDWAINT2                                                 02247000
SDWACC2  EQU   SDWAINT2                                                 02248000
@NM00017 EQU   SDWAINT2                                                 02249000
SDWAPGM2 EQU   SDWAMWP2                                                 02250000
SDWAWAT2 EQU   SDWAMWP2                                                 02251000
SDWAMCK2 EQU   SDWAMWP2                                                 02252000
SDWAECT2 EQU   SDWAMWP2                                                 02253000
SDWAKEY2 EQU   SDWAMWP2                                                 02254000
SDWAEXT2 EQU   SDWAEMK2                                                 02255000
SDWAIO2  EQU   SDWAEMK2                                                 02256000
SDWATRM2 EQU   SDWAEMK2                                                 02257000
@NM00016 EQU   SDWAEMK2                                                 02258000
SDWAPER2 EQU   SDWAEMK2                                                 02259000
@NM00015 EQU   SDWAEMK2                                                 02260000
SDWATRAN EQU   SDWAAEC1+4                                               02261000
SDWAIPC1 EQU   SDWAICD1                                                 02262000
SDWAIMC1 EQU   SDWAICD1                                                 02263000
SDWAIPR1 EQU   SDWAICD1                                                 02264000
@NM00014 EQU   SDWAINC1                                                 02265000
@NM00013 EQU   SDWAILC1                                                 02266000
SDWAIL1  EQU   SDWAILC1                                                 02267000
@NM00012 EQU   SDWAILC1                                                 02268000
@NM00011 EQU   SDWAAEC1                                                 02269000
SDWAADD1 EQU   SDWANXT1+1                                               02270000
@NM00010 EQU   SDWANXT1                                                 02271000
@NM00009 EQU   SDWAEC1+3                                                02272000
SDWASGN1 EQU   SDWAINT1                                                 02273000
SDWAEXP1 EQU   SDWAINT1                                                 02274000
SDWADEC1 EQU   SDWAINT1                                                 02275000
SDWAFPO1 EQU   SDWAINT1                                                 02276000
SDWACC1  EQU   SDWAINT1                                                 02277000
@NM00008 EQU   SDWAINT1                                                 02278000
SDWAPGM1 EQU   SDWAMWP1                                                 02279000
SDWAWAT1 EQU   SDWAMWP1                                                 02280000
SDWAMCK1 EQU   SDWAMWP1                                                 02281000
SDWAECT1 EQU   SDWAMWP1                                                 02282000
SDWAKEY1 EQU   SDWAMWP1                                                 02283000
SDWAEXT1 EQU   SDWAEMK1                                                 02284000
SDWAIO1  EQU   SDWAEMK1                                                 02285000
SDWATRM1 EQU   SDWAEMK1                                                 02286000
@NM00007 EQU   SDWAEMK1                                                 02287000
SDWAPER1 EQU   SDWAEMK1                                                 02288000
@NM00006 EQU   SDWAEMK1                                                 02289000
SDWAIOBR EQU   SDWA+100                                                 02290000
SDWAEPA  EQU   SDWA+96                                                  02291000
@NM00005 EQU   SDWANAME+4                                               02292000
SDWARBAD EQU   SDWANAME                                                 02293000
SDWAGR15 EQU   SDWAGRSV+60                                              02294000
SDWAGR14 EQU   SDWAGRSV+56                                              02295000
SDWAGR13 EQU   SDWAGRSV+52                                              02296000
SDWAGR12 EQU   SDWAGRSV+48                                              02297000
SDWAGR11 EQU   SDWAGRSV+44                                              02298000
SDWAGR10 EQU   SDWAGRSV+40                                              02299000
SDWAGR09 EQU   SDWAGRSV+36                                              02300000
SDWAGR08 EQU   SDWAGRSV+32                                              02301000
SDWAGR07 EQU   SDWAGRSV+28                                              02302000
SDWAGR06 EQU   SDWAGRSV+24                                              02303000
SDWAGR05 EQU   SDWAGRSV+20                                              02304000
SDWAGR04 EQU   SDWAGRSV+16                                              02305000
SDWAGR03 EQU   SDWAGRSV+12                                              02306000
SDWAGR02 EQU   SDWAGRSV+8                                               02307000
SDWAGR01 EQU   SDWAGRSV+4                                               02308000
SDWAGR00 EQU   SDWAGRSV                                                 02309000
SDWANXTP EQU   SDWACTL2+5                                               02310000
SDWASGP  EQU   SDWAPMKP                                                 02311000
SDWAEUP  EQU   SDWAPMKP                                                 02312000
SDWADOP  EQU   SDWAPMKP                                                 02313000
SDWAFPP  EQU   SDWAPMKP                                                 02314000
SDWACCP  EQU   SDWAPMKP                                                 02315000
SDWAILP  EQU   SDWAPMKP                                                 02316000
SDWAINTP EQU   SDWACTL2+2                                               02317000
SDWASPVP EQU   SDWAMWPP                                                 02318000
SDWAWATP EQU   SDWAMWPP                                                 02319000
SDWAMCKP EQU   SDWAMWPP                                                 02320000
@NM00004 EQU   SDWAMWPP                                                 02321000
SDWAKEYP EQU   SDWAMWPP                                                 02322000
SDWAEXTP EQU   SDWACMKP                                                 02323000
SDWAIOP  EQU   SDWACMKP                                                 02324000
SDWANXTA EQU   SDWACTL1+5                                               02325000
SDWASGA  EQU   SDWAPMKA                                                 02326000
SDWAEUA  EQU   SDWAPMKA                                                 02327000
SDWADOA  EQU   SDWAPMKA                                                 02328000
SDWAFPA  EQU   SDWAPMKA                                                 02329000
SDWACCA  EQU   SDWAPMKA                                                 02330000
SDWAILA  EQU   SDWAPMKA                                                 02331000
SDWAINTA EQU   SDWACTL1+2                                               02332000
SDWASPVA EQU   SDWAMWPA                                                 02333000
SDWAWATA EQU   SDWAMWPA                                                 02334000
SDWAMCKA EQU   SDWAMWPA                                                 02335000
@NM00003 EQU   SDWAMWPA                                                 02336000
SDWAKEYA EQU   SDWAMWPA                                                 02337000
SDWAEXTA EQU   SDWACMKA                                                 02338000
SDWAIOA  EQU   SDWACMKA                                                 02339000
@NM00002 EQU   SDWACMPF                                                 02340000
SDWASTCC EQU   SDWACMPF                                                 02341000
@NM00001 EQU   SDWACMPF                                                 02342000
SDWASTEP EQU   SDWACMPF                                                 02343000
SDWAREQ  EQU   SDWACMPF                                                 02344000
@NM00151 EQU   PSA+3668                                                 02345000
PSASTAK  EQU   PSA+3072                                                 02346000
@NM00150 EQU   PSA+1048                                                 02347000
PSAUSEND EQU   PSA+1048                                                 02348000
PSARV062 EQU   PSA+1044                                                 02349000
PSACDAL  EQU   PSA+1040                                                 02350000
PSAWTCOD EQU   PSA+1036                                                 02351000
PSAATCVT EQU   PSA+1032                                                 02352000
PSAPCPSW EQU   PSA+1024                                                 02353000
PSAPIR2  EQU   PSA+1020                                                 02354000
PSARV059 EQU   PSA+1018                                                 02355000
PSASVC13 EQU   PSA+1016                                                 02356000
PSALSFCC EQU   PSA+1012                                                 02357000
PSASFACC EQU   PSA+1008                                                 02358000
PSASTOP  EQU   PSA+992                                                  02359000
PSASTART EQU   PSA+976                                                  02360000
PSARSPSW EQU   PSA+968                                                  02361000
PSASRPSW EQU   PSA+960                                                  02362000
PSARV045 EQU   PSA+892                                                  02363000
PSARV044 EQU   PSA+888                                                  02364000
PSARV043 EQU   PSA+884                                                  02365000
PSARV042 EQU   PSA+880                                                  02366000
PSARV041 EQU   PSA+876                                                  02367000
PSARV040 EQU   PSA+872                                                  02368000
PSARV025 EQU   PSA+868                                                  02369000
PSADSSED EQU   PSA+868                                                  02370000
PSADSSPR EQU   PSA+864                                                  02371000
PSADSSFW EQU   PSA+860                                                  02372000
PSADSS14 EQU   PSA+856                                                  02373000
PSADSSPP EQU   PSA+848                                                  02374000
PSADSSRP EQU   PSA+840                                                  02375000
PSADSS05 EQU   PSADSSF4                                                 02376000
PSADSS10 EQU   PSADSSF4                                                 02377000
PSADSSVE EQU   PSADSSF4                                                 02378000
PSADSSDE EQU   PSADSSF4                                                 02379000
PSADSSC0 EQU   PSADSSF4                                                 02380000
PSADSSIE EQU   PSADSSF4                                                 02381000
PSADSS12 EQU   PSADSSF4                                                 02382000
PSADSSRC EQU   PSADSSF4                                                 02383000
PSARV057 EQU   PSADSSF3                                                 02384000
PSARV056 EQU   PSADSSF3                                                 02385000
PSARV055 EQU   PSADSSF3                                                 02386000
PSADSSMC EQU   PSADSSF3                                                 02387000
PSADSSRW EQU   PSADSSF3                                                 02388000
PSADSSNM EQU   PSADSSF3                                                 02389000
PSADSSES EQU   PSADSSF3                                                 02390000
PSADSSGP EQU   PSADSSF3                                                 02391000
PSADSSF2 EQU   PSADSSFL+1                                               02392000
PSADSSPI EQU   PSADSSF1                                                 02393000
PSADSSOI EQU   PSADSSF1                                                 02394000
PSADSSSP EQU   PSADSSF1                                                 02395000
PSADSSTP EQU   PSADSSF1                                                 02396000
PSADSSDW EQU   PSADSSF1                                                 02397000
PSADSSDD EQU   PSADSSF1                                                 02398000
PSADSSDM EQU   PSADSSF1                                                 02399000
PSADSSMV EQU   PSADSSF1                                                 02400000
PSADSSTS EQU   PSA+816                                                  02401000
PSADSSWK EQU   PSA+812                                                  02402000
PSADSSR3 EQU   PSA+808                                                  02403000
PSADSSR2 EQU   PSA+804                                                  02404000
PSADSSRS EQU   PSA+800                                                  02405000
PSASTOR  EQU   PSA+796                                                  02406000
PSACPUSA EQU   PSA+794                                                  02407000
PSAVSTAP EQU   PSA+792                                                  02408000
PSAWKVAP EQU   PSA+788                                                  02409000
PSAWKRAP EQU   PSA+784                                                  02410000
PSAMCHIC EQU   PSA+783                                                  02411000
PSARV061 EQU   PSA+782                                                  02412000
PSASYMSK EQU   PSA+781                                                  02413000
PSAMCHFL EQU   PSA+780                                                  02414000
PSACR0   EQU   PSA+776                                                  02415000
PSAPSWSV EQU   PSA+768                                                  02416000
PSACLHS  EQU   PSAHLHI                                                  02417000
PSALKR15 EQU   PSALKSA+60                                               02418000
PSALKR14 EQU   PSALKSA+56                                               02419000
PSALKR13 EQU   PSALKSA+52                                               02420000
PSALKR12 EQU   PSALKSA+48                                               02421000
PSALKR11 EQU   PSALKSA+44                                               02422000
PSALKR10 EQU   PSALKSA+40                                               02423000
PSALKR9  EQU   PSALKSA+36                                               02424000
PSALKR8  EQU   PSALKSA+32                                               02425000
PSALKR7  EQU   PSALKSA+28                                               02426000
PSALKR6  EQU   PSALKSA+24                                               02427000
PSALKR5  EQU   PSALKSA+20                                               02428000
PSALKR4  EQU   PSALKSA+16                                               02429000
PSALKR3  EQU   PSALKSA+12                                               02430000
PSALKR2  EQU   PSALKSA+8                                                02431000
PSALKR1  EQU   PSALKSA+4                                                02432000
PSALKR0  EQU   PSALKSA                                                  02433000
PSARV023 EQU   PSACLHT+52                                               02434000
PSALOCAL EQU   PSACLHT+48                                               02435000
PSACMSL  EQU   PSACLHT+44                                               02436000
PSAOPTL  EQU   PSACLHT+40                                               02437000
PSATPACL EQU   PSACLHT+36                                               02438000
PSATPDNL EQU   PSACLHT+32                                               02439000
PSATPNCL EQU   PSACLHT+28                                               02440000
PSAIOSLL EQU   PSACLHT+24                                               02441000
PSAIOSUL EQU   PSACLHT+20                                               02442000
PSAIOSCL EQU   PSACLHT+16                                               02443000
PSAIOSSL EQU   PSACLHT+12                                               02444000
PSASALCL EQU   PSACLHT+8                                                02445000
PSAASML  EQU   PSACLHT+4                                                02446000
PSADISPL EQU   PSACLHT                                                  02447000
PSASRSA  EQU   PSA+636                                                  02448000
PSARV050 EQU   PSA+634                                                  02449000
PSADSSGO EQU   PSA+633                                                  02450000
PSARECUR EQU   PSA+632                                                  02451000
PSAHLHIS EQU   PSA+628                                                  02452000
PSAIPCSA EQU   PSA+624                                                  02453000
@NM00149 EQU   PSA+621                                                  02454000
PSAIPCDM EQU   PSA+620                                                  02455000
PSAIPCD  EQU   PSA+616                                                  02456000
@NM00148 EQU   PSA+613                                                  02457000
PSAIPCRM EQU   PSA+612                                                  02458000
PSAIPCR  EQU   PSA+608                                                  02459000
PSAMCHEX EQU   PSA+600                                                  02460000
PSAMPSW  EQU   PSA+592                                                  02461000
PSAEXPS2 EQU   PSA+584                                                  02462000
PSAEXPS1 EQU   PSA+576                                                  02463000
PSAPIREG EQU   PSA+572                                                  02464000
PSARSREG EQU   PSA+568                                                  02465000
PSAGPREG EQU   PSA+556                                                  02466000
PSARV022 EQU   PSASUP4                                                  02467000
PSARV021 EQU   PSASUP4                                                  02468000
PSARV020 EQU   PSASUP4                                                  02469000
PSARV019 EQU   PSASUP4                                                  02470000
PSARV018 EQU   PSASUP4                                                  02471000
PSARV017 EQU   PSASUP4                                                  02472000
PSARV016 EQU   PSASUP4                                                  02473000
PSARV015 EQU   PSASUP4                                                  02474000
PSARV014 EQU   PSASUP3                                                  02475000
PSARV013 EQU   PSASUP3                                                  02476000
PSARV012 EQU   PSASUP3                                                  02477000
PSARV011 EQU   PSASUP3                                                  02478000
PSASPR   EQU   PSASUP3                                                  02479000
PSAPSREG EQU   PSASUP3                                                  02480000
PSAPI2   EQU   PSASUP3                                                  02481000
PSAIOSUP EQU   PSASUP3                                                  02482000
PSALCR   EQU   PSASUP2                                                  02483000
PSARTM   EQU   PSASUP2                                                  02484000
PSAACR   EQU   PSASUP2                                                  02485000
PSAIPCE2 EQU   PSASUP2                                                  02486000
PSAIPCES EQU   PSASUP2                                                  02487000
PSAIPCEC EQU   PSASUP2                                                  02488000
PSAGTF   EQU   PSASUP2                                                  02489000
PSAIPCRI EQU   PSASUP2                                                  02490000
PSARV063 EQU   PSASUP1                                                  02491000
PSATCTL  EQU   PSASUP1                                                  02492000
PSADISP  EQU   PSASUP1                                                  02493000
PSALOCK  EQU   PSASUP1                                                  02494000
PSAPI    EQU   PSASUP1                                                  02495000
PSAEXT   EQU   PSASUP1                                                  02496000
PSASVC   EQU   PSASUP1                                                  02497000
PSAIO    EQU   PSASUP1                                                  02498000
PSAANEW  EQU   PSA+544                                                  02499000
PSATOLD  EQU   PSA+540                                                  02500000
PSATNEW  EQU   PSA+536                                                  02501000
PSALCCAR EQU   PSA+532                                                  02502000
PSALCCAV EQU   PSA+528                                                  02503000
PSAPCCAR EQU   PSA+524                                                  02504000
PSAPCCAV EQU   PSA+520                                                  02505000
PSACPULA EQU   PSA+518                                                  02506000
PSACPUPA EQU   PSA+516                                                  02507000
PSAPSA   EQU   PSA+512                                                  02508000
FLCHDEND EQU   PSA+512                                                  02509000
FLCCRSAV EQU   FLCMCLA+280                                              02510000
FLCGRSAV EQU   FLCMCLA+216                                              02511000
FLCFPSAV EQU   FLCMCLA+184                                              02512000
FLCFLA   EQU   FLCMCLA+88                                               02513000
FLCRGNCD EQU   FLCMCLA+84                                               02514000
FLCFSAA  EQU   FLCFSA+1                                                 02515000
@NM00147 EQU   FLCFSA                                                   02516000
@NM00146 EQU   FLCMCLA+72                                               02517000
FLCMCIC  EQU   FLCMCLA+64                                               02518000
@NM00145 EQU   FLCMCLA+20                                               02519000
FLCIOAA  EQU   FLCIOA+1                                                 02520000
@NM00144 EQU   FLCIOA                                                   02521000
@NM00143 EQU   FLCMCLA+15                                               02522000
@NM00142 EQU   FLCMCLA+14                                               02523000
@NM00141 EQU   FLCMCLA+12                                               02524000
FLCLCL   EQU   FLCMCLA+8                                                02525000
FLCIOELA EQU   FLCIOEL+1                                                02526000
@NM00140 EQU   FLCIOEL                                                  02527000
FLCCHNID EQU   FLCMCLA                                                  02528000
@NM00139 EQU   PSA+160                                                  02529000
FLCMTRCD EQU   PSA+157                                                  02530000
@NM00138 EQU   PSA+156                                                  02531000
FLCPERA  EQU   FLCPER+1                                                 02532000
@NM00137 EQU   FLCPER                                                   02533000
@NM00136 EQU   PSA+151                                                  02534000
FLCPERCD EQU   PSA+150                                                  02535000
FLCMCNUM EQU   PSA+149                                                  02536000
@NM00135 EQU   PSA+148                                                  02537000
FLCTEAA  EQU   FLCTEA+1                                                 02538000
@NM00134 EQU   FLCTEA                                                   02539000
PSAPIPC  EQU   PSAPICOD                                                 02540000
PSAPIMC  EQU   PSAPICOD                                                 02541000
PSAPIPER EQU   PSAPICOD                                                 02542000
PSARV049 EQU   FLCPICOD                                                 02543000
FLCPILCB EQU   FLCPIILC                                                 02544000
@NM00133 EQU   FLCPIILC                                                 02545000
@NM00132 EQU   PSAEPPSW                                                 02546000
FLCSVCN  EQU   PSAESPSW+2                                               02547000
FLCSILCB EQU   FLCSVILC                                                 02548000
@NM00131 EQU   FLCSVILC                                                 02549000
@NM00130 EQU   PSAESPSW                                                 02550000
FLCEICOD EQU   PSAEEPSW+2                                               02551000
PSASPAD  EQU   PSAEEPSW                                                 02552000
@NM00129 EQU   PSA+128                                                  02553000
FLCINPSW EQU   PSA+120                                                  02554000
FLCMNPSW EQU   PSA+112                                                  02555000
FLCPNPSW EQU   PSA+104                                                  02556000
FLCSNPSW EQU   PSA+96                                                   02557000
FLCENPSW EQU   PSA+88                                                   02558000
FLCTRACE EQU   PSA+84                                                   02559000
FLCTIMER EQU   PSA+80                                                   02560000
FLCCVT2  EQU   PSA+76                                                   02561000
FLCCAW   EQU   PSA+72                                                   02562000
FLCCSW   EQU   PSA+64                                                   02563000
FLCIOPSW EQU   PSA+56                                                   02564000
FLCMOPSW EQU   PSA+48                                                   02565000
FLCPOPSW EQU   PSA+40                                                   02566000
FLCSOPSW EQU   PSA+32                                                   02567000
FLCEOPSW EQU   PSA+24                                                   02568000
@NM00128 EQU   FLCICCW2+4                                               02569000
FLCICCW1 EQU   FLCROPSW                                                 02570000
FLCIPPSW EQU   FLCRNPSW                                                 02571000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02572000
@ENDDATA EQU   *                                                        02573000
         END   IKT93EST,(C'PLS1031',0702,78336)                         02574000
