         TITLE '*** IKTCAS54 - PARAMETER PROCESSOR SCANNER'             00001000
IKTCAS54 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'IKTCAS54  79.040'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  LA    @08,4095(,@12)                                      0001 00012000
         USING @PSTART,@12                                         0001 00013000
         USING @PSTART+4095,@08                                    0001 00014000
         L     @00,@SIZDATD                                        0001 00015000
         GETMAIN  R,LV=(0)                                              00016000
         LR    @10,@01                                             0001 00017000
         USING @DATD,@10                                           0001 00018000
         ST    @13,@SA00001+4                                      0001 00019000
         LM    @00,@01,20(@13)                                     0001 00020000
         ST    @10,8(,@13)                                         0001 00021000
         LR    @13,@10                                             0001 00022000
         EJECT                                                          00023000
*                                                                  0119 00024000
*/*  *****************************************************************/ 00025000
*/*                                                                  */ 00026000
*/*    THIS PROGRAM IS ORGANIZED AS FOLLOWS:                         */ 00027000
*/*                                                                  */ 00028000
*/*        A - HOUSEKEEPING                                          */ 00029000
*/*                                                                  */ 00030000
*/*        B - MAINLINE, WHICH CONSISTS OF THE FOLLOWING:            */ 00031000
*/*            1)  IF DATA IS IN A CIB, MOVE IT INTO A WORK BUFFER   */ 00032000
*/*                AND RELEASE THE CIB WITH THE QEDIT MACRO          */ 00033000
*/*            2)  VALIDITY CHECKING OF INPUT OPTIONS.  IF ANY       */ 00034000
*/*                INCONSISTENCIES ARE FOUND, TERMINATE WITH A RETURN*/ 00035000
*/*                CODE OF 4.                                        */ 00036000
*/*            3)  SCAN PARAMETERS, FROM EITHER A DATA OR WORK       */ 00037000
*/*                BUFFER.                                           */ 00038000
*/*            4)  IF PARAMETERS FROM A PARMLIB ARE DESIRED, READ IN */ 00039000
*/*                THE DESIRED MEMBER AND PROCESS ITS PARAMETERS.    */ 00040000
*/*            5)  IF NECESSARY, OVERLAY MEMBER PARAMETERS WITH      */ 00041000
*/*                BUFFER PARAMETERS.                                */ 00042000
*/*            6)  IF REQUESTED, UPDATE TCAS TABLE                   */ 00043000
*/*            7)  IF REQUESTED, WRITE OUT PARAMETERS                */ 00044000
*/*                                                                  */ 00045000
*/*        C - CLEANUP AND RETURN                                    */ 00046000
*/*                                                                  */ 00047000
*/*  *****************************************************************/ 00048000
*                                                                  0119 00049000
*   SCANERR='0'B;                   /* INITIALIZE SW                 */ 00050000
*   GOSW1='1'B;                     /* INITIALIZE SW                 */ 00051000
         OI    GOSW1,B'00100000'                                   0120 00052000
         NI    SCANERR,B'01111111'                                 0120 00053000
*   PRNTPTR=ADDR(PRNTDAT5);         /* 1ST CHAR IN PRINT LINE        */ 00054000
         LA    PRNTPTR,PRNTDAT5                                    0121 00055000
*   PRNTEND=PRNTPTR+67;             /* LAST CHAR IN PRINT LINE       */ 00056000
         LA    @15,67                                              0122 00057000
         ALR   @15,PRNTPTR                                         0122 00058000
         ST    @15,PRNTEND                                         0122 00059000
*   SYNADSW1='N';                   /* INITIALIZE                    */ 00060000
         MVI   SYNADSW1,C'N'                                       0123 00061000
*   SYNADSW2='N';                   /* ERROR                         */ 00062000
         MVI   SYNADSW2,C'N'                                       0124 00063000
*   DCBABSW1='N';                   /* HANDLING                      */ 00064000
         MVI   DCBABSW1,C'N'                                       0125 00065000
*   DCBABSW2='N';                   /* SWITCHES                      */ 00066000
         MVI   DCBABSW2,C'N'                                       0126 00067000
*   CALL CHKOPTNS;                  /* CHECK INPUT OPTIONS, ETC      */ 00068000
         BAL   @14,CHKOPTNS                                        0127 00069000
*   IF MLPMINV='1'B THEN            /* ERRORS                        */ 00070000
         TM    MLPMINV(MLPMPTR),B'01000000'                        0128 00071000
         BNO   @RF00128                                            0128 00072000
*     RTNCODE=4;                    /* YES - NON-ZERO RTN CODE       */ 00073000
         MVC   RTNCODE(2),@CH00063                                 0129 00074000
*   ELSE                                                           0130 00075000
*     DO;                           /* NO - CONTINUE ON WITH         */ 00076000
         B     @RC00128                                            0130 00077000
@RF00128 DS    0H                                                  0131 00078000
*       RTNCODE=0;                  /* ZERO RETURN CODE              */ 00079000
         SLR   @02,@02                                             0131 00080000
         STH   @02,RTNCODE                                         0131 00081000
*       CALL SCANPARM;              /* SCAN BUFFER PARAMETERS        */ 00082000
         BAL   @14,SCANPARM                                        0132 00083000
*       IF MLPMINV='0'B THEN        /* ALL THE PARMS OK              */ 00084000
         TM    MLPMINV(MLPMPTR),B'01000000'                        0133 00085000
         BNZ   @RF00133                                            0133 00086000
*         DO;                       /* YES - CONTINUE ON             */ 00087000
*           CALL READMBR;           /* READ AND PROCESS PARMLIB      */ 00088000
         BAL   @14,READMBR                                         0135 00089000
*           CALL OVERLAY;           /* MERGE PARMS                   */ 00090000
         BAL   @14,OVERLAY                                         0136 00091000
*           CALL TCASUPDT;          /* UPDATE TCAS TABLE PARMS       */ 00092000
         BAL   @14,TCASUPDT                                        0137 00093000
*           CALL WRITEOUT;          /* PRINT TCAS TABLE PARMS        */ 00094000
         BAL   @14,WRITEOUT                                        0138 00095000
*         END;                                                     0139 00096000
*       ELSE                        /* NO - ERROR FOUND              */ 00097000
*         IF PRINTSW='1'B THEN      /* DOING A PRINTOUT              */ 00098000
         B     @RC00133                                            0140 00099000
@RF00133 TM    PRINTSW,B'00001000'                                 0140 00100000
         BNO   @RF00140                                            0140 00101000
*           DO;                     /* YES                           */ 00102000
*             GEN(CLOSE PRINTOUT)   /* CLOSE PRINTOUT                */ 00103000
*             REFS(R0,R1,R14,R15,PRINTOUT);                        0142 00104000
         CLOSE PRINTOUT                                                 00105000
*           END;                                                   0143 00106000
*     END;                                                         0144 00107000
@RF00140 DS    0H                                                  0144 00108000
@RC00133 DS    0H                                                  0145 00109000
*   RESPECIFY                                                      0145 00110000
*    (R15) RESTRICTED;                                             0145 00111000
@RC00128 DS    0H                                                  0146 00112000
*   R15=RTNCODE;                    /* INSERT RETURN CODE            */ 00113000
         LH    R15,RTNCODE                                         0146 00114000
*   RESPECIFY                                                      0147 00115000
*    (R15) UNRESTRICTED;                                           0147 00116000
*   RETURN;                         /* FINISHED                      */ 00117000
@EL00001 L     @13,4(,@13)                                         0148 00118000
@EF00001 L     @00,@SIZDATD                                        0148 00119000
         LR    @01,@10                                             0148 00120000
         FREEMAIN R,LV=(0),A=(1)                                        00121000
@ER00001 L     @14,12(,@13)                                        0148 00122000
         LM    @00,@12,20(@13)                                     0148 00123000
         BR    @14                                                 0148 00124000
         EJECT                                                          00125000
*CHKOPTNS:                                                         0149 00126000
*   PROC OPTIONS(SAVE(14));                                        0149 00127000
CHKOPTNS ST    @14,@SA00002                                        0149 00128000
*                                                                  0150 00129000
*/*  *****************************************************************/ 00130000
*/*                                                                  */ 00131000
*/*    THIS SUBROUTINE DOES THREE THINGS:                            */ 00132000
*/*                                                                  */ 00133000
*/*    -   IF PARAMETERS ARE IN A CIB BUFFER, MOVE THEM INTO A WORK  */ 00134000
*/*        BUFFER AND FREE THE CIB BUFFER                            */ 00135000
*/*    -   MAKE SURE THE INPUT OPTIONS ARE CONSISTENT.               */ 00136000
*/*    -   IF A PRINTOUT WANTED, OPEN THE PRINTOUT DCB               */ 00137000
*/*                                                                  */ 00138000
*/*  *****************************************************************/ 00139000
*                                                                  0150 00140000
*   CIBUFFER='';                    /* CLEAR WORK BUFFER             */ 00141000
         MVI   CIBUFFER,C' '                                       0150 00142000
         MVC   CIBUFFER+1(47),CIBUFFER                             0150 00143000
*   IF MLPMCIB='0'B|MLPMSCA=0 THEN                                 0151 00144000
         TM    MLPMCIB(MLPMPTR),B'00000001'                        0151 00145000
         BZ    @RT00151                                            0151 00146000
         L     @15,MLPMSCA(,MLPMPTR)                               0151 00147000
         LTR   @15,@15                                             0151 00148000
         BZ    @RT00151                                            0151 00149000
*     ;                             /* SKIP IF NO CIB BUFFER         */ 00150000
*   ELSE                            /* A CIB BUFFER                  */ 00151000
*     DO;                           /* YES                           */ 00152000
*       RESPECIFY                                                  0154 00153000
*        (CIBNAME)                  /* SET UP NEW BASE FOR CIB       */ 00154000
*             BASED(MLPMSCA);                                      0154 00155000
*       IF CIBDATLN>0 THEN          /* IF DATA, MOVE INTO            */ 00156000
         L     @15,MLPMSCA(,MLPMPTR)                               0155 00157000
         LH    @14,CIBDATLN(,@15)                                  0155 00158000
         LTR   @14,@14                                             0155 00159000
         BNP   @RF00155                                            0155 00160000
*         MVC(CIBUFFER(1:CIBDATLN),CIBDATA);/* WORK BUFFER           */ 00161000
         L     @01,MLPMSCA(,MLPMPTR)                               0156 00162000
         LH    @14,CIBDATLN(,@01)                                  0156 00163000
         BCTR  @14,0                                               0156 00164000
         EX    @14,@SM01645                                        0156 00165000
*       RESPECIFY                                                  0157 00166000
*        (CIBNAME);                 /* REVERT TO OLD BASE            */ 00167000
@RF00155 DS    0H                                                  0158 00168000
*       RESPECIFY                                                  0158 00169000
*        (R2,                                                      0158 00170000
*         R3) RESTRICTED;                                          0158 00171000
*       R2=ADDR(CHCIBP);            /* ADDR OF CIB PTR               */ 00172000
         L     R2,CSCBPTR(,TWAPTR)                                 0159 00173000
         LA    R2,CHCIBP(,R2)                                      0159 00174000
*       R3=MLPMSCA;                 /* ADDR OF CIB TO BE FREED       */ 00175000
         L     R3,MLPMSCA(,MLPMPTR)                                0160 00176000
*       GEN(QEDIT ORIGIN=(R2),BLOCK=(R3))/* FREE CIB                 */ 00177000
*       REFS(R0,R1,R2,R3,R14,R15);                                 0161 00178000
         QEDIT ORIGIN=(R2),BLOCK=(R3)                                   00179000
*       RESPECIFY                                                  0162 00180000
*        (R2,                                                      0162 00181000
*         R3) UNRESTRICTED;                                        0162 00182000
*     END;                                                         0163 00183000
*   IF MLPMFL1='00'X|               /* CHECK                         */ 00184000
*       (MLPMBUF='1'B&MLPMCIB='1'B) /* OBVIOUS                       */ 00185000
*     THEN                                                         0164 00186000
@RT00151 CLI   MLPMFL1(MLPMPTR),X'00'                              0164 00187000
         BE    @RT00164                                            0164 00188000
         TM    MLPMBUF(MLPMPTR),B'00000011'                        0164 00189000
         BNO   @RF00164                                            0164 00190000
@RT00164 DS    0H                                                  0165 00191000
*     DO;                           /* INPUT                         */ 00192000
*       MLPMINV='1'B;               /* ERRORS                        */ 00193000
         OI    MLPMINV(MLPMPTR),B'01000000'                        0166 00194000
*       RETURN;                     /* .                             */ 00195000
@EL00002 DS    0H                                                  0167 00196000
@EF00002 DS    0H                                                  0167 00197000
@ER00002 L     @14,@SA00002                                        0167 00198000
         BR    @14                                                 0167 00199000
*     END;                          /* .                             */ 00200000
*   IF MLPMWPM='1'B THEN            /* PRINTOUT WANTED               */ 00201000
@RF00164 TM    MLPMWPM(MLPMPTR),B'00010000'                        0169 00202000
         BNO   @RF00169                                            0169 00203000
*     DO;                           /* YES                           */ 00204000
*       GEN(OPEN  (PRINTOUT,OUTPUT))                               0171 00205000
*       REFS(R0,R1,R14,R15,PRINTOUT);                              0171 00206000
         OPEN  (PRINTOUT,OUTPUT)                                        00207000
*       DCBPTR=ADDR(PRINTOUT);      /* SETUP PTR                     */ 00208000
         LA    DCBPTR,PRINTOUT                                     0172 00209000
*       IF DCBABSW2='Y'|DCBOFOPN='0'B THEN/* GOOD OPEN               */ 00210000
         CLI   DCBABSW2,C'Y'                                       0173 00211000
         BE    @RT00173                                            0173 00212000
         TM    DCBOFOPN+40(DCBPTR),B'00010000'                     0173 00213000
         BNZ   @RF00173                                            0173 00214000
@RT00173 DS    0H                                                  0174 00215000
*         DO;                       /* NO                            */ 00216000
*           RESPECIFY                                              0175 00217000
*            (R1) RESTRICTED;                                      0175 00218000
*           R1=17;                  /* MESSAGE NUMBER                */ 00219000
         LA    R1,17                                               0176 00220000
*           CALL MSGBLK;            /* ADDR OF LIST FORM OF MSG      */ 00221000
         L     @15,TWAMSG(,TWAPTR)                                 0177 00222000
         BALR  @14,@15                                             0177 00223000
*           R1=ADDR(IKT017I);       /* ADDR OF LIST FORM             */ 00224000
         LA    @00,IKT017I(,R1)                                    0178 00225000
         LR    R1,@00                                              0178 00226000
*           GEN(WTO   MF=(E,(1)))   /* ISSUE WTO                     */ 00227000
*           REFS(R0,R1,R14,R15);                                   0179 00228000
         WTO   MF=(E,(1))                                               00229000
*           RESPECIFY                                              0180 00230000
*            (R1) UNRESTRICTED;                                    0180 00231000
*           PRINTSW='0'B;           /* TURN OFF PRINT SW             */ 00232000
         NI    PRINTSW,B'11110111'                                 0181 00233000
*         END;                                                     0182 00234000
*       ELSE                                                       0183 00235000
*         PRINTSW='1'B;             /* TURN ON PRINT SW              */ 00236000
         B     @RC00173                                            0183 00237000
@RF00173 OI    PRINTSW,B'00001000'                                 0183 00238000
*     END;                                                         0184 00239000
*   ELSE                                                           0185 00240000
*     PRINTSW='0'B;                 /* TURN OFF PRINT SW             */ 00241000
         B     @RC00169                                            0185 00242000
@RF00169 NI    PRINTSW,B'11110111'                                 0185 00243000
*   END CHKOPTNS;                                                  0186 00244000
         B     @EL00002                                            0186 00245000
         EJECT                                                          00246000
*SCANPARM:                                                         0187 00247000
*   PROC OPTIONS(SAVE(14));                                        0187 00248000
SCANPARM ST    @14,@SA00003                                        0187 00249000
*                                                                  0188 00250000
*/*  *****************************************************************/ 00251000
*/*                                                                  */ 00252000
*/*    THIS SUBROUTINE PROCESSES THE PARAMETERS ENTERED BY THE       */ 00253000
*/*    OPERATOR ON THE VARIOUS COMMANDS.  THE FOLLOWING THINGS ARE   */ 00254000
*/*    DONE:                                                         */ 00255000
*/*                                                                  */ 00256000
*/*    -   INITIALIZE THE BUFFER SAVE AREA                           */ 00257000
*/*    -   SET UP POINTER TO PROPER INPUT BUFFER                     */ 00258000
*/*    -   IF BUFFER EMPTY, EXIT                                     */ 00259000
*/*    -   EXCEPTION CODING                                          */ 00260000
*/*    -   PROCESS THE PARMS FOUND IN THE BUFFER.  IF ANY PARMS ARE  */ 00261000
*/*        IN ERROR, SET THE ERROR SWITCH AND EXIT.                  */ 00262000
*/*    -   IF THE OPERATOR WANTS TO USE A DIFFERENT MEMBER NAME      */ 00263000
*/*        WHEN ACCESSING PARMLIB, SET UP THE NEW NAME               */ 00264000
*/*    -   IF CERTAIN OPTIONS ARE SPECIFIED BY THE OPERATOR, SET     */ 00265000
*/*        SWITCHES TO INDICATE WHAT THEY ARE                        */ 00266000
*/*                                                                  */ 00267000
*/*  *****************************************************************/ 00268000
*                                                                  0188 00269000
*   SAVEBUFR=SAVES1;                /* INITIALIZE SAVE AREA          */ 00270000
         MVC   SAVEBUFR(24),SAVES1                                 0188 00271000
*   IF MLPMBUF='1'B THEN            /* DATA BUFFER                   */ 00272000
         TM    MLPMBUF(MLPMPTR),B'00000010'                        0189 00273000
         BNO   @RF00189                                            0189 00274000
*     SCANPTR=MLPMSCA;              /* YES                           */ 00275000
         L     SCANPTR,MLPMSCA(,MLPMPTR)                           0190 00276000
*   ELSE                                                           0191 00277000
*     SCANPTR=ADDR(CIBUFFER);       /* NO                            */ 00278000
         B     @RC00189                                            0191 00279000
@RF00189 LA    SCANPTR,CIBUFFER                                    0191 00280000
*   IF PRINTSW='1'B THEN            /* PRINTOUT WANTED               */ 00281000
@RC00189 TM    PRINTSW,B'00001000'                                 0192 00282000
         BNO   @RF00192                                            0192 00283000
*     DO;                           /* YES                           */ 00284000
*       PRNTCC='1';                 /* SKIP TO TOP OF PAGE           */ 00285000
         MVI   PRNTCC,C'1'                                         0194 00286000
*       PRNTDATA='CONSOLE VALUES ENTERED:';/* HEADER LINE            */ 00287000
         MVI   PRNTDATA+23,C' '                                    0195 00288000
         MVC   PRNTDATA+24(108),PRNTDATA+23                        0195 00289000
         MVC   PRNTDATA(23),@CC01526                               0195 00290000
*       CALL PRINTIT;               /* PRINT THE HEADER              */ 00291000
         BAL   @14,PRINTIT                                         0196 00292000
*       PRNTLINE='';                /* SKIP TO NEXT LINE             */ 00293000
         MVI   PRNTLINE,C' '                                       0197 00294000
         MVC   PRNTLINE+1(132),PRNTLINE                            0197 00295000
*       IF WORKCHAR=' ' THEN        /* DATA                          */ 00296000
         CLI   WORKCHAR(SCANPTR),C' '                              0198 00297000
         BNE   @RF00198                                            0198 00298000
*         PRNTDAT5='*NONE ENTERED*';/* FROM                          */ 00299000
         MVI   PRNTDAT5+14,C' '                                    0199 00300000
         MVC   PRNTDAT5+15(113),PRNTDAT5+14                        0199 00301000
         MVC   PRNTDAT5(14),@CC01529                               0199 00302000
*       ELSE                        /* THE                           */ 00303000
*         PRNTDAT5=DATABUF;         /* BUFFER                        */ 00304000
         B     @RC00198                                            0200 00305000
@RF00198 MVI   PRNTDAT5+48,C' '                                    0200 00306000
         MVC   PRNTDAT5+49(79),PRNTDAT5+48                         0200 00307000
         MVC   PRNTDAT5(48),DATABUF(SCANPTR)                       0200 00308000
*       CALL PRINTIT;               /* PRINT THE BUFFER              */ 00309000
@RC00198 BAL   @14,PRINTIT                                         0201 00310000
*     END;                                                         0202 00311000
*   IF WORKCHAR=' ' THEN            /* FIRST CHARACTER BLANK         */ 00312000
@RF00192 CLI   WORKCHAR(SCANPTR),C' '                              0203 00313000
         BE    @RT00203                                            0203 00314000
*     RETURN;                       /* YES - EXIT                    */ 00315000
*                                                                  0205 00316000
*/*  *****************************************************************/ 00317000
*/*                                                                  */ 00318000
*/*    THIS SECTION OF CODE HANDLES INPUT DATA THAT IS NOT IN        */ 00319000
*/*    KEYWORD NAME, EQUAL SIGN, KEYWORD PARAMETER, SEQUENCE.        */ 00320000
*/*                                                                  */ 00321000
*/*  *****************************************************************/ 00322000
*                                                                  0205 00323000
*   IF DATA2='U '|DATA7='IGNORE ' THEN/* IGNORE RESPONSE             */ 00324000
         CLC   DATA2(2,SCANPTR),@CC01531                           0205 00325000
         BE    @RT00205                                            0205 00326000
         CLC   DATA7(7,SCANPTR),@CC01532                           0205 00327000
         BNE   @RF00205                                            0205 00328000
@RT00205 DS    0H                                                  0206 00329000
*     DO;                           /* YES                           */ 00330000
*       MLPMIGN='1'B;               /* SET SWITCH                    */ 00331000
         OI    MLPMIGN(MLPMPTR),B'00000001'                        0207 00332000
*       RETURN;                     /* EXIT                          */ 00333000
@EL00003 DS    0H                                                  0208 00334000
@EF00003 DS    0H                                                  0208 00335000
@ER00003 L     @14,@SA00003                                        0208 00336000
         BR    @14                                                 0208 00337000
*     END;                                                         0209 00338000
*   IF DATA6='FSTOP ' THEN          /* 'FSTOP' BY ITSELF             */ 00339000
@RF00205 CLC   DATA6(6,SCANPTR),@CC01533                           0210 00340000
         BNE   @RF00210                                            0210 00341000
*     DATA11='USER=FSTOP ';         /* YES - ADD KEYWORD NAME        */ 00342000
         MVC   DATA11(11,SCANPTR),@CC01534                         0211 00343000
*   ELSE                                                           0212 00344000
*     IF DATA4='SIC ' THEN          /* 'SIC' BY ITSELF               */ 00345000
         B     @RC00210                                            0212 00346000
@RF00210 CLC   DATA4(4,SCANPTR),@CC01536                           0212 00347000
         BNE   @RF00212                                            0212 00348000
*       DATA9='USER=SIC ';          /* YES - ADD KEYWORD NAME        */ 00349000
         MVC   DATA9(9,SCANPTR),@CC01537                           0213 00350000
*   DO WHILE(WORKCHAR^=' ');        /* PROCESS PARMS                 */ 00351000
@RF00212 DS    0H                                                  0214 00352000
@RC00210 B     @DE00214                                            0214 00353000
@DL00214 DS    0H                                                  0215 00354000
*     TABLEPTR=ADDR(VERIBUFR);      /* INITIALIZE                    */ 00355000
         LA    TABLEPTR,VERIBUFR                                   0215 00356000
*     SAVEPTR=ADDR(SAVEBUFR);       /* POINTERS                      */ 00357000
         LA    SAVEPTR,SAVEBUFR                                    0216 00358000
*     CALL FNDNMTCH;                /* GET A KEYWORD NAME            */ 00359000
         BAL   @14,FNDNMTCH                                        0217 00360000
*     IF SCANERR='1'B THEN          /* WAS AN ERROR FOUND            */ 00361000
         TM    SCANERR,B'10000000'                                 0218 00362000
         BNO   @RF00218                                            0218 00363000
*       DO;                         /* YES                           */ 00364000
*         MLPMINV='1'B;             /* SHOW IT                       */ 00365000
         OI    MLPMINV(MLPMPTR),B'01000000'                        0220 00366000
*         RETURN;                   /* AND EXIT                      */ 00367000
         B     @EL00003                                            0221 00368000
*       END;                                                       0222 00369000
*     CALL PRCSPARM;                /* VERIFY KEYWORD PARAMETER      */ 00370000
@RF00218 BAL   @14,PRCSPARM                                        0223 00371000
*     IF SAVECHAR=HEXFF THEN        /* WAS THE PARM INVALID          */ 00372000
         CLI   SAVECHAR(SAVEPTR),X'FF'                             0224 00373000
         BNE   @RF00224                                            0224 00374000
*       DO;                         /* YES                           */ 00375000
*         MLPMINV='1'B;             /* SHOW IT                       */ 00376000
         OI    MLPMINV(MLPMPTR),B'01000000'                        0226 00377000
*         RETURN;                   /* AND EXIT                      */ 00378000
         B     @EL00003                                            0227 00379000
*       END;                                                       0228 00380000
*     IF WORKCHAR^=' ' THEN         /* IF NOT THE END                */ 00381000
@RF00224 CLI   WORKCHAR(SCANPTR),C' '                              0229 00382000
         BE    @RF00229                                            0229 00383000
*       SCANPTR=SCANPTR+1;          /* PT PAST THE COMMA             */ 00384000
         AL    SCANPTR,@CF00057                                    0230 00385000
*   END;                                                           0231 00386000
@RF00229 DS    0H                                                  0231 00387000
@DE00214 CLI   WORKCHAR(SCANPTR),C' '                              0231 00388000
         BNE   @DL00214                                            0231 00389000
*   CALL GETMBRNM;                  /* SETUP PARMLIB MBR NAME        */ 00390000
         BAL   @14,GETMBRNM                                        0232 00391000
*   IF PRINTSW='1'B THEN            /* PRINTOUT WANTED               */ 00392000
         TM    PRINTSW,B'00001000'                                 0233 00393000
         BNO   @RF00233                                            0233 00394000
*     DO;                           /* YES - PRNT ACCPTD VALUES      */ 00395000
*       PRNTCC='0';                 /* SKIP AN EXTRA LINE            */ 00396000
         MVI   PRNTCC,C'0'                                         0235 00397000
*       PRNTDATA='CONSOLE VALUES ACCEPTED:';/* SUB-HEADER LINE       */ 00398000
         MVI   PRNTDATA+24,C' '                                    0236 00399000
         MVC   PRNTDATA+25(107),PRNTDATA+24                        0236 00400000
         MVC   PRNTDATA(24),@CC01543                               0236 00401000
*       CALL PRINTIT;               /* PRINT SUB-HEADER              */ 00402000
         BAL   @14,PRINTIT                                         0237 00403000
*       PRNTLINE='';                /* CLEAR PRINT LINE              */ 00404000
         MVI   PRNTLINE,C' '                                       0238 00405000
         MVC   PRNTLINE+1(132),PRNTLINE                            0238 00406000
*       TABLEPTR=ADDR(VERIBUFR);    /* SETUP POINTER                 */ 00407000
         LA    TABLEPTR,VERIBUFR                                   0239 00408000
*       L=(LENGTH(SAVEBUFR))/8;     /* NUMBER OF PARMS               */ 00409000
         MVC   L(2),@CH00118                                       0240 00410000
*       DO M=1 TO L;                /* PRINT BUFFER PARMS            */ 00411000
         LA    @04,1                                               0241 00412000
         B     @DE00241                                            0241 00413000
@DL00241 DS    0H                                                  0242 00414000
*         SAVEPTR=ADDR(SAVEBUFR)+8*(TBLDISP-1);/* SAVE AREA PTR      */ 00415000
         LA    SAVEPTR,SAVEBUFR                                    0242 00416000
         LH    @04,TBLDISP(,TABLEPTR)                              0242 00417000
         BCTR  @04,0                                               0242 00418000
         SLA   @04,3                                               0242 00419000
         ALR   SAVEPTR,@04                                         0242 00420000
*         IF SAVECHAR^=HEXBC&SAVECHAR^=HEXFF THEN/* GOOD ENTRY       */ 00421000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0243 00422000
         BE    @RF00243                                            0243 00423000
         CLI   SAVECHAR(SAVEPTR),X'FF'                             0243 00424000
         BE    @RF00243                                            0243 00425000
*           DO;                     /* YES                           */ 00426000
*             WORKPARM=SAVAREA;     /* PRINT GOOD                    */ 00427000
         MVC   WORKPARM(8),SAVAREA(SAVEPTR)                        0245 00428000
*             CALL EDITIT;          /* ENTRY                         */ 00429000
         BAL   @14,EDITIT                                          0246 00430000
*           END;                                                   0247 00431000
*         ELSE                                                     0248 00432000
*           TABLEPTR=TABLEPTR+20;   /* NO - PT TO NEXT ENTRY         */ 00433000
         B     @RC00243                                            0248 00434000
@RF00243 AL    TABLEPTR,@CF00144                                   0248 00435000
*       END;                                                       0249 00436000
@RC00243 LA    @04,1                                               0249 00437000
         AH    @04,M                                               0249 00438000
@DE00241 STH   @04,M                                               0249 00439000
         CH    @04,L                                               0249 00440000
         BNH   @DL00241                                            0249 00441000
*       EDFIELD(1)=HEXFF;           /* CAUSE LAST LINE               */ 00442000
         MVI   EDFIELD,X'FF'                                       0250 00443000
*       CALL NSRTNPRT;              /* TO BE PRINTED                 */ 00444000
         BAL   @14,NSRTNPRT                                        0251 00445000
*     END;                                                         0252 00446000
*   KEYWDNM='USER    ';             /* KEYWORD NAME WANTED           */ 00447000
@RF00233 MVC   KEYWDNM(8),@CC00340                                 0253 00448000
*   TABLEPTR=ADDR(VERIBUFR);        /* KEYWORD TABLE                 */ 00449000
         LA    TABLEPTR,VERIBUFR                                   0254 00450000
*   DO WHILE(TBLNAME^=KEYWDNM);     /* FIND                          */ 00451000
         B     @DE00255                                            0255 00452000
@DL00255 DS    0H                                                  0256 00453000
*     TABLEPTR=TABLEPTR+20;         /* PROPER                        */ 00454000
         AL    TABLEPTR,@CF00144                                   0256 00455000
*   END;                            /* ENTRY                         */ 00456000
@DE00255 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0257 00457000
         BNE   @DL00255                                            0257 00458000
*   SAVEPTR=ADDR(SAVEBUFR)+8*(TBLDISP-1);/* ADDR OF WORK AREA        */ 00459000
         LA    SAVEPTR,SAVEBUFR                                    0258 00460000
         LH    @04,TBLDISP(,TABLEPTR)                              0258 00461000
         BCTR  @04,0                                               0258 00462000
         SLA   @04,3                                               0258 00463000
         ALR   SAVEPTR,@04                                         0258 00464000
*   IF SAVECHAR^=HEXBC THEN         /* USER= ENTERED                 */ 00465000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0259 00466000
         BE    @RF00259                                            0259 00467000
*     IF SAVAREA='FSTOP   ' THEN    /* YES -                         */ 00468000
         CLC   SAVAREA(8,SAVEPTR),@CC00302                         0260 00469000
         BNE   @RF00260                                            0260 00470000
*       MLPMFS='1'B;                /* SET                           */ 00471000
         OI    MLPMFS(MLPMPTR),B'00000100'                         0261 00472000
*     ELSE                          /* PROPER                        */ 00473000
*       MLPMSIC='1'B;               /* SWITCH                        */ 00474000
         B     @RC00260                                            0262 00475000
@RF00260 OI    MLPMSIC(MLPMPTR),B'00000010'                        0262 00476000
*   KEYWDNM='USERMAX ';             /* KEYWORD NAME WANTED           */ 00477000
@RC00260 DS    0H                                                  0263 00478000
@RF00259 MVC   KEYWDNM(8),@CC00350                                 0263 00479000
*   TABLEPTR=ADDR(VERIBUFR);        /* KEYWORD TABLE                 */ 00480000
         LA    TABLEPTR,VERIBUFR                                   0264 00481000
*   DO WHILE(TBLNAME^=KEYWDNM);     /* FIND                          */ 00482000
         B     @DE00265                                            0265 00483000
@DL00265 DS    0H                                                  0266 00484000
*     TABLEPTR=TABLEPTR+20;         /* PROPER                        */ 00485000
         AL    TABLEPTR,@CF00144                                   0266 00486000
*   END;                            /* ENTRY                         */ 00487000
@DE00265 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0267 00488000
         BNE   @DL00265                                            0267 00489000
*   SAVEPTR=ADDR(SAVEBUFR)+8*(TBLDISP-1);/* ADDR OF WORK AREA        */ 00490000
         LA    SAVEPTR,SAVEBUFR                                    0268 00491000
         LH    @04,TBLDISP(,TABLEPTR)                              0268 00492000
         BCTR  @04,0                                               0268 00493000
         SLA   @04,3                                               0268 00494000
         ALR   SAVEPTR,@04                                         0268 00495000
*   IF SAVECHAR^=HEXBC THEN         /* USERMAX= ENTERED              */ 00496000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0269 00497000
         BE    @RF00269                                            0269 00498000
*     IF SAVAREAF=0 THEN            /* YES -                         */ 00499000
         L     @15,SAVAREAF(,SAVEPTR)                              0270 00500000
         LTR   @15,@15                                             0270 00501000
         BNZ   @RF00270                                            0270 00502000
*       MLPMUZ='1'B;                /* SET                           */ 00503000
         OI    MLPMUZ(MLPMPTR),B'00010000'                         0271 00504000
*     ELSE                          /* PROPER                        */ 00505000
*       MLPMUNZ='1'B;               /* SWITCH                        */ 00506000
         B     @RC00270                                            0272 00507000
@RF00270 OI    MLPMUNZ(MLPMPTR),B'00001000'                        0272 00508000
*   END SCANPARM;                                                  0273 00509000
         B     @EL00003                                            0273 00510000
         EJECT                                                          00511000
*GETMBRNM:                                                         0274 00512000
*   PROC OPTIONS(SAVE(14));                                        0274 00513000
GETMBRNM ST    @14,12(,@13)                                        0274 00514000
*                                                                  0275 00515000
*/*  *****************************************************************/ 00516000
*/*                                                                  */ 00517000
*/*    THIS SUBROUTINE DETERMINES WHAT MEMBER NAME THE OPERATOR      */ 00518000
*/*    WANTS USED IN ACCESSING PARMLIB.                              */ 00519000
*/*                                                                  */ 00520000
*/*  *****************************************************************/ 00521000
*                                                                  0275 00522000
*   KEYWDNM='MEMBER  ';             /* KEYWORD NAME WANTED           */ 00523000
         MVC   KEYWDNM(8),@CC00329                                 0275 00524000
*   TABLEPTR=ADDR(VERIBUFR);        /* KEYWORD TABLE                 */ 00525000
         LA    TABLEPTR,VERIBUFR                                   0276 00526000
*   DO WHILE(TBLNAME^=KEYWDNM);     /* FIND                          */ 00527000
         B     @DE00277                                            0277 00528000
@DL00277 DS    0H                                                  0278 00529000
*     TABLEPTR=TABLEPTR+20;         /* PROPER                        */ 00530000
         AL    TABLEPTR,@CF00144                                   0278 00531000
*   END;                            /* ENTRY                         */ 00532000
@DE00277 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0279 00533000
         BNE   @DL00277                                            0279 00534000
*   SAVEPTR=ADDR(SAVEBUFR)+8*(TBLDISP-1);/* ADDR OF WORK AREA        */ 00535000
         LA    SAVEPTR,SAVEBUFR                                    0280 00536000
         LH    @04,TBLDISP(,TABLEPTR)                              0280 00537000
         BCTR  @04,0                                               0280 00538000
         SLA   @04,3                                               0280 00539000
         ALR   SAVEPTR,@04                                         0280 00540000
*   IF SAVECHAR=HEXBC THEN                                         0281 00541000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0281 00542000
         BE    @RT00281                                            0281 00543000
*     ;                             /* MEMBER= ENTERED NO - USE NAME    00544000
*                                      IN PROC                       */ 00545000
*   ELSE                                                           0283 00546000
*     DO;                           /* YES - GET MEMBER NAME         */ 00547000
*       WORKPARM=SAVAREA;           /* GET NAME ENTERED BY THE     0284 00548000
*                                      OPERATOR IF ITS 2 DIGITS, ADD    00549000
*                                      THEM TO 'MEMDEFLT', ELSE USE     00550000
*                                      THE NAME AS IS                */ 00551000
         MVC   WORKPARM(8),SAVAREA(SAVEPTR)                        0284 00552000
*       IF(WORKPRM(1)>='0'&WORKPRM(1)<='9')&(WORKPRM(2)>='0'&WORKPRM(2) 00553000
*           <='9') THEN                                            0285 00554000
         CLI   WORKPRM,C'0'                                        0285 00555000
         BL    @RF00285                                            0285 00556000
         CLI   WORKPRM,C'9'                                        0285 00557000
         BH    @RF00285                                            0285 00558000
         CLI   WORKPRM+1,C'0'                                      0285 00559000
         BL    @RF00285                                            0285 00560000
         CLI   WORKPRM+1,C'9'                                      0285 00561000
         BH    @RF00285                                            0285 00562000
*         DO;                                                      0286 00563000
*           TSO=MEMDEFLT;                                          0287 00564000
         MVC   TSO(6),@CC00181                                     0287 00565000
*           TSO1=WORKPRM(1);                                       0288 00566000
         MVC   TSO1(1),WORKPRM                                     0288 00567000
*           TSO2=WORKPRM(2);                                       0289 00568000
         MVC   TSO2(1),WORKPRM+1                                   0289 00569000
*           SAVAREA=TSOKEYNN;                                      0290 00570000
         MVC   SAVAREA(8,SAVEPTR),TSOKEYNN                         0290 00571000
*         END;                                                     0291 00572000
*     END;                                                         0292 00573000
*   END GETMBRNM;                                                  0293 00574000
@EL00004 DS    0H                                                  0293 00575000
@EF00004 DS    0H                                                  0293 00576000
@ER00004 L     @14,12(,@13)                                        0293 00577000
         BR    @14                                                 0293 00578000
         EJECT                                                          00579000
*READMBR:                                                          0294 00580000
*   PROC OPTIONS(SAVE(14));                                        0294 00581000
READMBR  ST    @14,@SA00005                                        0294 00582000
*                                                                  0295 00583000
*/*  *****************************************************************/ 00584000
*/*                                                                  */ 00585000
*/*    THE PURPOSE OF THIS SUBROUTINE IS TO READ AND PROCESS THE     */ 00586000
*/*    MEMBER OF PARMLIB WHICH THE OPERATOR WANTS TO USE IN          */ 00587000
*/*    BRINGING UP TCAS.  THE FOLLOWING THINGS ARE DONE:             */ 00588000
*/*                                                                  */ 00589000
*/*    -   INITIALIZE THE MEMBER SAVE AREA                           */ 00590000
*/*    -   EXIT IF PARMLIB NOT WANTED                                */ 00591000
*/*    -   OPEN THE PARMLIB WITH THE PROPER MEMBER NAME.  IF AN      */ 00592000
*/*        ERROR IS ENCOUNTERED, ISSUE AN ERROR MESSAGE AND EXIT     */ 00593000
*/*    -   PROCESS THE PARMS FOUND IN THE MEMBER.  NOTE THAT THEY    */ 00594000
*/*        MAY BE CONTINUED FROM ONE CARD TO THE NEXT.  THE ONLY     */ 00595000
*/*        REQUIREMENT FOR CONTINUING A CARD IS TO HAVE ', ' AFTER   */ 00596000
*/*        THE LAST PARAMETER ON THE CARD.  THE NEXT CARD CAN START  */ 00597000
*/*        ANYPLACE.                                                 */ 00598000
*/*    -   CLOSE PARMLIB                                             */ 00599000
*/*    -   MAKE ANY CONSISTENCY CHECKS THAT ARE NEEDED               */ 00600000
*/*                                                                  */ 00601000
*/*  *****************************************************************/ 00602000
*                                                                  0295 00603000
*   SAVEMBR=SAVES2;                 /* INITIALIZE WORK AREA          */ 00604000
         MVC   SAVEMBR(208),SAVES2                                 0295 00605000
*   IF MLPMRLIB='0'B THEN           /* SHOULD WE READ PARMLIB        */ 00606000
         TM    MLPMRLIB(MLPMPTR),B'00000100'                       0296 00607000
         BZ    @RT00296                                            0296 00608000
*     RETURN;                       /* NO - EXIT                     */ 00609000
*   RESPECIFY                                                      0298 00610000
*    (R15) RESTRICTED;                                             0298 00611000
*   GEN(RDJFCB PARMLIB)             /* READ THE JFCB INTO CORE       */ 00612000
*   REFS(R0,R1,R14,R15,PARMLIB);                                   0299 00613000
         RDJFCB PARMLIB                                                 00614000
*   IF R15=4 THEN                   /* GOOD READ                     */ 00615000
         C     R15,@CF00063                                        0300 00616000
         BNE   @RF00300                                            0300 00617000
*     DO;                           /* NO                            */ 00618000
*       RESPECIFY                                                  0302 00619000
*        (R1) RESTRICTED;                                          0302 00620000
*       R1=13;                      /* MESSAGE NUMBER                */ 00621000
         LA    R1,13                                               0303 00622000
*       CALL MSGBLK;                /* ADDR OF LIST FORM OF MSG      */ 00623000
         L     @15,TWAMSG(,TWAPTR)                                 0304 00624000
         BALR  @14,@15                                             0304 00625000
*       R1=ADDR(IKT013I);           /* ADDR OF LIST FORM             */ 00626000
         LA    @14,IKT013I(,R1)                                    0305 00627000
         LR    R1,@14                                              0305 00628000
*       GEN(WTO   MF=(E,(1)))       /* ISSUE WTO                     */ 00629000
*       REFS(R0,R1,R14,R15);                                       0306 00630000
         WTO   MF=(E,(1))                                               00631000
*       RESPECIFY                                                  0307 00632000
*        (R1) UNRESTRICTED;                                        0307 00633000
*       RETURN;                                                    0308 00634000
@EL00005 DS    0H                                                  0308 00635000
@EF00005 DS    0H                                                  0308 00636000
@ER00005 L     @14,@SA00005                                        0308 00637000
         BR    @14                                                 0308 00638000
*     END;                                                         0309 00639000
*   RESPECIFY                                                      0310 00640000
*    (R15) UNRESTRICTED;                                           0310 00641000
@RF00300 DS    0H                                                  0311 00642000
*   KEYWDNM='MEMBER  ';             /* KEYWORD NAME WANTED           */ 00643000
         MVC   KEYWDNM(8),@CC00329                                 0311 00644000
*   TABLEPTR=ADDR(VERIBUFR);        /* KEYWORD TABLE                 */ 00645000
         LA    TABLEPTR,VERIBUFR                                   0312 00646000
*   DO WHILE(TBLNAME^=KEYWDNM);     /* FIND                          */ 00647000
         B     @DE00313                                            0313 00648000
@DL00313 DS    0H                                                  0314 00649000
*     TABLEPTR=TABLEPTR+20;         /* PROPER                        */ 00650000
         AL    TABLEPTR,@CF00144                                   0314 00651000
*   END;                            /* ENTRY                         */ 00652000
@DE00313 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0315 00653000
         BNE   @DL00313                                            0315 00654000
*   SAVEPTR=ADDR(SAVEBUFR)+8*(TBLDISP-1);/* ADDR OF MBR SAVE AREA    */ 00655000
         LA    SAVEPTR,SAVEBUFR                                    0316 00656000
         LH    @15,TBLDISP(,TABLEPTR)                              0316 00657000
         BCTR  @15,0                                               0316 00658000
         SLA   @15,3                                               0316 00659000
         ALR   SAVEPTR,@15                                         0316 00660000
*   JFCBPTR=ADDR(JFCBAREA);         /* ADDR OF JFCB                  */ 00661000
         LA    JFCBPTR,JFCBAREA                                    0317 00662000
*   IF SAVECHAR^=HEXBC THEN         /* MEMBER= ENTERED               */ 00663000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0318 00664000
         BE    @RF00318                                            0318 00665000
*     JFCBELNM=SAVAREA;             /* YES - MOVE IN NEW NAME        */ 00666000
         MVC   JFCBELNM(8,JFCBPTR),SAVAREA(SAVEPTR)                0319 00667000
*   ELSE                            /* NO                            */ 00668000
*     IF JFCBELNM=BLANK THEN        /* DEFAULT MBR NAME NEEDED       */ 00669000
         B     @RC00318                                            0320 00670000
@RF00318 CLC   JFCBELNM(8,JFCBPTR),@CC00097                        0320 00671000
         BNE   @RF00320                                            0320 00672000
*       JFCBELNM=MBRDEFLT;          /* YES - SUPPLY IT               */ 00673000
         MVC   JFCBELNM(8,JFCBPTR),@CC00179                        0321 00674000
*   GEN(OPEN  (PARMLIB),TYPE=J)     /* OPEN PARMLIB                  */ 00675000
*   REFS(R0,R1,R14,R15,PARMLIB);                                   0322 00676000
@RF00320 DS    0H                                                  0322 00677000
@RC00318 DS    0H                                                  0322 00678000
         OPEN  (PARMLIB),TYPE=J                                         00679000
*   DCBPTR=ADDR(PARMLIB);           /* PTR TO DCB                    */ 00680000
         LA    DCBPTR,PARMLIB                                      0323 00681000
*   IF DCBABSW1='Y'|DCBOFOPN='0'B THEN/* GOOD OPEN                   */ 00682000
         CLI   DCBABSW1,C'Y'                                       0324 00683000
         BE    @RT00324                                            0324 00684000
         TM    DCBOFOPN+40(DCBPTR),B'00010000'                     0324 00685000
         BNZ   @RF00324                                            0324 00686000
@RT00324 DS    0H                                                  0325 00687000
*     DO;                           /* NO                            */ 00688000
*       RESPECIFY                                                  0326 00689000
*        (R1) RESTRICTED;                                          0326 00690000
*       R1=13;                      /* MESSAGE NUMBER                */ 00691000
         LA    R1,13                                               0327 00692000
*       CALL MSGBLK;                /* ADDR OF LIST FORM OF MSG      */ 00693000
         L     @15,TWAMSG(,TWAPTR)                                 0328 00694000
         BALR  @14,@15                                             0328 00695000
*       R1=ADDR(IKT013I);           /* ADDR OF LIST FORM             */ 00696000
         LA    @06,IKT013I(,R1)                                    0329 00697000
         LR    R1,@06                                              0329 00698000
*       GEN(WTO   MF=(E,(1)))       /* ISSUE WTO                     */ 00699000
*       REFS(R0,R1,R14,R15);                                       0330 00700000
         WTO   MF=(E,(1))                                               00701000
*       RESPECIFY                                                  0331 00702000
*        (R1) UNRESTRICTED;                                        0331 00703000
*       RETURN;                                                    0332 00704000
         B     @EL00005                                            0332 00705000
*     END;                                                         0333 00706000
*   IF PRINTSW='1'B THEN            /* PRINTOUT WANTED               */ 00707000
@RF00324 TM    PRINTSW,B'00001000'                                 0334 00708000
         BNO   @RF00334                                            0334 00709000
*     DO;                           /* YES                           */ 00710000
*       PRNTCC='-';                 /* SKIP                          */ 00711000
         MVI   PRNTCC,C'-'                                         0336 00712000
*       PRNTDATA='';                /* TWO                           */ 00713000
         MVI   PRNTDATA,C' '                                       0337 00714000
         MVC   PRNTDATA+1(131),PRNTDATA                            0337 00715000
*       CALL PRINTIT;               /* LINES                         */ 00716000
         BAL   @14,PRINTIT                                         0338 00717000
*       PRNTDATA='PARMLIB VALUES ENTERED:';/* SUB-HEADER LINE        */ 00718000
         MVI   PRNTDATA+23,C' '                                    0339 00719000
         MVC   PRNTDATA+24(108),PRNTDATA+23                        0339 00720000
         MVC   PRNTDATA(23),@CC01556                               0339 00721000
*       CALL PRINTIT;               /* PRINT THE SUB-HEADER          */ 00722000
         BAL   @14,PRINTIT                                         0340 00723000
*       PRNTLINE='';                /* CLEAR THE LINE                */ 00724000
         MVI   PRNTLINE,C' '                                       0341 00725000
         MVC   PRNTLINE+1(132),PRNTLINE                            0341 00726000
*     END;                                                         0342 00727000
*   DUMPCNT=0;                      /* INITIALIZE RCFBDUMP KEY- WORD    00728000
*                                      COUNTER               @ZM20856*/ 00729000
@RF00334 SLR   @02,@02                                             0343 00730000
         STH   @02,DUMPCNT                                         0343 00731000
*   DO WHILE(GOSW1='1'B);           /* PROCESS ALL RECDS IN MBR      */ 00732000
         B     @DE00344                                            0344 00733000
@DL00344 DS    0H                                                  0345 00734000
*     READSW1='1'B;                 /* SET READ SW                   */ 00735000
         OI    READSW1,B'01000000'                                 0345 00736000
*     DO WHILE(READSW1='1'B);       /* FIND A NON-BLANK RECD         */ 00737000
         B     @DE00346                                            0346 00738000
@DL00346 DS    0H                                                  0347 00739000
*       GEN(GET   PARMLIB,MBRRECD)  /* READ A MBR RECD               */ 00740000
*       REFS(R0,R1,R14,R15,PARMLIB,MBRRECD);                       0347 00741000
         GET   PARMLIB,MBRRECD                                          00742000
*       IF SYNADSW1='Y' THEN        /* I/O ERROR DETECTED            */ 00743000
         CLI   SYNADSW1,C'Y'                                       0348 00744000
         BE    @RT00348                                            0348 00745000
*         GOTO SYNAD;               /* YES - IGNORE REST OF MBR      */ 00746000
*       IF PRINTSW='1'B THEN        /* PRINTOUT WANTED               */ 00747000
         TM    PRINTSW,B'00001000'                                 0350 00748000
         BNO   @RF00350                                            0350 00749000
*         DO;                       /* YES                           */ 00750000
*           PRNTDAT5=MBRRECD;       /* PARMLIB RECORD                */ 00751000
         MVI   PRNTDAT5+80,C' '                                    0352 00752000
         MVC   PRNTDAT5+81(47),PRNTDAT5+80                         0352 00753000
         MVC   PRNTDAT5(80),MBRRECD                                0352 00754000
*           CALL PRINTIT;           /* PRINT RECORD                  */ 00755000
         BAL   @14,PRINTIT                                         0353 00756000
*         END;                                                     0354 00757000
*       MBR7380=BLANK;              /* BLANK OUT SEQUENCE NBR        */ 00758000
@RF00350 MVC   MBR7380(8),@CC00097                                 0355 00759000
*       MBR80=HEXFF;                /* SCAN ENDING CHARACTER         */ 00760000
         MVI   MBR80,X'FF'                                         0356 00761000
*       SCANPTR=ADDR(MBRRECD);      /* START OF RECORD               */ 00762000
         LA    SCANPTR,MBRRECD                                     0357 00763000
*       DO WHILE(WORKCHAR=' ');     /* SKIP BLANKS                   */ 00764000
         B     @DE00358                                            0358 00765000
@DL00358 DS    0H                                                  0359 00766000
*         SCANPTR=SCANPTR+1;                                       0359 00767000
         AL    SCANPTR,@CF00057                                    0359 00768000
*       END;                                                       0360 00769000
@DE00358 CLI   WORKCHAR(SCANPTR),C' '                              0360 00770000
         BE    @DL00358                                            0360 00771000
*       IF WORKCHAR^=HEXFF THEN     /* GOOD RECORD                   */ 00772000
         CLI   WORKCHAR(SCANPTR),X'FF'                             0361 00773000
         BE    @RF00361                                            0361 00774000
*         READSW1='0'B;             /* YES                           */ 00775000
         NI    READSW1,B'10111111'                                 0362 00776000
*     END;                                                         0363 00777000
@RF00361 DS    0H                                                  0363 00778000
@DE00346 TM    READSW1,B'01000000'                                 0363 00779000
         BO    @DL00346                                            0363 00780000
*     GOSW2='1'B;                   /* SET GO SW                     */ 00781000
         OI    GOSW2,B'00010000'                                   0364 00782000
*     DO WHILE(GOSW2='1'B);         /* PROCESS RECORD                */ 00783000
         B     @DE00365                                            0365 00784000
@DL00365 DS    0H                                                  0366 00785000
*       TABLEPTR=ADDR(VERIMBR);     /* SETUP                         */ 00786000
         LA    TABLEPTR,VERIMBR                                    0366 00787000
*       SAVEPTR=ADDR(SAVEMBR);      /* POINTERS                      */ 00788000
         LA    SAVEPTR,SAVEMBR                                     0367 00789000
*       CALL FNDNMTCH;              /* GET A KEYWORD NAME            */ 00790000
         BAL   @14,FNDNMTCH                                        0368 00791000
*       IF SCANERR='1'B THEN        /* ERROR                         */ 00792000
         TM    SCANERR,B'10000000'                                 0369 00793000
         BNO   @RF00369                                            0369 00794000
*         CALL MBRERROR;            /* YES                           */ 00795000
         BAL   @14,MBRERROR                                        0370 00796000
*       ELSE                                                       0371 00797000
*         DO;                       /* NO                            */ 00798000
         B     @RC00369                                            0371 00799000
@RF00369 DS    0H                                                  0372 00800000
*           CALL PRCSPARM;          /* VERIFY KEYWORD PARAMETER SEE     00801000
*                                      IF MORE PARMS                 */ 00802000
         BAL   @14,PRCSPARM                                        0372 00803000
*           IF WORKCHAR=' '|DATA2=', ' THEN                        0373 00804000
         CLI   WORKCHAR(SCANPTR),C' '                              0373 00805000
         BE    @RT00373                                            0373 00806000
         CLC   DATA2(2,SCANPTR),@CC01560                           0373 00807000
         BNE   @RF00373                                            0373 00808000
@RT00373 DS    0H                                                  0374 00809000
*             GOSW2='0'B;                                          0374 00810000
         NI    GOSW2,B'11101111'                                   0374 00811000
*           ELSE                                                   0375 00812000
*             SCANPTR=SCANPTR+1;                                   0375 00813000
         B     @RC00373                                            0375 00814000
@RF00373 AL    SCANPTR,@CF00057                                    0375 00815000
*         END;                                                     0376 00816000
@RC00373 DS    0H                                                  0377 00817000
*     END;                                                         0377 00818000
@RC00369 DS    0H                                                  0377 00819000
@DE00365 TM    GOSW2,B'00010000'                                   0377 00820000
         BO    @DL00365                                            0377 00821000
*     IF WORKCHAR=' ' THEN          /* END OF ALL PARMS              */ 00822000
         CLI   WORKCHAR(SCANPTR),C' '                              0378 00823000
         BNE   @RF00378                                            0378 00824000
*       GOSW1='0'B;                 /* YES                           */ 00825000
         NI    GOSW1,B'11011111'                                   0379 00826000
*   END;                                                           0380 00827000
@RF00378 DS    0H                                                  0380 00828000
@DE00344 TM    GOSW1,B'00100000'                                   0380 00829000
         BO    @DL00344                                            0380 00830000
*   GOTO EOF;                       /* SKIP SYNAD RTN                */ 00831000
         B     EOF                                                 0381 00832000
*SYNAD:                                                            0382 00833000
*   ;                                                              0382 00834000
SYNAD    DS    0H                                                  0383 00835000
*   RESPECIFY                                                      0383 00836000
*    (R1) RESTRICTED;                                              0383 00837000
*   R1=14;                          /* MESSAGE NUMBER                */ 00838000
         LA    R1,14                                               0384 00839000
*   CALL MSGBLK;                    /* ADDR OF LIST FORM OF MSG      */ 00840000
         L     @15,TWAMSG(,TWAPTR)                                 0385 00841000
         BALR  @14,@15                                             0385 00842000
*   R1=ADDR(IKT014I);               /* ADDR OF LIST FORM             */ 00843000
         LA    @00,IKT014I(,R1)                                    0386 00844000
         LR    R1,@00                                              0386 00845000
*   GEN(WTO   MF=(E,(1)))           /* ISSUE WTO                     */ 00846000
*   REFS(R0,R1,R14,R15);                                           0387 00847000
         WTO   MF=(E,(1))                                               00848000
*   RESPECIFY                                                      0388 00849000
*    (R1) UNRESTRICTED;                                            0388 00850000
*EOF:                                                              0389 00851000
*   ;                               /* ENTRY FOR EODAD               */ 00852000
EOF      DS    0H                                                  0390 00853000
*   GEN(CLOSE PARMLIB)              /* CLOSE PARMLIB                 */ 00854000
*   REFS(R0,R1,R14,R15,PARMLIB);                                   0390 00855000
         CLOSE PARMLIB                                                  00856000
*   KEYWDNM='HIBFREXT';             /* KEYWORD NAME WANTED           */ 00857000
         MVC   KEYWDNM(8),@CC00394                                 0391 00858000
*   TABLEPTR=ADDR(VERIMBR);         /* KEYWORD TABLE                 */ 00859000
         LA    TABLEPTR,VERIMBR                                    0392 00860000
*   DO WHILE(TBLNAME^=KEYWDNM);     /* FIND                          */ 00861000
         B     @DE00393                                            0393 00862000
@DL00393 DS    0H                                                  0394 00863000
*     TABLEPTR=TABLEPTR+20;         /* PROPER                        */ 00864000
         AL    TABLEPTR,@CF00144                                   0394 00865000
*   END;                            /* ENTRY                         */ 00866000
@DE00393 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0395 00867000
         BNE   @DL00393                                            0395 00868000
*   SAVEPTR=ADDR(SAVEMBR)+8*(TBLDISP-1);/* ADDR OF WORK AREA         */ 00869000
         LA    SAVEPTR,SAVEMBR                                     0396 00870000
         LH    @04,TBLDISP(,TABLEPTR)                              0396 00871000
         BCTR  @04,0                                               0396 00872000
         SLA   @04,3                                               0396 00873000
         ALR   SAVEPTR,@04                                         0396 00874000
*   IF SAVECHAR^=HEXBC&SAVECHAR^=HEXFF THEN/* VALID ENTRY            */ 00875000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0397 00876000
         BE    @RF00397                                            0397 00877000
         CLI   SAVECHAR(SAVEPTR),X'FF'                             0397 00878000
         BE    @RF00397                                            0397 00879000
*     DO;                           /* YES                           */ 00880000
*       WORKPARM=SAVAREA;           /* SAVE VALUE                    */ 00881000
         MVC   WORKPARM(8),SAVAREA(SAVEPTR)                        0399 00882000
*       TEMPPTR=SAVEPTR;            /* SAVE PTR                      */ 00883000
         LR    TEMPPTR,SAVEPTR                                     0400 00884000
*       KEYWDNM='LOBFREXT';         /* KEYWORD NAME WANTED           */ 00885000
         MVC   KEYWDNM(8),@CC00403                                 0401 00886000
*       TABLEPTR=ADDR(VERIMBR);     /* KEYWORD TABLE                 */ 00887000
         LA    TABLEPTR,VERIMBR                                    0402 00888000
*       DO WHILE(TBLNAME^=KEYWDNM); /* FIND                          */ 00889000
         B     @DE00403                                            0403 00890000
@DL00403 DS    0H                                                  0404 00891000
*         TABLEPTR=TABLEPTR+20;     /* PROPER                        */ 00892000
         AL    TABLEPTR,@CF00144                                   0404 00893000
*       END;                        /* ENTRY                         */ 00894000
@DE00403 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0405 00895000
         BNE   @DL00403                                            0405 00896000
*       SAVEPTR=ADDR(SAVEMBR)+8*(TBLDISP-1);/* ADDR OF WORK AREA     */ 00897000
         LA    SAVEPTR,SAVEMBR                                     0406 00898000
         LH    @04,TBLDISP(,TABLEPTR)                              0406 00899000
         BCTR  @04,0                                               0406 00900000
         SLA   @04,3                                               0406 00901000
         ALR   SAVEPTR,@04                                         0406 00902000
*       IF SAVECHAR^=HEXBC&SAVECHAR^=HEXFF THEN/* VALID ENTRY        */ 00903000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0407 00904000
         BE    @RF00407                                            0407 00905000
         CLI   SAVECHAR(SAVEPTR),X'FF'                             0407 00906000
         BE    @RF00407                                            0407 00907000
*         DO;                       /* YES                           */ 00908000
*           IF WRKPRMF2<=SAVAREAF THEN/* HIBFREXT <= LOBFREXT        */ 00909000
         L     @15,WRKPRMF2                                        0409 00910000
         C     @15,SAVAREAF(,SAVEPTR)                              0409 00911000
         BH    @RF00409                                            0409 00912000
*             DO;                   /* YES                           */ 00913000
*               SAVECHAR=HEXFF;     /* FLAG LOBFREXT                 */ 00914000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0411 00915000
*               TEMPPTR->SAVECHAR=HEXFF;/* FLAG HIBFREXT             */ 00916000
         MVI   SAVECHAR(TEMPPTR),X'FF'                             0412 00917000
*             END;                                                 0413 00918000
*         END;                                                     0414 00919000
@RF00409 DS    0H                                                  0415 00920000
*     END;                                                         0415 00921000
@RF00407 DS    0H                                                  0416 00922000
*   IF PRINTSW='1'B THEN            /* PRINTOUT WANTED               */ 00923000
@RF00397 TM    PRINTSW,B'00001000'                                 0416 00924000
         BNO   @RF00416                                            0416 00925000
*     DO;                           /* YES                           */ 00926000
*       PRNTCC='0';                 /* SKIP AN EXTRA LINE            */ 00927000
         MVI   PRNTCC,C'0'                                         0418 00928000
*       PRNTDATA='PARMLIB VALUES ACCEPTED:';/* SUB-HEADER            */ 00929000
         MVI   PRNTDATA+24,C' '                                    0419 00930000
         MVC   PRNTDATA+25(107),PRNTDATA+24                        0419 00931000
         MVC   PRNTDATA(24),@CC01564                               0419 00932000
*       CALL PRINTIT;               /* PRINT SUB-HEADER              */ 00933000
         BAL   @14,PRINTIT                                         0420 00934000
*       PRNTLINE='';                /* CLEAR THE PRINT LINE          */ 00935000
         MVI   PRNTLINE,C' '                                       0421 00936000
         MVC   PRNTLINE+1(132),PRNTLINE                            0421 00937000
*       TABLEPTR=ADDR(VERIMBR);     /* SETUP POINTER                 */ 00938000
         LA    TABLEPTR,VERIMBR                                    0422 00939000
*       L=(LENGTH(SAVEMBR))/8;      /* NUMBER OF PARMS               */ 00940000
         MVC   L(2),@CH00189                                       0423 00941000
*       DO M=1 TO L;                /* PRINT PARMLIB PARMS           */ 00942000
         LA    @04,1                                               0424 00943000
         B     @DE00424                                            0424 00944000
@DL00424 DS    0H                                                  0425 00945000
*         SAVEPTR=ADDR(SAVEMBR)+8*(TBLDISP-1);/* SAVE AREA ADDR      */ 00946000
         LA    SAVEPTR,SAVEMBR                                     0425 00947000
         LH    @04,TBLDISP(,TABLEPTR)                              0425 00948000
         BCTR  @04,0                                               0425 00949000
         SLA   @04,3                                               0425 00950000
         ALR   SAVEPTR,@04                                         0425 00951000
*         IF SAVECHAR^=HEXBC&SAVECHAR^=HEXFF THEN/* GOOD ENTRY       */ 00952000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0426 00953000
         BE    @RF00426                                            0426 00954000
         CLI   SAVECHAR(SAVEPTR),X'FF'                             0426 00955000
         BE    @RF00426                                            0426 00956000
*           DO;                     /* YES                           */ 00957000
*             IF TBLNAME=RCFBDUMP THEN                             0428 00958000
         CLC   TBLNAME(8,TABLEPTR),RCFBDUMP                        0428 00959000
         BNE   @RF00428                                            0428 00960000
*               DO;                 /* PROCESS DUMP          @ZM20856*/ 00961000
*                 DUMPPTR=SAVEPTR+5;/* SKIP TO CODES         @ZM21059*/ 00962000
         LA    @04,5                                               0430 00963000
         ALR   @04,SAVEPTR                                         0430 00964000
         ST    @04,DUMPPTR                                         0430 00965000
*                 CALL EDITIT;      /* PRINT KEYWORD         @ZM20856*/ 00966000
         BAL   @14,EDITIT                                          0431 00967000
*               END;                /* END RCFBDUMP PROCESSING     0432 00968000
*                                                            @ZM20856*/ 00969000
*             ELSE                                                 0433 00970000
*               DO;                 /* OTHER KEYWORDS        @ZM20856*/ 00971000
         B     @RC00428                                            0433 00972000
@RF00428 DS    0H                                                  0434 00973000
*                 WORKPARM=SAVAREA; /* PRINT GOOD                    */ 00974000
         MVC   WORKPARM(8),SAVAREA(SAVEPTR)                        0434 00975000
*                 CALL EDITIT;      /* ENTRY                         */ 00976000
         BAL   @14,EDITIT                                          0435 00977000
*               END;                /*                       @ZM20856*/ 00978000
*           END;                                                   0437 00979000
*         ELSE                                                     0438 00980000
*           TABLEPTR=TABLEPTR+20;   /* NO - PT TO NEXT ENTRY         */ 00981000
         B     @RC00426                                            0438 00982000
@RF00426 AL    TABLEPTR,@CF00144                                   0438 00983000
*       END;                                                       0439 00984000
@RC00426 LA    @04,1                                               0439 00985000
         AH    @04,M                                               0439 00986000
@DE00424 STH   @04,M                                               0439 00987000
         CH    @04,L                                               0439 00988000
         BNH   @DL00424                                            0439 00989000
*       EDFIELD(1)=HEXFF;           /* CAUSE LAST LINE               */ 00990000
         MVI   EDFIELD,X'FF'                                       0440 00991000
*       CALL NSRTNPRT;              /* TO BE PRINTED                 */ 00992000
         BAL   @14,NSRTNPRT                                        0441 00993000
*     END;                                                         0442 00994000
*   END READMBR;                                                   0443 00995000
         B     @EL00005                                            0443 00996000
         EJECT                                                          00997000
*MBRERROR:                                                         0444 00998000
*   PROC OPTIONS(SAVE(14));                                        0444 00999000
MBRERROR ST    @14,12(,@13)                                        0444 01000000
*                                                                  0445 01001000
*/*  *****************************************************************/ 01002000
*/*                                                                  */ 01003000
*/*    THIS SUBROUTINE HANDLES THE ERRORS FOUND BY 'FNDNMTCH' WHEN   */ 01004000
*/*    WORKING WITH A PARMLIB MEMBER.                                */ 01005000
*/*                                                                  */ 01006000
*/*  *****************************************************************/ 01007000
*                                                                  0445 01008000
*   SCANERR='0'B;                   /* TURN OFF ERROR SW             */ 01009000
         NI    SCANERR,B'01111111'                                 0445 01010000
*   DO WHILE(GOSW2='1'B);           /* GO THRU ONCE OR TWICE         */ 01011000
         B     @DE00446                                            0446 01012000
@DL00446 DS    0H                                                  0447 01013000
*     IF WORKCHAR=' '|DATA2=', ' THEN/* END OF A RECORD              */ 01014000
         CLI   WORKCHAR(SCANPTR),C' '                              0447 01015000
         BE    @RT00447                                            0447 01016000
         CLC   DATA2(2,SCANPTR),@CC01560                           0447 01017000
         BNE   @RF00447                                            0447 01018000
@RT00447 DS    0H                                                  0448 01019000
*       DO;                         /* YES                           */ 01020000
*         GOSW2='0'B;               /* END RECORD LOOP               */ 01021000
         NI    GOSW2,B'11101111'                                   0449 01022000
*         RETURN;                   /* EXIT                          */ 01023000
@EL00006 DS    0H                                                  0450 01024000
@EF00006 DS    0H                                                  0450 01025000
@ER00006 L     @14,12(,@13)                                        0450 01026000
         BR    @14                                                 0450 01027000
*       END;                                                       0451 01028000
*     IF WORKCHAR=',' THEN          /* END OF A PARM                 */ 01029000
@RF00447 CLI   WORKCHAR(SCANPTR),C','                              0452 01030000
         BNE   @RF00452                                            0452 01031000
*       DO;                         /* YES                           */ 01032000
*         SCANPTR=SCANPTR+1;        /* POINT PAST ','                */ 01033000
         AL    SCANPTR,@CF00057                                    0454 01034000
*         RETURN;                   /* EXIT                          */ 01035000
         B     @EL00006                                            0455 01036000
*       END;                                                       0456 01037000
*     DO WHILE(WORKCHAR^=' '&WORKCHAR^=',');                       0457 01038000
@RF00452 B     @DE00457                                            0457 01039000
@DL00457 DS    0H                                                  0458 01040000
*       SCANPTR=SCANPTR+1;          /* SKIP TO NEXT PARM             */ 01041000
         AL    SCANPTR,@CF00057                                    0458 01042000
*     END;                                                         0459 01043000
@DE00457 CLI   WORKCHAR(SCANPTR),C' '                              0459 01044000
         BE    @DC00457                                            0459 01045000
         CLI   WORKCHAR(SCANPTR),C','                              0459 01046000
         BNE   @DL00457                                            0459 01047000
@DC00457 DS    0H                                                  0460 01048000
*   END;                                                           0460 01049000
@DE00446 TM    GOSW2,B'00010000'                                   0460 01050000
         BO    @DL00446                                            0460 01051000
*   END MBRERROR;                                                  0461 01052000
         B     @EL00006                                            0461 01053000
         EJECT                                                          01054000
*OVERLAY:                                                          0462 01055000
*   PROC OPTIONS(SAVE(14));                                        0462 01056000
OVERLAY  ST    @14,12(,@13)                                        0462 01057000
*                                                                  0463 01058000
*/*  *****************************************************************/ 01059000
*/*                                                                  */ 01060000
*/*    THIS SUBROUTINE BUILDS A TABLE OF PARM VALUES THAT MAY BE     */ 01061000
*/*    USED TO UPDATE THE TCAS TABLE.  NOTE THAT THE TABLE 'DEFAULTS'*/ 01062000
*/*    IS DEPENDENT ON THE ORDER OF THE KEYWORD NAMES AS SET UP IN   */ 01063000
*/*    'VERIMBR'.                                                    */ 01064000
*/*                                                                  */ 01065000
*/*    THE PROCESS OF UPDATTING THE TCAS TABLE WITH NEW VALUES IS    */ 01066000
*/*    DONE IN THE FOLLOWING MANNER:                                 */ 01067000
*/*                                                                  */ 01068000
*/*    -   INITIALIZE THE BUFFER SAVE AREA (DONE IN 'SCANPARM').     */ 01069000
*/*    -   MOVE VALIDATED PARAMETERS INTO THEIR PROPER SPOT IN THE   */ 01070000
*/*        BUFFER SAVE AREA (DONE IN 'SCANPARM').                    */ 01071000
*/*    -   INITIALIZE THE MEMBER SAVE AREA (DONE IN 'READMBR').      */ 01072000
*/*    -   MOVE VALIDATED PARAMETERS INTO THEIR PROPER SPOT IN THE   */ 01073000
*/*        MEMBER SAVE AREA (DONE IN 'READMBR').                     */ 01074000
*/*    -   INITIALIZE THE MERGE AREA.  IF NO PARMLIB WAS READ, THE   */ 01075000
*/*        AREA IS NULL'ED OUT, OTHERWISE, HARD-CODED DEFAULT VALUES */ 01076000
*/*        ARE MOVED INTO THE MERGE AREA.  NOTE THAT THE MERGE AREA  */ 01077000
*/*        HAS THE SAME ORGANIZATION AS THE MEMBER SAVE AREA.        */ 01078000
*/*    -   SCAN THE MEMBER SAVE AREA.  IF A VALIDATED PARAMETER IS   */ 01079000
*/*        ENCOUNTERED, MOVE IT TO ITS PROPER SPOT IN THE MERGE AREA.*/ 01080000
*/*    -   SCAN THE BUFFER SAVE AREA.  IF A VALIDATED PARAMETER IS   */ 01081000
*/*        ENCOUNTERED, MOVE IT TO ITS PROPER SPOT IN THE MERGE AREA.*/ 01082000
*/*        NOTE THAT THE ABOVE 3 STATEMENTS IMPLY THAT OPERATOR      */ 01083000
*/*        ENTERED PARAMETERS OVERRIDE PARMLIB MEMBER PARAMETERS,    */ 01084000
*/*        WHICH IN TURN OVERRIDE HARD-CODED DEFAULTS.               */ 01085000
*/*    -   SCAN THE MERGE AREA.  IF A VALIDATED PARAMETER IS         */ 01086000
*/*        ENCOUNTERED, MOVE IT TO ITS PROPER SPOT IN THE TCAS       */ 01087000
*/*        TABLE (DONE IN 'TCASUPDT').                               */ 01088000
*/*                                                                  */ 01089000
*/*  *****************************************************************/ 01090000
*                                                                  0463 01091000
*   IF MLPMRLIB='0'B THEN           /* PARMLIB MEMBER READ           */ 01092000
         TM    MLPMRLIB(MLPMPTR),B'00000100'                       0463 01093000
         BNZ   @RF00463                                            0463 01094000
*     MERGAREA=SAVES2;              /* NO                            */ 01095000
         MVC   MERGAREA(208),SAVES2                                0464 01096000
*   ELSE                                                           0465 01097000
*     DO;                           /* YES                           */ 01098000
         B     @RC00463                                            0465 01099000
@RF00463 DS    0H                                                  0466 01100000
*       MERGAREA=DEFAULTS;          /* SETUP DEFAULT VALUES          */ 01101000
         MVI   MERGAREA+80,C' '                                    0466 01102000
         MVC   MERGAREA+81(127),MERGAREA+80                        0466 01103000
         MVC   MERGAREA(80),DEFAULTS                               0466 01104000
*       SAVEPTR=ADDR(SAVEMBR);      /* INITIALIZE PTR                */ 01105000
         LA    SAVEPTR,SAVEMBR                                     0467 01106000
*       J=(LENGTH(SAVEMBR))/8;      /* NUMBER OF PARMS               */ 01107000
         LA    J,26                                                0468 01108000
*       DO I=1 TO J;                /* MOVE IN MBR PARMS             */ 01109000
         LA    I,1                                                 0469 01110000
         B     @DE00469                                            0469 01111000
@DL00469 DS    0H                                                  0470 01112000
*         IF SAVECHAR^=HEXFF&SAVECHAR^=HEXBC THEN                  0470 01113000
         CLI   SAVECHAR(SAVEPTR),X'FF'                             0470 01114000
         BE    @RF00470                                            0470 01115000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0470 01116000
         BE    @RF00470                                            0470 01117000
*           MERGE(I)=SAVAREA;                                      0471 01118000
         LR    @05,I                                               0471 01119000
         SLA   @05,3                                               0471 01120000
         LA    @03,MERGE-8(@05)                                    0471 01121000
         MVC   0(8,@03),SAVAREA(SAVEPTR)                           0471 01122000
*         SAVEPTR=SAVEPTR+8;                                       0472 01123000
@RF00470 AL    SAVEPTR,@CF00034                                    0472 01124000
*       END;                                                       0473 01125000
         AL    I,@CF00057                                          0473 01126000
@DE00469 CR    I,J                                                 0473 01127000
         BNH   @DL00469                                            0473 01128000
*     END;                                                         0474 01129000
*   IF MLPMUZ='1'B|MLPMUNZ='1'B THEN/* OPERATOR ENTER USERMAX=       */ 01130000
@RC00463 TM    MLPMUZ(MLPMPTR),B'00011000'                         0475 01131000
         BZ    @RF00475                                            0475 01132000
*     DO;                           /* YES                           */ 01133000
*       KEYWDNM='USERMAX ';         /* KEYWORD NAME WANTED           */ 01134000
         MVC   KEYWDNM(8),@CC00350                                 0477 01135000
*       TABLEPTR=ADDR(VERIBUFR);    /* KEYWORD TABLE                 */ 01136000
         LA    TABLEPTR,VERIBUFR                                   0478 01137000
*       DO WHILE(TBLNAME^=KEYWDNM); /* FIND                          */ 01138000
         B     @DE00479                                            0479 01139000
@DL00479 DS    0H                                                  0480 01140000
*         TABLEPTR=TABLEPTR+20;     /* PROPER                        */ 01141000
         AL    TABLEPTR,@CF00144                                   0480 01142000
*       END;                        /* ENTRY                         */ 01143000
@DE00479 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0481 01144000
         BNE   @DL00479                                            0481 01145000
*       SAVEPTR=ADDR(SAVEBUFR)+8*(TBLDISP-1);/* USERMAX SAVE AREA    */ 01146000
         LA    SAVEPTR,SAVEBUFR                                    0482 01147000
         LH    @06,TBLDISP(,TABLEPTR)                              0482 01148000
         BCTR  @06,0                                               0482 01149000
         SLA   @06,3                                               0482 01150000
         ALR   SAVEPTR,@06                                         0482 01151000
*       TABLEPTR=ADDR(VERIMBR);     /* KEYWORD TABLE                 */ 01152000
         LA    TABLEPTR,VERIMBR                                    0483 01153000
*       DO WHILE(TBLNAME^=KEYWDNM); /* FIND                          */ 01154000
         B     @DE00484                                            0484 01155000
@DL00484 DS    0H                                                  0485 01156000
*         TABLEPTR=TABLEPTR+20;     /* PROPER                        */ 01157000
         AL    TABLEPTR,@CF00144                                   0485 01158000
*       END;                        /* ENTRY                         */ 01159000
@DE00484 CLC   TBLNAME(8,TABLEPTR),KEYWDNM                         0486 01160000
         BNE   @DL00484                                            0486 01161000
*       MERGE(TBLDISP)=SAVAREA;     /* MOVE IN OPERATOR'S VALUE      */ 01162000
         LH    @06,TBLDISP(,TABLEPTR)                              0487 01163000
         SLA   @06,3                                               0487 01164000
         LA    @04,MERGE-8(@06)                                    0487 01165000
         MVC   0(8,@04),SAVAREA(SAVEPTR)                           0487 01166000
*     END;                                                         0488 01167000
*   END OVERLAY;                                                   0489 01168000
@EL00007 DS    0H                                                  0489 01169000
@EF00007 DS    0H                                                  0489 01170000
@ER00007 L     @14,12(,@13)                                        0489 01171000
         BR    @14                                                 0489 01172000
         EJECT                                                          01173000
*TCASUPDT:                                                         0490 01174000
*   PROC OPTIONS(SAVE(14));                                        0490 01175000
TCASUPDT ST    @14,12(,@13)                                        0490 01176000
*                                                                  0491 01177000
*/*  *****************************************************************/ 01178000
*/*                                                                  */ 01179000
*/*    THE PURPOSE OF THIS SUBROUTINE IS TO UPDATE THE TCAS TABLE    */ 01180000
*/*    WITH ANY VALUES THAT HAVE CHANGED.  NOTE THAT THE CODING IS   */ 01181000
*/*    DEPENDENT ON THE ORDER OF THE KEYWORD NAMES AS SET UP IN      */ 01182000
*/*    'VERIMBR'.                                                    */ 01183000
*/*                                                                  */ 01184000
*/*  *****************************************************************/ 01185000
*                                                                  0491 01186000
*   IF MLPMUPTB='0'B THEN           /* UPDATE WANTED                 */ 01187000
         TM    MLPMUPTB(MLPMPTR),B'00001000'                       0491 01188000
         BZ    @RT00491                                            0491 01189000
*     RETURN;                       /* NO - EXIT                     */ 01190000
*   SAVEPTR=ADDR(MERGAREA);         /* SET UP PTR                    */ 01191000
         LA    SAVEPTR,MERGAREA                                    0493 01192000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'USERMAX'              */ 01193000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0494 01194000
         BE    @RF00494                                            0494 01195000
*     DO;                           /* YES                           */ 01196000
*LOOP1:                             /* COMPARE AND SWAP LOOP         */ 01197000
*       WRKPRMF1=TCASUSER;          /* CURRENT VALUE                 */ 01198000
LOOP1    L     @06,TCASTPTR(,TWAPTR)                               0496 01199000
         L     @03,TCASUSER(,@06)                                  0496 01200000
         ST    @03,WRKPRMF1                                        0496 01201000
*       WRKPRMF2=WRKPRMF1;          /* VALUE TO WORK WITH            */ 01202000
         ST    @03,WRKPRMF2                                        0497 01203000
*       WRKPRMH=SAVAREAH;           /* NEW 'USERMAX' VALUE           */ 01204000
         LH    @15,SAVAREAH(,SAVEPTR)                              0498 01205000
         STH   @15,WRKPRMH                                         0498 01206000
*       CS(WRKPRMF1,WRKPRMF2,TCASUSER);/* 'USERMAX' STILL OK         */ 01207000
         L     @15,WRKPRMF2                                        0499 01208000
         CS    @03,@15,TCASUSER(@06)                               0499 01209000
         BZ    @BC00499                                            0499 01210000
         ST    @03,WRKPRMF1                                        0499 01211000
@BC00499 DS    0H                                                  0500 01212000
*       BC(7,LOOP1);                /* NO - TRY AGAIN                */ 01213000
         BC    7,LOOP1                                             0500 01214000
*     END;                                                         0501 01215000
*   SAVEPTR=SAVEPTR+8;              /* POINT TO NEXT ENTRY           */ 01216000
@RF00494 AL    SAVEPTR,@CF00034                                    0502 01217000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'ACBPW'                */ 01218000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0503 01219000
         BE    @RF00503                                            0503 01220000
*     TCASACBP=SAVAREA;             /* YES                           */ 01221000
         L     @06,TCASTPTR(,TWAPTR)                               0504 01222000
         MVC   TCASACBP(8,@06),SAVAREA(SAVEPTR)                    0504 01223000
*   SAVEPTR=SAVEPTR+8;              /* POINT TO NEXT ENTRY           */ 01224000
@RF00503 AL    SAVEPTR,@CF00034                                    0505 01225000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'RECONLIM'             */ 01226000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0506 01227000
         BE    @RF00506                                            0506 01228000
*     TCASRCON=SAVAREAH;            /* YES                           */ 01229000
         L     @06,TCASTPTR(,TWAPTR)                               0507 01230000
         LH    @03,SAVAREAH(,SAVEPTR)                              0507 01231000
         STH   @03,TCASRCON(,@06)                                  0507 01232000
*   SAVEPTR=SAVEPTR+8;              /* POINT TO NEXT ENTRY           */ 01233000
@RF00506 AL    SAVEPTR,@CF00034                                    0508 01234000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'BUFRSIZE'             */ 01235000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0509 01236000
         BE    @RF00509                                            0509 01237000
*     TCASCLSZ=SAVAREAH;            /* YES                           */ 01238000
         L     @06,TCASTPTR(,TWAPTR)                               0510 01239000
         LH    @03,SAVAREAH(,SAVEPTR)                              0510 01240000
         STH   @03,TCASCLSZ(,@06)                                  0510 01241000
*   SAVEPTR=SAVEPTR+8;              /* POINT TO NEXT ENTRY           */ 01242000
@RF00509 AL    SAVEPTR,@CF00034                                    0511 01243000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'HIBFREXT'             */ 01244000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0512 01245000
         BE    @RF00512                                            0512 01246000
*     TCASHBUF=SAVAREAF;            /* YES                           */ 01247000
         L     @06,TCASTPTR(,TWAPTR)                               0513 01248000
         L     @03,SAVAREAF(,SAVEPTR)                              0513 01249000
         ST    @03,TCASHBUF(,@06)                                  0513 01250000
*   SAVEPTR=SAVEPTR+8;              /* POINT TO NEXT ENTRY           */ 01251000
@RF00512 AL    SAVEPTR,@CF00034                                    0514 01252000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'LOBFREXT'             */ 01253000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0515 01254000
         BE    @RF00515                                            0515 01255000
*     TCASLBUF=SAVAREAF;            /* YES                           */ 01256000
         L     @06,TCASTPTR(,TWAPTR)                               0516 01257000
         L     @03,SAVAREAF(,SAVEPTR)                              0516 01258000
         ST    @03,TCASLBUF(,@06)                                  0516 01259000
*   SAVEPTR=SAVEPTR+8;              /* POINT TO NEXT ENTRY           */ 01260000
@RF00515 AL    SAVEPTR,@CF00034                                    0517 01261000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'SCRSIZE'              */ 01262000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0518 01263000
         BE    @RF00518                                            0518 01264000
*     TCASCRSZ=SAVAREAH;            /* YES                           */ 01265000
         L     @06,TCASTPTR(,TWAPTR)                               0519 01266000
         LH    @03,SAVAREAH(,SAVEPTR)                              0519 01267000
         STH   @03,TCASCRSZ(,@06)                                  0519 01268000
*   SAVEPTR=SAVEPTR+8;              /* POINT TO NEXT ENTRY           */ 01269000
@RF00518 AL    SAVEPTR,@CF00034                                    0520 01270000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'CHNLEN'               */ 01271000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0521 01272000
         BE    @RF00521                                            0521 01273000
*     TCASCHNL=SAVAREAC;            /* YES                           */ 01274000
         L     @06,TCASTPTR(,TWAPTR)                               0522 01275000
         IC    @03,SAVAREAC(,SAVEPTR)                              0522 01276000
         STC   @03,TCASCHNL(,@06)                                  0522 01277000
*   SAVEPTR=SAVEPTR+8;              /* PT TO NEXT ENTY       @G58AK3A*/ 01278000
@RF00521 AL    SAVEPTR,@CF00034                                    0523 01279000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'MODE'         @G58AK3A*/ 01280000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0524 01281000
         BE    @RF00524                                            0524 01282000
*     IF SAVAREA=BREAK THEN         /*                       @G58AK3A*/ 01283000
         CLC   SAVAREA(8,SAVEPTR),BREAK                            0525 01284000
         BNE   @RF00525                                            0525 01285000
*       TCASBKMD='1'B;              /* YES                   @G58AK3A*/ 01286000
         L     @06,TCASTPTR(,TWAPTR)                               0526 01287000
         OI    TCASBKMD(@06),B'10000000'                           0526 01288000
*     ELSE                                                         0527 01289000
*       ;                           /*                       @G58AK3A*/ 01290000
@RF00525 DS    0H                                                  0528 01291000
*   ELSE                                                           0528 01292000
*     ;                             /*                       @G58AK3A*/ 01293000
@RF00524 DS    0H                                                  0529 01294000
*   SAVEPTR=SAVEPTR+8;              /* PT TO NEXT ENTY       @G58AK3A*/ 01295000
         AL    SAVEPTR,@CF00034                                    0529 01296000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE 'MODESW'       @G58AK3A*/ 01297000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0530 01298000
         BE    @RF00530                                            0530 01299000
*     IF SAVAREA=YES THEN           /*                       @G58AK3A*/ 01300000
         CLC   SAVAREA(8,SAVEPTR),YES                              0531 01301000
         BNE   @RF00531                                            0531 01302000
*       TCASMDSW='1'B;              /* YES                   @G58AK3A*/ 01303000
         L     @06,TCASTPTR(,TWAPTR)                               0532 01304000
         OI    TCASMDSW(@06),B'01000000'                           0532 01305000
*     ELSE                                                         0533 01306000
*       ;                           /*                       @G58AK3A*/ 01307000
@RF00531 DS    0H                                                  0534 01308000
*   ELSE                                                           0534 01309000
*     ;                             /*                       @G58AK3A*/ 01310000
@RF00530 DS    0H                                                  0535 01311000
*   SAVEPTR=SAVEPTR+8;              /* PT TO NEXT ENTY       @ZM20856*/ 01312000
         AL    SAVEPTR,@CF00034                                    0535 01313000
*   IF SAVECHAR^=HEXBC THEN         /* CHANGE RCFBDUMP       @ZM20856*/ 01314000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0536 01315000
         BE    @RF00536                                            0536 01316000
*     DO;                           /* UPDATE RC TABLE       @ZM20856*/ 01317000
*       DUMPPTR=(TCASDUMP+3);       /* INCREMENT PAST COUNT AND    0538 01318000
*                                      RESERVED FIELDS       @ZM20856*/ 01319000
         L     @06,TCASTPTR(,TWAPTR)                               0538 01320000
         LA    @03,3                                               0538 01321000
         AL    @03,TCASDUMP(,@06)                                  0538 01322000
         ST    @03,DUMPPTR                                         0538 01323000
*       RFY                                                        0539 01324000
*         DMPCD BASED(DUMPPTR);     /* RESPECIFY PAST COUNT AND    0539 01325000
*                                      RESERVED              @ZM20856*/ 01326000
*       DO I=1 TO DUMPCNT;          /*                       @ZM20856*/ 01327000
         LA    I,1                                                 0540 01328000
         B     @DE00540                                            0540 01329000
@DL00540 DS    0H                                                  0541 01330000
*         DMPCD(1:3)=SAVAREAI;      /* UPDATE CODE TABL      @ZM20856*/ 01331000
         L     @03,DUMPPTR                                         0541 01332000
         MVC   DMPCD(3,@03),SAVAREAI(SAVEPTR)                      0541 01333000
*         DUMPPTR=DUMPPTR+3;        /* NEXT TABLE ENTY       @ZM20856*/ 01334000
         AL    @03,@CF00118                                        0542 01335000
         ST    @03,DUMPPTR                                         0542 01336000
*         SAVEPTR=SAVEPTR+8;        /* NEXT SAVE ENTRY       @ZM20856*/ 01337000
         AL    SAVEPTR,@CF00034                                    0543 01338000
*       END;                        /* END PROCESS           @ZM20856*/ 01339000
         AL    I,@CF00057                                          0544 01340000
@DE00540 CH    I,DUMPCNT                                           0544 01341000
         BNH   @DL00540                                            0544 01342000
*       RFY                                                        0545 01343000
*         DMPCD BASED(TCASDUMP);    /* RFY TO TOP TABL       @ZM20856*/ 01344000
*       DMPRCCT=DUMPCNT;            /* TOTAL COUNT OF KEYWORD      0546 01345000
*                                      'RCFBDUMP' SPECFIED.NOTE:   0546 01346000
*                                      DUMPCNT WAS UPDATED IN PROC 0546 01347000
*                                      SPLITPRM              @ZM20856*/ 01348000
         L     @06,TCASTPTR(,TWAPTR)                               0546 01349000
         L     @06,TCASDUMP(,@06)                                  0546 01350000
         LH    @15,DUMPCNT                                         0546 01351000
         STC   @15,DMPRCCT(,@06)                                   0546 01352000
*     END;                          /* END 'RCFBDUMP'        @ZM20856   01353000
*                                      UPDATING              @ZM20856*/ 01354000
*   ELSE                                                           0548 01355000
*     ;                                                            0548 01356000
@RF00536 DS    0H                                                  0549 01357000
*   END TCASUPDT;                                                  0549 01358000
@EL00008 DS    0H                                                  0549 01359000
@EF00008 DS    0H                                                  0549 01360000
@ER00008 L     @14,12(,@13)                                        0549 01361000
         BR    @14                                                 0549 01362000
         EJECT                                                          01363000
*WRITEOUT:                                                         0550 01364000
*   PROC OPTIONS(SAVE(14));                                        0550 01365000
WRITEOUT ST    @14,@SA00009                                        0550 01366000
*                                                                  0551 01367000
*/*  *****************************************************************/ 01368000
*/*                                                                  */ 01369000
*/*    THIS SUBROUTINE PRINTS OUT ALL OF THE PARMLIB VALUES FROM THE */ 01370000
*/*    TCAS TABLE.  NOTE THAT THE CODING IS DEPENDENT ON THE ORDER   */ 01371000
*/*    OF THE KEYWORD NAMES AS SET UP IN 'VERIMBR':                  */ 01372000
*/*                                                                  */ 01373000
*/*  *****************************************************************/ 01374000
*                                                                  0551 01375000
*   IF PRINTSW='0'B THEN            /* PRINTOUT WANTED               */ 01376000
         TM    PRINTSW,B'00001000'                                 0551 01377000
         BZ    @RT00551                                            0551 01378000
*     RETURN;                       /* NO - EXIT                     */ 01379000
*   PRNTCC='-';                     /* SKIP                          */ 01380000
         MVI   PRNTCC,C'-'                                         0553 01381000
*   PRNTDATA='';                    /* TWO                           */ 01382000
         MVI   PRNTDATA,C' '                                       0554 01383000
         MVC   PRNTDATA+1(131),PRNTDATA                            0554 01384000
*   CALL PRINTIT;                   /* LINES                         */ 01385000
         BAL   @14,PRINTIT                                         0555 01386000
*   PRNTDATA='CURRENT TCAS PARAMETERS:';/* SUB-HEADER LINE           */ 01387000
         MVI   PRNTDATA+24,C' '                                    0556 01388000
         MVC   PRNTDATA+25(107),PRNTDATA+24                        0556 01389000
         MVC   PRNTDATA(24),@CC01585                               0556 01390000
*   CALL PRINTIT;                   /* PRINT THE SUB-HEADER          */ 01391000
         BAL   @14,PRINTIT                                         0557 01392000
*   PRNTLINE='';                    /* CLEAR THE LINE                */ 01393000
         MVI   PRNTLINE,C' '                                       0558 01394000
         MVC   PRNTLINE+1(132),PRNTLINE                            0558 01395000
*   TABLEPTR=ADDR(VERIMBR);         /* SETUP POINTER                 */ 01396000
         LA    TABLEPTR,VERIMBR                                    0559 01397000
*   WORKPARM=''B;                   /* PRINTOUT                      */ 01398000
         XC    WORKPARM(8),WORKPARM                                0560 01399000
*   WRKPRMH=TCASUMAX;               /* USERMAX=                      */ 01400000
         L     @04,TCASTPTR(,TWAPTR)                               0561 01401000
         LH    @04,TCASUMAX(,@04)                                  0561 01402000
         STH   @04,WRKPRMH                                         0561 01403000
*   CALL EDITIT;                    /* VALUE                         */ 01404000
         BAL   @14,EDITIT                                          0562 01405000
*   WORKPARM=TCASACBP;              /* PRINTOUT                      */ 01406000
         L     @04,TCASTPTR(,TWAPTR)                               0563 01407000
         MVC   WORKPARM(8),TCASACBP(@04)                           0563 01408000
*   CALL EDITIT;                    /* ACBPW= VALUE                  */ 01409000
         BAL   @14,EDITIT                                          0564 01410000
*   WORKPARM=''B;                   /* PRINTOUT                      */ 01411000
         XC    WORKPARM(8),WORKPARM                                0565 01412000
*   WRKPRMH=TCASRCON;               /* RECONLIM=                     */ 01413000
         L     @04,TCASTPTR(,TWAPTR)                               0566 01414000
         LH    @04,TCASRCON(,@04)                                  0566 01415000
         STH   @04,WRKPRMH                                         0566 01416000
*   CALL EDITIT;                    /* VALUE                         */ 01417000
         BAL   @14,EDITIT                                          0567 01418000
*   WORKPARM=''B;                   /* PRINTOUT                      */ 01419000
         XC    WORKPARM(8),WORKPARM                                0568 01420000
*   WRKPRMH=TCASCLSZ;               /* BUFRSIZE=                     */ 01421000
         L     @04,TCASTPTR(,TWAPTR)                               0569 01422000
         LH    @04,TCASCLSZ(,@04)                                  0569 01423000
         STH   @04,WRKPRMH                                         0569 01424000
*   CALL EDITIT;                    /* VALUE                         */ 01425000
         BAL   @14,EDITIT                                          0570 01426000
*   WORKPARM=''B;                   /* PRINTOUT                      */ 01427000
         XC    WORKPARM(8),WORKPARM                                0571 01428000
*   WRKPRMF2=TCASHBUF;              /* HIBFREXT=                     */ 01429000
         L     @04,TCASTPTR(,TWAPTR)                               0572 01430000
         L     @04,TCASHBUF(,@04)                                  0572 01431000
         ST    @04,WRKPRMF2                                        0572 01432000
*   CALL EDITIT;                    /* VALUE                         */ 01433000
         BAL   @14,EDITIT                                          0573 01434000
*   WORKPARM=''B;                   /* PRINTOUT                      */ 01435000
         XC    WORKPARM(8),WORKPARM                                0574 01436000
*   WRKPRMF2=TCASLBUF;              /* LOBFREXT=                     */ 01437000
         L     @04,TCASTPTR(,TWAPTR)                               0575 01438000
         L     @04,TCASLBUF(,@04)                                  0575 01439000
         ST    @04,WRKPRMF2                                        0575 01440000
*   CALL EDITIT;                    /* VALUE                         */ 01441000
         BAL   @14,EDITIT                                          0576 01442000
*   WORKPARM=''B;                   /* PRINTOUT                      */ 01443000
         XC    WORKPARM(8),WORKPARM                                0577 01444000
*   WRKPRMH=TCASCRSZ;               /* SCRSIZE=                      */ 01445000
         L     @04,TCASTPTR(,TWAPTR)                               0578 01446000
         LH    @04,TCASCRSZ(,@04)                                  0578 01447000
         STH   @04,WRKPRMH                                         0578 01448000
*   CALL EDITIT;                    /* VALUE                         */ 01449000
         BAL   @14,EDITIT                                          0579 01450000
*   WORKPARM=''B;                   /* PRINTOUT                      */ 01451000
         XC    WORKPARM(8),WORKPARM                                0580 01452000
*   WRKPRMC=TCASCHNL;               /* CHNLEN=                       */ 01453000
         L     @04,TCASTPTR(,TWAPTR)                               0581 01454000
         IC    @02,TCASCHNL(,@04)                                  0581 01455000
         STC   @02,WRKPRMC                                         0581 01456000
*   CALL EDITIT;                    /* VALUE                         */ 01457000
         BAL   @14,EDITIT                                          0582 01458000
*   IF TCASBKMD='1'B THEN           /* PRINTOUT              @G58AK3A*/ 01459000
         L     @06,TCASTPTR(,TWAPTR)                               0583 01460000
         TM    TCASBKMD(@06),B'10000000'                           0583 01461000
         BNO   @RF00583                                            0583 01462000
*     WORKPARM=BREAK;               /* MODE=                 @G58AK3A*/ 01463000
         MVC   WORKPARM(8),BREAK                                   0584 01464000
*   ELSE                            /* VALUE                 @G58AK3A*/ 01465000
*     WORKPARM=NOBREAK;             /*                       @G58AK3A*/ 01466000
         B     @RC00583                                            0585 01467000
@RF00583 MVC   WORKPARM(8),NOBREAK                                 0585 01468000
*   CALL EDITIT;                    /*                       @G58AK3A*/ 01469000
@RC00583 BAL   @14,EDITIT                                          0586 01470000
*   IF TCASMDSW='1'B THEN           /* PRINTOUT              @G58AK3A*/ 01471000
         L     @06,TCASTPTR(,TWAPTR)                               0587 01472000
         TM    TCASMDSW(@06),B'01000000'                           0587 01473000
         BNO   @RF00587                                            0587 01474000
*     WORKPARM=YES;                 /* MODESW=               @G58AK3A*/ 01475000
         MVC   WORKPARM(8),YES                                     0588 01476000
*   ELSE                            /* VALUE                 @G58AK3A*/ 01477000
*     WORKPARM=NO;                  /*                       @G58AK3A*/ 01478000
         B     @RC00587                                            0589 01479000
@RF00587 MVC   WORKPARM(8),NO                                      0589 01480000
*   CALL EDITIT;                    /*                       @G58AK3A*/ 01481000
@RC00587 BAL   @14,EDITIT                                          0590 01482000
*   DUMPPTR=(TCASDUMP+3);           /* SKIP TO CODES         @ZM20856*/ 01483000
         L     @04,TCASTPTR(,TWAPTR)                               0591 01484000
         LA    @15,3                                               0591 01485000
         AL    @15,TCASDUMP(,@04)                                  0591 01486000
         ST    @15,DUMPPTR                                         0591 01487000
*   DO N=1 TO DUMPCNT;              /* EDIT PARAMETER FOR EACH VALID    01488000
*                                      'RCFBDUMP' KEYWORD SPECIFIED     01489000
*                                                            @ZM20856*/ 01490000
         LA    @04,1                                               0592 01491000
         B     @DE00592                                            0592 01492000
@DL00592 DS    0H                                                  0593 01493000
*     CALL EDITIT;                  /* EDIT KEYWORDS         @ZM20856*/ 01494000
         BAL   @14,EDITIT                                          0593 01495000
*     DUMPPTR=DUMPPTR+3;            /* NEXT ENTRY            @ZM20856*/ 01496000
         LA    @04,3                                               0594 01497000
         AL    @04,DUMPPTR                                         0594 01498000
         ST    @04,DUMPPTR                                         0594 01499000
*   END;                            /*                       @ZM20856*/ 01500000
         LA    @04,1                                               0595 01501000
         AH    @04,N                                               0595 01502000
@DE00592 STH   @04,N                                               0595 01503000
         CH    @04,DUMPCNT                                         0595 01504000
         BNH   @DL00592                                            0595 01505000
*   EDFIELD(1)=HEXFF;               /* CAUSE LAST LINE               */ 01506000
         MVI   EDFIELD,X'FF'                                       0596 01507000
*   CALL NSRTNPRT;                  /* TO BE PRINTED                 */ 01508000
         BAL   @14,NSRTNPRT                                        0597 01509000
*   GEN(CLOSE PRINTOUT)                                            0598 01510000
*   REFS(R0,R1,R14,R15,PRINTOUT);                                  0598 01511000
         CLOSE PRINTOUT                                                 01512000
*   END WRITEOUT;                                                  0599 01513000
@EL00009 DS    0H                                                  0599 01514000
@EF00009 DS    0H                                                  0599 01515000
@ER00009 L     @14,@SA00009                                        0599 01516000
         BR    @14                                                 0599 01517000
         EJECT                                                          01518000
*EDITIT:                                                           0600 01519000
*   PROC OPTIONS(SAVE(14));                                        0600 01520000
EDITIT   ST    @14,@SA00010                                        0600 01521000
*                                                                  0601 01522000
*/*  *****************************************************************/ 01523000
*/*                                                                  */ 01524000
*/*    THIS SUBROUTINE TAKES A KEYWORD NAME, ITS VALUE, PLACES THEM  */ 01525000
*/*    INTO AN EDITTED FORMAT, AND PRINTS THEM.  UPON ENTRY,         */ 01526000
*/*    'TABLEPTR' POINTS AT THE TABLE ENTRY, AND 'WORKPARM' CONTAINS */ 01527000
*/*    THE PARAMETER VALUE, WITH THE EXCEPTION OF THE RCFBDUMP       */ 01528000
*/*    KEYWORD, WHICH SETS UP 'WORKPARM' HERE.                       */ 01529000
*/*  *****************************************************************/ 01530000
*                                                                  0601 01531000
*   EDITFLD='';                     /* CLEAR WORK FIELD              */ 01532000
         MVI   EDITFLD,C' '                                        0601 01533000
         MVC   EDITFLD+1(19),EDITFLD                               0601 01534000
*   SCANPTR=TABLEPTR;               /* SETUP PTR                     */ 01535000
         LR    SCANPTR,TABLEPTR                                    0602 01536000
*   DO I=1 TO 8 WHILE(WORKCHAR^=' ');/* MOVE IN KEYWORD NAME         */ 01537000
         LA    I,1                                                 0603 01538000
@DL00603 CLI   WORKCHAR(SCANPTR),C' '                              0603 01539000
         BE    @DC00603                                            0603 01540000
*     EDFIELD(I)=WORKCHAR;                                         0604 01541000
         LA    @04,EDFIELD-1(I)                                    0604 01542000
         MVC   0(1,@04),WORKCHAR(SCANPTR)                          0604 01543000
*     SCANPTR=SCANPTR+1;                                           0605 01544000
         AL    SCANPTR,@CF00057                                    0605 01545000
*   END;                                                           0606 01546000
         AL    I,@CF00057                                          0606 01547000
         C     I,@CF00034                                          0606 01548000
         BNH   @DL00603                                            0606 01549000
@DC00603 DS    0H                                                  0607 01550000
*   EDFIELD(I)='=';                 /* ADD '=' SIGN                  */ 01551000
         LA    @04,EDFIELD-1(I)                                    0607 01552000
         MVI   0(@04),C'='                                         0607 01553000
*   I=I+1;                          /* POINT PAST '=' SIGN           */ 01554000
         LA    @04,1                                               0608 01555000
         ALR   I,@04                                               0608 01556000
*   IF TBLNAME=RCFBDUMP THEN        /* 'RCFBDUMP'            @ZM20856*/ 01557000
         CLC   TBLNAME(8,TABLEPTR),RCFBDUMP                        0609 01558000
         BNE   @RF00609                                            0609 01559000
*     DO;                           /* PROCESS PARM          @ZM20856*/ 01560000
*       RFY                                                        0611 01561000
*         DMPCD BASED(DUMPPTR);                                    0611 01562000
*       WRKPRMF=''B;                /* ZERO WORK FIELD       @ZM20856*/ 01563000
         XC    WRKPRMF(8),WRKPRMF                                  0612 01564000
*       WORKPARM(8:8)=DMPCD(1:1);   /* EXTRACT RC            @ZM20856*/ 01565000
         L     @02,DUMPPTR                                         0613 01566000
         MVC   WORKPARM+7(1),DMPCD(@02)                            0613 01567000
*       TEMPAREA(8)=WORKPARM(8);    /* SAVE RC               @ZM20856*/ 01568000
         MVC   TEMPAREA+7(1),WORKPARM+7                            0614 01569000
*       SLDL(TEMPAREA,4);           /* SHIFT RC TO PROPER POSITION 0615 01570000
*                                                            @ZM21059*/ 01571000
         LM    @00,@01,TEMPAREA                                    0615 01572000
         SLDL  @00,4                                               0615 01573000
         STM   @00,@01,TEMPAREA                                    0615 01574000
*       WORKPARM(8:8)=WORKPARM(8:8)&'0F'X;/* ELIMINATE ZONED PORTION    01575000
*                                      OF BYTE RC            @ZM20856*/ 01576000
         NI    WORKPARM+7,X'0F'                                    0616 01577000
*       TEMPAREA(7:8)=TEMPAREA(7:8)&'0F00'X;/* ELIMINATE DIGIT     0617 01578000
*                                      PORTION OF BYTE RC    @ZM21059*/ 01579000
         NC    TEMPAREA+6(2),@CB01595                              0617 01580000
*       WRKPRMF=WRKPRMF|TEMPAREA;   /* MERGE BYTES           @ZM20856*/ 01581000
         OC    WRKPRMF(8),TEMPAREA                                 0618 01582000
*       TR(WORKPARM(7:8),TABDEC);   /* TO PRINTABLES         @ZM20856*/ 01583000
         TR    WORKPARM+6(2),TABDEC                                0619 01584000
*       EDITFLD(I:(I+1))=WORKPARM(7:8);/* TO EDIT FIELD      @ZM21059*/ 01585000
         LA    @01,EDITFLD-1(I)                                    0620 01586000
         MVC   0(2,@01),WORKPARM+6                                 0620 01587000
*       I=I+2;                      /* UPDATE 2 BYTES        @ZM20856*/ 01588000
         LA    @15,2                                               0621 01589000
         ALR   I,@15                                               0621 01590000
*       WRKPRMF=''B;                /* ZERO WORK FIELD       @ZM20856*/ 01591000
         XC    WRKPRMF(8),WRKPRMF                                  0622 01592000
*       WORKPARM(8:8)=DMPCD(2:2);   /* EXTRACT FB            @ZM20856*/ 01593000
         MVC   WORKPARM+7(1),DMPCD+1(@02)                          0623 01594000
*       TEMPAREA(8)=WORKPARM(8);    /* SAVE FB               @ZM20856*/ 01595000
         MVC   TEMPAREA+7(1),WORKPARM+7                            0624 01596000
*       SLDL(TEMPAREA,4);           /* SHIFT FB TO PROPER POSITION 0625 01597000
*                                                            @ZM21059*/ 01598000
         LM    @00,@01,TEMPAREA                                    0625 01599000
         SLDL  @00,4                                               0625 01600000
         STM   @00,@01,TEMPAREA                                    0625 01601000
*       WORKPARM(8:8)=WORKPARM(8:8)&'0F'X;/* ELIMINATE ZONED PORTION    01602000
*                                      OF BYTE FB            @ZM20856*/ 01603000
         NI    WORKPARM+7,X'0F'                                    0626 01604000
*       TEMPAREA(7:8)=TEMPAREA(7:8)&'0F00'X;/* ELIMINATE DIGIT     0627 01605000
*                                      PORTION OF BYTE FB    @ZM21059*/ 01606000
         NC    TEMPAREA+6(2),@CB01595                              0627 01607000
*       WRKPRMF=WRKPRMF|TEMPAREA;   /* MERGE BYTES           @ZM20856*/ 01608000
         OC    WRKPRMF(8),TEMPAREA                                 0628 01609000
*       TR(WORKPARM(7:8),TABDEC);   /* TO PRINTABLES         @ZM20856*/ 01610000
         TR    WORKPARM+6(2),TABDEC                                0629 01611000
*       EDITFLD(I:(I+1))=WORKPARM(7:8);/* TO EDIT FIELD      @ZM21059*/ 01612000
         LA    @01,EDITFLD-1(I)                                    0630 01613000
         MVC   0(2,@01),WORKPARM+6                                 0630 01614000
*       I=I+2;                      /* UPDATE 2 BYTES        @ZM20856*/ 01615000
         ALR   I,@15                                               0631 01616000
*       WRKPRMF=''B;                /* ZERO WORK FIELD       @ZM20856*/ 01617000
         XC    WRKPRMF(8),WRKPRMF                                  0632 01618000
*       WORKPARM(8:8)=DMPCD(3:3);   /* EXTRACT SDUMP         @ZM20856*/ 01619000
         MVC   WORKPARM+7(1),DMPCD+2(@02)                          0633 01620000
*       CVD(WRKPRMF2,TEMPAREA);     /* TO DECIMAL            @ZM20856*/ 01621000
         L     @02,WRKPRMF2                                        0634 01622000
         CVD   @02,TEMPAREA                                        0634 01623000
*       UNPK(WORKPARM,TEMPAREA(8)); /* UNPACK                @ZM20856*/ 01624000
         UNPK  WORKPARM(8),TEMPAREA+7(1)                           0635 01625000
*       WORKPARM(8)=WORKPARM(8)|'F0'X;/* REMOVE SIGN         @ZM20856*/ 01626000
         OI    WORKPARM+7,X'F0'                                    0636 01627000
*       EDFIELD(I)=WORKPARM(8);     /* TO EDIT FIELD         @ZM20856*/ 01628000
         LA    @02,EDFIELD-1(I)                                    0637 01629000
         MVC   0(1,@02),WORKPARM+7                                 0637 01630000
*       I=I+1;                      /* UPDATE 1 BYTES        @ZM20856*/ 01631000
         ALR   I,@04                                               0638 01632000
*       RFY                                                        0639 01633000
*         DMPCD BASED(TCASDUMP);    /*                       @ZM20856*/ 01634000
*     END;                          /* END RCFBDUMP          @ZM20856*/ 01635000
*   ELSE                                                           0641 01636000
*     DO;                           /* OTHER KEYWORDS        @ZM20856*/ 01637000
         B     @RC00609                                            0641 01638000
@RF00609 DS    0H                                                  0642 01639000
*       IF TBLBINRY='1'B THEN       /* PARM VALUE A NUMBER           */ 01640000
         TM    TBLBINRY(TABLEPTR),B'00100000'                      0642 01641000
         BNO   @RF00642                                            0642 01642000
*         CALL PARMMOV;             /* PROCESS ALL OTHER KEYWORDS  0643 01643000
*                                                            @ZM20856*/ 01644000
         BAL   @14,PARMMOV                                         0643 01645000
*       ELSE                                                       0644 01646000
*         DO;                       /* NO - ALPHANUMERIC             */ 01647000
         B     @RC00642                                            0644 01648000
@RF00642 DS    0H                                                  0645 01649000
*           SCANPTR=ADDR(WORKPARM); /* SETUP PTR                     */ 01650000
         LA    SCANPTR,WORKPARM                                    0645 01651000
*           DO J=1 TO 8 WHILE(WORKCHAR^=' ');/* MOVE IN VALUE        */ 01652000
         LA    J,1                                                 0646 01653000
@DL00646 CLI   WORKCHAR(SCANPTR),C' '                              0646 01654000
         BE    @DC00646                                            0646 01655000
*             EDFIELD(I)=WORKCHAR;                                 0647 01656000
         LA    @02,EDFIELD-1(I)                                    0647 01657000
         MVC   0(1,@02),WORKCHAR(SCANPTR)                          0647 01658000
*             I=I+1;                                               0648 01659000
         LA    @02,1                                               0648 01660000
         ALR   I,@02                                               0648 01661000
*             SCANPTR=SCANPTR+1;                                   0649 01662000
         ALR   SCANPTR,@02                                         0649 01663000
*           END;                                                   0650 01664000
         AL    J,@CF00057                                          0650 01665000
         C     J,@CF00034                                          0650 01666000
         BNH   @DL00646                                            0650 01667000
@DC00646 DS    0H                                                  0651 01668000
*         END;                                                     0651 01669000
*     END;                          /*                       @ZM20856*/ 01670000
@RC00642 DS    0H                                                  0653 01671000
*   I=I-1;                          /* LENGTH OF EDITTED DATA        */ 01672000
@RC00609 BCTR  I,0                                                 0653 01673000
*   CALL NSRTNPRT;                  /* INSERT & PRINT VALUE          */ 01674000
         BAL   @14,NSRTNPRT                                        0654 01675000
*   TABLEPTR=TABLEPTR+20;           /* PT AT NEXT TABLE ENTRY        */ 01676000
         AL    TABLEPTR,@CF00144                                   0655 01677000
*   END EDITIT;                                                    0656 01678000
@EL00010 DS    0H                                                  0656 01679000
@EF00010 DS    0H                                                  0656 01680000
@ER00010 L     @14,@SA00010                                        0656 01681000
         BR    @14                                                 0656 01682000
         EJECT                                                          01683000
*NSRTNPRT:                                                         0657 01684000
*   PROC OPTIONS(SAVE(14));                                        0657 01685000
NSRTNPRT ST    @14,@SA00011                                        0657 01686000
*                                                                  0658 01687000
*/*  *****************************************************************/ 01688000
*/*                                                                  */ 01689000
*/*    THIS SUBROUTINE BUILDS UP A PRINT LINE FROM DATA FOUND IN     */ 01690000
*/*    'EDITFLD', AND WHEN THE PRINT LINE IS FULL, PRINTS IT.        */ 01691000
*/*                                                                  */ 01692000
*/*  *****************************************************************/ 01693000
*                                                                  0658 01694000
*   IF EDFIELD(1)=HEXFF THEN        /* PRINT LAST LINE               */ 01695000
         CLI   EDFIELD,X'FF'                                       0658 01696000
         BNE   @RF00658                                            0658 01697000
*     DO;                           /* YES                           */ 01698000
*       CALL PRINTIT;               /* PRINT IT                      */ 01699000
         BAL   @14,PRINTIT                                         0660 01700000
*       PRNTDAT5='';                /* BLANK OUT LINE                */ 01701000
         MVI   PRNTDAT5,C' '                                       0661 01702000
         MVC   PRNTDAT5+1(127),PRNTDAT5                            0661 01703000
*       PRNTPTR=ADDR(PRNTDAT5);     /* RE-SET PTR                    */ 01704000
         LA    PRNTPTR,PRNTDAT5                                    0662 01705000
*     END;                                                         0663 01706000
*   ELSE                                                           0664 01707000
*     DO;                                                          0664 01708000
         B     @RC00658                                            0664 01709000
@RF00658 DS    0H                                                  0665 01710000
*       IF PRNTPTR>ADDR(PRNTDAT5) THEN/* VALUE ALREADY THERE         */ 01711000
         LA    @04,PRNTDAT5                                        0665 01712000
         CR    PRNTPTR,@04                                         0665 01713000
         BNH   @RF00665                                            0665 01714000
*         DO;                       /* YES                           */ 01715000
*           PRNTCHAR=',';           /* PUT COMMA AFTER IT            */ 01716000
         MVI   PRNTCHAR(PRNTPTR),C','                              0667 01717000
*           PRNTPTR=PRNTPTR+1;      /* PT PAST COMMA                 */ 01718000
         AL    PRNTPTR,@CF00057                                    0668 01719000
*         END;                                                     0669 01720000
*       IF(PRNTPTR+I)>PRNTEND THEN  /* ROOM LEFT ON PRINT LINE       */ 01721000
@RF00665 LR    @04,PRNTPTR                                         0670 01722000
         ALR   @04,I                                               0670 01723000
         C     @04,PRNTEND                                         0670 01724000
         BNH   @RF00670                                            0670 01725000
*         DO;                       /* NO                            */ 01726000
*           CALL PRINTIT;           /* PRINT IT                      */ 01727000
         BAL   @14,PRINTIT                                         0672 01728000
*           PRNTDAT5='';            /* BLANK OUT LINE                */ 01729000
         MVI   PRNTDAT5,C' '                                       0673 01730000
         MVC   PRNTDAT5+1(127),PRNTDAT5                            0673 01731000
*           PRNTPTR=ADDR(PRNTDAT5); /* RE-SET PTR                    */ 01732000
         LA    PRNTPTR,PRNTDAT5                                    0674 01733000
*         END;                                                     0675 01734000
*       DO J=1 TO I;                /* MOVE EDITTED                  */ 01735000
@RF00670 LA    J,1                                                 0676 01736000
         B     @DE00676                                            0676 01737000
@DL00676 DS    0H                                                  0677 01738000
*         PRNTCHAR=EDFIELD(J);      /* DATA                          */ 01739000
         LA    @02,EDFIELD-1(J)                                    0677 01740000
         MVC   PRNTCHAR(1,PRNTPTR),0(@02)                          0677 01741000
*         PRNTPTR=PRNTPTR+1;        /* INTO                          */ 01742000
         AL    PRNTPTR,@CF00057                                    0678 01743000
*       END;                        /* PRINT LINE                    */ 01744000
         AL    J,@CF00057                                          0679 01745000
@DE00676 CR    J,I                                                 0679 01746000
         BNH   @DL00676                                            0679 01747000
*     END;                                                         0680 01748000
*   END NSRTNPRT;                                                  0681 01749000
@EL00011 DS    0H                                                  0681 01750000
@EF00011 DS    0H                                                  0681 01751000
@ER00011 L     @14,@SA00011                                        0681 01752000
         BR    @14                                                 0681 01753000
         EJECT                                                          01754000
*PRINTIT:                                                          0682 01755000
*   PROC OPTIONS(SAVE(14));                                        0682 01756000
PRINTIT  ST    @14,@SA00012                                        0682 01757000
*                                                                  0683 01758000
*/*  *****************************************************************/ 01759000
*/*                                                                  */ 01760000
*/*    THIS SUBROUTINE PRINTS A LINE OF DATA.  IN ADDITION, IF A     */ 01761000
*/*    SYNAD ERROR IS DETECTED, THE 'PRINTSW' IS TURNED OFF AND THE  */ 01762000
*/*    FILE IS CLOSED.                                               */ 01763000
*/*                                                                  */ 01764000
*/*  *****************************************************************/ 01765000
*                                                                  0683 01766000
*   IF PRINTSW='0'B THEN            /* PRINTOUT WANTED               */ 01767000
         TM    PRINTSW,B'00001000'                                 0683 01768000
         BZ    @RT00683                                            0683 01769000
*     RETURN;                       /* NO - EXIT                     */ 01770000
*   GEN(PUT   PRINTOUT,PRNTLINE)                                   0685 01771000
*   REFS(R0,R1,R14,R15,PRINTOUT,PRNTLINE);                         0685 01772000
         PUT   PRINTOUT,PRNTLINE                                        01773000
*   IF SYNADSW2='Y' THEN            /* SYNAD ERROR                   */ 01774000
         CLI   SYNADSW2,C'Y'                                       0686 01775000
         BNE   @RF00686                                            0686 01776000
*     DO;                           /* YES                           */ 01777000
*       RESPECIFY                                                  0688 01778000
*        (R1) RESTRICTED;                                          0688 01779000
*       R1=18;                      /* MESSAGE NUMBER                */ 01780000
         LA    R1,18                                               0689 01781000
*       CALL MSGBLK;                /* ADDR OF LIST FORM OF MSG      */ 01782000
         L     @15,TWAMSG(,TWAPTR)                                 0690 01783000
         BALR  @14,@15                                             0690 01784000
*       R1=ADDR(IKT018I);           /* ADDR OF LIST FORM             */ 01785000
         LA    @04,IKT018I(,R1)                                    0691 01786000
         LR    R1,@04                                              0691 01787000
*       GEN(WTO   MF=(E,(1)))       /* ISSUE WTO                     */ 01788000
*       REFS(R0,R1,R14,R15);                                       0692 01789000
         WTO   MF=(E,(1))                                               01790000
*       RESPECIFY                                                  0693 01791000
*        (R1) UNRESTRICTED;                                        0693 01792000
*       PRINTSW='0'B;               /* TURN OFF PRINT SW             */ 01793000
         NI    PRINTSW,B'11110111'                                 0694 01794000
*       GEN(CLOSE PRINTOUT)         /* CLOSE FILE                    */ 01795000
*       REFS(R0,R1,R14,R15,PRINTOUT);                              0695 01796000
         CLOSE PRINTOUT                                                 01797000
*     END;                                                         0696 01798000
*   END PRINTIT;                                                   0697 01799000
@EL00012 DS    0H                                                  0697 01800000
@EF00012 DS    0H                                                  0697 01801000
@ER00012 L     @14,@SA00012                                        0697 01802000
         BR    @14                                                 0697 01803000
         EJECT                                                          01804000
*                                                                  0698 01805000
*/*  *****************************************************************/ 01806000
*/*                                                                  */ 01807000
*/*    IN ORDER TO MAKE PARAMETER VALIDATION AS INDEPENDENT AS       */ 01808000
*/*    POSSIBLE, THE ROUTINES WHICH DO THIS ARE PRIMARILY            */ 01809000
*/*    TABLE-DRIVEN.  THE MAIN TABLES WHICH ACCOMPLISH THIS ARE      */ 01810000
*/*    CALLED VERIFY TABLES ('VERIBUFR', 'VERIMBR', ETC.).  THEY     */ 01811000
*/*    CONTAIN THE CONTROL INFORMATION REGARDING EACH KEYWORD.       */ 01812000
*/*                                                                  */ 01813000
*/*    AN ELEMENT IN A VERIFY TABLE IS ORGANIZED AS FOLLOWS (SEE     */ 01814000
*/*    'SCANTBL'):                                                   */ 01815000
*/*    -   KEYWORD NAME                                              */ 01816000
*/*    -   DISPLACEMENT INDEX INTO A SAVE AREA WHERE THE VALUE       */ 01817000
*/*        ENTERED WITH THE KEYWORD NAME IS SAVED.                   */ 01818000
*/*    -   FLAGS, WHICH SHOW WHAT KIND OF EDITTING TO DO ON THE      */ 01819000
*/*        ENTERED VALUE.                                            */ 01820000
*/*    -   IF THE ENTERED VALUE HAS TO BE ONE OF A SET OF VALUES, A  */ 01821000
*/*        POINTER TO A LIST OF THE VALUES,                          */ 01822000
*/*      OR                                                          */ 01823000
*/*        A LOW NUMBER AND A HIGH NUMBER USED FOR A RANGE CHECK.    */ 01824000
*/*                                                                  */ 01825000
*/*    THE SUBROUTINES WHICH ACTUALLY DO THE VALIDATION ARE          */ 01826000
*/*    'FNDNMTCH', 'PRCSPARM', 'NBRXTRCT', AND 'REGXTRCT'.           */ 01827000
*/*                                                                  */ 01828000
*/*  *****************************************************************/ 01829000
*                                                                  0698 01830000
         EJECT                                                          01831000
*FNDNMTCH:                                                         0698 01832000
*   PROC OPTIONS(SAVE(14));                                        0698 01833000
FNDNMTCH ST    @14,12(,@13)                                        0698 01834000
*                                                                  0699 01835000
*/*  *****************************************************************/ 01836000
*/*                                                                  */ 01837000
*/*    THIS SUBROUTINE HAS TWO FUNCTIONS: 1) SCAN A BUFFER LOOKING   */ 01838000
*/*    FOR A KEYWORD NAME, AND 2) MATCH THAT KEYWORD NAME AGAINST THE*/ 01839000
*/*    ENTRIES IN A TABLE.  UPON ENTRY, 'SCANPTR' SHOULD POINT AT THE*/ 01840000
*/*    BUFFER TO BE SCANNED, AND 'TABLEPTR' SHOULD POINT AT THE      */ 01841000
*/*    TABLE USED FOR MATCHING.  UPON EXIT, 'SCANPTR' WILL POINT AT  */ 01842000
*/*    THE FIRST CHARACTER PAST THE '=' SIGN, 'WORKPARM' WILL        */ 01843000
*/*    CONTAIN THE KEYWORD NAME LEFT-JUSTIFIED AND BLANK-FILLED, AND */ 01844000
*/*    'TABLEPTR' WILL POINT AT EITHER THE MATCHING TABLE ENTRY, OR  */ 01845000
*/*    THE END OF THE TABLE IF NO MATCH WAS FOUND.                   */ 01846000
*/*                                                                  */ 01847000
*/*  *****************************************************************/ 01848000
*                                                                  0699 01849000
*   WORKPARM=BLANK;                 /* BLANK OUT WORK AREA           */ 01850000
         MVC   WORKPARM(8),@CC00097                                0699 01851000
*   I=0;                            /* ZERO OUT COUNTER MOVE KEYWORD    01852000
*                                      NAME INTO WORK AREA, AND ALSO    01853000
*                                      CHECK ITS LENGTH              */ 01854000
         SLR   I,I                                                 0700 01855000
*   DO WHILE(WORKCHAR^='='&WORKCHAR^=' '&WORKCHAR^=',');           0701 01856000
         B     @DE00701                                            0701 01857000
@DL00701 DS    0H                                                  0702 01858000
*     I=I+1;                                                       0702 01859000
         AL    I,@CF00057                                          0702 01860000
*     IF I<9 THEN                                                  0703 01861000
         C     I,@CF00069                                          0703 01862000
         BNL   @RF00703                                            0703 01863000
*       WORKPRM(I)=WORKCHAR;                                       0704 01864000
         LA    @04,WORKPRM-1(I)                                    0704 01865000
         MVC   0(1,@04),WORKCHAR(SCANPTR)                          0704 01866000
*     SCANPTR=SCANPTR+1;                                           0705 01867000
@RF00703 AL    SCANPTR,@CF00057                                    0705 01868000
*   END;                                                           0706 01869000
@DE00701 CLI   WORKCHAR(SCANPTR),C'='                              0706 01870000
         BE    @DC00701                                            0706 01871000
         CLI   WORKCHAR(SCANPTR),C' '                              0706 01872000
         BE    @DC00701                                            0706 01873000
         CLI   WORKCHAR(SCANPTR),C','                              0706 01874000
         BNE   @DL00701                                            0706 01875000
@DC00701 DS    0H                                                  0707 01876000
*   IF I=0|                         /* ERROR IN                      */ 01877000
*       I>8|                        /* LENGTH OR                     */ 01878000
*       WORKCHAR=' '|               /* ENDING                        */ 01879000
*       WORKCHAR=',' THEN           /* CHARACTER                     */ 01880000
         LTR   I,I                                                 0707 01881000
         BZ    @RT00707                                            0707 01882000
         C     I,@CF00034                                          0707 01883000
         BH    @RT00707                                            0707 01884000
         CLI   WORKCHAR(SCANPTR),C' '                              0707 01885000
         BE    @RT00707                                            0707 01886000
         CLI   WORKCHAR(SCANPTR),C','                              0707 01887000
         BNE   @RF00707                                            0707 01888000
@RT00707 DS    0H                                                  0708 01889000
*     DO;                           /* YES                           */ 01890000
*       SCANERR='1'B;               /* SHOW ERROR                    */ 01891000
         OI    SCANERR,B'10000000'                                 0709 01892000
*       RETURN;                     /* EXIT                          */ 01893000
@EL00013 DS    0H                                                  0710 01894000
@EF00013 DS    0H                                                  0710 01895000
@ER00013 L     @14,12(,@13)                                        0710 01896000
         BR    @14                                                 0710 01897000
*     END;                                                         0711 01898000
*   ELSE                            /* NO                            */ 01899000
*     SCANPTR=SCANPTR+1;            /* POINT PAST '=' SIGN SCAN TABLE   01900000
*                                      LOOKING FOR A MATCH, OR THE 0712 01901000
*                                      END OF THE TABLE              */ 01902000
@RF00707 AL    SCANPTR,@CF00057                                    0712 01903000
*   DO WHILE(TBLNAME1^='FF'X&TBLNAME^=WORKPARM);                   0713 01904000
         B     @DE00713                                            0713 01905000
@DL00713 DS    0H                                                  0714 01906000
*     TABLEPTR=TABLEPTR+20;                                        0714 01907000
         AL    TABLEPTR,@CF00144                                   0714 01908000
*   END;                                                           0715 01909000
@DE00713 CLI   TBLNAME1(TABLEPTR),X'FF'                            0715 01910000
         BE    @DC00713                                            0715 01911000
         CLC   TBLNAME(8,TABLEPTR),WORKPARM                        0715 01912000
         BNE   @DL00713                                            0715 01913000
@DC00713 DS    0H                                                  0716 01914000
*   IF TBLNAME1='FF'X THEN          /* END OF TABLE                  */ 01915000
         CLI   TBLNAME1(TABLEPTR),X'FF'                            0716 01916000
         BNE   @RF00716                                            0716 01917000
*     SCANERR='1'B;                 /* YES - SHOW ERROR              */ 01918000
         OI    SCANERR,B'10000000'                                 0717 01919000
*   END FNDNMTCH;                                                  0718 01920000
         B     @EL00013                                            0718 01921000
         EJECT                                                          01922000
*PRCSPARM:                                                         0719 01923000
*   PROC OPTIONS(SAVE(14));                                        0719 01924000
PRCSPARM ST    @14,@SA00014                                        0719 01925000
*                                                                  0720 01926000
*/*  *****************************************************************/ 01927000
*/*                                                                  */ 01928000
*/*    THIS SUBROUTINE WILL VERIFY THAT THE PARAMETER FOLLOWING A    */ 01929000
*/*    KEYWORD NAME IS A LEGAL PARAMETER.  UPON ENTRY, 'SCANPTR'     */ 01930000
*/*    SHOULD POINT TO THE FIRST CHARACTER OF THE PARAMETER,         */ 01931000
*/*    'TABLEPTR' SHOULD POINT AT THE TABLE ENTRY WE WILL USE FOR    */ 01932000
*/*    VALIDATION, AND 'SAVEPTR' SHOULD POINT AT TABLE WHICH WILL BE */ 01933000
*/*    USED TO SAVE THE EDITED AND VERIFIED PARAMETER.               */ 01934000
*/*    UPON EXIT, 'SCANPTR' WILL POINT AT THE CHARACTER WHICH STOPPED*/ 01935000
*/*    THE SCANNING OF THE PARAMETER, 'TABLEPTR' WILL BE UNCHANGED,  */ 01936000
*/*    AND 'SAVEPTR' WILL POINT AT THE SAVE AREA WHERE THE EDITED    */ 01937000
*/*    AND VERIFIED PARAMETER IS.  NOTES: - IF THE PARAMETER IS      */ 01938000
*/*    INVALID, THE FIRST BYTE OF THE SAVE AREA WILL BE 'FF'X.       */ 01939000
*/*                                       - IF MORE THAN ONE         */ 01940000
*/*    PARAMETER IS ENTERED FOR A SINGLE KEYWORD, THEN THAT          */ 01941000
*/*    KEYWORD WILL BE FLAGGED AS AN ERROR, WITH THE EXCEPTION OF    */ 01942000
*/*    THE 'RCFBDUMP' KEYWORD.                                       */ 01943000
*/*  *****************************************************************/ 01944000
*                                                                  0720 01945000
*   IF TBLZERO='1'B THEN            /* ZERO-FILL                     */ 01946000
         TM    TBLZERO(TABLEPTR),B'00001000'                       0720 01947000
         BNO   @RF00720                                            0720 01948000
*     WORKPARM=ZERO;                /* YES                           */ 01949000
         MVC   WORKPARM(8),@CC00103                                0721 01950000
*   ELSE                                                           0722 01951000
*     WORKPARM=BLANK;               /* NO - BLANK-FILL               */ 01952000
         B     @RC00720                                            0722 01953000
@RF00720 MVC   WORKPARM(8),@CC00097                                0722 01954000
*   IF TBLNAME=RCFBDUMP THEN        /* 'RCFBDUMP             @ZM20856*/ 01955000
@RC00720 CLC   TBLNAME(8,TABLEPTR),RCFBDUMP                        0723 01956000
         BNE   @RF00723                                            0723 01957000
*     DO;                                                          0724 01958000
*       SAVEPTR=SAVEPTR+8*(TBLDISP-1+DUMPCNT);/* ADDRESS PROPER WORK    01959000
*                                      AREA                  @ZM20856*/ 01960000
         LH    @04,DUMPCNT                                         0725 01961000
         LH    @15,TBLDISP(,TABLEPTR)                              0725 01962000
         BCTR  @15,0                                               0725 01963000
         ALR   @15,@04                                             0725 01964000
         SLA   @15,3                                               0725 01965000
         ALR   SAVEPTR,@15                                         0725 01966000
*       IF DUMPCNT>16 THEN          /* MAX '16' PARMS        @ZM20856   01967000
*                                      NOTE: DUMPCNT INITIALIZED IN     01968000
*                                      PROC 'READMBR' TO 0.  @ZM20856*/ 01969000
         C     @04,@CF00176                                        0726 01970000
         BNH   @RF00726                                            0726 01971000
*         DO;                       /* POSITION SCAN         @ZM20856*/ 01972000
*           DO WHILE(WORKPARM^=','&WORKPARM^=' ');/*         @ZM20856*/ 01973000
         B     @DE00728                                            0728 01974000
@DL00728 DS    0H                                                  0729 01975000
*             SCANPTR=SCANPTR+1;    /* NEXT CHAR             @ZM20856*/ 01976000
         AL    SCANPTR,@CF00057                                    0729 01977000
*           END;                    /* PT PAST PARM          @ZM20856*/ 01978000
@DE00728 CLI   WORKPARM,C','                                       0730 01979000
         BE    @DC00728                                            0730 01980000
         CLI   WORKPARM,C' '                                       0730 01981000
         BNE   @DL00728                                            0730 01982000
@DC00728 DS    0H                                                  0731 01983000
*           RETURN;                 /* IGNORE > 16           @ZM20856*/ 01984000
@EL00014 DS    0H                                                  0731 01985000
@EF00014 DS    0H                                                  0731 01986000
@ER00014 L     @14,@SA00014                                        0731 01987000
         BR    @14                                                 0731 01988000
*         END;                      /*                       @ZM20856*/ 01989000
*       ELSE                        /* INCREMENT COUNT       @ZM20856*/ 01990000
*         CALL SPLITPRM;            /* SPLIT PARMS           @ZM20856*/ 01991000
@RF00726 BAL   @14,SPLITPRM                                        0733 01992000
*     END;                          /* END PROCESS           @ZM20856*/ 01993000
*   ELSE                                                           0735 01994000
*     DO;                           /* OTHER KEYWORD         @ZM20856*/ 01995000
         B     @RC00723                                            0735 01996000
@RF00723 DS    0H                                                  0736 01997000
*       SAVEPTR=SAVEPTR+8*(TBLDISP-1);/* ADDRESS PROPER WORK AREA  0736 01998000
*                                                            @ZM20856*/ 01999000
         LH    @04,TBLDISP(,TABLEPTR)                              0736 02000000
         BCTR  @04,0                                               0736 02001000
         SLA   @04,3                                               0736 02002000
         ALR   SAVEPTR,@04                                         0736 02003000
*       IF SAVECHAR^=HEXBC THEN     /* PARAMETER ALREADY THERE       */ 02004000
         CLI   SAVECHAR(SAVEPTR),X'BC'                             0737 02005000
         BE    @RF00737                                            0737 02006000
*         DO;                       /* YES                           */ 02007000
*           SAVECHAR=HEXFF;         /* FLAG AS AN ERROR              */ 02008000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0739 02009000
*           RETURN;                 /* EXIT                          */ 02010000
         B     @EL00014                                            0740 02011000
*         END;                                                     0741 02012000
*       IF TBLNUMRC='1'B THEN       /* VALUE MUST BE NUMERIC         */ 02013000
@RF00737 TM    TBLNUMRC(TABLEPTR),B'01000000'                      0742 02014000
         BNO   @RF00742                                            0742 02015000
*         CALL NBRXTRCT;            /* YES                           */ 02016000
         BAL   @14,NBRXTRCT                                        0743 02017000
*       ELSE                                                       0744 02018000
*         CALL REGXTRCT;            /* NO                            */ 02019000
         B     @RC00742                                            0744 02020000
@RF00742 BAL   @14,REGXTRCT                                        0744 02021000
*       IF SAVECHAR=HEXFF THEN      /* ERROR DETECTED                */ 02022000
@RC00742 CLI   SAVECHAR(SAVEPTR),X'FF'                             0745 02023000
         BE    @RT00745                                            0745 02024000
*         RETURN;                   /* YES                           */ 02025000
*       IF TBLRIGHT='1'B&I<8 THEN   /* RIGHT-JUSTIFY                 */ 02026000
         TM    TBLRIGHT(TABLEPTR),B'00010000'                      0747 02027000
         BNO   @RF00747                                            0747 02028000
         C     I,@CF00034                                          0747 02029000
         BNL   @RF00747                                            0747 02030000
*         DO;                       /* YES                           */ 02031000
*           IF TBLZERO='1'B THEN    /* FILL TEMPORARY                */ 02032000
         TM    TBLZERO(TABLEPTR),B'00001000'                       0749 02033000
         BNO   @RF00749                                            0749 02034000
*             TEMPAREA=ZERO;        /* AREA WITH                     */ 02035000
         MVC   TEMPAREA(8),@CC00103                                0750 02036000
*           ELSE                    /* PROPER FILL                   */ 02037000
*             TEMPAREA=BLANK;       /* CHARACTER                     */ 02038000
         B     @RC00749                                            0751 02039000
@RF00749 MVC   TEMPAREA(8),@CC00097                                0751 02040000
*           I=9-I;                  /* STARTING PT IN TEMPAREA       */ 02041000
@RC00749 LA    @04,9                                               0752 02042000
         SLR   @04,I                                               0752 02043000
         LR    I,@04                                               0752 02044000
*           MVC(TEMPAREA(I:8),WORKPARM);/* SHIFT RIGHT INTO AREA     */ 02045000
         LA    @04,TEMPAREA-1(I)                                   0753 02046000
         LA    @15,8                                               0753 02047000
         SLR   @15,I                                               0753 02048000
         EX    @15,@SM01657                                        0753 02049000
*           WORKPARM=TEMPAREA;      /* MOVE BACK                     */ 02050000
         MVC   WORKPARM(8),TEMPAREA                                0754 02051000
*         END;                                                     0755 02052000
*       IF TBLRSTD='1'B THEN        /* RESTRICTED VALUES             */ 02053000
@RF00747 TM    TBLRSTD(TABLEPTR),B'10000000'                       0756 02054000
         BNO   @RF00756                                            0756 02055000
*         DO;                       /* YES                           */ 02056000
*           RSTDPTR=TBLPTR;         /* PTR TO RSTD TABLE             */ 02057000
         L     RSTDPTR,TBLPTR(,TABLEPTR)                           0758 02058000
*           DO WHILE(RSTDCHAR^=HEXFF&RSTDNAME^=WORKPARM);/* SEARCH   */ 02059000
         B     @DE00759                                            0759 02060000
@DL00759 DS    0H                                                  0760 02061000
*             RSTDPTR=RSTDPTR+8;    /* FOR A                         */ 02062000
         AL    RSTDPTR,@CF00034                                    0760 02063000
*           END;                    /* MATCH                         */ 02064000
@DE00759 CLI   RSTDCHAR(RSTDPTR),X'FF'                             0761 02065000
         BE    @DC00759                                            0761 02066000
         CLC   RSTDNAME(8,RSTDPTR),WORKPARM                        0761 02067000
         BNE   @DL00759                                            0761 02068000
@DC00759 DS    0H                                                  0762 02069000
*           IF RSTDCHAR=HEXFF THEN  /* FIND ONE                      */ 02070000
         CLI   RSTDCHAR(RSTDPTR),X'FF'                             0762 02071000
         BNE   @RF00762                                            0762 02072000
*             SAVECHAR=HEXFF;       /* NOPE                          */ 02073000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0763 02074000
*         END;                                                     0764 02075000
@RF00762 DS    0H                                                  0765 02076000
*       IF SAVECHAR^=HEXFF THEN     /* STILL GOOD VALUE              */ 02077000
@RF00756 CLI   SAVECHAR(SAVEPTR),X'FF'                             0765 02078000
         BE    @RF00765                                            0765 02079000
*         IF TBLBINRY='1'B THEN     /* CONVERT TO BINARY             */ 02080000
         TM    TBLBINRY(TABLEPTR),B'00100000'                      0766 02081000
         BNO   @RF00766                                            0766 02082000
*           DO;                                                    0767 02083000
*             PACK(TEMPAREA,WORKPARM);/* PACK THE NUMBER             */ 02084000
         PACK  TEMPAREA(8),WORKPARM(8)                             0768 02085000
*             WORKPARM=''B;         /* ZERO OUT RECEIVNG FIELD       */ 02086000
         XC    WORKPARM(8),WORKPARM                                0769 02087000
*             CVB(WRKPRMF2,TEMPAREA);/* CVB INTO WORKPARM            */ 02088000
         CVB   @04,TEMPAREA                                        0770 02089000
         ST    @04,WRKPRMF2                                        0770 02090000
*             IF TBLRANGE='1'B THEN /* DO A RANGE CHECK              */ 02091000
         TM    TBLRANGE(TABLEPTR),B'00000100'                      0771 02092000
         BNO   @RF00771                                            0771 02093000
*               DO;                 /* YES                           */ 02094000
*                 IF WRKPRMF2<TBLLOW|WRKPRMF2>TBLHIGH THEN         0773 02095000
         C     @04,TBLLOW(,TABLEPTR)                               0773 02096000
         BL    @RT00773                                            0773 02097000
         C     @04,TBLHIGH(,TABLEPTR)                              0773 02098000
         BNH   @RF00773                                            0773 02099000
@RT00773 DS    0H                                                  0774 02100000
*                   SAVECHAR=HEXFF;                                0774 02101000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0774 02102000
*               END;                                               0775 02103000
@RF00773 DS    0H                                                  0776 02104000
*           END;                                                   0776 02105000
@RF00771 DS    0H                                                  0777 02106000
*       IF SAVECHAR^=HEXFF THEN     /* STILL OK                      */ 02107000
@RF00766 DS    0H                                                  0777 02108000
@RF00765 CLI   SAVECHAR(SAVEPTR),X'FF'                             0777 02109000
         BE    @RF00777                                            0777 02110000
*         SAVAREA=WORKPARM;         /* YES - MOVE IN GOOD VALUE      */ 02111000
         MVC   SAVAREA(8,SAVEPTR),WORKPARM                         0778 02112000
*     END;                          /* ALL OTHER KEYWORDS    @ZM20856*/ 02113000
*   END PRCSPARM;                                                  0780 02114000
         B     @EL00014                                            0780 02115000
         EJECT                                                          02116000
*NBRXTRCT:                                                         0781 02117000
*   PROC OPTIONS(SAVE(14));                                        0781 02118000
NBRXTRCT ST    @14,12(,@13)                                        0781 02119000
*                                                                  0782 02120000
*/*  *****************************************************************/ 02121000
*/*                                                                  */ 02122000
*/*    THIS SUBROUTINE MOVES A PARAMETER INTO A WORKAREA, VERIFIES   */ 02123000
*/*    THAT IT IS NUMERIC, AND CHECKS ITS LENGTH.                    */ 02124000
*/*                                                                  */ 02125000
*/*  *****************************************************************/ 02126000
*                                                                  0782 02127000
*   I=0;                            /* ZERO OUT LENGTH COUNTER       */ 02128000
         SLR   I,I                                                 0782 02129000
*   DO WHILE(WORKCHAR^=','&WORKCHAR^=' ');                         0783 02130000
         B     @DE00783                                            0783 02131000
@DL00783 DS    0H                                                  0784 02132000
*     I=I+1;                        /* ADD 1 TO LENGTH               */ 02133000
         AL    I,@CF00057                                          0784 02134000
*     IF I<9 THEN                   /* LENGTH STILL GOOD             */ 02135000
         C     I,@CF00069                                          0785 02136000
         BNL   @RF00785                                            0785 02137000
*       DO;                         /* YES                           */ 02138000
*         WORKPRM(I)=WORKCHAR;      /* MOVE NEXT CHARACTER           */ 02139000
         LA    @04,WORKPRM-1(I)                                    0787 02140000
         MVC   0(1,@04),WORKCHAR(SCANPTR)                          0787 02141000
*         IF WORKCHAR<'0'|          /* IS IT                         */ 02142000
*             WORKCHAR>'9' THEN     /* NON-NUMERIC                   */ 02143000
         CLI   WORKCHAR(SCANPTR),C'0'                              0788 02144000
         BL    @RT00788                                            0788 02145000
         CLI   WORKCHAR(SCANPTR),C'9'                              0788 02146000
         BNH   @RF00788                                            0788 02147000
@RT00788 DS    0H                                                  0789 02148000
*           I=9;                    /* YES - FORCE ERROR             */ 02149000
         LA    I,9                                                 0789 02150000
*       END;                                                       0790 02151000
@RF00788 DS    0H                                                  0791 02152000
*     SCANPTR=SCANPTR+1;            /* PT AT NEXT CHARACTER          */ 02153000
@RF00785 AL    SCANPTR,@CF00057                                    0791 02154000
*   END;                                                           0792 02155000
@DE00783 CLI   WORKCHAR(SCANPTR),C','                              0792 02156000
         BE    @DC00783                                            0792 02157000
         CLI   WORKCHAR(SCANPTR),C' '                              0792 02158000
         BNE   @DL00783                                            0792 02159000
@DC00783 DS    0H                                                  0793 02160000
*   IF I=0|I>8 THEN                 /* ANY ERRORS DISCOVERED         */ 02161000
         LTR   I,I                                                 0793 02162000
         BZ    @RT00793                                            0793 02163000
         C     I,@CF00034                                          0793 02164000
         BNH   @RF00793                                            0793 02165000
@RT00793 DS    0H                                                  0794 02166000
*     SAVECHAR=HEXFF;               /* YES                           */ 02167000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0794 02168000
*   END NBRXTRCT;                                                  0795 02169000
@EL00015 DS    0H                                                  0795 02170000
@EF00015 DS    0H                                                  0795 02171000
@ER00015 L     @14,12(,@13)                                        0795 02172000
         BR    @14                                                 0795 02173000
         EJECT                                                          02174000
*REGXTRCT:                                                         0796 02175000
*   PROC OPTIONS(SAVE(14));                                        0796 02176000
REGXTRCT ST    @14,12(,@13)                                        0796 02177000
*                                                                  0797 02178000
*/*  *****************************************************************/ 02179000
*/*                                                                  */ 02180000
*/*    THIS SUBROUTINE MOVES A PARAMETER INTO A WORKAREA, AND        */ 02181000
*/*    CHECKS ITS LENGTH.                                            */ 02182000
*/*                                                                  */ 02183000
*/*  *****************************************************************/ 02184000
*                                                                  0797 02185000
*   I=0;                            /* ZERO OUT LENGTH COUNTER       */ 02186000
         SLR   I,I                                                 0797 02187000
*   DO WHILE(WORKCHAR^=','&WORKCHAR^=' ');                         0798 02188000
         B     @DE00798                                            0798 02189000
@DL00798 DS    0H                                                  0799 02190000
*     I=I+1;                        /* ADD 1 TO LENGTH               */ 02191000
         AL    I,@CF00057                                          0799 02192000
*     IF I<9 THEN                   /* LENGTH STILL GOOD             */ 02193000
         C     I,@CF00069                                          0800 02194000
         BNL   @RF00800                                            0800 02195000
*       WORKPRM(I)=WORKCHAR;        /* YES - MOVE CHARACTER          */ 02196000
         LA    @04,WORKPRM-1(I)                                    0801 02197000
         MVC   0(1,@04),WORKCHAR(SCANPTR)                          0801 02198000
*     SCANPTR=SCANPTR+1;            /* PT AT NEXT CHARACTER          */ 02199000
@RF00800 AL    SCANPTR,@CF00057                                    0802 02200000
*   END;                                                           0803 02201000
@DE00798 CLI   WORKCHAR(SCANPTR),C','                              0803 02202000
         BE    @DC00798                                            0803 02203000
         CLI   WORKCHAR(SCANPTR),C' '                              0803 02204000
         BNE   @DL00798                                            0803 02205000
@DC00798 DS    0H                                                  0804 02206000
*   IF I=0|I>8 THEN                 /* IF BAD LENGTH                 */ 02207000
         LTR   I,I                                                 0804 02208000
         BZ    @RT00804                                            0804 02209000
         C     I,@CF00034                                          0804 02210000
         BNH   @RF00804                                            0804 02211000
@RT00804 DS    0H                                                  0805 02212000
*     SAVECHAR=HEXFF;               /* SHOW IT                       */ 02213000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0805 02214000
*   END REGXTRCT;                                                  0806 02215000
@EL00016 DS    0H                                                  0806 02216000
@EF00016 DS    0H                                                  0806 02217000
@ER00016 L     @14,12(,@13)                                        0806 02218000
         BR    @14                                                 0806 02219000
         EJECT                                                          02220000
*SPLITPRM:                                                         0807 02221000
*   PROC OPTIONS(SAVE(14));                                        0807 02222000
SPLITPRM ST    @14,12(,@13)                                        0807 02223000
*                                                                  0808 02224000
*/*  *****************************************************************/ 02225000
*/*                                                                  */ 02226000
*/*    THIS SUBROUTINE SPLITS THE KEYWORD 'RCFBDUMP' INTO 3 LOGICAL  */ 02227000
*/*    VALUES AND TRANSLATES THEM TO BINARY. VALUES:                 */ 02228000
*/*            1. VTAM RETURN CODE                                   */ 02229000
*/*            2. VTAM FEEDBACK CODE                                 */ 02230000
*/*            3. DUMP OPTION - 0=LOCAL, 1=ALL                       */ 02231000
*/*  *****************************************************************/ 02232000
*                                                                  0808 02233000
*   I=0;                            /* ZERO LENGTH COUNT     @ZM20856*/ 02234000
         SLR   I,I                                                 0808 02235000
*   SAVAREAD=SAVAREAD&&SAVAREAD;    /* INITIALIZE AREA       @ZM20856*/ 02236000
         XC    SAVAREAD(8,SAVEPTR),SAVAREAD(SAVEPTR)               0809 02237000
*   DO WHILE(WORKCHAR^=','&WORKCHAR^=' ');/*                 @ZM20856*/ 02238000
         B     @DE00810                                            0810 02239000
@DL00810 DS    0H                                                  0811 02240000
*     I=I+1;                        /* 1 TO LENGTH           @ZM20856*/ 02241000
         AL    I,@CF00057                                          0811 02242000
*     IF I<6 THEN                   /* GOOD LENGTH           @ZM20856*/ 02243000
         C     I,@CF00065                                          0812 02244000
         BNL   @RF00812                                            0812 02245000
*       WORKPARM(I)=WORKCHAR;       /* MOVE NEXT CHAR        @ZM20856*/ 02246000
         LA    @01,WORKPARM-1(I)                                   0813 02247000
         MVC   0(1,@01),WORKCHAR(SCANPTR)                          0813 02248000
*     SCANPTR=SCANPTR+1;            /* PT NEXT CHAR          @ZM20856*/ 02249000
@RF00812 AL    SCANPTR,@CF00057                                    0814 02250000
*   END;                            /* END DO WHILE          @ZM20856*/ 02251000
@DE00810 CLI   WORKCHAR(SCANPTR),C','                              0815 02252000
         BE    @DC00810                                            0815 02253000
         CLI   WORKCHAR(SCANPTR),C' '                              0815 02254000
         BNE   @DL00810                                            0815 02255000
@DC00810 DS    0H                                                  0816 02256000
*   IF I^=5 THEN                    /* INVALID PARM          @ZM20856*/ 02257000
         C     I,@CF00248                                          0816 02258000
         BE    @RF00816                                            0816 02259000
*     DO;                           /* YES                   @ZM20856*/ 02260000
*       SAVECHAR=HEXFF;             /* YES                   @ZM20856*/ 02261000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0818 02262000
*       RETURN;                     /* NEXT KEYWORD          @ZM20856*/ 02263000
@EL00017 DS    0H                                                  0819 02264000
@EF00017 DS    0H                                                  0819 02265000
@ER00017 L     @14,12(,@13)                                        0819 02266000
         BR    @14                                                 0819 02267000
*     END;                          /*                       @ZM20856*/ 02268000
*   ELSE                                                           0821 02269000
*     ;                             /* VALID                 @ZM20856*/ 02270000
*                                                                  0821 02271000
@RF00816 DS    0H                                                  0822 02272000
*   /*****************************************************************/ 02273000
*   /*                                                               */ 02274000
*   /* PROCESS VTAM RETURN CODE                              @ZM20856*/ 02275000
*   /*                                                               */ 02276000
*   /*****************************************************************/ 02277000
*                                                                  0822 02278000
*   SPLIT(5:6)=WORKPARM(1:2);       /* EXTRACT RC            @ZM21059*/ 02279000
         MVC   SPLIT+4(2),WORKPARM                                 0822 02280000
*   TR(SPLIT(5:6),TABBINRY);        /* TRANS TO BINARY-ALSO TRANS  0823 02281000
*                                      INVALIDS              @ZM20856*/ 02282000
         TR    SPLIT+4(2),TABBINRY                                 0823 02283000
*   CHKFIELD(5:6)=SPLIT(5:6)&'F0F0'X;/* INVALIDS             @ZM20856*/ 02284000
         MVC   CHKFIELD+4(2),SPLIT+4                               0824 02285000
         NC    CHKFIELD+4(2),@CB01628                              0824 02286000
*   IF CHKFIELD(5:6)^=0 THEN        /* INVALID RC            @ZM20856*/ 02287000
         ICM   @15,3,CHKFIELD+4                                    0825 02288000
         BZ    @RF00825                                            0825 02289000
*     DO;                           /* YES                   @ZM20856*/ 02290000
*       SAVECHAR=HEXFF;             /* FLAG ERROR            @ZM20856*/ 02291000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0827 02292000
*       RETURN;                     /*                       @ZM20856*/ 02293000
         B     @EL00017                                            0828 02294000
*     END;                          /*                       @ZM20856*/ 02295000
*   ELSE                                                           0830 02296000
*     DO;                           /* VALID RC              @ZM20856*/ 02297000
@RF00825 DS    0H                                                  0831 02298000
*       PACK(TEMPAREA(7:8),SPLIT(5:7));/* COMBINE            @ZM21059*/ 02299000
         PACK  TEMPAREA+6(2),SPLIT+4(3)                            0831 02300000
*       VTAMRC=TEMPAREA(7);         /* WORKAREA UPT          @ZM21059*/ 02301000
         MVC   VTAMRC(1,SAVEPTR),TEMPAREA+6                        0832 02302000
*     END;                                                         0833 02303000
*                                                                  0833 02304000
*   /*****************************************************************/ 02305000
*   /*                                                               */ 02306000
*   /* PROCESS VTAM FEEDBACK CODE                            @ZM20856*/ 02307000
*   /*                                                               */ 02308000
*   /*****************************************************************/ 02309000
*                                                                  0834 02310000
*   SPLIT(5:6)=WORKPARM(3:4);       /* EXTRACT FEEDBCK       @ZM21059*/ 02311000
         MVC   SPLIT+4(2),WORKPARM+2                               0834 02312000
*   TR(SPLIT(5:6),TABBINRY);        /* TRANS TO BINARY- ALSO TRANS 0835 02313000
*                                      INVALIDS              @ZM20856*/ 02314000
         TR    SPLIT+4(2),TABBINRY                                 0835 02315000
*   CHKFIELD(5:6)=SPLIT(5:6)&'F0F0'X;/* INVALIDS             @ZM20856*/ 02316000
         MVC   CHKFIELD+4(2),SPLIT+4                               0836 02317000
         NC    CHKFIELD+4(2),@CB01628                              0836 02318000
*   IF CHKFIELD(5:6)^=0 THEN        /* INVALID FB            @ZM20856*/ 02319000
         ICM   @15,3,CHKFIELD+4                                    0837 02320000
         BZ    @RF00837                                            0837 02321000
*     DO;                           /* YES                   @ZM20856*/ 02322000
*       SAVECHAR=HEXFF;             /* FLAG ERROR            @ZM20856*/ 02323000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0839 02324000
*       RETURN;                     /*                       @ZM20856*/ 02325000
         B     @EL00017                                            0840 02326000
*     END;                          /*                       @ZM20856*/ 02327000
*   ELSE                                                           0842 02328000
*     DO;                           /* VALID FB              @ZM20856*/ 02329000
@RF00837 DS    0H                                                  0843 02330000
*       PACK(TEMPAREA(7:8),SPLIT(5:7));/* COMBINE            @ZM21059*/ 02331000
         PACK  TEMPAREA+6(2),SPLIT+4(3)                            0843 02332000
*       VTAMFB=TEMPAREA(7);         /* WORKAREA UPT          @ZM21059*/ 02333000
         MVC   VTAMFB(1,SAVEPTR),TEMPAREA+6                        0844 02334000
*     END;                                                         0845 02335000
*                                                                  0845 02336000
*   /*****************************************************************/ 02337000
*   /*                                                               */ 02338000
*   /* PROCESS DUMP OPTION CODE                              @ZM20856*/ 02339000
*   /*                                                               */ 02340000
*   /*****************************************************************/ 02341000
*                                                                  0846 02342000
*   IF WORKPARM(5)^='F1'X&WORKPARM(5)^='F0'X THEN/* DUMP OPTION HAS     02343000
*                                      TO BE EITHER 1 OR 0   @ZM21059*/ 02344000
         CLI   WORKPARM+4,X'F1'                                    0846 02345000
         BE    @RF00846                                            0846 02346000
         CLI   WORKPARM+4,X'F0'                                    0846 02347000
         BE    @RF00846                                            0846 02348000
*     SAVECHAR=HEXFF;               /* FLAG AS ERROR         @ZM20856*/ 02349000
         MVI   SAVECHAR(SAVEPTR),X'FF'                             0847 02350000
*   ELSE                            /* OK PARM               @ZM20856*/ 02351000
*     DUMPCNT=DUMPCNT+1;            /* BUMP COUNT            @ZM20856*/ 02352000
         B     @RC00846                                            0848 02353000
@RF00846 LH    @01,DUMPCNT                                         0848 02354000
         LA    @01,1(,@01)                                         0848 02355000
         STH   @01,DUMPCNT                                         0848 02356000
*   IF WORKPARM(5)='F1'X THEN       /* '1'                   @ZM21059*/ 02357000
@RC00846 CLI   WORKPARM+4,X'F1'                                    0849 02358000
         BNE   @RF00849                                            0849 02359000
*     SDUMP=1;                      /* WORKAREA UPT 1        @ZM20856*/ 02360000
         MVI   SDUMP(SAVEPTR),X'01'                                0850 02361000
*   ELSE                            /*                       @ZM20856*/ 02362000
*     SDUMP=0;                      /* WORKAREA UPT 0        @ZM20856*/ 02363000
         B     @RC00849                                            0851 02364000
@RF00849 MVI   SDUMP(SAVEPTR),X'00'                                0851 02365000
*   END SPLITPRM;                                                  0852 02366000
         B     @EL00017                                            0852 02367000
         EJECT                                                          02368000
*PARMMOV:                                                          0853 02369000
*   PROC OPTIONS(SAVE(14));                                        0853 02370000
PARMMOV  ST    @14,12(,@13)                                        0853 02371000
*                                                                  0854 02372000
*/*  *****************************************************************/ 02373000
*/*                                                                  */ 02374000
*/*    THIS SUBROUTINE MOVES THE PARMS ENTERED FOR EACH KEYWORD INTO */ 02375000
*/*    A EDIT FIELD SUITABLE FOR PRINTING. NOTE: THIS PROC IS NOT    */ 02376000
*/*    INVOKED FOR THE 'RCFBDUMP' KEYWORD.                           */ 02377000
*/*  *****************************************************************/ 02378000
*                                                                  0854 02379000
*   CVD(WRKPRMF2,TEMPAREA);         /* TO DECIMAL            @ZM20856*/ 02380000
         L     @04,WRKPRMF2                                        0854 02381000
         CVD   @04,TEMPAREA                                        0854 02382000
*   UNPK(WORKPARM,TEMPAREA);        /* UNPACK                @ZM20856*/ 02383000
         UNPK  WORKPARM(8),TEMPAREA(8)                             0855 02384000
*   WORKPARM(8)=WORKPARM(8)|'F0'X;  /* REMOVE SIGN           @ZM20856*/ 02385000
         OI    WORKPARM+7,X'F0'                                    0856 02386000
*   SCANPTR=ADDR(WORKPARM);         /* START SCAN            @ZM20856*/ 02387000
         LA    SCANPTR,WORKPARM                                    0857 02388000
*   DO J=1 TO 8 WHILE(WORKCHAR='0');/* FIND LEADING DIGIT            */ 02389000
         LA    J,1                                                 0858 02390000
@DL00858 CLI   WORKCHAR(SCANPTR),C'0'                              0858 02391000
         BNE   @DC00858                                            0858 02392000
*     SCANPTR=SCANPTR+1;            /* NEXT BYTE             @ZM20856*/ 02393000
         AL    SCANPTR,@CF00057                                    0859 02394000
*   END;                            /*                       @ZM20856*/ 02395000
         AL    J,@CF00057                                          0860 02396000
         C     J,@CF00034                                          0860 02397000
         BNH   @DL00858                                            0860 02398000
@DC00858 DS    0H                                                  0861 02399000
*   IF J=9 THEN                     /* ALL ZERO              @ZM20856*/ 02400000
         C     J,@CF00069                                          0861 02401000
         BNE   @RF00861                                            0861 02402000
*     J=8;                          /* PRINT 1 ZERO          @ZM20856*/ 02403000
         LA    J,8                                                 0862 02404000
*   DO K=J TO 8;                    /* MOVE CORRECT          @ZM20856*/ 02405000
@RF00861 LR    K,J                                                 0863 02406000
         B     @DE00863                                            0863 02407000
@DL00863 DS    0H                                                  0864 02408000
*     EDFIELD(I)=WORKPARM(K);       /* NUMBER TO FIELD       @ZM20856*/ 02409000
         LA    @01,EDFIELD-1(I)                                    0864 02410000
         LA    @15,WORKPARM-1(K)                                   0864 02411000
         MVC   0(1,@01),0(@15)                                     0864 02412000
*     I=I+1;                        /*                       @ZM20856*/ 02413000
         AL    I,@CF00057                                          0865 02414000
*   END;                            /*                       @ZM20856*/ 02415000
         AL    K,@CF00057                                          0866 02416000
@DE00863 C     K,@CF00034                                          0866 02417000
         BNH   @DL00863                                            0866 02418000
*   END PARMMOV;                    /*                       @ZM20856*/ 02419000
@EL00018 DS    0H                                                  0867 02420000
@EF00018 DS    0H                                                  0867 02421000
@ER00018 L     @14,12(,@13)                                        0867 02422000
         BR    @14                                                 0867 02423000
         EJECT                                                          02424000
*                                                                  0868 02425000
*/*  *****************************************************************/ 02426000
*/*                                                                  */ 02427000
*/*    THESE 2 PAGES CONTAIN THE ASSEMBLER CODING FOR THE PARMLIB    */ 02428000
*/*    DCB, THE PRINTOUT DCB, THE SYNAD EXITS, THE DCB ABEND EXITS,  */ 02429000
*/*    THE EXIT LISTS, AND THE JFCB AREA.                            */ 02430000
*/*                                                                  */ 02431000
*/*  *****************************************************************/ 02432000
*                                                                  0868 02433000
*   GENERATE DATA DEFS(PARMLIB,EXITLST1,SYNAD1,DCBABND1,JFCBAREA); 0868 02434000
*   GENERATE DATA DEFS(PRINTOUT,EXITLST2,SYNAD2,DCBABND2);         0869 02435000
         EJECT                                                          02436000
*   END IKTCAS54                                                   0870 02437000
*                                                                  0870 02438000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02439000
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */ 02440000
*/*%INCLUDE SYSLIB  (IEZCIB  )                                       */ 02441000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 02442000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 02443000
*/*%INCLUDE SYSLIB  (IEFJFCBN)                                       */ 02444000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 02445000
*/*%INCLUDE SYSLIB  (IKTDMPCD)                                       */ 02446000
*/*%INCLUDE SYSLIB  (IKTCASWA)                                       */ 02447000
*                                                                  0870 02448000
*       ;                                                          0870 02449000
         B     @EL00001                                            0870 02450000
@DATA    DS    0H                                                       02451000
@CH00189 DC    H'26'                                                    02452000
@SM01645 MVC   CIBUFFER(0),CIBDATA(@15)                                 02453000
@SM01657 MVC   0(0,@04),WORKPARM                                        02454000
@DATD    DSECT                                                          02455000
         DS    0F                                                       02456000
@SA00001 DS    18F                                                      02457000
@SA00002 DS    1F                                                       02458000
@SA00003 DS    1F                                                       02459000
@SA00005 DS    1F                                                       02460000
@SA00009 DS    1F                                                       02461000
@SA00012 DS    1F                                                       02462000
@SA00014 DS    1F                                                       02463000
@SA00010 DS    1F                                                       02464000
@SA00011 DS    1F                                                       02465000
IKTCAS54 CSECT                                                          02466000
         DS    0F                                                       02467000
@CF00057 DC    F'1'                                                     02468000
@CF00118 DC    F'3'                                                     02469000
@CH00118 EQU   @CF00118+2                                               02470000
@CF00063 DC    F'4'                                                     02471000
@CH00063 EQU   @CF00063+2                                               02472000
@CF00248 DC    F'5'                                                     02473000
@CF00065 DC    F'6'                                                     02474000
@CF00034 DC    F'8'                                                     02475000
@CF00069 DC    F'9'                                                     02476000
@CF00176 DC    F'16'                                                    02477000
@CF00144 DC    F'20'                                                    02478000
@DATD    DSECT                                                          02479000
         DS    0D                                                       02480000
DUMPPTR  DS    A                                                        02481000
PRNTEND  DS    A                                                        02482000
L        DS    H                                                        02483000
M        DS    H                                                        02484000
N        DS    H                                                        02485000
RTNCODE  DS    H                                                        02486000
DUMPCNT  DS    H                                                        02487000
         DS    CL6                                                      02488000
TEMPAREA DS    CL8                                                      02489000
CHKFIELD DS    CL8                                                      02490000
CIBUFFER DS    CL48                                                     02491000
KEYWDNM  DS    CL8                                                      02492000
SPLIT    DS    CL8                                                      02493000
SYNADSW1 DS    CL1                                                      02494000
SYNADSW2 DS    CL1                                                      02495000
DCBABSW1 DS    CL1                                                      02496000
DCBABSW2 DS    CL1                                                      02497000
SWITCHES DS    CL1                                                      02498000
         ORG   SWITCHES                                                 02499000
SCANERR  DS    BL1                                                      02500000
READSW1  EQU   SWITCHES+0                                               02501000
GOSW1    EQU   SWITCHES+0                                               02502000
GOSW2    EQU   SWITCHES+0                                               02503000
PRINTSW  EQU   SWITCHES+0                                               02504000
@NM00001 EQU   SWITCHES+0                                               02505000
         ORG   SWITCHES+1                                               02506000
         DS    CL3                                                      02507000
WORKPARM DS    CL8                                                      02508000
         ORG   WORKPARM                                                 02509000
WORKPRM  DS    8CL1                                                     02510000
         ORG   WORKPARM+8                                               02511000
MBRRECD  DS    CL80                                                     02512000
         ORG   MBRRECD                                                  02513000
@NM00004 DS    CL72                                                     02514000
MBR7380  DS    CL8                                                      02515000
         ORG   MBR7380                                                  02516000
@NM00005 DS    CL7                                                      02517000
MBR80    DS    CL1                                                      02518000
         ORG   MBRRECD+80                                               02519000
PRNTLINE DS    CL133                                                    02520000
         ORG   PRNTLINE                                                 02521000
PRNTCC   DS    CL1                                                      02522000
PRNTDATA DS    CL132                                                    02523000
         ORG   PRNTDATA                                                 02524000
@NM00006 DS    CL4                                                      02525000
PRNTDAT5 DS    CL128                                                    02526000
         ORG   PRNTLINE+133                                             02527000
EDITFLD  DS    CL20                                                     02528000
         ORG   EDITFLD                                                  02529000
EDFIELD  DS    20CL1                                                    02530000
         ORG   EDITFLD+20                                               02531000
TSOKEYNN DS    CL8                                                      02532000
         ORG   TSOKEYNN                                                 02533000
TSO      DS    CL6                                                      02534000
TSO1     DS    CL1                                                      02535000
TSO2     DS    CL1                                                      02536000
         ORG   TSOKEYNN+8                                               02537000
MERGAREA DS    CL208                                                    02538000
         ORG   MERGAREA                                                 02539000
MERGE    DS    26CL8                                                    02540000
         ORG   MERGAREA+208                                             02541000
         DS    CL3                                                      02542000
SAVEBUFR DS    CL24                                                     02543000
SAVEMBR  DS    CL208                                                    02544000
IKTCAS54 CSECT                                                          02545000
         DS    0F                                                       02546000
@SIZDATD DC    AL1(0)                                                   02547000
         DC    AL3(@ENDDATD-@DATD)                                      02548000
         DS    0D                                                       02549000
@CC01543 DC    C'CONSOLE VALUES ACCEPTED:'                              02550000
@CC01564 DC    C'PARMLIB VALUES ACCEPTED:'                              02551000
@CC01585 DC    C'CURRENT TCAS PARAMETERS:'                              02552000
@CC01526 DC    C'CONSOLE VALUES ENTERED:'                               02553000
@CC01556 DC    C'PARMLIB VALUES ENTERED:'                               02554000
@CC01529 DC    C'*NONE ENTERED*'                                        02555000
@CC01534 DC    C'USER=FSTOP '                                           02556000
@CC01537 DC    C'USER=SIC '                                             02557000
@CC00097 DC    C'        '                                              02558000
@CC00103 DC    C'00000000'                                              02559000
@CC00179 DC    C'TSOKEY00'                                              02560000
@CC00302 DC    C'FSTOP   '                                              02561000
@CC00329 DC    C'MEMBER  '                                              02562000
@CC00340 DC    C'USER    '                                              02563000
@CC00350 DC    C'USERMAX '                                              02564000
@CC00394 DC    C'HIBFREXT'                                              02565000
@CC00403 DC    C'LOBFREXT'                                              02566000
@CC01532 DC    C'IGNORE '                                               02567000
@CC00181 EQU   @CC00179                                                 02568000
@CC01533 EQU   @CC00302                                                 02569000
@CC01536 DC    C'SIC '                                                  02570000
@CC01531 DC    C'U '                                                    02571000
@CC01560 DC    C', '                                                    02572000
@CB01595 DC    X'0F00'                                                  02573000
@CB01628 DC    X'F0F0'                                                  02574000
RCFBDUMP DC    CL8'RCFBDUMP'                                            02575000
         DS    CL1                                                      02576000
DEFAULTS DS    CL80                                                     02577000
         ORG   DEFAULTS                                                 02578000
@NM00011 DS    CL8                                                      02579000
         ORG   @NM00011                                                 02580000
@NM00012 DC    F'0'                                                     02581000
@NM00013 DC    F'40'                                                    02582000
         ORG   DEFAULTS+8                                               02583000
@NM00014 DS    CL8                                                      02584000
         ORG   @NM00014                                                 02585000
@NM00015 DC    CL8'        '                                            02586000
         ORG   DEFAULTS+16                                              02587000
@NM00016 DS    CL8                                                      02588000
         ORG   @NM00016                                                 02589000
@NM00017 DC    F'0'                                                     02590000
@NM00018 DC    F'3'                                                     02591000
         ORG   DEFAULTS+24                                              02592000
@NM00019 DS    CL8                                                      02593000
         ORG   @NM00019                                                 02594000
@NM00020 DC    F'0'                                                     02595000
@NM00021 DC    F'132'                                                   02596000
         ORG   DEFAULTS+32                                              02597000
@NM00022 DS    CL8                                                      02598000
         ORG   @NM00022                                                 02599000
@NM00023 DC    F'0'                                                     02600000
@NM00024 DC    F'48000'                                                 02601000
         ORG   DEFAULTS+40                                              02602000
@NM00025 DS    CL8                                                      02603000
         ORG   @NM00025                                                 02604000
@NM00026 DC    F'0'                                                     02605000
@NM00027 DC    F'24000'                                                 02606000
         ORG   DEFAULTS+48                                              02607000
@NM00028 DS    CL8                                                      02608000
         ORG   @NM00028                                                 02609000
@NM00029 DC    F'0'                                                     02610000
@NM00030 DC    F'480'                                                   02611000
         ORG   DEFAULTS+56                                              02612000
@NM00031 DS    CL8                                                      02613000
         ORG   @NM00031                                                 02614000
@NM00032 DC    F'0'                                                     02615000
@NM00033 DC    F'4'                                                     02616000
         ORG   DEFAULTS+64                                              02617000
@NM00034 DS    CL8                                                      02618000
         ORG   @NM00034                                                 02619000
@NM00035 DC    CL8'NOBREAK '                                            02620000
         ORG   DEFAULTS+72                                              02621000
@NM00036 DS    CL8                                                      02622000
         ORG   @NM00036                                                 02623000
@NM00037 DC    CL8'NO      '                                            02624000
         ORG   DEFAULTS+80                                              02625000
SAVES2   DS    CL208                                                    02626000
         ORG   SAVES2                                                   02627000
SAVES1   DS    CL24                                                     02628000
         ORG   SAVES1                                                   02629000
@NM00038 DC    24X'BC'                                                  02630000
         ORG   SAVES2+24                                                02631000
@NM00039 DS    CL56                                                     02632000
         ORG   @NM00039                                                 02633000
@NM00040 DC    56X'BC'                                                  02634000
         ORG   SAVES2+80                                                02635000
@NM00041 DS    CL128                                                    02636000
         ORG   @NM00041                                                 02637000
@NM00042 DC    128X'BC'                                                 02638000
         ORG   SAVES2+208                                               02639000
         DS    CL4                                                      02640000
TABBINRY DS    CL256                                                    02641000
         ORG   TABBINRY                                                 02642000
@NM00048 DC    X'F0F0F0F0F0F0F0F0'                                      02643000
@NM00049 DC    X'F0F0F0F0F0F0F0F0'                                      02644000
@NM00050 DC    X'F0F0F0F0F0F0F0F0'                                      02645000
@NM00051 DC    X'F0F0F0F0F0F0F0F0'                                      02646000
@NM00052 DC    X'F0F0F0F0F0F0F0F0'                                      02647000
@NM00053 DC    X'F0F0F0F0F0F0F0F0'                                      02648000
@NM00054 DC    X'F0F0F0F0F0F0F0F0'                                      02649000
@NM00055 DC    X'F0F0F0F0F0F0F0F0'                                      02650000
@NM00056 DC    X'F0F0F0F0F0F0F0F0'                                      02651000
@NM00057 DC    X'F0F0F0F0F0F0F0F0'                                      02652000
@NM00058 DC    X'F0F0F0F0F0F0F0F0'                                      02653000
@NM00059 DC    X'F0F0F0F0F0F0F0F0'                                      02654000
@NM00060 DC    X'F0F0F0F0F0F0F0F0'                                      02655000
@NM00061 DC    X'F0F0F0F0F0F0F0F0'                                      02656000
@NM00062 DC    X'F0F0F0F0F0F0F0F0'                                      02657000
@NM00063 DC    X'F0F0F0F0F0F0F0F0'                                      02658000
@NM00064 DC    X'F0F0F0F0F0F0F0F0'                                      02659000
@NM00065 DC    X'F0F0F0F0F0F0F0F0'                                      02660000
@NM00066 DC    X'F0F0F0F0F0F0F0F0'                                      02661000
@NM00067 DC    X'F0F0F0F0F0F0F0F0'                                      02662000
@NM00068 DC    X'F0F0F0F0F0F0F0F0'                                      02663000
@NM00069 DC    X'F0F0F0F0F0F0F0F0'                                      02664000
@NM00070 DC    X'F0F0F0F0F0F0F0F0'                                      02665000
@NM00071 DC    X'F0F0F0F0F0F0F0F0'                                      02666000
@NM00072 DC    X'F00A0B0C0D0E0FF0'                                      02667000
@NM00073 DC    X'F0F0F0F0F0F0F0F0'                                      02668000
@NM00074 DC    X'F0F0F0F0F0F0F0F0'                                      02669000
@NM00075 DC    X'F0F0F0F0F0F0F0F0'                                      02670000
@NM00076 DC    X'F0F0F0F0F0F0F0F0'                                      02671000
@NM00077 DC    X'F0F0F0F0F0F0F0F0'                                      02672000
@NM00078 DC    X'0001020304050607'                                      02673000
@NM00079 DC    X'0809F0F0F0F0F0F0'                                      02674000
         ORG   TABBINRY+256                                             02675000
TABDEC   DS    CL16                                                     02676000
         ORG   TABDEC                                                   02677000
ALPHANUM DC    X'F0F1F2F3F4F5F6F7F8F9C1C2C3C4C5C6'                      02678000
         ORG   TABDEC+16                                                02679000
RSTDUSER DS    CL17                                                     02680000
         ORG   RSTDUSER                                                 02681000
@NM00080 DC    CL8'FSTOP   '                                            02682000
@NM00081 DC    CL8'SIC     '                                            02683000
@NM00082 DC    X'FF'                                                    02684000
         ORG   RSTDUSER+17                                              02685000
RSTDSCRN DS    CL17                                                     02686000
         ORG   RSTDSCRN                                                 02687000
@NM00083 DC    CL8'00000480'                                            02688000
@NM00084 DC    CL8'00001920'                                            02689000
@NM00085 DC    X'FF'                                                    02690000
         ORG   RSTDSCRN+17                                              02691000
RSTDMODE DS    CL17                                                     02692000
         ORG   RSTDMODE                                                 02693000
NOBREAK  DC    CL8'NOBREAK '                                            02694000
BREAK    DC    CL8'BREAK   '                                            02695000
@NM00086 DC    X'FF'                                                    02696000
         ORG   RSTDMODE+17                                              02697000
RSTDMDSW DS    CL17                                                     02698000
         ORG   RSTDMDSW                                                 02699000
NO       DC    CL8'NO      '                                            02700000
YES      DC    CL8'YES     '                                            02701000
@NM00087 DC    X'FF'                                                    02702000
         ORG   RSTDMDSW+17                                              02703000
VERIBUFR DS    CL61                                                     02704000
         ORG   VERIBUFR                                                 02705000
@NM00089 DS    CL20                                                     02706000
         ORG   @NM00089                                                 02707000
@NM00090 DC    CL8'MEMBER  '                                            02708000
@NM00091 DC    H'1'                                                     02709000
@NM00092 DC    CL1' '                                                   02710000
@NM00093 DC    B'00000000'                                              02711000
@NM00094 DC    CL4'    '                                                02712000
@NM00095 DC    CL4'    '                                                02713000
         ORG   VERIBUFR+20                                              02714000
@NM00096 DS    CL20                                                     02715000
         ORG   @NM00096                                                 02716000
@NM00097 DC    CL8'USER    '                                            02717000
@NM00098 DC    H'2'                                                     02718000
@NM00099 DC    CL1' '                                                   02719000
@NM00100 DC    B'10000000'                                              02720000
@NM00101 DC    AL4(RSTDUSER)                                            02721000
@NM00102 DC    CL4'    '                                                02722000
         ORG   VERIBUFR+40                                              02723000
@NM00103 DS    CL20                                                     02724000
         ORG   @NM00103                                                 02725000
@NM00104 DC    CL8'USERMAX '                                            02726000
@NM00105 DC    H'3'                                                     02727000
@NM00106 DC    CL1' '                                                   02728000
@NM00107 DC    B'01111100'                                              02729000
@NM00108 DC    F'0'                                                     02730000
@NM00109 DC    F'32767'                                                 02731000
         ORG   VERIBUFR+60                                              02732000
@NM00110 DC    X'FF'                                                    02733000
         ORG   VERIBUFR+61                                              02734000
         DS    CL3                                                      02735000
VERIMBR  DS    CL521                                                    02736000
         ORG   VERIMBR                                                  02737000
@NM00111 DS    CL20                                                     02738000
         ORG   @NM00111                                                 02739000
@NM00112 DC    CL8'USERMAX '                                            02740000
@NM00113 DC    H'1'                                                     02741000
@NM00114 DC    CL1' '                                                   02742000
@NM00115 DC    B'01111100'                                              02743000
@NM00116 DC    F'0'                                                     02744000
@NM00117 DC    F'32767'                                                 02745000
         ORG   VERIMBR+20                                               02746000
@NM00118 DS    CL20                                                     02747000
         ORG   @NM00118                                                 02748000
@NM00119 DC    CL8'ACBPW   '                                            02749000
@NM00120 DC    H'2'                                                     02750000
@NM00121 DC    CL1' '                                                   02751000
@NM00122 DC    B'00000000'                                              02752000
@NM00123 DC    CL4'    '                                                02753000
@NM00124 DC    CL4'    '                                                02754000
         ORG   VERIMBR+40                                               02755000
@NM00125 DS    CL20                                                     02756000
         ORG   @NM00125                                                 02757000
@NM00126 DC    CL8'RECONLIM'                                            02758000
@NM00127 DC    H'3'                                                     02759000
@NM00128 DC    CL1' '                                                   02760000
@NM00129 DC    B'01111100'                                              02761000
@NM00130 DC    F'0'                                                     02762000
@NM00131 DC    F'32767'                                                 02763000
         ORG   VERIMBR+60                                               02764000
@NM00132 DS    CL20                                                     02765000
         ORG   @NM00132                                                 02766000
@NM00133 DC    CL8'BUFRSIZE'                                            02767000
@NM00134 DC    H'4'                                                     02768000
@NM00135 DC    CL1' '                                                   02769000
@NM00136 DC    B'01111100'                                              02770000
@NM00137 DC    F'4'                                                     02771000
@NM00138 DC    F'4092'                                                  02772000
         ORG   VERIMBR+80                                               02773000
@NM00139 DS    CL20                                                     02774000
         ORG   @NM00139                                                 02775000
@NM00140 DC    CL8'HIBFREXT'                                            02776000
@NM00141 DC    H'5'                                                     02777000
@NM00142 DC    CL1' '                                                   02778000
@NM00143 DC    B'01111100'                                              02779000
@NM00144 DC    F'1'                                                     02780000
@NM00145 DC    F'16777215'                                              02781000
         ORG   VERIMBR+100                                              02782000
@NM00146 DS    CL20                                                     02783000
         ORG   @NM00146                                                 02784000
@NM00147 DC    CL8'LOBFREXT'                                            02785000
@NM00148 DC    H'6'                                                     02786000
@NM00149 DC    CL1' '                                                   02787000
@NM00150 DC    B'01111100'                                              02788000
@NM00151 DC    F'0'                                                     02789000
@NM00152 DC    F'16777215'                                              02790000
         ORG   VERIMBR+120                                              02791000
@NM00153 DS    CL20                                                     02792000
         ORG   @NM00153                                                 02793000
@NM00154 DC    CL8'SCRSIZE '                                            02794000
@NM00155 DC    H'7'                                                     02795000
@NM00156 DC    CL1' '                                                   02796000
@NM00157 DC    B'11111000'                                              02797000
@NM00158 DC    AL4(RSTDSCRN)                                            02798000
@NM00159 DC    CL4'    '                                                02799000
         ORG   VERIMBR+140                                              02800000
@NM00160 DS    CL20                                                     02801000
         ORG   @NM00160                                                 02802000
@NM00161 DC    CL8'CHNLEN  '                                            02803000
@NM00162 DC    H'8'                                                     02804000
@NM00163 DC    CL1' '                                                   02805000
@NM00164 DC    B'01111100'                                              02806000
@NM00165 DC    F'1'                                                     02807000
@NM00166 DC    F'10'                                                    02808000
         ORG   VERIMBR+160                                              02809000
@NM00167 DS    CL20                                                     02810000
         ORG   @NM00167                                                 02811000
@NM00168 DC    CL8'MODE    '                                            02812000
@NM00169 DC    H'9'                                                     02813000
@NM00170 DC    CL1' '                                                   02814000
@NM00171 DC    B'10000000'                                              02815000
@NM00172 DC    AL4(RSTDMODE)                                            02816000
@NM00173 DC    CL4'    '                                                02817000
         ORG   VERIMBR+180                                              02818000
@NM00174 DS    CL20                                                     02819000
         ORG   @NM00174                                                 02820000
@NM00175 DC    CL8'MODESW  '                                            02821000
@NM00176 DC    H'10'                                                    02822000
@NM00177 DC    CL1' '                                                   02823000
@NM00178 DC    B'10000000'                                              02824000
@NM00179 DC    AL4(RSTDMDSW)                                            02825000
@NM00180 DC    CL4'    '                                                02826000
         ORG   VERIMBR+200                                              02827000
@NM00181 DS    CL20                                                     02828000
         ORG   @NM00181                                                 02829000
@NM00182 DC    CL8'RCFBDUMP'                                            02830000
@NM00183 DC    H'11'                                                    02831000
@NM00184 DC    CL1' '                                                   02832000
@NM00185 DC    B'00001000'                                              02833000
@NM00186 DC    CL4'    '                                                02834000
@NM00187 DC    CL4'    '                                                02835000
         ORG   VERIMBR+220                                              02836000
@NM00188 DS    CL20                                                     02837000
         ORG   @NM00188                                                 02838000
@NM00189 DC    CL8'RCFBDUMP'                                            02839000
@NM00190 DC    H'12'                                                    02840000
@NM00191 DC    CL1' '                                                   02841000
@NM00192 DC    B'00001000'                                              02842000
@NM00193 DC    CL4'    '                                                02843000
@NM00194 DC    CL4'    '                                                02844000
         ORG   VERIMBR+240                                              02845000
@NM00195 DS    CL20                                                     02846000
         ORG   @NM00195                                                 02847000
@NM00196 DC    CL8'RCFBDUMP'                                            02848000
@NM00197 DC    H'13'                                                    02849000
@NM00198 DC    CL1' '                                                   02850000
@NM00199 DC    B'00001000'                                              02851000
@NM00200 DC    CL4'    '                                                02852000
@NM00201 DC    CL4'    '                                                02853000
         ORG   VERIMBR+260                                              02854000
@NM00202 DS    CL20                                                     02855000
         ORG   @NM00202                                                 02856000
@NM00203 DC    CL8'RCFBDUMP'                                            02857000
@NM00204 DC    H'14'                                                    02858000
@NM00205 DC    CL1' '                                                   02859000
@NM00206 DC    B'00001000'                                              02860000
@NM00207 DC    CL4'    '                                                02861000
@NM00208 DC    CL4'    '                                                02862000
         ORG   VERIMBR+280                                              02863000
@NM00209 DS    CL20                                                     02864000
         ORG   @NM00209                                                 02865000
@NM00210 DC    CL8'RCFBDUMP'                                            02866000
@NM00211 DC    H'15'                                                    02867000
@NM00212 DC    CL1' '                                                   02868000
@NM00213 DC    B'00001000'                                              02869000
@NM00214 DC    CL4'    '                                                02870000
@NM00215 DC    CL4'    '                                                02871000
         ORG   VERIMBR+300                                              02872000
@NM00216 DS    CL20                                                     02873000
         ORG   @NM00216                                                 02874000
@NM00217 DC    CL8'RCFBDUMP'                                            02875000
@NM00218 DC    H'16'                                                    02876000
@NM00219 DC    CL1' '                                                   02877000
@NM00220 DC    B'00001000'                                              02878000
@NM00221 DC    CL4'    '                                                02879000
@NM00222 DC    CL4'    '                                                02880000
         ORG   VERIMBR+320                                              02881000
@NM00223 DS    CL20                                                     02882000
         ORG   @NM00223                                                 02883000
@NM00224 DC    CL8'RCFBDUMP'                                            02884000
@NM00225 DC    H'17'                                                    02885000
@NM00226 DC    CL1' '                                                   02886000
@NM00227 DC    B'00001000'                                              02887000
@NM00228 DC    CL4'    '                                                02888000
@NM00229 DC    CL4'    '                                                02889000
         ORG   VERIMBR+340                                              02890000
@NM00230 DS    CL20                                                     02891000
         ORG   @NM00230                                                 02892000
@NM00231 DC    CL8'RCFBDUMP'                                            02893000
@NM00232 DC    H'18'                                                    02894000
@NM00233 DC    CL1' '                                                   02895000
@NM00234 DC    B'00001000'                                              02896000
@NM00235 DC    CL4'    '                                                02897000
@NM00236 DC    CL4'    '                                                02898000
         ORG   VERIMBR+360                                              02899000
@NM00237 DS    CL20                                                     02900000
         ORG   @NM00237                                                 02901000
@NM00238 DC    CL8'RCFBDUMP'                                            02902000
@NM00239 DC    H'19'                                                    02903000
@NM00240 DC    CL1' '                                                   02904000
@NM00241 DC    B'00001000'                                              02905000
@NM00242 DC    CL4'    '                                                02906000
@NM00243 DC    CL4'    '                                                02907000
         ORG   VERIMBR+380                                              02908000
@NM00244 DS    CL20                                                     02909000
         ORG   @NM00244                                                 02910000
@NM00245 DC    CL8'RCFBDUMP'                                            02911000
@NM00246 DC    H'20'                                                    02912000
@NM00247 DC    CL1' '                                                   02913000
@NM00248 DC    B'00001000'                                              02914000
@NM00249 DC    CL4'    '                                                02915000
@NM00250 DC    CL4'    '                                                02916000
         ORG   VERIMBR+400                                              02917000
@NM00251 DS    CL20                                                     02918000
         ORG   @NM00251                                                 02919000
@NM00252 DC    CL8'RCFBDUMP'                                            02920000
@NM00253 DC    H'21'                                                    02921000
@NM00254 DC    CL1' '                                                   02922000
@NM00255 DC    B'00001000'                                              02923000
@NM00256 DC    CL4'    '                                                02924000
@NM00257 DC    CL4'    '                                                02925000
         ORG   VERIMBR+420                                              02926000
@NM00258 DS    CL20                                                     02927000
         ORG   @NM00258                                                 02928000
@NM00259 DC    CL8'RCFBDUMP'                                            02929000
@NM00260 DC    H'22'                                                    02930000
@NM00261 DC    CL1' '                                                   02931000
@NM00262 DC    B'00001000'                                              02932000
@NM00263 DC    CL4'    '                                                02933000
@NM00264 DC    CL4'    '                                                02934000
         ORG   VERIMBR+440                                              02935000
@NM00265 DS    CL20                                                     02936000
         ORG   @NM00265                                                 02937000
@NM00266 DC    CL8'RCFBDUMP'                                            02938000
@NM00267 DC    H'23'                                                    02939000
@NM00268 DC    CL1' '                                                   02940000
@NM00269 DC    B'00001000'                                              02941000
@NM00270 DC    CL4'    '                                                02942000
@NM00271 DC    CL4'    '                                                02943000
         ORG   VERIMBR+460                                              02944000
@NM00272 DS    CL20                                                     02945000
         ORG   @NM00272                                                 02946000
@NM00273 DC    CL8'RCFBDUMP'                                            02947000
@NM00274 DC    H'24'                                                    02948000
@NM00275 DC    CL1' '                                                   02949000
@NM00276 DC    B'00001000'                                              02950000
@NM00277 DC    CL4'    '                                                02951000
@NM00278 DC    CL4'    '                                                02952000
         ORG   VERIMBR+480                                              02953000
@NM00279 DS    CL20                                                     02954000
         ORG   @NM00279                                                 02955000
@NM00280 DC    CL8'RCFBDUMP'                                            02956000
@NM00281 DC    H'25'                                                    02957000
@NM00282 DC    CL1' '                                                   02958000
@NM00283 DC    B'00001000'                                              02959000
@NM00284 DC    CL4'    '                                                02960000
@NM00285 DC    CL4'    '                                                02961000
         ORG   VERIMBR+500                                              02962000
@NM00286 DS    CL20                                                     02963000
         ORG   @NM00286                                                 02964000
@NM00287 DC    CL8'RCFBDUMP'                                            02965000
@NM00288 DC    H'26'                                                    02966000
@NM00289 DC    CL1' '                                                   02967000
@NM00290 DC    B'00001000'                                              02968000
@NM00291 DC    CL4'    '                                                02969000
@NM00292 DC    CL4'    '                                                02970000
         ORG   VERIMBR+520                                              02971000
@NM00293 DC    X'FF'                                                    02972000
         ORG   VERIMBR+521                                              02973000
IKTCAS54 CSECT                                                          02974000
PARMLIB  DCB   DSORG=PS,MACRF=GM,EXLST=EXITLST1,EODAD=EOF,            XX02975000
               SYNAD=SYNAD1,EROPT=ACC,DDNAME=PARMLIB                    02976000
EXITLST1 DS    0F                                                       02977000
         DC    X'07'                                                    02978000
         DC    AL3(JFCBAREA)                                            02979000
         DC    X'91'                                                    02980000
         DC    AL3(DCBABND1)                                            02981000
JFCBAREA DS    0F,CL176                                                 02982000
SYNAD1   DS    0F                                                       02983000
         MVI   SYNADSW1,C'Y'       TURN SW ON                           02984000
         RETURN                                                         02985000
DCBABND1 DS    0F                                                       02986000
         MVI   DCBABSW1,C'Y'      SHOW EXIT ENTERED                     02987000
         TM    3(1),B'00000100'   IGNORE BIT ON                         02988000
         BZ    *+12               NO                                    02989000
         MVI   3(1),4             YES - IGNORE ERROR                    02990000
         B     *+8                EXIT                                  02991000
         MVI   3(1),0             ACCEPT ABEND                          02992000
         RETURN                                                         02993000
IKTCAS54 CSECT                                                          02994000
PRINTOUT DCB   DSORG=PS,MACRF=PM,EXLST=EXITLST2,LRECL=133,RECFM=FA,   XX02995000
               SYNAD=SYNAD2,EROPT=ACC,DDNAME=PRINTOUT,BLKSIZE=133       02996000
SYNAD2   DS    0F                                                       02997000
         MVI   SYNADSW2,C'Y'                                            02998000
         RETURN                                                         02999000
EXITLST2 DS    0F                                                       03000000
         DC    X'91'                                                    03001000
         DC    AL3(DCBABND2)                                            03002000
DCBABND2 DS    0F                                                       03003000
         MVI   DCBABSW2,C'Y'                                            03004000
         TM    3(1),B'00000100'                                         03005000
         BZ    *+12                                                     03006000
         MVI   3(1),4                                                   03007000
         B     *+8                                                      03008000
         MVI   3(1),0                                                   03009000
         RETURN                                                         03010000
@DATD    DSECT                                                          03011000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                03012000
@ENDDATD EQU   *                                                        03013000
IKTCAS54 CSECT                                                          03014000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03015000
@01      EQU   01                                                       03016000
@02      EQU   02                                                       03017000
@03      EQU   03                                                       03018000
@04      EQU   04                                                       03019000
@05      EQU   05                                                       03020000
@06      EQU   06                                                       03021000
@07      EQU   07                                                       03022000
@08      EQU   08                                                       03023000
@09      EQU   09                                                       03024000
@10      EQU   10                                                       03025000
@11      EQU   11                                                       03026000
@12      EQU   12                                                       03027000
@13      EQU   13                                                       03028000
@14      EQU   14                                                       03029000
@15      EQU   15                                                       03030000
TABLEPTR EQU   @05                                                      03031000
RSTDPTR  EQU   @04                                                      03032000
SAVEPTR  EQU   @02                                                      03033000
K        EQU   @02                                                      03034000
J        EQU   @04                                                      03035000
I        EQU   @06                                                      03036000
SCANPTR  EQU   @03                                                      03037000
PRNTPTR  EQU   @07                                                      03038000
TEMPPTR  EQU   @03                                                      03039000
JFCBPTR  EQU   @04                                                      03040000
DCBPTR   EQU   @02                                                      03041000
R0       EQU   @00                                                      03042000
R1       EQU   @01                                                      03043000
R2       EQU   @02                                                      03044000
R3       EQU   @03                                                      03045000
MLPMPTR  EQU   @09                                                      03046000
TWAPTR   EQU   @11                                                      03047000
R14      EQU   @14                                                      03048000
R15      EQU   @15                                                      03049000
PRNTCHAR EQU   0                                                        03050000
WORKCHAR EQU   0                                                        03051000
DATA2    EQU   0                                                        03052000
DATA4    EQU   0                                                        03053000
DATA6    EQU   0                                                        03054000
DATA7    EQU   0                                                        03055000
DATA9    EQU   0                                                        03056000
DATA11   EQU   0                                                        03057000
DATABUF  EQU   0                                                        03058000
@NM00007 EQU   0                                                        03059000
MSGDATA  EQU   @NM00007+4                                               03060000
MSGBLK   EQU   0                                                        03061000
MLPMPML  EQU   0                                                        03062000
MLPMFL1  EQU   MLPMPML                                                  03063000
MLPMWPM  EQU   MLPMFL1                                                  03064000
MLPMUPTB EQU   MLPMFL1                                                  03065000
MLPMRLIB EQU   MLPMFL1                                                  03066000
MLPMBUF  EQU   MLPMFL1                                                  03067000
MLPMCIB  EQU   MLPMFL1                                                  03068000
MLPMFL2  EQU   MLPMPML+1                                                03069000
MLPMINV  EQU   MLPMFL2                                                  03070000
MLPMUZ   EQU   MLPMFL2                                                  03071000
MLPMUNZ  EQU   MLPMFL2                                                  03072000
MLPMFS   EQU   MLPMFL2                                                  03073000
MLPMSIC  EQU   MLPMFL2                                                  03074000
MLPMIGN  EQU   MLPMFL2                                                  03075000
MLPMSCA  EQU   MLPMPML+4                                                03076000
SAVAREA  EQU   0                                                        03077000
SAVECHAR EQU   SAVAREA                                                  03078000
RSTDNAME EQU   0                                                        03079000
RSTDCHAR EQU   RSTDNAME                                                 03080000
SCANTBL  EQU   0                                                        03081000
TBLNAME  EQU   SCANTBL                                                  03082000
TBLNAME1 EQU   TBLNAME                                                  03083000
TBLDISP  EQU   SCANTBL+8                                                03084000
TBLFLAG  EQU   SCANTBL+11                                               03085000
TBLRSTD  EQU   TBLFLAG                                                  03086000
TBLNUMRC EQU   TBLFLAG                                                  03087000
TBLBINRY EQU   TBLFLAG                                                  03088000
TBLRIGHT EQU   TBLFLAG                                                  03089000
TBLZERO  EQU   TBLFLAG                                                  03090000
TBLRANGE EQU   TBLFLAG                                                  03091000
TBLPTR   EQU   SCANTBL+12                                               03092000
TBLLOW   EQU   TBLPTR                                                   03093000
TBLHIGH  EQU   SCANTBL+16                                               03094000
CHAIN    EQU   0                                                        03095000
CHFLG    EQU   CHAIN+4                                                  03096000
CHSTS    EQU   CHFLG+2                                                  03097000
CHACT    EQU   CHFLG+3                                                  03098000
CHKEY    EQU   CHAIN+8                                                  03099000
CHPARM   EQU   CHKEY                                                    03100000
CHPKE    EQU   CHAIN+28                                                 03101000
CHTJID   EQU   CHAIN+30                                                 03102000
CHPROCSN EQU   CHAIN+32                                                 03103000
CHACT1   EQU   CHPROCSN+3                                               03104000
CHASM    EQU   CHAIN+40                                                 03105000
CHCIBP   EQU   CHASM+4                                                  03106000
CHRGNSZ  EQU   CHASM+8                                                  03107000
CHSTEP   EQU   CHASM+24                                                 03108000
CHSWT    EQU   CHSTEP                                                   03109000
CHSHORT  EQU   CHASM+32                                                 03110000
CIBNAME  EQU   0                                                        03111000
CIBASID  EQU   CIBNAME+10                                               03112000
CIBDATLN EQU   CIBNAME+14                                               03113000
CIBDATA  EQU   CIBNAME+16                                               03114000
IHADCB   EQU   0                                                        03115000
IHADCS11 EQU   0                                                        03116000
DCBRELB  EQU   IHADCS11                                                 03117000
DCBREL   EQU   DCBRELB+1                                                03118000
DCBBUFCB EQU   IHADCS11+4                                               03119000
DCBDSORG EQU   IHADCS11+10                                              03120000
DCBDSRG1 EQU   DCBDSORG                                                 03121000
DCBDSRG2 EQU   DCBDSORG+1                                               03122000
DCBIOBAD EQU   IHADCS11+12                                              03123000
DCBODEB  EQU   DCBIOBAD                                                 03124000
DCBLNP   EQU   DCBODEB                                                  03125000
DCBQSLM  EQU   DCBLNP                                                   03126000
DCBIOBAA EQU   DCBODEB+1                                                03127000
IHADCS50 EQU   0                                                        03128000
DCBSVCXL EQU   IHADCS50                                                 03129000
DCBEODAD EQU   IHADCS50+4                                               03130000
DCBBFALN EQU   DCBEODAD                                                 03131000
DCBHIARC EQU   DCBBFALN                                                 03132000
DCBBFTEK EQU   DCBHIARC                                                 03133000
DCBBFT   EQU   DCBBFTEK                                                 03134000
DCBEXLST EQU   IHADCS50+8                                               03135000
DCBRECFM EQU   DCBEXLST                                                 03136000
DCBRECLA EQU   DCBRECFM                                                 03137000
IHADCS24 EQU   0                                                        03138000
DCBOFLGS EQU   IHADCS24+8                                               03139000
DCBOFLWR EQU   DCBOFLGS                                                 03140000
DCBOFOPN EQU   DCBOFLGS                                                 03141000
DCBIFLG  EQU   IHADCS24+9                                               03142000
DCBIBPCT EQU   DCBIFLG                                                  03143000
DCBMACR  EQU   IHADCS24+10                                              03144000
DCBMACR1 EQU   DCBMACR                                                  03145000
DCBMRFE  EQU   DCBMACR1                                                 03146000
DCBMRGET EQU   DCBMRFE                                                  03147000
DCBMRAPG EQU   DCBMACR1                                                 03148000
DCBMRRD  EQU   DCBMRAPG                                                 03149000
DCBMRCI  EQU   DCBMACR1                                                 03150000
DCBMRMVG EQU   DCBMRCI                                                  03151000
DCBMRLCG EQU   DCBMACR1                                                 03152000
DCBMRABC EQU   DCBMACR1                                                 03153000
DCBMRPT1 EQU   DCBMRABC                                                 03154000
DCBMRSBG EQU   DCBMRPT1                                                 03155000
DCBMRCRL EQU   DCBMACR1                                                 03156000
DCBMRCHK EQU   DCBMRCRL                                                 03157000
DCBMRRDX EQU   DCBMRCHK                                                 03158000
DCBMRDMG EQU   DCBMACR1                                                 03159000
DCBMACR2 EQU   DCBMACR+1                                                03160000
DCBMRPUT EQU   DCBMACR2                                                 03161000
DCBMRWRT EQU   DCBMACR2                                                 03162000
DCBMRMVP EQU   DCBMACR2                                                 03163000
DCBMR5WD EQU   DCBMACR2                                                 03164000
DCBMRLDM EQU   DCBMR5WD                                                 03165000
DCBMRLCP EQU   DCBMRLDM                                                 03166000
DCBMR4WD EQU   DCBMACR2                                                 03167000
DCBMRPT2 EQU   DCBMR4WD                                                 03168000
DCBMRTMD EQU   DCBMRPT2                                                 03169000
DCBMR3WD EQU   DCBMACR2                                                 03170000
DCBMRCTL EQU   DCBMR3WD                                                 03171000
DCBMRSTK EQU   DCBMRCTL                                                 03172000
DCBMR1WD EQU   DCBMACR2                                                 03173000
DCBMRSWA EQU   DCBMR1WD                                                 03174000
DCBMRDMD EQU   DCBMRSWA                                                 03175000
IHADCS25 EQU   0                                                        03176000
DCBMACRF EQU   IHADCS25+2                                               03177000
DCBMACF1 EQU   DCBMACRF                                                 03178000
DCBMFFE  EQU   DCBMACF1                                                 03179000
DCBMFGET EQU   DCBMFFE                                                  03180000
DCBMFAPG EQU   DCBMACF1                                                 03181000
DCBMFRD  EQU   DCBMFAPG                                                 03182000
DCBMFCI  EQU   DCBMACF1                                                 03183000
DCBMFMVG EQU   DCBMFCI                                                  03184000
DCBMFLCG EQU   DCBMACF1                                                 03185000
DCBMFABC EQU   DCBMACF1                                                 03186000
DCBMFPT1 EQU   DCBMFABC                                                 03187000
DCBMFSBG EQU   DCBMFPT1                                                 03188000
DCBMFCRL EQU   DCBMACF1                                                 03189000
DCBMFCHK EQU   DCBMFCRL                                                 03190000
DCBMFDMG EQU   DCBMACF1                                                 03191000
DCBMACF2 EQU   DCBMACRF+1                                               03192000
DCBMFPUT EQU   DCBMACF2                                                 03193000
DCBMFWRT EQU   DCBMACF2                                                 03194000
DCBMFMVP EQU   DCBMACF2                                                 03195000
DCBMF5WD EQU   DCBMACF2                                                 03196000
DCBMFLDM EQU   DCBMF5WD                                                 03197000
DCBMFLCP EQU   DCBMFLDM                                                 03198000
DCBMF4WD EQU   DCBMACF2                                                 03199000
DCBMFPT2 EQU   DCBMF4WD                                                 03200000
DCBMFTMD EQU   DCBMFPT2                                                 03201000
DCBMF3WD EQU   DCBMACF2                                                 03202000
DCBMFCTL EQU   DCBMF3WD                                                 03203000
DCBMFSTK EQU   DCBMFCTL                                                 03204000
DCBMF1WD EQU   DCBMACF2                                                 03205000
DCBMFSWA EQU   DCBMF1WD                                                 03206000
DCBMFDMD EQU   DCBMFSWA                                                 03207000
DCBDEBAD EQU   IHADCS25+4                                               03208000
DCBIFLGS EQU   DCBDEBAD                                                 03209000
DCBIFPCT EQU   DCBIFLGS                                                 03210000
IHADCS27 EQU   0                                                        03211000
DCBGET   EQU   IHADCS27                                                 03212000
DCBPUT   EQU   DCBGET                                                   03213000
DCBGETA  EQU   DCBPUT+1                                                 03214000
IHADCS36 EQU   0                                                        03215000
DCBGERR  EQU   IHADCS36                                                 03216000
DCBPERR  EQU   DCBGERR                                                  03217000
DCBCHECK EQU   DCBPERR                                                  03218000
DCBOPTCD EQU   DCBCHECK                                                 03219000
DCBOPTH  EQU   DCBOPTCD                                                 03220000
DCBOPTO  EQU   DCBOPTH                                                  03221000
DCBOPTZ  EQU   DCBOPTCD                                                 03222000
DCBGERRA EQU   DCBCHECK+1                                               03223000
DCBPERRA EQU   DCBGERRA                                                 03224000
DCBSYNAD EQU   IHADCS36+4                                               03225000
DCBCIND1 EQU   IHADCS36+8                                               03226000
DCBCIND2 EQU   IHADCS36+9                                               03227000
DCBIOBA  EQU   IHADCS36+16                                              03228000
DCBCICB  EQU   DCBIOBA                                                  03229000
IHADCS52 EQU   0                                                        03230000
DCBDIRCT EQU   IHADCS52                                                 03231000
DCBQSWS  EQU   DCBDIRCT                                                 03232000
DCBUSASI EQU   DCBQSWS                                                  03233000
DCBQADFS EQU   DCBUSASI                                                 03234000
DCBBUFOF EQU   DCBDIRCT+1                                               03235000
IHADCS37 EQU   0                                                        03236000
DCBFLAG1 EQU   IHADCS37                                                 03237000
IHADCS40 EQU   0                                                        03238000
DCBEOBAD EQU   IHADCS40                                                 03239000
DCBCCCW  EQU   IHADCS40+4                                               03240000
DCBRECAD EQU   DCBCCCW                                                  03241000
DCBRECBT EQU   DCBRECAD                                                 03242000
DCBRCREL EQU   DCBRECBT                                                 03243000
DCBCNTRL EQU   IHADCS40+12                                              03244000
DCBEROPT EQU   DCBCNTRL                                                 03245000
INFMJFCB EQU   0                                                        03246000
JFCBDSNM EQU   INFMJFCB                                                 03247000
JFCBELNM EQU   INFMJFCB+44                                              03248000
JFCBTSDM EQU   INFMJFCB+52                                              03249000
JFCFCBID EQU   INFMJFCB+56                                              03250000
JFCBFRID EQU   JFCFCBID                                                 03251000
JFCBLTYP EQU   INFMJFCB+66                                              03252000
JFCBOTTR EQU   INFMJFCB+67                                              03253000
JFCBUFOF EQU   JFCBOTTR                                                 03254000
JFCBFLSQ EQU   JFCBOTTR+1                                               03255000
JFCFUNC  EQU   JFCBFLSQ                                                 03256000
JFCBMASK EQU   INFMJFCB+72                                              03257000
JFCBFLG1 EQU   JFCBMASK+5                                               03258000
JFCOPEN  EQU   JFCBFLG1                                                 03259000
JFCBFLG2 EQU   JFCBMASK+6                                               03260000
JFCDEFER EQU   JFCBFLG2                                                 03261000
JFCBIND1 EQU   INFMJFCB+86                                              03262000
JFCBIND2 EQU   INFMJFCB+87                                              03263000
JFCAMPTR EQU   INFMJFCB+88                                              03264000
JFCBUFRQ EQU   JFCAMPTR                                                 03265000
JFCBUFNO EQU   JFCBUFRQ                                                 03266000
JFCBGNCP EQU   JFCAMPTR+1                                               03267000
JFCBHIAR EQU   JFCBGNCP                                                 03268000
JFCBFALN EQU   JFCBHIAR                                                 03269000
JFCBFTEK EQU   JFCBFALN                                                 03270000
JFCBBFTA EQU   JFCBFTEK                                                 03271000
JFCEROPT EQU   INFMJFCB+92                                              03272000
JFCTRTCH EQU   INFMJFCB+93                                              03273000
TCAST    EQU   0                                                        03274000
TCASUSER EQU   TCAST+4                                                  03275000
TCASUMAX EQU   TCASUSER+2                                               03276000
TCASACBP EQU   TCAST+8                                                  03277000
TCASRCON EQU   TCAST+16                                                 03278000
TCASCLSZ EQU   TCAST+18                                                 03279000
TCASHBUF EQU   TCAST+20                                                 03280000
TCASLBUF EQU   TCAST+24                                                 03281000
TCASCRSZ EQU   TCAST+28                                                 03282000
TCASCHNL EQU   TCAST+30                                                 03283000
TCASFLG1 EQU   TCAST+88                                                 03284000
TCASBKMD EQU   TCASFLG1                                                 03285000
TCASMDSW EQU   TCASFLG1                                                 03286000
TCASDUMP EQU   TCAST+132                                                03287000
DMPCD    EQU   0                                                        03288000
DMPRCCT  EQU   DMPCD                                                    03289000
DMPCD01  EQU   DMPCD+3                                                  03290000
DMPCD02  EQU   DMPCD+6                                                  03291000
DMPCD03  EQU   DMPCD+9                                                  03292000
DMPCD04  EQU   DMPCD+12                                                 03293000
DMPCD05  EQU   DMPCD+15                                                 03294000
DMPCD06  EQU   DMPCD+18                                                 03295000
DMPCD07  EQU   DMPCD+21                                                 03296000
DMPCD08  EQU   DMPCD+24                                                 03297000
DMPCD09  EQU   DMPCD+27                                                 03298000
DMPCD10  EQU   DMPCD+30                                                 03299000
DMPCD11  EQU   DMPCD+33                                                 03300000
DMPCD12  EQU   DMPCD+36                                                 03301000
DMPCD13  EQU   DMPCD+39                                                 03302000
DMPCD14  EQU   DMPCD+42                                                 03303000
DMPCD15  EQU   DMPCD+45                                                 03304000
DMPCD16  EQU   DMPCD+48                                                 03305000
TWAR     EQU   0                                                        03306000
TWACSCB  EQU   TWAR+16                                                  03307000
TWATCAST EQU   TWAR+20                                                  03308000
TWAMSG   EQU   TWAR+48                                                  03309000
TWAMFL   EQU   TWAR+80                                                  03310000
TWAVFL   EQU   TWAR+81                                                  03311000
TWAUFL   EQU   TWAR+82                                                  03312000
TWACFL   EQU   TWAR+83                                                  03313000
TWAM     EQU   TWAR+84                                                  03314000
TWAME    EQU   TWAM+68                                                  03315000
TWAMEI   EQU   TWAME                                                    03316000
TWAV     EQU   TWAR+184                                                 03317000
TWAVE    EQU   TWAV+68                                                  03318000
TWAVEI   EQU   TWAVE                                                    03319000
TWAVI    EQU   TWAR+284                                                 03320000
TWAU     EQU   TWAR+300                                                 03321000
TWAUE    EQU   TWAU+68                                                  03322000
TWAUEI   EQU   TWAUE                                                    03323000
TWAUI    EQU   TWAR+400                                                 03324000
TWAC     EQU   TWAR+408                                                 03325000
TWACE    EQU   TWAC+68                                                  03326000
TWACEI   EQU   TWACE                                                    03327000
TWACI    EQU   TWAR+508                                                 03328000
CIBPTR   EQU   CHCIBP                                                   03329000
CSCBPTR  EQU   TWACSCB                                                  03330000
TCASTPTR EQU   TWATCAST                                                 03331000
WRKPRMF  EQU   WORKPARM                                                 03332000
WRKPRMF1 EQU   WRKPRMF                                                  03333000
WRKPRMF2 EQU   WRKPRMF+4                                                03334000
WRKPRMH  EQU   WRKPRMF2+2                                               03335000
WRKPRMC  EQU   WRKPRMH+1                                                03336000
IKT013I  EQU   MSGDATA                                                  03337000
IKT014I  EQU   MSGDATA                                                  03338000
IKT017I  EQU   MSGDATA                                                  03339000
IKT018I  EQU   MSGDATA                                                  03340000
SAVAREAB EQU   SAVAREA                                                  03341000
SAVAREAF EQU   SAVAREAB+4                                               03342000
SAVAREAH EQU   SAVAREAF+2                                               03343000
SAVAREAC EQU   SAVAREAH+1                                               03344000
SAVAREAD EQU   SAVAREA                                                  03345000
SAVAREAI EQU   SAVAREAD+5                                               03346000
VTAMRC   EQU   SAVAREAI                                                 03347000
VTAMFB   EQU   SAVAREAI+1                                               03348000
SDUMP    EQU   SAVAREAI+2                                               03349000
CHAINS01 EQU   CHASM                                                    03350000
CHTYPE   EQU   CHAINS01+124                                             03351000
CHTRSTAT EQU   CHAINS01+125                                             03352000
CHCSYSO  EQU   CHAINS01+134                                             03353000
JFCKEYLE EQU   JFCTRTCH                                                 03354000
JFCCODE  EQU   JFCKEYLE                                                 03355000
JFCSTACK EQU   JFCTRTCH                                                 03356000
JFCMODE  EQU   JFCSTACK                                                 03357000
JFCSPPRT EQU   JFCTRTCH                                                 03358000
JFCBABFS EQU   JFCSPPRT+2                                               03359000
JFCLIMCT EQU   JFCBABFS                                                 03360000
JFCDSORG EQU   JFCSPPRT+5                                               03361000
JFCDSRG1 EQU   JFCDSORG                                                 03362000
JFCDSRG2 EQU   JFCDSORG+1                                               03363000
JFCRECFM EQU   JFCSPPRT+7                                               03364000
JFCRCFM  EQU   JFCRECFM                                                 03365000
JFCOPTCD EQU   JFCSPPRT+8                                               03366000
JFCWVCSP EQU   JFCOPTCD                                                 03367000
JFCWVCIS EQU   JFCWVCSP                                                 03368000
JFCWVCBD EQU   JFCWVCIS                                                 03369000
JFCALLOW EQU   JFCOPTCD                                                 03370000
JFCRSV17 EQU   JFCALLOW                                                 03371000
JFCOVER  EQU   JFCRSV17                                                 03372000
JFCPCIBT EQU   JFCOPTCD                                                 03373000
JFCMAST  EQU   JFCPCIBT                                                 03374000
JFCEXT   EQU   JFCMAST                                                  03375000
JFCBCKPT EQU   JFCOPTCD                                                 03376000
JFCIND   EQU   JFCBCKPT                                                 03377000
JFCRSV18 EQU   JFCOPTCD                                                 03378000
JFCCYL   EQU   JFCRSV18                                                 03379000
JFCACT   EQU   JFCCYL                                                   03380000
JFCREDUC EQU   JFCOPTCD                                                 03381000
JFCRSV19 EQU   JFCREDUC                                                 03382000
JFCRSV20 EQU   JFCRSV19                                                 03383000
JFCRSV21 EQU   JFCOPTCD                                                 03384000
JFCDEL   EQU   JFCRSV21                                                 03385000
JFCOPTJ  EQU   JFCOPTCD                                                 03386000
JFCREORG EQU   JFCOPTJ                                                  03387000
JFCBLKSI EQU   JFCSPPRT+9                                               03388000
JFCBUFSI EQU   JFCBLKSI                                                 03389000
JFCAMSYN EQU   JFCSPPRT+11                                              03390000
JFCNCP   EQU   JFCAMSYN+2                                               03391000
JFCNTM   EQU   JFCAMSYN+3                                               03392000
JFCBFSEQ EQU   JFCNTM                                                   03393000
JFCPCI   EQU   JFCBFSEQ                                                 03394000
JFCRESRV EQU   JFCAMSYN+4                                               03395000
JFCUCSEG EQU   JFCRESRV                                                 03396000
JFCUCSOP EQU   JFCUCSEG+4                                               03397000
JFCOUTLI EQU   JFCUCSEG+5                                               03398000
JFCTHRSH EQU   JFCOUTLI                                                 03399000
JFCCPRI  EQU   JFCTHRSH                                                 03400000
JFCBVOLS EQU   JFCUCSEG+10                                              03401000
JFCBS001 EQU   JFCBVOLS                                                 03402000
JFCBPQTY EQU   JFCBS001+34                                              03403000
JFCBCTRI EQU   JFCBS001+37                                              03404000
JFCBSQTY EQU   JFCBS001+38                                              03405000
JFCFLGS1 EQU   JFCBS001+41                                              03406000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03407000
JFCBEND  EQU   JFCBS001+58                                              03408000
JFCBSPTN EQU   JFCBS001+57                                              03409000
JFCBVLCT EQU   JFCBS001+56                                              03410000
JFCBDRLH EQU   JFCBS001+53                                              03411000
JFCBSBNM EQU   JFCBS001+50                                              03412000
JFCBABST EQU   JFCBS001+48                                              03413000
JFCBSPNM EQU   JFCBS001+45                                              03414000
JFCBDQTY EQU   JFCBS001+42                                              03415000
JFCBUAFF EQU   JFCFLGS1                                                 03416000
JFCRSV45 EQU   JFCFLGS1                                                 03417000
JFCVRDS  EQU   JFCFLGS1                                                 03418000
JFCBCEOV EQU   JFCFLGS1                                                 03419000
JFCRSV42 EQU   JFCFLGS1                                                 03420000
JFCRSV41 EQU   JFCFLGS1                                                 03421000
JFCTOPEN EQU   JFCFLGS1                                                 03422000
JFCBDLET EQU   JFCFLGS1                                                 03423000
JFCRQID  EQU   JFCBSQTY                                                 03424000
JFCROUND EQU   JFCBCTRI                                                 03425000
JFCALX   EQU   JFCBCTRI                                                 03426000
JFCMIXG  EQU   JFCBCTRI                                                 03427000
JFCONTIG EQU   JFCBCTRI                                                 03428000
JFCRSV29 EQU   JFCBCTRI                                                 03429000
JFCBMSGP EQU   JFCBCTRI                                                 03430000
JFCBSPAC EQU   JFCBCTRI                                                 03431000
JFCRUNIT EQU   JFCBPQTY                                                 03432000
JFCBEXAD EQU   JFCBS001+31                                              03433000
JFCBEXTL EQU   JFCBS001+30                                              03434000
JFCMSVGP EQU   JFCBS001+22                                              03435000
@NM00327 EQU   JFCBS001                                                 03436000
JFCAVOLS EQU   JFCBVOLS                                                 03437000
JFCBNVOL EQU   JFCUCSEG+9                                               03438000
JFCBNTCS EQU   JFCUCSEG+8                                               03439000
JFCSOWA  EQU   JFCOUTLI+1                                               03440000
JFCSEND  EQU   JFCCPRI                                                  03441000
JFCEQUAL EQU   JFCCPRI                                                  03442000
JFCRECV  EQU   JFCCPRI                                                  03443000
JFCRSV34 EQU   JFCCPRI                                                  03444000
JFCRSV33 EQU   JFCCPRI                                                  03445000
JFCRSV55 EQU   JFCCPRI                                                  03446000
JFCRSV54 EQU   JFCCPRI                                                  03447000
JFCRSV53 EQU   JFCCPRI                                                  03448000
JFCRSV27 EQU   JFCUCSOP                                                 03449000
JFCRSV26 EQU   JFCUCSOP                                                 03450000
JFCFCBVR EQU   JFCUCSOP                                                 03451000
JFCFCBAL EQU   JFCUCSOP                                                 03452000
JFCVER   EQU   JFCUCSOP                                                 03453000
JFCRSV25 EQU   JFCUCSOP                                                 03454000
JFCFOLD  EQU   JFCUCSOP                                                 03455000
JFCBEXTP EQU   JFCUCSOP                                                 03456000
JFCUCSID EQU   JFCUCSEG                                                 03457000
JFCINTVL EQU   JFCSPPRT+19                                              03458000
JFCDBUFN EQU   JFCRESRV+3                                               03459000
JFCCYLOF EQU   JFCRESRV+2                                               03460000
JFCRKP   EQU   JFCRESRV                                                 03461000
JFCPCIR2 EQU   JFCPCI                                                   03462000
JFCPCIR1 EQU   JFCPCI                                                   03463000
JFCPCIN2 EQU   JFCPCI                                                   03464000
JFCPCIN1 EQU   JFCPCI                                                   03465000
JFCPCIA2 EQU   JFCPCI                                                   03466000
JFCPCIA1 EQU   JFCPCI                                                   03467000
JFCPCIX2 EQU   JFCPCI                                                   03468000
JFCPCIX1 EQU   JFCPCI                                                   03469000
JFCBUFMX EQU   JFCNCP                                                   03470000
JFCLRECL EQU   JFCAMSYN                                                 03471000
JFCBAXBF EQU   JFCBUFSI                                                 03472000
JFCREL   EQU   JFCREORG                                                 03473000
JFCRSV22 EQU   JFCDEL                                                   03474000
JFCSRCHD EQU   JFCRSV20                                                 03475000
JFCOPTQ  EQU   JFCACT                                                   03476000
JFCFEED  EQU   JFCIND                                                   03477000
JFCCBWU  EQU   JFCEXT                                                   03478000
JFCWUMSG EQU   JFCOVER                                                  03479000
JFCSDNAM EQU   JFCWVCBD                                                 03480000
@NM00326 EQU   JFCRECFM                                                 03481000
JFCCHAR  EQU   JFCRECFM                                                 03482000
JFCRFS   EQU   JFCRECFM                                                 03483000
JFCRFB   EQU   JFCRECFM                                                 03484000
JFCRFO   EQU   JFCRCFM                                                  03485000
JFCFMREC EQU   JFCRCFM                                                  03486000
JFCRSV16 EQU   JFCDSRG2                                                 03487000
JFCRSV15 EQU   JFCDSRG2                                                 03488000
JFCORGTR EQU   JFCDSRG2                                                 03489000
JFCORGAM EQU   JFCDSRG2                                                 03490000
JFCRSV13 EQU   JFCDSRG2                                                 03491000
JFCORGTQ EQU   JFCDSRG2                                                 03492000
JFCORGTX EQU   JFCDSRG2                                                 03493000
JFCORGGS EQU   JFCDSRG2                                                 03494000
JFCORGU  EQU   JFCDSRG1                                                 03495000
JFCORGPO EQU   JFCDSRG1                                                 03496000
JFCORGMQ EQU   JFCDSRG1                                                 03497000
JFCORGCQ EQU   JFCDSRG1                                                 03498000
JFCORGCX EQU   JFCDSRG1                                                 03499000
JFCORGDA EQU   JFCDSRG1                                                 03500000
JFCORGPS EQU   JFCDSRG1                                                 03501000
JFCORGIS EQU   JFCDSRG1                                                 03502000
JFCTRKBL EQU   JFCLIMCT+1                                               03503000
@NM00325 EQU   JFCLIMCT                                                 03504000
JFCDEN   EQU   JFCSPPRT+1                                               03505000
JFCPRTSP EQU   JFCSPPRT                                                 03506000
JFCONE   EQU   JFCMODE                                                  03507000
JFCTWO   EQU   JFCMODE                                                  03508000
JFCRSV07 EQU   JFCMODE                                                  03509000
JFCRSV06 EQU   JFCMODE                                                  03510000
JFCMODER EQU   JFCMODE                                                  03511000
JFCMODEO EQU   JFCMODE                                                  03512000
JFCEBCD  EQU   JFCMODE                                                  03513000
JFCBIN   EQU   JFCMODE                                                  03514000
JFCRSV32 EQU   JFCCODE                                                  03515000
JFCTTY   EQU   JFCCODE                                                  03516000
JFCASCII EQU   JFCCODE                                                  03517000
JFCNCR   EQU   JFCCODE                                                  03518000
JFCBUR   EQU   JFCCODE                                                  03519000
JFCFRI   EQU   JFCCODE                                                  03520000
JFCBCD   EQU   JFCCODE                                                  03521000
JFCNOCON EQU   JFCCODE                                                  03522000
CHLAST   EQU   CHAINS01+136                                             03523000
CHSPA    EQU   CHAINS01+135                                             03524000
CHUSERID EQU   CHCSYSO                                                  03525000
CHJB     EQU   CHCSYSO                                                  03526000
CHDUMP   EQU   CHCSYSO                                                  03527000
CHQUE    EQU   CHCSYSO                                                  03528000
CHHOLD   EQU   CHCSYSO                                                  03529000
CHOUT    EQU   CHCSYSO                                                  03530000
CHINN    EQU   CHCSYSO                                                  03531000
CHALL    EQU   CHCSYSO                                                  03532000
CHINC    EQU   CHAINS01+132                                             03533000
CHPEND   EQU   CHAINS01+128                                             03534000
CHARID   EQU   CHAINS01+127                                             03535000
CHCNID   EQU   CHAINS01+126                                             03536000
@NM00300 EQU   CHTRSTAT                                                 03537000
CHTSL    EQU   CHTRSTAT                                                 03538000
CHTS     EQU   CHTRSTAT                                                 03539000
CHINITL  EQU   CHTRSTAT                                                 03540000
CHINIT   EQU   CHTRSTAT                                                 03541000
CHJOBSL  EQU   CHTRSTAT                                                 03542000
CHJOBS   EQU   CHTRSTAT                                                 03543000
CHDEF    EQU   CHTYPE                                                   03544000
CHHIAR   EQU   CHTYPE                                                   03545000
CHARSV29 EQU   CHTYPE                                                   03546000
CHARSV28 EQU   CHTYPE                                                   03547000
CHARSV27 EQU   CHTYPE                                                   03548000
CHARSV26 EQU   CHTYPE                                                   03549000
CHARSV25 EQU   CHTYPE                                                   03550000
CHDSTAT  EQU   CHTYPE                                                   03551000
CHBUF    EQU   CHAINS01                                                 03552000
@NM00047 EQU   SAVAREAD                                                 03553000
@NM00046 EQU   SAVAREAH                                                 03554000
@NM00045 EQU   SAVAREAF                                                 03555000
@NM00044 EQU   SAVAREAB                                                 03556000
@NM00003 EQU   WRKPRMH                                                  03557000
@NM00002 EQU   WRKPRMF2                                                 03558000
TWAEND   EQU   TWAR+536                                                 03559000
TWAWORKE EQU   TWAR+524                                                 03560000
@NM00340 EQU   TWACI+13                                                 03561000
TWACSKIP EQU   TWACI+12                                                 03562000
TWACMODQ EQU   TWACI+8                                                  03563000
TWACSTPQ EQU   TWACI+4                                                  03564000
TWACECB  EQU   TWACI                                                    03565000
TWACERRS EQU   TWACE+4                                                  03566000
TWACERA  EQU   TWACEI+1                                                 03567000
TWACEIFC EQU   TWACEI                                                   03568000
TWACRTFC EQU   TWAC+60                                                  03569000
TWACABFC EQU   TWAC+56                                                  03570000
TWACTWA  EQU   TWAC+52                                                  03571000
TWACEWA  EQU   TWAC+4                                                   03572000
TWACID   EQU   TWAC                                                     03573000
TWAUACQH EQU   TWAUI+4                                                  03574000
TWAUECB  EQU   TWAUI                                                    03575000
TWAUERRS EQU   TWAUE+4                                                  03576000
TWAUERA  EQU   TWAUEI+1                                                 03577000
TWAUEIFC EQU   TWAUEI                                                   03578000
TWAURTFC EQU   TWAU+60                                                  03579000
TWAUABFC EQU   TWAU+56                                                  03580000
TWAUTWA  EQU   TWAU+52                                                  03581000
TWAUEWA  EQU   TWAU+4                                                   03582000
TWAUID   EQU   TWAU                                                     03583000
TWAVACQH EQU   TWAVI+12                                                 03584000
TWAVTHQH EQU   TWAVI+8                                                  03585000
TWAVTEQH EQU   TWAVI+4                                                  03586000
TWAVECB  EQU   TWAVI                                                    03587000
TWAVERRS EQU   TWAVE+4                                                  03588000
TWAVERA  EQU   TWAVEI+1                                                 03589000
TWAVEIFC EQU   TWAVEI                                                   03590000
TWAVRTFC EQU   TWAV+60                                                  03591000
TWAVABFC EQU   TWAV+56                                                  03592000
TWAVTWA  EQU   TWAV+52                                                  03593000
TWAVEWA  EQU   TWAV+4                                                   03594000
TWAVID   EQU   TWAV                                                     03595000
TWAMERRS EQU   TWAME+4                                                  03596000
TWAMERA  EQU   TWAMEI+1                                                 03597000
TWAMEIFC EQU   TWAMEI                                                   03598000
TWAMRTFC EQU   TWAM+60                                                  03599000
TWAMABFC EQU   TWAM+56                                                  03600000
TWAMTWA  EQU   TWAM+52                                                  03601000
TWAMEWA  EQU   TWAM+4                                                   03602000
TWAMID   EQU   TWAM                                                     03603000
@NM00339 EQU   TWACFL                                                   03604000
TWACFL4  EQU   TWACFL                                                   03605000
TWACFL2  EQU   TWACFL                                                   03606000
TWACFL1  EQU   TWACFL                                                   03607000
@NM00338 EQU   TWAUFL                                                   03608000
TWAUFL4  EQU   TWAUFL                                                   03609000
TWAUFL3  EQU   TWAUFL                                                   03610000
TWAUFL2  EQU   TWAUFL                                                   03611000
TWAUFL1  EQU   TWAUFL                                                   03612000
@NM00337 EQU   TWAVFL                                                   03613000
TWAVFL6  EQU   TWAVFL                                                   03614000
TWAVFL5  EQU   TWAVFL                                                   03615000
TWAVFL4  EQU   TWAVFL                                                   03616000
TWAVFL3  EQU   TWAVFL                                                   03617000
TWAVFL2  EQU   TWAVFL                                                   03618000
TWAVFL1  EQU   TWAVFL                                                   03619000
@NM00336 EQU   TWAMFL                                                   03620000
TWAMFL1  EQU   TWAMFL                                                   03621000
TWACCOMP EQU   TWAR+76                                                  03622000
TWAUCOMP EQU   TWAR+72                                                  03623000
TWAVCOMP EQU   TWAR+68                                                  03624000
TWAMECB  EQU   TWAR+64                                                  03625000
TWACTCB  EQU   TWAR+60                                                  03626000
TWAUTCB  EQU   TWAR+56                                                  03627000
TWAVTCB  EQU   TWAR+52                                                  03628000
TWADEQAS EQU   TWAR+44                                                  03629000
TWAEESR  EQU   TWAR+40                                                  03630000
TWAPPSR  EQU   TWAR+36                                                  03631000
TWATCSR  EQU   TWAR+32                                                  03632000
TWATTSR  EQU   TWAR+28                                                  03633000
TWAINIT  EQU   TWAR+24                                                  03634000
TWAASCB  EQU   TWAR+12                                                  03635000
TWAPASQH EQU   TWAR+8                                                   03636000
TWASYNQH EQU   TWAR+4                                                   03637000
TWARSON  EQU   TWAR+2                                                   03638000
TWACOMP  EQU   TWAR                                                     03639000
DMPOP16  EQU   DMPCD16+2                                                03640000
DMPFB16  EQU   DMPCD16+1                                                03641000
DMPRC16  EQU   DMPCD16                                                  03642000
DMPOP15  EQU   DMPCD15+2                                                03643000
DMPFB15  EQU   DMPCD15+1                                                03644000
DMPRC15  EQU   DMPCD15                                                  03645000
DMPOP14  EQU   DMPCD14+2                                                03646000
DMPFB14  EQU   DMPCD14+1                                                03647000
DMPRC14  EQU   DMPCD14                                                  03648000
DMPOP13  EQU   DMPCD13+2                                                03649000
DMPFB13  EQU   DMPCD13+1                                                03650000
DMPRC13  EQU   DMPCD13                                                  03651000
DMPOP12  EQU   DMPCD12+2                                                03652000
DMPFB12  EQU   DMPCD12+1                                                03653000
DMPRC12  EQU   DMPCD12                                                  03654000
DMPOP11  EQU   DMPCD11+2                                                03655000
DMPFB11  EQU   DMPCD11+1                                                03656000
DMPRC11  EQU   DMPCD11                                                  03657000
DMPOP10  EQU   DMPCD10+2                                                03658000
DMPFB10  EQU   DMPCD10+1                                                03659000
DMPRC10  EQU   DMPCD10                                                  03660000
DMPOP09  EQU   DMPCD09+2                                                03661000
DMPFB09  EQU   DMPCD09+1                                                03662000
DMPRC09  EQU   DMPCD09                                                  03663000
DMPOP08  EQU   DMPCD08+2                                                03664000
DMPFB08  EQU   DMPCD08+1                                                03665000
DMPRC08  EQU   DMPCD08                                                  03666000
DMPOP07  EQU   DMPCD07+2                                                03667000
DMPFB07  EQU   DMPCD07+1                                                03668000
DMPRC07  EQU   DMPCD07                                                  03669000
DMPOP06  EQU   DMPCD06+2                                                03670000
DMPFB06  EQU   DMPCD06+1                                                03671000
DMPRC06  EQU   DMPCD06                                                  03672000
DMPOP05  EQU   DMPCD05+2                                                03673000
DMPFB05  EQU   DMPCD05+1                                                03674000
DMPRC05  EQU   DMPCD05                                                  03675000
DMPOP04  EQU   DMPCD04+2                                                03676000
DMPFB04  EQU   DMPCD04+1                                                03677000
DMPRC04  EQU   DMPCD04                                                  03678000
DMPOP03  EQU   DMPCD03+2                                                03679000
DMPFB03  EQU   DMPCD03+1                                                03680000
DMPRC03  EQU   DMPCD03                                                  03681000
DMPOP02  EQU   DMPCD02+2                                                03682000
DMPFB02  EQU   DMPCD02+1                                                03683000
DMPRC02  EQU   DMPCD02                                                  03684000
DMPOP01  EQU   DMPCD01+2                                                03685000
DMPFB01  EQU   DMPCD01+1                                                03686000
DMPRC01  EQU   DMPCD01                                                  03687000
@NM00335 EQU   DMPCD+1                                                  03688000
TCASTEND EQU   TCAST+148                                                03689000
TCASTTYO EQU   TCAST+144                                                03690000
TCAS767O EQU   TCAST+140                                                03691000
TCAS767I EQU   TCAST+136                                                03692000
TCASSCHD EQU   TCAST+128                                                03693000
TCASTPND EQU   TCAST+124                                                03694000
TCASOMJR EQU   TCAST+120                                                03695000
@NM00334 EQU   TCAST+118                                                03696000
TCASBR14 EQU   TCAST+116                                                03697000
TCASATTN EQU   TCAST+112                                                03698000
TCASASCI EQU   TCAST+108                                                03699000
TCASTTQH EQU   TCAST+104                                                03700000
@NM00333 EQU   TCAST+102                                                03701000
@NM00332 EQU   TCAST+100                                                03702000
@NM00331 EQU   TCAST+98                                                 03703000
@NM00330 EQU   TCAST+96                                                 03704000
TCASASCB EQU   TCAST+92                                                 03705000
TCASFLG4 EQU   TCAST+91                                                 03706000
TCASFLG3 EQU   TCAST+90                                                 03707000
TCASFLG2 EQU   TCAST+89                                                 03708000
@NM00329 EQU   TCASFLG1                                                 03709000
TCASNACT EQU   TCASFLG1                                                 03710000
TCASVSD  EQU   TCASFLG1                                                 03711000
TCASABND EQU   TCASFLG1                                                 03712000
TCASLTE  EQU   TCAST+84                                                 03713000
TCASEXIT EQU   TCAST+80                                                 03714000
TCASOQM  EQU   TCAST+76                                                 03715000
TCASIQM  EQU   TCAST+72                                                 03716000
TCASTSB  EQU   TCAST+68                                                 03717000
TCASTTL  EQU   TCAST+64                                                 03718000
TCASWA   EQU   TCAST+60                                                 03719000
TCASFRR  EQU   TCAST+56                                                 03720000
TCASMSGS EQU   TCAST+52                                                 03721000
TCASDATO EQU   TCAST+48                                                 03722000
TCASDATI EQU   TCAST+44                                                 03723000
TCASXECB EQU   TCAST+40                                                 03724000
TCASTID  EQU   TCAST+32                                                 03725000
@NM00328 EQU   TCAST+31                                                 03726000
TCASUSEC EQU   TCASUSER                                                 03727000
TCASID   EQU   TCAST                                                    03728000
JFCRSV05 EQU   JFCEROPT                                                 03729000
JFCRSV04 EQU   JFCEROPT                                                 03730000
JFCRSV03 EQU   JFCEROPT                                                 03731000
JFCRSV02 EQU   JFCEROPT                                                 03732000
JFCTOPT  EQU   JFCEROPT                                                 03733000
JFCABN   EQU   JFCEROPT                                                 03734000
JFCSKP   EQU   JFCEROPT                                                 03735000
JFCACC   EQU   JFCEROPT                                                 03736000
JFCBUFL  EQU   JFCAMPTR+2                                               03737000
JFCFWORD EQU   JFCBFTEK                                                 03738000
JFCDWORD EQU   JFCBFTEK                                                 03739000
JFCHIER1 EQU   JFCBFTEK                                                 03740000
JFCDYN   EQU   JFCBFTEK                                                 03741000
JFCEXC   EQU   JFCBFTEK                                                 03742000
JFCBBFTR EQU   JFCBBFTA                                                 03743000
JFCSIM   EQU   JFCBBFTA                                                 03744000
JFCHIER  EQU   JFCBFTEK                                                 03745000
JFCBFOUT EQU   JFCBUFNO                                                 03746000
JFCBUFIN EQU   JFCBUFNO                                                 03747000
JFCTEMP  EQU   JFCBIND2                                                 03748000
JFCREQ   EQU   JFCBIND2                                                 03749000
JFCENT   EQU   JFCBIND2                                                 03750000
JFCSHARE EQU   JFCBIND2                                                 03751000
JFCSECUR EQU   JFCBIND2                                                 03752000
JFCDISP  EQU   JFCBIND2                                                 03753000
JFCPDS   EQU   JFCBIND1                                                 03754000
JFCGDG   EQU   JFCBIND1                                                 03755000
JFCADDED EQU   JFCBIND1                                                 03756000
JFCLOC   EQU   JFCBIND1                                                 03757000
JFCRLSE  EQU   JFCBIND1                                                 03758000
JFCBXPDT EQU   INFMJFCB+83                                              03759000
JFCBCRDT EQU   INFMJFCB+80                                              03760000
JFCBOPS2 EQU   JFCBMASK+7                                               03761000
JFCRCTLG EQU   JFCBFLG2                                                 03762000
JFCBBUFF EQU   JFCBFLG2                                                 03763000
JFCTRACE EQU   JFCBFLG2                                                 03764000
JFCSDRPS EQU   JFCBFLG2                                                 03765000
JFCMODNW EQU   JFCBFLG2                                                 03766000
JFCNRPS  EQU   JFCDEFER                                                 03767000
JFCOUTOP EQU   JFCBFLG2                                                 03768000
JFCINOP  EQU   JFCBFLG2                                                 03769000
JFCBPWBP EQU   JFCOPEN                                                  03770000
@NM00324 EQU   JFCOPEN                                                  03771000
JFCDUAL  EQU   JFCBFLG1                                                 03772000
JFCSLDES EQU   JFCBFLG1                                                 03773000
JFCSLCRE EQU   JFCBFLG1                                                 03774000
JFCSTAND EQU   JFCBFLG1                                                 03775000
JFCBOPS1 EQU   JFCBMASK                                                 03776000
JFCBVLSQ EQU   INFMJFCB+70                                              03777000
JFCRSV31 EQU   JFCFUNC                                                  03778000
JFCFNCBT EQU   JFCFUNC                                                  03779000
JFCFNCBX EQU   JFCFUNC                                                  03780000
JFCFNCBD EQU   JFCFUNC                                                  03781000
JFCFNCBW EQU   JFCFUNC                                                  03782000
JFCFNCBP EQU   JFCFUNC                                                  03783000
JFCFNCBR EQU   JFCFUNC                                                  03784000
JFCFNCBI EQU   JFCFUNC                                                  03785000
JFCBFOFL EQU   JFCBUFOF                                                 03786000
JFCNL    EQU   JFCBLTYP                                                 03787000
JFCSL    EQU   JFCBLTYP                                                 03788000
JFCNSL   EQU   JFCBLTYP                                                 03789000
JFCSUL   EQU   JFCBLTYP                                                 03790000
JFCBLP   EQU   JFCBLTYP                                                 03791000
JFCBLTM  EQU   JFCBLTYP                                                 03792000
JFCBAL   EQU   JFCBLTYP                                                 03793000
JFCRSV38 EQU   JFCBLTYP                                                 03794000
JFCVINDX EQU   INFMJFCB+64                                              03795000
JFCNLREC EQU   INFMJFCB+62                                              03796000
JFCBADBF EQU   INFMJFCB+60                                              03797000
JFCAMSTR EQU   JFCBFRID+2                                               03798000
JFCAMCRO EQU   JFCBFRID                                                 03799000
JFCBDSCB EQU   INFMJFCB+53                                              03800000
JFCPAT   EQU   JFCBTSDM                                                 03801000
JFCNDCB  EQU   JFCBTSDM                                                 03802000
JFCNDSCB EQU   JFCBTSDM                                                 03803000
JFCNWRIT EQU   JFCBTSDM                                                 03804000
JFCTTR   EQU   JFCBTSDM                                                 03805000
JFCSDS   EQU   JFCBTSDM                                                 03806000
JFCVSL   EQU   JFCBTSDM                                                 03807000
JFCCAT   EQU   JFCBTSDM                                                 03808000
JFCIPLTX EQU   JFCBELNM                                                 03809000
JFCBQNAM EQU   JFCBDSNM                                                 03810000
DCBEOB   EQU   IHADCS40+20                                              03811000
DCBPRECL EQU   IHADCS40+18                                              03812000
@NM00323 EQU   IHADCS40+16                                              03813000
DCBCNTRA EQU   DCBCNTRL+1                                               03814000
@NM00322 EQU   DCBEROPT                                                 03815000
DCBERABE EQU   DCBEROPT                                                 03816000
DCBERSKP EQU   DCBEROPT                                                 03817000
DCBERACC EQU   DCBEROPT                                                 03818000
DCBLRECL EQU   IHADCS40+10                                              03819000
@NM00321 EQU   IHADCS40+9                                               03820000
@NM00320 EQU   IHADCS40+8                                               03821000
DCBRECA  EQU   DCBRECAD+1                                               03822000
@NM00319 EQU   DCBRECBT                                                 03823000
DCBRCFGT EQU   DCBRCREL                                                 03824000
DCBRCTRU EQU   DCBRCREL                                                 03825000
DCBLCCW  EQU   DCBEOBAD                                                 03826000
@NM00318 EQU   DCBFLAG1                                                 03827000
DCBSTFLS EQU   DCBFLAG1                                                 03828000
DCBSTQCK EQU   DCBFLAG1                                                 03829000
DCBDIRCQ EQU   DCBBUFOF                                                 03830000
DCBQSTRU EQU   DCBUSASI                                                 03831000
@NM00317 EQU   DCBUSASI                                                 03832000
DCBQADF3 EQU   DCBQADFS                                                 03833000
DCBQADF2 EQU   DCBQADFS                                                 03834000
DCBQADF1 EQU   DCBQADFS                                                 03835000
DCBBLBP  EQU   DCBUSASI                                                 03836000
@NM00316 EQU   DCBUSASI                                                 03837000
DCBCICBA EQU   DCBCICB+1                                                03838000
@NM00315 EQU   DCBCICB                                                  03839000
DCBOFFSW EQU   IHADCS36+15                                              03840000
DCBOFFSR EQU   IHADCS36+14                                              03841000
DCBWCPL  EQU   IHADCS36+13                                              03842000
DCBWCPO  EQU   IHADCS36+12                                              03843000
DCBBLKSI EQU   IHADCS36+10                                              03844000
DCBCNQSM EQU   DCBCIND2                                                 03845000
DCBCNFEO EQU   DCBCIND2                                                 03846000
DCBCNCHS EQU   DCBCIND2                                                 03847000
DCBCNBFP EQU   DCBCIND2                                                 03848000
DCBCNIOE EQU   DCBCIND2                                                 03849000
DCBCNCLO EQU   DCBCIND2                                                 03850000
DCBCNWRO EQU   DCBCIND2                                                 03851000
DCBCNSTO EQU   DCBCIND2                                                 03852000
DCBCNEXB EQU   DCBCIND1                                                 03853000
@NM00314 EQU   DCBCIND1                                                 03854000
DCBCNBRM EQU   DCBCIND1                                                 03855000
@NM00313 EQU   DCBCIND1                                                 03856000
DCBCNEVA EQU   DCBCIND1                                                 03857000
DCBCNEVB EQU   DCBCIND1                                                 03858000
DCBCNSRD EQU   DCBCIND1                                                 03859000
DCBCNTOV EQU   DCBCIND1                                                 03860000
DCBSYNA  EQU   DCBSYNAD+1                                               03861000
DCBIOBL  EQU   DCBSYNAD                                                 03862000
DCBCHCKA EQU   DCBPERRA                                                 03863000
DCBOPTJ  EQU   DCBOPTCD                                                 03864000
DCBOPTT  EQU   DCBOPTCD                                                 03865000
DCBSRCHD EQU   DCBOPTZ                                                  03866000
DCBOPTQ  EQU   DCBOPTCD                                                 03867000
DCBBCKPT EQU   DCBOPTO                                                  03868000
DCBOPTC  EQU   DCBOPTCD                                                 03869000
DCBOPTU  EQU   DCBOPTCD                                                 03870000
DCBOPTW  EQU   DCBOPTCD                                                 03871000
DCBPUTA  EQU   DCBGETA                                                  03872000
@NM00312 EQU   DCBPUT                                                   03873000
DCBDEBA  EQU   DCBDEBAD+1                                               03874000
@NM00311 EQU   DCBIFLGS                                                 03875000
DCBIFIOE EQU   DCBIFLGS                                                 03876000
DCBCH12  EQU   DCBIFPCT                                                 03877000
DCBCH9   EQU   DCBIFPCT                                                 03878000
DCBIFEC  EQU   DCBIFLGS                                                 03879000
DCBMFSTI EQU   DCBMFDMD                                                 03880000
DCBMFAWR EQU   DCBMFSTK                                                 03881000
DCBMFUIP EQU   DCBMFTMD                                                 03882000
DCBMFIDW EQU   DCBMFLCP                                                 03883000
DCBMFWRK EQU   DCBMFMVP                                                 03884000
DCBMFRDQ EQU   DCBMFWRT                                                 03885000
DCBMFGTQ EQU   DCBMFPUT                                                 03886000
DCBMFSTL EQU   DCBMACF2                                                 03887000
DCBMFCK  EQU   DCBMFDMG                                                 03888000
DCBMFRDX EQU   DCBMFCHK                                                 03889000
DCBMFDBF EQU   DCBMFSBG                                                 03890000
DCBMFRDI EQU   DCBMFLCG                                                 03891000
DCBMFRDK EQU   DCBMFMVG                                                 03892000
DCBMFWRQ EQU   DCBMFRD                                                  03893000
DCBMFPTQ EQU   DCBMFGET                                                 03894000
DCBMFECP EQU   DCBMACF1                                                 03895000
DCBTIOT  EQU   IHADCS25                                                 03896000
DCBMRSTI EQU   DCBMRDMD                                                 03897000
DCBMRAWR EQU   DCBMRSTK                                                 03898000
DCBMRUIP EQU   DCBMRTMD                                                 03899000
DCBMRIDW EQU   DCBMRLCP                                                 03900000
DCBMRWRK EQU   DCBMRMVP                                                 03901000
DCBMRRDQ EQU   DCBMRWRT                                                 03902000
DCBMRGTQ EQU   DCBMRPUT                                                 03903000
DCBMRSTL EQU   DCBMACR2                                                 03904000
DCBMRCK  EQU   DCBMRDMG                                                 03905000
DCBPGFXA EQU   DCBMRRDX                                                 03906000
DCBMRDBF EQU   DCBMRSBG                                                 03907000
DCBMRRDI EQU   DCBMRLCG                                                 03908000
DCBMRRDK EQU   DCBMRMVG                                                 03909000
DCBMRWRQ EQU   DCBMRRD                                                  03910000
DCBMRPTQ EQU   DCBMRGET                                                 03911000
DCBMRECP EQU   DCBMACR1                                                 03912000
@NM00310 EQU   DCBIFLG                                                  03913000
DCBIBIOE EQU   DCBIFLG                                                  03914000
DCBICH12 EQU   DCBIBPCT                                                 03915000
DCBICH9  EQU   DCBIBPCT                                                 03916000
DCBIBEC  EQU   DCBIFLG                                                  03917000
DCBOFIOF EQU   DCBOFLGS                                                 03918000
DCBOFUEX EQU   DCBOFLGS                                                 03919000
DCBOFTM  EQU   DCBOFLGS                                                 03920000
DCBOFPPC EQU   DCBOFLGS                                                 03921000
DCBOFEOV EQU   DCBOFLGS                                                 03922000
DCBOFLRB EQU   DCBOFLGS                                                 03923000
DCBOFIOD EQU   DCBOFLWR                                                 03924000
DCBDDNAM EQU   IHADCS24                                                 03925000
DCBEXLSA EQU   DCBEXLST+1                                               03926000
DCBRECKL EQU   DCBRECFM                                                 03927000
DCBRECCC EQU   DCBRECFM                                                 03928000
DCBRECSB EQU   DCBRECFM                                                 03929000
DCBRECBR EQU   DCBRECFM                                                 03930000
DCBRECTO EQU   DCBRECLA                                                 03931000
DCBRECL  EQU   DCBRECLA                                                 03932000
DCBEODA  EQU   DCBEODAD+1                                               03933000
DCBBFA   EQU   DCBBFTEK                                                 03934000
DCBH0    EQU   DCBBFTEK                                                 03935000
DCBBFTKD EQU   DCBBFTEK                                                 03936000
DCBBFTE  EQU   DCBBFT                                                   03937000
DCBBFTKR EQU   DCBBFT                                                   03938000
DCBBFTS  EQU   DCBBFT                                                   03939000
DCBH1    EQU   DCBBFTEK                                                 03940000
DCBSVCXA EQU   DCBSVCXL+1                                               03941000
@NM00309 EQU   DCBSVCXL                                                 03942000
DCBODEBA EQU   DCBIOBAA                                                 03943000
@NM00308 EQU   DCBQSLM                                                  03944000
DCBUPDBT EQU   DCBQSLM                                                  03945000
DCBUPDCM EQU   DCBQSLM                                                  03946000
DCB1DVDS EQU   DCBQSLM                                                  03947000
@NM00307 EQU   DCBDSRG2                                                 03948000
DCBDSGTR EQU   DCBDSRG2                                                 03949000
DCBACBM  EQU   DCBDSRG2                                                 03950000
@NM00306 EQU   DCBDSRG2                                                 03951000
DCBDSGTQ EQU   DCBDSRG2                                                 03952000
DCBDSGTX EQU   DCBDSRG2                                                 03953000
DCBDSGGS EQU   DCBDSRG2                                                 03954000
DCBDSGU  EQU   DCBDSRG1                                                 03955000
DCBDSGPO EQU   DCBDSRG1                                                 03956000
@NM00305 EQU   DCBDSRG1                                                 03957000
@NM00304 EQU   DCBDSRG1                                                 03958000
DCBDSGCX EQU   DCBDSRG1                                                 03959000
DCBDSGDA EQU   DCBDSRG1                                                 03960000
DCBDSGPS EQU   DCBDSRG1                                                 03961000
DCBDSGIS EQU   DCBDSRG1                                                 03962000
DCBBUFL  EQU   IHADCS11+8                                               03963000
DCBBUFCA EQU   DCBBUFCB+1                                               03964000
DCBBUFNO EQU   DCBBUFCB                                                 03965000
DCBDEVT  EQU   DCBREL                                                   03966000
DCBKEYLE EQU   DCBRELB                                                  03967000
@NM00303 EQU   IHADCB                                                   03968000
@NM00302 EQU   CIBNAME+13                                               03969000
CIBCONID EQU   CIBNAME+12                                               03970000
CIBTJID  EQU   CIBASID                                                  03971000
@NM00301 EQU   CIBNAME+6                                                03972000
CIBLEN   EQU   CIBNAME+5                                                03973000
CIBVERB  EQU   CIBNAME+4                                                03974000
CIBNEXT  EQU   CIBNAME                                                  03975000
CHARSV16 EQU   CHSHORT+100                                              03976000
CHARSV15 EQU   CHSHORT+96                                               03977000
CHJSCBVS EQU   CHSHORT+92                                               03978000
CHUSCVS  EQU   CHSHORT+88                                               03979000
@NM00299 EQU   CHSHORT+84                                               03980000
@NM00298 EQU   CHSHORT+80                                               03981000
CHSQA    EQU   CHSHORT+44                                               03982000
CHQPA    EQU   CHSHORT+8                                                03983000
CHJCL    EQU   CHSHORT+4                                                03984000
CHSPC    EQU   CHSHORT                                                  03985000
CHSPB    EQU   CHSTEP+4                                                 03986000
CHTCB    EQU   CHSTEP+1                                                 03987000
CHARSV23 EQU   CHSWT                                                    03988000
CHARSV22 EQU   CHSWT                                                    03989000
CHARSV21 EQU   CHSWT                                                    03990000
CHAC     EQU   CHSWT                                                    03991000
CHPSF    EQU   CHSWT                                                    03992000
CHPSD    EQU   CHSWT                                                    03993000
CHJCT    EQU   CHSWT                                                    03994000
CHARSV20 EQU   CHSWT                                                    03995000
CHCECB   EQU   CHASM+20                                                 03996000
CHECB    EQU   CHASM+16                                                 03997000
CHRGNAD  EQU   CHASM+12                                                 03998000
CHARSV18 EQU   CHRGNSZ+1                                                03999000
CHRPRTY  EQU   CHRGNSZ                                                  04000000
@NM00297 EQU   CHCIBP                                                   04001000
CHEND    EQU   CHCIBP                                                   04002000
CHECBP   EQU   CHASM                                                    04003000
CHDER    EQU   CHPROCSN+4                                               04004000
CHARSV10 EQU   CHACT1                                                   04005000
CHARSV09 EQU   CHACT1                                                   04006000
CHARSV08 EQU   CHACT1                                                   04007000
CHARSV07 EQU   CHACT1                                                   04008000
CHARSV06 EQU   CHACT1                                                   04009000
CHARSV05 EQU   CHACT1                                                   04010000
CHARSV04 EQU   CHACT1                                                   04011000
CHRDWTR  EQU   CHACT1                                                   04012000
CHARSV30 EQU   CHPROCSN+2                                               04013000
CHQID    EQU   CHPROCSN                                                 04014000
CHASID   EQU   CHTJID                                                   04015000
CHUCMP   EQU   CHAIN+29                                                 04016000
CHTRKID  EQU   CHPKE                                                    04017000
CHCIBCTR EQU   CHAIN+27                                                 04018000
CHUNIT   EQU   CHAIN+24                                                 04019000
CHCLS    EQU   CHAIN+16                                                 04020000
CHPCOI   EQU   CHPARM                                                   04021000
CHIFY    EQU   CHACT                                                    04022000
CHAIFX   EQU   CHACT                                                    04023000
CHCLD    EQU   CHACT                                                    04024000
CHCL     EQU   CHACT                                                    04025000
CHDSI    EQU   CHACT                                                    04026000
CHDISC   EQU   CHACT                                                    04027000
CHTERM   EQU   CHACT                                                    04028000
CHSWAP   EQU   CHACT                                                    04029000
CHABTERM EQU   CHSTS                                                    04030000
CHFC     EQU   CHSTS                                                    04031000
CHDL     EQU   CHSTS                                                    04032000
CHAD     EQU   CHSTS                                                    04033000
CHQSPC   EQU   CHSTS                                                    04034000
CHSOUT   EQU   CHSTS                                                    04035000
CHSYS    EQU   CHSTS                                                    04036000
CHAP     EQU   CHSTS                                                    04037000
CHSZE    EQU   CHFLG+1                                                  04038000
CHVCD    EQU   CHFLG                                                    04039000
CHPTR    EQU   CHAIN                                                    04040000
@NM00296 EQU   TBLFLAG                                                  04041000
@NM00295 EQU   SCANTBL+10                                               04042000
@NM00294 EQU   TBLNAME+1                                                04043000
@NM00088 EQU   RSTDNAME+1                                               04044000
@NM00043 EQU   SAVAREA+1                                                04045000
@NM00010 EQU   MLPMPML+2                                                04046000
MLPMERR  EQU   MLPMFL2                                                  04047000
@NM00009 EQU   MLPMFL2                                                  04048000
MLPMSTRT EQU   MLPMFL1                                                  04049000
@NM00008 EQU   MLPMFL1                                                  04050000
MSGLNGTH EQU   @NM00007                                                 04051000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04052000
@RC00169 EQU   @EL00002                                                 04053000
@RT00203 EQU   @EL00003                                                 04054000
@RC00270 EQU   @EL00003                                                 04055000
@RF00269 EQU   @EL00003                                                 04056000
@RT00281 EQU   @EL00004                                                 04057000
@RF00285 EQU   @EL00004                                                 04058000
@RT00296 EQU   @EL00005                                                 04059000
@RT00348 EQU   SYNAD                                                    04060000
@RC00428 EQU   @RC00426                                                 04061000
@RF00416 EQU   @EL00005                                                 04062000
@RF00475 EQU   @EL00007                                                 04063000
@RT00491 EQU   @EL00008                                                 04064000
@RT00551 EQU   @EL00009                                                 04065000
@RC00658 EQU   @EL00011                                                 04066000
@RT00683 EQU   @EL00012                                                 04067000
@RF00686 EQU   @EL00012                                                 04068000
@RF00716 EQU   @EL00013                                                 04069000
@RT00745 EQU   @EL00014                                                 04070000
@RC00723 EQU   @EL00014                                                 04071000
@RF00777 EQU   @EL00014                                                 04072000
@RF00793 EQU   @EL00015                                                 04073000
@RF00804 EQU   @EL00016                                                 04074000
@RC00849 EQU   @EL00017                                                 04075000
@RC00173 EQU   @RC00169                                                 04076000
@ENDDATA EQU   *                                                        04077000
         END   IKTCAS54,(C'PLS1042',0702,79040)                         04078000
