         TITLE '*** IKTCASCX: RELEASE/PASS ASYNCHRONOUS EXIT ***'       00001000
IKTCASCX CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'IKTCASCX  79.137'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                            01S0001 00009000
@PSTART  DS    0H                                               01S0001 00010000
         USING @PSTART,@12                                      01S0001 00011000
         ST    @13,@SA00001+4                                   01S0001 00012000
         LA    @11,@SA00001                                     01S0001 00013000
         LR    @13,@11                                          01S0001 00014000
         PRINT OFF                                                      00015000
         PRINT ON                                                       00016000
*                                                               01S0130 00017000
*/********************************************************************/ 00018000
*/*                                                                  */ 00019000
*/* SEGMENT-                                                         */ 00020000
*/*      IKTCASCX                                                    */ 00021000
*/*                                                                  */ 00022000
*/* FUNCTION-                                                        */ 00023000
*/*      MAINLINE CODE.                                              */ 00024000
*/*                                                                  */ 00025000
*/********************************************************************/ 00026000
*                                                               01S0130 00027000
*   DO;                             /* BLOCK MAIN START OF MAIN BLOCK   00028000
*                                                            @ZA35513*/ 00029000
*     RPLREG=REG1;                  /* INSERT ADDRESS OF RPL INTO       00030000
*                                      BASE REGISTER                 */ 00031000
         LR    RPLREG,REG1                                      01S0131 00032000
*     IF RPLNIB='1'B THEN           /* DETERMINE BASE ADDRESS FOR NIB*/ 00033000
         TM    RPLNIB(RPLREG),B'00000100'                       01S0132 00034000
         BNO   @RF00132                                         01S0132 00035000
*       NIBREG=RPLARG;              /* LOAD ADDRESS OF NIB           */ 00036000
         L     NIBREG,RPLARG(,RPLREG)                           01S0133 00037000
*     ELSE                                                      01S0134 00038000
*       NIBREG=RPLAREA;             /* LOAD ADDRESS OF NIB           */ 00039000
         B     @RC00132                                         01S0134 00040000
@RF00132 L     NIBREG,RPLAREA(,RPLREG)                          01S0134 00041000
*     SAVREG14=REG14;               /* SAVE RETURN ADDRESS           */ 00042000
@RC00132 LR    SAVREG14,REG14                                   01S0135 00043000
*     RFY                                                       01S0136 00044000
*       REG14 UNRSTD;               /* UNRESTRICT REGISTER 14        */ 00045000
*     GENERATE CODE REFS(RPLREG);                               01S0137 00046000
*                                   /* CHECK FOR CLSDST COMPLETION   */ 00047000
         CHECK RPL=(RPLREG)                                             00048000
*     RFY                                                       01S0138 00049000
*       RETCODE RSTD;                                           01S0138 00050000
*     DO WHILE RETCODE^=0;          /* CHECK RETURN CODE             */ 00051000
         B     @DE00139                                         01S0139 00052000
@DL00139 DS    0H                                               01S0140 00053000
*       WSMACRTC=RETCODE;           /* SAVE RETURN CODE              */ 00054000
         STC   RETCODE,WSMACRTC(,RPLREG)                        01S0140 00055000
*       WSMACRSC=REG0;              /* SAVE REASON CODE              */ 00056000
         STC   REG0,WSMACRSC(,RPLREG)                           01S0141 00057000
*       IF RETCODE=4&REG0=8 THEN    /* CHECK FOR RETRYABLE ERROR     */ 00058000
         C     RETCODE,@CF00043                                 01S0142 00059000
         BNE   @RF00142                                         01S0142 00060000
         C     REG0,@CF00035                                    01S0142 00061000
         BNE   @RF00142                                         01S0142 00062000
*         DO;                                                   01S0143 00063000
*           WSRETRY=WSRETRY+1;      /* INCREMENT COUNTER             */ 00064000
         LA    @14,1                                            01S0144 00065000
         SLR   @10,@10                                          01S0144 00066000
         IC    @10,WSRETRY(,RPLREG)                             01S0144 00067000
         ALR   @14,@10                                          01S0144 00068000
         STC   @14,WSRETRY(,RPLREG)                             01S0144 00069000
*           IF WSRETRY>RETRYMAX THEN                            01S0145 00070000
         CLI   WSRETRY(RPLREG),10                               01S0145 00071000
         BNH   @RF00145                                         01S0145 00072000
*             DO;                                               01S0146 00073000
*               IF WSCLSPAS='1'B THEN/* CHECK FOR CLSDST PASS        */ 00074000
         TM    WSCLSPAS(RPLREG),B'00010000'                     01S0147 00075000
         BNO   @RF00147                                         01S0147 00076000
*                 CALL POSTECB;     /* POST TCAS-USER ECB    @ZA35513*/ 00077000
         BAL   @14,POSTECB                                      01S0148 00078000
*               ELSE                /* CLSDST RELEASE PROBLEM        */ 00079000
*                 CALL FREENTRY;    /* FREE THE RPL ENTRY SPACE 01S0149 00080000
*                                                            @ZA35513*/ 00081000
         B     @RC00147                                         01S0149 00082000
@RF00147 BAL   @14,FREENTRY                                     01S0149 00083000
*/*            LEAVE(MAIN)                                           */ 00084000
*                                                               01S0150 00085000
*               GOTO #BCM0005;      /* EXIT, NO MORE RETRIES @ZA35513*/ 00086000
         B     #BCM0005                                         01S0150 00087000
*             END;                                              01S0151 00088000
*           ELSE                    /* ERROR RETRYABLE               */ 00089000
*             DO;                                               01S0152 00090000
@RF00145 DS    0H                                               01S0153 00091000
*               WSRETRYB='1'B;      /* TURN ON RETRY BIT INDICATOR   */ 00092000
         OI    WSRETRYB(RPLREG),B'00001000'                     01S0153 00093000
*               GENERATE CODE;                                  01S0154 00094000
*                                                               01S0154 00095000
         EXECRPL RPL=(RPLREG)                                           00096000
*/*            LEAVE(MAIN) ON(RETCODE=0)                             */ 00097000
*                                                               01S0155 00098000
*               IF(RETCODE=0) THEN                              01S0155 00099000
         LTR   RETCODE,RETCODE                                  01S0155 00100000
         BZ    @RT00155                                         01S0155 00101000
*                 GOTO #BCM0005;    /* CHECK FOR GOOD EXECRPL RETURN    00102000
*                                      CODE                  @ZA35513*/ 00103000
*             END;                                              01S0157 00104000
*         END;                                                  01S0158 00105000
*       ELSE                        /* RETURN CODE IS NOT RETRYABLE  */ 00106000
*         DO;                                                   01S0159 00107000
         B     @RC00142                                         01S0159 00108000
@RF00142 DS    0H                                               01S0160 00109000
*           IF WSCLSPAS='1'B THEN   /* CHECK FOR CLSDST PASS         */ 00110000
         TM    WSCLSPAS(RPLREG),B'00010000'                     01S0160 00111000
         BNO   @RF00160                                         01S0160 00112000
*             DO;                                               01S0161 00113000
*               CALL POSTECB;       /* POST TCAS-USER ECB    @ZA35513*/ 00114000
         BAL   @14,POSTECB                                      01S0162 00115000
*/*            LEAVE(MAIN)                                           */ 00116000
*                                                               01S0163 00117000
*               GOTO #BCM0005;      /* EXIT, NOT RETRYABLE   @ZA35513*/ 00118000
         B     #BCM0005                                         01S0163 00119000
*             END;                                              01S0164 00120000
*           ELSE                    /* CLSDST RELEASE AND UNRETRYABLE*/ 00121000
*             DO;                                               01S0165 00122000
@RF00160 DS    0H                                               01S0166 00123000
*               CALL SENDMSG;       /* SEND MESSAGE IKT019I TO  01S0166 00124000
*                                      OPERATOR              @ZA35513*/ 00125000
         BAL   @14,SENDMSG                                      01S0166 00126000
*               RETCODE=0;          /* STOP RECURSION        @YM03252*/ 00127000
         SLR   RETCODE,RETCODE                                  01S0167 00128000
*             END;                                              01S0168 00129000
*         END;                                                  01S0169 00130000
*     END;                          /* END OF LOOP                   */ 00131000
@RC00142 DS    0H                                               01S0170 00132000
@DE00139 LTR   RETCODE,RETCODE                                  01S0170 00133000
         BNZ   @DL00139                                         01S0170 00134000
*     CALL FREENTRY;                /* FREE RPL ENTRY        @ZA35513*/ 00135000
         BAL   @14,FREENTRY                                     01S0171 00136000
*   END;                            /* END(MAIN)                     */ 00137000
*#BCM0005:                                                      01S0173 00138000
*   ;                               /* END OF MAIN BLOCK     @ZA35513*/ 00139000
*                                                               01S0173 00140000
#BCM0005 DS    0H                                               01S0174 00141000
*   /*****************************************************************/ 00142000
*   /*                                                               */ 00143000
*   /* THIS CODE IS ENTERED FROM ANY LEAVE(MAIN) MACRO INSTRUCTION.  */ 00144000
*   /*                                                               */ 00145000
*   /*****************************************************************/ 00146000
*                                                               01S0174 00147000
*   RFY                                                         01S0174 00148000
*     REG14 RSTD;                   /* RESTRICT RETURN REGISTER      */ 00149000
*   REG14=SAVREG14;                 /* RESTORE RETURN ADDRESS        */ 00150000
         LR    REG14,SAVREG14                                   01S0175 00151000
*   RFY                                                         01S0176 00152000
*     REG14 UNRSTD;                 /* UNRESTRICT RETURN REGISTER    */ 00153000
*   RETURN;                         /* RETURN TO VTAM                */ 00154000
@EL00001 L     @13,4(,@13)                                      01S0177 00155000
@EF00001 DS    0H                                               01S0177 00156000
@ER00001 BR    @14                                              01S0177 00157000
         EJECT                                                          00158000
*                                                               01S0178 00159000
*/********************************************************************/ 00160000
*/*                                                                  */ 00161000
*/* SUBROUTINE-                                                      */ 00162000
*/*      TERMREL                                                     */ 00163000
*/*                                                                  */ 00164000
*/* FUNCTION-                                                        */ 00165000
*/*      RELEASE TERMINAL                                            */ 00166000
*/*      ISSUE ERROR MESSAGE IKT019I IF NECESSARY                    */ 00167000
*/*                                                                  */ 00168000
*/********************************************************************/ 00169000
*                                                               01S0178 00170000
*TERMREL:                                                       01S0178 00171000
*   PROC OPTIONS(SAVE(14));         /* START OF TERMREL      @ZA35513*/ 00172000
TERMREL  ST    @14,@SA00002                                     01S0178 00173000
*   WSRETRYB='1'B;                  /* TURN ON RETRY BIT     @YM03230*/ 00174000
         OI    WSRETRYB(RPLREG),B'00001000'                     01S0179 00175000
*/********************************************************************/ 00176000
*/*              CHECK CONDITIONS OF RPL                             */ 00177000
*/********************************************************************/ 00178000
*                                                               01S0180 00179000
*   IF RPLRTNCD=16&RPLFDB2=10 THEN  /* CHECK FOR ERROR IN VTAM       */ 00180000
         CLI   RPLRTNCD(RPLREG),16                              01S0180 00181000
         BNE   @RF00180                                         01S0180 00182000
         CLI   RPLFDB2(RPLREG),10                               01S0180 00183000
         BNE   @RF00180                                         01S0180 00184000
*     DO;                                                       01S0181 00185000
*       CALL SENDMSG;               /* SEND MESSAGE IKT019I TO THE      00186000
*                                      OPERATOR              @ZA35513*/ 00187000
         BAL   @14,SENDMSG                                      01S0182 00188000
*       WSRETRYB='0'B;              /* TURN OFF RETRY INDICATOR 01S0183 00189000
*                                                            @YM03230*/ 00190000
         NI    WSRETRYB(RPLREG),B'11110111'                     01S0183 00191000
*     END;                                                      01S0184 00192000
*   ELSE                            /* NOT VTAM DISABLED ERROR       */ 00193000
*     DO;                                                       01S0185 00194000
         B     @RC00180                                         01S0185 00195000
@RF00180 DS    0H                                               01S0186 00196000
*       RPLECB=ADDR(IKTCASCX);      /* LOAD THE ADDRESS OF CLSDST       00197000
*                                      ROUTINE                       */ 00198000
         L     @14,@CA00028                                     01S0186 00199000
         ST    @14,RPLECB(,RPLREG)                              01S0186 00200000
*       WSCLSREL='1'B;              /* TURN CLSDST RELEASE INDICATOR */ 00201000
*       WSCLSPAS='0'B;              /* TURN CLSDST PASS INDICATOR OFF*/ 00202000
         OI    WSCLSREL(RPLREG),B'00100000'                     01S0188 00203000
         NI    WSCLSPAS(RPLREG),B'11101111'                     01S0188 00204000
*       WSRETRY=0;                  /* INITIALIZE RETRY ERROR        */ 00205000
         MVI   WSRETRY(RPLREG),X'00'                            01S0189 00206000
*       GENERATE CODE;                                          01S0190 00207000
         CLSDST RPL=(RPLREG),                                          *00208000
               OPTCD=(ASY,RELEASE)                                      00209000
*       RFY                                                     01S0191 00210000
*         RETCODE RSTD;             /* RESTRICT RETURN CODE REGISTER */ 00211000
*       DO WHILE RETCODE^=0;        /* TEST RETURN CODE              */ 00212000
         B     @DE00192                                         01S0192 00213000
@DL00192 DS    0H                                               01S0193 00214000
*         WSMACRTC=RETCODE;         /* SAVE RETURN CODE              */ 00215000
         STC   RETCODE,WSMACRTC(,RPLREG)                        01S0193 00216000
*         WSMACRSC=REG0;            /* SAVE REASON CODE              */ 00217000
         STC   REG0,WSMACRSC(,RPLREG)                           01S0194 00218000
*         IF RETCODE=4&REG0=8 THEN  /* CHECK FOR RETRYABLE ERROR     */ 00219000
         C     RETCODE,@CF00043                                 01S0195 00220000
         BNE   @RF00195                                         01S0195 00221000
         C     REG0,@CF00035                                    01S0195 00222000
         BNE   @RF00195                                         01S0195 00223000
*           DO;                                                 01S0196 00224000
*             WSRETRY=WSRETRY+1;    /* INCREMENT COUNTER             */ 00225000
         LA    @14,1                                            01S0197 00226000
         SLR   @10,@10                                          01S0197 00227000
         IC    @10,WSRETRY(,RPLREG)                             01S0197 00228000
         ALR   @14,@10                                          01S0197 00229000
         STC   @14,WSRETRY(,RPLREG)                             01S0197 00230000
*             IF WSRETRY>RETRYMAX THEN/* CHECK FOR RETRY MAXIMUM        00231000
*                                      EXCEEDED                      */ 00232000
         CLI   WSRETRY(RPLREG),10                               01S0198 00233000
         BNH   @RF00198                                         01S0198 00234000
*               DO;                                             01S0199 00235000
*                 CALL SENDMSG;     /* SEND MESSAGE IKT019I TO THE      00236000
*                                      OPERATOR              @ZA35513*/ 00237000
         BAL   @14,SENDMSG                                      01S0200 00238000
*                 RETCODE=0;        /* STOP RECURSION                */ 00239000
         SLR   RETCODE,RETCODE                                  01S0201 00240000
*                 WSRETRYB='0'B;    /* TURN OFF RETRY INDICATOR 01S0202 00241000
*                                                            @YM03230*/ 00242000
         NI    WSRETRYB(RPLREG),B'11110111'                     01S0202 00243000
*               END;                                            01S0203 00244000
*             ELSE                  /* RETRY MAXIMUM NOT EXCEEDED    */ 00245000
*               DO;                                             01S0204 00246000
         B     @RC00198                                         01S0204 00247000
@RF00198 DS    0H                                               01S0205 00248000
*                 GENERATE CODE;                                01S0205 00249000
         EXECRPL RPL=(RPLREG)                                           00250000
*               END;                                            01S0206 00251000
*           END;                                                01S0207 00252000
*         ELSE                      /* NON RETRYABLE ERROR CODE      */ 00253000
*           DO;                                                 01S0208 00254000
         B     @RC00195                                         01S0208 00255000
@RF00195 DS    0H                                               01S0209 00256000
*             CALL SENDMSG;         /* SEND MESSAGE IKT019I TO THE      00257000
*                                      OPERATOR              @ZA35513*/ 00258000
         BAL   @14,SENDMSG                                      01S0209 00259000
*             RETCODE=0;            /* STOP RECURSION                */ 00260000
         SLR   RETCODE,RETCODE                                  01S0210 00261000
*             WSRETRYB='0'B;        /* TURN OFF RETRY INDICATOR 01S0211 00262000
*                                                            @YM03230*/ 00263000
         NI    WSRETRYB(RPLREG),B'11110111'                     01S0211 00264000
*           END;                                                01S0212 00265000
*       END;                        /* END OF LOOP                   */ 00266000
@RC00195 DS    0H                                               01S0213 00267000
@DE00192 LTR   RETCODE,RETCODE                                  01S0213 00268000
         BNZ   @DL00192                                         01S0213 00269000
*     END;                                                      01S0214 00270000
*   IF WSRETRYB='0'B THEN           /* NO MORE RETRIES       @ZA35513*/ 00271000
@RC00180 TM    WSRETRYB(RPLREG),B'00001000'                     01S0215 00272000
         BNZ   @RF00215                                         01S0215 00273000
*     CALL FREENTRY;                /* FREE RPL AND WORK ELEMENT        00274000
*                                                            @ZA35513*/ 00275000
         BAL   @14,FREENTRY                                     01S0216 00276000
*   END TERMREL;                    /* END OF SUBROUTINE     @ZA35513*/ 00277000
@EL00002 DS    0H                                               01S0217 00278000
@EF00002 DS    0H                                               01S0217 00279000
@ER00002 L     @14,@SA00002                                     01S0217 00280000
         BR    @14                                              01S0217 00281000
*/********************************************************************/ 00282000
*/* END OF SUBROUTINE                                                */ 00283000
*/********************************************************************/ 00284000
*                                                               01S0218 00285000
         EJECT                                                          00286000
*                                                               01S0218 00287000
*/********************************************************************/ 00288000
*/*                                                                  */ 00289000
*/* SUBROUTINE-                                                      */ 00290000
*/*      POSTECB                                                     */ 00291000
*/*                                                                  */ 00292000
*/* FUNCTION-                                                        */ 00293000
*/*      POST TCAS USER ECB                                          */ 00294000
*/*      CALL TERMREL TO RELEASE TERMINAL                            */ 00295000
*/*                                                                  */ 00296000
*/********************************************************************/ 00297000
*                                                               01S0218 00298000
*POSTECB:                                                       01S0218 00299000
*   PROC OPTIONS(SAVE(14));         /* START OF SUBROUTINE   @ZA35513*/ 00300000
POSTECB  ST    @14,@SA00003                                     01S0218 00301000
*   RFY                                                         01S0219 00302000
*     WESTD BASED(EVAL(RPLREG-LENGTH(WESTD)));/* BASE WORK ELEMENT ON   00303000
*                                      RPL                           */ 00304000
*   RFY                                                         01S0220 00305000
*    (REG3,                                                     01S0220 00306000
*     REG4,                                                     01S0220 00307000
*     REG5) RSTD;                   /* RESTRICT WORK REGISTERS       */ 00308000
*   REG3=WEUASCB;                   /* LOAD THE ADDRESS OF THE USER S   00309000
*                                      ASCB                          */ 00310000
         LA    @14,76                                           01S0221 00311000
         LR    @10,RPLREG                                       01S0221 00312000
         SLR   @10,@14                                          01S0221 00313000
         L     REG3,WEUASCB(,@10)                               01S0221 00314000
*   REG4=WEUECB;                    /* LOAD THE ADDRESS OF THE USER S   00315000
*                                      ECB                           */ 00316000
         LCR   @14,@14                                          01S0222 00317000
         ALR   @14,RPLREG                                       01S0222 00318000
         L     REG4,WEUECB(,@14)                                01S0222 00319000
*   REG5=ADDR(TCASBR14);            /* LOAD THE ADDRESS OF A BR 14      00320000
*                                      INSTRUCTION FOR TROUTINE      */ 00321000
         L     @14,CVTPTR                                       01S0223 00322000
         L     REG5,TCASTPTR(,@14)                              01S0223 00323000
         LA    REG5,TCASBR14(,REG5)                             01S0223 00324000
*   GENERATE CODE;                                              01S0224 00325000
         POST (REG4),,ASCB=(REG3),ERRET=(REG5),                        *00326000
               RELATED=('KILL USER ADDRESS SPACE ')                     00327000
*   RFY                                                         01S0225 00328000
*    (REG3,                                                     01S0225 00329000
*     REG4,                                                     01S0225 00330000
*     REG5) UNRSTD;                 /* UNRESTRICT WORK REGISTERS     */ 00331000
*   WSCLSPAS='0'B;                  /* TURN OFF THE CLSDST PASS 01S0226 00332000
*                                      INDICATOR                     */ 00333000
         NI    WSCLSPAS(RPLREG),B'11101111'                     01S0226 00334000
*   CALL TERMREL;                   /* RELEASE THE TERMINAL          */ 00335000
         BAL   @14,TERMREL                                      01S0227 00336000
*   END POSTECB;                    /* END OF SUBROUTINE     @ZA35513*/ 00337000
@EL00003 DS    0H                                               01S0228 00338000
@EF00003 DS    0H                                               01S0228 00339000
@ER00003 L     @14,@SA00003                                     01S0228 00340000
         BR    @14                                              01S0228 00341000
*/********************************************************************/ 00342000
*/* END OF SUBROUTINE                                                */ 00343000
*/********************************************************************/ 00344000
*                                                               01S0229 00345000
         EJECT                                                          00346000
*                                                               01S0229 00347000
*/********************************************************************/ 00348000
*/*                                                                  */ 00349000
*/* SUBROUTINE-                                                      */ 00350000
*/*      FREENTRY                                                    */ 00351000
*/*                                                                  */ 00352000
*/* FUNCTION-                                                        */ 00353000
*/*      FREE WORK ELEMENT AND RPL STORAGE                           */ 00354000
*/*                                                                  */ 00355000
*/********************************************************************/ 00356000
*                                                               01S0229 00357000
*FREENTRY:                                                      01S0229 00358000
*   PROC OPTIONS(SAVE(14));         /* START OF SUBROUTINE   @ZA35513*/ 00359000
FREENTRY ST    @14,@SA00004                                     01S0229 00360000
*   REG0=WSSIZE|'02000000'X;        /* STORE AREA SIZE AND SUBPOOL ID*/ 00361000
         L     REG0,WSSIZE(,RPLREG)                             01S0230 00362000
         O     REG0,@CF01889                                    01S0230 00363000
*   REG1=RPLREG-LENGTH(WESTD);      /* COMPUTE STARTING ADDRESS      */ 00364000
         LR    REG1,RPLREG                                      01S0231 00365000
         SL    REG1,@CF01898                                    01S0231 00366000
*   GENERATE CODE;                                              01S0232 00367000
         FREEMAIN R,LV=(0),A=(1)                                        00368000
*   END FREENTRY;                   /* END OF SUBROUTINE     @ZA35513*/ 00369000
@EL00004 DS    0H                                               01S0233 00370000
@EF00004 DS    0H                                               01S0233 00371000
@ER00004 L     @14,@SA00004                                     01S0233 00372000
         BR    @14                                              01S0233 00373000
*/********************************************************************/ 00374000
*/* END OF SUBROUTINE                                                */ 00375000
*/********************************************************************/ 00376000
*                                                               01S0234 00377000
         EJECT                                                          00378000
*                                                               01S0234 00379000
*/********************************************************************/ 00380000
*/*                                                                  */ 00381000
*/* SUBROUTINE-                                                      */ 00382000
*/*      SENDMSG                                                     */ 00383000
*/*                                                                  */ 00384000
*/* FUNCTION-                                                        */ 00385000
*/*      SET UP MESSAGE IKT019I WITH RPLRTNCD AND RPLFDB2 AND SEND   */ 00386000
*/*      TO THE OPERATOR                                             */ 00387000
*/*                                                          @ZA35513*/ 00388000
*/********************************************************************/ 00389000
*                                                               01S0234 00390000
*SENDMSG:                                                       01S0234 00391000
*   PROC OPTIONS(SAVE(14));         /* START OF SUBROUTINE   @ZA35513*/ 00392000
SENDMSG  ST    @14,@SA00005                                     01S0234 00393000
*   REG1=IKT019I;                   /* INSERT MESSAGE INDEX VALUE       00394000
*                                                            @ZA35513*/ 00395000
         LA    REG1,19                                          01S0235 00396000
*   CALL IKTCAS56;                  /* GET MSG DSECT         @ZA35513*/ 00397000
         L     @10,CVTPTR                                       01S0236 00398000
         L     @10,TCASTPTR(,@10)                               01S0236 00399000
         L     @10,TWAPTR(,@10)                                 01S0236 00400000
         L     @15,TWAMSG(,@10)                                 01S0236 00401000
         BALR  @14,@15                                          01S0236 00402000
*   RFY                                                         01S0237 00403000
*     MSGENTRY BASED(REG1);         /* ADDRESS MESSAGE TEXT  @ZA35513*/ 00404000
*   MACTERM=NIBSYM;                 /* INSERT TERMINAL ID    @ZA35513*/ 00405000
         MVC   MACTERM(8,REG1),NIBSYM(NIBREG)                   01S0238 00406000
*   UNPK(REASON(3:7),REASNRPL);     /* UNPACK RPLRTNCD,RPLFDBK  01S0239 00407000
*                                                            @ZA38162*/ 00408000
         UNPK  REASON+2(5,REG1),REASNRPL(3,RPLREG)              01S0239 00409000
*   UNPK(SENSE,SENSERPL);           /* UNPACK SYSTEM AND USER SENSE     00410000
*                                                            @ZA38162*/ 00411000
         UNPK  SENSE(9,REG1),SENSERPL(5,RPLREG)                 01S0240 00412000
*   REASON(3:6)=REASON(3:6)&&ZEROS; /* ZERO OUT HIGH ORDER NIBBLE       00413000
*                                                            @ZA38162*/ 00414000
         XC    REASON+2(4,REG1),@CC01829                        01S0241 00415000
*   SENSE(1:8)=SENSE(1:8)&&ZEROS;   /* ZERO OUT HIGH ORDER NIBBLE       00416000
*                                                            @ZA38162*/ 00417000
         XC    SENSE(8,REG1),@CC01829                           01S0242 00418000
*   TR(REASON(3:6),TRANTAB);        /* CONVERT TO PRINTABLE     01S0243 00419000
*                                      CHARACTERS            @ZA38162*/ 00420000
         TR    REASON+2(4,REG1),TRANTAB                         01S0243 00421000
*   TR(SENSE(1:8),TRANTAB);         /* CONVERT TO PRINTABLE     01S0244 00422000
*                                      CHARACTERS            @ZA38162*/ 00423000
         TR    SENSE(8,REG1),TRANTAB                            01S0244 00424000
*   REASON(7)='';                   /* INSERT BLANK IN LAST POSITION    00425000
*                                                            @ZA35513*/ 00426000
         MVI   REASON+6(REG1),C' '                              01S0245 00427000
*   SENSE(9)='';                    /* INSERT BLANK IN LAST POSITION    00428000
*                                                            @ZA38162*/ 00429000
         MVI   SENSE+8(REG1),C' '                               01S0246 00430000
*   REASON(1:2)='01';               /* INSERT REASON CODE INTO  01S0247 00431000
*                                      MESSAGE (CLSDST FAILED)  01S0247 00432000
*                                                            @ZA35513*/ 00433000
         MVC   REASON(2,REG1),@CC01897                          01S0247 00434000
*   RFY                                                         01S0248 00435000
*     REG7 RSTD;                    /* RESTRICT WORK REGISTER   01S0248 00436000
*                                                            @ZA35513*/ 00437000
*   REG7=ADDR(MSGLIST);             /* LOAD ADDRESS OF LIST FORM OF     00438000
*                                      WTO                   @ZA35513*/ 00439000
         LA    REG7,MSGLIST(,REG1)                              01S0249 00440000
*   GENERATE CODE( WTO DESC=3,MF=(E,(7)));/* ISSUE MESSAGE   @ZA35513*/ 00441000
          WTO DESC=3,MF=(E,(7))                                         00442000
*   RFY                                                         01S0251 00443000
*     REG7 UNRSTD;                  /* FREE UP WORK REGISTER @ZA35513*/ 00444000
*   END SENDMSG;                    /* END OF SUBROUTINE             */ 00445000
@EL00005 DS    0H                                               01S0252 00446000
@EF00005 DS    0H                                               01S0252 00447000
@ER00005 L     @14,@SA00005                                     01S0252 00448000
         BR    @14                                              01S0252 00449000
*/********************************************************************/ 00450000
*/* END OF SUBROUTINE                                                */ 00451000
*/********************************************************************/ 00452000
*                                                               01S0253 00453000
*   END IKTCASCX                    /* END OF MODULE                 */ 00454000
*                                                               01S0253 00455000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00456000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00457000
*/*%INCLUDE SYSUT5  (IKTCASCX)                                       */ 00458000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00459000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00460000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 00461000
*/*%INCLUDE SYSLIB  (IKTCASWA)                                       */ 00462000
*/*%INCLUDE SYSLIB  (IKTWESTD)                                       */ 00463000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00464000
*/*%INCLUDE SYSLIB  (IFGRPLVS)                                       */ 00465000
*/*%INCLUDE SYSLIB  (ISTRPLEX)                                       */ 00466000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 00467000
*/*%INCLUDE SYSUT5  (TERMREL )                                       */ 00468000
*/*%INCLUDE SYSUT5  (POSTECB )                                       */ 00469000
*/*%INCLUDE SYSUT5  (FREENTRY)                                       */ 00470000
*/*%INCLUDE SYSUT5  (SENDMSG )                                       */ 00471000
*                                                               01S0253 00472000
*       ;                                                       01S0253 00473000
@DATA    DS    0H                                                       00474000
         DS    0F                                                       00475000
@SA00001 DS    18F                                                      00476000
@SA00003 DS    1F                                                       00477000
@SA00004 DS    1F                                                       00478000
@SA00005 DS    1F                                                       00479000
@SA00002 DS    1F                                                       00480000
         DS    0F                                                       00481000
@CF00043 DC    F'4'                                                     00482000
@CF00035 DC    F'8'                                                     00483000
@CF01898 DC    F'76'                                                    00484000
@CF01889 DC    XL4'02000000'                                            00485000
@CA00028 DC    A(IKTCASCX)                                              00486000
         DS    0D                                                       00487000
@CC01829 DC    C'00000000'                                              00488000
@CC01897 DC    C'01'                                                    00489000
TRANTAB  DC    CL16'0123456789ABCDEF'                                   00490000
         DS    CL2                                                      00491000
PATAREA  DC    50A(0)                                                   00492000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00493000
@01      EQU   01                                                       00494000
@02      EQU   02                                                       00495000
@03      EQU   03                                                       00496000
@04      EQU   04                                                       00497000
@05      EQU   05                                                       00498000
@06      EQU   06                                                       00499000
@07      EQU   07                                                       00500000
@08      EQU   08                                                       00501000
@09      EQU   09                                                       00502000
@10      EQU   10                                                       00503000
@11      EQU   11                                                       00504000
@12      EQU   12                                                       00505000
@13      EQU   13                                                       00506000
@14      EQU   14                                                       00507000
@15      EQU   15                                                       00508000
SAVREG14 EQU   @11                                                      00509000
REG0     EQU   @00                                                      00510000
REG1     EQU   @01                                                      00511000
RPLREG   EQU   @02                                                      00512000
NIBREG   EQU   @03                                                      00513000
REG3     EQU   @03                                                      00514000
REG4     EQU   @04                                                      00515000
REG5     EQU   @05                                                      00516000
REG7     EQU   @07                                                      00517000
REG14    EQU   @14                                                      00518000
RETCODE  EQU   @15                                                      00519000
REG9     EQU   @09                                                      00520000
PSA      EQU   0                                                        00521000
FLCRNPSW EQU   PSA                                                      00522000
FLCROPSW EQU   PSA+8                                                    00523000
FLCICCW2 EQU   PSA+16                                                   00524000
FLCCVT   EQU   FLCICCW2                                                 00525000
PSAEEPSW EQU   PSA+132                                                  00526000
PSAESPSW EQU   PSA+136                                                  00527000
FLCSVILC EQU   PSAESPSW+1                                               00528000
PSAEPPSW EQU   PSA+140                                                  00529000
FLCPIILC EQU   PSAEPPSW+1                                               00530000
FLCPICOD EQU   PSAEPPSW+2                                               00531000
PSAPICOD EQU   FLCPICOD+1                                               00532000
FLCTEA   EQU   PSAEPPSW+4                                               00533000
FLCPER   EQU   PSA+152                                                  00534000
FLCMCLA  EQU   PSA+168                                                  00535000
FLCIOEL  EQU   FLCMCLA+4                                                00536000
FLCIOA   EQU   FLCMCLA+16                                               00537000
FLCFSA   EQU   FLCMCLA+80                                               00538000
PSASUPER EQU   PSA+552                                                  00539000
PSASUP1  EQU   PSASUPER                                                 00540000
PSASUP2  EQU   PSASUPER+1                                               00541000
PSASUP3  EQU   PSASUPER+2                                               00542000
PSASUP4  EQU   PSASUPER+3                                               00543000
PSACLHT  EQU   PSA+640                                                  00544000
PSALKSA  EQU   PSA+696                                                  00545000
PSAHLHI  EQU   PSA+760                                                  00546000
PSADSSFL EQU   PSA+836                                                  00547000
PSADSSF1 EQU   PSADSSFL                                                 00548000
PSADSSF3 EQU   PSADSSFL+2                                               00549000
PSADSSF4 EQU   PSADSSFL+3                                               00550000
PSARSVT  EQU   PSA+896                                                  00551000
CVTMAP   EQU   0                                                        00552000
CVTDAR   EQU   CVTMAP+72                                                00553000
CVTFLGS1 EQU   CVTDAR                                                   00554000
CVTDCB   EQU   CVTMAP+116                                               00555000
CVTIERLC EQU   CVTMAP+144                                               00556000
CVTOPTA  EQU   CVTMAP+182                                               00557000
CVTOPTB  EQU   CVTMAP+183                                               00558000
CVTGTF   EQU   CVTMAP+236                                               00559000
CVTGTFST EQU   CVTGTF                                                   00560000
CVTGTFS  EQU   CVTGTFST                                                 00561000
CVTSTATE EQU   CVTGTFST                                                 00562000
CVTTMODE EQU   CVTGTFST                                                 00563000
CVTFORM  EQU   CVTGTFST                                                 00564000
CVTAQAVT EQU   CVTMAP+240                                               00565000
CVTTCMFG EQU   CVTAQAVT                                                 00566000
CVTVOLM2 EQU   CVTMAP+244                                               00567000
CVTTATA  EQU   CVTVOLM2                                                 00568000
CVTTSKS  EQU   CVTTATA                                                  00569000
CVTVOLF2 EQU   CVTTSKS                                                  00570000
CVTTAT   EQU   CVTTATA+1                                                00571000
CVTATER  EQU   CVTMAP+248                                               00572000
CVTEXT1  EQU   CVTMAP+252                                               00573000
CVTPURG  EQU   CVTMAP+260                                               00574000
CVTQMSG  EQU   CVTMAP+268                                               00575000
CVTDMSR  EQU   CVTMAP+272                                               00576000
CVTRSV37 EQU   CVTDMSR                                                  00577000
CVTDMSRF EQU   CVTRSV37                                                 00578000
CVTERPV  EQU   CVTMAP+316                                               00579000
CVTINTLA EQU   CVTMAP+320                                               00580000
CVTAPF   EQU   CVTMAP+324                                               00581000
CVTEXT2  EQU   CVTMAP+328                                               00582000
CVTHJES  EQU   CVTMAP+332                                               00583000
CVTPGSIA EQU   CVTMAP+348                                               00584000
CVTA1F1  EQU   CVTMAP+356                                               00585000
CVTSYSK  EQU   CVTMAP+357                                               00586000
CVTVOLM1 EQU   CVTMAP+380                                               00587000
CVTVOLF1 EQU   CVTVOLM1                                                 00588000
CVTXTNT1 EQU   0                                                        00589000
CVTXTNT2 EQU   0                                                        00590000
CVTDSSV  EQU   CVTXTNT2                                                 00591000
CVTFLGBT EQU   CVTXTNT2+5                                               00592000
CVTQID   EQU   CVTXTNT2+24                                              00593000
CVTRV400 EQU   CVTXTNT2+52                                              00594000
CVTRV409 EQU   CVTXTNT2+53                                              00595000
CVTATCVT EQU   CVTXTNT2+64                                              00596000
CVTRV429 EQU   CVTXTNT2+84                                              00597000
CVTRV438 EQU   CVTXTNT2+85                                              00598000
CVTRV457 EQU   CVTXTNT2+112                                             00599000
CVTRV466 EQU   CVTXTNT2+113                                             00600000
CVTFIX   EQU   0                                                        00601000
CVTRELNO EQU   CVTFIX+252                                               00602000
TCAST    EQU   0                                                        00603000
TCASUSER EQU   TCAST+4                                                  00604000
TCASWA   EQU   TCAST+60                                                 00605000
TCASFLG1 EQU   TCAST+88                                                 00606000
TCASBR14 EQU   TCAST+116                                                00607000
TWAR     EQU   0                                                        00608000
TWAMSG   EQU   TWAR+48                                                  00609000
TWAMFL   EQU   TWAR+80                                                  00610000
TWAVFL   EQU   TWAR+81                                                  00611000
TWAUFL   EQU   TWAR+82                                                  00612000
TWACFL   EQU   TWAR+83                                                  00613000
TWAM     EQU   TWAR+84                                                  00614000
TWAME    EQU   TWAM+68                                                  00615000
TWAMEI   EQU   TWAME                                                    00616000
TWAV     EQU   TWAR+184                                                 00617000
TWAVE    EQU   TWAV+68                                                  00618000
TWAVEI   EQU   TWAVE                                                    00619000
TWAVI    EQU   TWAR+284                                                 00620000
TWAU     EQU   TWAR+300                                                 00621000
TWAUE    EQU   TWAU+68                                                  00622000
TWAUEI   EQU   TWAUE                                                    00623000
TWAUI    EQU   TWAR+400                                                 00624000
TWAC     EQU   TWAR+408                                                 00625000
TWACE    EQU   TWAC+68                                                  00626000
TWACEI   EQU   TWACE                                                    00627000
TWACI    EQU   TWAR+508                                                 00628000
WESTD    EQU   0                                                        00629000
WECODE1  EQU   WESTD                                                    00630000
WECODE1F EQU   WECODE1+1                                                00631000
WECODE2  EQU   WESTD+2                                                  00632000
WECODE2F EQU   WECODE2+1                                                00633000
WERC     EQU   WESTD+8                                                  00634000
WEUASCB  EQU   WESTD+12                                                 00635000
WEVNIB   EQU   WESTD+16                                                 00636000
WEUECB   EQU   WEVNIB                                                   00637000
WETERM   EQU   WESTD+28                                                 00638000
WETMFLG  EQU   WESTD+32                                                 00639000
IFGRPL   EQU   0                                                        00640000
RPLCOMN  EQU   IFGRPL                                                   00641000
RPLIDWD  EQU   RPLCOMN                                                  00642000
RPLLEN   EQU   RPLIDWD+3                                                00643000
RPLECB   EQU   RPLCOMN+8                                                00644000
RPLFDBWD EQU   RPLCOMN+12                                               00645000
RPLFDBK  EQU   RPLFDBWD+1                                               00646000
RPLRTNCD EQU   RPLFDBK                                                  00647000
RPLCNDCD EQU   RPLFDBK+1                                                00648000
RPLCMPON EQU   RPLCNDCD                                                 00649000
RPLFDB2  EQU   RPLCMPON                                                 00650000
RPLERRCD EQU   RPLCNDCD+1                                               00651000
RPLFDB3  EQU   RPLERRCD                                                 00652000
RPLKEYLE EQU   RPLCOMN+16                                               00653000
RPLAREA  EQU   RPLCOMN+32                                               00654000
RPLARG   EQU   RPLCOMN+36                                               00655000
RPLOPTCD EQU   RPLCOMN+40                                               00656000
RPLOPT1  EQU   RPLOPTCD                                                 00657000
RPLECBSW EQU   RPLOPT1                                                  00658000
RPLOPT2  EQU   RPLOPTCD+1                                               00659000
RPLADR   EQU   RPLOPT2                                                  00660000
RPLOPT3  EQU   RPLOPTCD+2                                               00661000
RPLOPT4  EQU   RPLOPTCD+3                                               00662000
RPLNXTRP EQU   RPLCOMN+44                                               00663000
RPLOPTC2 EQU   RPLCOMN+56                                               00664000
RPLOPT5  EQU   RPLOPTC2                                                 00665000
RPLWRTYP EQU   RPLOPT5                                                  00666000
RPLOPT6  EQU   RPLOPTC2+1                                               00667000
RPLUNTYP EQU   RPLOPT6                                                  00668000
RPLOPT7  EQU   RPLOPTC2+2                                               00669000
RPLCNOPT EQU   RPLOPT7                                                  00670000
RPLOPT8  EQU   RPLOPTC2+3                                               00671000
RPLRBAR  EQU   RPLCOMN+60                                               00672000
RPLAIXID EQU   RPLRBAR+2                                                00673000
RPLEXTDS EQU   RPLCOMN+68                                               00674000
RPLEXTD1 EQU   RPLEXTDS                                                 00675000
RPLNIB   EQU   RPLEXTD1                                                 00676000
RPLVTEXT EQU   IFGRPL+76                                                00677000
RPLFDBK2 EQU   RPLVTEXT+12                                              00678000
RPLSSNSI EQU   RPLFDBK2                                                 00679000
RPLDSB   EQU   RPLSSNSI                                                 00680000
RPLDSB1  EQU   RPLDSB                                                   00681000
RPLSSEI  EQU   RPLDSB1                                                  00682000
RPLDSB2  EQU   RPLDSB+1                                                 00683000
RPLUSNSI EQU   RPLFDBK2+2                                               00684000
RPLOPTC3 EQU   RPLVTEXT+20                                              00685000
RPLOPT9  EQU   RPLOPTC3                                                 00686000
RPLOPT10 EQU   RPLOPTC3+1                                               00687000
RPLOPT11 EQU   RPLOPTC3+2                                               00688000
RPLOPT12 EQU   RPLOPTC3+3                                               00689000
RPLOSENS EQU   RPLVTEXT+24                                              00690000
RPLSSNSO EQU   RPLOSENS                                                 00691000
RPLSSEO  EQU   RPLSSNSO                                                 00692000
RPLOF16  EQU   0                                                        00693000
RPLRH3   EQU   RPLOF16                                                  00694000
RPLSRTYP EQU   RPLOF16+1                                                00695000
RPLSTYPE EQU   RPLSRTYP                                                 00696000
RPLRTYPE EQU   RPLSRTYP                                                 00697000
RPLCHN   EQU   RPLOF16+2                                                00698000
RPLVTFL1 EQU   RPLOF16+3                                                00699000
RPLVTFL2 EQU   RPLOF16+4                                                00700000
RPLPOSTV EQU   RPLVTFL2                                                 00701000
RPLRESP  EQU   RPLVTFL2                                                 00702000
RPLCNTRL EQU   RPLOF16+5                                                00703000
RPLCNTDF EQU   RPLCNTRL                                                 00704000
RPLCNTDC EQU   RPLCNTRL+1                                               00705000
RPLCNTSC EQU   RPLCNTRL+2                                               00706000
RPLOF56  EQU   0                                                        00707000
RPLO5    EQU   RPLOF56                                                  00708000
RPLOF60  EQU   0                                                        00709000
RPLOBSQ  EQU   RPLOF60+4                                                00710000
RPLIBSQ  EQU   RPLOF60+5                                                00711000
ISTPROCD EQU   0                                                        00712000
PROPROC  EQU   ISTPROCD                                                 00713000
PROPROC1 EQU   PROPROC                                                  00714000
PROPROC2 EQU   PROPROC+1                                                00715000
PROPROC3 EQU   PROPROC+2                                                00716000
PROPROC4 EQU   PROPROC+3                                                00717000
PROPROCS EQU   0                                                        00718000
PROSETMS EQU   PROPROCS+1                                               00719000
PROSETM2 EQU   PROSETMS                                                 00720000
PROSETM3 EQU   PROSETMS+1                                               00721000
PROSETM4 EQU   PROSETMS+2                                               00722000
ISTDEVCH EQU   0                                                        00723000
DEVSHCH  EQU   ISTDEVCH                                                 00724000
DEVCHAR  EQU   DEVSHCH                                                  00725000
DEVTCODE EQU   ISTDEVCH+1                                               00726000
DEVFLAGS EQU   ISTDEVCH+3                                               00727000
DEVFCCTL EQU   DEVFLAGS                                                 00728000
DEVCHAR3 EQU   DEVFLAGS                                                 00729000
DEVMODE  EQU   ISTDEVCH+5                                               00730000
ISTNIB   EQU   0                                                        00731000
NIBSYM   EQU   ISTNIB+12                                                00732000
NIBFLGS  EQU   ISTNIB+40                                                00733000
NIBFLG1  EQU   NIBFLGS                                                  00734000
WORKSPAC EQU   112                                                      00735000
WSFLG1   EQU   WORKSPAC                                                 00736000
WSCLSREL EQU   WSFLG1                                                   00737000
WSCLSPAS EQU   WSFLG1                                                   00738000
WSRETRYB EQU   WSFLG1                                                   00739000
WSRETRY  EQU   WORKSPAC+1                                               00740000
WSCONCOD EQU   WORKSPAC+2                                               00741000
WSMACRTC EQU   WSCONCOD                                                 00742000
WSMACRSC EQU   WSCONCOD+1                                               00743000
WSSIZE   EQU   WORKSPAC+4                                               00744000
MSGENTRY EQU   0                                                        00745000
MSGLIST  EQU   MSGENTRY+4                                               00746000
REASON   EQU   MSGLIST+15                                               00747000
SENSE    EQU   MSGLIST+28                                               00748000
MACTERM  EQU   MSGLIST+46                                               00749000
IKTCAS56 EQU   0                                                        00750000
ISTRPL   EQU   0                                                        00751000
PSARSVTE EQU   PSARSVT                                                  00752000
CVTPTR   EQU   FLCCVT                                                   00753000
CVTS01   EQU   CVTPGSIA                                                 00754000
CVTLPDIA EQU   CVTS01+12                                                00755000
CVTDIRST EQU   CVTLPDIA                                                 00756000
CVTSLIDA EQU   CVTS01+24                                                00757000
CVTCTLFG EQU   CVTS01+50                                                00758000
CVTRV210 EQU   CVTS01+424                                               00759000
CVTRV219 EQU   CVTS01+425                                               00760000
CVTRV228 EQU   CVTS01+426                                               00761000
CVTRV237 EQU   CVTS01+427                                               00762000
CVTMFRTR EQU   CVTS01+452                                               00763000
CVTRV262 EQU   CVTS01+468                                               00764000
CVTRV271 EQU   CVTS01+469                                               00765000
CVTRV280 EQU   CVTS01+470                                               00766000
CVTRV289 EQU   CVTS01+471                                               00767000
CVTGSDA  EQU   CVTS01+600                                               00768000
CVTTCASP EQU   CVTS01+664                                               00769000
TCASTPTR EQU   CVTTCASP                                                 00770000
TWAPTR   EQU   TCASWA                                                   00771000
REASNRPL EQU   RPLFDBK                                                  00772000
SENSERPL EQU   RPLFDBK2                                                 00773000
FLC      EQU   PSA                                                      00774000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00775000
CVTRV628 EQU   CVTS01+728                                               00776000
CVTRV627 EQU   CVTS01+724                                               00777000
CVTRV626 EQU   CVTS01+720                                               00778000
CVTRV625 EQU   CVTS01+716                                               00779000
CVTRV624 EQU   CVTS01+712                                               00780000
CVTRV623 EQU   CVTS01+708                                               00781000
CVTRV622 EQU   CVTS01+704                                               00782000
CVTRV621 EQU   CVTS01+700                                               00783000
CVTIHASU EQU   CVTS01+696                                               00784000
CVTSUSP  EQU   CVTS01+692                                               00785000
CVTT6SVC EQU   CVTS01+688                                               00786000
CVTCDAL  EQU   CVTS01+684                                               00787000
CVTTCTL  EQU   CVTS01+680                                               00788000
CVTRSUME EQU   CVTS01+676                                               00789000
CVTJTERM EQU   CVTS01+672                                               00790000
CVTASMRM EQU   CVTS01+668                                               00791000
CVT0PT03 EQU   CVTS01+660                                               00792000
CVT0PT0E EQU   CVTS01+656                                               00793000
CVTRV609 EQU   CVTS01+652                                               00794000
CVTCGK   EQU   CVTS01+648                                               00795000
CVTRAC   EQU   CVTS01+644                                               00796000
CVTRV606 EQU   CVTS01+640                                               00797000
CVTRV605 EQU   CVTS01+636                                               00798000
CVTRV604 EQU   CVTS01+632                                               00799000
CVTEFF02 EQU   CVTS01+628                                               00800000
CVTCBBR  EQU   CVTS01+624                                               00801000
CVTSSCR  EQU   CVTS01+620                                               00802000
CVTEVENT EQU   CVTS01+616                                               00803000
CVTCRCA  EQU   CVTS01+612                                               00804000
CVTTPIO  EQU   CVTS01+608                                               00805000
CVTADV   EQU   CVTS01+604                                               00806000
CVTGSDAB EQU   CVTGSDA                                                  00807000
CVTQV3   EQU   CVTS01+596                                               00808000
CVTQV2   EQU   CVTS01+592                                               00809000
CVTQV1   EQU   CVTS01+588                                               00810000
CVTRPT   EQU   CVTS01+584                                               00811000
CVTSSRB  EQU   CVTS01+580                                               00812000
CVTCSDRL EQU   CVTS01+576                                               00813000
CVTEXP1  EQU   CVTS01+572                                               00814000
CVTRMPMT EQU   CVTS01+568                                               00815000
CVTRMPTT EQU   CVTS01+564                                               00816000
CVTVPSA  EQU   CVTS01+560                                               00817000
CVTVSTOP EQU   CVTS01+556                                               00818000
CVTGTFR8 EQU   CVTS01+552                                               00819000
CVTQUIT  EQU   CVTS01+548                                               00820000
CVTVACR  EQU   CVTS01+544                                               00821000
CVTWTCB  EQU   CVTS01+540                                               00822000
CVTSTPRS EQU   CVTS01+536                                               00823000
CVT0PT02 EQU   CVTS01+532                                               00824000
CVTDARCM EQU   CVTS01+528                                               00825000
CVTIRECM EQU   CVTS01+524                                               00826000
CVTJRECM EQU   CVTS01+520                                               00827000
CVTVEMS0 EQU   CVTS01+516                                               00828000
CVTSPFRR EQU   CVTS01+512                                               00829000
CVTRLSTG EQU   CVTS01+508                                               00830000
CVT0TC0A EQU   CVTS01+504                                               00831000
CVTGMBR  EQU   CVTS01+500                                               00832000
CVTLFRM  EQU   CVTS01+496                                               00833000
CVTRMBR  EQU   CVTS01+492                                               00834000
CVTVIOP  EQU   CVTS01+488                                               00835000
CVTRV307 EQU   CVTS01+486                                               00836000
CVTRV306 EQU   CVTS01+484                                               00837000
CVTRV305 EQU   CVTS01+482                                               00838000
CVTRV304 EQU   CVTS01+480                                               00839000
CVTRV303 EQU   CVTS01+478                                               00840000
CVTRV302 EQU   CVTS01+476                                               00841000
CVTTRCA  EQU   CVTS01+472                                               00842000
CVTRV297 EQU   CVTRV289                                                 00843000
CVTRV296 EQU   CVTRV289                                                 00844000
CVTRV295 EQU   CVTRV289                                                 00845000
CVTRV294 EQU   CVTRV289                                                 00846000
CVTRV293 EQU   CVTRV289                                                 00847000
CVTRV292 EQU   CVTRV289                                                 00848000
CVTRV291 EQU   CVTRV289                                                 00849000
CVTRV290 EQU   CVTRV289                                                 00850000
CVTRV288 EQU   CVTRV280                                                 00851000
CVTRV287 EQU   CVTRV280                                                 00852000
CVTRV286 EQU   CVTRV280                                                 00853000
CVTRV285 EQU   CVTRV280                                                 00854000
CVTRV284 EQU   CVTRV280                                                 00855000
CVTRV283 EQU   CVTRV280                                                 00856000
CVTRV282 EQU   CVTRV280                                                 00857000
CVTRV281 EQU   CVTRV280                                                 00858000
CVTRV279 EQU   CVTRV271                                                 00859000
CVTRV278 EQU   CVTRV271                                                 00860000
CVTRV277 EQU   CVTRV271                                                 00861000
CVTRV276 EQU   CVTRV271                                                 00862000
CVTRV275 EQU   CVTRV271                                                 00863000
CVTRV274 EQU   CVTRV271                                                 00864000
CVTRV273 EQU   CVTRV271                                                 00865000
CVTRV272 EQU   CVTRV271                                                 00866000
CVTRV270 EQU   CVTRV262                                                 00867000
CVTRV269 EQU   CVTRV262                                                 00868000
CVTRV268 EQU   CVTRV262                                                 00869000
CVTRV267 EQU   CVTRV262                                                 00870000
CVTRV266 EQU   CVTRV262                                                 00871000
CVTRV265 EQU   CVTRV262                                                 00872000
CVTRV264 EQU   CVTRV262                                                 00873000
CVTRV263 EQU   CVTRV262                                                 00874000
CVTVFP   EQU   CVTS01+464                                               00875000
CVTVSI   EQU   CVTS01+460                                               00876000
CVTVPSIB EQU   CVTS01+456                                               00877000
CVTMFACT EQU   CVTMFRTR                                                 00878000
CVTMFCTL EQU   CVTS01+448                                               00879000
CVTPVBP  EQU   CVTS01+444                                               00880000
CVTPWI   EQU   CVTS01+440                                               00881000
CVTRV254 EQU   CVTS01+438                                               00882000
CVTRV253 EQU   CVTS01+436                                               00883000
CVTRV252 EQU   CVTS01+434                                               00884000
CVTRV251 EQU   CVTS01+433                                               00885000
CVTRV250 EQU   CVTS01+432                                               00886000
CVTRV249 EQU   CVTS01+431                                               00887000
CVTRV248 EQU   CVTS01+430                                               00888000
CVTRV247 EQU   CVTS01+429                                               00889000
CVTRV246 EQU   CVTS01+428                                               00890000
CVTRV245 EQU   CVTRV237                                                 00891000
CVTRV244 EQU   CVTRV237                                                 00892000
CVTRV243 EQU   CVTRV237                                                 00893000
CVTRV242 EQU   CVTRV237                                                 00894000
CVTRV241 EQU   CVTRV237                                                 00895000
CVTRV240 EQU   CVTRV237                                                 00896000
CVTRV239 EQU   CVTRV237                                                 00897000
CVTRV238 EQU   CVTRV237                                                 00898000
CVTRV236 EQU   CVTRV228                                                 00899000
CVTRV235 EQU   CVTRV228                                                 00900000
CVTRV234 EQU   CVTRV228                                                 00901000
CVTRV233 EQU   CVTRV228                                                 00902000
CVTRV232 EQU   CVTRV228                                                 00903000
CVTRV231 EQU   CVTRV228                                                 00904000
CVTRV230 EQU   CVTRV228                                                 00905000
CVTRV229 EQU   CVTRV228                                                 00906000
CVTRV227 EQU   CVTRV219                                                 00907000
CVTRV226 EQU   CVTRV219                                                 00908000
CVTRV225 EQU   CVTRV219                                                 00909000
CVTRV224 EQU   CVTRV219                                                 00910000
CVTRV223 EQU   CVTRV219                                                 00911000
CVTRV222 EQU   CVTRV219                                                 00912000
CVTRV221 EQU   CVTRV219                                                 00913000
CVTRV220 EQU   CVTRV219                                                 00914000
CVTRV218 EQU   CVTRV210                                                 00915000
CVTRV217 EQU   CVTRV210                                                 00916000
CVTRV216 EQU   CVTRV210                                                 00917000
CVTRV215 EQU   CVTRV210                                                 00918000
CVTRV214 EQU   CVTRV210                                                 00919000
CVTRV213 EQU   CVTRV210                                                 00920000
CVTRV212 EQU   CVTRV210                                                 00921000
CVTRV211 EQU   CVTRV210                                                 00922000
CVTLCCAT EQU   CVTS01+420                                               00923000
CVTPCCAT EQU   CVTS01+416                                               00924000
CVTIPCRP EQU   CVTS01+412                                               00925000
CVTIPCRI EQU   CVTS01+408                                               00926000
CVTIPCDS EQU   CVTS01+404                                               00927000
CVTAIDVT EQU   CVTS01+400                                               00928000
CVTSSAP  EQU   CVTS01+396                                               00929000
CVTEHCIR EQU   CVTS01+392                                               00930000
CVTEHDEF EQU   CVTS01+388                                               00931000
CVTDAIR  EQU   CVTS01+384                                               00932000
CVTPERFM EQU   CVTS01+380                                               00933000
CVT044R2 EQU   CVTS01+376                                               00934000
CVTFETCH EQU   CVTS01+372                                               00935000
CVTRSTWD EQU   CVTS01+368                                               00936000
CVTSPOST EQU   CVTS01+364                                               00937000
CVTIOBP  EQU   CVTS01+360                                               00938000
CVTASMVT EQU   CVTS01+356                                               00939000
CVTRECRQ EQU   CVTS01+352                                               00940000
CVTWSAC  EQU   CVTS01+348                                               00941000
CVTRV149 EQU   CVTS01+344                                               00942000
CVTWSAL  EQU   CVTS01+340                                               00943000
CVTSPSA  EQU   CVTS01+336                                               00944000
CVTGLMN  EQU   CVTS01+332                                               00945000
CVTVEAC0 EQU   CVTS01+328                                               00946000
CVT062R1 EQU   CVTS01+324                                               00947000
CVTRPOST EQU   CVTS01+320                                               00948000
CVTDQIQE EQU   CVTS01+316                                               00949000
CVTCSD   EQU   CVTS01+312                                               00950000
CVTLKRMA EQU   CVTS01+308                                               00951000
CVTRSPIE EQU   CVTS01+304                                               00952000
CVTRENQ  EQU   CVTS01+300                                               00953000
CVTLQCB  EQU   CVTS01+296                                               00954000
CVTFQCB  EQU   CVTS01+292                                               00955000
CVTQCS01 EQU   CVTS01+288                                               00956000
CVTAPFT  EQU   CVTS01+284                                               00957000
CVTPARRL EQU   CVTS01+280                                               00958000
CVTVWAIT EQU   CVTS01+276                                               00959000
CVTGSPL  EQU   CVTS01+272                                               00960000
CVTLSMQ  EQU   CVTS01+268                                               00961000
CVTGSMQ  EQU   CVTS01+264                                               00962000
CVTEXPRO EQU   CVTS01+260                                               00963000
CVTOPCTP EQU   CVTS01+256                                               00964000
CVTSIC   EQU   CVTS01+252                                               00965000
CVTTPIOS EQU   CVTS01+248                                               00966000
CVTRTMS  EQU   CVTS01+244                                               00967000
CVTSDBF  EQU   CVTS01+240                                               00968000
CVTSCBP  EQU   CVTS01+236                                               00969000
CVTSDMP  EQU   CVTS01+232                                               00970000
CVTSV60  EQU   CVTS01+228                                               00971000
CVTRTMCT EQU   CVTS01+224                                               00972000
CVTASCBL EQU   CVTS01+220                                               00973000
CVTASCBH EQU   CVTS01+216                                               00974000
CVTGDA   EQU   CVTS01+212                                               00975000
CVTASVT  EQU   CVTS01+208                                               00976000
CVTVVMDI EQU   CVTS01+204                                               00977000
CVTAQTOP EQU   CVTS01+200                                               00978000
CVTIOSCS EQU   CVTS01+196                                               00979000
CVTSDRM  EQU   CVTS01+192                                               00980000
CVTOPTE  EQU   CVTS01+188                                               00981000
CVTSTXU  EQU   CVTS01+184                                               00982000
CVTQUIS  EQU   CVTS01+180                                               00983000
CVTPARS  EQU   CVTS01+176                                               00984000
CVTS1EE  EQU   CVTS01+172                                               00985000
CVTFRAS  EQU   CVTS01+168                                               00986000
CVTQSAS  EQU   CVTS01+164                                               00987000
CVTCRAS  EQU   CVTS01+160                                               00988000
CVTCRMN  EQU   CVTS01+156                                               00989000
CVTDELCP EQU   CVTS01+152                                               00990000
CVTFRECL EQU   CVTS01+148                                               00991000
CVTGETCL EQU   CVTS01+144                                               00992000
CVTBLDCP EQU   CVTS01+140                                               00993000
CVTAUTHL EQU   CVTS01+136                                               00994000
CVTSCAN  EQU   CVTS01+132                                               00995000
CVTRV144 EQU   CVTS01+130                                               00996000
CVTMAXMP EQU   CVTS01+128                                               00997000
CVTSTCK  EQU   CVTS01+124                                               00998000
CVTRV139 EQU   CVTS01+123                                               00999000
CVTDSSAC EQU   CVTS01+122                                               01000000
CVTRV513 EQU   CVTS01+121                                               01001000
CVTIOSPL EQU   CVTS01+120                                               01002000
CVTPTGT  EQU   CVTS01+116                                               01003000
CVTCSPIE EQU   CVTS01+112                                               01004000
CVTSMFEX EQU   CVTS01+108                                               01005000
CVTOLT0A EQU   CVTS01+104                                               01006000
CVTSRBRT EQU   CVTS01+100                                               01007000
CVTPUTL  EQU   CVTS01+96                                                01008000
CVTASCRL EQU   CVTS01+92                                                01009000
CVTASCRF EQU   CVTS01+88                                                01010000
CVTRV326 EQU   CVTS01+84                                                01011000
CVTRV325 EQU   CVTS01+80                                                01012000
CVTRV324 EQU   CVTS01+76                                                01013000
CVT0VL01 EQU   CVTS01+72                                                01014000
CVTSHRVM EQU   CVTS01+68                                                01015000
CVTRV332 EQU   CVTS01+64                                                01016000
CVTTAS   EQU   CVTS01+60                                                01017000
CVTRSCN  EQU   CVTS01+56                                                01018000
CVTTRAC2 EQU   CVTS01+54                                                01019000
CVTTRACE EQU   CVTS01+52                                                01020000
CVTAPG   EQU   CVTS01+51                                                01021000
CVTSDTRC EQU   CVTCTLFG                                                 01022000
CVTGTRCE EQU   CVTCTLFG                                                 01023000
CVTNOMP  EQU   CVTCTLFG                                                 01024000
CVTRSV79 EQU   CVTCTLFG                                                 01025000
CVTDSTAT EQU   CVTCTLFG                                                 01026000
CVTRSV78 EQU   CVTCTLFG                                                 01027000
CVTRV333 EQU   CVTCTLFG                                                 01028000
CVTRV323 EQU   CVTCTLFG                                                 01029000
CVTSPVLK EQU   CVTS01+49                                                01030000
CVTRSV77 EQU   CVTS01+48                                                01031000
CVTRV331 EQU   CVTS01+44                                                01032000
CVTRV330 EQU   CVTS01+40                                                01033000
CVTRV329 EQU   CVTS01+36                                                01034000
CVTRV328 EQU   CVTS01+32                                                01035000
CVTRV322 EQU   CVTS01+28                                                01036000
CVTSLID  EQU   CVTSLIDA+1                                               01037000
CVTSYLK  EQU   CVTSLIDA                                                 01038000
CVTRV321 EQU   CVTS01+20                                                01039000
CVTRV320 EQU   CVTS01+16                                                01040000
CVTLPDIR EQU   CVTLPDIA+1                                               01041000
CVTRSV69 EQU   CVTDIRST                                                 01042000
CVTRSV68 EQU   CVTDIRST                                                 01043000
CVTRSV67 EQU   CVTDIRST                                                 01044000
CVTRSV66 EQU   CVTDIRST                                                 01045000
CVTRSV65 EQU   CVTDIRST                                                 01046000
CVTRSV64 EQU   CVTDIRST                                                 01047000
CVTRSV63 EQU   CVTDIRST                                                 01048000
CVTDICOM EQU   CVTDIRST                                                 01049000
CVTPVTP  EQU   CVTS01+8                                                 01050000
CVTLPDSR EQU   CVTS01+4                                                 01051000
CVTGETL  EQU   CVTS01                                                   01052000
PSARSAV  EQU   PSARSVTE+60                                              01053000
PSARSTK  EQU   PSARSVTE+56                                              01054000
PSAESAV3 EQU   PSARSVTE+52                                              01055000
PSAESTK3 EQU   PSARSVTE+48                                              01056000
PSAESAV2 EQU   PSARSVTE+44                                              01057000
PSAESTK2 EQU   PSARSVTE+40                                              01058000
PSAESAV1 EQU   PSARSVTE+36                                              01059000
PSAESTK1 EQU   PSARSVTE+32                                              01060000
PSAPSAV  EQU   PSARSVTE+28                                              01061000
PSAPSTK  EQU   PSARSVTE+24                                              01062000
PSAMSAV  EQU   PSARSVTE+20                                              01063000
PSAMSTK  EQU   PSARSVTE+16                                              01064000
PSASSAV  EQU   PSARSVTE+12                                              01065000
PSASSTK  EQU   PSARSVTE+8                                               01066000
PSANSTK  EQU   PSARSVTE+4                                               01067000
PSACSTK  EQU   PSARSVTE                                                 01068000
@NM00072 EQU   MSGLIST+37                                               01069000
@NM00071 EQU   MSGLIST+22                                               01070000
@NM00070 EQU   MSGLIST+4                                                01071000
MACFLAG  EQU   MSGLIST+2                                                01072000
TEXTLEN  EQU   MSGLIST                                                  01073000
MSGLEN   EQU   MSGENTRY                                                 01074000
WSDUMBUF EQU   WORKSPAC+8                                               01075000
@NM00069 EQU   WSFLG1                                                   01076000
WSSYNCH  EQU   WSFLG1                                                   01077000
WSOPNDST EQU   WSFLG1                                                   01078000
WSALLOCD EQU   WSFLG1                                                   01079000
NIBRESV  EQU   ISTNIB+60                                                01080000
NIBNDAR  EQU   ISTNIB+56                                                01081000
NIBLMODE EQU   ISTNIB+48                                                01082000
NIBEXLST EQU   ISTNIB+44                                                01083000
NIBLIMIT EQU   ISTNIB+42                                                01084000
@NM00068 EQU   ISTNIB+41                                                01085000
@NM00067 EQU   NIBFLG1                                                  01086000
NIBTREQ  EQU   NIBFLG1                                                  01087000
NIBTSEL  EQU   NIBFLG1                                                  01088000
NIBNACLQ EQU   NIBFLG1                                                  01089000
NIBSHLTP EQU   NIBFLG1                                                  01090000
NIBSDAPP EQU   NIBFLG1                                                  01091000
NIBCON   EQU   NIBFLG1                                                  01092000
NIBLAST  EQU   NIBFLG1                                                  01093000
NIBPROCD EQU   ISTNIB+36                                                01094000
NIBDEVCH EQU   ISTNIB+28                                                01095000
NIBMODE  EQU   ISTNIB+20                                                01096000
NIBUSER  EQU   ISTNIB+8                                                 01097000
NIBCID   EQU   ISTNIB+4                                                 01098000
NIBLEN   EQU   ISTNIB+3                                                 01099000
NIBCONDN EQU   ISTNIB+2                                                 01100000
NIBRSV01 EQU   ISTNIB+1                                                 01101000
NIBID    EQU   ISTNIB                                                   01102000
DEVRSV01 EQU   ISTDEVCH+7                                               01103000
DEVAUXTP EQU   ISTDEVCH+6                                               01104000
DEVADVFE EQU   DEVMODE                                                  01105000
@NM00066 EQU   DEVMODE                                                  01106000
DEVBASIC EQU   DEVMODE                                                  01107000
DEVREC   EQU   DEVMODE                                                  01108000
DEVPHYSA EQU   ISTDEVCH+4                                               01109000
DEVCSLPN EQU   DEVCHAR3                                                 01110000
DEVCSTCL EQU   DEVCHAR3                                                 01111000
DEVCCHEK EQU   DEVCHAR3                                                 01112000
DEVCATTN EQU   DEVCHAR3                                                 01113000
DEVCSWL  EQU   DEVFCCTL                                                 01114000
DEVCRVB  EQU   DEVFCCTL                                                 01115000
DEVCSSL  EQU   DEVFCCTL                                                 01116000
DEVCBSC  EQU   DEVFCCTL                                                 01117000
DEVMCODE EQU   ISTDEVCH+2                                               01118000
DEVCHAR2 EQU   DEVTCODE                                                 01119000
DEVSPOLL EQU   DEVCHAR                                                  01120000
DEVCCTL  EQU   DEVCHAR                                                  01121000
DEVNNSPT EQU   DEVCHAR                                                  01122000
DEVSPS   EQU   DEVCHAR                                                  01123000
DEVSUBND EQU   DEVCHAR                                                  01124000
DEVCONVR EQU   DEVCHAR                                                  01125000
DEVOTPUT EQU   DEVCHAR                                                  01126000
DEVINPUT EQU   DEVCHAR                                                  01127000
PROSRDEF EQU   PROSETM4                                                 01128000
PRORSV47 EQU   PROSETM4                                                 01129000
PROSCON  EQU   PROSETM4                                                 01130000
PRORSV46 EQU   PROSETM3                                                 01131000
PROSMONT EQU   PROSETM3                                                 01132000
PRORSV45 EQU   PROSETM3                                                 01133000
PROSNTO  EQU   PROSETM3                                                 01134000
PRORSV44 EQU   PROSETM3                                                 01135000
PRORSV43 EQU   PROSETM2                                                 01136000
PROSNTFL EQU   PROSETM2                                                 01137000
PRORSV42 EQU   PROSETM2                                                 01138000
PRORSV41 EQU   PROPROCS                                                 01139000
PROMODC  EQU   PROPROC4                                                 01140000
PROMODT  EQU   PROPROC4                                                 01141000
PROMODM  EQU   PROPROC4                                                 01142000
PROMODB  EQU   PROPROC4                                                 01143000
PRORSV14 EQU   PROPROC4                                                 01144000
PRORSV13 EQU   PROPROC4                                                 01145000
PRORSV12 EQU   PROPROC4                                                 01146000
PROEIB   EQU   PROPROC4                                                 01147000
PROMONT3 EQU   PROPROC3                                                 01148000
PROMONT2 EQU   PROPROC3                                                 01149000
PROMONIT EQU   PROPROC3                                                 01150000
PROSUBLK EQU   PROPROC3                                                 01151000
PRONTO   EQU   PROPROC3                                                 01152000
PROLGIN  EQU   PROPROC3                                                 01153000
PROERPI  EQU   PROPROC3                                                 01154000
PRORSV07 EQU   PROPROC3                                                 01155000
PROCFTX  EQU   PROPROC2                                                 01156000
PROEMLC  EQU   PROPROC2                                                 01157000
PRONTFL  EQU   PROPROC2                                                 01158000
PROFIFOR EQU   PROPROC2                                                 01159000
PROSYSR  EQU   PROPROC2                                                 01160000
PROLGOT  EQU   PROPROC2                                                 01161000
PROERPO  EQU   PROPROC2                                                 01162000
PRONEGBD EQU   PROPROC2                                                 01163000
PRORPLC  EQU   PROPROC1                                                 01164000
PROCS    EQU   PROPROC1                                                 01165000
PROCA    EQU   PROPROC1                                                 01166000
PRORESPX EQU   PROPROC1                                                 01167000
PRODFASY EQU   PROPROC1                                                 01168000
PROXPOPT EQU   PROPROC1                                                 01169000
PROTRUNC EQU   PROPROC1                                                 01170000
PROASYIP EQU   PROPROC1                                                 01171000
RPLSEQNO EQU   RPLOF60+6                                                01172000
@NM00065 EQU   RPLIBSQ                                                  01173000
RPLIINV  EQU   RPLIBSQ                                                  01174000
RPLINEG  EQU   RPLIBSQ                                                  01175000
RPLIPOS  EQU   RPLIBSQ                                                  01176000
RPLIIGN  EQU   RPLIBSQ                                                  01177000
RPLIRSET EQU   RPLIBSQ                                                  01178000
RPLITST  EQU   RPLIBSQ                                                  01179000
RPLISET  EQU   RPLIBSQ                                                  01180000
@NM00064 EQU   RPLOBSQ                                                  01181000
RPLOINV  EQU   RPLOBSQ                                                  01182000
RPLONEG  EQU   RPLOBSQ                                                  01183000
RPLOPOS  EQU   RPLOBSQ                                                  01184000
RPLOIGN  EQU   RPLOBSQ                                                  01185000
RPLORSET EQU   RPLOBSQ                                                  01186000
RPLOTST  EQU   RPLOBSQ                                                  01187000
RPLOSET  EQU   RPLOBSQ                                                  01188000
RPLIBSQV EQU   RPLOF60+2                                                01189000
RPLOBSQV EQU   RPLOF60                                                  01190000
@NM00063 EQU   RPLO5                                                    01191000
RPLTNFY  EQU   RPLO5                                                    01192000
@NM00062 EQU   RPLO5                                                    01193000
@NM00061 EQU   RPLCNTSC                                                 01194000
RPLRSHUT EQU   RPLCNTSC                                                 01195000
RPLRQR   EQU   RPLCNTSC                                                 01196000
RPLSHUTC EQU   RPLCNTSC                                                 01197000
RPLSHUTD EQU   RPLCNTSC                                                 01198000
RPLSTSN  EQU   RPLCNTSC                                                 01199000
RPLCLEAR EQU   RPLCNTSC                                                 01200000
RPLSDT   EQU   RPLCNTSC                                                 01201000
RPLBIS   EQU   RPLCNTDC                                                 01202000
RPLSBI   EQU   RPLCNTDC                                                 01203000
RPLTUNBD EQU   RPLCNTDC                                                 01204000
RPLTBIND EQU   RPLCNTDC                                                 01205000
RPLSIGNL EQU   RPLCNTDC                                                 01206000
RPLLUS   EQU   RPLCNTDC                                                 01207000
RPLRTR   EQU   RPLCNTDC                                                 01208000
RPLBID   EQU   RPLCNTDC                                                 01209000
@NM00060 EQU   RPLCNTDF                                                 01210000
RPLQI    EQU   RPLCNTDF                                                 01211000
RPLRELQ  EQU   RPLCNTDF                                                 01212000
RPLCHASE EQU   RPLCNTDF                                                 01213000
RPLQEC   EQU   RPLCNTDF                                                 01214000
RPLQC    EQU   RPLCNTDF                                                 01215000
RPLCNCEL EQU   RPLCNTDF                                                 01216000
RPLDATA  EQU   RPLCNTDF                                                 01217000
RPLRRN   EQU   RPLRESP                                                  01218000
RPLNFME  EQU   RPLRESP                                                  01219000
RPLEX    EQU   RPLRESP                                                  01220000
RPLQRI   EQU   RPLRESP                                                  01221000
@NM00059 EQU   RPLPOSTV                                                 01222000
RPLSCHED EQU   RPLPOSTV                                                 01223000
@NM00058 EQU   RPLVTFL1                                                 01224000
RPLTLGAC EQU   RPLVTFL1                                                 01225000
RPLTNDSP EQU   RPLVTFL1                                                 01226000
RPLAUTUS EQU   RPLVTFL1                                                 01227000
RPLVTUSE EQU   RPLVTFL1                                                 01228000
@NM00057 EQU   RPLVTFL1                                                 01229000
@NM00056 EQU   RPLCHN                                                   01230000
RPLONLY  EQU   RPLCHN                                                   01231000
RPLLAST  EQU   RPLCHN                                                   01232000
RPLMIDLE EQU   RPLCHN                                                   01233000
RPLFIRST EQU   RPLCHN                                                   01234000
@NM00055 EQU   RPLRTYPE                                                 01235000
RPLDFASY EQU   RPLRTYPE                                                 01236000
RPLNFSYN EQU   RPLRTYPE                                                 01237000
RPLRRESP EQU   RPLRTYPE                                                 01238000
@NM00054 EQU   RPLSTYPE                                                 01239000
RPLSRESP EQU   RPLSTYPE                                                 01240000
@NM00053 EQU   RPLRH3                                                   01241000
RPLCSI   EQU   RPLRH3                                                   01242000
RPLCHREQ EQU   RPLRH3                                                   01243000
RPLCMD   EQU   RPLRH3                                                   01244000
RPLEB    EQU   RPLRH3                                                   01245000
RPLBB    EQU   RPLRH3                                                   01246000
RPLSIGDA EQU   RPLVTEXT+32                                              01247000
RPLSAV13 EQU   RPLVTEXT+28                                              01248000
RPLUSNSO EQU   RPLOSENS+2                                               01249000
RPLSSMO  EQU   RPLSSNSO+1                                               01250000
@NM00052 EQU   RPLSSEO                                                  01251000
RPLRRO   EQU   RPLSSEO                                                  01252000
RPLFIO   EQU   RPLSSEO                                                  01253000
RPLSTATO EQU   RPLSSEO                                                  01254000
RPLCPMO  EQU   RPLSSEO                                                  01255000
@NM00051 EQU   RPLSSEO                                                  01256000
RPLFMHDR EQU   RPLOPT12                                                 01257000
@NM00050 EQU   RPLOPT12                                                 01258000
@NM00049 EQU   RPLOPT12                                                 01259000
@NM00048 EQU   RPLOPT12                                                 01260000
RPLNIBTK EQU   RPLOPT12                                                 01261000
RPLTRUNC EQU   RPLOPT12                                                 01262000
RPLKEEP  EQU   RPLOPT12                                                 01263000
@NM00047 EQU   RPLOPT12                                                 01264000
RPLRSVE8 EQU   RPLOPT11                                                 01265000
RPLRSVE7 EQU   RPLOPT11                                                 01266000
RPLRSVE6 EQU   RPLOPT11                                                 01267000
RPLRSVE5 EQU   RPLOPT11                                                 01268000
RPLRSVE4 EQU   RPLOPT11                                                 01269000
RPLSTOP  EQU   RPLOPT11                                                 01270000
RPLSTART EQU   RPLOPT11                                                 01271000
RPLQUIES EQU   RPLOPT11                                                 01272000
RPLRSVI6 EQU   RPLOPT10                                                 01273000
RPLRSVI5 EQU   RPLOPT10                                                 01274000
RPLRSVI4 EQU   RPLOPT10                                                 01275000
RPLRSVI3 EQU   RPLOPT10                                                 01276000
RPLTSKY  EQU   RPLOPT10                                                 01277000
RPLSPARM EQU   RPLOPT10                                                 01278000
RPLDSPLY EQU   RPLOPT10                                                 01279000
RPLBSCID EQU   RPLOPT10                                                 01280000
RPLTOPL  EQU   RPLOPT9                                                  01281000
RPLCIDE  EQU   RPLOPT9                                                  01282000
RPLRNNM  EQU   RPLOPT9                                                  01283000
RPLAPPST EQU   RPLOPT9                                                  01284000
RPLCOUNT EQU   RPLOPT9                                                  01285000
RPLTERMS EQU   RPLOPT9                                                  01286000
RPLDEVCH EQU   RPLOPT9                                                  01287000
RPLLOGON EQU   RPLOPT9                                                  01288000
RPLUSFLD EQU   RPLVTEXT+16                                              01289000
RPLESR2  EQU   RPLUSNSI+1                                               01290000
RPLESR1  EQU   RPLUSNSI                                                 01291000
RPLSSMI  EQU   RPLDSB2                                                  01292000
@NM00046 EQU   RPLSSEI                                                  01293000
RPLRRI   EQU   RPLSSEI                                                  01294000
RPLFII   EQU   RPLSSEI                                                  01295000
RPLSTATI EQU   RPLSSEI                                                  01296000
RPLCPMI  EQU   RPLSSEI                                                  01297000
RPLPATHI EQU   RPLSSEI                                                  01298000
RPLARCLN EQU   RPLVTEXT+8                                               01299000
RPLAARLN EQU   RPLVTEXT+4                                               01300000
RPLAAREA EQU   RPLVTEXT                                                 01301000
RPLERMSA EQU   RPLCOMN+72                                               01302000
RPLEMLEN EQU   RPLCOMN+70                                               01303000
RPLACTIV EQU   RPLCOMN+69                                               01304000
RPLBRANC EQU   RPLEXTD1                                                 01305000
RPLTCRYP EQU   RPLEXTD1                                                 01306000
@NM00045 EQU   RPLEXTD1                                                 01307000
RPLEXIT  EQU   RPLEXTD1                                                 01308000
RPLNEXIT EQU   RPLEXTD1                                                 01309000
RPLEXSCH EQU   RPLEXTD1                                                 01310000
RPLDDDD  EQU   RPLRBAR+4                                                01311000
@NM00044 EQU   RPLRBAR+3                                                01312000
@NM00043 EQU   RPLAIXID                                                 01313000
RPLAXPKP EQU   RPLAIXID                                                 01314000
RPLAIXPC EQU   RPLRBAR                                                  01315000
RPLRSV88 EQU   RPLOPT8                                                  01316000
RPLUNCON EQU   RPLOPT8                                                  01317000
RPLACTV  EQU   RPLOPT8                                                  01318000
RPLSESS  EQU   RPLOPT8                                                  01319000
RPLPEND  EQU   RPLOPT8                                                  01320000
RPLODPRM EQU   RPLOPT8                                                  01321000
RPLODACP EQU   RPLOPT8                                                  01322000
RPLODACQ EQU   RPLOPT8                                                  01323000
RPLRSV78 EQU   RPLOPT7                                                  01324000
RPLTCRNO EQU   RPLOPT7                                                  01325000
RPLRLSOP EQU   RPLOPT7                                                  01326000
RPLTPOST EQU   RPLOPT7                                                  01327000
RPLQOPT  EQU   RPLOPT7                                                  01328000
RPLCNIMM EQU   RPLCNOPT                                                 01329000
RPLCNANY EQU   RPLCNOPT                                                 01330000
RPLCNALL EQU   RPLCNOPT                                                 01331000
RPLRSV68 EQU   RPLOPT6                                                  01332000
RPLRSV67 EQU   RPLOPT6                                                  01333000
RPLLOCK  EQU   RPLOPT6                                                  01334000
RPLNCOND EQU   RPLOPT6                                                  01335000
RPLCOND  EQU   RPLOPT6                                                  01336000
RPLEOT   EQU   RPLUNTYP                                                 01337000
RPLEOM   EQU   RPLUNTYP                                                 01338000
RPLEOB   EQU   RPLUNTYP                                                 01339000
RPLWROPT EQU   RPLOPT5                                                  01340000
RPLNODE  EQU   RPLOPT5                                                  01341000
RPLERACE EQU   RPLWRTYP                                                 01342000
RPLEAU   EQU   RPLWRTYP                                                 01343000
RPLNERAS EQU   RPLWRTYP                                                 01344000
RPLPSOPT EQU   RPLOPT5                                                  01345000
@NM00042 EQU   RPLOPT5                                                  01346000
RPLDLGIN EQU   RPLOPT5                                                  01347000
RPLBUFL  EQU   RPLCOMN+52                                               01348000
RPLRLEN  EQU   RPLCOMN+48                                               01349000
RPLCHAIN EQU   RPLNXTRP                                                 01350000
@NM00041 EQU   RPLOPT4                                                  01351000
RPLMKFRM EQU   RPLOPT4                                                  01352000
RPLENDTR EQU   RPLOPT4                                                  01353000
RPLALIGN EQU   RPLOPT3                                                  01354000
RPLFMT   EQU   RPLOPT3                                                  01355000
RPLFLD   EQU   RPLOPT3                                                  01356000
RPLVFY   EQU   RPLOPT3                                                  01357000
RPLBLK   EQU   RPLOPT3                                                  01358000
RPLSFORM EQU   RPLOPT3                                                  01359000
RPLEODS  EQU   RPLOPT3                                                  01360000
RPLNSP   EQU   RPLOPT2                                                  01361000
RPLUPD   EQU   RPLOPT2                                                  01362000
RPLWAITX EQU   RPLOPT2                                                  01363000
RPLLRD   EQU   RPLOPT2                                                  01364000
RPLBWD   EQU   RPLOPT2                                                  01365000
RPLCNV   EQU   RPLOPT2                                                  01366000
RPLADD   EQU   RPLADR                                                   01367000
RPLKEY   EQU   RPLOPT2                                                  01368000
RPLECBIN EQU   RPLECBSW                                                 01369000
RPLGEN   EQU   RPLOPT1                                                  01370000
RPLKGE   EQU   RPLOPT1                                                  01371000
RPLASY   EQU   RPLOPT1                                                  01372000
RPLSKP   EQU   RPLOPT1                                                  01373000
RPLSEQ   EQU   RPLOPT1                                                  01374000
RPLDIR   EQU   RPLOPT1                                                  01375000
RPLLOC   EQU   RPLOPT1                                                  01376000
RPLDAF   EQU   RPLARG+2                                                 01377000
RPLSAF   EQU   RPLARG                                                   01378000
RPLTCBPT EQU   RPLCOMN+28                                               01379000
RPLDACB  EQU   RPLCOMN+24                                               01380000
RPLCCHAR EQU   RPLCOMN+20                                               01381000
RPLSTRID EQU   RPLCOMN+18                                               01382000
RPLKEYL  EQU   RPLKEYLE                                                 01383000
RPLRDSOH EQU   RPLFDB3                                                  01384000
RPLRLG   EQU   RPLFDB3                                                  01385000
RPLLGFRC EQU   RPLFDB3                                                  01386000
RPLREOT  EQU   RPLFDB3                                                  01387000
RPLREOM  EQU   RPLFDB3                                                  01388000
RPLREOB  EQU   RPLFDB3                                                  01389000
RPLSV32  EQU   RPLFDB3                                                  01390000
RPLUINPT EQU   RPLFDB3                                                  01391000
RPLSTSAV EQU   RPLFDB2                                                  01392000
RPLCUERR EQU   RPLFDB2                                                  01393000
RPLDLGFL EQU   RPLFDB2                                                  01394000
RPLIOERR EQU   RPLFDB2                                                  01395000
RPLDVUNS EQU   RPLFDB2                                                  01396000
RPLATND  EQU   RPLFDB2                                                  01397000
RPLRVID  EQU   RPLFDB2                                                  01398000
RPLERLK  EQU   RPLFDB2                                                  01399000
RPLERREG EQU   RPLRTNCD                                                 01400000
RPLSTAT  EQU   RPLFDBWD                                                 01401000
RPLPOST  EQU   RPLECB                                                   01402000
RPLWAIT  EQU   RPLECB                                                   01403000
RPLPLHPT EQU   RPLCOMN+4                                                01404000
RPLLEN2  EQU   RPLLEN                                                   01405000
RPLREQ   EQU   RPLIDWD+2                                                01406000
RPLSTYP  EQU   RPLIDWD+1                                                01407000
RPLID    EQU   RPLIDWD                                                  01408000
WEALTC   EQU   WESTD+75                                                 01409000
WEALTR   EQU   WESTD+74                                                 01410000
WEPRMC   EQU   WESTD+73                                                 01411000
WEPRMR   EQU   WESTD+72                                                 01412000
WEBIND   EQU   WESTD+36                                                 01413000
@NM00040 EQU   WESTD+35                                                 01414000
WERUSZO  EQU   WESTD+34                                                 01415000
WERUSZI  EQU   WESTD+33                                                 01416000
@NM00039 EQU   WETMFLG                                                  01417000
WENOSW   EQU   WETMFLG                                                  01418000
WEFLG1   EQU   WETMFLG                                                  01419000
WETMBF   EQU   WETERM+2                                                 01420000
WESUBT   EQU   WETERM+1                                                 01421000
WETMTP   EQU   WETERM                                                   01422000
WELBUF   EQU   WESTD+24                                                 01423000
WEVRPL   EQU   WESTD+20                                                 01424000
WELEN    EQU   WESTD+10                                                 01425000
WERC2    EQU   WERC+1                                                   01426000
WERC1    EQU   WERC                                                     01427000
WENEXT   EQU   WESTD+4                                                  01428000
WECD2MIF EQU   WECODE2F                                                 01429000
WECD2MAF EQU   WECODE2F                                                 01430000
WECODE2T EQU   WECODE2                                                  01431000
WECDMIF  EQU   WECODE1F                                                 01432000
WECDMAF  EQU   WECODE1F                                                 01433000
WECODE1T EQU   WECODE1                                                  01434000
TWAEND   EQU   TWAR+536                                                 01435000
TWAWORKE EQU   TWAR+524                                                 01436000
@NM00038 EQU   TWACI+13                                                 01437000
TWACSKIP EQU   TWACI+12                                                 01438000
TWACMODQ EQU   TWACI+8                                                  01439000
TWACSTPQ EQU   TWACI+4                                                  01440000
TWACECB  EQU   TWACI                                                    01441000
TWACERRS EQU   TWACE+4                                                  01442000
TWACERA  EQU   TWACEI+1                                                 01443000
TWACEIFC EQU   TWACEI                                                   01444000
TWACRTFC EQU   TWAC+60                                                  01445000
TWACABFC EQU   TWAC+56                                                  01446000
TWACTWA  EQU   TWAC+52                                                  01447000
TWACEWA  EQU   TWAC+4                                                   01448000
TWACID   EQU   TWAC                                                     01449000
TWAUACQH EQU   TWAUI+4                                                  01450000
TWAUECB  EQU   TWAUI                                                    01451000
TWAUERRS EQU   TWAUE+4                                                  01452000
TWAUERA  EQU   TWAUEI+1                                                 01453000
TWAUEIFC EQU   TWAUEI                                                   01454000
TWAURTFC EQU   TWAU+60                                                  01455000
TWAUABFC EQU   TWAU+56                                                  01456000
TWAUTWA  EQU   TWAU+52                                                  01457000
TWAUEWA  EQU   TWAU+4                                                   01458000
TWAUID   EQU   TWAU                                                     01459000
TWAVACQH EQU   TWAVI+12                                                 01460000
TWAVTHQH EQU   TWAVI+8                                                  01461000
TWAVTEQH EQU   TWAVI+4                                                  01462000
TWAVECB  EQU   TWAVI                                                    01463000
TWAVERRS EQU   TWAVE+4                                                  01464000
TWAVERA  EQU   TWAVEI+1                                                 01465000
TWAVEIFC EQU   TWAVEI                                                   01466000
TWAVRTFC EQU   TWAV+60                                                  01467000
TWAVABFC EQU   TWAV+56                                                  01468000
TWAVTWA  EQU   TWAV+52                                                  01469000
TWAVEWA  EQU   TWAV+4                                                   01470000
TWAVID   EQU   TWAV                                                     01471000
TWAMERRS EQU   TWAME+4                                                  01472000
TWAMERA  EQU   TWAMEI+1                                                 01473000
TWAMEIFC EQU   TWAMEI                                                   01474000
TWAMRTFC EQU   TWAM+60                                                  01475000
TWAMABFC EQU   TWAM+56                                                  01476000
TWAMTWA  EQU   TWAM+52                                                  01477000
TWAMEWA  EQU   TWAM+4                                                   01478000
TWAMID   EQU   TWAM                                                     01479000
@NM00037 EQU   TWACFL                                                   01480000
TWACFL4  EQU   TWACFL                                                   01481000
TWACFL2  EQU   TWACFL                                                   01482000
TWACFL1  EQU   TWACFL                                                   01483000
@NM00036 EQU   TWAUFL                                                   01484000
TWAUFL4  EQU   TWAUFL                                                   01485000
TWAUFL3  EQU   TWAUFL                                                   01486000
TWAUFL2  EQU   TWAUFL                                                   01487000
TWAUFL1  EQU   TWAUFL                                                   01488000
@NM00035 EQU   TWAVFL                                                   01489000
TWAVFL6  EQU   TWAVFL                                                   01490000
TWAVFL5  EQU   TWAVFL                                                   01491000
TWAVFL4  EQU   TWAVFL                                                   01492000
TWAVFL3  EQU   TWAVFL                                                   01493000
TWAVFL2  EQU   TWAVFL                                                   01494000
TWAVFL1  EQU   TWAVFL                                                   01495000
@NM00034 EQU   TWAMFL                                                   01496000
TWAMFL1  EQU   TWAMFL                                                   01497000
TWACCOMP EQU   TWAR+76                                                  01498000
TWAUCOMP EQU   TWAR+72                                                  01499000
TWAVCOMP EQU   TWAR+68                                                  01500000
TWAMECB  EQU   TWAR+64                                                  01501000
TWACTCB  EQU   TWAR+60                                                  01502000
TWAUTCB  EQU   TWAR+56                                                  01503000
TWAVTCB  EQU   TWAR+52                                                  01504000
TWADEQAS EQU   TWAR+44                                                  01505000
TWAEESR  EQU   TWAR+40                                                  01506000
TWAPPSR  EQU   TWAR+36                                                  01507000
TWATCSR  EQU   TWAR+32                                                  01508000
TWATTSR  EQU   TWAR+28                                                  01509000
TWAINIT  EQU   TWAR+24                                                  01510000
TWATCAST EQU   TWAR+20                                                  01511000
TWACSCB  EQU   TWAR+16                                                  01512000
TWAASCB  EQU   TWAR+12                                                  01513000
TWAPASQH EQU   TWAR+8                                                   01514000
TWASYNQH EQU   TWAR+4                                                   01515000
TWARSON  EQU   TWAR+2                                                   01516000
TWACOMP  EQU   TWAR                                                     01517000
TCASTEND EQU   TCAST+148                                                01518000
TCASTTYO EQU   TCAST+144                                                01519000
TCAS767O EQU   TCAST+140                                                01520000
TCAS767I EQU   TCAST+136                                                01521000
TCASDUMP EQU   TCAST+132                                                01522000
TCASSCHD EQU   TCAST+128                                                01523000
TCASTPND EQU   TCAST+124                                                01524000
TCASOMJR EQU   TCAST+120                                                01525000
@NM00033 EQU   TCAST+118                                                01526000
TCASATTN EQU   TCAST+112                                                01527000
TCASASCI EQU   TCAST+108                                                01528000
TCASTTQH EQU   TCAST+104                                                01529000
@NM00032 EQU   TCAST+102                                                01530000
@NM00031 EQU   TCAST+100                                                01531000
@NM00030 EQU   TCAST+98                                                 01532000
@NM00029 EQU   TCAST+96                                                 01533000
TCASASCB EQU   TCAST+92                                                 01534000
TCASFLG4 EQU   TCAST+91                                                 01535000
TCASFLG3 EQU   TCAST+90                                                 01536000
TCASFLG2 EQU   TCAST+89                                                 01537000
@NM00028 EQU   TCASFLG1                                                 01538000
TCASNACT EQU   TCASFLG1                                                 01539000
TCASVSD  EQU   TCASFLG1                                                 01540000
TCASABND EQU   TCASFLG1                                                 01541000
TCASMDSW EQU   TCASFLG1                                                 01542000
TCASBKMD EQU   TCASFLG1                                                 01543000
TCASLTE  EQU   TCAST+84                                                 01544000
TCASEXIT EQU   TCAST+80                                                 01545000
TCASOQM  EQU   TCAST+76                                                 01546000
TCASIQM  EQU   TCAST+72                                                 01547000
TCASTSB  EQU   TCAST+68                                                 01548000
TCASTTL  EQU   TCAST+64                                                 01549000
TCASFRR  EQU   TCAST+56                                                 01550000
TCASMSGS EQU   TCAST+52                                                 01551000
TCASDATO EQU   TCAST+48                                                 01552000
TCASDATI EQU   TCAST+44                                                 01553000
TCASXECB EQU   TCAST+40                                                 01554000
TCASTID  EQU   TCAST+32                                                 01555000
@NM00027 EQU   TCAST+31                                                 01556000
TCASCHNL EQU   TCAST+30                                                 01557000
TCASCRSZ EQU   TCAST+28                                                 01558000
TCASLBUF EQU   TCAST+24                                                 01559000
TCASHBUF EQU   TCAST+20                                                 01560000
TCASCLSZ EQU   TCAST+18                                                 01561000
TCASRCON EQU   TCAST+16                                                 01562000
TCASACBP EQU   TCAST+8                                                  01563000
TCASUMAX EQU   TCASUSER+2                                               01564000
TCASUSEC EQU   TCASUSER                                                 01565000
TCASID   EQU   TCAST                                                    01566000
CVTLEVL  EQU   CVTRELNO+2                                               01567000
CVTNUMB  EQU   CVTRELNO                                                 01568000
CVTMDL   EQU   CVTFIX+250                                               01569000
@NM00026 EQU   CVTFIX+248                                               01570000
@NM00025 EQU   CVTFIX                                                   01571000
CVTRV482 EQU   CVTXTNT2+128                                             01572000
CVTRV481 EQU   CVTXTNT2+124                                             01573000
CVTRV480 EQU   CVTXTNT2+120                                             01574000
CVTRV479 EQU   CVTXTNT2+118                                             01575000
CVTRV478 EQU   CVTXTNT2+117                                             01576000
CVTRV477 EQU   CVTXTNT2+116                                             01577000
CVTRV476 EQU   CVTXTNT2+115                                             01578000
CVTRV475 EQU   CVTXTNT2+114                                             01579000
CVTRV474 EQU   CVTRV466                                                 01580000
CVTRV473 EQU   CVTRV466                                                 01581000
CVTRV472 EQU   CVTRV466                                                 01582000
CVTRV471 EQU   CVTRV466                                                 01583000
CVTRV470 EQU   CVTRV466                                                 01584000
CVTRV469 EQU   CVTRV466                                                 01585000
CVTRV468 EQU   CVTRV466                                                 01586000
CVTRV467 EQU   CVTRV466                                                 01587000
CVTRV465 EQU   CVTRV457                                                 01588000
CVTRV464 EQU   CVTRV457                                                 01589000
CVTRV463 EQU   CVTRV457                                                 01590000
CVTRV462 EQU   CVTRV457                                                 01591000
CVTRV461 EQU   CVTRV457                                                 01592000
CVTRV460 EQU   CVTRV457                                                 01593000
CVTRV459 EQU   CVTRV457                                                 01594000
CVTRV458 EQU   CVTRV457                                                 01595000
CVTRV456 EQU   CVTXTNT2+108                                             01596000
CVTRV455 EQU   CVTXTNT2+104                                             01597000
CVTRV454 EQU   CVTXTNT2+100                                             01598000
CVTRV453 EQU   CVTXTNT2+96                                              01599000
CVTRV452 EQU   CVTXTNT2+94                                              01600000
CVTRV451 EQU   CVTXTNT2+92                                              01601000
CVTRV450 EQU   CVTXTNT2+90                                              01602000
CVTRV449 EQU   CVTXTNT2+88                                              01603000
CVTRV448 EQU   CVTXTNT2+87                                              01604000
CVTRV447 EQU   CVTXTNT2+86                                              01605000
CVTRV446 EQU   CVTRV438                                                 01606000
CVTRV445 EQU   CVTRV438                                                 01607000
CVTRV444 EQU   CVTRV438                                                 01608000
CVTRV443 EQU   CVTRV438                                                 01609000
CVTRV442 EQU   CVTRV438                                                 01610000
CVTRV441 EQU   CVTRV438                                                 01611000
CVTRV440 EQU   CVTRV438                                                 01612000
CVTRV439 EQU   CVTRV438                                                 01613000
CVTRV437 EQU   CVTRV429                                                 01614000
CVTRV436 EQU   CVTRV429                                                 01615000
CVTRV435 EQU   CVTRV429                                                 01616000
CVTRV434 EQU   CVTRV429                                                 01617000
CVTRV433 EQU   CVTRV429                                                 01618000
CVTRV432 EQU   CVTRV429                                                 01619000
CVTRV431 EQU   CVTRV429                                                 01620000
CVTRV430 EQU   CVTRV429                                                 01621000
CVTRV428 EQU   CVTXTNT2+80                                              01622000
CVTRV427 EQU   CVTXTNT2+76                                              01623000
CVTRV426 EQU   CVTXTNT2+72                                              01624000
CVTRV425 EQU   CVTXTNT2+68                                              01625000
CVTATACT EQU   CVTATCVT                                                 01626000
CVTRV423 EQU   CVTXTNT2+62                                              01627000
CVTRV422 EQU   CVTXTNT2+60                                              01628000
CVTRV421 EQU   CVTXTNT2+58                                              01629000
CVTRV420 EQU   CVTXTNT2+56                                              01630000
CVTRV419 EQU   CVTXTNT2+55                                              01631000
CVTRV418 EQU   CVTXTNT2+54                                              01632000
CVTRV417 EQU   CVTRV409                                                 01633000
CVTRV416 EQU   CVTRV409                                                 01634000
CVTRV415 EQU   CVTRV409                                                 01635000
CVTRV414 EQU   CVTRV409                                                 01636000
CVTRV413 EQU   CVTRV409                                                 01637000
CVTRV412 EQU   CVTRV409                                                 01638000
CVTRV411 EQU   CVTRV409                                                 01639000
CVTRV410 EQU   CVTRV409                                                 01640000
CVTRV408 EQU   CVTRV400                                                 01641000
CVTRV407 EQU   CVTRV400                                                 01642000
CVTRV406 EQU   CVTRV400                                                 01643000
CVTRV405 EQU   CVTRV400                                                 01644000
CVTRV404 EQU   CVTRV400                                                 01645000
CVTRV403 EQU   CVTRV400                                                 01646000
CVTRV402 EQU   CVTRV400                                                 01647000
CVTRV401 EQU   CVTRV400                                                 01648000
CVTICB   EQU   CVTXTNT2+48                                              01649000
CVTSKTA  EQU   CVTXTNT2+44                                              01650000
CVTCCVT  EQU   CVTXTNT2+40                                              01651000
CVTRSV98 EQU   CVTXTNT2+36                                              01652000
CVTRSV97 EQU   CVTXTNT2+34                                              01653000
CVTRSV96 EQU   CVTXTNT2+32                                              01654000
CVTOLTEP EQU   CVTXTNT2+28                                              01655000
CVTQIDA  EQU   CVTQID+1                                                 01656000
CVTRSV95 EQU   CVTQID                                                   01657000
CVTRSV94 EQU   CVTXTNT2+20                                              01658000
CVTRSV93 EQU   CVTXTNT2+16                                              01659000
CVTRSV92 EQU   CVTXTNT2+12                                              01660000
CVTDEBVR EQU   CVTXTNT2+8                                               01661000
CVTRSV91 EQU   CVTXTNT2+6                                               01662000
CVTRSV9H EQU   CVTFLGBT                                                 01663000
CVTRSV9G EQU   CVTFLGBT                                                 01664000
CVTRSV9F EQU   CVTFLGBT                                                 01665000
CVTRSV9E EQU   CVTFLGBT                                                 01666000
CVTRSV9D EQU   CVTFLGBT                                                 01667000
CVTBAH   EQU   CVTFLGBT                                                 01668000
CVTVME   EQU   CVTFLGBT                                                 01669000
CVTNPE   EQU   CVTFLGBT                                                 01670000
CVTNUCLS EQU   CVTXTNT2+4                                               01671000
CVTDSSVA EQU   CVTDSSV+1                                                01672000
CVTRSV89 EQU   CVTDSSV                                                  01673000
CVTRSV88 EQU   CVTXTNT1+8                                               01674000
CVTRSV87 EQU   CVTXTNT1+4                                               01675000
CVTFACHN EQU   CVTXTNT1                                                 01676000
CVTRV488 EQU   CVTMAP+412                                               01677000
CVTRV487 EQU   CVTMAP+408                                               01678000
CVTRV486 EQU   CVTMAP+404                                               01679000
CVTRV485 EQU   CVTMAP+400                                               01680000
CVTACTAP EQU   CVTMAP+396                                               01681000
CVTAUTH  EQU   CVTMAP+392                                               01682000
CVTRV490 EQU   CVTMAP+388                                               01683000
CVTSU    EQU   CVTMAP+384                                               01684000
CVTVOLT1 EQU   CVTVOLM1+1                                               01685000
CVTVOLI1 EQU   CVTVOLF1                                                 01686000
CVTSTOA  EQU   CVTMAP+376                                               01687000
CVTRSV58 EQU   CVTMAP+374                                               01688000
CVTRSV57 EQU   CVTMAP+372                                               01689000
CVTDDCE  EQU   CVTMAP+368                                               01690000
CVTPNWFR EQU   CVTMAP+364                                               01691000
CVTSMF   EQU   CVTMAP+360                                               01692000
CVTSULK  EQU   CVTMAP+358                                               01693000
CVTSLKO  EQU   CVTSYSK                                                  01694000
CVTSLKP  EQU   CVTSYSK                                                  01695000
CVTSLKQ  EQU   CVTSYSK                                                  01696000
CVTSLKR  EQU   CVTSYSK                                                  01697000
CVTRSV56 EQU   CVTSYSK                                                  01698000
CVTRSV55 EQU   CVTSYSK                                                  01699000
CVTRSV54 EQU   CVTSYSK                                                  01700000
CVTRSV53 EQU   CVTSYSK                                                  01701000
CVTRSV52 EQU   CVTA1F1                                                  01702000
CVTRSV51 EQU   CVTA1F1                                                  01703000
CVTRSV50 EQU   CVTA1F1                                                  01704000
CVTRSV49 EQU   CVTA1F1                                                  01705000
CVTRSV48 EQU   CVTA1F1                                                  01706000
CVTRSV47 EQU   CVTA1F1                                                  01707000
CVTSRSW  EQU   CVTA1F1                                                  01708000
CVTPFSW  EQU   CVTA1F1                                                  01709000
CVTPCVT  EQU   CVTMAP+352                                               01710000
CVTRSV46 EQU   CVTMAP+344                                               01711000
CVTRSV45 EQU   CVTMAP+340                                               01712000
CVTRSV44 EQU   CVTMAP+338                                               01713000
CVTRSV43 EQU   CVTMAP+336                                               01714000
CVTHJESA EQU   CVTHJES+1                                                01715000
CVTRSV42 EQU   CVTHJES                                                  01716000
CVTEXT2A EQU   CVTEXT2+1                                                01717000
CVTRSV41 EQU   CVTEXT2                                                  01718000
CVTAPFA  EQU   CVTAPF+1                                                 01719000
CVTRSV40 EQU   CVTAPF                                                   01720000
CVTRV518 EQU   CVTINTLA                                                 01721000
CVTRV517 EQU   CVTERPV                                                  01722000
CVTEORM  EQU   CVTMAP+312                                               01723000
CVTMCHPR EQU   CVTMAP+308                                               01724000
CVTTZ    EQU   CVTMAP+304                                               01725000
CVTJEPS  EQU   CVTMAP+300                                               01726000
CVTJESCT EQU   CVTMAP+296                                               01727000
CVTMODE  EQU   CVTMAP+292                                               01728000
CVTPTRV  EQU   CVTMAP+288                                               01729000
CVTREAL  EQU   CVTMAP+284                                               01730000
CVTRSV39 EQU   CVTMAP+280                                               01731000
CVTRSV38 EQU   CVTMAP+276                                               01732000
CVTDMSRA EQU   CVTDMSR+1                                                01733000
CVTRV634 EQU   CVTDMSRF                                                 01734000
CVTRV633 EQU   CVTDMSRF                                                 01735000
CVTRV632 EQU   CVTDMSRF                                                 01736000
CVTRV631 EQU   CVTDMSRF                                                 01737000
CVTRV630 EQU   CVTDMSRF                                                 01738000
CVTRV629 EQU   CVTDMSRF                                                 01739000
CVTUDUMP EQU   CVTDMSRF                                                 01740000
CVTSDUMP EQU   CVTDMSRF                                                 01741000
CVTQMSGA EQU   CVTQMSG+1                                                01742000
CVTRSV36 EQU   CVTQMSG                                                  01743000
CVTAMFF  EQU   CVTMAP+264                                               01744000
CVTPURGA EQU   CVTPURG+1                                                01745000
CVTRSV35 EQU   CVTPURG                                                  01746000
CVTCBSP  EQU   CVTMAP+256                                               01747000
CVTATERA EQU   CVTATER+1                                                01748000
CVTSYST  EQU   CVTATER                                                  01749000
CVTVOLT2 EQU   CVTTAT                                                   01750000
CVTVOLI2 EQU   CVTVOLF2                                                 01751000
CVTAQAVB EQU   CVTAQAVT+1                                               01752000
CVTRSV34 EQU   CVTTCMFG                                                 01753000
CVTRSV33 EQU   CVTTCMFG                                                 01754000
CVTRSV32 EQU   CVTTCMFG                                                 01755000
CVTRSV31 EQU   CVTTCMFG                                                 01756000
CVTRSV30 EQU   CVTTCMFG                                                 01757000
CVTRSV29 EQU   CVTTCMFG                                                 01758000
CVTLDEV  EQU   CVTTCMFG                                                 01759000
CVTTCRDY EQU   CVTTCMFG                                                 01760000
CVTGTFA  EQU   CVTGTF+1                                                 01761000
CVTRSV27 EQU   CVTGTFST                                                 01762000
CVTRNIO  EQU   CVTGTFST                                                 01763000
CVTUSR   EQU   CVTGTFST                                                 01764000
CVTRV318 EQU   CVTFORM                                                  01765000
CVTRV317 EQU   CVTTMODE                                                 01766000
CVTRV316 EQU   CVTSTATE                                                 01767000
CVTRV315 EQU   CVTGTFS                                                  01768000
CVTGTFAV EQU   CVTGTFS                                                  01769000
CVT0SCR1 EQU   CVTMAP+232                                               01770000
CVTRV515 EQU   CVTMAP+228                                               01771000
CVTRMS   EQU   CVTMAP+224                                               01772000
CVTPATCH EQU   CVTMAP+220                                               01773000
CVTTSCE  EQU   CVTMAP+216                                               01774000
CVTLNKSC EQU   CVTMAP+214                                               01775000
CVTQABST EQU   CVTMAP+212                                               01776000
CVTMDLDS EQU   CVTMAP+208                                               01777000
CVTUSER  EQU   CVTMAP+204                                               01778000
CVTABEND EQU   CVTMAP+200                                               01779000
CVTSMCA  EQU   CVTMAP+196                                               01780000
CVTRSV18 EQU   CVTMAP+192                                               01781000
CVTQLPAQ EQU   CVTMAP+188                                               01782000
CVTQCDSR EQU   CVTMAP+184                                               01783000
CVTVS1B  EQU   CVTOPTB                                                  01784000
CVTVS1A  EQU   CVTOPTB                                                  01785000
CVTFP    EQU   CVTOPTB                                                  01786000
CVTAPTHR EQU   CVTOPTB                                                  01787000
CVTNLOG  EQU   CVTOPTB                                                  01788000
CVTTOD   EQU   CVTOPTB                                                  01789000
CVTCTIMS EQU   CVTOPTB                                                  01790000
CVTPROT  EQU   CVTOPTB                                                  01791000
CVTXPFP  EQU   CVTOPTA                                                  01792000
CVTASCII EQU   CVTOPTA                                                  01793000
CVTRSV13 EQU   CVTOPTA                                                  01794000
CVTRSV12 EQU   CVTOPTA                                                  01795000
CVTNIP   EQU   CVTOPTA                                                  01796000
CVTDDR   EQU   CVTOPTA                                                  01797000
CVTAPR   EQU   CVTOPTA                                                  01798000
CVTCCH   EQU   CVTOPTA                                                  01799000
CVTSNCTR EQU   CVTMAP+180                                               01800000
CVTQMWR  EQU   CVTMAP+176                                               01801000
CVTQOCR  EQU   CVTMAP+172                                               01802000
CVT1EF00 EQU   CVTMAP+168                                               01803000
CVTMZ00  EQU   CVTMAP+164                                               01804000
CVTHEAD  EQU   CVTMAP+160                                               01805000
CVTRSV11 EQU   CVTMAP+156                                               01806000
CVT0PT01 EQU   CVTMAP+152                                               01807000
CVTMSER  EQU   CVTMAP+148                                               01808000
CVTRV516 EQU   CVTIERLC                                                 01809000
CVTILCH  EQU   CVTMAP+140                                               01810000
CVT0DS   EQU   CVTMAP+136                                               01811000
CVTFBOSV EQU   CVTMAP+132                                               01812000
CVTNUCB  EQU   CVTMAP+128                                               01813000
CVTIXAVL EQU   CVTMAP+124                                               01814000
CVTIOQET EQU   CVTMAP+120                                               01815000
CVTDCBA  EQU   CVTMAP+117                                               01816000
CVTMVS2  EQU   CVTDCB                                                   01817000
CVT6DAT  EQU   CVTDCB                                                   01818000
CVT4MPS  EQU   CVTDCB                                                   01819000
CVTRSV09 EQU   CVTDCB                                                   01820000
CVT4MS1  EQU   CVTDCB                                                   01821000
CVT2SPS  EQU   CVTDCB                                                   01822000
CVT1SSS  EQU   CVTDCB                                                   01823000
CVTRSV08 EQU   CVTDCB                                                   01824000
CVTSTB   EQU   CVTMAP+112                                               01825000
CVTQTD00 EQU   CVTMAP+108                                               01826000
CVTQTE00 EQU   CVTMAP+104                                               01827000
CVTCUCB  EQU   CVTMAP+100                                               01828000
CVTSJQ   EQU   CVTMAP+96                                                01829000
CVTPBLDL EQU   CVTMAP+92                                                01830000
CVTTPC   EQU   CVTMAP+88                                                01831000
CVTSVDCB EQU   CVTMAP+84                                                01832000
CVTBRET  EQU   CVTMAP+82                                                01833000
CVTEXIT  EQU   CVTMAP+80                                                01834000
CVT0FN00 EQU   CVTMAP+76                                                01835000
CVTDARA  EQU   CVTDAR+1                                                 01836000
CVTRSV07 EQU   CVTFLGS1                                                 01837000
CVTRSV06 EQU   CVTFLGS1                                                 01838000
CVTRSV05 EQU   CVTFLGS1                                                 01839000
CVTRSV04 EQU   CVTFLGS1                                                 01840000
CVTRSV03 EQU   CVTFLGS1                                                 01841000
CVTRSV02 EQU   CVTFLGS1                                                 01842000
CVTRSV01 EQU   CVTFLGS1                                                 01843000
CVTDMPLK EQU   CVTFLGS1                                                 01844000
CVTXITP  EQU   CVTMAP+68                                                01845000
CVTZDTAB EQU   CVTMAP+64                                                01846000
CVTMSLT  EQU   CVTMAP+60                                                01847000
CVTDATE  EQU   CVTMAP+56                                                01848000
CVTBTERM EQU   CVTMAP+52                                                01849000
CVTSYSAD EQU   CVTMAP+48                                                01850000
CVTXTLER EQU   CVTMAP+44                                                01851000
CVTILK2  EQU   CVTMAP+40                                                01852000
CVTILK1  EQU   CVTMAP+36                                                01853000
CVTPRLTV EQU   CVTMAP+32                                                01854000
CVTPCNVT EQU   CVTMAP+28                                                01855000
CVT0VL00 EQU   CVTMAP+24                                                01856000
CVTXAPG  EQU   CVTMAP+20                                                01857000
CVTBUF   EQU   CVTMAP+16                                                01858000
CVTJOB   EQU   CVTMAP+12                                                01859000
CVTLINK  EQU   CVTMAP+8                                                 01860000
CVT0EF00 EQU   CVTMAP+4                                                 01861000
CVTTCBP  EQU   CVTMAP                                                   01862000
CVT      EQU   CVTMAP                                                   01863000
@NM00024 EQU   PSA+3668                                                 01864000
PSASTAK  EQU   PSA+3072                                                 01865000
@NM00023 EQU   PSA+1048                                                 01866000
PSAUSEND EQU   PSA+1048                                                 01867000
PSARV062 EQU   PSA+1044                                                 01868000
PSACDAL  EQU   PSA+1040                                                 01869000
PSAWTCOD EQU   PSA+1036                                                 01870000
PSAATCVT EQU   PSA+1032                                                 01871000
PSAPCPSW EQU   PSA+1024                                                 01872000
PSAPIR2  EQU   PSA+1020                                                 01873000
PSARV059 EQU   PSA+1018                                                 01874000
PSASVC13 EQU   PSA+1016                                                 01875000
PSALSFCC EQU   PSA+1012                                                 01876000
PSASFACC EQU   PSA+1008                                                 01877000
PSASTOP  EQU   PSA+992                                                  01878000
PSASTART EQU   PSA+976                                                  01879000
PSARSPSW EQU   PSA+968                                                  01880000
PSASRPSW EQU   PSA+960                                                  01881000
PSARV045 EQU   PSA+892                                                  01882000
PSARV044 EQU   PSA+888                                                  01883000
PSARV043 EQU   PSA+884                                                  01884000
PSARV042 EQU   PSA+880                                                  01885000
PSARV041 EQU   PSA+876                                                  01886000
PSARV040 EQU   PSA+872                                                  01887000
PSARV025 EQU   PSA+868                                                  01888000
PSADSSED EQU   PSA+868                                                  01889000
PSADSSPR EQU   PSA+864                                                  01890000
PSADSSFW EQU   PSA+860                                                  01891000
PSADSS14 EQU   PSA+856                                                  01892000
PSADSSPP EQU   PSA+848                                                  01893000
PSADSSRP EQU   PSA+840                                                  01894000
PSADSS05 EQU   PSADSSF4                                                 01895000
PSADSS10 EQU   PSADSSF4                                                 01896000
PSADSSVE EQU   PSADSSF4                                                 01897000
PSADSSDE EQU   PSADSSF4                                                 01898000
PSADSSC0 EQU   PSADSSF4                                                 01899000
PSADSSIE EQU   PSADSSF4                                                 01900000
PSADSS12 EQU   PSADSSF4                                                 01901000
PSADSSRC EQU   PSADSSF4                                                 01902000
PSARV057 EQU   PSADSSF3                                                 01903000
PSARV056 EQU   PSADSSF3                                                 01904000
PSARV055 EQU   PSADSSF3                                                 01905000
PSADSSMC EQU   PSADSSF3                                                 01906000
PSADSSRW EQU   PSADSSF3                                                 01907000
PSADSSNM EQU   PSADSSF3                                                 01908000
PSADSSES EQU   PSADSSF3                                                 01909000
PSADSSGP EQU   PSADSSF3                                                 01910000
PSADSSF2 EQU   PSADSSFL+1                                               01911000
PSADSSPI EQU   PSADSSF1                                                 01912000
PSADSSOI EQU   PSADSSF1                                                 01913000
PSADSSSP EQU   PSADSSF1                                                 01914000
PSADSSTP EQU   PSADSSF1                                                 01915000
PSADSSDW EQU   PSADSSF1                                                 01916000
PSADSSDD EQU   PSADSSF1                                                 01917000
PSADSSDM EQU   PSADSSF1                                                 01918000
PSADSSMV EQU   PSADSSF1                                                 01919000
PSADSSTS EQU   PSA+816                                                  01920000
PSADSSWK EQU   PSA+812                                                  01921000
PSADSSR3 EQU   PSA+808                                                  01922000
PSADSSR2 EQU   PSA+804                                                  01923000
PSADSSRS EQU   PSA+800                                                  01924000
PSASTOR  EQU   PSA+796                                                  01925000
PSACPUSA EQU   PSA+794                                                  01926000
PSAVSTAP EQU   PSA+792                                                  01927000
PSAWKVAP EQU   PSA+788                                                  01928000
PSAWKRAP EQU   PSA+784                                                  01929000
PSAMCHIC EQU   PSA+783                                                  01930000
PSARV061 EQU   PSA+782                                                  01931000
PSASYMSK EQU   PSA+781                                                  01932000
PSAMCHFL EQU   PSA+780                                                  01933000
PSACR0   EQU   PSA+776                                                  01934000
PSAPSWSV EQU   PSA+768                                                  01935000
PSALITA  EQU   PSA+764                                                  01936000
PSACLHS  EQU   PSAHLHI                                                  01937000
PSALKR15 EQU   PSALKSA+60                                               01938000
PSALKR14 EQU   PSALKSA+56                                               01939000
PSALKR13 EQU   PSALKSA+52                                               01940000
PSALKR12 EQU   PSALKSA+48                                               01941000
PSALKR11 EQU   PSALKSA+44                                               01942000
PSALKR10 EQU   PSALKSA+40                                               01943000
PSALKR9  EQU   PSALKSA+36                                               01944000
PSALKR8  EQU   PSALKSA+32                                               01945000
PSALKR7  EQU   PSALKSA+28                                               01946000
PSALKR6  EQU   PSALKSA+24                                               01947000
PSALKR5  EQU   PSALKSA+20                                               01948000
PSALKR4  EQU   PSALKSA+16                                               01949000
PSALKR3  EQU   PSALKSA+12                                               01950000
PSALKR2  EQU   PSALKSA+8                                                01951000
PSALKR1  EQU   PSALKSA+4                                                01952000
PSALKR0  EQU   PSALKSA                                                  01953000
PSARV023 EQU   PSACLHT+52                                               01954000
PSALOCAL EQU   PSACLHT+48                                               01955000
PSACMSL  EQU   PSACLHT+44                                               01956000
PSAOPTL  EQU   PSACLHT+40                                               01957000
PSATPACL EQU   PSACLHT+36                                               01958000
PSATPDNL EQU   PSACLHT+32                                               01959000
PSATPNCL EQU   PSACLHT+28                                               01960000
PSAIOSLL EQU   PSACLHT+24                                               01961000
PSAIOSUL EQU   PSACLHT+20                                               01962000
PSAIOSCL EQU   PSACLHT+16                                               01963000
PSAIOSSL EQU   PSACLHT+12                                               01964000
PSASALCL EQU   PSACLHT+8                                                01965000
PSAASML  EQU   PSACLHT+4                                                01966000
PSADISPL EQU   PSACLHT                                                  01967000
PSASRSA  EQU   PSA+636                                                  01968000
PSARV050 EQU   PSA+634                                                  01969000
PSADSSGO EQU   PSA+633                                                  01970000
PSARECUR EQU   PSA+632                                                  01971000
PSAHLHIS EQU   PSA+628                                                  01972000
PSAIPCSA EQU   PSA+624                                                  01973000
@NM00022 EQU   PSA+621                                                  01974000
PSAIPCDM EQU   PSA+620                                                  01975000
PSAIPCD  EQU   PSA+616                                                  01976000
@NM00021 EQU   PSA+613                                                  01977000
PSAIPCRM EQU   PSA+612                                                  01978000
PSAIPCR  EQU   PSA+608                                                  01979000
PSAMCHEX EQU   PSA+600                                                  01980000
PSAMPSW  EQU   PSA+592                                                  01981000
PSAEXPS2 EQU   PSA+584                                                  01982000
PSAEXPS1 EQU   PSA+576                                                  01983000
PSAPIREG EQU   PSA+572                                                  01984000
PSARSREG EQU   PSA+568                                                  01985000
PSAGPREG EQU   PSA+556                                                  01986000
PSARV022 EQU   PSASUP4                                                  01987000
PSARV021 EQU   PSASUP4                                                  01988000
PSARV020 EQU   PSASUP4                                                  01989000
PSARV019 EQU   PSASUP4                                                  01990000
PSARV018 EQU   PSASUP4                                                  01991000
PSARV017 EQU   PSASUP4                                                  01992000
PSARV016 EQU   PSASUP4                                                  01993000
PSARV015 EQU   PSASUP4                                                  01994000
PSARV014 EQU   PSASUP3                                                  01995000
PSARV013 EQU   PSASUP3                                                  01996000
PSARV012 EQU   PSASUP3                                                  01997000
PSARV011 EQU   PSASUP3                                                  01998000
PSASPR   EQU   PSASUP3                                                  01999000
PSAPSREG EQU   PSASUP3                                                  02000000
PSAPI2   EQU   PSASUP3                                                  02001000
PSAIOSUP EQU   PSASUP3                                                  02002000
PSALCR   EQU   PSASUP2                                                  02003000
PSARTM   EQU   PSASUP2                                                  02004000
PSAACR   EQU   PSASUP2                                                  02005000
PSAIPCE2 EQU   PSASUP2                                                  02006000
PSAIPCES EQU   PSASUP2                                                  02007000
PSAIPCEC EQU   PSASUP2                                                  02008000
PSAGTF   EQU   PSASUP2                                                  02009000
PSAIPCRI EQU   PSASUP2                                                  02010000
PSARV063 EQU   PSASUP1                                                  02011000
PSATCTL  EQU   PSASUP1                                                  02012000
PSADISP  EQU   PSASUP1                                                  02013000
PSALOCK  EQU   PSASUP1                                                  02014000
PSAPI    EQU   PSASUP1                                                  02015000
PSAEXT   EQU   PSASUP1                                                  02016000
PSASVC   EQU   PSASUP1                                                  02017000
PSAIO    EQU   PSASUP1                                                  02018000
PSAAOLD  EQU   PSA+548                                                  02019000
PSAANEW  EQU   PSA+544                                                  02020000
PSATOLD  EQU   PSA+540                                                  02021000
PSATNEW  EQU   PSA+536                                                  02022000
PSALCCAR EQU   PSA+532                                                  02023000
PSALCCAV EQU   PSA+528                                                  02024000
PSAPCCAR EQU   PSA+524                                                  02025000
PSAPCCAV EQU   PSA+520                                                  02026000
PSACPULA EQU   PSA+518                                                  02027000
PSACPUPA EQU   PSA+516                                                  02028000
PSAPSA   EQU   PSA+512                                                  02029000
FLCHDEND EQU   PSA+512                                                  02030000
FLCCRSAV EQU   FLCMCLA+280                                              02031000
FLCGRSAV EQU   FLCMCLA+216                                              02032000
FLCFPSAV EQU   FLCMCLA+184                                              02033000
FLCFLA   EQU   FLCMCLA+88                                               02034000
FLCRGNCD EQU   FLCMCLA+84                                               02035000
FLCFSAA  EQU   FLCFSA+1                                                 02036000
@NM00020 EQU   FLCFSA                                                   02037000
@NM00019 EQU   FLCMCLA+72                                               02038000
FLCMCIC  EQU   FLCMCLA+64                                               02039000
@NM00018 EQU   FLCMCLA+20                                               02040000
FLCIOAA  EQU   FLCIOA+1                                                 02041000
@NM00017 EQU   FLCIOA                                                   02042000
@NM00016 EQU   FLCMCLA+15                                               02043000
@NM00015 EQU   FLCMCLA+14                                               02044000
@NM00014 EQU   FLCMCLA+12                                               02045000
FLCLCL   EQU   FLCMCLA+8                                                02046000
FLCIOELA EQU   FLCIOEL+1                                                02047000
@NM00013 EQU   FLCIOEL                                                  02048000
FLCCHNID EQU   FLCMCLA                                                  02049000
@NM00012 EQU   PSA+160                                                  02050000
FLCMTRCD EQU   PSA+157                                                  02051000
@NM00011 EQU   PSA+156                                                  02052000
FLCPERA  EQU   FLCPER+1                                                 02053000
@NM00010 EQU   FLCPER                                                   02054000
@NM00009 EQU   PSA+151                                                  02055000
FLCPERCD EQU   PSA+150                                                  02056000
FLCMCNUM EQU   PSA+149                                                  02057000
@NM00008 EQU   PSA+148                                                  02058000
FLCTEAA  EQU   FLCTEA+1                                                 02059000
@NM00007 EQU   FLCTEA                                                   02060000
PSAPIPC  EQU   PSAPICOD                                                 02061000
PSAPIMC  EQU   PSAPICOD                                                 02062000
PSAPIPER EQU   PSAPICOD                                                 02063000
PSARV049 EQU   FLCPICOD                                                 02064000
FLCPILCB EQU   FLCPIILC                                                 02065000
@NM00006 EQU   FLCPIILC                                                 02066000
@NM00005 EQU   PSAEPPSW                                                 02067000
FLCSVCN  EQU   PSAESPSW+2                                               02068000
FLCSILCB EQU   FLCSVILC                                                 02069000
@NM00004 EQU   FLCSVILC                                                 02070000
@NM00003 EQU   PSAESPSW                                                 02071000
FLCEICOD EQU   PSAEEPSW+2                                               02072000
PSASPAD  EQU   PSAEEPSW                                                 02073000
@NM00002 EQU   PSA+128                                                  02074000
FLCINPSW EQU   PSA+120                                                  02075000
FLCMNPSW EQU   PSA+112                                                  02076000
FLCPNPSW EQU   PSA+104                                                  02077000
FLCSNPSW EQU   PSA+96                                                   02078000
FLCENPSW EQU   PSA+88                                                   02079000
FLCTRACE EQU   PSA+84                                                   02080000
FLCTIMER EQU   PSA+80                                                   02081000
FLCCVT2  EQU   PSA+76                                                   02082000
FLCCAW   EQU   PSA+72                                                   02083000
FLCCSW   EQU   PSA+64                                                   02084000
FLCIOPSW EQU   PSA+56                                                   02085000
FLCMOPSW EQU   PSA+48                                                   02086000
FLCPOPSW EQU   PSA+40                                                   02087000
FLCSOPSW EQU   PSA+32                                                   02088000
FLCEOPSW EQU   PSA+24                                                   02089000
@NM00001 EQU   FLCICCW2+4                                               02090000
FLCICCW1 EQU   FLCROPSW                                                 02091000
FLCIPPSW EQU   FLCRNPSW                                                 02092000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02093000
@RC00147 EQU   #BCM0005                                                 02094000
@RT00155 EQU   #BCM0005                                                 02095000
@RC00198 EQU   @RC00195                                                 02096000
@RF00215 EQU   @EL00002                                                 02097000
@ENDDATA EQU   *                                                        02098000
         END   IKTCASCX,(C'PLS1058',0702,79137)                         02099000
