         TITLE '***IKTIOFRR:  I/O FUNCTIONAL RECOVERY ROUTINE***'       00001000
IKTIOFRR CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'IKTIOFRR  79.216'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @09,0                                            01S0001 00009000
@PSTART  DS    0H                                               01S0001 00010000
         USING @PSTART,@09                                      01S0001 00011000
*   SAVEA=REG14;                    /* SAVE RETURN ADDRESS   @ZA35161*/ 00012000
         LR    SAVEA,REG14                                      01S0072 00013000
*   IF REG0=12 THEN                 /*                       @ZM42927*/ 00014000
         C     REG0,@CF01018                                    01S0073 00015000
         BE    @RT00073                                         01S0073 00016000
*     RETURN;                       /*                       @ZM42927*/ 00017000
*   RFY                                                         01S0075 00018000
*    (REG0,                                                     01S0075 00019000
*     REG14) UNRSTD;                /* FREE REGISTERS        @ZM44016*/ 00020000
*   RFY                                                         01S0076 00021000
*     INFODSCT BASED(FRPCKINF);     /* BASE INFORMATION ON CHECK        00022000
*                                      POINT                 @ZM20856*/ 00023000
*   REG13=SAVEREGS(53:56);          /* RESTORE REGISTER 13   @ZM20856*/ 00024000
         L     @08,SDWAPARM(,SDWAPTR)                           01S0077 00025000
         L     @08,FRPCKINF(,@08)                               01S0077 00026000
         L     @08,INFOREGS(,@08)                               01S0077 00027000
         ICM   REG13,15,SAVEREGS+52(@08)                        01S0077 00028000
*   IF TVWAFRRR='0'B THEN           /* FRR IS NOT RECURSING  @ZA34957*/ 00029000
         L     @12,PSAAOLD                                      01S0078 00030000
         L     @12,ASCBTSB(,@12)                                01S0078 00031000
         L     @12,TSBEXTNT(,@12)                               01S0078 00032000
         L     @12,TSBXTVWA(,@12)                               01S0078 00033000
         TM    TVWAFRRR(@12),B'00000001'                        01S0078 00034000
         BNZ   @RF00078                                         01S0078 00035000
*     CALL DOCUMENT;                /* COLLECT INFORMATION   @ZM20856*/ 00036000
*                                                               01S0079 00037000
         BAL   @14,DOCUMENT                                     01S0079 00038000
*   /*****************************************************************/ 00039000
*   /*                                                               */ 00040000
*   /* IF PERCOLATION ,NOT SRB MODE,RPL POINTER ZERO OR VTAM         */ 00041000
*   /* INDICATES TASK IN TERMINATION THEN CONTINUE WITH TERMINATION. */ 00042000
*   /* OTHER SITUATIONS WILL BE RETRIED.                             */ 00043000
*   /*                                                               */ 00044000
*   /*****************************************************************/ 00045000
*                                                               01S0080 00046000
*   IF SDWAPERC='1'B|TSBDISC='1'B|SDWASRBM^='1'B|SDWASTAF='1'B|FRPRPLAD 00047000
*       =0|TVWAFRRR='1'B|(RPLRTNCD='14'X&RPLFDB2='10'X) THEN/* CHECK    00048000
*                                      CONTINUE WITH TERMINATION        00049000
*                                      CONDITIONS            @ZA34957*/ 00050000
@RF00078 TM    SDWAPERC(SDWAPTR),B'00010000'                    01S0080 00051000
         BO    @RT00080                                         01S0080 00052000
         L     @12,PSAAOLD                                      01S0080 00053000
         L     @12,ASCBTSB(,@12)                                01S0080 00054000
         TM    TSBDISC(@12),B'00000100'                         01S0080 00055000
         BO    @RT00080                                         01S0080 00056000
         TM    SDWASRBM(SDWAPTR),B'00000001'                    01S0080 00057000
         BNO   @RT00080                                         01S0080 00058000
         TM    SDWASTAF(SDWAPTR),B'10000000'                    01S0080 00059000
         BO    @RT00080                                         01S0080 00060000
         L     @08,SDWAPARM(,SDWAPTR)                           01S0080 00061000
         L     @08,FRPRPLAD(,@08)                               01S0080 00062000
         LTR   @08,@08                                          01S0080 00063000
         BZ    @RT00080                                         01S0080 00064000
         L     @12,TSBEXTNT(,@12)                               01S0080 00065000
         L     @12,TSBXTVWA(,@12)                               01S0080 00066000
         TM    TVWAFRRR(@12),B'00000001'                        01S0080 00067000
         BO    @RT00080                                         01S0080 00068000
         CLI   RPLRTNCD(@08),20                                 01S0080 00069000
         BNE   @RF00080                                         01S0080 00070000
         CLI   RPLFDB2(@08),16                                  01S0080 00071000
         BNE   @RF00080                                         01S0080 00072000
@RT00080 DS    0H                                               01S0081 00073000
*     SDWARCDE=SDWACWT;             /* CONTINUE WITH TERMINATION     */ 00074000
         MVI   SDWARCDE(SDWAPTR),X'00'                          01S0081 00075000
*   ELSE                            /* NOT PERCOLATION - NOT ABEND   */ 00076000
*     CALL RETRY;                   /*                       @ZM20856*/ 00077000
         B     @RC00080                                         01S0082 00078000
@RF00080 BAL   @14,RETRY                                        01S0082 00079000
*   IF SDWARCDE=SDWACWT THEN        /* CONTINUE WITH TERMINATION?    */ 00080000
@RC00080 CLI   SDWARCDE(SDWAPTR),0                              01S0083 00081000
         BNE   @RF00083                                         01S0083 00082000
*     DO;                           /* BEGIN TERMINATION PROCESSING  */ 00083000
*       SDWARCDE=SDWACWT;           /* SET RETURN CODE TO CONTINUE      00084000
*                                      TERMINATION           @ZM20856*/ 00085000
         MVI   SDWARCDE(SDWAPTR),X'00'                          01S0085 00086000
*       SDWAFLLK='1'B;              /* FREE LOCAL LOCK               */ 00087000
         OI    SDWAFLLK(SDWAPTR),B'00000001'                    01S0086 00088000
*       SDWASALL='1'B;              /* FREE SALLOC                   */ 00089000
         OI    SDWASALL(SDWAPTR),B'00000100'                    01S0087 00090000
*       CALL CALLRTM;                                           01S0088 00091000
         BAL   @14,CALLRTM                                      01S0088 00092000
*     END;                          /* END CONTINUE WITH     @ZM20856   00093000
*                                      TERMINATION           @ZM20856*/ 00094000
*   ELSE                            /* RETRY                         */ 00095000
*     DO;                           /*                       @ZM20856*/ 00096000
         B     @RC00083                                         01S0090 00097000
@RF00083 DS    0H                                               01S0091 00098000
*       GEN REFS(PSALITA,FLC) SETS(REG0,REG1,REG14,REG15);      01S0091 00099000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,RELATED=(RETRY),        *00100000
               REGS=USE       GET LOCAL LOCK FOR RETRY       @ZM20856   00101000
*     END;                          /*                       @ZM20856*/ 00102000
*   RFY                                                         01S0093 00103000
*     REG14 RSTD;                   /* RESTRICT RETURN REGISTER      */ 00104000
@RC00083 DS    0H                                               01S0094 00105000
*   REG14=SAVEA;                    /* RESTORE RETURN ADDRESS   01S0094 00106000
*                                                            @ZA35161*/ 00107000
         LR    REG14,SAVEA                                      01S0094 00108000
*   RETURN;                         /* RETURN TO CALLER      @ZM42927*/ 00109000
@EL00001 DS    0H                                               01S0095 00110000
@EF00001 DS    0H                                               01S0095 00111000
@ER00001 BR    @14                                              01S0095 00112000
*   RFY                                                         01S0096 00113000
*     REG14 UNRSTD;                 /* FREE UP REGISTER              */ 00114000
*                                                               01S0097 00115000
*   /*****************************************************************/ 00116000
*   /*                                                               */ 00117000
*   /* END OF MAINLINE PROCESSING                                    */ 00118000
*   /*                                                               */ 00119000
*   /*****************************************************************/ 00120000
*                                                               01S0097 00121000
         EJECT                                                          00122000
*                                                               01S0097 00123000
*/********************************************************************/ 00124000
*/*                                                                  */ 00125000
*/* SUBROUTINE-                                                      */ 00126000
*/*      DOCUMENT                                                    */ 00127000
*/*                                                                  */ 00128000
*/* FUNCTION-                                                        */ 00129000
*/*      INITIALIZE THE VARIABLE RECORDING AREA WITH THE CURRENT     */ 00130000
*/*      INFORMATION AVAILABLE.  IDENTIFY THE ABENDING LOAD          */ 00131000
*/*      MODULE, CSECT, AND FRR.                                     */ 00132000
*/*                                                                  */ 00133000
*/********************************************************************/ 00134000
*                                                               01S0097 00135000
*DOCUMENT:                                                      01S0097 00136000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/*                  @ZM20856*/ 00137000
DOCUMENT DS    0H                                               01S0098 00138000
*   RFY                                                         01S0098 00139000
*    (SAVEC,                                                    01S0098 00140000
*     REG14) RSTD;                  /* RESTRICT RETURN REGISTER 01S0098 00141000
*                                                            @ZM44016*/ 00142000
*   SAVEC=REG14;                    /* SAVE RETURN ADDRESS   @ZM44016*/ 00143000
         LR    SAVEC,REG14                                      01S0099 00144000
*   RFY                                                         01S0100 00145000
*     REG14 UNRSTD;                 /* FREE UP RETURN REGISTER  01S0100 00146000
*                                                            @ZM44016*/ 00147000
*   IKTDOCTV(3:LENGTH(IKTDOCTV))=   /* ZERO AREA AND LEAVE   @ZM20856*/ 00148000
*       IKTDOCTV(3:LENGTH(IKTDOCTV))&&/* THE LENGTH VECTOR   @ZM20856*/ 00149000
*       IKTDOCTV(3:LENGTH(IKTDOCTV));/* AS THEY ARE          @ZM20856*/ 00150000
         L     @12,SDWARECA(,SDWAPTR)                           01S0101 00151000
         XC    IKTDOCTV+2(86,@12),IKTDOCTV+2(@12)               01S0101 00152000
*   SDWAURAL=LENGTH(IKTDOCTV);      /* INITIALIZE USED LENGTH@ZM21451*/ 00153000
         MVI   SDWAURAL(SDWAPTR),X'58'                          01S0102 00154000
*   SDWARCRD='1'B;                  /* INDICATE TO RECORD ERROR 01S0103 00155000
*                                      CONDITIONS            @ZM20856*/ 00156000
         OI    SDWARCRD(SDWAPTR),B'10000000'                    01S0103 00157000
*   SDWAHEX='1'B;                   /* INDICATE TO DUMP AREA IN HEX     00158000
*                                                            @ZM20856*/ 00159000
         OI    SDWAHEX(SDWAPTR),B'10000000'                     01S0104 00160000
*   SDWAMODN=LMODNAME;              /* INITIALIZE LOAD MODULE   01S0105 00161000
*                                      IDENTIFIER            @ZM20856*/ 00162000
         L     @12,SDWAPARM(,SDWAPTR)                           01S0105 00163000
         L     @12,FRPCONST(,@12)                               01S0105 00164000
         MVC   SDWAMODN(8,SDWAPTR),LMODNAME(@12)                01S0105 00165000
*   SDWAREXN=FRRNAME;               /* INITIALIZE FRR CSECT     01S0106 00166000
*                                      IDENTIFIER            @ZM20856*/ 00167000
         MVC   SDWAREXN(8,SDWAPTR),FRRNAME(@12)                 01S0106 00168000
*   SDWACSCT=MODNAME;               /* INITIALIZE I/O MNGR IDENTIFIER   00169000
*                                                            @ZM20856*/ 00170000
         MVC   SDWACSCT(8,SDWAPTR),MODNAME(@12)                 01S0107 00171000
*   RFY                                                         01S0108 00172000
*    (REG2,                                                     01S0108 00173000
*     REG3,                                                     01S0108 00174000
*     REG5) RSTD;                   /* RESTRICT REGISTER 5 AND 3        00175000
*                                                            @ZM20856*/ 00176000
*   TVWAFRRR='1'B;                  /* FRR RECURSION FLAG    @ZA34957*/ 00177000
         L     @12,PSAAOLD                                      01S0109 00178000
         L     @12,ASCBTSB(,@12)                                01S0109 00179000
         L     @12,TSBEXTNT(,@12)                               01S0109 00180000
         L     @12,TSBXTVWA(,@12)                               01S0109 00181000
         OI    TVWAFRRR(@12),B'00000001'                        01S0109 00182000
*   REG5=ADDR(IKTIOFRR);            /* SET ADDRESS OF FRR ENTRY 01S0110 00183000
*                                      ROUTINE               @ZA34957*/ 00184000
         L     REG5,@CA00028                                    01S0110 00185000
*/********************************************************************/ 00186000
*/*   SET FRR TO PROTECT THE DOCUMENTATION PROCESS                   */ 00187000
*/********************************************************************/ 00188000
*                                                               01S0111 00189000
*   GEN CODE REFS(FRRSCURR,FRRS,FRRSLAST,PSALSFCC,PSA,/*     @ZM20856*/ 00190000
*       FRRSELEN,PSACSTK,FRRSFRRA,FRRSENTR,FRRSPARM,/*       @ZM20856*/ 00191000
*       REG5) SETS(REG2,REG3,REG4);                             01S0111 00192000
*                                                          /*@ZM20856*/ 00193000
         SETFRR A,FRRAD=(REG5),WRKREGS=(REG2,REG3),                    *00194000
               PARMAD=(REG3)                                            00195000
*   REG3->REASON=REASON;            /* INITIALIZE REASON CODE IN NEW    00196000
*                                      FRR PARM AREA         @ZM20856*/ 00197000
         L     @12,SDWAPARM(,SDWAPTR)                           01S0112 00198000
         L     @04,FRPCONST(,@12)                               01S0112 00199000
         L     @04,REASON(,@04)                                 01S0112 00200000
         ST    @04,REASON(,REG3)                                01S0112 00201000
*   RFY                                                         01S0113 00202000
*     REG5 UNRSTD;                  /* UNRESTRICT REG5       @ZM20856*/ 00203000
*   RFY                                                         01S0114 00204000
*     INFODSCT BASED(FRPCKINF);     /* BASE INFORMATION DSECT ON        00205000
*                                      ADDRESS OF CHECK POINT   01S0114 00206000
*                                      INFORMATION           @ZM20856*/ 00207000
*   DOCCKREG=SAVEREGS;              /* INITIALIZE CHECK POINT REGS IN   00208000
*                                      RECORDING AREA        @ZM20856*/ 00209000
         L     @15,SDWARECA(,SDWAPTR)                           01S0115 00210000
         L     @14,FRPCKINF(,@12)                               01S0115 00211000
         L     @11,INFOREGS(,@14)                               01S0115 00212000
         MVC   DOCCKREG(64,@15),SAVEREGS(@11)                   01S0115 00213000
*   DOCCKADD=INFOADDR;              /* INITIALIZE CHECK POINT ADDRESS   00214000
*                                                            @ZM20856*/ 00215000
         L     @00,INFOADDR(,@14)                               01S0116 00216000
         ST    @00,DOCCKADD(,@15)                               01S0116 00217000
*   DOCTRMID=TSBTRMID;              /* MOVE TERMINAL ID      @ZM20856*/ 00218000
         L     @14,PSAAOLD                                      01S0117 00219000
         L     @14,ASCBTSB(,@14)                                01S0117 00220000
         MVC   DOCTRMID(8,@15),TSBTRMID(@14)                    01S0117 00221000
*   DOCFLG1=FRPFRFLG;               /* INDICATE I/O MNGR TYPE@ZM20856*/ 00222000
         MVC   DOCFLG1(1,@15),FRPFRFLG(@12)                     01S0118 00223000
*   DOCOPTCD=RPLREQ;                /* SET OPERATION CODE    @ZM20856*/ 00224000
         L     @12,FRPRPLAD(,@12)                               01S0119 00225000
         IC    @00,RPLREQ(,@12)                                 01S0119 00226000
         STC   @00,DOCOPTCD(,@15)                               01S0119 00227000
*   DOCRTNCD=RPLRTNCD;              /* SET RETURN CODE       @ZM20856*/ 00228000
         IC    @00,RPLRTNCD(,@12)                               01S0120 00229000
         STC   @00,DOCRTNCD(,@15)                               01S0120 00230000
*   DOCFDBK=RPLFDB2;                /* SET REASON CODE       @ZM20856*/ 00231000
         IC    @00,RPLFDB2(,@12)                                01S0121 00232000
         STC   @00,DOCFDBK(,@15)                                01S0121 00233000
*   DOCFDBK2=RPLFDBK2;              /* SET SENSE INFORMATION @ZM20856*/ 00234000
         MVC   DOCFDBK2(4,@15),RPLFDBK2(@12)                    01S0122 00235000
*/********************************************************************/ 00236000
*/*   RELEASE FRR PROTECTION                                         */ 00237000
*/********************************************************************/ 00238000
*                                                               01S0123 00239000
*   GEN CODE REFS(PSACSTK,PSA,FRRSCURR,FRRS,FRRSEMP,FRRSELEN)/* 01S0123 00240000
*                                                            @ZM20856*/ 00241000
*       SETS(REG2,REG3);                                        01S0123 00242000
*                                   /* DELETE FRR FROM STACK @ZM20856*/ 00243000
         SETFRR D,WRKREGS=(REG2,REG3)                        @ZM20856   00244000
*   TVWAFRRR='0'B;                  /* CLEAR RECURSION FLAG  @ZA34957*/ 00245000
         L     @12,PSAAOLD                                      01S0124 00246000
         L     @12,ASCBTSB(,@12)                                01S0124 00247000
         L     @12,TSBEXTNT(,@12)                               01S0124 00248000
         L     @12,TSBXTVWA(,@12)                               01S0124 00249000
         NI    TVWAFRRR(@12),B'11111110'                        01S0124 00250000
*   RFY                                                         01S0125 00251000
*    (REG2,                                                     01S0125 00252000
*     REG3) UNRSTD;                 /* FREE UP REGISTER              */ 00253000
*   RFY                                                         01S0126 00254000
*     REG14 RSTD;                   /* RESTRICT RETURN REGISTER 01S0126 00255000
*                                                            @ZM44016*/ 00256000
*   REG14=SAVEC;                    /* RESTORE RETURN ADDRESS   01S0127 00257000
*                                                            @ZM44016*/ 00258000
         LR    REG14,SAVEC                                      01S0127 00259000
*   RFY                                                         01S0128 00260000
*    (SAVEC,                                                    01S0128 00261000
*     REG14) UNRSTD;                /* FREE UP RETURN REGISTER  01S0128 00262000
*                                                            @ZM44016*/ 00263000
*   END DOCUMENT;                   /* END OF DOCUMENT       @ZM20856*/ 00264000
@EL00002 DS    0H                                               01S0129 00265000
@EF00002 DS    0H                                               01S0129 00266000
@ER00002 BR    @14                                              01S0129 00267000
*/********************************************************************/ 00268000
*/* END OF SUBROUTINE DOCUMENT                                       */ 00269000
*/********************************************************************/ 00270000
*                                                               01S0130 00271000
         EJECT                                                          00272000
*                                                               01S0130 00273000
*/********************************************************************/ 00274000
*/*                                                                  */ 00275000
*/* SUBROUTINE-                                                      */ 00276000
*/*      CALLRTM                                                     */ 00277000
*/*                                                                  */ 00278000
*/* FUNCTION-                                                        */ 00279000
*/*      CONTINUE WITH TERMINATION OF THE ADDRESS SPACE              */ 00280000
*/*                                                                  */ 00281000
*/********************************************************************/ 00282000
*                                                               01S0130 00283000
*CALLRTM:                                                       01S0130 00284000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);                       01S0130 00285000
CALLRTM  DS    0H                                               01S0131 00286000
*   RFY                                                         01S0131 00287000
*    (REG0,                                                     01S0131 00288000
*     REG2,                                                     01S0131 00289000
*     REG3,                                                     01S0131 00290000
*     REG14,                                                    01S0131 00291000
*     SAVEB) RSTD;                  /* RESTRICT REGS         @ZA35161*/ 00292000
*   SAVEB=REG14;                    /* SAVE RETURN ADDRESS           */ 00293000
         LR    SAVEB,REG14                                      01S0132 00294000
*   RFY                                                         01S0133 00295000
*     REG14 UNRSTD;                 /* FREE RETURN REGISTER          */ 00296000
*   REG3=SDWAPTR;                   /* SAVE SDWAPTR          @ZA20814*/ 00297000
         LR    REG3,SDWAPTR                                     01S0134 00298000
*   IF TSBIWAIT='1'B|               /* IWAIT?                @ZA20833*/ 00299000
*       TSBOWAIT='1'B THEN          /* OWAIT?                @ZA20833*/ 00300000
         L     @12,PSAAOLD                                      01S0135 00301000
         L     @12,ASCBTSB(,@12)                                01S0135 00302000
         TM    TSBIWAIT(@12),B'01100000'                        01S0135 00303000
         BZ    @RF00135                                         01S0135 00304000
*     DO;                           /* WAIT CONDITION        @ZA20833*/ 00305000
*       TSBIWAIT='0'B;              /* RESET IWAIT FLAG      @ZA20814*/ 00306000
*       TSBOWAIT='0'B;              /* RESET OWAIT FLAG      @ZA20814*/ 00307000
         NI    TSBIWAIT(@12),B'10011111'                        01S0138 00308000
*       REG2=REG13;                 /* SAVEAREA POINTER      @ZA20814*/ 00309000
         LR    REG2,REG13                                       01S0139 00310000
*       REG0=8;                     /* TASK TO BE RESET      @ZA20814*/ 00311000
         LA    REG0,8                                           01S0140 00312000
*       REG1='80000000'X;           /* THIS CALL FOR RESET   @ZA20814*/ 00313000
         L     REG1,@CF02396                                    01S0141 00314000
*       REG13='0C00'X;              /* NON-DISPATCHABILITY   @ZA20814*/ 00315000
         LA    REG13,3072                                       01S0142 00316000
*       CALL STATUS;                /* CALL STATUS           @ZA20814*/ 00317000
         L     @12,CVTPTR                                       01S0143 00318000
         L     @12,CVTABEND(,@12)                               01S0143 00319000
         L     @15,SCVTSTAT(,@12)                               01S0143 00320000
         BALR  @14,@15                                          01S0143 00321000
*       SDWAPTR=REG3;               /* RESTORE SDWAPTR       @ZA20814*/ 00322000
         LR    SDWAPTR,REG3                                     01S0144 00323000
*       REG13=REG2;                 /* RESTORE REGISTER 13   @ZA20814*/ 00324000
         LR    REG13,REG2                                       01S0145 00325000
*       RFY                                                     01S0146 00326000
*         REG0 UNRSTD;              /* FREE REGISTERS        @ZA20814*/ 00327000
*     END;                          /* STATUS CALLED         @ZA20833*/ 00328000
*   TSBCANC='1'B;                   /* SESSION CANCELED      @ZA25940*/ 00329000
@RF00135 DS    0H                                               01S0149 00330000
*   TSBHUNG='1'B;                   /*                       @ZA25940*/ 00331000
         L     @12,PSAAOLD                                      01S0149 00332000
         L     @12,ASCBTSB(,@12)                                01S0149 00333000
         OI    TSBCANC(@12),B'00010100'                         01S0149 00334000
*   REG2=SDWACMPC&SYSCC;            /* SDWA SYS COMP CODE    @ZA25940*/ 00335000
         L     REG2,SDWACMPC-1(,SDWAPTR)                        01S0150 00336000
         LA    REG2,0(,REG2)                                    01S0150 00337000
         N     REG2,@CF02318                                    01S0150 00338000
*   SRL(REG2,12);                   /* MOVE TO LOW ORDER BITS@ZA25940*/ 00339000
         SRL   REG2,12                                          01S0151 00340000
*   IF REG2=0 THEN                  /* IF NOT SYSTEM ERROR   @ZA25940*/ 00341000
         SLR   @12,@12                                          01S0152 00342000
         CR    REG2,@12                                         01S0152 00343000
         BNE   @RF00152                                         01S0152 00344000
*     DO;                           /*                       @ZA25940*/ 00345000
*       REG2=SDWACMPC&USRCC;        /* IS IT A USER ABEND?   @ZA25940*/ 00346000
         LA    REG2,4095                                        01S0154 00347000
         L     @08,SDWACMPC-1(,SDWAPTR)                         01S0154 00348000
         LA    @08,0(,@08)                                      01S0154 00349000
         NR    REG2,@08                                         01S0154 00350000
*       IF REG2=0 THEN              /* NO USER CODE AROUND?  @ZA25940*/ 00351000
         CR    REG2,@12                                         01S0155 00352000
         BNE   @RF00155                                         01S0155 00353000
*         REG2='0AB'X;              /* ABEND CODE 0AB        @ZA25940*/ 00354000
         LA    REG2,171                                         01S0156 00355000
*     END;                          /*                       @ZA25940*/ 00356000
@RF00155 DS    0H                                               01S0158 00357000
*   RFY                                                         01S0158 00358000
*    (REG0,                                                     01S0158 00359000
*     REG4,                                                     01S0158 00360000
*     REG7) RSTD;                   /* RESTRICT REGISTERS            */ 00361000
@RF00152 DS    0H                                               01S0159 00362000
*   REG7=ASCBASID;                  /* ASID                          */ 00363000
         L     @12,PSAAOLD                                      01S0159 00364000
         LH    REG7,ASCBASID(,@12)                              01S0159 00365000
         N     REG7,@CF02424                                    01S0159 00366000
*   REG4=TVWATCB;                   /* TCB ADDRESS                   */ 00367000
         L     @12,ASCBTSB(,@12)                                01S0160 00368000
         L     @12,TSBEXTNT(,@12)                               01S0160 00369000
         L     @12,TSBXTVWA(,@12)                               01S0160 00370000
         L     REG4,TVWATCB(,@12)                               01S0160 00371000
*   GEN SETS(REG0,REG1,REG2,REG14,REG15) REFS(CVTBTERM,CVTMAP,REG4,REG7 00372000
*       );                                                      01S0161 00373000
         CALLRTM TYPE=ABTERM,COMPCOD=(2),ASID=(7),TCB=(4),             C00374000
               DUMP=YES,STEP=YES                                        00375000
*   RFY                                                         01S0162 00376000
*     REG2 UNRSTD;                  /* FREE REGISTER 2       @ZM21122*/ 00377000
*   SDWAPTR=REG3;                   /* RESTORE SDWA POINTER          */ 00378000
         LR    SDWAPTR,REG3                                     01S0163 00379000
*   RFY                                                         01S0164 00380000
*     REG14 RSTD;                   /* RESTRICT RETURN REGISTER      */ 00381000
*   REG14=SAVEB;                    /* RESTORE RETURN ADDRESS        */ 00382000
         LR    REG14,SAVEB                                      01S0165 00383000
*   RFY                                                         01S0166 00384000
*    (REG0,                                                     01S0166 00385000
*     REG3,                                                     01S0166 00386000
*     REG4,                                                     01S0166 00387000
*     REG7,                                                     01S0166 00388000
*     REG14,                                                    01S0166 00389000
*     SAVEB) UNRSTD;                /* FREE WORK REGISTERS   @ZA35161*/ 00390000
*   END CALLRTM;                    /* END OF CALLRTM                */ 00391000
@EL00003 DS    0H                                               01S0167 00392000
@EF00003 DS    0H                                               01S0167 00393000
@ER00003 BR    @14                                              01S0167 00394000
*/********************************************************************/ 00395000
*/* END OF SUBROUTINE CALLRTM                                        */ 00396000
*/********************************************************************/ 00397000
*                                                               01S0168 00398000
         EJECT                                                          00399000
*                                                               01S0168 00400000
*/********************************************************************/ 00401000
*/*                                                                  */ 00402000
*/* SUBROUTINE-                                                      */ 00403000
*/*      RETRY                                                       */ 00404000
*/*                                                                  */ 00405000
*/* FUNCTION-                                                        */ 00406000
*/*      RESTART EXECUTION AT LAST CHECKPOINT.                       */ 00407000
*/*                                                                  */ 00408000
*/********************************************************************/ 00409000
*                                                               01S0168 00410000
*RETRY:                                                         01S0168 00411000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/*                  @ZM20856*/ 00412000
RETRY    DS    0H                                               01S0169 00413000
*   RFY                                                         01S0169 00414000
*    (ZEROABC,                                                  01S0169 00415000
*     REG14,                                                    01S0169 00416000
*     SAVEB) RSTD;                  /* RESTRICT WORK REGISTER   01S0169 00417000
*                                                            @ZA35161*/ 00418000
*   SAVEB=REG14;                    /* SAVE RETURN ADDRESS   @ZA35161*/ 00419000
         LR    SAVEB,REG14                                      01S0170 00420000
*   PTRSDWA=SDWAPTR;                /* INITIALIZE LOCAL SDWA POINTER    00421000
*                                                            @ZM20856*/ 00422000
         LR    PTRSDWA,SDWAPTR                                  01S0171 00423000
*   RFY                                                         01S0172 00424000
*     REG14 UNRSTD;                 /* FREE UP REGISTERS             */ 00425000
*   RFY                                                         01S0173 00426000
*     SDWA BASED(PTRSDWA);          /* BASE SDWA ON LOCAL POINTER       00427000
*                                                            @ZM20856*/ 00428000
*   ZEROABC=SDWAABCC&SYSCCL;        /* SET VARIABLE FOR TEST @ZM20856*/ 00429000
         L     ZEROABC,SDWAABCC(,PTRSDWA)                       01S0174 00430000
         N     ZEROABC,@CF02320                                 01S0174 00431000
*   IF LTCBIOER='1'B&               /* TEST FOR I/O ERROR    @ZM20856*/ 00432000
*       ZEROABC=ZEROAB THEN         /* TEST FOR 0AB ABEND    @ZM20856*/ 00433000
         L     @12,SDWAPARM(,PTRSDWA)                           01S0175 00434000
         L     @08,FRPRPLAD(,@12)                               01S0175 00435000
         TM    LTCBIOER+92(@08),B'10000000'                     01S0175 00436000
         BNO   @RF00175                                         01S0175 00437000
         ICM   @08,15,ZEROAB                                    01S0175 00438000
         CLR   ZEROABC,@08                                      01S0175 00439000
         BNE   @RF00175                                         01S0175 00440000
*     DO;                           /* I/O ERROR AND 0AB     @ZM20856*/ 00441000
*       RFY                                                     01S0177 00442000
*         ZEROABC UNRSTD;           /* UNRESTRICT WORK REGISTER 01S0177 00443000
*                                                            @ZM20856*/ 00444000
*       IF FRPOMNGR='1'B&           /* ABEND WAS IN A TOM    @ZA36072*/ 00445000
*           TVWATID='1'B THEN       /* AND TIM IS NOT ACTIVE @ZA36072*/ 00446000
         TM    FRPOMNGR(@12),B'10000000'                        01S0178 00447000
         BNO   @RF00178                                         01S0178 00448000
         L     @08,PSAAOLD                                      01S0178 00449000
         L     @08,ASCBTSB(,@08)                                01S0178 00450000
         L     @08,TSBEXTNT(,@08)                               01S0178 00451000
         L     @08,TSBXTVWA(,@08)                               01S0178 00452000
         TM    TVWATID(@08),B'00010000'                         01S0178 00453000
         BNO   @RF00178                                         01S0178 00454000
*         DO;                       /* NO NEED TO CONTINUE   @ZA36072*/ 00455000
*           INFOBASE=FRPXITPT;      /* SET UP FOR IKTEXIT    @ZA36072*/ 00456000
         L     INFOBASE,FRPXITPT(,@12)                          01S0180 00457000
*           CALL EXIT;              /* EXIT IKTIOFRR         @ZA36072*/ 00458000
         BAL   @14,EXIT                                         01S0181 00459000
*         END;                      /* END TIM/TOM GONE      @ZA36072*/ 00460000
*       ELSE                        /* ABEND NOT FROM TOM OR TIM IS     00461000
*                                      STILL ACTIVE          @ZA36072*/ 00462000
*         DO;                       /* TIM ABEND/TIM STILL AROUND       00463000
*                                                            @ZA36072*/ 00464000
         B     @RC00178                                         01S0183 00465000
@RF00178 DS    0H                                               01S0184 00466000
*           RFY                                                 01S0184 00467000
*             REG1 RSTD;            /* RESTRICT REG1 AND     @ZM20856*/ 00468000
*           REG1=ADDR(IFGRPL);      /* LOAD ADDRESS OF CURRENT RPL      00469000
*                                      INTO REG1             @ZM20856*/ 00470000
         L     @12,SDWAPARM(,PTRSDWA)                           01S0185 00471000
         L     REG1,FRPRPLAD(,@12)                              01S0185 00472000
*           CALL IKTIST00;          /* SCHEDULE LOSTERM EXIT @ZM20856*/ 00473000
         L     @12,CVTPTR                                       01S0186 00474000
         L     @12,CVTTCASP(,@12)                               01S0186 00475000
         L     @15,TCASSCHD(,@12)                               01S0186 00476000
         BALR  @14,@15                                          01S0186 00477000
*           RFY                                                 01S0187 00478000
*             REG15 RSTD;           /* RESTRICT RETURN CODE REGISTER    00479000
*                                                            @ZM20856*/ 00480000
*           IF REG15^=0 THEN        /* SCHEDULE NO GOOD      @ZM20856*/ 00481000
         LTR   REG15,REG15                                      01S0188 00482000
         BZ    @RF00188                                         01S0188 00483000
*             SDWARCDE=SDWACWT;     /* CONTINUE WITH TERMINATION        00484000
*                                                            @ZM20856*/ 00485000
         MVI   SDWARCDE(PTRSDWA),X'00'                          01S0189 00486000
*           ELSE                    /* SCHEDULE SUCCESSFUL   @ZM20856*/ 00487000
*             DO;                   /*                       @ZM20856*/ 00488000
         B     @RC00188                                         01S0190 00489000
@RF00188 DS    0H                                               01S0191 00490000
*               IF FRPOMNGR='1'B THEN/* IS ENTRY FROM A TOM? @ZA32401*/ 00491000
         L     @14,SDWAPARM(,PTRSDWA)                           01S0191 00492000
         TM    FRPOMNGR(@14),B'10000000'                        01S0191 00493000
         BNO   @RF00191                                         01S0191 00494000
*                 DO;               /* YES, FROM OUTPUT MNGR @ZA32401*/ 00495000
*                   TVWATOD='1'B;   /* TOM IS DEAD           @ZA32401*/ 00496000
         L     @14,PSAAOLD                                      01S0193 00497000
         L     @14,ASCBTSB(,@14)                                01S0193 00498000
         L     @14,TSBEXTNT(,@14)                               01S0193 00499000
         L     @14,TSBXTVWA(,@14)                               01S0193 00500000
         OI    TVWATOD(@14),B'10000000'                         01S0193 00501000
*                   TVWATIR='0'B;   /* TOM IS NOT RUNNING    @ZA32401*/ 00502000
         NI    TVWATIR(@14),B'11110111'                         01S0194 00503000
*                   TVWATIS='0'B;   /* TOM IS NOT SCHEDULED  @ZA36072*/ 00504000
         NI    TVWATIS(@14),B'10111111'                         01S0195 00505000
*                 END;              /*                       @ZA32401*/ 00506000
*               INFOBASE=FRPXITPT;  /* SET UP EXIT INFORMATION BASE     00507000
*                                                            @ZM20856*/ 00508000
@RF00191 L     @14,SDWAPARM(,PTRSDWA)                           01S0197 00509000
         L     INFOBASE,FRPXITPT(,@14)                          01S0197 00510000
*               CALL EXIT;          /* CALL INITIALIZATION ROUTINE      00511000
*                                                            @ZM20856*/ 00512000
         BAL   @14,EXIT                                         01S0198 00513000
*               RFY                                             01S0199 00514000
*                (REG1,                                         01S0199 00515000
*                 REG15) UNRSTD;    /* UNRESTRICT REGISTERS  @ZM20856*/ 00516000
*             END;                  /*                       @ZM20856*/ 00517000
*         END;                      /* END TIM ABEND/TIM STILL AROUND   00518000
*                                                            @ZA36072*/ 00519000
*     END;                          /*                       @ZM20856*/ 00520000
*/********************************************************************/ 00521000
*/*   THE CONDITIONS CURRENTLY EXAMINED ARE AS FOLLOWS               */ 00522000
*/*     ERROR OCCURRED IN SRB MODE                                   */ 00523000
*/*     FRR WAS NOT ENTERED AS A RESULT OF PERCOLATION               */ 00524000
*/*     ERROR IS NOT AN I/O ERROR WHICH GENERATED AN ABEND (0AB)     */ 00525000
*/*   THE CONDITIONS CAUSING THE ERROR ARE MACHINE CHECKS, PROGRAM   */ 00526000
*/*     CHECKS, AND OTHER ABNORMAL CONDITIONS (NOT CONTROLLABLE)     */ 00527000
*/********************************************************************/ 00528000
*                                                               01S0203 00529000
*   ELSE                            /* NOT I/O ERROR VIA 0AB @ZM20856*/ 00530000
*     IF TVWARISW='1'B THEN         /* CHECK FOR RECURSION AFTER I/O    00531000
*                                      MNGRS REINITIALIZED   @ZM20856*/ 00532000
         B     @RC00175                                         01S0203 00533000
@RF00175 L     @12,PSAAOLD                                      01S0203 00534000
         L     @12,ASCBTSB(,@12)                                01S0203 00535000
         L     @12,TSBEXTNT(,@12)                               01S0203 00536000
         L     @12,TSBXTVWA(,@12)                               01S0203 00537000
         TM    TVWARISW(@12),B'00001000'                        01S0203 00538000
         BNO   @RF00203                                         01S0203 00539000
*       DO;                         /*                       @ZM20856*/ 00540000
*         LTCBIOER='0'B;            /* SET NOT I/O ERROR     @ZM45516*/ 00541000
*         LTCBRCUR='1'B;            /* INDICATE TO LOSTERM TO CANCEL    00542000
*                                      THIS USER             @ZM20856*/ 00543000
         L     @12,SDWAPARM(,PTRSDWA)                           01S0206 00544000
         L     @12,FRPRPLAD(,@12)                               01S0206 00545000
         OI    LTCBRCUR+92(@12),B'01000000'                     01S0206 00546000
         NI    LTCBIOER+92(@12),B'01111111'                     01S0206 00547000
*         RFY                                                   01S0207 00548000
*           REG1 RSTD;              /* RESTRICT REGISTER 1   @ZM20856*/ 00549000
*         REG1=ADDR(IFGRPL);        /* LOAD REGISTER 1 WITH ADDRESS     00550000
*                                      OF RPL                @ZM20856*/ 00551000
         LR    REG1,@12                                         01S0208 00552000
*         CALL IKTIST00;            /* SCHEDULE LOSTERM      @ZM20856*/ 00553000
         L     @12,CVTPTR                                       01S0209 00554000
         L     @12,CVTTCASP(,@12)                               01S0209 00555000
         L     @15,TCASSCHD(,@12)                               01S0209 00556000
         BALR  @14,@15                                          01S0209 00557000
*         RFY                                                   01S0210 00558000
*           REG15 RSTD;             /* RESTRICT RETURN CODE REGISTER    00559000
*                                                            @ZM20856*/ 00560000
*         IF REG15^=0 THEN          /* SCHEDULE UNSUCCESSFUL @ZM20856*/ 00561000
         LTR   REG15,REG15                                      01S0211 00562000
         BZ    @RF00211                                         01S0211 00563000
*           SDWARCDE=SDWACWT;       /* INDICATE CONTINUE WITH   01S0212 00564000
*                                      TERMINATION           @ZM20856*/ 00565000
         MVI   SDWARCDE(PTRSDWA),X'00'                          01S0212 00566000
*         ELSE                      /* SCHEDULE SUCCESSFUL   @ZM20856*/ 00567000
*           DO;                     /*                       @ZM20856*/ 00568000
         B     @RC00211                                         01S0213 00569000
@RF00211 DS    0H                                               01S0214 00570000
*             INFOBASE=FRPXITPT;    /* BASE EXIT CRITERIA ON I/O MNGR   00571000
*                                      EXIT INFO@ZM20856             */ 00572000
         L     @14,SDWAPARM(,PTRSDWA)                           01S0214 00573000
         L     INFOBASE,FRPXITPT(,@14)                          01S0214 00574000
*             CALL EXIT;            /* SET UP ENVIRONMENT    @ZM20856*/ 00575000
         BAL   @14,EXIT                                         01S0215 00576000
*             RFY                                               01S0216 00577000
*              (REG1,                                           01S0216 00578000
*               REG15) UNRSTD;      /* UNRESTRICT REGISTERS  @ZM20856*/ 00579000
*           END;                    /*                       @ZM20856*/ 00580000
*       END;                        /*                       @ZM20856*/ 00581000
*     ELSE                          /* NO RECURSION OF I/O MNGR 01S0219 00582000
*                                      INITIALIZATION        @ZM20856*/ 00583000
*       DO;                         /*                       @ZM20856*/ 00584000
         B     @RC00203                                         01S0219 00585000
@RF00203 DS    0H                                               01S0220 00586000
*         IF FRPOMNGR='1'B THEN     /* IF OUTPUT MANAGER BASE@ZM20856*/ 00587000
         L     @12,SDWAPARM(,PTRSDWA)                           01S0220 00588000
         TM    FRPOMNGR(@12),B'10000000'                        01S0220 00589000
         BNO   @RF00220                                         01S0220 00590000
*           FRRWAPTR=TVWAFRWO;      /* WORKAREA ON OUTPUT    @ZM20856*/ 00591000
         L     @12,PSAAOLD                                      01S0221 00592000
         L     @12,ASCBTSB(,@12)                                01S0221 00593000
         L     @12,TSBEXTNT(,@12)                               01S0221 00594000
         L     @12,TSBXTVWA(,@12)                               01S0221 00595000
         L     FRRWAPTR,TVWAFRWO(,@12)                          01S0221 00596000
*         IF FRPIMNGR='1'B THEN     /* IF INPUT MANAGER BASE @ZM20856*/ 00597000
@RF00220 L     @12,SDWAPARM(,PTRSDWA)                           01S0222 00598000
         TM    FRPIMNGR(@12),B'01000000'                        01S0222 00599000
         BNO   @RF00222                                         01S0222 00600000
*           FRRWAPTR=TVWAFRWI;      /* WORKAREA ON INPUT     @ZM20856   00601000
*                                      MANAGER FRR WORK AREA@ZM20856    00602000
*                                      POINTER               @ZM20856*/ 00603000
         L     @12,PSAAOLD                                      01S0223 00604000
         L     @12,ASCBTSB(,@12)                                01S0223 00605000
         L     @12,TSBEXTNT(,@12)                               01S0223 00606000
         L     @12,TSBXTVWA(,@12)                               01S0223 00607000
         L     FRRWAPTR,TVWAFRWI(,@12)                          01S0223 00608000
*         RFY                                                   01S0224 00609000
*           IKTFRRWA BASED(FRRWAPTR);/* ESTABLISH BASE FOR FRR  01S0224 00610000
*                                      WORKAREA              @ZM20856*/ 00611000
@RF00222 DS    0H                                               01S0225 00612000
*         IF FRWAPCRE='1'B THEN     /* CHECK FOR RECURSION AFTER        00613000
*                                      RETRY ATTEMPTED       @ZM20856*/ 00614000
         TM    FRWAPCRE(FRRWAPTR),B'10000000'                   01S0225 00615000
         BNO   @RF00225                                         01S0225 00616000
*           DO;                     /* PROCESS RETRY RECURSION  01S0226 00617000
*                                                            @ZM20856*/ 00618000
*             IKTLTCB=IKTLTCB&&IKTLTCB;/* ZERO AREA          @ZM20856*/ 00619000
         L     @12,SDWAPARM(,PTRSDWA)                           01S0227 00620000
         L     @12,FRPRPLAD(,@12)                               01S0227 00621000
         XC    IKTLTCB+92(4,@12),IKTLTCB+92(@12)                01S0227 00622000
*             RFY                                               01S0228 00623000
*               REG1 RSTD;          /* RESTRICT REGISTER 1   @ZM20856*/ 00624000
*             REG1=ADDR(IFGRPL);    /* LOAD ADDRESS OF RPL INTO 01S0229 00625000
*                                      REGISTER 1            @ZM20856*/ 00626000
         LR    REG1,@12                                         01S0229 00627000
*             CALL IKTIST00;        /* SCHEDULE LOSTERM      @ZM20856*/ 00628000
         L     @12,CVTPTR                                       01S0230 00629000
         L     @12,CVTTCASP(,@12)                               01S0230 00630000
         L     @15,TCASSCHD(,@12)                               01S0230 00631000
         BALR  @14,@15                                          01S0230 00632000
*             RFY                                               01S0231 00633000
*               REG15 RSTD;         /* RESTRICT RETURN CODE REGISTER    00634000
*                                                            @ZM20856*/ 00635000
*             IF REG15^=0 THEN      /* SCHEDULE UNSUCCESSFUL @ZM20856*/ 00636000
         LTR   REG15,REG15                                      01S0232 00637000
         BZ    @RF00232                                         01S0232 00638000
*               SDWARCDE=SDWACWT;   /* INDICATE CONTINUE WITH   01S0233 00639000
*                                      TERMINATION           @ZM20856*/ 00640000
         MVI   SDWARCDE(PTRSDWA),X'00'                          01S0233 00641000
*             ELSE                  /* SCHEDULE SUCCESSFUL   @ZM20856*/ 00642000
*               DO;                 /*                       @ZM20856*/ 00643000
         B     @RC00232                                         01S0234 00644000
@RF00232 DS    0H                                               01S0235 00645000
*                 INFOBASE=FRPXITPT;/* BASE EXIT CRITERIA ON I/O MNGR   00646000
*                                      EXIT INFO             @ZM20856*/ 00647000
         L     @14,SDWAPARM(,PTRSDWA)                           01S0235 00648000
         L     INFOBASE,FRPXITPT(,@14)                          01S0235 00649000
*                 CALL EXIT;        /* SET UP ENVIRONMENT    @ZM20856*/ 00650000
         BAL   @14,EXIT                                         01S0236 00651000
*                 TVWARISW='1'B;    /* TURN ON REINITIALIZATION 01S0237 00652000
*                                      INDICATOR             @ZM20856*/ 00653000
         L     @14,PSAAOLD                                      01S0237 00654000
         L     @14,ASCBTSB(,@14)                                01S0237 00655000
         L     @14,TSBEXTNT(,@14)                               01S0237 00656000
         L     @14,TSBXTVWA(,@14)                               01S0237 00657000
         OI    TVWARISW(@14),B'00001000'                        01S0237 00658000
*                 RFY                                           01S0238 00659000
*                  (REG1,                                       01S0238 00660000
*                   REG15) UNRSTD;  /* FREE REGISTERS        @ZM20856*/ 00661000
*               END;                /*                       @ZM20856*/ 00662000
*           END;                    /*                       @ZM20856*/ 00663000
*         ELSE                      /* FIRST TIME FRR ENTERED WITH      00664000
*                                      ABNORMAL CONDITION    @ZM20856*/ 00665000
*           DO;                     /*                       @ZM20856*/ 00666000
         B     @RC00225                                         01S0241 00667000
@RF00225 DS    0H                                               01S0242 00668000
*             FRWAPCRE='1'B;        /* INDICATE ABNORMAL CONDITION      00669000
*                                      OCCURRED              @ZM20856*/ 00670000
         OI    FRWAPCRE(FRRWAPTR),B'10000000'                   01S0242 00671000
*             INFOBASE=FRPRETRY;    /* BASE ON RETRY INFORMATION        00672000
*                                                            @ZM20856*/ 00673000
         L     @12,SDWAPARM(,PTRSDWA)                           01S0243 00674000
         L     INFOBASE,FRPRETRY(,@12)                          01S0243 00675000
*             CALL EXIT;            /* INITIALIZE RETRY ENVIRONMENT     00676000
*                                                            @ZM20856*/ 00677000
         BAL   @14,EXIT                                         01S0244 00678000
*           END;                    /*                       @ZM20856*/ 00679000
*       END;                        /* END NO RECURSION OF I/O MNGR     00680000
*                                      INIT                  @ZM20856*/ 00681000
@RC00225 DS    0H                                               01S0247 00682000
*   RFY                                                         01S0247 00683000
*     SDWA BASED(SDWAPTR);          /* RESTORE OLD BASE      @ZM20856*/ 00684000
@RC00203 DS    0H                                               01S0247 00685000
@RC00175 DS    0H                                               01S0248 00686000
*   SDWAPTR=PTRSDWA;                /* RESTORE SDWA POINTER  @ZM20856*/ 00687000
         LR    SDWAPTR,PTRSDWA                                  01S0248 00688000
*   RFY                                                         01S0249 00689000
*     REG14 RSTD;                   /* RESTRICT RETURN REG           */ 00690000
*   REG14=SAVEB;                    /* RESTORE RETURN ADDRESS   01S0250 00691000
*                                                            @ZA35161*/ 00692000
         LR    REG14,SAVEB                                      01S0250 00693000
*   RFY                                                         01S0251 00694000
*    (REG14,                                                    01S0251 00695000
*     SAVEB) UNRSTD;                /* FREE UP REGISTER      @ZA35161*/ 00696000
*   END RETRY;                      /* END OF RETRY PROC     @ZM20856*/ 00697000
@EL00004 DS    0H                                               01S0252 00698000
@EF00004 DS    0H                                               01S0252 00699000
@ER00004 BR    @14                                              01S0252 00700000
*/********************************************************************/ 00701000
*/* END OF SUBROUTINE RETRY                                          */ 00702000
*/********************************************************************/ 00703000
*                                                               01S0253 00704000
         EJECT                                                          00705000
*                                                               01S0253 00706000
*/********************************************************************/ 00707000
*/*                                                                  */ 00708000
*/* SUBROUTINE-                                                      */ 00709000
*/*      EXIT                                                        */ 00710000
*/*                                                                  */ 00711000
*/* FUNCTION-                                                        */ 00712000
*/*      EXIT LINKAGE                                                */ 00713000
*/*                                                                  */ 00714000
*/********************************************************************/ 00715000
*                                                               01S0253 00716000
*EXIT:                                                          01S0253 00717000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/*                  @ZM20856*/ 00718000
EXIT     DS    0H                                               01S0254 00719000
*   RFY                                                         01S0254 00720000
*    (REG0,                                                     01S0254 00721000
*     REG2,                                                     01S0254 00722000
*     REG3,                                                     01S0254 00723000
*     REG14,                                                    01S0254 00724000
*     SAVEC) RSTD;                  /* RESTRICT REGS         @ZA35161*/ 00725000
*   SAVEC=REG14;                    /* SAVE RETURN ADDRESS   @ZA35161*/ 00726000
         LR    SAVEC,REG14                                      01S0255 00727000
*   RFY                                                         01S0256 00728000
*     REG14 UNRSTD;                 /* FREE RETURN REGISTER          */ 00729000
*   RFY                                                         01S0257 00730000
*     SDWA BASED(PTRSDWA);          /* ADDRESS SDWA          @ZA35161*/ 00731000
*   REG3=SDWAPTR;                   /* SAVE SDWAPTR          @ZA35161*/ 00732000
         LR    REG3,SDWAPTR                                     01S0258 00733000
*   IF TSBIWAIT='1'B|               /* IWAIT?                @ZA35161*/ 00734000
*       TSBOWAIT='1'B THEN          /* OWAIT?                @ZA35161*/ 00735000
         L     @12,PSAAOLD                                      01S0259 00736000
         L     @12,ASCBTSB(,@12)                                01S0259 00737000
         TM    TSBIWAIT(@12),B'01100000'                        01S0259 00738000
         BZ    @RF00259                                         01S0259 00739000
*     DO;                           /* WAIT CONDITION        @ZA35161*/ 00740000
*       TSBIWAIT='0'B;              /* RESET IWAIT FLAG      @ZA35161*/ 00741000
*       TSBOWAIT='0'B;              /* RESET OWAIT FLAG      @ZA35161*/ 00742000
         NI    TSBIWAIT(@12),B'10011111'                        01S0262 00743000
*       REG2=REG13;                 /* SAVEAREA POINTER      @ZA35161*/ 00744000
         LR    REG2,REG13                                       01S0263 00745000
*       REG0=8;                     /* TASK TO BE RESET      @ZA35161*/ 00746000
         LA    REG0,8                                           01S0264 00747000
*       REG1='80000000'X;           /* THIS CALL FOR RESET   @ZA35161*/ 00748000
         L     REG1,@CF02396                                    01S0265 00749000
*       REG13='0C00'X;              /* NON-DISPATCHABILITY   @ZA35161*/ 00750000
         LA    REG13,3072                                       01S0266 00751000
*       CALL STATUS;                /* CALL STATUS           @ZA35161*/ 00752000
         L     @12,CVTPTR                                       01S0267 00753000
         L     @12,CVTABEND(,@12)                               01S0267 00754000
         L     @15,SCVTSTAT(,@12)                               01S0267 00755000
         BALR  @14,@15                                          01S0267 00756000
*       SDWAPTR=REG3;               /* RESTORE SDWAPTR       @ZA35161*/ 00757000
         LR    SDWAPTR,REG3                                     01S0268 00758000
*       REG13=REG2;                 /* RESTORE REGISTER 13   @ZA35161*/ 00759000
         LR    REG13,REG2                                       01S0269 00760000
*       RFY                                                     01S0270 00761000
*        (REG0,                                                 01S0270 00762000
*         REG2) UNRSTD;             /* FREE REGISTERS        @ZA35161*/ 00763000
*     END;                          /* STATUS CALLED         @ZA35161*/ 00764000
*   RFY                                                         01S0272 00765000
*     INFODSCT BASED(INFOBASE);     /* BASE INFORMATION DSECT ON        00766000
*                                      INITIALIZED POINTER   @ZM20856*/ 00767000
@RF00259 DS    0H                                               01S0273 00768000
*   SDWASRSV=SAVEREGS;              /* INSERT RETRY REGS INTO SDWA      00769000
*                                                            @ZM20856*/ 00770000
         L     @12,INFOREGS(,INFOBASE)                          01S0273 00771000
         MVC   SDWASRSV(64,PTRSDWA),SAVEREGS(@12)               01S0273 00772000
*   SDWARTYA=INFOADDR;              /* INITIALIZE RETRY ADDRESS 01S0274 00773000
*                                                            @ZM20856*/ 00774000
         L     @12,INFOADDR(,INFOBASE)                          01S0274 00775000
         ST    @12,SDWARTYA(,PTRSDWA)                           01S0274 00776000
*   SDWARCDE=SDWARETY;              /* INDICATE RETRY        @ZM20856*/ 00777000
         MVI   SDWARCDE(PTRSDWA),X'04'                          01S0275 00778000
*   SDWAUPRG='1'B;                  /* INDICATE NEW REGISTERS@ZM20856*/ 00779000
         OI    SDWAUPRG(PTRSDWA),B'00001000'                    01S0276 00780000
*   RFY                                                         01S0277 00781000
*     REG14 RSTD;                   /* RESTRICT RETURN REGISTER      */ 00782000
*   REG14=SAVEC;                    /* RESTORE RETURN ADDRESS   01S0278 00783000
*                                                            @ZA35161*/ 00784000
         LR    REG14,SAVEC                                      01S0278 00785000
*   RFY                                                         01S0279 00786000
*    (REG3,                                                     01S0279 00787000
*     SAVEC) UNRSTD;                /* FREE REGISTERS        @ZA35161*/ 00788000
*   END EXIT;                       /*                       @ZM20856*/ 00789000
@EL00005 DS    0H                                               01S0280 00790000
@EF00005 DS    0H                                               01S0280 00791000
@ER00005 BR    @14                                              01S0280 00792000
*/********************************************************************/ 00793000
*/* END OF SUBROUTINE EXIT                                           */ 00794000
*/********************************************************************/ 00795000
*                                                               01S0281 00796000
*   END IKTIOFRR                    /* END OF IKTIOFRR               */ 00797000
*                                                               01S0281 00798000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00799000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00800000
*/*%INCLUDE SYSUT5  (IKTIOFRR)                                       */ 00801000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00802000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00803000
*/*%INCLUDE SYSLIB  (IFGRPLVS)                                       */ 00804000
*/*%INCLUDE SYSLIB  (ISTRPLEX)                                       */ 00805000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 00806000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 00807000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00808000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00809000
*/*%INCLUDE SYSLIB  (IHASCVT )                                       */ 00810000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00811000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00812000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */ 00813000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                       */ 00814000
*/*%INCLUDE SYSLIB  (IKTFRPRM)                                       */ 00815000
*/*%INCLUDE SYSLIB  (IKTFRRWA)                                       */ 00816000
*/*%INCLUDE SYSLIB  (IKTLTCB )                                       */ 00817000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 00818000
*/*%INCLUDE SYSLIB  (IKTTVWA )                                       */ 00819000
*/*%INCLUDE SYSLIB  (IKTDOCTV)                                       */ 00820000
*/*%INCLUDE SYSUT5  (DOCUMENT)                                       */ 00821000
*/*%INCLUDE SYSUT5  (CALLRTM )                                       */ 00822000
*/*%INCLUDE SYSUT5  (RETRY   )                                       */ 00823000
*/*%INCLUDE SYSUT5  (EXIT    )                                       */ 00824000
*                                                               01S0281 00825000
*       ;                                                       01S0281 00826000
@DATA    DS    0H                                                       00827000
@DATD    DSECT                                                          00828000
         DS    0F                                                       00829000
IKTIOFRR CSECT                                                          00830000
         DS    0F                                                       00831000
@CF01018 DC    F'12'                                                    00832000
@CF02320 DC    XL4'00FFF000'                                            00833000
@CF02396 DC    XL4'80000000'                                            00834000
@CF02424 DC    XL4'0000FFFF'                                            00835000
@CF02318 DC    XL4'FFF000'                                              00836000
@DATD    DSECT                                                          00837000
         DS    0D                                                       00838000
@ENDDATD EQU   *                                                        00839000
IKTIOFRR CSECT                                                          00840000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00841000
         DS    0F                                                       00842000
@SIZDATD DC    AL1(0)                                                   00843000
         DC    AL3(@ENDDATD-@DATD)                                      00844000
@CA00028 DC    A(IKTIOFRR)                                              00845000
         DS    0D                                                       00846000
ZEROAB   DC    X'000AB000'                                              00847000
PATCH    DC    20F'0'                                                   00848000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00849000
@01      EQU   01                                                       00850000
@02      EQU   02                                                       00851000
@03      EQU   03                                                       00852000
@04      EQU   04                                                       00853000
@05      EQU   05                                                       00854000
@06      EQU   06                                                       00855000
@07      EQU   07                                                       00856000
@08      EQU   08                                                       00857000
@09      EQU   09                                                       00858000
@10      EQU   10                                                       00859000
@11      EQU   11                                                       00860000
@12      EQU   12                                                       00861000
@13      EQU   13                                                       00862000
@14      EQU   14                                                       00863000
@15      EQU   15                                                       00864000
PTRSDWA  EQU   @04                                                      00865000
INFOBASE EQU   @07                                                      00866000
FRRWAPTR EQU   @07                                                      00867000
BASEREG  EQU   @09                                                      00868000
SDWAPTR  EQU   @01                                                      00869000
REG0     EQU   @00                                                      00870000
REG1     EQU   @01                                                      00871000
REG2     EQU   @02                                                      00872000
ZEROABC  EQU   @02                                                      00873000
REG3     EQU   @03                                                      00874000
REG4     EQU   @04                                                      00875000
REG5     EQU   @05                                                      00876000
SAVEB    EQU   @05                                                      00877000
SAVEA    EQU   @06                                                      00878000
REG7     EQU   @07                                                      00879000
SAVEC    EQU   @08                                                      00880000
REG13    EQU   @13                                                      00881000
REG14    EQU   @14                                                      00882000
REG15    EQU   @15                                                      00883000
PSA      EQU   0                                                        00884000
FLCRNPSW EQU   PSA                                                      00885000
FLCROPSW EQU   PSA+8                                                    00886000
FLCICCW2 EQU   PSA+16                                                   00887000
FLCCVT   EQU   FLCICCW2                                                 00888000
PSAEEPSW EQU   PSA+132                                                  00889000
PSAESPSW EQU   PSA+136                                                  00890000
FLCSVILC EQU   PSAESPSW+1                                               00891000
PSAEPPSW EQU   PSA+140                                                  00892000
FLCPIILC EQU   PSAEPPSW+1                                               00893000
FLCPICOD EQU   PSAEPPSW+2                                               00894000
PSAPICOD EQU   FLCPICOD+1                                               00895000
FLCTEA   EQU   PSAEPPSW+4                                               00896000
FLCPER   EQU   PSA+152                                                  00897000
FLCMCLA  EQU   PSA+168                                                  00898000
FLCIOEL  EQU   FLCMCLA+4                                                00899000
FLCIOA   EQU   FLCMCLA+16                                               00900000
FLCFSA   EQU   FLCMCLA+80                                               00901000
PSAAOLD  EQU   PSA+548                                                  00902000
PSASUPER EQU   PSA+552                                                  00903000
PSASUP1  EQU   PSASUPER                                                 00904000
PSASUP2  EQU   PSASUPER+1                                               00905000
PSASUP3  EQU   PSASUPER+2                                               00906000
PSASUP4  EQU   PSASUPER+3                                               00907000
PSACLHT  EQU   PSA+640                                                  00908000
PSALKSA  EQU   PSA+696                                                  00909000
PSAHLHI  EQU   PSA+760                                                  00910000
PSALITA  EQU   PSA+764                                                  00911000
PSADSSFL EQU   PSA+836                                                  00912000
PSADSSF1 EQU   PSADSSFL                                                 00913000
PSADSSF3 EQU   PSADSSFL+2                                               00914000
PSADSSF4 EQU   PSADSSFL+3                                               00915000
PSARSVT  EQU   PSA+896                                                  00916000
PSALSFCC EQU   PSA+1012                                                 00917000
CVTMAP   EQU   0                                                        00918000
CVTBTERM EQU   CVTMAP+52                                                00919000
CVTDAR   EQU   CVTMAP+72                                                00920000
CVTFLGS1 EQU   CVTDAR                                                   00921000
CVTDCB   EQU   CVTMAP+116                                               00922000
CVTIERLC EQU   CVTMAP+144                                               00923000
CVTOPTA  EQU   CVTMAP+182                                               00924000
CVTOPTB  EQU   CVTMAP+183                                               00925000
CVTABEND EQU   CVTMAP+200                                               00926000
CVTGTF   EQU   CVTMAP+236                                               00927000
CVTGTFST EQU   CVTGTF                                                   00928000
CVTGTFS  EQU   CVTGTFST                                                 00929000
CVTSTATE EQU   CVTGTFST                                                 00930000
CVTTMODE EQU   CVTGTFST                                                 00931000
CVTFORM  EQU   CVTGTFST                                                 00932000
CVTAQAVT EQU   CVTMAP+240                                               00933000
CVTTCMFG EQU   CVTAQAVT                                                 00934000
CVTVOLM2 EQU   CVTMAP+244                                               00935000
CVTTATA  EQU   CVTVOLM2                                                 00936000
CVTTSKS  EQU   CVTTATA                                                  00937000
CVTVOLF2 EQU   CVTTSKS                                                  00938000
CVTTAT   EQU   CVTTATA+1                                                00939000
CVTATER  EQU   CVTMAP+248                                               00940000
CVTEXT1  EQU   CVTMAP+252                                               00941000
CVTPURG  EQU   CVTMAP+260                                               00942000
CVTQMSG  EQU   CVTMAP+268                                               00943000
CVTDMSR  EQU   CVTMAP+272                                               00944000
CVTRSV37 EQU   CVTDMSR                                                  00945000
CVTDMSRF EQU   CVTRSV37                                                 00946000
CVTERPV  EQU   CVTMAP+316                                               00947000
CVTINTLA EQU   CVTMAP+320                                               00948000
CVTAPF   EQU   CVTMAP+324                                               00949000
CVTEXT2  EQU   CVTMAP+328                                               00950000
CVTHJES  EQU   CVTMAP+332                                               00951000
CVTPGSIA EQU   CVTMAP+348                                               00952000
CVTA1F1  EQU   CVTMAP+356                                               00953000
CVTSYSK  EQU   CVTMAP+357                                               00954000
CVTVOLM1 EQU   CVTMAP+380                                               00955000
CVTVOLF1 EQU   CVTVOLM1                                                 00956000
CVTXTNT1 EQU   0                                                        00957000
CVTXTNT2 EQU   0                                                        00958000
CVTDSSV  EQU   CVTXTNT2                                                 00959000
CVTFLGBT EQU   CVTXTNT2+5                                               00960000
CVTQID   EQU   CVTXTNT2+24                                              00961000
CVTRV400 EQU   CVTXTNT2+52                                              00962000
CVTRV409 EQU   CVTXTNT2+53                                              00963000
CVTATCVT EQU   CVTXTNT2+64                                              00964000
CVTRV429 EQU   CVTXTNT2+84                                              00965000
CVTRV438 EQU   CVTXTNT2+85                                              00966000
CVTRV457 EQU   CVTXTNT2+112                                             00967000
CVTRV466 EQU   CVTXTNT2+113                                             00968000
CVTFIX   EQU   0                                                        00969000
CVTRELNO EQU   CVTFIX+252                                               00970000
IFGRPL   EQU   0                                                        00971000
RPLCOMN  EQU   IFGRPL                                                   00972000
RPLIDWD  EQU   RPLCOMN                                                  00973000
RPLREQ   EQU   RPLIDWD+2                                                00974000
RPLLEN   EQU   RPLIDWD+3                                                00975000
RPLECB   EQU   RPLCOMN+8                                                00976000
RPLFDBWD EQU   RPLCOMN+12                                               00977000
RPLFDBK  EQU   RPLFDBWD+1                                               00978000
RPLRTNCD EQU   RPLFDBK                                                  00979000
RPLCNDCD EQU   RPLFDBK+1                                                00980000
RPLCMPON EQU   RPLCNDCD                                                 00981000
RPLFDB2  EQU   RPLCMPON                                                 00982000
RPLERRCD EQU   RPLCNDCD+1                                               00983000
RPLFDB3  EQU   RPLERRCD                                                 00984000
RPLKEYLE EQU   RPLCOMN+16                                               00985000
RPLARG   EQU   RPLCOMN+36                                               00986000
RPLOPTCD EQU   RPLCOMN+40                                               00987000
RPLOPT1  EQU   RPLOPTCD                                                 00988000
RPLECBSW EQU   RPLOPT1                                                  00989000
RPLOPT2  EQU   RPLOPTCD+1                                               00990000
RPLADR   EQU   RPLOPT2                                                  00991000
RPLOPT3  EQU   RPLOPTCD+2                                               00992000
RPLOPT4  EQU   RPLOPTCD+3                                               00993000
RPLNXTRP EQU   RPLCOMN+44                                               00994000
RPLOPTC2 EQU   RPLCOMN+56                                               00995000
RPLOPT5  EQU   RPLOPTC2                                                 00996000
RPLWRTYP EQU   RPLOPT5                                                  00997000
RPLOPT6  EQU   RPLOPTC2+1                                               00998000
RPLUNTYP EQU   RPLOPT6                                                  00999000
RPLOPT7  EQU   RPLOPTC2+2                                               01000000
RPLCNOPT EQU   RPLOPT7                                                  01001000
RPLOPT8  EQU   RPLOPTC2+3                                               01002000
RPLRBAR  EQU   RPLCOMN+60                                               01003000
RPLAIXID EQU   RPLRBAR+2                                                01004000
RPLEXTDS EQU   RPLCOMN+68                                               01005000
RPLEXTD1 EQU   RPLEXTDS                                                 01006000
RPLVTEXT EQU   IFGRPL+76                                                01007000
RPLFDBK2 EQU   RPLVTEXT+12                                              01008000
RPLSSNSI EQU   RPLFDBK2                                                 01009000
RPLDSB   EQU   RPLSSNSI                                                 01010000
RPLDSB1  EQU   RPLDSB                                                   01011000
RPLSSEI  EQU   RPLDSB1                                                  01012000
RPLDSB2  EQU   RPLDSB+1                                                 01013000
RPLUSNSI EQU   RPLFDBK2+2                                               01014000
RPLUSFLD EQU   RPLVTEXT+16                                              01015000
RPLOPTC3 EQU   RPLVTEXT+20                                              01016000
RPLOPT9  EQU   RPLOPTC3                                                 01017000
RPLOPT10 EQU   RPLOPTC3+1                                               01018000
RPLOPT11 EQU   RPLOPTC3+2                                               01019000
RPLOPT12 EQU   RPLOPTC3+3                                               01020000
RPLOSENS EQU   RPLVTEXT+24                                              01021000
RPLSSNSO EQU   RPLOSENS                                                 01022000
RPLSSEO  EQU   RPLSSNSO                                                 01023000
RPLOF16  EQU   0                                                        01024000
RPLRH3   EQU   RPLOF16                                                  01025000
RPLSRTYP EQU   RPLOF16+1                                                01026000
RPLSTYPE EQU   RPLSRTYP                                                 01027000
RPLRTYPE EQU   RPLSRTYP                                                 01028000
RPLCHN   EQU   RPLOF16+2                                                01029000
RPLVTFL1 EQU   RPLOF16+3                                                01030000
RPLVTFL2 EQU   RPLOF16+4                                                01031000
RPLPOSTV EQU   RPLVTFL2                                                 01032000
RPLRESP  EQU   RPLVTFL2                                                 01033000
RPLCNTRL EQU   RPLOF16+5                                                01034000
RPLCNTDF EQU   RPLCNTRL                                                 01035000
RPLCNTDC EQU   RPLCNTRL+1                                               01036000
RPLCNTSC EQU   RPLCNTRL+2                                               01037000
RPLOF56  EQU   0                                                        01038000
RPLO5    EQU   RPLOF56                                                  01039000
RPLOF60  EQU   0                                                        01040000
RPLOBSQ  EQU   RPLOF60+4                                                01041000
RPLIBSQ  EQU   RPLOF60+5                                                01042000
FRRS     EQU   0                                                        01043000
FRRSHEAD EQU   FRRS                                                     01044000
FRRSEMP  EQU   FRRSHEAD                                                 01045000
FRRSLAST EQU   FRRSHEAD+4                                               01046000
FRRSELEN EQU   FRRSHEAD+8                                               01047000
FRRSCURR EQU   FRRSHEAD+12                                              01048000
FRRSENTR EQU   0                                                        01049000
FRRSFRRA EQU   FRRSENTR                                                 01050000
FRRSFLGS EQU   FRRSENTR+4                                               01051000
FRRSFLG1 EQU   FRRSFLGS                                                 01052000
FRRSPARM EQU   FRRSENTR+8                                               01053000
ASCB     EQU   0                                                        01054000
ASCBSUPC EQU   ASCB+16                                                  01055000
ASCBASID EQU   ASCB+36                                                  01056000
ASCBTSB  EQU   ASCB+60                                                  01057000
ASCBFW1  EQU   ASCB+100                                                 01058000
ASCBRCTF EQU   ASCBFW1+2                                                01059000
ASCBFLG1 EQU   ASCBFW1+3                                                01060000
ASCBDSP1 EQU   ASCB+114                                                 01061000
ASCBFLG2 EQU   ASCB+115                                                 01062000
ASCBLKGP EQU   ASCB+128                                                 01063000
ASCBSRQ  EQU   ASCB+180                                                 01064000
ASCBSRQ1 EQU   ASCBSRQ                                                  01065000
ASCBSRQ2 EQU   ASCBSRQ+1                                                01066000
ASCBSRQ3 EQU   ASCBSRQ+2                                                01067000
ASCBSRQ4 EQU   ASCBSRQ+3                                                01068000
SCVTSECT EQU   0                                                        01069000
SCVTSTAT EQU   SCVTSECT+148                                             01070000
SDWA     EQU   0                                                        01071000
SDWAPARM EQU   SDWA                                                     01072000
SDWAFIOB EQU   SDWA+4                                                   01073000
SDWAABCC EQU   SDWAFIOB                                                 01074000
SDWACMPF EQU   SDWAABCC                                                 01075000
SDWACMPC EQU   SDWAABCC+1                                               01076000
SDWACTL1 EQU   SDWA+8                                                   01077000
SDWACMKA EQU   SDWACTL1                                                 01078000
SDWAMWPA EQU   SDWACTL1+1                                               01079000
SDWAPMKA EQU   SDWACTL1+4                                               01080000
SDWACTL2 EQU   SDWA+16                                                  01081000
SDWACMKP EQU   SDWACTL2                                                 01082000
SDWAMWPP EQU   SDWACTL2+1                                               01083000
SDWAPMKP EQU   SDWACTL2+4                                               01084000
SDWAGRSV EQU   SDWA+24                                                  01085000
SDWANAME EQU   SDWA+88                                                  01086000
SDWAEC1  EQU   SDWA+104                                                 01087000
SDWAEMK1 EQU   SDWAEC1                                                  01088000
SDWAMWP1 EQU   SDWAEC1+1                                                01089000
SDWAINT1 EQU   SDWAEC1+2                                                01090000
SDWANXT1 EQU   SDWAEC1+4                                                01091000
SDWAAEC1 EQU   SDWA+112                                                 01092000
SDWAILC1 EQU   SDWAAEC1+1                                               01093000
SDWAINC1 EQU   SDWAAEC1+2                                               01094000
SDWAICD1 EQU   SDWAINC1+1                                               01095000
SDWAEC2  EQU   SDWA+120                                                 01096000
SDWAEMK2 EQU   SDWAEC2                                                  01097000
SDWAMWP2 EQU   SDWAEC2+1                                                01098000
SDWAINT2 EQU   SDWAEC2+2                                                01099000
SDWANXT2 EQU   SDWAEC2+4                                                01100000
SDWAAEC2 EQU   SDWA+128                                                 01101000
SDWAILC2 EQU   SDWAAEC2+1                                               01102000
SDWAINC2 EQU   SDWAAEC2+2                                               01103000
SDWAICD2 EQU   SDWAINC2+1                                               01104000
SDWASRSV EQU   SDWA+136                                                 01105000
SDWAIDNT EQU   SDWA+200                                                 01106000
SDWAMCH  EQU   SDWA+204                                                 01107000
SDWASTCK EQU   SDWAMCH                                                  01108000
SDWAMCHI EQU   SDWAMCH+8                                                01109000
SDWAMCHS EQU   SDWAMCHI                                                 01110000
SDWAMCHD EQU   SDWAMCHI+1                                               01111000
SDWARSR1 EQU   SDWAMCH+12                                               01112000
SDWARSR2 EQU   SDWAMCH+13                                               01113000
SDWAFLGS EQU   SDWA+232                                                 01114000
SDWAERRA EQU   SDWAFLGS                                                 01115000
SDWAERRB EQU   SDWAFLGS+1                                               01116000
SDWASRBM EQU   SDWAERRB                                                 01117000
SDWAERRC EQU   SDWAFLGS+2                                               01118000
SDWASTAF EQU   SDWAERRC                                                 01119000
SDWAPERC EQU   SDWAERRC                                                 01120000
SDWAERRD EQU   SDWAFLGS+3                                               01121000
SDWAIOFS EQU   SDWA+238                                                 01122000
SDWARTYA EQU   SDWA+240                                                 01123000
SDWARECA EQU   SDWA+244                                                 01124000
SDWACPUA EQU   SDWA+248                                                 01125000
SDWAPARQ EQU   SDWA+252                                                 01126000
SDWARCDE EQU   SDWAPARQ                                                 01127000
SDWAACF2 EQU   SDWAPARQ+1                                               01128000
SDWARCRD EQU   SDWAACF2                                                 01129000
SDWAUPRG EQU   SDWAACF2                                                 01130000
SDWAACF3 EQU   SDWAPARQ+2                                               01131000
SDWASALL EQU   SDWAACF3                                                 01132000
SDWAACF4 EQU   SDWAPARQ+3                                               01133000
SDWAFLLK EQU   SDWAACF4                                                 01134000
SDWALKWA EQU   SDWA+256                                                 01135000
SDWALKWS EQU   SDWALKWA                                                 01136000
SDWARECP EQU   SDWA+292                                                 01137000
SDWAMODN EQU   SDWARECP                                                 01138000
SDWACSCT EQU   SDWARECP+8                                               01139000
SDWAREXN EQU   SDWARECP+16                                              01140000
SDWASNPA EQU   SDWA+320                                                 01141000
SDWADUMP EQU   SDWASNPA                                                 01142000
SDWADPFS EQU   SDWADUMP+1                                               01143000
SDWADDAT EQU   SDWASNPA+4                                               01144000
SDWASDAT EQU   SDWADDAT                                                 01145000
SDWAPDAT EQU   SDWADDAT+2                                               01146000
SDWADPSA EQU   SDWA+328                                                 01147000
SDWADPSL EQU   SDWADPSA                                                 01148000
SDWARA   EQU   SDWA+400                                                 01149000
SDWADPVA EQU   SDWARA+2                                                 01150000
SDWAHEX  EQU   SDWADPVA                                                 01151000
SDWAURAL EQU   SDWARA+3                                                 01152000
SRBSECT  EQU   0                                                        01153000
SRBFLC   EQU   SRBSECT+12                                               01154000
TSB      EQU   0                                                        01155000
TSBASCBA EQU   TSB                                                      01156000
TSBSTAT  EQU   TSBASCBA                                                 01157000
TSBDISC  EQU   TSBSTAT                                                  01158000
TSBFLG1  EQU   TSB+4                                                    01159000
TSBFLG2  EQU   TSB+16                                                   01160000
TSBFLG3  EQU   TSB+24                                                   01161000
TSBFLG5  EQU   TSB+25                                                   01162000
TSBTERMC EQU   TSB+26                                                   01163000
TSBTERM1 EQU   TSBTERMC                                                 01164000
TSBTERM2 EQU   TSBTERMC+1                                               01165000
TSBSTCC  EQU   TSB+34                                                   01166000
TSBFLG4  EQU   TSB+41                                                   01167000
TSBIWAIT EQU   TSBFLG4                                                  01168000
TSBOWAIT EQU   TSBFLG4                                                  01169000
TSBHUNG  EQU   TSBFLG4                                                  01170000
TSBCANC  EQU   TSBFLG4                                                  01171000
TSBRCB   EQU   TSB+64                                                   01172000
TSBLINKA EQU   TSBRCB+4                                                 01173000
TSBTPOST EQU   TSB+72                                                   01174000
TSBTPFLG EQU   TSBTPOST                                                 01175000
TSBMINL  EQU   TSB+84                                                   01176000
TSBEXTNT EQU   TSB+96                                                   01177000
TSBTRMID EQU   TSB+104                                                  01178000
TSBX     EQU   0                                                        01179000
TSBXFLG1 EQU   TSBX+32                                                  01180000
TSBXTVWA EQU   TSBX+36                                                  01181000
TSBXTIM  EQU   TSBX+40                                                  01182000
TSBXTOM  EQU   TSBX+44                                                  01183000
TSBXTERM EQU   TSBX+72                                                  01184000
IKTFRPRM EQU   0                                                        01185000
FRPCKINF EQU   IKTFRPRM                                                 01186000
FRPCONST EQU   IKTFRPRM+4                                               01187000
FRPRETRY EQU   IKTFRPRM+8                                               01188000
FRPXITPT EQU   IKTFRPRM+12                                              01189000
FRPRPLAD EQU   IKTFRPRM+16                                              01190000
FRPFRFLG EQU   IKTFRPRM+20                                              01191000
FRPOMNGR EQU   FRPFRFLG                                                 01192000
FRPIMNGR EQU   FRPFRFLG                                                 01193000
IKTFRRWA EQU   0                                                        01194000
FRWAFLGS EQU   IKTFRRWA+152                                             01195000
FRWAFL1  EQU   FRWAFLGS                                                 01196000
FRWAPCRE EQU   FRWAFL1                                                  01197000
IKTLTCB  EQU   0                                                        01198000
LTCBFLAG EQU   IKTLTCB+3                                                01199000
LTCBIOER EQU   LTCBFLAG                                                 01200000
LTCBRCUR EQU   LTCBFLAG                                                 01201000
TCAST    EQU   0                                                        01202000
TCASUSER EQU   TCAST+4                                                  01203000
TCASFLG1 EQU   TCAST+88                                                 01204000
TCASSCHD EQU   TCAST+128                                                01205000
TVWA     EQU   0                                                        01206000
TVWATCB  EQU   TVWA+60                                                  01207000
TVWAFRWI EQU   TVWA+76                                                  01208000
TVWAFRWO EQU   TVWA+80                                                  01209000
TVWADLST EQU   TVWA+108                                                 01210000
TVWAECBL EQU   TVWA+160                                                 01211000
TVWAFLAG EQU   TVWA+232                                                 01212000
TVWAFLG1 EQU   TVWAFLAG+1                                               01213000
TVWATOD  EQU   TVWAFLG1                                                 01214000
TVWATIS  EQU   TVWAFLG1                                                 01215000
TVWATID  EQU   TVWAFLG1                                                 01216000
TVWAFLG2 EQU   TVWAFLAG+2                                               01217000
TVWAFLG3 EQU   TVWAFLAG+3                                               01218000
TVWAFLG4 EQU   TVWAFLAG+4                                               01219000
TVWAFLG5 EQU   TVWAFLAG+5                                               01220000
TVWATIR  EQU   TVWAFLG5                                                 01221000
TVWAFLG6 EQU   TVWAFLAG+6                                               01222000
TVWAFLG7 EQU   TVWAFLAG+7                                               01223000
TVWARISW EQU   TVWAFLG7                                                 01224000
TVWAFRRR EQU   TVWAFLG7                                                 01225000
TVWAFLG8 EQU   TVWAFLAG+8                                               01226000
TVWAKEYB EQU   TVWAFLG8                                                 01227000
CONSAREA EQU   0                                                        01228000
MODNAME  EQU   CONSAREA                                                 01229000
FRRNAME  EQU   CONSAREA+8                                               01230000
LMODNAME EQU   CONSAREA+16                                              01231000
REASON   EQU   CONSAREA+24                                              01232000
IKTDOCTV EQU   0                                                        01233000
DOCAREAL EQU   IKTDOCTV                                                 01234000
DOCCKREG EQU   IKTDOCTV+4                                               01235000
DOCCKADD EQU   IKTDOCTV+68                                              01236000
DOCTRMID EQU   IKTDOCTV+72                                              01237000
DOCFLAGS EQU   IKTDOCTV+80                                              01238000
DOCFLG1  EQU   DOCFLAGS                                                 01239000
DOCOPTCD EQU   DOCFLAGS+1                                               01240000
DOCRTNCD EQU   DOCFLAGS+2                                               01241000
DOCFDBK  EQU   DOCFLAGS+3                                               01242000
DOCFDBK2 EQU   DOCFLAGS+4                                               01243000
SAVEREGS EQU   0                                                        01244000
INFODSCT EQU   0                                                        01245000
INFOREGS EQU   INFODSCT                                                 01246000
INFOADDR EQU   INFODSCT+4                                               01247000
IKTIST00 EQU   0                                                        01248000
STATUS   EQU   0                                                        01249000
ISTRPL   EQU   0                                                        01250000
CVTPTR   EQU   FLCCVT                                                   01251000
CVTS01   EQU   CVTPGSIA                                                 01252000
CVTLPDIA EQU   CVTS01+12                                                01253000
CVTDIRST EQU   CVTLPDIA                                                 01254000
CVTSLIDA EQU   CVTS01+24                                                01255000
CVTCTLFG EQU   CVTS01+50                                                01256000
CVTRV210 EQU   CVTS01+424                                               01257000
CVTRV219 EQU   CVTS01+425                                               01258000
CVTRV228 EQU   CVTS01+426                                               01259000
CVTRV237 EQU   CVTS01+427                                               01260000
CVTMFRTR EQU   CVTS01+452                                               01261000
CVTRV262 EQU   CVTS01+468                                               01262000
CVTRV271 EQU   CVTS01+469                                               01263000
CVTRV280 EQU   CVTS01+470                                               01264000
CVTRV289 EQU   CVTS01+471                                               01265000
CVTGSDA  EQU   CVTS01+600                                               01266000
CVTTCASP EQU   CVTS01+664                                               01267000
FLC      EQU   PSA                                                      01268000
PSARSVTE EQU   PSARSVT                                                  01269000
PSACSTK  EQU   PSARSVTE                                                 01270000
SRB      EQU   SRBSECT                                                  01271000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01272000
PSARSAV  EQU   PSARSVTE+60                                              01273000
PSARSTK  EQU   PSARSVTE+56                                              01274000
PSAESAV3 EQU   PSARSVTE+52                                              01275000
PSAESTK3 EQU   PSARSVTE+48                                              01276000
PSAESAV2 EQU   PSARSVTE+44                                              01277000
PSAESTK2 EQU   PSARSVTE+40                                              01278000
PSAESAV1 EQU   PSARSVTE+36                                              01279000
PSAESTK1 EQU   PSARSVTE+32                                              01280000
PSAPSAV  EQU   PSARSVTE+28                                              01281000
PSAPSTK  EQU   PSARSVTE+24                                              01282000
PSAMSAV  EQU   PSARSVTE+20                                              01283000
PSAMSTK  EQU   PSARSVTE+16                                              01284000
PSASSAV  EQU   PSARSVTE+12                                              01285000
PSASSTK  EQU   PSARSVTE+8                                               01286000
PSANSTK  EQU   PSARSVTE+4                                               01287000
CVTRV628 EQU   CVTS01+728                                               01288000
CVTRV627 EQU   CVTS01+724                                               01289000
CVTRV626 EQU   CVTS01+720                                               01290000
CVTRV625 EQU   CVTS01+716                                               01291000
CVTRV624 EQU   CVTS01+712                                               01292000
CVTRV623 EQU   CVTS01+708                                               01293000
CVTRV622 EQU   CVTS01+704                                               01294000
CVTRV621 EQU   CVTS01+700                                               01295000
CVTIHASU EQU   CVTS01+696                                               01296000
CVTSUSP  EQU   CVTS01+692                                               01297000
CVTT6SVC EQU   CVTS01+688                                               01298000
CVTCDAL  EQU   CVTS01+684                                               01299000
CVTTCTL  EQU   CVTS01+680                                               01300000
CVTRSUME EQU   CVTS01+676                                               01301000
CVTJTERM EQU   CVTS01+672                                               01302000
CVTASMRM EQU   CVTS01+668                                               01303000
CVT0PT03 EQU   CVTS01+660                                               01304000
CVT0PT0E EQU   CVTS01+656                                               01305000
CVTRV609 EQU   CVTS01+652                                               01306000
CVTCGK   EQU   CVTS01+648                                               01307000
CVTRAC   EQU   CVTS01+644                                               01308000
CVTRV606 EQU   CVTS01+640                                               01309000
CVTRV605 EQU   CVTS01+636                                               01310000
CVTRV604 EQU   CVTS01+632                                               01311000
CVTEFF02 EQU   CVTS01+628                                               01312000
CVTCBBR  EQU   CVTS01+624                                               01313000
CVTSSCR  EQU   CVTS01+620                                               01314000
CVTEVENT EQU   CVTS01+616                                               01315000
CVTCRCA  EQU   CVTS01+612                                               01316000
CVTTPIO  EQU   CVTS01+608                                               01317000
CVTADV   EQU   CVTS01+604                                               01318000
CVTGSDAB EQU   CVTGSDA                                                  01319000
CVTQV3   EQU   CVTS01+596                                               01320000
CVTQV2   EQU   CVTS01+592                                               01321000
CVTQV1   EQU   CVTS01+588                                               01322000
CVTRPT   EQU   CVTS01+584                                               01323000
CVTSSRB  EQU   CVTS01+580                                               01324000
CVTCSDRL EQU   CVTS01+576                                               01325000
CVTEXP1  EQU   CVTS01+572                                               01326000
CVTRMPMT EQU   CVTS01+568                                               01327000
CVTRMPTT EQU   CVTS01+564                                               01328000
CVTVPSA  EQU   CVTS01+560                                               01329000
CVTVSTOP EQU   CVTS01+556                                               01330000
CVTGTFR8 EQU   CVTS01+552                                               01331000
CVTQUIT  EQU   CVTS01+548                                               01332000
CVTVACR  EQU   CVTS01+544                                               01333000
CVTWTCB  EQU   CVTS01+540                                               01334000
CVTSTPRS EQU   CVTS01+536                                               01335000
CVT0PT02 EQU   CVTS01+532                                               01336000
CVTDARCM EQU   CVTS01+528                                               01337000
CVTIRECM EQU   CVTS01+524                                               01338000
CVTJRECM EQU   CVTS01+520                                               01339000
CVTVEMS0 EQU   CVTS01+516                                               01340000
CVTSPFRR EQU   CVTS01+512                                               01341000
CVTRLSTG EQU   CVTS01+508                                               01342000
CVT0TC0A EQU   CVTS01+504                                               01343000
CVTGMBR  EQU   CVTS01+500                                               01344000
CVTLFRM  EQU   CVTS01+496                                               01345000
CVTRMBR  EQU   CVTS01+492                                               01346000
CVTVIOP  EQU   CVTS01+488                                               01347000
CVTRV307 EQU   CVTS01+486                                               01348000
CVTRV306 EQU   CVTS01+484                                               01349000
CVTRV305 EQU   CVTS01+482                                               01350000
CVTRV304 EQU   CVTS01+480                                               01351000
CVTRV303 EQU   CVTS01+478                                               01352000
CVTRV302 EQU   CVTS01+476                                               01353000
CVTTRCA  EQU   CVTS01+472                                               01354000
CVTRV297 EQU   CVTRV289                                                 01355000
CVTRV296 EQU   CVTRV289                                                 01356000
CVTRV295 EQU   CVTRV289                                                 01357000
CVTRV294 EQU   CVTRV289                                                 01358000
CVTRV293 EQU   CVTRV289                                                 01359000
CVTRV292 EQU   CVTRV289                                                 01360000
CVTRV291 EQU   CVTRV289                                                 01361000
CVTRV290 EQU   CVTRV289                                                 01362000
CVTRV288 EQU   CVTRV280                                                 01363000
CVTRV287 EQU   CVTRV280                                                 01364000
CVTRV286 EQU   CVTRV280                                                 01365000
CVTRV285 EQU   CVTRV280                                                 01366000
CVTRV284 EQU   CVTRV280                                                 01367000
CVTRV283 EQU   CVTRV280                                                 01368000
CVTRV282 EQU   CVTRV280                                                 01369000
CVTRV281 EQU   CVTRV280                                                 01370000
CVTRV279 EQU   CVTRV271                                                 01371000
CVTRV278 EQU   CVTRV271                                                 01372000
CVTRV277 EQU   CVTRV271                                                 01373000
CVTRV276 EQU   CVTRV271                                                 01374000
CVTRV275 EQU   CVTRV271                                                 01375000
CVTRV274 EQU   CVTRV271                                                 01376000
CVTRV273 EQU   CVTRV271                                                 01377000
CVTRV272 EQU   CVTRV271                                                 01378000
CVTRV270 EQU   CVTRV262                                                 01379000
CVTRV269 EQU   CVTRV262                                                 01380000
CVTRV268 EQU   CVTRV262                                                 01381000
CVTRV267 EQU   CVTRV262                                                 01382000
CVTRV266 EQU   CVTRV262                                                 01383000
CVTRV265 EQU   CVTRV262                                                 01384000
CVTRV264 EQU   CVTRV262                                                 01385000
CVTRV263 EQU   CVTRV262                                                 01386000
CVTVFP   EQU   CVTS01+464                                               01387000
CVTVSI   EQU   CVTS01+460                                               01388000
CVTVPSIB EQU   CVTS01+456                                               01389000
CVTMFACT EQU   CVTMFRTR                                                 01390000
CVTMFCTL EQU   CVTS01+448                                               01391000
CVTPVBP  EQU   CVTS01+444                                               01392000
CVTPWI   EQU   CVTS01+440                                               01393000
CVTRV254 EQU   CVTS01+438                                               01394000
CVTRV253 EQU   CVTS01+436                                               01395000
CVTRV252 EQU   CVTS01+434                                               01396000
CVTRV251 EQU   CVTS01+433                                               01397000
CVTRV250 EQU   CVTS01+432                                               01398000
CVTRV249 EQU   CVTS01+431                                               01399000
CVTRV248 EQU   CVTS01+430                                               01400000
CVTRV247 EQU   CVTS01+429                                               01401000
CVTRV246 EQU   CVTS01+428                                               01402000
CVTRV245 EQU   CVTRV237                                                 01403000
CVTRV244 EQU   CVTRV237                                                 01404000
CVTRV243 EQU   CVTRV237                                                 01405000
CVTRV242 EQU   CVTRV237                                                 01406000
CVTRV241 EQU   CVTRV237                                                 01407000
CVTRV240 EQU   CVTRV237                                                 01408000
CVTRV239 EQU   CVTRV237                                                 01409000
CVTRV238 EQU   CVTRV237                                                 01410000
CVTRV236 EQU   CVTRV228                                                 01411000
CVTRV235 EQU   CVTRV228                                                 01412000
CVTRV234 EQU   CVTRV228                                                 01413000
CVTRV233 EQU   CVTRV228                                                 01414000
CVTRV232 EQU   CVTRV228                                                 01415000
CVTRV231 EQU   CVTRV228                                                 01416000
CVTRV230 EQU   CVTRV228                                                 01417000
CVTRV229 EQU   CVTRV228                                                 01418000
CVTRV227 EQU   CVTRV219                                                 01419000
CVTRV226 EQU   CVTRV219                                                 01420000
CVTRV225 EQU   CVTRV219                                                 01421000
CVTRV224 EQU   CVTRV219                                                 01422000
CVTRV223 EQU   CVTRV219                                                 01423000
CVTRV222 EQU   CVTRV219                                                 01424000
CVTRV221 EQU   CVTRV219                                                 01425000
CVTRV220 EQU   CVTRV219                                                 01426000
CVTRV218 EQU   CVTRV210                                                 01427000
CVTRV217 EQU   CVTRV210                                                 01428000
CVTRV216 EQU   CVTRV210                                                 01429000
CVTRV215 EQU   CVTRV210                                                 01430000
CVTRV214 EQU   CVTRV210                                                 01431000
CVTRV213 EQU   CVTRV210                                                 01432000
CVTRV212 EQU   CVTRV210                                                 01433000
CVTRV211 EQU   CVTRV210                                                 01434000
CVTLCCAT EQU   CVTS01+420                                               01435000
CVTPCCAT EQU   CVTS01+416                                               01436000
CVTIPCRP EQU   CVTS01+412                                               01437000
CVTIPCRI EQU   CVTS01+408                                               01438000
CVTIPCDS EQU   CVTS01+404                                               01439000
CVTAIDVT EQU   CVTS01+400                                               01440000
CVTSSAP  EQU   CVTS01+396                                               01441000
CVTEHCIR EQU   CVTS01+392                                               01442000
CVTEHDEF EQU   CVTS01+388                                               01443000
CVTDAIR  EQU   CVTS01+384                                               01444000
CVTPERFM EQU   CVTS01+380                                               01445000
CVT044R2 EQU   CVTS01+376                                               01446000
CVTFETCH EQU   CVTS01+372                                               01447000
CVTRSTWD EQU   CVTS01+368                                               01448000
CVTSPOST EQU   CVTS01+364                                               01449000
CVTIOBP  EQU   CVTS01+360                                               01450000
CVTASMVT EQU   CVTS01+356                                               01451000
CVTRECRQ EQU   CVTS01+352                                               01452000
CVTWSAC  EQU   CVTS01+348                                               01453000
CVTRV149 EQU   CVTS01+344                                               01454000
CVTWSAL  EQU   CVTS01+340                                               01455000
CVTSPSA  EQU   CVTS01+336                                               01456000
CVTGLMN  EQU   CVTS01+332                                               01457000
CVTVEAC0 EQU   CVTS01+328                                               01458000
CVT062R1 EQU   CVTS01+324                                               01459000
CVTRPOST EQU   CVTS01+320                                               01460000
CVTDQIQE EQU   CVTS01+316                                               01461000
CVTCSD   EQU   CVTS01+312                                               01462000
CVTLKRMA EQU   CVTS01+308                                               01463000
CVTRSPIE EQU   CVTS01+304                                               01464000
CVTRENQ  EQU   CVTS01+300                                               01465000
CVTLQCB  EQU   CVTS01+296                                               01466000
CVTFQCB  EQU   CVTS01+292                                               01467000
CVTQCS01 EQU   CVTS01+288                                               01468000
CVTAPFT  EQU   CVTS01+284                                               01469000
CVTPARRL EQU   CVTS01+280                                               01470000
CVTVWAIT EQU   CVTS01+276                                               01471000
CVTGSPL  EQU   CVTS01+272                                               01472000
CVTLSMQ  EQU   CVTS01+268                                               01473000
CVTGSMQ  EQU   CVTS01+264                                               01474000
CVTEXPRO EQU   CVTS01+260                                               01475000
CVTOPCTP EQU   CVTS01+256                                               01476000
CVTSIC   EQU   CVTS01+252                                               01477000
CVTTPIOS EQU   CVTS01+248                                               01478000
CVTRTMS  EQU   CVTS01+244                                               01479000
CVTSDBF  EQU   CVTS01+240                                               01480000
CVTSCBP  EQU   CVTS01+236                                               01481000
CVTSDMP  EQU   CVTS01+232                                               01482000
CVTSV60  EQU   CVTS01+228                                               01483000
CVTRTMCT EQU   CVTS01+224                                               01484000
CVTASCBL EQU   CVTS01+220                                               01485000
CVTASCBH EQU   CVTS01+216                                               01486000
CVTGDA   EQU   CVTS01+212                                               01487000
CVTASVT  EQU   CVTS01+208                                               01488000
CVTVVMDI EQU   CVTS01+204                                               01489000
CVTAQTOP EQU   CVTS01+200                                               01490000
CVTIOSCS EQU   CVTS01+196                                               01491000
CVTSDRM  EQU   CVTS01+192                                               01492000
CVTOPTE  EQU   CVTS01+188                                               01493000
CVTSTXU  EQU   CVTS01+184                                               01494000
CVTQUIS  EQU   CVTS01+180                                               01495000
CVTPARS  EQU   CVTS01+176                                               01496000
CVTS1EE  EQU   CVTS01+172                                               01497000
CVTFRAS  EQU   CVTS01+168                                               01498000
CVTQSAS  EQU   CVTS01+164                                               01499000
CVTCRAS  EQU   CVTS01+160                                               01500000
CVTCRMN  EQU   CVTS01+156                                               01501000
CVTDELCP EQU   CVTS01+152                                               01502000
CVTFRECL EQU   CVTS01+148                                               01503000
CVTGETCL EQU   CVTS01+144                                               01504000
CVTBLDCP EQU   CVTS01+140                                               01505000
CVTAUTHL EQU   CVTS01+136                                               01506000
CVTSCAN  EQU   CVTS01+132                                               01507000
CVTRV144 EQU   CVTS01+130                                               01508000
CVTMAXMP EQU   CVTS01+128                                               01509000
CVTSTCK  EQU   CVTS01+124                                               01510000
CVTRV139 EQU   CVTS01+123                                               01511000
CVTDSSAC EQU   CVTS01+122                                               01512000
CVTRV513 EQU   CVTS01+121                                               01513000
CVTIOSPL EQU   CVTS01+120                                               01514000
CVTPTGT  EQU   CVTS01+116                                               01515000
CVTCSPIE EQU   CVTS01+112                                               01516000
CVTSMFEX EQU   CVTS01+108                                               01517000
CVTOLT0A EQU   CVTS01+104                                               01518000
CVTSRBRT EQU   CVTS01+100                                               01519000
CVTPUTL  EQU   CVTS01+96                                                01520000
CVTASCRL EQU   CVTS01+92                                                01521000
CVTASCRF EQU   CVTS01+88                                                01522000
CVTRV326 EQU   CVTS01+84                                                01523000
CVTRV325 EQU   CVTS01+80                                                01524000
CVTRV324 EQU   CVTS01+76                                                01525000
CVT0VL01 EQU   CVTS01+72                                                01526000
CVTSHRVM EQU   CVTS01+68                                                01527000
CVTRV332 EQU   CVTS01+64                                                01528000
CVTTAS   EQU   CVTS01+60                                                01529000
CVTRSCN  EQU   CVTS01+56                                                01530000
CVTTRAC2 EQU   CVTS01+54                                                01531000
CVTTRACE EQU   CVTS01+52                                                01532000
CVTAPG   EQU   CVTS01+51                                                01533000
CVTSDTRC EQU   CVTCTLFG                                                 01534000
CVTGTRCE EQU   CVTCTLFG                                                 01535000
CVTNOMP  EQU   CVTCTLFG                                                 01536000
CVTRSV79 EQU   CVTCTLFG                                                 01537000
CVTDSTAT EQU   CVTCTLFG                                                 01538000
CVTRSV78 EQU   CVTCTLFG                                                 01539000
CVTRV333 EQU   CVTCTLFG                                                 01540000
CVTRV323 EQU   CVTCTLFG                                                 01541000
CVTSPVLK EQU   CVTS01+49                                                01542000
CVTRSV77 EQU   CVTS01+48                                                01543000
CVTRV331 EQU   CVTS01+44                                                01544000
CVTRV330 EQU   CVTS01+40                                                01545000
CVTRV329 EQU   CVTS01+36                                                01546000
CVTRV328 EQU   CVTS01+32                                                01547000
CVTRV322 EQU   CVTS01+28                                                01548000
CVTSLID  EQU   CVTSLIDA+1                                               01549000
CVTSYLK  EQU   CVTSLIDA                                                 01550000
CVTRV321 EQU   CVTS01+20                                                01551000
CVTRV320 EQU   CVTS01+16                                                01552000
CVTLPDIR EQU   CVTLPDIA+1                                               01553000
CVTRSV69 EQU   CVTDIRST                                                 01554000
CVTRSV68 EQU   CVTDIRST                                                 01555000
CVTRSV67 EQU   CVTDIRST                                                 01556000
CVTRSV66 EQU   CVTDIRST                                                 01557000
CVTRSV65 EQU   CVTDIRST                                                 01558000
CVTRSV64 EQU   CVTDIRST                                                 01559000
CVTRSV63 EQU   CVTDIRST                                                 01560000
CVTDICOM EQU   CVTDIRST                                                 01561000
CVTPVTP  EQU   CVTS01+8                                                 01562000
CVTLPDSR EQU   CVTS01+4                                                 01563000
CVTGETL  EQU   CVTS01                                                   01564000
@NM00183 EQU   DOCFLG1                                                  01565000
DOCF1B1  EQU   DOCFLG1                                                  01566000
DOCF1B0  EQU   DOCFLG1                                                  01567000
DOCREG15 EQU   DOCCKREG+60                                              01568000
DOCREG14 EQU   DOCCKREG+56                                              01569000
DOCREG13 EQU   DOCCKREG+52                                              01570000
DOCREG12 EQU   DOCCKREG+48                                              01571000
DOCREG11 EQU   DOCCKREG+44                                              01572000
DOCREG10 EQU   DOCCKREG+40                                              01573000
DOCREG09 EQU   DOCCKREG+36                                              01574000
DOCREG08 EQU   DOCCKREG+32                                              01575000
DOCREG07 EQU   DOCCKREG+28                                              01576000
DOCREG06 EQU   DOCCKREG+24                                              01577000
DOCREG05 EQU   DOCCKREG+20                                              01578000
DOCREG04 EQU   DOCCKREG+16                                              01579000
DOCREG03 EQU   DOCCKREG+12                                              01580000
DOCREG02 EQU   DOCCKREG+8                                               01581000
DOCREG01 EQU   DOCCKREG+4                                               01582000
DOCREG00 EQU   DOCCKREG                                                 01583000
DOCLENUS EQU   DOCAREAL+2                                               01584000
DOCLENAC EQU   DOCAREAL                                                 01585000
TVWAEND  EQU   TVWA+248                                                 01586000
TVWAFLGF EQU   TVWAFLAG+15                                              01587000
TVWAFLGE EQU   TVWAFLAG+14                                              01588000
TVWAFLGD EQU   TVWAFLAG+13                                              01589000
TVWAFLGC EQU   TVWAFLAG+12                                              01590000
TVWAFLGB EQU   TVWAFLAG+11                                              01591000
TVWAFLGA EQU   TVWAFLAG+10                                              01592000
TVWAFLG9 EQU   TVWAFLAG+9                                               01593000
@NM00182 EQU   TVWAFLG8                                                 01594000
TVWAKEYP EQU   TVWAKEYB                                                 01595000
TVWAKEYL EQU   TVWAKEYB                                                 01596000
TVWADIRS EQU   TVWAFLG8                                                 01597000
TVWABRKT EQU   TVWAFLG8                                                 01598000
@NM00181 EQU   TVWAFLG7                                                 01599000
@NM00180 EQU   TVWAFLG7                                                 01600000
@NM00179 EQU   TVWAFLG7                                                 01601000
TVWARDBF EQU   TVWAFLG7                                                 01602000
TVWATGET EQU   TVWAFLG7                                                 01603000
TVWABKPG EQU   TVWAFLG7                                                 01604000
TVWASCSW EQU   TVWAFLG6                                                 01605000
TVWALTS  EQU   TVWAFLG6                                                 01606000
@NM00178 EQU   TVWAFLG6                                                 01607000
TVWAFMEW EQU   TVWAFLG6                                                 01608000
TVWARCDT EQU   TVWAFLG6                                                 01609000
@NM00177 EQU   TVWAFLG6                                                 01610000
TVWAIOTR EQU   TVWAFLG6                                                 01611000
TVWAISYS EQU   TVWAFLG6                                                 01612000
TVWAP1ST EQU   TVWAFLG5                                                 01613000
TVWAPRMT EQU   TVWAFLG5                                                 01614000
TVWANFSP EQU   TVWAFLG5                                                 01615000
TVWAFSW  EQU   TVWAFLG5                                                 01616000
@NM00176 EQU   TVWAFLG5                                                 01617000
TVWAFSM  EQU   TVWAFLG5                                                 01618000
@NM00175 EQU   TVWAFLG5                                                 01619000
@NM00174 EQU   TVWAFLG4                                                 01620000
TVWARCRS EQU   TVWAFLG4                                                 01621000
TVWAQMEV EQU   TVWAFLG4                                                 01622000
@NM00173 EQU   TVWAFLG4                                                 01623000
TVWANOFB EQU   TVWAFLG4                                                 01624000
@NM00172 EQU   TVWAFLG4                                                 01625000
TVWADOOQ EQU   TVWAFLG4                                                 01626000
TVWAFMSC EQU   TVWAFLG4                                                 01627000
TVWATRDF EQU   TVWAFLG3                                                 01628000
TVWATRAN EQU   TVWAFLG3                                                 01629000
@NM00171 EQU   TVWAFLG3                                                 01630000
TVWAQMIO EQU   TVWAFLG3                                                 01631000
TVWAQMRT EQU   TVWAFLG3                                                 01632000
TVWAAIGN EQU   TVWAFLG3                                                 01633000
TVWASDSG EQU   TVWAFLG3                                                 01634000
TVWABRIN EQU   TVWAFLG3                                                 01635000
TVWABIR  EQU   TVWAFLG2                                                 01636000
@NM00170 EQU   TVWAFLG2                                                 01637000
TVWANLRQ EQU   TVWAFLG2                                                 01638000
TVWAERMG EQU   TVWAFLG2                                                 01639000
@NM00169 EQU   TVWAFLG2                                                 01640000
@NM00168 EQU   TVWAFLG2                                                 01641000
TVWAPGN  EQU   TVWAFLG2                                                 01642000
TVWAENDS EQU   TVWAFLG2                                                 01643000
TVWAOOPS EQU   TVWAFLG1                                                 01644000
TVWALTE  EQU   TVWAFLG1                                                 01645000
TVWAILE  EQU   TVWAFLG1                                                 01646000
TVWAXSCD EQU   TVWAFLG1                                                 01647000
TVWATAS  EQU   TVWAFLG1                                                 01648000
TVWAFLG0 EQU   TVWAFLAG                                                 01649000
TVWAUSRA EQU   TVWA+224                                                 01650000
@NM00167 EQU   TVWA+218                                                 01651000
TVWARTR  EQU   TVWA+216                                                 01652000
TVWARMAX EQU   TVWA+214                                                 01653000
TVWAATTN EQU   TVWA+212                                                 01654000
@NM00166 EQU   TVWA+205                                                 01655000
TVWARSHW EQU   TVWA+204                                                 01656000
TVWAWLSZ EQU   TVWA+202                                                 01657000
TVWAWLNO EQU   TVWA+200                                                 01658000
TVWALNCT EQU   TVWA+198                                                 01659000
TVWALNSV EQU   TVWA+196                                                 01660000
TVWATRNM EQU   TVWA+188                                                 01661000
TVWAATBO EQU   TVWA+184                                                 01662000
TVWAATBI EQU   TVWA+180                                                 01663000
TVWATABO EQU   TVWA+176                                                 01664000
TVWATABI EQU   TVWA+172                                                 01665000
TVWAECB3 EQU   TVWAECBL+8                                               01666000
TVWAECB2 EQU   TVWAECBL+4                                               01667000
TVWAECB1 EQU   TVWAECBL                                                 01668000
TVWATECB EQU   TVWA+156                                                 01669000
TVWAECB  EQU   TVWA+152                                                 01670000
@NM00165 EQU   TVWADLST+12                                              01671000
TVWADIN3 EQU   TVWADLST+8                                               01672000
TVWADIN2 EQU   TVWADLST+4                                               01673000
TVWADIN1 EQU   TVWADLST                                                 01674000
TVWAVSZ  EQU   TVWA+104                                                 01675000
TVWAVST  EQU   TVWA+100                                                 01676000
TVWAEXL  EQU   TVWA+96                                                  01677000
TVWARPL  EQU   TVWA+92                                                  01678000
TVWANIB  EQU   TVWA+88                                                  01679000
TVWAACB  EQU   TVWA+84                                                  01680000
TVWACHNL EQU   TVWA+74                                                  01681000
TVWACLSZ EQU   TVWA+72                                                  01682000
TVWALBUF EQU   TVWA+68                                                  01683000
TVWAHBUF EQU   TVWA+64                                                  01684000
TVWAUSMN EQU   TVWA+56                                                  01685000
@NM00164 EQU   TVWA+52                                                  01686000
TVWACPID EQU   TVWA+48                                                  01687000
TVWAEOQ  EQU   TVWA+44                                                  01688000
TVWANOM  EQU   TVWA+40                                                  01689000
TVWABOQ  EQU   TVWA+36                                                  01690000
TVWAEIQ  EQU   TVWA+32                                                  01691000
TVWANIM  EQU   TVWA+28                                                  01692000
TVWABIQ  EQU   TVWA+24                                                  01693000
TVWAQMWA EQU   TVWA+20                                                  01694000
TVWALLWA EQU   TVWA+16                                                  01695000
TVWATOMW EQU   TVWA+12                                                  01696000
TVWATIMW EQU   TVWA+8                                                   01697000
TVWAPPL  EQU   TVWA                                                     01698000
TCASTEND EQU   TCAST+148                                                01699000
TCASTTYO EQU   TCAST+144                                                01700000
TCAS767O EQU   TCAST+140                                                01701000
TCAS767I EQU   TCAST+136                                                01702000
TCASDUMP EQU   TCAST+132                                                01703000
TCASTPND EQU   TCAST+124                                                01704000
TCASOMJR EQU   TCAST+120                                                01705000
@NM00163 EQU   TCAST+118                                                01706000
TCASBR14 EQU   TCAST+116                                                01707000
TCASATTN EQU   TCAST+112                                                01708000
TCASASCI EQU   TCAST+108                                                01709000
TCASTTQH EQU   TCAST+104                                                01710000
@NM00162 EQU   TCAST+102                                                01711000
@NM00161 EQU   TCAST+100                                                01712000
@NM00160 EQU   TCAST+98                                                 01713000
@NM00159 EQU   TCAST+96                                                 01714000
TCASASCB EQU   TCAST+92                                                 01715000
TCASFLG4 EQU   TCAST+91                                                 01716000
TCASFLG3 EQU   TCAST+90                                                 01717000
TCASFLG2 EQU   TCAST+89                                                 01718000
@NM00158 EQU   TCASFLG1                                                 01719000
TCASNACT EQU   TCASFLG1                                                 01720000
TCASVSD  EQU   TCASFLG1                                                 01721000
TCASABND EQU   TCASFLG1                                                 01722000
TCASMDSW EQU   TCASFLG1                                                 01723000
TCASBKMD EQU   TCASFLG1                                                 01724000
TCASLTE  EQU   TCAST+84                                                 01725000
TCASEXIT EQU   TCAST+80                                                 01726000
TCASOQM  EQU   TCAST+76                                                 01727000
TCASIQM  EQU   TCAST+72                                                 01728000
TCASTSB  EQU   TCAST+68                                                 01729000
TCASTTL  EQU   TCAST+64                                                 01730000
TCASWA   EQU   TCAST+60                                                 01731000
TCASFRR  EQU   TCAST+56                                                 01732000
TCASMSGS EQU   TCAST+52                                                 01733000
TCASDATO EQU   TCAST+48                                                 01734000
TCASDATI EQU   TCAST+44                                                 01735000
TCASXECB EQU   TCAST+40                                                 01736000
TCASTID  EQU   TCAST+32                                                 01737000
@NM00157 EQU   TCAST+31                                                 01738000
TCASCHNL EQU   TCAST+30                                                 01739000
TCASCRSZ EQU   TCAST+28                                                 01740000
TCASLBUF EQU   TCAST+24                                                 01741000
TCASHBUF EQU   TCAST+20                                                 01742000
TCASCLSZ EQU   TCAST+18                                                 01743000
TCASRCON EQU   TCAST+16                                                 01744000
TCASACBP EQU   TCAST+8                                                  01745000
TCASUMAX EQU   TCASUSER+2                                               01746000
TCASUSEC EQU   TCASUSER                                                 01747000
TCASID   EQU   TCAST                                                    01748000
@NM00156 EQU   LTCBFLAG                                                 01749000
LTCBCHSE EQU   LTCBFLAG                                                 01750000
@NM00155 EQU   IKTLTCB                                                  01751000
@NM00154 EQU   FRWAFLGS+1                                               01752000
@NM00153 EQU   FRWAFL1                                                  01753000
FRWAEXRG EQU   IKTFRRWA+88                                              01754000
FRWACKRG EQU   IKTFRRWA+24                                              01755000
FRWAEXIT EQU   IKTFRRWA+16                                              01756000
FRWARTRY EQU   IKTFRRWA+8                                               01757000
FRWACKPT EQU   IKTFRRWA                                                 01758000
@NM00152 EQU   IKTFRPRM+21                                              01759000
@NM00151 EQU   FRPFRFLG                                                 01760000
TSBXEND  EQU   TSBX+128                                                 01761000
@NM00150 EQU   TSBX+124                                                 01762000
TSBXDMMO EQU   TSBX+120                                                 01763000
TSBXDMMI EQU   TSBX+116                                                 01764000
TSBXBIND EQU   TSBX+80                                                  01765000
TSBXRPL  EQU   TSBX+76                                                  01766000
TSBXTMBF EQU   TSBXTERM+2                                               01767000
TSBXSUBT EQU   TSBXTERM+1                                               01768000
TSBXTMTP EQU   TSBXTERM                                                 01769000
TSBXAIND EQU   TSBX+70                                                  01770000
TSBXRSZO EQU   TSBX+69                                                  01771000
TSBXRSZI EQU   TSBX+68                                                  01772000
TSBXLBUF EQU   TSBX+64                                                  01773000
TSBXCSAP EQU   TSBX+60                                                  01774000
TSBXSRB  EQU   TSBX+56                                                  01775000
TSBXSRBI EQU   TSBX+52                                                  01776000
@NM00149 EQU   TSBX+48                                                  01777000
TSBXDPMO EQU   TSBXTOM                                                  01778000
TSBXDPMI EQU   TSBXTIM                                                  01779000
TSBXFLG4 EQU   TSBX+35                                                  01780000
TSBXFLG3 EQU   TSBX+34                                                  01781000
TSBXFLG2 EQU   TSBX+33                                                  01782000
@NM00148 EQU   TSBXFLG1                                                 01783000
TSBXNOSW EQU   TSBXFLG1                                                 01784000
TSBXWREC EQU   TSBXFLG1                                                 01785000
TSBXLOGF EQU   TSBXFLG1                                                 01786000
TSBXACTV EQU   TSBXFLG1                                                 01787000
TSBXASCI EQU   TSBXFLG1                                                 01788000
TSBXUID  EQU   TSBX+24                                                  01789000
@NM00147 EQU   TSBX+16                                                  01790000
@NM00146 EQU   TSBX+12                                                  01791000
TSBXECB  EQU   TSBX+8                                                   01792000
TSBXBCK  EQU   TSBX+4                                                   01793000
TSBXFWD  EQU   TSBX                                                     01794000
TSBEND   EQU   TSB+120                                                  01795000
TSBSF1   EQU   TSB+112                                                  01796000
TSBALTC  EQU   TSB+103                                                  01797000
TSBALTR  EQU   TSB+102                                                  01798000
TSBPRMC  EQU   TSB+101                                                  01799000
TSBPRMR  EQU   TSB+100                                                  01800000
TSBPSWD  EQU   TSB+88                                                   01801000
TSBLECB  EQU   TSBMINL                                                  01802000
TSBLINE  EQU   TSB+82                                                   01803000
TSBSTAX  EQU   TSB+81                                                   01804000
TSBATTNC EQU   TSB+80                                                   01805000
TSBF1V   EQU   TSBTPOST+7                                               01806000
TSBF1M   EQU   TSBTPOST+6                                               01807000
TSBF2V   EQU   TSBTPOST+5                                               01808000
TSBF2M   EQU   TSBTPOST+4                                               01809000
TSBFLAGV EQU   TSBTPOST+3                                               01810000
TSBFLAGM EQU   TSBTPOST+2                                               01811000
@NM00145 EQU   TSBTPOST+1                                               01812000
@NM00144 EQU   TSBTPFLG                                                 01813000
@NM00143 EQU   TSBTPFLG                                                 01814000
@NM00142 EQU   TSBTPFLG                                                 01815000
@NM00141 EQU   TSBTPFLG                                                 01816000
TSBNEWID EQU   TSBTPFLG                                                 01817000
TSBTPAYI EQU   TSBTPFLG                                                 01818000
TSBTPQCB EQU   TSBTPFLG                                                 01819000
TSBPOSTO EQU   TSBTPFLG                                                 01820000
TSBLINKB EQU   TSBLINKA+1                                               01821000
TSBPRI   EQU   TSBLINKA                                                 01822000
TSBRQCB  EQU   TSBRCB                                                   01823000
TSBCTCB  EQU   TSB+60                                                   01824000
TSBERSDS EQU   TSB+56                                                   01825000
TSBAUTOI EQU   TSB+52                                                   01826000
TSBAUTOS EQU   TSB+48                                                   01827000
TSBATNCC EQU   TSB+44                                                   01828000
TSBASRCE EQU   TSB+42                                                   01829000
TSBHLDL  EQU   TSBFLG4                                                  01830000
TSBGETBF EQU   TSBFLG4                                                  01831000
TSBHOLD  EQU   TSBFLG4                                                  01832000
TSBOCAB  EQU   TSBFLG4                                                  01833000
TSBLNNO  EQU   TSB+40                                                   01834000
TSBATNTC EQU   TSB+38                                                   01835000
TSBATNLC EQU   TSB+36                                                   01836000
TSBCHDCC EQU   TSBSTCC+1                                                01837000
TSBLNDCC EQU   TSBSTCC                                                  01838000
TSBWTJID EQU   TSB+32                                                   01839000
TSBECB   EQU   TSB+28                                                   01840000
TSBC1050 EQU   TSBTERM2                                                 01841000
@NM00140 EQU   TSBTERM2                                                 01842000
@NM00139 EQU   TSBTERM2                                                 01843000
@NM00138 EQU   TSBTERM2                                                 01844000
@NM00137 EQU   TSBTERM2                                                 01845000
TSBCTWX  EQU   TSBTERM2                                                 01846000
@NM00136 EQU   TSBTERM2                                                 01847000
@NM00135 EQU   TSBTERM2                                                 01848000
@NM00134 EQU   TSBTERM1                                                 01849000
@NM00133 EQU   TSBTERM1                                                 01850000
@NM00132 EQU   TSBTERM1                                                 01851000
TSBC2741 EQU   TSBTERM1                                                 01852000
TSBC5041 EQU   TSBTERM1                                                 01853000
TSBCATTN EQU   TSBTERM1                                                 01854000
TSBCBRK  EQU   TSBTERM1                                                 01855000
TSBCIHBN EQU   TSBTERM1                                                 01856000
TSBVTAM  EQU   TSBFLG5                                                  01857000
TSBKEYS  EQU   TSBFLG5                                                  01858000
TSBNEDIT EQU   TSBFLG5                                                  01859000
TSBQRY   EQU   TSBFLG5                                                  01860000
@NM00131 EQU   TSBFLG5                                                  01861000
TSBSPF   EQU   TSBFLG5                                                  01862000
TSBATMP  EQU   TSBFLG5                                                  01863000
TSBNFLOP EQU   TSBFLG3                                                  01864000
TSBNOBRK EQU   TSBFLG3                                                  01865000
TSBTPUT  EQU   TSBFLG3                                                  01866000
TSBAWOIP EQU   TSBFLG3                                                  01867000
TSBNBKSP EQU   TSBFLG3                                                  01868000
TSBSPIT  EQU   TSBFLG3                                                  01869000
TSBTJMSG EQU   TSBFLG3                                                  01870000
TSBATTN  EQU   TSBFLG3                                                  01871000
TSBIBFP  EQU   TSB+21                                                   01872000
TSBNIBF  EQU   TSB+20                                                   01873000
TSBITBFP EQU   TSB+17                                                   01874000
TSBSATN2 EQU   TSBFLG2                                                  01875000
TSBSATN1 EQU   TSBFLG2                                                  01876000
TSBSTAUT EQU   TSBFLG2                                                  01877000
TSBAUTOC EQU   TSBFLG2                                                  01878000
TSBAULST EQU   TSBFLG2                                                  01879000
TSBBRKIN EQU   TSBFLG2                                                  01880000
TSBAUTON EQU   TSBFLG2                                                  01881000
TSBBIPI  EQU   TSBFLG2                                                  01882000
TSBOBFP  EQU   TSB+13                                                   01883000
TSBNOBF  EQU   TSB+12                                                   01884000
TSBOTBFP EQU   TSB+9                                                    01885000
TSBLNSZ  EQU   TSB+8                                                    01886000
TSBWTCB  EQU   TSB+5                                                    01887000
TSBTJBF  EQU   TSBFLG1                                                  01888000
TSBTJIP  EQU   TSBFLG1                                                  01889000
TSBTJOW  EQU   TSBFLG1                                                  01890000
TSBIFLSH EQU   TSBFLG1                                                  01891000
TSBWOWIP EQU   TSBFLG1                                                  01892000
TSBOWIP  EQU   TSBFLG1                                                  01893000
TSBOFLSH EQU   TSBFLG1                                                  01894000
TSBANSR  EQU   TSBFLG1                                                  01895000
TSBASCB  EQU   TSBASCBA+1                                               01896000
TSBATNLD EQU   TSBSTAT                                                  01897000
TSB3270  EQU   TSBSTAT                                                  01898000
TSBITOFF EQU   TSBSTAT                                                  01899000
TSBNOBUF EQU   TSBSTAT                                                  01900000
TSBDSPLY EQU   TSBSTAT                                                  01901000
TSBLWAIT EQU   TSBSTAT                                                  01902000
TSBINUSE EQU   TSBSTAT                                                  01903000
@NM00130 EQU   SRBSECT+40                                               01904000
@NM00129 EQU   SRBSECT+38                                               01905000
SRBPRIOR EQU   SRBSECT+37                                               01906000
SRBPKF   EQU   SRBSECT+36                                               01907000
SRBSAVE  EQU   SRBSECT+32                                               01908000
SRBPARM  EQU   SRBSECT+28                                               01909000
SRBRMTR  EQU   SRBSECT+24                                               01910000
SRBEP    EQU   SRBSECT+20                                               01911000
SRBPTCB  EQU   SRBFLC+4                                                 01912000
SRBPASID EQU   SRBFLC+2                                                 01913000
SRBCPAFF EQU   SRBFLC                                                   01914000
SRBASCB  EQU   SRBSECT+8                                                01915000
SRBFLNK  EQU   SRBSECT+4                                                01916000
SRBID    EQU   SRBSECT                                                  01917000
@NM00128 EQU   SDWA+512                                                 01918000
SDWAVRA  EQU   SDWARA+4                                                 01919000
@NM00127 EQU   SDWADPVA                                                 01920000
SDWAEBC  EQU   SDWADPVA                                                 01921000
SDWAVRAL EQU   SDWARA                                                   01922000
@NM00126 EQU   SDWA+396                                                 01923000
SDWACOMP EQU   SDWA+392                                                 01924000
SDWARCPL EQU   SDWA+364                                                 01925000
@NM00125 EQU   SDWADPSA+32                                              01926000
SDWATO4  EQU   SDWADPSL+28                                              01927000
SDWAFRM4 EQU   SDWADPSL+24                                              01928000
SDWATO3  EQU   SDWADPSL+20                                              01929000
SDWAFRM3 EQU   SDWADPSL+16                                              01930000
SDWATO2  EQU   SDWADPSL+12                                              01931000
SDWAFRM2 EQU   SDWADPSL+8                                               01932000
SDWATO1  EQU   SDWADPSL+4                                               01933000
SDWAFRM1 EQU   SDWADPSL                                                 01934000
@NM00124 EQU   SDWADDAT+3                                               01935000
@NM00123 EQU   SDWAPDAT                                                 01936000
SDWAUSPL EQU   SDWAPDAT                                                 01937000
SDWADPSW EQU   SDWAPDAT                                                 01938000
SDWATJPA EQU   SDWAPDAT                                                 01939000
SDWATLPA EQU   SDWAPDAT                                                 01940000
SDWADREG EQU   SDWAPDAT                                                 01941000
SDWADSAH EQU   SDWAPDAT                                                 01942000
SDWADSAS EQU   SDWAPDAT                                                 01943000
@NM00122 EQU   SDWADDAT+1                                               01944000
@NM00121 EQU   SDWASDAT                                                 01945000
SDWAQQS  EQU   SDWASDAT                                                 01946000
SDWACBS  EQU   SDWASDAT                                                 01947000
SDWAGTF  EQU   SDWASDAT                                                 01948000
SDWASWA  EQU   SDWASDAT                                                 01949000
SDWALSQA EQU   SDWASDAT                                                 01950000
SDWASQA  EQU   SDWASDAT                                                 01951000
SDWANUC  EQU   SDWASDAT                                                 01952000
@NM00120 EQU   SDWADUMP+2                                               01953000
@NM00119 EQU   SDWADPFS                                                 01954000
SDWASLST EQU   SDWADPFS                                                 01955000
@NM00118 EQU   SDWADPFS                                                 01956000
SDWADLST EQU   SDWADPFS                                                 01957000
SDWADPT  EQU   SDWADPFS                                                 01958000
SDWADPID EQU   SDWADUMP                                                 01959000
SDWADPLA EQU   SDWA+316                                                 01960000
@NM00117 EQU   SDWALKWA+32                                              01961000
SDWATALW EQU   SDWALKWS+28                                              01962000
SDWATDLW EQU   SDWALKWS+24                                              01963000
SDWATNLW EQU   SDWALKWS+20                                              01964000
SDWAAPLW EQU   SDWALKWS+16                                              01965000
SDWAIPLW EQU   SDWALKWS+12                                              01966000
SDWAILLW EQU   SDWALKWS+8                                               01967000
SDWAIULW EQU   SDWALKWS+4                                               01968000
SDWAICLW EQU   SDWALKWS                                                 01969000
SDWACMS  EQU   SDWAACF4                                                 01970000
SDWAOPTM EQU   SDWAACF4                                                 01971000
SDWATADB EQU   SDWAACF4                                                 01972000
SDWATDNB EQU   SDWAACF4                                                 01973000
SDWATNCB EQU   SDWAACF4                                                 01974000
SDWAILCH EQU   SDWAACF4                                                 01975000
SDWAIUCB EQU   SDWAACF4                                                 01976000
SDWAICAT EQU   SDWAACF3                                                 01977000
SDWAIPRG EQU   SDWAACF3                                                 01978000
SDWAASMP EQU   SDWAACF3                                                 01979000
SDWADISP EQU   SDWAACF3                                                 01980000
@NM00116 EQU   SDWAACF3                                                 01981000
@NM00115 EQU   SDWAACF2                                                 01982000
SDWAFREE EQU   SDWAACF2                                                 01983000
@NM00114 EQU   SDWAACF2                                                 01984000
SDWASPIN EQU   SDWAACF2                                                 01985000
@NM00113 EQU   SDWAACF2                                                 01986000
SDWALCPU EQU   SDWACPUA+2                                               01987000
@NM00112 EQU   SDWACPUA                                                 01988000
@NM00111 EQU   SDWA+239                                                 01989000
@NM00110 EQU   SDWAIOFS                                                 01990000
SDWANIOP EQU   SDWAIOFS                                                 01991000
SDWANOIO EQU   SDWAIOFS                                                 01992000
SDWAIOHT EQU   SDWAIOFS                                                 01993000
SDWAIOQR EQU   SDWAIOFS                                                 01994000
SDWAFMID EQU   SDWA+236                                                 01995000
@NM00109 EQU   SDWAERRD                                                 01996000
SDWAMCIV EQU   SDWAERRD                                                 01997000
SDWARPIV EQU   SDWAERRD                                                 01998000
SDWAMABD EQU   SDWAERRD                                                 01999000
SDWACTS  EQU   SDWAERRD                                                 02000000
SDWASTAE EQU   SDWAERRD                                                 02001000
SDWANRBE EQU   SDWAERRD                                                 02002000
SDWACLUP EQU   SDWAERRD                                                 02003000
@NM00108 EQU   SDWAERRC                                                 02004000
SDWAEAS  EQU   SDWAERRC                                                 02005000
SDWAIRB  EQU   SDWAERRC                                                 02006000
SDWASTAI EQU   SDWAERRC                                                 02007000
SDWALDIS EQU   SDWAERRB                                                 02008000
SDWAENRB EQU   SDWAERRB                                                 02009000
SDWATYP1 EQU   SDWAERRB                                                 02010000
@NM00107 EQU   SDWAERRB                                                 02011000
SDWAPGIO EQU   SDWAERRA                                                 02012000
SDWATEXC EQU   SDWAERRA                                                 02013000
SDWASVCE EQU   SDWAERRA                                                 02014000
SDWAABTM EQU   SDWAERRA                                                 02015000
SDWASVCD EQU   SDWAERRA                                                 02016000
SDWARKEY EQU   SDWAERRA                                                 02017000
SDWAPCHK EQU   SDWAERRA                                                 02018000
SDWAMCHK EQU   SDWAERRA                                                 02019000
SDWATIME EQU   SDWAMCH+20                                               02020000
SDWARFSA EQU   SDWAMCH+16                                               02021000
@NM00106 EQU   SDWAMCH+14                                               02022000
SDWAVEQR EQU   SDWARSR2                                                 02023000
SDWAPGFX EQU   SDWARSR2                                                 02024000
SDWAFLSQ EQU   SDWARSR2                                                 02025000
SDWAFSQA EQU   SDWARSR2                                                 02026000
SDWANUCL EQU   SDWARSR2                                                 02027000
SDWASPER EQU   SDWARSR2                                                 02028000
SDWAINTC EQU   SDWARSR2                                                 02029000
SDWAOFLN EQU   SDWARSR2                                                 02030000
SDWACHNG EQU   SDWARSR1                                                 02031000
SDWAMSER EQU   SDWARSR1                                                 02032000
@NM00105 EQU   SDWARSR1                                                 02033000
SDWACPID EQU   SDWAMCH+10                                               02034000
SDWATERR EQU   SDWAMCHD                                                 02035000
SDWAFPRX EQU   SDWAMCHD                                                 02036000
SDWAINSF EQU   SDWAMCHD                                                 02037000
SDWAACR  EQU   SDWAMCHD                                                 02038000
SDWASCK  EQU   SDWAMCHD                                                 02039000
SDWAPSWU EQU   SDWAMCHD                                                 02040000
SDWAREGU EQU   SDWAMCHD                                                 02041000
SDWASKYF EQU   SDWAMCHD                                                 02042000
@NM00104 EQU   SDWAMCHS                                                 02043000
SDWARSRF EQU   SDWAMCHS                                                 02044000
SDWARSRC EQU   SDWAMCHS                                                 02045000
SDWAINVP EQU   SDWAMCHS                                                 02046000
SDWATSVL EQU   SDWAMCHS                                                 02047000
SDWARCDF EQU   SDWAMCHS                                                 02048000
SDWASRVL EQU   SDWAMCHS                                                 02049000
SDWASCKE EQU   SDWASTCK+4                                               02050000
SDWASCKB EQU   SDWASTCK                                                 02051000
SDWALNTH EQU   SDWAIDNT+1                                               02052000
SDWASPID EQU   SDWAIDNT                                                 02053000
SDWASR15 EQU   SDWASRSV+60                                              02054000
SDWASR14 EQU   SDWASRSV+56                                              02055000
SDWASR13 EQU   SDWASRSV+52                                              02056000
SDWASR12 EQU   SDWASRSV+48                                              02057000
SDWASR11 EQU   SDWASRSV+44                                              02058000
SDWASR10 EQU   SDWASRSV+40                                              02059000
SDWASR09 EQU   SDWASRSV+36                                              02060000
SDWASR08 EQU   SDWASRSV+32                                              02061000
SDWASR07 EQU   SDWASRSV+28                                              02062000
SDWASR06 EQU   SDWASRSV+24                                              02063000
SDWASR05 EQU   SDWASRSV+20                                              02064000
SDWASR04 EQU   SDWASRSV+16                                              02065000
SDWASR03 EQU   SDWASRSV+12                                              02066000
SDWASR02 EQU   SDWASRSV+8                                               02067000
SDWASR01 EQU   SDWASRSV+4                                               02068000
SDWASR00 EQU   SDWASRSV                                                 02069000
SDWATRN2 EQU   SDWAAEC2+4                                               02070000
SDWAIPC2 EQU   SDWAICD2                                                 02071000
SDWAIMC2 EQU   SDWAICD2                                                 02072000
SDWAIPR2 EQU   SDWAICD2                                                 02073000
@NM00103 EQU   SDWAINC2                                                 02074000
@NM00102 EQU   SDWAILC2                                                 02075000
SDWAIL2  EQU   SDWAILC2                                                 02076000
@NM00101 EQU   SDWAILC2                                                 02077000
@NM00100 EQU   SDWAAEC2                                                 02078000
SDWAADD2 EQU   SDWANXT2+1                                               02079000
@NM00099 EQU   SDWANXT2                                                 02080000
@NM00098 EQU   SDWAEC2+3                                                02081000
SDWASGN2 EQU   SDWAINT2                                                 02082000
SDWAEXP2 EQU   SDWAINT2                                                 02083000
SDWADEC2 EQU   SDWAINT2                                                 02084000
SDWAFPO2 EQU   SDWAINT2                                                 02085000
SDWACC2  EQU   SDWAINT2                                                 02086000
@NM00097 EQU   SDWAINT2                                                 02087000
SDWAPGM2 EQU   SDWAMWP2                                                 02088000
SDWAWAT2 EQU   SDWAMWP2                                                 02089000
SDWAMCK2 EQU   SDWAMWP2                                                 02090000
SDWAECT2 EQU   SDWAMWP2                                                 02091000
SDWAKEY2 EQU   SDWAMWP2                                                 02092000
SDWAEXT2 EQU   SDWAEMK2                                                 02093000
SDWAIO2  EQU   SDWAEMK2                                                 02094000
SDWATRM2 EQU   SDWAEMK2                                                 02095000
@NM00096 EQU   SDWAEMK2                                                 02096000
SDWAPER2 EQU   SDWAEMK2                                                 02097000
@NM00095 EQU   SDWAEMK2                                                 02098000
SDWATRAN EQU   SDWAAEC1+4                                               02099000
SDWAIPC1 EQU   SDWAICD1                                                 02100000
SDWAIMC1 EQU   SDWAICD1                                                 02101000
SDWAIPR1 EQU   SDWAICD1                                                 02102000
@NM00094 EQU   SDWAINC1                                                 02103000
@NM00093 EQU   SDWAILC1                                                 02104000
SDWAIL1  EQU   SDWAILC1                                                 02105000
@NM00092 EQU   SDWAILC1                                                 02106000
@NM00091 EQU   SDWAAEC1                                                 02107000
SDWAADD1 EQU   SDWANXT1+1                                               02108000
@NM00090 EQU   SDWANXT1                                                 02109000
@NM00089 EQU   SDWAEC1+3                                                02110000
SDWASGN1 EQU   SDWAINT1                                                 02111000
SDWAEXP1 EQU   SDWAINT1                                                 02112000
SDWADEC1 EQU   SDWAINT1                                                 02113000
SDWAFPO1 EQU   SDWAINT1                                                 02114000
SDWACC1  EQU   SDWAINT1                                                 02115000
@NM00088 EQU   SDWAINT1                                                 02116000
SDWAPGM1 EQU   SDWAMWP1                                                 02117000
SDWAWAT1 EQU   SDWAMWP1                                                 02118000
SDWAMCK1 EQU   SDWAMWP1                                                 02119000
SDWAECT1 EQU   SDWAMWP1                                                 02120000
SDWAKEY1 EQU   SDWAMWP1                                                 02121000
SDWAEXT1 EQU   SDWAEMK1                                                 02122000
SDWAIO1  EQU   SDWAEMK1                                                 02123000
SDWATRM1 EQU   SDWAEMK1                                                 02124000
@NM00087 EQU   SDWAEMK1                                                 02125000
SDWAPER1 EQU   SDWAEMK1                                                 02126000
@NM00086 EQU   SDWAEMK1                                                 02127000
SDWAIOBR EQU   SDWA+100                                                 02128000
SDWAEPA  EQU   SDWA+96                                                  02129000
@NM00085 EQU   SDWANAME+4                                               02130000
SDWARBAD EQU   SDWANAME                                                 02131000
SDWAGR15 EQU   SDWAGRSV+60                                              02132000
SDWAGR14 EQU   SDWAGRSV+56                                              02133000
SDWAGR13 EQU   SDWAGRSV+52                                              02134000
SDWAGR12 EQU   SDWAGRSV+48                                              02135000
SDWAGR11 EQU   SDWAGRSV+44                                              02136000
SDWAGR10 EQU   SDWAGRSV+40                                              02137000
SDWAGR09 EQU   SDWAGRSV+36                                              02138000
SDWAGR08 EQU   SDWAGRSV+32                                              02139000
SDWAGR07 EQU   SDWAGRSV+28                                              02140000
SDWAGR06 EQU   SDWAGRSV+24                                              02141000
SDWAGR05 EQU   SDWAGRSV+20                                              02142000
SDWAGR04 EQU   SDWAGRSV+16                                              02143000
SDWAGR03 EQU   SDWAGRSV+12                                              02144000
SDWAGR02 EQU   SDWAGRSV+8                                               02145000
SDWAGR01 EQU   SDWAGRSV+4                                               02146000
SDWAGR00 EQU   SDWAGRSV                                                 02147000
SDWANXTP EQU   SDWACTL2+5                                               02148000
SDWASGP  EQU   SDWAPMKP                                                 02149000
SDWAEUP  EQU   SDWAPMKP                                                 02150000
SDWADOP  EQU   SDWAPMKP                                                 02151000
SDWAFPP  EQU   SDWAPMKP                                                 02152000
SDWACCP  EQU   SDWAPMKP                                                 02153000
SDWAILP  EQU   SDWAPMKP                                                 02154000
SDWAINTP EQU   SDWACTL2+2                                               02155000
SDWASPVP EQU   SDWAMWPP                                                 02156000
SDWAWATP EQU   SDWAMWPP                                                 02157000
SDWAMCKP EQU   SDWAMWPP                                                 02158000
@NM00084 EQU   SDWAMWPP                                                 02159000
SDWAKEYP EQU   SDWAMWPP                                                 02160000
SDWAEXTP EQU   SDWACMKP                                                 02161000
SDWAIOP  EQU   SDWACMKP                                                 02162000
SDWANXTA EQU   SDWACTL1+5                                               02163000
SDWASGA  EQU   SDWAPMKA                                                 02164000
SDWAEUA  EQU   SDWAPMKA                                                 02165000
SDWADOA  EQU   SDWAPMKA                                                 02166000
SDWAFPA  EQU   SDWAPMKA                                                 02167000
SDWACCA  EQU   SDWAPMKA                                                 02168000
SDWAILA  EQU   SDWAPMKA                                                 02169000
SDWAINTA EQU   SDWACTL1+2                                               02170000
SDWASPVA EQU   SDWAMWPA                                                 02171000
SDWAWATA EQU   SDWAMWPA                                                 02172000
SDWAMCKA EQU   SDWAMWPA                                                 02173000
@NM00083 EQU   SDWAMWPA                                                 02174000
SDWAKEYA EQU   SDWAMWPA                                                 02175000
SDWAEXTA EQU   SDWACMKA                                                 02176000
SDWAIOA  EQU   SDWACMKA                                                 02177000
@NM00082 EQU   SDWACMPF                                                 02178000
SDWASTCC EQU   SDWACMPF                                                 02179000
@NM00081 EQU   SDWACMPF                                                 02180000
SDWASTEP EQU   SDWACMPF                                                 02181000
SDWAREQ  EQU   SDWACMPF                                                 02182000
@NM00080 EQU   SCVTSECT+180                                             02183000
@NM00079 EQU   SCVTSECT+176                                             02184000
SCVTPIQE EQU   SCVTSECT+172                                             02185000
@NM00078 EQU   SCVTSECT+168                                             02186000
SCVTPTRM EQU   SCVTSECT+164                                             02187000
@NM00077 EQU   SCVTSECT+160                                             02188000
@NM00076 EQU   SCVTSECT+156                                             02189000
SCVTQCBR EQU   SCVTSECT+152                                             02190000
@NM00075 EQU   SCVTSECT+144                                             02191000
SCVTTQE  EQU   SCVTSECT+140                                             02192000
@NM00074 EQU   SCVTSECT+136                                             02193000
SCVTSVCT EQU   SCVTSECT+132                                             02194000
@NM00073 EQU   SCVTSECT+128                                             02195000
@NM00072 EQU   SCVTSECT+124                                             02196000
SCVTRXLQ EQU   SCVTSECT+120                                             02197000
@NM00071 EQU   SCVTSECT+116                                             02198000
SCVTCTCB EQU   SCVTSECT+112                                             02199000
@NM00070 EQU   SCVTSECT+108                                             02200000
@NM00069 EQU   SCVTSECT+104                                             02201000
@NM00068 EQU   SCVTSECT+100                                             02202000
@NM00067 EQU   SCVTSECT+96                                              02203000
SCVTCOMM EQU   SCVTSECT+92                                              02204000
@NM00066 EQU   SCVTSECT+88                                              02205000
@NM00065 EQU   SCVTSECT+84                                              02206000
@NM00064 EQU   SCVTSECT+80                                              02207000
@NM00063 EQU   SCVTSECT+76                                              02208000
@NM00062 EQU   SCVTSECT+72                                              02209000
SCVTGMBR EQU   SCVTSECT+68                                              02210000
SCVTRPTR EQU   SCVTSECT+64                                              02211000
SCVTHSKP EQU   SCVTSECT+60                                              02212000
@NM00061 EQU   SCVTSECT+56                                              02213000
@NM00060 EQU   SCVTSECT+52                                              02214000
SCVTLFRM EQU   SCVTSECT+48                                              02215000
SCVTCDCL EQU   SCVTSECT+44                                              02216000
@NM00059 EQU   SCVTSECT+40                                              02217000
SCVTRACE EQU   SCVTSECT+36                                              02218000
@NM00058 EQU   SCVTSECT+32                                              02219000
SCVTRMBR EQU   SCVTSECT+28                                              02220000
@NM00057 EQU   SCVTSECT+24                                              02221000
@NM00056 EQU   SCVTSECT+20                                              02222000
@NM00055 EQU   SCVTSECT+16                                              02223000
@NM00054 EQU   SCVTSECT+14                                              02224000
SCVTBR14 EQU   SCVTSECT+12                                              02225000
SCVTSPET EQU   SCVTSECT+8                                               02226000
SCVTPGWR EQU   SCVTSECT+4                                               02227000
SCVTPGTM EQU   SCVTSECT                                                 02228000
ASCBEND  EQU   ASCB+208                                                 02229000
ASCBSRBT EQU   ASCB+200                                                 02230000
ASCBSWTL EQU   ASCB+196                                                 02231000
ASCBRS14 EQU   ASCB+195                                                 02232000
ASCBSMCT EQU   ASCB+194                                                 02233000
ASCBRS12 EQU   ASCB+192                                                 02234000
ASCBPCTT EQU   ASCB+188                                                 02235000
ASCBVGTT EQU   ASCB+184                                                 02236000
ASCBRV43 EQU   ASCBSRQ4                                                 02237000
ASCBRV42 EQU   ASCBSRQ4                                                 02238000
ASCBRV41 EQU   ASCBSRQ4                                                 02239000
ASCBRV40 EQU   ASCBSRQ4                                                 02240000
ASCBRV39 EQU   ASCBSRQ4                                                 02241000
ASCBRV38 EQU   ASCBSRQ4                                                 02242000
ASCBRV37 EQU   ASCBSRQ4                                                 02243000
ASCBRV36 EQU   ASCBSRQ4                                                 02244000
ASCBRV35 EQU   ASCBSRQ3                                                 02245000
ASCBRV34 EQU   ASCBSRQ3                                                 02246000
ASCBRV33 EQU   ASCBSRQ3                                                 02247000
ASCBRV32 EQU   ASCBSRQ3                                                 02248000
ASCBRV31 EQU   ASCBSRQ3                                                 02249000
ASCBRV30 EQU   ASCBSRQ3                                                 02250000
ASCBRV29 EQU   ASCBSRQ3                                                 02251000
ASCBRV28 EQU   ASCBSRQ3                                                 02252000
ASCBRV27 EQU   ASCBSRQ2                                                 02253000
ASCBRV26 EQU   ASCBSRQ2                                                 02254000
ASCBRV25 EQU   ASCBSRQ2                                                 02255000
ASCBRV24 EQU   ASCBSRQ2                                                 02256000
ASCBRV23 EQU   ASCBSRQ2                                                 02257000
ASCBRV22 EQU   ASCBSRQ2                                                 02258000
ASCBRV21 EQU   ASCBSRQ2                                                 02259000
ASCBRV20 EQU   ASCBSRQ2                                                 02260000
ASCBRV19 EQU   ASCBSRQ1                                                 02261000
ASCBRV18 EQU   ASCBSRQ1                                                 02262000
ASCBRV17 EQU   ASCBSRQ1                                                 02263000
ASCBRV16 EQU   ASCBSRQ1                                                 02264000
ASCBRV15 EQU   ASCBSRQ1                                                 02265000
ASCBRV14 EQU   ASCBSRQ1                                                 02266000
ASCBRV13 EQU   ASCBSRQ1                                                 02267000
ASCBSTA  EQU   ASCBSRQ1                                                 02268000
ASCBJBNS EQU   ASCB+176                                                 02269000
ASCBJBNI EQU   ASCB+172                                                 02270000
ASCBMCC  EQU   ASCB+168                                                 02271000
ASCBRTWA EQU   ASCB+164                                                 02272000
ASCBIQEA EQU   ASCB+160                                                 02273000
ASCBXMPQ EQU   ASCB+156                                                 02274000
ASCBRS01 EQU   ASCB+154                                                 02275000
ASCBFMCT EQU   ASCB+152                                                 02276000
ASCBOUXB EQU   ASCB+148                                                 02277000
ASCBOUCB EQU   ASCB+144                                                 02278000
ASCBMECB EQU   ASCB+140                                                 02279000
ASCBQECB EQU   ASCB+136                                                 02280000
ASCBLSQH EQU   ASCBLKGP+4                                               02281000
ASCBLOCK EQU   ASCBLKGP                                                 02282000
ASCBTCBS EQU   ASCB+124                                                 02283000
ASCBNVSC EQU   ASCB+122                                                 02284000
ASCBVSC  EQU   ASCB+120                                                 02285000
ASCBSRBS EQU   ASCB+118                                                 02286000
ASCBSSRB EQU   ASCB+116                                                 02287000
ASCBRV06 EQU   ASCBFLG2                                                 02288000
ASCBRV05 EQU   ASCBFLG2                                                 02289000
ASCBRV04 EQU   ASCBFLG2                                                 02290000
ASCBSNQS EQU   ASCBFLG2                                                 02291000
ASCBS2S  EQU   ASCBFLG2                                                 02292000
ASCBCEXT EQU   ASCBFLG2                                                 02293000
ASCBPXMT EQU   ASCBFLG2                                                 02294000
ASCBXMPT EQU   ASCBFLG2                                                 02295000
ASCBRF07 EQU   ASCBDSP1                                                 02296000
ASCBRF06 EQU   ASCBDSP1                                                 02297000
ASCBRF05 EQU   ASCBDSP1                                                 02298000
ASCBRF04 EQU   ASCBDSP1                                                 02299000
ASCBRF03 EQU   ASCBDSP1                                                 02300000
ASCBRF02 EQU   ASCBDSP1                                                 02301000
ASCBFAIL EQU   ASCBDSP1                                                 02302000
ASCBNOQ  EQU   ASCBDSP1                                                 02303000
ASCBSWCT EQU   ASCB+112                                                 02304000
ASCBASXB EQU   ASCB+108                                                 02305000
ASCBTMCH EQU   ASCB+104                                                 02306000
ASCBNSWP EQU   ASCBFLG1                                                 02307000
ASCBTYP1 EQU   ASCBFLG1                                                 02308000
ASCBSTND EQU   ASCBFLG1                                                 02309000
ASCBABNT EQU   ASCBFLG1                                                 02310000
ASCBTERM EQU   ASCBFLG1                                                 02311000
ASCBS3S  EQU   ASCBFLG1                                                 02312000
ASCBCMSH EQU   ASCBFLG1                                                 02313000
ASCBTOFF EQU   ASCBFLG1                                                 02314000
ASCBRF01 EQU   ASCBRCTF                                                 02315000
ASCBTMLW EQU   ASCBRCTF                                                 02316000
ASCBOUT  EQU   ASCBRCTF                                                 02317000
ASCBWAIT EQU   ASCBRCTF                                                 02318000
ASCBRV08 EQU   ASCBRCTF                                                 02319000
ASCBFQU  EQU   ASCBRCTF                                                 02320000
ASCBFRS  EQU   ASCBRCTF                                                 02321000
ASCBTMNO EQU   ASCBRCTF                                                 02322000
ASCBAFFN EQU   ASCBFW1                                                  02323000
ASCBDUMP EQU   ASCB+96                                                  02324000
ASCBQSVC EQU   ASCB+92                                                  02325000
ASCBUBET EQU   ASCB+88                                                  02326000
ASCBECB  EQU   ASCB+84                                                  02327000
ASCBJSTL EQU   ASCB+80                                                  02328000
ASCBEWST EQU   ASCB+72                                                  02329000
ASCBEJST EQU   ASCB+64                                                  02330000
ASCBCSCB EQU   ASCB+56                                                  02331000
ASCBRSM  EQU   ASCB+52                                                  02332000
ASCBLDA  EQU   ASCB+48                                                  02333000
ASCBSTOR EQU   ASCB+44                                                  02334000
ASCBDP   EQU   ASCB+43                                                  02335000
ASCBRV07 EQU   ASCB+42                                                  02336000
ASCBIOSM EQU   ASCB+40                                                  02337000
ASCBSEQN EQU   ASCB+38                                                  02338000
ASCBCPUS EQU   ASCB+32                                                  02339000
ASCBSPL  EQU   ASCB+28                                                  02340000
ASCBIOSP EQU   ASCB+24                                                  02341000
ASCBSYNC EQU   ASCBSUPC+4                                               02342000
ASCBSVRB EQU   ASCBSUPC                                                 02343000
ASCBCMSF EQU   ASCB+12                                                  02344000
ASCBBWDP EQU   ASCB+8                                                   02345000
ASCBFWDP EQU   ASCB+4                                                   02346000
ASCBASCB EQU   ASCB                                                     02347000
ASCBEGIN EQU   ASCB                                                     02348000
@NM00029 EQU   FRRSFLGS+1                                               02349000
@NM00028 EQU   FRRSFLG1                                                 02350000
FRRSRCUR EQU   FRRSFLG1                                                 02351000
FRRSENTS EQU   FRRS+84                                                  02352000
FRRSRTMW EQU   FRRS+16                                                  02353000
RPLSEQNO EQU   RPLOF60+6                                                02354000
@NM00027 EQU   RPLIBSQ                                                  02355000
RPLIINV  EQU   RPLIBSQ                                                  02356000
RPLINEG  EQU   RPLIBSQ                                                  02357000
RPLIPOS  EQU   RPLIBSQ                                                  02358000
RPLIIGN  EQU   RPLIBSQ                                                  02359000
RPLIRSET EQU   RPLIBSQ                                                  02360000
RPLITST  EQU   RPLIBSQ                                                  02361000
RPLISET  EQU   RPLIBSQ                                                  02362000
@NM00026 EQU   RPLOBSQ                                                  02363000
RPLOINV  EQU   RPLOBSQ                                                  02364000
RPLONEG  EQU   RPLOBSQ                                                  02365000
RPLOPOS  EQU   RPLOBSQ                                                  02366000
RPLOIGN  EQU   RPLOBSQ                                                  02367000
RPLORSET EQU   RPLOBSQ                                                  02368000
RPLOTST  EQU   RPLOBSQ                                                  02369000
RPLOSET  EQU   RPLOBSQ                                                  02370000
RPLIBSQV EQU   RPLOF60+2                                                02371000
RPLOBSQV EQU   RPLOF60                                                  02372000
@NM00025 EQU   RPLO5                                                    02373000
RPLTNFY  EQU   RPLO5                                                    02374000
@NM00024 EQU   RPLO5                                                    02375000
@NM00023 EQU   RPLCNTSC                                                 02376000
RPLRSHUT EQU   RPLCNTSC                                                 02377000
RPLRQR   EQU   RPLCNTSC                                                 02378000
RPLSHUTC EQU   RPLCNTSC                                                 02379000
RPLSHUTD EQU   RPLCNTSC                                                 02380000
RPLSTSN  EQU   RPLCNTSC                                                 02381000
RPLCLEAR EQU   RPLCNTSC                                                 02382000
RPLSDT   EQU   RPLCNTSC                                                 02383000
RPLBIS   EQU   RPLCNTDC                                                 02384000
RPLSBI   EQU   RPLCNTDC                                                 02385000
RPLTUNBD EQU   RPLCNTDC                                                 02386000
RPLTBIND EQU   RPLCNTDC                                                 02387000
RPLSIGNL EQU   RPLCNTDC                                                 02388000
RPLLUS   EQU   RPLCNTDC                                                 02389000
RPLRTR   EQU   RPLCNTDC                                                 02390000
RPLBID   EQU   RPLCNTDC                                                 02391000
@NM00022 EQU   RPLCNTDF                                                 02392000
RPLQI    EQU   RPLCNTDF                                                 02393000
RPLRELQ  EQU   RPLCNTDF                                                 02394000
RPLCHASE EQU   RPLCNTDF                                                 02395000
RPLQEC   EQU   RPLCNTDF                                                 02396000
RPLQC    EQU   RPLCNTDF                                                 02397000
RPLCNCEL EQU   RPLCNTDF                                                 02398000
RPLDATA  EQU   RPLCNTDF                                                 02399000
RPLRRN   EQU   RPLRESP                                                  02400000
RPLNFME  EQU   RPLRESP                                                  02401000
RPLEX    EQU   RPLRESP                                                  02402000
RPLQRI   EQU   RPLRESP                                                  02403000
@NM00021 EQU   RPLPOSTV                                                 02404000
RPLSCHED EQU   RPLPOSTV                                                 02405000
@NM00020 EQU   RPLVTFL1                                                 02406000
RPLTLGAC EQU   RPLVTFL1                                                 02407000
RPLTNDSP EQU   RPLVTFL1                                                 02408000
RPLAUTUS EQU   RPLVTFL1                                                 02409000
RPLVTUSE EQU   RPLVTFL1                                                 02410000
@NM00019 EQU   RPLVTFL1                                                 02411000
@NM00018 EQU   RPLCHN                                                   02412000
RPLONLY  EQU   RPLCHN                                                   02413000
RPLLAST  EQU   RPLCHN                                                   02414000
RPLMIDLE EQU   RPLCHN                                                   02415000
RPLFIRST EQU   RPLCHN                                                   02416000
@NM00017 EQU   RPLRTYPE                                                 02417000
RPLDFASY EQU   RPLRTYPE                                                 02418000
RPLNFSYN EQU   RPLRTYPE                                                 02419000
RPLRRESP EQU   RPLRTYPE                                                 02420000
@NM00016 EQU   RPLSTYPE                                                 02421000
RPLSRESP EQU   RPLSTYPE                                                 02422000
@NM00015 EQU   RPLRH3                                                   02423000
RPLCSI   EQU   RPLRH3                                                   02424000
RPLCHREQ EQU   RPLRH3                                                   02425000
RPLCMD   EQU   RPLRH3                                                   02426000
RPLEB    EQU   RPLRH3                                                   02427000
RPLBB    EQU   RPLRH3                                                   02428000
RPLSIGDA EQU   RPLVTEXT+32                                              02429000
RPLSAV13 EQU   RPLVTEXT+28                                              02430000
RPLUSNSO EQU   RPLOSENS+2                                               02431000
RPLSSMO  EQU   RPLSSNSO+1                                               02432000
@NM00014 EQU   RPLSSEO                                                  02433000
RPLRRO   EQU   RPLSSEO                                                  02434000
RPLFIO   EQU   RPLSSEO                                                  02435000
RPLSTATO EQU   RPLSSEO                                                  02436000
RPLCPMO  EQU   RPLSSEO                                                  02437000
@NM00013 EQU   RPLSSEO                                                  02438000
RPLFMHDR EQU   RPLOPT12                                                 02439000
@NM00012 EQU   RPLOPT12                                                 02440000
@NM00011 EQU   RPLOPT12                                                 02441000
@NM00010 EQU   RPLOPT12                                                 02442000
RPLNIBTK EQU   RPLOPT12                                                 02443000
RPLTRUNC EQU   RPLOPT12                                                 02444000
RPLKEEP  EQU   RPLOPT12                                                 02445000
@NM00009 EQU   RPLOPT12                                                 02446000
RPLRSVE8 EQU   RPLOPT11                                                 02447000
RPLRSVE7 EQU   RPLOPT11                                                 02448000
RPLRSVE6 EQU   RPLOPT11                                                 02449000
RPLRSVE5 EQU   RPLOPT11                                                 02450000
RPLRSVE4 EQU   RPLOPT11                                                 02451000
RPLSTOP  EQU   RPLOPT11                                                 02452000
RPLSTART EQU   RPLOPT11                                                 02453000
RPLQUIES EQU   RPLOPT11                                                 02454000
RPLRSVI6 EQU   RPLOPT10                                                 02455000
RPLRSVI5 EQU   RPLOPT10                                                 02456000
RPLRSVI4 EQU   RPLOPT10                                                 02457000
RPLRSVI3 EQU   RPLOPT10                                                 02458000
RPLTSKY  EQU   RPLOPT10                                                 02459000
RPLSPARM EQU   RPLOPT10                                                 02460000
RPLDSPLY EQU   RPLOPT10                                                 02461000
RPLBSCID EQU   RPLOPT10                                                 02462000
RPLTOPL  EQU   RPLOPT9                                                  02463000
RPLCIDE  EQU   RPLOPT9                                                  02464000
RPLRNNM  EQU   RPLOPT9                                                  02465000
RPLAPPST EQU   RPLOPT9                                                  02466000
RPLCOUNT EQU   RPLOPT9                                                  02467000
RPLTERMS EQU   RPLOPT9                                                  02468000
RPLDEVCH EQU   RPLOPT9                                                  02469000
RPLLOGON EQU   RPLOPT9                                                  02470000
RPLESR2  EQU   RPLUSNSI+1                                               02471000
RPLESR1  EQU   RPLUSNSI                                                 02472000
RPLSSMI  EQU   RPLDSB2                                                  02473000
@NM00008 EQU   RPLSSEI                                                  02474000
RPLRRI   EQU   RPLSSEI                                                  02475000
RPLFII   EQU   RPLSSEI                                                  02476000
RPLSTATI EQU   RPLSSEI                                                  02477000
RPLCPMI  EQU   RPLSSEI                                                  02478000
RPLPATHI EQU   RPLSSEI                                                  02479000
RPLARCLN EQU   RPLVTEXT+8                                               02480000
RPLAARLN EQU   RPLVTEXT+4                                               02481000
RPLAAREA EQU   RPLVTEXT                                                 02482000
RPLERMSA EQU   RPLCOMN+72                                               02483000
RPLEMLEN EQU   RPLCOMN+70                                               02484000
RPLACTIV EQU   RPLCOMN+69                                               02485000
RPLBRANC EQU   RPLEXTD1                                                 02486000
RPLNIB   EQU   RPLEXTD1                                                 02487000
RPLTCRYP EQU   RPLEXTD1                                                 02488000
@NM00007 EQU   RPLEXTD1                                                 02489000
RPLEXIT  EQU   RPLEXTD1                                                 02490000
RPLNEXIT EQU   RPLEXTD1                                                 02491000
RPLEXSCH EQU   RPLEXTD1                                                 02492000
RPLDDDD  EQU   RPLRBAR+4                                                02493000
@NM00006 EQU   RPLRBAR+3                                                02494000
@NM00005 EQU   RPLAIXID                                                 02495000
RPLAXPKP EQU   RPLAIXID                                                 02496000
RPLAIXPC EQU   RPLRBAR                                                  02497000
RPLRSV88 EQU   RPLOPT8                                                  02498000
RPLUNCON EQU   RPLOPT8                                                  02499000
RPLACTV  EQU   RPLOPT8                                                  02500000
RPLSESS  EQU   RPLOPT8                                                  02501000
RPLPEND  EQU   RPLOPT8                                                  02502000
RPLODPRM EQU   RPLOPT8                                                  02503000
RPLODACP EQU   RPLOPT8                                                  02504000
RPLODACQ EQU   RPLOPT8                                                  02505000
RPLRSV78 EQU   RPLOPT7                                                  02506000
RPLTCRNO EQU   RPLOPT7                                                  02507000
RPLRLSOP EQU   RPLOPT7                                                  02508000
RPLTPOST EQU   RPLOPT7                                                  02509000
RPLQOPT  EQU   RPLOPT7                                                  02510000
RPLCNIMM EQU   RPLCNOPT                                                 02511000
RPLCNANY EQU   RPLCNOPT                                                 02512000
RPLCNALL EQU   RPLCNOPT                                                 02513000
RPLRSV68 EQU   RPLOPT6                                                  02514000
RPLRSV67 EQU   RPLOPT6                                                  02515000
RPLLOCK  EQU   RPLOPT6                                                  02516000
RPLNCOND EQU   RPLOPT6                                                  02517000
RPLCOND  EQU   RPLOPT6                                                  02518000
RPLEOT   EQU   RPLUNTYP                                                 02519000
RPLEOM   EQU   RPLUNTYP                                                 02520000
RPLEOB   EQU   RPLUNTYP                                                 02521000
RPLWROPT EQU   RPLOPT5                                                  02522000
RPLNODE  EQU   RPLOPT5                                                  02523000
RPLERACE EQU   RPLWRTYP                                                 02524000
RPLEAU   EQU   RPLWRTYP                                                 02525000
RPLNERAS EQU   RPLWRTYP                                                 02526000
RPLPSOPT EQU   RPLOPT5                                                  02527000
@NM00004 EQU   RPLOPT5                                                  02528000
RPLDLGIN EQU   RPLOPT5                                                  02529000
RPLBUFL  EQU   RPLCOMN+52                                               02530000
RPLRLEN  EQU   RPLCOMN+48                                               02531000
RPLCHAIN EQU   RPLNXTRP                                                 02532000
@NM00003 EQU   RPLOPT4                                                  02533000
RPLMKFRM EQU   RPLOPT4                                                  02534000
RPLENDTR EQU   RPLOPT4                                                  02535000
RPLALIGN EQU   RPLOPT3                                                  02536000
RPLFMT   EQU   RPLOPT3                                                  02537000
RPLFLD   EQU   RPLOPT3                                                  02538000
RPLVFY   EQU   RPLOPT3                                                  02539000
RPLBLK   EQU   RPLOPT3                                                  02540000
RPLSFORM EQU   RPLOPT3                                                  02541000
RPLEODS  EQU   RPLOPT3                                                  02542000
RPLNSP   EQU   RPLOPT2                                                  02543000
RPLUPD   EQU   RPLOPT2                                                  02544000
RPLWAITX EQU   RPLOPT2                                                  02545000
RPLLRD   EQU   RPLOPT2                                                  02546000
RPLBWD   EQU   RPLOPT2                                                  02547000
RPLCNV   EQU   RPLOPT2                                                  02548000
RPLADD   EQU   RPLADR                                                   02549000
RPLKEY   EQU   RPLOPT2                                                  02550000
RPLECBIN EQU   RPLECBSW                                                 02551000
RPLGEN   EQU   RPLOPT1                                                  02552000
RPLKGE   EQU   RPLOPT1                                                  02553000
RPLASY   EQU   RPLOPT1                                                  02554000
RPLSKP   EQU   RPLOPT1                                                  02555000
RPLSEQ   EQU   RPLOPT1                                                  02556000
RPLDIR   EQU   RPLOPT1                                                  02557000
RPLLOC   EQU   RPLOPT1                                                  02558000
RPLDAF   EQU   RPLARG+2                                                 02559000
RPLSAF   EQU   RPLARG                                                   02560000
RPLAREA  EQU   RPLCOMN+32                                               02561000
RPLTCBPT EQU   RPLCOMN+28                                               02562000
RPLDACB  EQU   RPLCOMN+24                                               02563000
RPLCCHAR EQU   RPLCOMN+20                                               02564000
RPLSTRID EQU   RPLCOMN+18                                               02565000
RPLKEYL  EQU   RPLKEYLE                                                 02566000
RPLRDSOH EQU   RPLFDB3                                                  02567000
RPLRLG   EQU   RPLFDB3                                                  02568000
RPLLGFRC EQU   RPLFDB3                                                  02569000
RPLREOT  EQU   RPLFDB3                                                  02570000
RPLREOM  EQU   RPLFDB3                                                  02571000
RPLREOB  EQU   RPLFDB3                                                  02572000
RPLSV32  EQU   RPLFDB3                                                  02573000
RPLUINPT EQU   RPLFDB3                                                  02574000
RPLSTSAV EQU   RPLFDB2                                                  02575000
RPLCUERR EQU   RPLFDB2                                                  02576000
RPLDLGFL EQU   RPLFDB2                                                  02577000
RPLIOERR EQU   RPLFDB2                                                  02578000
RPLDVUNS EQU   RPLFDB2                                                  02579000
RPLATND  EQU   RPLFDB2                                                  02580000
RPLRVID  EQU   RPLFDB2                                                  02581000
RPLERLK  EQU   RPLFDB2                                                  02582000
RPLERREG EQU   RPLRTNCD                                                 02583000
RPLSTAT  EQU   RPLFDBWD                                                 02584000
RPLPOST  EQU   RPLECB                                                   02585000
RPLWAIT  EQU   RPLECB                                                   02586000
RPLPLHPT EQU   RPLCOMN+4                                                02587000
RPLLEN2  EQU   RPLLEN                                                   02588000
RPLSTYP  EQU   RPLIDWD+1                                                02589000
RPLID    EQU   RPLIDWD                                                  02590000
CVTLEVL  EQU   CVTRELNO+2                                               02591000
CVTNUMB  EQU   CVTRELNO                                                 02592000
CVTMDL   EQU   CVTFIX+250                                               02593000
@NM00002 EQU   CVTFIX+248                                               02594000
@NM00001 EQU   CVTFIX                                                   02595000
CVTRV482 EQU   CVTXTNT2+128                                             02596000
CVTRV481 EQU   CVTXTNT2+124                                             02597000
CVTRV480 EQU   CVTXTNT2+120                                             02598000
CVTRV479 EQU   CVTXTNT2+118                                             02599000
CVTRV478 EQU   CVTXTNT2+117                                             02600000
CVTRV477 EQU   CVTXTNT2+116                                             02601000
CVTRV476 EQU   CVTXTNT2+115                                             02602000
CVTRV475 EQU   CVTXTNT2+114                                             02603000
CVTRV474 EQU   CVTRV466                                                 02604000
CVTRV473 EQU   CVTRV466                                                 02605000
CVTRV472 EQU   CVTRV466                                                 02606000
CVTRV471 EQU   CVTRV466                                                 02607000
CVTRV470 EQU   CVTRV466                                                 02608000
CVTRV469 EQU   CVTRV466                                                 02609000
CVTRV468 EQU   CVTRV466                                                 02610000
CVTRV467 EQU   CVTRV466                                                 02611000
CVTRV465 EQU   CVTRV457                                                 02612000
CVTRV464 EQU   CVTRV457                                                 02613000
CVTRV463 EQU   CVTRV457                                                 02614000
CVTRV462 EQU   CVTRV457                                                 02615000
CVTRV461 EQU   CVTRV457                                                 02616000
CVTRV460 EQU   CVTRV457                                                 02617000
CVTRV459 EQU   CVTRV457                                                 02618000
CVTRV458 EQU   CVTRV457                                                 02619000
CVTRV456 EQU   CVTXTNT2+108                                             02620000
CVTRV455 EQU   CVTXTNT2+104                                             02621000
CVTRV454 EQU   CVTXTNT2+100                                             02622000
CVTRV453 EQU   CVTXTNT2+96                                              02623000
CVTRV452 EQU   CVTXTNT2+94                                              02624000
CVTRV451 EQU   CVTXTNT2+92                                              02625000
CVTRV450 EQU   CVTXTNT2+90                                              02626000
CVTRV449 EQU   CVTXTNT2+88                                              02627000
CVTRV448 EQU   CVTXTNT2+87                                              02628000
CVTRV447 EQU   CVTXTNT2+86                                              02629000
CVTRV446 EQU   CVTRV438                                                 02630000
CVTRV445 EQU   CVTRV438                                                 02631000
CVTRV444 EQU   CVTRV438                                                 02632000
CVTRV443 EQU   CVTRV438                                                 02633000
CVTRV442 EQU   CVTRV438                                                 02634000
CVTRV441 EQU   CVTRV438                                                 02635000
CVTRV440 EQU   CVTRV438                                                 02636000
CVTRV439 EQU   CVTRV438                                                 02637000
CVTRV437 EQU   CVTRV429                                                 02638000
CVTRV436 EQU   CVTRV429                                                 02639000
CVTRV435 EQU   CVTRV429                                                 02640000
CVTRV434 EQU   CVTRV429                                                 02641000
CVTRV433 EQU   CVTRV429                                                 02642000
CVTRV432 EQU   CVTRV429                                                 02643000
CVTRV431 EQU   CVTRV429                                                 02644000
CVTRV430 EQU   CVTRV429                                                 02645000
CVTRV428 EQU   CVTXTNT2+80                                              02646000
CVTRV427 EQU   CVTXTNT2+76                                              02647000
CVTRV426 EQU   CVTXTNT2+72                                              02648000
CVTRV425 EQU   CVTXTNT2+68                                              02649000
CVTATACT EQU   CVTATCVT                                                 02650000
CVTRV423 EQU   CVTXTNT2+62                                              02651000
CVTRV422 EQU   CVTXTNT2+60                                              02652000
CVTRV421 EQU   CVTXTNT2+58                                              02653000
CVTRV420 EQU   CVTXTNT2+56                                              02654000
CVTRV419 EQU   CVTXTNT2+55                                              02655000
CVTRV418 EQU   CVTXTNT2+54                                              02656000
CVTRV417 EQU   CVTRV409                                                 02657000
CVTRV416 EQU   CVTRV409                                                 02658000
CVTRV415 EQU   CVTRV409                                                 02659000
CVTRV414 EQU   CVTRV409                                                 02660000
CVTRV413 EQU   CVTRV409                                                 02661000
CVTRV412 EQU   CVTRV409                                                 02662000
CVTRV411 EQU   CVTRV409                                                 02663000
CVTRV410 EQU   CVTRV409                                                 02664000
CVTRV408 EQU   CVTRV400                                                 02665000
CVTRV407 EQU   CVTRV400                                                 02666000
CVTRV406 EQU   CVTRV400                                                 02667000
CVTRV405 EQU   CVTRV400                                                 02668000
CVTRV404 EQU   CVTRV400                                                 02669000
CVTRV403 EQU   CVTRV400                                                 02670000
CVTRV402 EQU   CVTRV400                                                 02671000
CVTRV401 EQU   CVTRV400                                                 02672000
CVTICB   EQU   CVTXTNT2+48                                              02673000
CVTSKTA  EQU   CVTXTNT2+44                                              02674000
CVTCCVT  EQU   CVTXTNT2+40                                              02675000
CVTRSV98 EQU   CVTXTNT2+36                                              02676000
CVTRSV97 EQU   CVTXTNT2+34                                              02677000
CVTRSV96 EQU   CVTXTNT2+32                                              02678000
CVTOLTEP EQU   CVTXTNT2+28                                              02679000
CVTQIDA  EQU   CVTQID+1                                                 02680000
CVTRSV95 EQU   CVTQID                                                   02681000
CVTRSV94 EQU   CVTXTNT2+20                                              02682000
CVTRSV93 EQU   CVTXTNT2+16                                              02683000
CVTRSV92 EQU   CVTXTNT2+12                                              02684000
CVTDEBVR EQU   CVTXTNT2+8                                               02685000
CVTRSV91 EQU   CVTXTNT2+6                                               02686000
CVTRSV9H EQU   CVTFLGBT                                                 02687000
CVTRSV9G EQU   CVTFLGBT                                                 02688000
CVTRSV9F EQU   CVTFLGBT                                                 02689000
CVTRSV9E EQU   CVTFLGBT                                                 02690000
CVTRSV9D EQU   CVTFLGBT                                                 02691000
CVTBAH   EQU   CVTFLGBT                                                 02692000
CVTVME   EQU   CVTFLGBT                                                 02693000
CVTNPE   EQU   CVTFLGBT                                                 02694000
CVTNUCLS EQU   CVTXTNT2+4                                               02695000
CVTDSSVA EQU   CVTDSSV+1                                                02696000
CVTRSV89 EQU   CVTDSSV                                                  02697000
CVTRSV88 EQU   CVTXTNT1+8                                               02698000
CVTRSV87 EQU   CVTXTNT1+4                                               02699000
CVTFACHN EQU   CVTXTNT1                                                 02700000
CVTRV488 EQU   CVTMAP+412                                               02701000
CVTRV487 EQU   CVTMAP+408                                               02702000
CVTRV486 EQU   CVTMAP+404                                               02703000
CVTRV485 EQU   CVTMAP+400                                               02704000
CVTACTAP EQU   CVTMAP+396                                               02705000
CVTAUTH  EQU   CVTMAP+392                                               02706000
CVTRV490 EQU   CVTMAP+388                                               02707000
CVTSU    EQU   CVTMAP+384                                               02708000
CVTVOLT1 EQU   CVTVOLM1+1                                               02709000
CVTVOLI1 EQU   CVTVOLF1                                                 02710000
CVTSTOA  EQU   CVTMAP+376                                               02711000
CVTRSV58 EQU   CVTMAP+374                                               02712000
CVTRSV57 EQU   CVTMAP+372                                               02713000
CVTDDCE  EQU   CVTMAP+368                                               02714000
CVTPNWFR EQU   CVTMAP+364                                               02715000
CVTSMF   EQU   CVTMAP+360                                               02716000
CVTSULK  EQU   CVTMAP+358                                               02717000
CVTSLKO  EQU   CVTSYSK                                                  02718000
CVTSLKP  EQU   CVTSYSK                                                  02719000
CVTSLKQ  EQU   CVTSYSK                                                  02720000
CVTSLKR  EQU   CVTSYSK                                                  02721000
CVTRSV56 EQU   CVTSYSK                                                  02722000
CVTRSV55 EQU   CVTSYSK                                                  02723000
CVTRSV54 EQU   CVTSYSK                                                  02724000
CVTRSV53 EQU   CVTSYSK                                                  02725000
CVTRSV52 EQU   CVTA1F1                                                  02726000
CVTRSV51 EQU   CVTA1F1                                                  02727000
CVTRSV50 EQU   CVTA1F1                                                  02728000
CVTRSV49 EQU   CVTA1F1                                                  02729000
CVTRSV48 EQU   CVTA1F1                                                  02730000
CVTRSV47 EQU   CVTA1F1                                                  02731000
CVTSRSW  EQU   CVTA1F1                                                  02732000
CVTPFSW  EQU   CVTA1F1                                                  02733000
CVTPCVT  EQU   CVTMAP+352                                               02734000
CVTRSV46 EQU   CVTMAP+344                                               02735000
CVTRSV45 EQU   CVTMAP+340                                               02736000
CVTRSV44 EQU   CVTMAP+338                                               02737000
CVTRSV43 EQU   CVTMAP+336                                               02738000
CVTHJESA EQU   CVTHJES+1                                                02739000
CVTRSV42 EQU   CVTHJES                                                  02740000
CVTEXT2A EQU   CVTEXT2+1                                                02741000
CVTRSV41 EQU   CVTEXT2                                                  02742000
CVTAPFA  EQU   CVTAPF+1                                                 02743000
CVTRSV40 EQU   CVTAPF                                                   02744000
CVTRV518 EQU   CVTINTLA                                                 02745000
CVTRV517 EQU   CVTERPV                                                  02746000
CVTEORM  EQU   CVTMAP+312                                               02747000
CVTMCHPR EQU   CVTMAP+308                                               02748000
CVTTZ    EQU   CVTMAP+304                                               02749000
CVTJEPS  EQU   CVTMAP+300                                               02750000
CVTJESCT EQU   CVTMAP+296                                               02751000
CVTMODE  EQU   CVTMAP+292                                               02752000
CVTPTRV  EQU   CVTMAP+288                                               02753000
CVTREAL  EQU   CVTMAP+284                                               02754000
CVTRSV39 EQU   CVTMAP+280                                               02755000
CVTRSV38 EQU   CVTMAP+276                                               02756000
CVTDMSRA EQU   CVTDMSR+1                                                02757000
CVTRV634 EQU   CVTDMSRF                                                 02758000
CVTRV633 EQU   CVTDMSRF                                                 02759000
CVTRV632 EQU   CVTDMSRF                                                 02760000
CVTRV631 EQU   CVTDMSRF                                                 02761000
CVTRV630 EQU   CVTDMSRF                                                 02762000
CVTRV629 EQU   CVTDMSRF                                                 02763000
CVTUDUMP EQU   CVTDMSRF                                                 02764000
CVTSDUMP EQU   CVTDMSRF                                                 02765000
CVTQMSGA EQU   CVTQMSG+1                                                02766000
CVTRSV36 EQU   CVTQMSG                                                  02767000
CVTAMFF  EQU   CVTMAP+264                                               02768000
CVTPURGA EQU   CVTPURG+1                                                02769000
CVTRSV35 EQU   CVTPURG                                                  02770000
CVTCBSP  EQU   CVTMAP+256                                               02771000
CVTATERA EQU   CVTATER+1                                                02772000
CVTSYST  EQU   CVTATER                                                  02773000
CVTVOLT2 EQU   CVTTAT                                                   02774000
CVTVOLI2 EQU   CVTVOLF2                                                 02775000
CVTAQAVB EQU   CVTAQAVT+1                                               02776000
CVTRSV34 EQU   CVTTCMFG                                                 02777000
CVTRSV33 EQU   CVTTCMFG                                                 02778000
CVTRSV32 EQU   CVTTCMFG                                                 02779000
CVTRSV31 EQU   CVTTCMFG                                                 02780000
CVTRSV30 EQU   CVTTCMFG                                                 02781000
CVTRSV29 EQU   CVTTCMFG                                                 02782000
CVTLDEV  EQU   CVTTCMFG                                                 02783000
CVTTCRDY EQU   CVTTCMFG                                                 02784000
CVTGTFA  EQU   CVTGTF+1                                                 02785000
CVTRSV27 EQU   CVTGTFST                                                 02786000
CVTRNIO  EQU   CVTGTFST                                                 02787000
CVTUSR   EQU   CVTGTFST                                                 02788000
CVTRV318 EQU   CVTFORM                                                  02789000
CVTRV317 EQU   CVTTMODE                                                 02790000
CVTRV316 EQU   CVTSTATE                                                 02791000
CVTRV315 EQU   CVTGTFS                                                  02792000
CVTGTFAV EQU   CVTGTFS                                                  02793000
CVT0SCR1 EQU   CVTMAP+232                                               02794000
CVTRV515 EQU   CVTMAP+228                                               02795000
CVTRMS   EQU   CVTMAP+224                                               02796000
CVTPATCH EQU   CVTMAP+220                                               02797000
CVTTSCE  EQU   CVTMAP+216                                               02798000
CVTLNKSC EQU   CVTMAP+214                                               02799000
CVTQABST EQU   CVTMAP+212                                               02800000
CVTMDLDS EQU   CVTMAP+208                                               02801000
CVTUSER  EQU   CVTMAP+204                                               02802000
CVTSMCA  EQU   CVTMAP+196                                               02803000
CVTRSV18 EQU   CVTMAP+192                                               02804000
CVTQLPAQ EQU   CVTMAP+188                                               02805000
CVTQCDSR EQU   CVTMAP+184                                               02806000
CVTVS1B  EQU   CVTOPTB                                                  02807000
CVTVS1A  EQU   CVTOPTB                                                  02808000
CVTFP    EQU   CVTOPTB                                                  02809000
CVTAPTHR EQU   CVTOPTB                                                  02810000
CVTNLOG  EQU   CVTOPTB                                                  02811000
CVTTOD   EQU   CVTOPTB                                                  02812000
CVTCTIMS EQU   CVTOPTB                                                  02813000
CVTPROT  EQU   CVTOPTB                                                  02814000
CVTXPFP  EQU   CVTOPTA                                                  02815000
CVTASCII EQU   CVTOPTA                                                  02816000
CVTRSV13 EQU   CVTOPTA                                                  02817000
CVTRSV12 EQU   CVTOPTA                                                  02818000
CVTNIP   EQU   CVTOPTA                                                  02819000
CVTDDR   EQU   CVTOPTA                                                  02820000
CVTAPR   EQU   CVTOPTA                                                  02821000
CVTCCH   EQU   CVTOPTA                                                  02822000
CVTSNCTR EQU   CVTMAP+180                                               02823000
CVTQMWR  EQU   CVTMAP+176                                               02824000
CVTQOCR  EQU   CVTMAP+172                                               02825000
CVT1EF00 EQU   CVTMAP+168                                               02826000
CVTMZ00  EQU   CVTMAP+164                                               02827000
CVTHEAD  EQU   CVTMAP+160                                               02828000
CVTRSV11 EQU   CVTMAP+156                                               02829000
CVT0PT01 EQU   CVTMAP+152                                               02830000
CVTMSER  EQU   CVTMAP+148                                               02831000
CVTRV516 EQU   CVTIERLC                                                 02832000
CVTILCH  EQU   CVTMAP+140                                               02833000
CVT0DS   EQU   CVTMAP+136                                               02834000
CVTFBOSV EQU   CVTMAP+132                                               02835000
CVTNUCB  EQU   CVTMAP+128                                               02836000
CVTIXAVL EQU   CVTMAP+124                                               02837000
CVTIOQET EQU   CVTMAP+120                                               02838000
CVTDCBA  EQU   CVTMAP+117                                               02839000
CVTMVS2  EQU   CVTDCB                                                   02840000
CVT6DAT  EQU   CVTDCB                                                   02841000
CVT4MPS  EQU   CVTDCB                                                   02842000
CVTRSV09 EQU   CVTDCB                                                   02843000
CVT4MS1  EQU   CVTDCB                                                   02844000
CVT2SPS  EQU   CVTDCB                                                   02845000
CVT1SSS  EQU   CVTDCB                                                   02846000
CVTRSV08 EQU   CVTDCB                                                   02847000
CVTSTB   EQU   CVTMAP+112                                               02848000
CVTQTD00 EQU   CVTMAP+108                                               02849000
CVTQTE00 EQU   CVTMAP+104                                               02850000
CVTCUCB  EQU   CVTMAP+100                                               02851000
CVTSJQ   EQU   CVTMAP+96                                                02852000
CVTPBLDL EQU   CVTMAP+92                                                02853000
CVTTPC   EQU   CVTMAP+88                                                02854000
CVTSVDCB EQU   CVTMAP+84                                                02855000
CVTBRET  EQU   CVTMAP+82                                                02856000
CVTEXIT  EQU   CVTMAP+80                                                02857000
CVT0FN00 EQU   CVTMAP+76                                                02858000
CVTDARA  EQU   CVTDAR+1                                                 02859000
CVTRSV07 EQU   CVTFLGS1                                                 02860000
CVTRSV06 EQU   CVTFLGS1                                                 02861000
CVTRSV05 EQU   CVTFLGS1                                                 02862000
CVTRSV04 EQU   CVTFLGS1                                                 02863000
CVTRSV03 EQU   CVTFLGS1                                                 02864000
CVTRSV02 EQU   CVTFLGS1                                                 02865000
CVTRSV01 EQU   CVTFLGS1                                                 02866000
CVTDMPLK EQU   CVTFLGS1                                                 02867000
CVTXITP  EQU   CVTMAP+68                                                02868000
CVTZDTAB EQU   CVTMAP+64                                                02869000
CVTMSLT  EQU   CVTMAP+60                                                02870000
CVTDATE  EQU   CVTMAP+56                                                02871000
CVTSYSAD EQU   CVTMAP+48                                                02872000
CVTXTLER EQU   CVTMAP+44                                                02873000
CVTILK2  EQU   CVTMAP+40                                                02874000
CVTILK1  EQU   CVTMAP+36                                                02875000
CVTPRLTV EQU   CVTMAP+32                                                02876000
CVTPCNVT EQU   CVTMAP+28                                                02877000
CVT0VL00 EQU   CVTMAP+24                                                02878000
CVTXAPG  EQU   CVTMAP+20                                                02879000
CVTBUF   EQU   CVTMAP+16                                                02880000
CVTJOB   EQU   CVTMAP+12                                                02881000
CVTLINK  EQU   CVTMAP+8                                                 02882000
CVT0EF00 EQU   CVTMAP+4                                                 02883000
CVTTCBP  EQU   CVTMAP                                                   02884000
CVT      EQU   CVTMAP                                                   02885000
@NM00053 EQU   PSA+3668                                                 02886000
PSASTAK  EQU   PSA+3072                                                 02887000
@NM00052 EQU   PSA+1048                                                 02888000
PSAUSEND EQU   PSA+1048                                                 02889000
PSARV062 EQU   PSA+1044                                                 02890000
PSACDAL  EQU   PSA+1040                                                 02891000
PSAWTCOD EQU   PSA+1036                                                 02892000
PSAATCVT EQU   PSA+1032                                                 02893000
PSAPCPSW EQU   PSA+1024                                                 02894000
PSAPIR2  EQU   PSA+1020                                                 02895000
PSARV059 EQU   PSA+1018                                                 02896000
PSASVC13 EQU   PSA+1016                                                 02897000
PSASFACC EQU   PSA+1008                                                 02898000
PSASTOP  EQU   PSA+992                                                  02899000
PSASTART EQU   PSA+976                                                  02900000
PSARSPSW EQU   PSA+968                                                  02901000
PSASRPSW EQU   PSA+960                                                  02902000
PSARV045 EQU   PSA+892                                                  02903000
PSARV044 EQU   PSA+888                                                  02904000
PSARV043 EQU   PSA+884                                                  02905000
PSARV042 EQU   PSA+880                                                  02906000
PSARV041 EQU   PSA+876                                                  02907000
PSARV040 EQU   PSA+872                                                  02908000
PSARV025 EQU   PSA+868                                                  02909000
PSADSSED EQU   PSA+868                                                  02910000
PSADSSPR EQU   PSA+864                                                  02911000
PSADSSFW EQU   PSA+860                                                  02912000
PSADSS14 EQU   PSA+856                                                  02913000
PSADSSPP EQU   PSA+848                                                  02914000
PSADSSRP EQU   PSA+840                                                  02915000
PSADSS05 EQU   PSADSSF4                                                 02916000
PSADSS10 EQU   PSADSSF4                                                 02917000
PSADSSVE EQU   PSADSSF4                                                 02918000
PSADSSDE EQU   PSADSSF4                                                 02919000
PSADSSC0 EQU   PSADSSF4                                                 02920000
PSADSSIE EQU   PSADSSF4                                                 02921000
PSADSS12 EQU   PSADSSF4                                                 02922000
PSADSSRC EQU   PSADSSF4                                                 02923000
PSARV057 EQU   PSADSSF3                                                 02924000
PSARV056 EQU   PSADSSF3                                                 02925000
PSARV055 EQU   PSADSSF3                                                 02926000
PSADSSMC EQU   PSADSSF3                                                 02927000
PSADSSRW EQU   PSADSSF3                                                 02928000
PSADSSNM EQU   PSADSSF3                                                 02929000
PSADSSES EQU   PSADSSF3                                                 02930000
PSADSSGP EQU   PSADSSF3                                                 02931000
PSADSSF2 EQU   PSADSSFL+1                                               02932000
PSADSSPI EQU   PSADSSF1                                                 02933000
PSADSSOI EQU   PSADSSF1                                                 02934000
PSADSSSP EQU   PSADSSF1                                                 02935000
PSADSSTP EQU   PSADSSF1                                                 02936000
PSADSSDW EQU   PSADSSF1                                                 02937000
PSADSSDD EQU   PSADSSF1                                                 02938000
PSADSSDM EQU   PSADSSF1                                                 02939000
PSADSSMV EQU   PSADSSF1                                                 02940000
PSADSSTS EQU   PSA+816                                                  02941000
PSADSSWK EQU   PSA+812                                                  02942000
PSADSSR3 EQU   PSA+808                                                  02943000
PSADSSR2 EQU   PSA+804                                                  02944000
PSADSSRS EQU   PSA+800                                                  02945000
PSASTOR  EQU   PSA+796                                                  02946000
PSACPUSA EQU   PSA+794                                                  02947000
PSAVSTAP EQU   PSA+792                                                  02948000
PSAWKVAP EQU   PSA+788                                                  02949000
PSAWKRAP EQU   PSA+784                                                  02950000
PSAMCHIC EQU   PSA+783                                                  02951000
PSARV061 EQU   PSA+782                                                  02952000
PSASYMSK EQU   PSA+781                                                  02953000
PSAMCHFL EQU   PSA+780                                                  02954000
PSACR0   EQU   PSA+776                                                  02955000
PSAPSWSV EQU   PSA+768                                                  02956000
PSACLHS  EQU   PSAHLHI                                                  02957000
PSALKR15 EQU   PSALKSA+60                                               02958000
PSALKR14 EQU   PSALKSA+56                                               02959000
PSALKR13 EQU   PSALKSA+52                                               02960000
PSALKR12 EQU   PSALKSA+48                                               02961000
PSALKR11 EQU   PSALKSA+44                                               02962000
PSALKR10 EQU   PSALKSA+40                                               02963000
PSALKR9  EQU   PSALKSA+36                                               02964000
PSALKR8  EQU   PSALKSA+32                                               02965000
PSALKR7  EQU   PSALKSA+28                                               02966000
PSALKR6  EQU   PSALKSA+24                                               02967000
PSALKR5  EQU   PSALKSA+20                                               02968000
PSALKR4  EQU   PSALKSA+16                                               02969000
PSALKR3  EQU   PSALKSA+12                                               02970000
PSALKR2  EQU   PSALKSA+8                                                02971000
PSALKR1  EQU   PSALKSA+4                                                02972000
PSALKR0  EQU   PSALKSA                                                  02973000
PSARV023 EQU   PSACLHT+52                                               02974000
PSALOCAL EQU   PSACLHT+48                                               02975000
PSACMSL  EQU   PSACLHT+44                                               02976000
PSAOPTL  EQU   PSACLHT+40                                               02977000
PSATPACL EQU   PSACLHT+36                                               02978000
PSATPDNL EQU   PSACLHT+32                                               02979000
PSATPNCL EQU   PSACLHT+28                                               02980000
PSAIOSLL EQU   PSACLHT+24                                               02981000
PSAIOSUL EQU   PSACLHT+20                                               02982000
PSAIOSCL EQU   PSACLHT+16                                               02983000
PSAIOSSL EQU   PSACLHT+12                                               02984000
PSASALCL EQU   PSACLHT+8                                                02985000
PSAASML  EQU   PSACLHT+4                                                02986000
PSADISPL EQU   PSACLHT                                                  02987000
PSASRSA  EQU   PSA+636                                                  02988000
PSARV050 EQU   PSA+634                                                  02989000
PSADSSGO EQU   PSA+633                                                  02990000
PSARECUR EQU   PSA+632                                                  02991000
PSAHLHIS EQU   PSA+628                                                  02992000
PSAIPCSA EQU   PSA+624                                                  02993000
@NM00051 EQU   PSA+621                                                  02994000
PSAIPCDM EQU   PSA+620                                                  02995000
PSAIPCD  EQU   PSA+616                                                  02996000
@NM00050 EQU   PSA+613                                                  02997000
PSAIPCRM EQU   PSA+612                                                  02998000
PSAIPCR  EQU   PSA+608                                                  02999000
PSAMCHEX EQU   PSA+600                                                  03000000
PSAMPSW  EQU   PSA+592                                                  03001000
PSAEXPS2 EQU   PSA+584                                                  03002000
PSAEXPS1 EQU   PSA+576                                                  03003000
PSAPIREG EQU   PSA+572                                                  03004000
PSARSREG EQU   PSA+568                                                  03005000
PSAGPREG EQU   PSA+556                                                  03006000
PSARV022 EQU   PSASUP4                                                  03007000
PSARV021 EQU   PSASUP4                                                  03008000
PSARV020 EQU   PSASUP4                                                  03009000
PSARV019 EQU   PSASUP4                                                  03010000
PSARV018 EQU   PSASUP4                                                  03011000
PSARV017 EQU   PSASUP4                                                  03012000
PSARV016 EQU   PSASUP4                                                  03013000
PSARV015 EQU   PSASUP4                                                  03014000
PSARV014 EQU   PSASUP3                                                  03015000
PSARV013 EQU   PSASUP3                                                  03016000
PSARV012 EQU   PSASUP3                                                  03017000
PSARV011 EQU   PSASUP3                                                  03018000
PSASPR   EQU   PSASUP3                                                  03019000
PSAPSREG EQU   PSASUP3                                                  03020000
PSAPI2   EQU   PSASUP3                                                  03021000
PSAIOSUP EQU   PSASUP3                                                  03022000
PSALCR   EQU   PSASUP2                                                  03023000
PSARTM   EQU   PSASUP2                                                  03024000
PSAACR   EQU   PSASUP2                                                  03025000
PSAIPCE2 EQU   PSASUP2                                                  03026000
PSAIPCES EQU   PSASUP2                                                  03027000
PSAIPCEC EQU   PSASUP2                                                  03028000
PSAGTF   EQU   PSASUP2                                                  03029000
PSAIPCRI EQU   PSASUP2                                                  03030000
PSARV063 EQU   PSASUP1                                                  03031000
PSATCTL  EQU   PSASUP1                                                  03032000
PSADISP  EQU   PSASUP1                                                  03033000
PSALOCK  EQU   PSASUP1                                                  03034000
PSAPI    EQU   PSASUP1                                                  03035000
PSAEXT   EQU   PSASUP1                                                  03036000
PSASVC   EQU   PSASUP1                                                  03037000
PSAIO    EQU   PSASUP1                                                  03038000
PSAANEW  EQU   PSA+544                                                  03039000
PSATOLD  EQU   PSA+540                                                  03040000
PSATNEW  EQU   PSA+536                                                  03041000
PSALCCAR EQU   PSA+532                                                  03042000
PSALCCAV EQU   PSA+528                                                  03043000
PSAPCCAR EQU   PSA+524                                                  03044000
PSAPCCAV EQU   PSA+520                                                  03045000
PSACPULA EQU   PSA+518                                                  03046000
PSACPUPA EQU   PSA+516                                                  03047000
PSAPSA   EQU   PSA+512                                                  03048000
FLCHDEND EQU   PSA+512                                                  03049000
FLCCRSAV EQU   FLCMCLA+280                                              03050000
FLCGRSAV EQU   FLCMCLA+216                                              03051000
FLCFPSAV EQU   FLCMCLA+184                                              03052000
FLCFLA   EQU   FLCMCLA+88                                               03053000
FLCRGNCD EQU   FLCMCLA+84                                               03054000
FLCFSAA  EQU   FLCFSA+1                                                 03055000
@NM00049 EQU   FLCFSA                                                   03056000
@NM00048 EQU   FLCMCLA+72                                               03057000
FLCMCIC  EQU   FLCMCLA+64                                               03058000
@NM00047 EQU   FLCMCLA+20                                               03059000
FLCIOAA  EQU   FLCIOA+1                                                 03060000
@NM00046 EQU   FLCIOA                                                   03061000
@NM00045 EQU   FLCMCLA+15                                               03062000
@NM00044 EQU   FLCMCLA+14                                               03063000
@NM00043 EQU   FLCMCLA+12                                               03064000
FLCLCL   EQU   FLCMCLA+8                                                03065000
FLCIOELA EQU   FLCIOEL+1                                                03066000
@NM00042 EQU   FLCIOEL                                                  03067000
FLCCHNID EQU   FLCMCLA                                                  03068000
@NM00041 EQU   PSA+160                                                  03069000
FLCMTRCD EQU   PSA+157                                                  03070000
@NM00040 EQU   PSA+156                                                  03071000
FLCPERA  EQU   FLCPER+1                                                 03072000
@NM00039 EQU   FLCPER                                                   03073000
@NM00038 EQU   PSA+151                                                  03074000
FLCPERCD EQU   PSA+150                                                  03075000
FLCMCNUM EQU   PSA+149                                                  03076000
@NM00037 EQU   PSA+148                                                  03077000
FLCTEAA  EQU   FLCTEA+1                                                 03078000
@NM00036 EQU   FLCTEA                                                   03079000
PSAPIPC  EQU   PSAPICOD                                                 03080000
PSAPIMC  EQU   PSAPICOD                                                 03081000
PSAPIPER EQU   PSAPICOD                                                 03082000
PSARV049 EQU   FLCPICOD                                                 03083000
FLCPILCB EQU   FLCPIILC                                                 03084000
@NM00035 EQU   FLCPIILC                                                 03085000
@NM00034 EQU   PSAEPPSW                                                 03086000
FLCSVCN  EQU   PSAESPSW+2                                               03087000
FLCSILCB EQU   FLCSVILC                                                 03088000
@NM00033 EQU   FLCSVILC                                                 03089000
@NM00032 EQU   PSAESPSW                                                 03090000
FLCEICOD EQU   PSAEEPSW+2                                               03091000
PSASPAD  EQU   PSAEEPSW                                                 03092000
@NM00031 EQU   PSA+128                                                  03093000
FLCINPSW EQU   PSA+120                                                  03094000
FLCMNPSW EQU   PSA+112                                                  03095000
FLCPNPSW EQU   PSA+104                                                  03096000
FLCSNPSW EQU   PSA+96                                                   03097000
FLCENPSW EQU   PSA+88                                                   03098000
FLCTRACE EQU   PSA+84                                                   03099000
FLCTIMER EQU   PSA+80                                                   03100000
FLCCVT2  EQU   PSA+76                                                   03101000
FLCCAW   EQU   PSA+72                                                   03102000
FLCCSW   EQU   PSA+64                                                   03103000
FLCIOPSW EQU   PSA+56                                                   03104000
FLCMOPSW EQU   PSA+48                                                   03105000
FLCPOPSW EQU   PSA+40                                                   03106000
FLCSOPSW EQU   PSA+32                                                   03107000
FLCEOPSW EQU   PSA+24                                                   03108000
@NM00030 EQU   FLCICCW2+4                                               03109000
FLCICCW1 EQU   FLCROPSW                                                 03110000
FLCIPPSW EQU   FLCRNPSW                                                 03111000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03112000
@RT00073 EQU   @EL00001                                                 03113000
@RC00178 EQU   @RC00175                                                 03114000
@RC00188 EQU   @RC00175                                                 03115000
@RC00211 EQU   @RC00203                                                 03116000
@RC00232 EQU   @RC00225                                                 03117000
@ENDDATA EQU   *                                                        03118000
         END   IKTIOFRR,(C'PLS1148',0702,79216)                         03119000
