SVTM     TITLE 'IKTIST00, LOSTERM EXIT SCHEDULER'                       00001000
IKTIST00 CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'IKTIST00  78.336'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00009000
         BALR  @12,0                                            01S0001 00010000
@PSTART  DS    0H                                               01S0001 00011000
         USING @PSTART,@12                                      01S0001 00012000
         PRINT OFF                                                      00013000
         PRINT ON                                                       00014000
*   DO;                             /* REQSTORE CBID(UECB)CLEAR(YES)S   00015000
*                                      AVE(NO)PRIORITY(YES)          */ 00016000
*                                                               01S0122 00017000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 00018000
*/* END OF ATBUILD                                                   */ 00019000
*                                                               01S0122 00020000
*     DO;                                                       01S0122 00021000
*     END;                                                      01S0123 00022000
*     DO;                                                       01S0124 00023000
*       RFY                                                     01S0125 00024000
*        (GPR02P,                                               01S0125 00025000
*         GPR03P,                                               01S0125 00026000
*         GPR04P,                                               01S0125 00027000
*         GPR15P) RSTD;                                         01S0125 00028000
*     END;                                                      01S0126 00029000
*     DO;                           /* LISATCVT                 01S0127 00030000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00031000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 00032000
         L     GPR15P,ATCLCPTR                                  01S0128 00033000
*     END;                          /* LISATCVT                      */ 00034000
*     GPR02P=GPR15P->ATCBPDA|'80000000'X;                       01S0130 00035000
         L     GPR02P,ATCBPDA(,GPR15P)                          01S0130 00036000
         O     GPR02P,@CF01163                                  01S0130 00037000
*     DCL                                                       01S0131 00038000
*       1 FMZA0002 FIXED(31) STATIC LOCAL,                      01S0131 00039000
*        2 * FIXED(8) INIT(208),                                01S0131 00040000
*        2 * PTR(24) INIT(0);                                   01S0131 00041000
*     GPR03F=FMZA0002;                                          01S0132 00042000
         L     GPR03F,FMZA0002                                  01S0132 00043000
*     GPR04F=17;                                                01S0133 00044000
         LA    GPR04F,17                                        01S0133 00045000
*     GPR15P=GPR15P->ATCSMRQ;                                   01S0134 00046000
         L     GPR15P,ATCSMRQ(,GPR15P)                          01S0134 00047000
*     DCL                                                       01S0135 00048000
*       FMZL0002 BASED(GPR15P) LABEL VALUERANGE(*);             01S0135 00049000
*     CALL FMZL0002;                                            01S0136 00050000
         BALR  @14,@15                                          01S0136 00051000
*     DO;                                                       01S0137 00052000
*       RFY                                                     01S0138 00053000
*        (GPR02P,                                               01S0138 00054000
*         GPR03P,                                               01S0138 00055000
*         GPR04P,                                               01S0138 00056000
*         GPR15P) UNRSTD;                                       01S0138 00057000
*     END;                                                      01S0139 00058000
*   END;                            /* REQSTORE                      */ 00059000
*   IF RETCDE<8 THEN                /* IF STORAGE IS AVAILABLE       */ 00060000
         C     RETCDE,@CF00037                                  01S0141 00061000
         BNL   @RF00141                                         01S0141 00062000
*     DO;                                                       01S0142 00063000
*       UECBPTR=STORADDR;           /* SAVE UECB ADDRESS             */ 00064000
         LR    UECBPTR,STORADDR                                 01S0143 00065000
*       DO;                         /* REQSTORE CBID(VRPL)SAVE(NO)PRI   00066000
*                                      ORITY(YES)                    */ 00067000
*                                                               01S0145 00068000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 00069000
*/* END OF ATBUILD                                                   */ 00070000
*                                                               01S0145 00071000
*         DO;                                                   01S0145 00072000
*         END;                                                  01S0146 00073000
*         DO;                                                   01S0147 00074000
*           RFY                                                 01S0148 00075000
*            (GPR02P,                                           01S0148 00076000
*             GPR03P,                                           01S0148 00077000
*             GPR04P,                                           01S0148 00078000
*             GPR15P) RSTD;                                     01S0148 00079000
*         END;                                                  01S0149 00080000
*         DO;                       /* LISATCVT                 01S0150 00081000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00082000
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 00083000
         L     GPR15P,ATCLCPTR                                  01S0151 00084000
*         END;                      /* LISATCVT                      */ 00085000
*         GPR02P=GPR15P->ATCBPDA|'80000000'X;                   01S0153 00086000
         L     GPR02P,ATCBPDA(,GPR15P)                          01S0153 00087000
         O     GPR02P,@CF01163                                  01S0153 00088000
*         DCL                                                   01S0154 00089000
*           1 FMZA0023 FIXED(31) STATIC LOCAL,                  01S0154 00090000
*            2 * FIXED(8) INIT(80),                             01S0154 00091000
*            2 * PTR(24) INIT(0);                               01S0154 00092000
*         GPR03F=FMZA0023;                                      01S0155 00093000
         L     GPR03F,FMZA0023                                  01S0155 00094000
*         GPR04F=33;                                            01S0156 00095000
         LA    GPR04F,33                                        01S0156 00096000
*         GPR15P=GPR15P->ATCSMRQ;                               01S0157 00097000
         L     GPR15P,ATCSMRQ(,GPR15P)                          01S0157 00098000
*         DCL                                                   01S0158 00099000
*           FMZL0023 BASED(GPR15P) LABEL VALUERANGE(*);         01S0158 00100000
*         CALL FMZL0023;                                        01S0159 00101000
         BALR  @14,@15                                          01S0159 00102000
*         DO;                                                   01S0160 00103000
*           RFY                                                 01S0161 00104000
*            (GPR02P,                                           01S0161 00105000
*             GPR03P,                                           01S0161 00106000
*             GPR04P,                                           01S0161 00107000
*             GPR15P) UNRSTD;                                   01S0161 00108000
*         END;                                                  01S0162 00109000
*       END;                        /* REQSTORE                      */ 00110000
*       IF RETCDE<8 THEN            /* IF STORAGE IS AVAILABLE       */ 00111000
         C     RETCDE,@CF00037                                  01S0164 00112000
         BNL   @RF00164                                         01S0164 00113000
*         DO;                                                   01S0165 00114000
*           RFY                                                 01S0166 00115000
*             STORADDR RSTD;                                    01S0166 00116000
*           VRPLPTR=STORADDR;       /* SAVE VRPL ADDRESS             */ 00117000
         LR    VRPLPTR,STORADDR                                 01S0167 00118000
*           RFY                                                 01S0168 00119000
*             STORADDR UNRSTD;                                  01S0168 00120000
*                                                               02S0169 00121000
*           /*********************************************************/ 00122000
*           /*                                                       */ 00123000
*           /* SEGMENT UECBINIT- INITIALIZE THE UECB                 */ 00124000
*           /*                                                       */ 00125000
*           /*********************************************************/ 00126000
*                                                               02S0169 00127000
*           DO;                                                 02S0169 00128000
*             UECID=UEID;           /* SET ID                        */ 00129000
         MVI   UECID(UECBPTR),X'10'                             02S0170 00130000
*             UECLEN=LENGTH(ISTUECB);/* SET LENGTH                   */ 00131000
         MVI   UECLEN(UECBPTR),X'54'                            02S0171 00132000
*             UECTYPE=UECLOGOF;     /* SET EXIT ID                   */ 00133000
         MVI   UECTYPE(UECBPTR),X'09'                           02S0172 00134000
*             UECTSKID=ACDTSKID;    /* GET TASK ID                   */ 00135000
         L     @14,PSAAOLD                                      02S0173 00136000
         L     @14,ASCBASXB(,@14)                               02S0173 00137000
         L     @14,ASXBMPST(,@14)                               02S0173 00138000
         L     @14,MPSDBTBL(,@14)                               02S0173 00139000
         L     @14,DCEDBPTR(,@14)                               02S0173 00140000
         L     @10,ACDTSKID(,@14)                               02S0173 00141000
         ST    @10,UECTSKID(,UECBPTR)                           02S0173 00142000
*             UECEXLST=ACBEXLST;    /* GET EXIT LIST POINTER         */ 00143000
         L     @14,ACDACB(,@14)                                 02S0174 00144000
         L     @10,ACBEXLST(,@14)                               02S0174 00145000
         ST    @10,UECEXLST(,UECBPTR)                           02S0174 00146000
*             PABOFFST=ADDR(UECPAB)-ADDR(ISTUECB);/* GET PAB OFFSET  */ 00147000
         LA    @10,16                                           02S0175 00148000
         ALR   @10,UECBPTR                                      02S0175 00149000
         MVI   PABOFFST(@10),X'10'                              02S0175 00150000
*             PABDVTA=ADDR(UECDVTPT);/* GET DVT ADDRESS              */ 00151000
         LA    @03,UECDVTPT(,UECBPTR)                           02S0176 00152000
         STCM  @03,7,PABDVTA(@10)                               02S0176 00153000
*             PABAPYP='1'B;         /* SET USER EXIT FLAG            */ 00154000
         OI    PABAPYP(@10),B'10000000'                         02S0177 00155000
*             UECACB=ACDACB;        /* GET ACB ADDRESS               */ 00156000
         ST    @14,UECACB(,UECBPTR)                             02S0178 00157000
*             UECNDID=RPLARG;       /* COPY CID FROM RPL             */ 00158000
         L     @14,RPLARG(,PTRRPL)                              02S0179 00159000
         ST    @14,UECNDID(,UECBPTR)                            02S0179 00160000
*             UECUSFLD=VRPLPTR;     /* ADDRESS OF COPIED RPL         */ 00161000
         ST    VRPLPTR,UECUSFLD(,UECBPTR)                       02S0180 00162000
*             UECRSNBT=1;           /* UECB REASON CODE= TSO LOSTERM */ 00163000
         MVI   UECRSNBT(UECBPTR),X'01'                          02S0181 00164000
*             UECVRPL=VRPLPTR;      /* ADDRESS OF COPIED RPL         */ 00165000
         ST    VRPLPTR,UECVRPL(,UECBPTR)                        02S0182 00166000
*             UECDVTPT=ATCUEP;      /* GET EXIT INTERFACE ADDRESS    */ 00167000
         L     @14,ATCLCPTR                                     02S0183 00168000
         L     @10,ATCUEP(,@14)                                 02S0183 00169000
         ST    @10,UECDVTPT(,UECBPTR)                           02S0183 00170000
*           END;                                                02S0184 00171000
*           VRPLPTR->IFGRPL=IFGRPL; /* COPY RPL TO VRPL              */ 00172000
         MVC   IFGRPL(112,VRPLPTR),IFGRPL(PTRRPL)               01S0185 00173000
*           VRPLPTR->RPLAREA=0;     /* CLEAR AREA POINTER    @ZM42851*/ 00174000
         SLR   @10,@10                                          01S0186 00175000
         ST    @10,RPLAREA(,VRPLPTR)                            01S0186 00176000
*           DO;                     /* TPQUE (UECBPTR,UECPAB) NORM      00177000
*                                      NSTR                          */ 00178000
*             DO;                                               01S0188 00179000
*               RFY                                             01S0189 00180000
*                (GPR00P,                                       01S0189 00181000
*                 GPR01P,                                       01S0189 00182000
*                 GPR04P,                                       01S0189 00183000
*                 GPR05P,                                       01S0189 00184000
*                 GPR15P) RSTD;                                 01S0189 00185000
*             END;                                              01S0190 00186000
*             GPR00P=0;                                         01S0191 00187000
         SLR   GPR00P,GPR00P                                    01S0191 00188000
*             GPR15P=ADDR(UECPAB);                              01S0192 00189000
         LA    GPR15P,UECPAB(,UECBPTR)                          01S0192 00190000
*             GPR04P=UECBPTR;       /* WORK ELE PTR                  */ 00191000
         LR    GPR04P,UECBPTR                                   01S0193 00192000
*             GPR05P=GPR15P;        /* PASS PAB PTR                  */ 00193000
         LR    GPR05P,GPR15P                                    01S0194 00194000
*             CALL ATCLCPTR->ATCAP37->ISTAPC37;                 01S0195 00195000
         L     @15,ATCAP37(,@14)                                01S0195 00196000
         BALR  @14,@15                                          01S0195 00197000
*             GEN(DC BL2'01000')                                01S0196 00198000
*             NOSETS NOREFS;                                    01S0196 00199000
         DC BL2'01000'                                                  00200000
*             DO;                                               01S0197 00201000
*               RFY                                             01S0198 00202000
*                (GPR00P,                                       01S0198 00203000
*                 GPR01P,                                       01S0198 00204000
*                 GPR04P,                                       01S0198 00205000
*                 GPR05P,                                       01S0198 00206000
*                 GPR15P) UNRSTD;                               01S0198 00207000
*             END;                                              01S0199 00208000
*           END;                    /* TPQUE SCHEDULE USER EXIT      */ 00209000
*           RETCDE=0;               /* INDICATE THAT UECB/VRPL WAS      00210000
*                                      BUILT LOSTERM WAS SCHEDULED   */ 00211000
         SLR   RETCDE,RETCDE                                    01S0201 00212000
*         END;                                                  01S0202 00213000
*       ELSE                                                    01S0203 00214000
*         DO;                                                   01S0203 00215000
         B     @RC00164                                         01S0203 00216000
@RF00164 DS    0H                                               01S0204 00217000
*           DO;                     /* RELSTORE                 01S0204 00218000
*                                      BUFADDR(UECBPTR)SAVE(NO)      */ 00219000
*                                                               01S0205 00220000
*             /*******************************************************/ 00221000
*             /*                                                     */ 00222000
*             /* RELSTORE BUFADDR(UECBPTR)SAVE(NO)                   */ 00223000
*             /*                                                     */ 00224000
*             /*******************************************************/ 00225000
*                                                               01S0205 00226000
*             DO;                                               01S0205 00227000
*                                                               01S0205 00228000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00229000
*/* END OF ATBUILD                                                   */ 00230000
*                                                               01S0206 00231000
*               DO;                                             01S0206 00232000
*               END;                                            01S0207 00233000
*               DO;                                             01S0208 00234000
*                 RFY                                           01S0209 00235000
*                  (GPR02P,                                     01S0209 00236000
*                   GPR03P,                                     01S0209 00237000
*                   GPR04P,                                     01S0209 00238000
*                   GPR15P) RSTD;                               01S0209 00239000
*               END;                                            01S0210 00240000
*               GPR04P=UECBPTR;                                 01S0211 00241000
         LR    GPR04P,UECBPTR                                   01S0211 00242000
*               DCL                                             01S0212 00243000
*                 1 FMZA0055 FIXED(31) STATIC LOCAL,            01S0212 00244000
*                  2 * FIXED(8) INIT(0),                        01S0212 00245000
*                  2 * PTR(24) INIT(0);                         01S0212 00246000
*               GPR03F=FMZA0055;                                01S0213 00247000
         L     GPR03F,FMZA0055                                  01S0213 00248000
*               DO;                 /* LISATCVT                 01S0214 00249000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00250000
*                 GPR15P=ATCLCPTR;  /* SET UP ATCVT POINTER          */ 00251000
         L     GPR15P,ATCLCPTR                                  01S0215 00252000
*               END;                /* LISATCVT                      */ 00253000
*               GPR02P=GPR15P->ATCBPDA;                         01S0217 00254000
         L     GPR02P,ATCBPDA(,GPR15P)                          01S0217 00255000
*               GPR15P=GPR15P->ATCSMRS;                         01S0218 00256000
         L     GPR15P,ATCSMRS(,GPR15P)                          01S0218 00257000
*               DCL                                             01S0219 00258000
*                 FMZL0055 BASED(GPR15P) LABEL VALUERANGE(*);   01S0219 00259000
*               CALL FMZL0055;                                  01S0220 00260000
         BALR  @14,@15                                          01S0220 00261000
*               DO;                                             01S0221 00262000
*                 RFY                                           01S0222 00263000
*                  (GPR02P,                                     01S0222 00264000
*                   GPR03P,                                     01S0222 00265000
*                   GPR04P,                                     01S0222 00266000
*                   GPR15P) UNRSTD;                             01S0222 00267000
*               END;                                            01S0223 00268000
*             END;                                              01S0224 00269000
*           END;                    /* RELSTORE RETURN UECB STG      */ 00270000
*           RETCDE=4;               /* INDICATE THAT UECB/VRPL WAS      00271000
*                                      NOT BUILT LOSTERM NOT    01S0226 00272000
*                                      SCHEDULED                     */ 00273000
         LA    RETCDE,4                                         01S0226 00274000
*         END;                                                  01S0227 00275000
*     END;                                                      01S0228 00276000
*   ELSE                                                        01S0229 00277000
*     RETCDE=4;                     /* INDICATE THAT UECB/VRPL WAS      00278000
*                                      NOT BUILT LOSTERM NOT    01S0229 00279000
*                                      SCHEDULED                     */ 00280000
         B     @RC00141                                         01S0229 00281000
@RF00141 LA    RETCDE,4                                         01S0229 00282000
*   RETURN CODE(RETCDE);            /* RETURN TO CALLER              */ 00283000
@RC00141 L     @14,12(,@13)                                     01S0230 00284000
         LM    @00,@12,20(@13)                                  01S0230 00285000
         BR    @14                                              01S0230 00286000
*   DO;                             /* TPEPILOG                      */ 00287000
*     GEN(PRINT OFF);                                           01S0232 00288000
         PRINT OFF                                                      00289000
*     DO;                                                       01S0233 00290000
*       DCL                                                     01S0234 00291000
*         GPR00F FIXED(31) REG(00),                             01S0234 00292000
*         GPR00P PTR(31) REG(00),                               01S0234 00293000
*         GPR01F FIXED(31) REG(01),                             01S0234 00294000
*         GPR01P PTR(31) REG(01),                               01S0234 00295000
*         GPR02F FIXED(31) REG(02),                             01S0234 00296000
*         GPR02P PTR(31) REG(02),                               01S0234 00297000
*         GPR03F FIXED(31) REG(03),                             01S0234 00298000
*         GPR03P PTR(31) REG(03),                               01S0234 00299000
*         GPR04F FIXED(31) REG(04),                             01S0234 00300000
*         GPR04P PTR(31) REG(04),                               01S0234 00301000
*         GPR05F FIXED(31) REG(05),                             01S0234 00302000
*         GPR05P PTR(31) REG(05),                               01S0234 00303000
*         GPR06F FIXED(31) REG(06),                             01S0234 00304000
*         GPR06P PTR(31) REG(06),                               01S0234 00305000
*         GPR07F FIXED(31) REG(07),                             01S0234 00306000
*         GPR07P PTR(31) REG(07),                               01S0234 00307000
*         GPR08F FIXED(31) REG(08),                             01S0234 00308000
*         GPR08P PTR(31) REG(08),                               01S0234 00309000
*         GPR09F FIXED(31) REG(09),                             01S0234 00310000
*         GPR09P PTR(31) REG(09),                               01S0234 00311000
*         GPR10F FIXED(31) REG(10),                             01S0234 00312000
*         GPR10P PTR(31) REG(10),                               01S0234 00313000
*         GPR11F FIXED(31) REG(11),                             01S0234 00314000
*         GPR11P PTR(31) REG(11),                               01S0234 00315000
*         GPR12F FIXED(31) REG(12),                             01S0234 00316000
*         GPR12P PTR(31) REG(12),                               01S0234 00317000
*         GPR13F FIXED(31) REG(13),                             01S0234 00318000
*         GPR13P PTR(31) REG(13),                               01S0234 00319000
*         GPR14F FIXED(31) REG(14),                             01S0234 00320000
*         GPR14P PTR(31) REG(14),                               01S0234 00321000
*         GPR15F FIXED(31) REG(15),                             01S0234 00322000
*         GPR15P PTR(31) REG(15);                               01S0234 00323000
*     END;                                                      01S0235 00324000
*     DO;                                                       01S0236 00325000
*       DCL                                                     01S0237 00326000
*         ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE    */ 00327000
*       DCL                                                     01S0238 00328000
*         ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE    */ 00329000
*     END;                                                      01S0239 00330000
*     GEN(PRINT ON);                                            01S0240 00331000
         PRINT ON                                                       00332000
*   END;                            /* TPEPILOG                      */ 00333000
*   END IKTIST00                                                01S0242 00334000
*                                                               01S0242 00335000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00336000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00337000
*/*%INCLUDE SYSUT5  (IKTIST00)                                       */ 00338000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00339000
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                       */ 00340000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 00341000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 00342000
*/*%INCLUDE SYSLIB  (IFGACBVT)                                       */ 00343000
*/*%INCLUDE SYSLIB  (IFGEXLST)                                       */ 00344000
*/*%INCLUDE SYSLIB  (IFGEXLVT)                                       */ 00345000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00346000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00347000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 00348000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00349000
*/*%INCLUDE SYSUT5  (UECBINIT)                                       */ 00350000
*                                                               01S0242 00351000
*       ;                                                       01S0242 00352000
@EL00001 DS    0H                                               01S0242 00353000
@EF00001 DS    0H                                               01S0242 00354000
@ER00001 LM    @14,@12,12(@13)                                  01S0242 00355000
         BR    @14                                              01S0242 00356000
@DATA    DS    0H                                                       00357000
@DATD    DSECT                                                          00358000
         DS    0F                                                       00359000
IKTIST00 CSECT                                                          00360000
         DS    0F                                                       00361000
@CF00037 DC    F'8'                                                     00362000
@CF01163 DC    XL4'80000000'                                            00363000
@DATD    DSECT                                                          00364000
         DS    0D                                                       00365000
@ENDDATD EQU   *                                                        00366000
IKTIST00 CSECT                                                          00367000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00368000
         DS    0F                                                       00369000
@SIZDATD DC    AL1(0)                                                   00370000
         DC    AL3(@ENDDATD-@DATD)                                      00371000
         DS    0D                                                       00372000
FMZA0002 DS    FL4                                                      00373000
         ORG   FMZA0002                                                 00374000
@NM00145 DC    AL1(208)                                                 00375000
@NM00146 DC    AL3(0)                                                   00376000
         ORG   FMZA0002+4                                               00377000
FMZA0023 DS    FL4                                                      00378000
         ORG   FMZA0023                                                 00379000
@NM00147 DC    AL1(80)                                                  00380000
@NM00148 DC    AL3(0)                                                   00381000
         ORG   FMZA0023+4                                               00382000
FMZA0055 DS    FL4                                                      00383000
         ORG   FMZA0055                                                 00384000
@NM00149 DC    AL1(0)                                                   00385000
@NM00150 DC    AL3(0)                                                   00386000
         ORG   FMZA0055+4                                               00387000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00388000
@01      EQU   01                                                       00389000
@02      EQU   02                                                       00390000
@03      EQU   03                                                       00391000
@04      EQU   04                                                       00392000
@05      EQU   05                                                       00393000
@06      EQU   06                                                       00394000
@07      EQU   07                                                       00395000
@08      EQU   08                                                       00396000
@09      EQU   09                                                       00397000
@10      EQU   10                                                       00398000
@11      EQU   11                                                       00399000
@12      EQU   12                                                       00400000
@13      EQU   13                                                       00401000
@14      EQU   14                                                       00402000
@15      EQU   15                                                       00403000
VRPLPTR  EQU   @02                                                      00404000
RPHPTR   EQU   @01                                                      00405000
PTRRPL   EQU   @01                                                      00406000
STORADDR EQU   @03                                                      00407000
RETCDE   EQU   @15                                                      00408000
UECBPTR  EQU   @11                                                      00409000
GPR02P   EQU   @02                                                      00410000
GPR03P   EQU   @03                                                      00411000
GPR04P   EQU   @04                                                      00412000
GPR15P   EQU   @15                                                      00413000
GPR03F   EQU   @03                                                      00414000
GPR04F   EQU   @04                                                      00415000
GPR00P   EQU   @00                                                      00416000
GPR01P   EQU   @01                                                      00417000
GPR05P   EQU   @05                                                      00418000
GPR00F   EQU   @00                                                      00419000
GPR01F   EQU   @01                                                      00420000
GPR02F   EQU   @02                                                      00421000
GPR05F   EQU   @05                                                      00422000
GPR06F   EQU   @06                                                      00423000
GPR06P   EQU   @06                                                      00424000
GPR07F   EQU   @07                                                      00425000
GPR07P   EQU   @07                                                      00426000
GPR08F   EQU   @08                                                      00427000
GPR08P   EQU   @08                                                      00428000
GPR09F   EQU   @09                                                      00429000
GPR09P   EQU   @09                                                      00430000
GPR10F   EQU   @10                                                      00431000
GPR10P   EQU   @10                                                      00432000
GPR11F   EQU   @11                                                      00433000
GPR11P   EQU   @11                                                      00434000
GPR12F   EQU   @12                                                      00435000
GPR12P   EQU   @12                                                      00436000
GPR13F   EQU   @13                                                      00437000
GPR13P   EQU   @13                                                      00438000
GPR14F   EQU   @14                                                      00439000
GPR14P   EQU   @14                                                      00440000
GPR15F   EQU   @15                                                      00441000
PSA      EQU   0                                                        00442000
FLCRNPSW EQU   PSA                                                      00443000
FLCROPSW EQU   PSA+8                                                    00444000
FLCICCW2 EQU   PSA+16                                                   00445000
PSAEEPSW EQU   PSA+132                                                  00446000
PSAESPSW EQU   PSA+136                                                  00447000
FLCSVILC EQU   PSAESPSW+1                                               00448000
PSAEPPSW EQU   PSA+140                                                  00449000
FLCPIILC EQU   PSAEPPSW+1                                               00450000
FLCPICOD EQU   PSAEPPSW+2                                               00451000
PSAPICOD EQU   FLCPICOD+1                                               00452000
FLCTEA   EQU   PSAEPPSW+4                                               00453000
FLCPER   EQU   PSA+152                                                  00454000
FLCMCLA  EQU   PSA+168                                                  00455000
FLCIOEL  EQU   FLCMCLA+4                                                00456000
FLCIOA   EQU   FLCMCLA+16                                               00457000
FLCFSA   EQU   FLCMCLA+80                                               00458000
PSAAOLD  EQU   PSA+548                                                  00459000
PSASUPER EQU   PSA+552                                                  00460000
PSASUP1  EQU   PSASUPER                                                 00461000
PSASUP2  EQU   PSASUPER+1                                               00462000
PSASUP3  EQU   PSASUPER+2                                               00463000
PSASUP4  EQU   PSASUPER+3                                               00464000
PSACLHT  EQU   PSA+640                                                  00465000
PSALKSA  EQU   PSA+696                                                  00466000
PSAHLHI  EQU   PSA+760                                                  00467000
PSADSSFL EQU   PSA+836                                                  00468000
PSADSSF1 EQU   PSADSSFL                                                 00469000
PSADSSF3 EQU   PSADSSFL+2                                               00470000
PSADSSF4 EQU   PSADSSFL+3                                               00471000
PSARSVT  EQU   PSA+896                                                  00472000
ATCLCPTR EQU   1032                                                     00473000
IFGRPL   EQU   0                                                        00474000
RPLCOMN  EQU   IFGRPL                                                   00475000
RPLIDWD  EQU   RPLCOMN                                                  00476000
RPLLEN   EQU   RPLIDWD+3                                                00477000
RPLECB   EQU   RPLCOMN+8                                                00478000
RPLEXITP EQU   RPLECB                                                   00479000
RPLFDBWD EQU   RPLCOMN+12                                               00480000
RPLFDBK  EQU   RPLFDBWD+1                                               00481000
RPLRTNCD EQU   RPLFDBK                                                  00482000
RPLCNDCD EQU   RPLFDBK+1                                                00483000
RPLCMPON EQU   RPLCNDCD                                                 00484000
RPLFDB2  EQU   RPLCMPON                                                 00485000
RPLERRCD EQU   RPLCNDCD+1                                               00486000
RPLFDB3  EQU   RPLERRCD                                                 00487000
RPLKEYLE EQU   RPLCOMN+16                                               00488000
RPLAREA  EQU   RPLCOMN+32                                               00489000
RPLARG   EQU   RPLCOMN+36                                               00490000
RPLOPTCD EQU   RPLCOMN+40                                               00491000
RPLOPT1  EQU   RPLOPTCD                                                 00492000
RPLECBSW EQU   RPLOPT1                                                  00493000
RPLOPT2  EQU   RPLOPTCD+1                                               00494000
RPLADR   EQU   RPLOPT2                                                  00495000
RPLOPT3  EQU   RPLOPTCD+2                                               00496000
RPLOPT4  EQU   RPLOPTCD+3                                               00497000
RPLNXTRP EQU   RPLCOMN+44                                               00498000
RPLOPTC2 EQU   RPLCOMN+56                                               00499000
RPLOPT5  EQU   RPLOPTC2                                                 00500000
RPLWRTYP EQU   RPLOPT5                                                  00501000
RPLOPT6  EQU   RPLOPTC2+1                                               00502000
RPLUNTYP EQU   RPLOPT6                                                  00503000
RPLOPT7  EQU   RPLOPTC2+2                                               00504000
RPLCNOPT EQU   RPLOPT7                                                  00505000
RPLOPT8  EQU   RPLOPTC2+3                                               00506000
RPLRBAR  EQU   RPLCOMN+60                                               00507000
RPLAIXID EQU   RPLRBAR+2                                                00508000
RPLEXTDS EQU   RPLCOMN+68                                               00509000
RPLEXTD1 EQU   RPLEXTDS                                                 00510000
RPLVTEXT EQU   IFGRPL+76                                                00511000
RPLFDBK2 EQU   RPLVTEXT+12                                              00512000
RPLSSNSI EQU   RPLFDBK2                                                 00513000
RPLDSB   EQU   RPLSSNSI                                                 00514000
RPLDSB1  EQU   RPLDSB                                                   00515000
RPLSSEI  EQU   RPLDSB1                                                  00516000
RPLDSB2  EQU   RPLDSB+1                                                 00517000
RPLUSNSI EQU   RPLFDBK2+2                                               00518000
RPLOPTC3 EQU   RPLVTEXT+20                                              00519000
RPLOPT9  EQU   RPLOPTC3                                                 00520000
RPLOPT10 EQU   RPLOPTC3+1                                               00521000
RPLOPT11 EQU   RPLOPTC3+2                                               00522000
RPLOPT12 EQU   RPLOPTC3+3                                               00523000
RPLOSENS EQU   RPLVTEXT+24                                              00524000
RPLSSNSO EQU   RPLOSENS                                                 00525000
RPLSSEO  EQU   RPLSSNSO                                                 00526000
RPLOF16  EQU   0                                                        00527000
RPLRH3   EQU   RPLOF16                                                  00528000
RPLSRTYP EQU   RPLOF16+1                                                00529000
RPLSTYPE EQU   RPLSRTYP                                                 00530000
RPLRTYPE EQU   RPLSRTYP                                                 00531000
RPLCHN   EQU   RPLOF16+2                                                00532000
RPLVTFL1 EQU   RPLOF16+3                                                00533000
RPLVTFL2 EQU   RPLOF16+4                                                00534000
RPLPOSTV EQU   RPLVTFL2                                                 00535000
RPLRESP  EQU   RPLVTFL2                                                 00536000
RPLCNTRL EQU   RPLOF16+5                                                00537000
RPLCNTDF EQU   RPLCNTRL                                                 00538000
RPLCNTDC EQU   RPLCNTRL+1                                               00539000
RPLCNTSC EQU   RPLCNTRL+2                                               00540000
RPLOF60  EQU   0                                                        00541000
RPLOBSQ  EQU   RPLOF60+4                                                00542000
RPLIBSQ  EQU   RPLOF60+5                                                00543000
IFGACB   EQU   0                                                        00544000
ACBCOMN  EQU   IFGACB                                                   00545000
ACBLENG  EQU   ACBCOMN+2                                                00546000
ACBLENG2 EQU   ACBLENG                                                  00547000
ACBAMBL  EQU   ACBCOMN+4                                                00548000
ACBJWA   EQU   ACBAMBL                                                  00549000
ACBIBCT  EQU   ACBJWA                                                   00550000
ACBMACRF EQU   ACBCOMN+12                                               00551000
ACBMACR1 EQU   ACBMACRF                                                 00552000
ACBADR   EQU   ACBMACR1                                                 00553000
ACBCNV   EQU   ACBMACR1                                                 00554000
ACBMACR2 EQU   ACBMACRF+1                                               00555000
ACBBUFPL EQU   ACBCOMN+20                                               00556000
ACBMACR3 EQU   ACBBUFPL                                                 00557000
ACBRECFM EQU   ACBCOMN+24                                               00558000
ACBCCTYP EQU   ACBCOMN+25                                               00559000
ACBOPT   EQU   ACBCOMN+26                                               00560000
ACBDSORG EQU   ACBOPT                                                   00561000
ACBDSOR1 EQU   ACBDSORG                                                 00562000
ACBCROPS EQU   ACBDSOR1                                                 00563000
ACBDVIND EQU   ACBDSOR1                                                 00564000
ACBDSOR2 EQU   ACBDSORG+1                                               00565000
ACBEXLST EQU   ACBCOMN+36                                               00566000
ACBDDNM  EQU   ACBCOMN+40                                               00567000
ACBAMETH EQU   ACBDDNM+3                                                00568000
ACBOFLGS EQU   ACBCOMN+48                                               00569000
ACBEXFG  EQU   ACBOFLGS                                                 00570000
ACBIOSFG EQU   ACBOFLGS                                                 00571000
ACBINFLG EQU   ACBCOMN+50                                               00572000
ACBINFL1 EQU   ACBINFLG                                                 00573000
ACBVVIC  EQU   ACBINFL1                                                 00574000
ACBINFL2 EQU   ACBINFLG+1                                               00575000
ACBUJFCB EQU   ACBCOMN+52                                               00576000
ACBBLKSZ EQU   ACBCOMN+60                                               00577000
ACBAPID  EQU   ACBCOMN+72                                               00578000
ACBVTEXT EQU   IFGACB+76                                                00579000
IFGEXLST EQU   0                                                        00580000
EXLCOMN  EQU   IFGEXLST                                                 00581000
EXLLEN   EQU   EXLCOMN+2                                                00582000
EXLEODF  EQU   EXLCOMN+5                                                00583000
EXLSYNF  EQU   EXLCOMN+10                                               00584000
EXLLERF  EQU   EXLCOMN+15                                               00585000
EXLSCIPF EQU   EXLCOMN+20                                               00586000
EXLUPADF EQU   EXLSCIPF                                                 00587000
EXLSCIPS EQU   EXLUPADF                                                 00588000
EXLSCIPA EQU   EXLUPADF                                                 00589000
EXLSCIPK EQU   EXLUPADF                                                 00590000
EXLSCIPP EQU   EXLCOMN+21                                               00591000
EXLLGNF  EQU   EXLCOMN+25                                               00592000
EXLJRNF  EQU   EXLCOMN+30                                               00593000
EXLOPNF  EQU   EXLCOMN+35                                               00594000
EXLVTEXT EQU   IFGEXLST+40                                              00595000
EXLNLGNF EQU   EXLVTEXT                                                 00596000
EXLRLRQF EQU   EXLVTEXT+5                                               00597000
EXLATTNF EQU   EXLVTEXT+15                                              00598000
EXLTPNDF EQU   EXLVTEXT+20                                              00599000
EXLTNSEF EQU   EXLVTEXT+25                                              00600000
EXLDFAS  EQU   0                                                        00601000
EXLDFASF EQU   EXLDFAS                                                  00602000
EXLRESP  EQU   0                                                        00603000
EXLRESPF EQU   EXLRESP                                                  00604000
IFGEXLEF EQU   0                                                        00605000
EXLENTRY EQU   IFGEXLEF                                                 00606000
EXLFLAG  EQU   EXLENTRY                                                 00607000
EXLENFL  EQU   EXLFLAG                                                  00608000
EXLEXITP EQU   EXLENTRY+1                                               00609000
ASCB     EQU   0                                                        00610000
ASCBSUPC EQU   ASCB+16                                                  00611000
ASCBFW1  EQU   ASCB+100                                                 00612000
ASCBRCTF EQU   ASCBFW1+2                                                00613000
ASCBFLG1 EQU   ASCBFW1+3                                                00614000
ASCBASXB EQU   ASCB+108                                                 00615000
ASCBDSP1 EQU   ASCB+114                                                 00616000
ASCBFLG2 EQU   ASCB+115                                                 00617000
ASCBLKGP EQU   ASCB+128                                                 00618000
ASCBSRQ  EQU   ASCB+180                                                 00619000
ASCBSRQ1 EQU   ASCBSRQ                                                  00620000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00621000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00622000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00623000
ASXB     EQU   0                                                        00624000
ASXBMPST EQU   ASXB+16                                                  00625000
ASXBAEQ  EQU   ASXB+168                                                 00626000
ASXBCASW EQU   ASXB+216                                                 00627000
ASXBCRB1 EQU   ASXBCASW                                                 00628000
SRBSECT  EQU   0                                                        00629000
SRBFLC   EQU   SRBSECT+12                                               00630000
ISTLOK   EQU   0                                                        00631000
LOKCHN   EQU   ISTLOK+1                                                 00632000
LOKCHNG  EQU   LOKCHN                                                   00633000
@NM00083 EQU   LOKCHNG+2                                                00634000
ISTPAB   EQU   0                                                        00635000
PABWQCHN EQU   ISTPAB                                                   00636000
PABWEQA  EQU   PABWQCHN                                                 00637000
PABCHAIN EQU   PABWQCHN+4                                               00638000
PABRUNNG EQU   PABCHAIN                                                 00639000
PABOFFST EQU   ISTPAB+8                                                 00640000
PABDVTA  EQU   ISTPAB+9                                                 00641000
PABRPHFG EQU   ISTPAB+12                                                00642000
PABFLAGS EQU   PABRPHFG                                                 00643000
PABAPYP  EQU   PABFLAGS                                                 00644000
PABERLCK EQU   PABFLAGS                                                 00645000
PABERRLK EQU   PABERLCK                                                 00646000
PABEND   EQU   ISTPAB+16                                                00647000
ISTACDEB EQU   0                                                        00648000
ACDTSKID EQU   ISTACDEB+8                                               00649000
ACDANYQ  EQU   ISTACDEB+48                                              00650000
ACDACB   EQU   ISTACDEB+64                                              00651000
ACDLUFLG EQU   ISTACDEB+102                                             00652000
ISTDYPAB EQU   0                                                        00653000
DYPCHAIN EQU   ISTDYPAB+4                                               00654000
DYPPACMD EQU   ISTDYPAB+12                                              00655000
ISTRPH   EQU   0                                                        00656000
RPHCNTL  EQU   ISTRPH                                                   00657000
RPHFLAGS EQU   RPHCNTL+2                                                00658000
RPHFSTLC EQU   RPHFLAGS                                                 00659000
RPHFLGB  EQU   RPHCNTL+3                                                00660000
RPHRPHA  EQU   ISTRPH+4                                                 00661000
RPHTSKID EQU   ISTRPH+8                                                 00662000
RPHRESMA EQU   ISTRPH+16                                                00663000
RPHWPFLG EQU   RPHRESMA                                                 00664000
RPHWEA   EQU   ISTRPH+24                                                00665000
RPHCSPA  EQU   RPHWEA                                                   00666000
RPHSRPRM EQU   ISTRPH+28                                                00667000
RPHPABQA EQU   ISTRPH+36                                                00668000
RPHWORK  EQU   ISTRPH+40                                                00669000
RPHSAVE1 EQU   RPHWORK                                                  00670000
RPHSBITS EQU   RPHSAVE1+1                                               00671000
ISTATCVT EQU   0                                                        00672000
ATCRPTCH EQU   ISTATCVT                                                 00673000
ATCITFLD EQU   ISTATCVT+8                                               00674000
ATCITCDS EQU   ATCITFLD+8                                               00675000
ATCITFLG EQU   ATCITCDS+4                                               00676000
ATCITRA1 EQU   ATCITFLG+2                                               00677000
ATCSMPAB EQU   ISTATCVT+88                                              00678000
ATCVDPAB EQU   ISTATCVT+152                                             00679000
ATCLDTIL EQU   ISTATCVT+408                                             00680000
ATCGTSTR EQU   ISTATCVT+608                                             00681000
ATCSMRQ  EQU   ISTATCVT+620                                             00682000
ATCSMRS  EQU   ISTATCVT+624                                             00683000
ATCLUDVT EQU   ISTATCVT+768                                             00684000
ATCANYDT EQU   ISTATCVT+776                                             00685000
@NM00095 EQU   ISTATCVT+780                                             00686000
ATCPODVT EQU   ISTATCVT+804                                             00687000
ATCUEP   EQU   ISTATCVT+844                                             00688000
ATCBPDA  EQU   ISTATCVT+856                                             00689000
ATCSTAT  EQU   ISTATCVT+936                                             00690000
ATCSTAT1 EQU   ATCSTAT                                                  00691000
ATCPOFLG EQU   ATCSTAT+2                                                00692000
ATCSTAT4 EQU   ATCSTAT+3                                                00693000
ATCBITAN EQU   ISTATCVT+940                                             00694000
ATCFLAG2 EQU   ATCBITAN+1                                               00695000
ATCONID  EQU   ISTATCVT+944                                             00696000
ATCSSCPA EQU   ISTATCVT+948                                             00697000
ATCHPGM  EQU   ISTATCVT+1012                                            00698000
ATCVLCNT EQU   ISTATCVT+1016                                            00699000
ATCRNO   EQU   ISTATCVT+1020                                            00700000
@NM00118 EQU   ISTATCVT+1028                                            00701000
ATCSHRFG EQU   @NM00118+8                                               00702000
ATCCPDVT EQU   ISTATCVT+1096                                            00703000
ATCSMSDQ EQU   ISTATCVT+1140                                            00704000
ATCRID   EQU   ISTATCVT+1152                                            00705000
ATCLDAPP EQU   ISTATCVT+1288                                            00706000
ATCSQAFR EQU   ISTATCVT+1312                                            00707000
ATCORTCB EQU   ATCSQAFR+4                                               00708000
ATCORSRB EQU   ATCORTCB                                                 00709000
ATCICAPP EQU   ISTATCVT+1320                                            00710000
ATCDAPVT EQU   ISTATCVT+1340                                            00711000
ATCAP34  EQU   ISTATCVT+1380                                            00712000
ATCAP37  EQU   ISTATCVT+1384                                            00713000
ATCGSRBQ EQU   ISTATCVT+1472                                            00714000
ATCGSRBG EQU   ATCGSRBQ                                                 00715000
ATCENFLG EQU   ISTATCVT+1512                                            00716000
@NM00133 EQU   ISTATCVT+1575                                            00717000
ATCVTFLG EQU   ISTATCVT+1576                                            00718000
ATCZFLAG EQU   ISTATCVT+1696                                            00719000
ATCCRA   EQU   ISTATCVT+1720                                            00720000
ATCCRACN EQU   ATCCRA+4                                                 00721000
ATCSRB   EQU   ISTATCVT+1728                                            00722000
ATCSRBCN EQU   ATCSRB+4                                                 00723000
ATCCRPL  EQU   ISTATCVT+1736                                            00724000
ATCRPLCN EQU   ATCCRPL+4                                                00725000
ISTUECB  EQU   0                                                        00726000
UECID    EQU   ISTUECB                                                  00727000
UECLEN   EQU   ISTUECB+1                                                00728000
UECTYPE  EQU   ISTUECB+3                                                00729000
UECTSKID EQU   ISTUECB+8                                                00730000
UECEXLST EQU   ISTUECB+12                                               00731000
UECPAB   EQU   ISTUECB+16                                               00732000
UECPLIST EQU   ISTUECB+32                                               00733000
UECACB   EQU   UECPLIST                                                 00734000
UECNDID  EQU   UECPLIST+4                                               00735000
UECTPNCD EQU   UECNDID                                                  00736000
UECREQTR EQU   UECPLIST+8                                               00737000
UECUSFLD EQU   UECREQTR                                                 00738000
UECCPBND EQU   UECPLIST+12                                              00739000
UECDLEN  EQU   UECCPBND                                                 00740000
UECRSNCD EQU   UECDLEN                                                  00741000
UECRSNBT EQU   UECRSNCD+3                                               00742000
UECVRPL  EQU   UECPLIST+16                                              00743000
UECDVTPT EQU   ISTUECB+68                                               00744000
ISTMPST  EQU   0                                                        00745000
MPSRSV07 EQU   ISTMPST+4                                                00746000
MPSRQFGA EQU   ISTMPST+8                                                00747000
MPSRQUE  EQU   MPSRQFGA                                                 00748000
MPSFLGA  EQU   MPSRQFGA+4                                               00749000
MPSFLGAA EQU   MPSFLGA                                                  00750000
MPSFLGAB EQU   MPSFLGA+1                                                00751000
MPSCRA   EQU   ISTMPST+24                                               00752000
MPSCRACT EQU   MPSCRA+4                                                 00753000
MPSSRB   EQU   ISTMPST+32                                               00754000
MPSSRBCT EQU   MPSSRB+4                                                 00755000
MPSCRPL  EQU   ISTMPST+40                                               00756000
MPSRPLCT EQU   MPSCRPL+4                                                00757000
MPSDBTBL EQU   ISTMPST+124                                              00758000
ISTDCE   EQU   0                                                        00759000
DCEDBPTR EQU   ISTDCE                                                   00760000
FMZL0002 EQU   0                                                        00761000
FMZL0023 EQU   0                                                        00762000
ISTAPC37 EQU   0                                                        00763000
FMZL0055 EQU   0                                                        00764000
ISTACB   EQU   0                                                        00765000
ISTAPC34 EQU   0                                                        00766000
ISTRPL   EQU   0                                                        00767000
ISTXDYP  EQU   0                                                        00768000
ISTXPAB  EQU   0                                                        00769000
PSARSVTE EQU   PSARSVT                                                  00770000
PABXTNSN EQU   PABEND                                                   00771000
FLC      EQU   PSA                                                      00772000
SRB      EQU   SRBSECT                                                  00773000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00774000
@NM00085 EQU   PABXTNSN+12                                              00775000
PABNPSSQ EQU   PABXTNSN+8                                               00776000
PABLOCK  EQU   PABXTNSN+4                                               00777000
PABLAST  EQU   PABXTNSN                                                 00778000
PSARSAV  EQU   PSARSVTE+60                                              00779000
PSARSTK  EQU   PSARSVTE+56                                              00780000
PSAESAV3 EQU   PSARSVTE+52                                              00781000
PSAESTK3 EQU   PSARSVTE+48                                              00782000
PSAESAV2 EQU   PSARSVTE+44                                              00783000
PSAESTK2 EQU   PSARSVTE+40                                              00784000
PSAESAV1 EQU   PSARSVTE+36                                              00785000
PSAESTK1 EQU   PSARSVTE+32                                              00786000
PSAPSAV  EQU   PSARSVTE+28                                              00787000
PSAPSTK  EQU   PSARSVTE+24                                              00788000
PSAMSAV  EQU   PSARSVTE+20                                              00789000
PSAMSTK  EQU   PSARSVTE+16                                              00790000
PSASSAV  EQU   PSARSVTE+12                                              00791000
PSASSTK  EQU   PSARSVTE+8                                               00792000
PSANSTK  EQU   PSARSVTE+4                                               00793000
PSACSTK  EQU   PSARSVTE                                                 00794000
DCERSV01 EQU   ISTDCE+12                                                00795000
DCETERM  EQU   ISTDCE+8                                                 00796000
DCECHN   EQU   ISTDCE+4                                                 00797000
MPSSRB1  EQU   ISTMPST+172                                              00798000
MPSSAVE  EQU   ISTMPST+140                                              00799000
MPSMQLBP EQU   ISTMPST+136                                              00800000
MPSSYSRT EQU   ISTMPST+132                                              00801000
MPSQEL   EQU   ISTMPST+128                                              00802000
MPSASCB  EQU   ISTMPST+120                                              00803000
MPSTPPAB EQU   ISTMPST+88                                               00804000
MPSSMPAB EQU   ISTMPST+56                                               00805000
MPSSMRPH EQU   ISTMPST+52                                               00806000
MPSSRB55 EQU   ISTMPST+48                                               00807000
MPSRPLAC EQU   MPSRPLCT+2                                               00808000
MPSRPLRC EQU   MPSRPLCT                                                 00809000
MPSCRPLQ EQU   MPSCRPL                                                  00810000
MPSSRBAC EQU   MPSSRBCT+2                                               00811000
MPSSRBRC EQU   MPSSRBCT                                                 00812000
MPSSRBQ  EQU   MPSSRB                                                   00813000
MPSCRAAC EQU   MPSCRACT+2                                               00814000
MPSCRARC EQU   MPSCRACT                                                 00815000
MPSCRAQ  EQU   MPSCRA                                                   00816000
MPSMPSTP EQU   ISTMPST+20                                               00817000
MPSPSTCT EQU   ISTMPST+16                                               00818000
MPSASID  EQU   MPSFLGA+2                                                00819000
MPSRMGOC EQU   MPSFLGAB                                                 00820000
MPSPSTAB EQU   MPSFLGAA                                                 00821000
MPSRSV01 EQU   MPSFLGAA                                                 00822000
MPSTPBU  EQU   MPSFLGAA                                                 00823000
MPMEMTRM EQU   MPSFLGAA                                                 00824000
MPSAUTH  EQU   MPSFLGAA                                                 00825000
MPSCRAO  EQU   MPSFLGAA                                                 00826000
MPSSRBO  EQU   MPSFLGAA                                                 00827000
MPSRQUEG EQU   MPSRQUE                                                  00828000
MPSTSOIR EQU   MPSRSV07                                                 00829000
MPSTSOIW EQU   MPSRSV07                                                 00830000
MPSID    EQU   ISTMPST                                                  00831000
UECSYMNM EQU   ISTUECB+76                                               00832000
UECLGDTA EQU   ISTUECB+72                                               00833000
UECREQNM EQU   ISTUECB+60                                               00834000
UECRVPT4 EQU   ISTUECB+56                                               00835000
UECLCID  EQU   UECPLIST+20                                              00836000
@NM00144 EQU   UECRSNCD                                                 00837000
UECDAF   EQU   UECTPNCD+2                                               00838000
UECSAF   EQU   UECTPNCD                                                 00839000
UECRPLAD EQU   UECACB                                                   00840000
UECFORW  EQU   ISTUECB+4                                                00841000
UECRSV01 EQU   ISTUECB+2                                                00842000
ATCAOS   EQU   ISTATCVT+1868                                            00843000
@NM00143 EQU   ISTATCVT+1860                                            00844000
@NM00142 EQU   ISTATCVT+1852                                            00845000
@NM00141 EQU   ISTATCVT+1844                                            00846000
@NM00140 EQU   ISTATCVT+1836                                            00847000
@NM00139 EQU   ISTATCVT+1828                                            00848000
@NM00138 EQU   ISTATCVT+1820                                            00849000
@NM00137 EQU   ISTATCVT+1816                                            00850000
ATCCACSA EQU   ISTATCVT+1812                                            00851000
ATCMXCSA EQU   ISTATCVT+1808                                            00852000
ATCTPMPB EQU   ISTATCVT+1776                                            00853000
ATCTRMPB EQU   ISTATCVT+1744                                            00854000
ATCRPLAC EQU   ATCRPLCN+2                                               00855000
ATCRPLRC EQU   ATCRPLCN                                                 00856000
ATCCRPLQ EQU   ATCCRPL                                                  00857000
ATCSRBAC EQU   ATCSRBCN+2                                               00858000
ATCSRBRC EQU   ATCSRBCN                                                 00859000
ATCSRBQ  EQU   ATCSRB                                                   00860000
ATCCRAAC EQU   ATCCRACN+2                                               00861000
ATCCRARC EQU   ATCCRACN                                                 00862000
ATCCRAQ  EQU   ATCCRA                                                   00863000
ATCLUFFD EQU   ISTATCVT+1716                                            00864000
ATCVIOPM EQU   ISTATCVT+1712                                            00865000
ATCTPMMI EQU   ISTATCVT+1708                                            00866000
ATCPXSRB EQU   ISTATCVT+1704                                            00867000
ATCRPLCT EQU   ISTATCVT+1702                                            00868000
ATCCRACT EQU   ISTATCVT+1700                                            00869000
ATCSRBCT EQU   ISTATCVT+1698                                            00870000
ATCSTNSM EQU   ISTATCVT+1697                                            00871000
@NM00136 EQU   ATCZFLAG                                                 00872000
ATCZF001 EQU   ATCZFLAG                                                 00873000
ATCTPCP1 EQU   ISTATCVT+1692                                            00874000
ATCTPCP0 EQU   ISTATCVT+1688                                            00875000
ATCZR01  EQU   ISTATCVT+1684                                            00876000
ATCMPLTA EQU   ISTATCVT+1680                                            00877000
ATCASCB  EQU   ISTATCVT+1676                                            00878000
ATCAP86  EQU   ISTATCVT+1672                                            00879000
ATCAP85  EQU   ISTATCVT+1668                                            00880000
ATCAP84  EQU   ISTATCVT+1664                                            00881000
ATCAP83  EQU   ISTATCVT+1660                                            00882000
ATCAP82  EQU   ISTATCVT+1656                                            00883000
ATCAP69  EQU   ISTATCVT+1652                                            00884000
ATCAP66  EQU   ISTATCVT+1648                                            00885000
ATCAP62  EQU   ISTATCVT+1644                                            00886000
ATCAPC59 EQU   ISTATCVT+1640                                            00887000
ATCAP56  EQU   ISTATCVT+1636                                            00888000
ATCAP55  EQU   ISTATCVT+1632                                            00889000
ATCAP41  EQU   ISTATCVT+1628                                            00890000
ATCAPC25 EQU   ISTATCVT+1624                                            00891000
ATCAP23  EQU   ISTATCVT+1620                                            00892000
ATCAPBE  EQU   ISTATCVT+1616                                            00893000
ATCPSTA  EQU   ISTATCVT+1612                                            00894000
ATCSMABF EQU   ISTATCVT+1608                                            00895000
ATCSMAPR EQU   ISTATCVT+1604                                            00896000
ATCTPWQA EQU   ISTATCVT+1600                                            00897000
ATCSMAID EQU   ISTATCVT+1596                                            00898000
ATCSMARA EQU   ISTATCVT+1592                                            00899000
ATCCACXA EQU   ISTATCVT+1588                                            00900000
ATCATA10 EQU   ISTATCVT+1584                                            00901000
ATCHLTCB EQU   ISTATCVT+1580                                            00902000
@NM00135 EQU   ATCVTFLG                                                 00903000
ATCVTACT EQU   ATCVTFLG                                                 00904000
@NM00134 EQU   @NM00133                                                 00905000
ATCVTMAB EQU   @NM00133                                                 00906000
ATCVTBAM EQU   ISTATCVT+1572                                            00907000
@NM00132 EQU   ISTATCVT+1568                                            00908000
@NM00131 EQU   ISTATCVT+1520                                            00909000
ATCCCOOC EQU   ISTATCVT+1516                                            00910000
@NM00130 EQU   ISTATCVT+1513                                            00911000
ATCSNUF  EQU   ATCENFLG                                                 00912000
ATCOPKL  EQU   ATCENFLG                                                 00913000
ATCABEN  EQU   ATCENFLG                                                 00914000
ATCSRDN  EQU   ATCENFLG                                                 00915000
ATCDLDN  EQU   ATCENFLG                                                 00916000
ATCTIMER EQU   ISTATCVT+1508                                            00917000
ATCAIWT  EQU   ISTATCVT+1504                                            00918000
ATCOROBT EQU   ISTATCVT+1500                                            00919000
ATCDMAPP EQU   ISTATCVT+1496                                            00920000
ATCZDVTX EQU   ISTATCVT+1492                                            00921000
ATCPXCRA EQU   ISTATCVT+1488                                            00922000
ATCICNCB EQU   ISTATCVT+1484                                            00923000
ATCCMTCB EQU   ISTATCVT+1480                                            00924000
ATCPRPH  EQU   ISTATCVT+1476                                            00925000
ATCGSRBF EQU   ATCGSRBG                                                 00926000
ATCSRBRT EQU   ISTATCVT+1468                                            00927000
ATCTSCPC EQU   ISTATCVT+1464                                            00928000
@NM00129 EQU   ISTATCVT+1460                                            00929000
ATCCDTCB EQU   ISTATCVT+1456                                            00930000
ATCORFRL EQU   ISTATCVT+1452                                            00931000
ATCORFPX EQU   ISTATCVT+1448                                            00932000
ATCORFMG EQU   ISTATCVT+1444                                            00933000
ATCSMBQ  EQU   ISTATCVT+1440                                            00934000
ATCINFDD EQU   ISTATCVT+1436                                            00935000
ATCAP67  EQU   ISTATCVT+1432                                            00936000
ATCAP65  EQU   ISTATCVT+1428                                            00937000
ATCAP64  EQU   ISTATCVT+1424                                            00938000
ATCAP63  EQU   ISTATCVT+1420                                            00939000
ATCAP61  EQU   ISTATCVT+1416                                            00940000
ATCAP58  EQU   ISTATCVT+1412                                            00941000
ATCAP57  EQU   ISTATCVT+1408                                            00942000
ATCAP54  EQU   ISTATCVT+1404                                            00943000
ATCAP53  EQU   ISTATCVT+1400                                            00944000
ATCAP52  EQU   ISTATCVT+1396                                            00945000
ATCAP51  EQU   ISTATCVT+1392                                            00946000
ATCAP38  EQU   ISTATCVT+1388                                            00947000
ATCAP32  EQU   ISTATCVT+1376                                            00948000
ATCAP31  EQU   ISTATCVT+1372                                            00949000
ATCAP12  EQU   ISTATCVT+1368                                            00950000
ATCAP11  EQU   ISTATCVT+1364                                            00951000
ATCDAPDG EQU   ATCDAPVT+20                                              00952000
ATCDXCEA EQU   ATCDAPVT+16                                              00953000
ATCDCEA  EQU   ATCDAPVT+12                                              00954000
ATCDPCIA EQU   ATCDAPVT+8                                               00955000
ATCDSIOA EQU   ATCDAPVT+4                                               00956000
ATCDEOEA EQU   ATCDAPVT                                                 00957000
ATCZAEA  EQU   ATCICAPP+16                                              00958000
ATCZCEA  EQU   ATCICAPP+12                                              00959000
ATCZCPCI EQU   ATCICAPP+8                                               00960000
ATCZSIOA EQU   ATCICAPP+4                                               00961000
ATCCDRPH EQU   ATCICAPP                                                 00962000
ATCORQG  EQU   ATCORSRB                                                 00963000
ATCORTBF EQU   ATCSQAFR                                                 00964000
@NM00128 EQU   ISTATCVT+1308                                            00965000
ATCZLAEA EQU   ATCLDAPP+16                                              00966000
ATCZLCEA EQU   ATCLDAPP+12                                              00967000
ATCZLPCI EQU   ATCLDAPP+8                                               00968000
ATCSMFRR EQU   ATCLDAPP+4                                               00969000
ATCCDTID EQU   ATCLDAPP                                                 00970000
@NM00127 EQU   ISTATCVT+1256                                            00971000
ATCZPAB2 EQU   ISTATCVT+1224                                            00972000
@NM00126 EQU   ISTATCVT+1224                                            00973000
@NM00125 EQU   ISTATCVT+1164                                            00974000
ATCCPCFE EQU   ISTATCVT+1160                                            00975000
@NM00124 EQU   ATCRID+2                                                 00976000
ATCCDRMA EQU   ATCRID                                                   00977000
@NM00123 EQU   ATCSMSDQ+8                                               00978000
@NM00122 EQU   ATCSMSDQ+4                                               00979000
@NM00121 EQU   ATCSMSDQ                                                 00980000
ATCSEQNO EQU   ISTATCVT+1136                                            00981000
ATCSMPMD EQU   ISTATCVT+1132                                            00982000
ATCPAREA EQU   ISTATCVT+1128                                            00983000
ATCCPCSM EQU   ISTATCVT+1124                                            00984000
ATCQLOCK EQU   ISTATCVT+1120                                            00985000
ATCITQLE EQU   ISTATCVT+1116                                            00986000
ATCSQCDS EQU   ISTATCVT+1112                                            00987000
ATCUSSVT EQU   ISTATCVT+1108                                            00988000
ATCNOSQ  EQU   ISTATCVT+1104                                            00989000
ATCINCIP EQU   ATCCPDVT+4                                               00990000
ATCTSCNI EQU   ATCCPDVT                                                 00991000
ATCMGCRT EQU   ISTATCVT+1092                                            00992000
ATCMACRT EQU   ISTATCVT+1088                                            00993000
ATCCSMT  EQU   ISTATCVT+1084                                            00994000
ATCDRUSL EQU   ISTATCVT+1080                                            00995000
ATCDRULL EQU   ISTATCVT+1076                                            00996000
ATCCFCDR EQU   ISTATCVT+1072                                            00997000
@NM00120 EQU   ISTATCVT+1069                                            00998000
ATCMROUT EQU   ISTATCVT+1060                                            00999000
ATCONFIG EQU   ISTATCVT+1052                                            01000000
ATCNODEL EQU   ISTATCVT+1044                                            01001000
@NM00119 EQU   @NM00118+9                                               01002000
ATCLAST  EQU   ATCSHRFG                                                 01003000
ATCSHRTN EQU   @NM00118                                                 01004000
@NM00117 EQU   ISTATCVT+1026                                            01005000
ATCNMCTR EQU   ISTATCVT+1024                                            01006000
ATCPOIA  EQU   ATCRNO+1                                                 01007000
@NM00116 EQU   ATCRNO                                                   01008000
ATCLCLCT EQU   ATCVLCNT+2                                               01009000
ATCRNCNT EQU   ATCVLCNT                                                 01010000
ATCHBSIZ EQU   ATCHPGM+2                                                01011000
ATCHBFNO EQU   ATCHPGM                                                  01012000
@NM00115 EQU   ISTATCVT+1011                                            01013000
ATCXRANG EQU   ISTATCVT+1010                                            01014000
ATCMAXID EQU   ISTATCVT+1009                                            01015000
ATCMSGSP EQU   ISTATCVT+1008                                            01016000
ATCCIDM  EQU   ISTATCVT+1006                                            01017000
ATCACTRM EQU   ISTATCVT+1004                                            01018000
ATCECTLP EQU   ISTATCVT+1000                                            01019000
ATCECNET EQU   ISTATCVT+996                                             01020000
ATCECOPC EQU   ISTATCVT+992                                             01021000
ATCECSES EQU   ISTATCVT+988                                             01022000
ATCECDSP EQU   ISTATCVT+984                                             01023000
ATCECVRY EQU   ISTATCVT+980                                             01024000
ATCECHLT EQU   ISTATCVT+976                                             01025000
ATCECMOD EQU   ISTATCVT+972                                             01026000
ATCVDLOK EQU   ISTATCVT+968                                             01027000
ATCRDTLK EQU   ISTATCVT+964                                             01028000
ATCVOCLK EQU   ISTATCVT+960                                             01029000
ATCITLIM EQU   ISTATCVT+958                                             01030000
ATCTMINV EQU   ISTATCVT+956                                             01031000
ATCHOSTA EQU   ISTATCVT+954                                             01032000
ATCPUNSA EQU   ISTATCVT+952                                             01033000
ATCSAF   EQU   ISTATCVT+950                                             01034000
ATCVTMID EQU   ATCSSCPA                                                 01035000
ATCHCNID EQU   ATCONID+2                                                01036000
ATCSCNID EQU   ATCONID                                                  01037000
@NM00114 EQU   ATCBITAN+3                                               01038000
@NM00113 EQU   ATCBITAN+2                                               01039000
@NM00112 EQU   ATCFLAG2                                                 01040000
@NM00111 EQU   ATCFLAG2                                                 01041000
@NM00110 EQU   ATCFLAG2                                                 01042000
ATCCRYPF EQU   ATCFLAG2                                                 01043000
ATCTUNCL EQU   ATCFLAG2                                                 01044000
ATCTUNRQ EQU   ATCFLAG2                                                 01045000
ATCTUNAC EQU   ATCFLAG2                                                 01046000
ATCCDLRA EQU   ATCFLAG2                                                 01047000
@NM00109 EQU   ATCBITAN                                                 01048000
@NM00108 EQU   ATCSTAT4                                                 01049000
@NM00107 EQU   ATCSTAT4                                                 01050000
@NM00106 EQU   ATCSTAT4                                                 01051000
@NM00105 EQU   ATCSTAT4                                                 01052000
@NM00104 EQU   ATCSTAT4                                                 01053000
ATCPRTAT EQU   ATCSTAT4                                                 01054000
ATCNCSD  EQU   ATCSTAT4                                                 01055000
ATCMTST  EQU   ATCSTAT4                                                 01056000
@NM00103 EQU   ATCPOFLG                                                 01057000
@NM00102 EQU   ATCPOFLG                                                 01058000
@NM00101 EQU   ATCPOFLG                                                 01059000
@NM00100 EQU   ATCPOFLG                                                 01060000
@NM00099 EQU   ATCPOFLG                                                 01061000
@NM00098 EQU   ATCPOFLG                                                 01062000
@NM00097 EQU   ATCPOFLG                                                 01063000
ATCPOUNS EQU   ATCPOFLG                                                 01064000
@NM00096 EQU   ATCSTAT+1                                                01065000
ATCHIP   EQU   ATCSTAT1                                                 01066000
ATCMDHLT EQU   ATCSTAT1                                                 01067000
ATCINHLT EQU   ATCSTAT1                                                 01068000
ATCNETSL EQU   ATCSTAT1                                                 01069000
ATCQKHLT EQU   ATCSTAT1                                                 01070000
ATCSNHLT EQU   ATCSTAT1                                                 01071000
ATCACTIV EQU   ATCSTAT1                                                 01072000
ATCSTART EQU   ATCSTAT1                                                 01073000
ATCNOP00 EQU   ISTATCVT+932                                             01074000
ATCTSBUF EQU   ISTATCVT+928                                             01075000
ATCFEPT  EQU   ISTATCVT+924                                             01076000
ATCFDVT  EQU   ISTATCVT+920                                             01077000
ATCCONFT EQU   ISTATCVT+916                                             01078000
ATCRDTH  EQU   ISTATCVT+912                                             01079000
ATCSIBQ  EQU   ISTATCVT+908                                             01080000
ATCHLTMS EQU   ISTATCVT+904                                             01081000
ATCECPRM EQU   ISTATCVT+900                                             01082000
ATCVPARM EQU   ISTATCVT+896                                             01083000
ATCOCHA  EQU   ISTATCVT+892                                             01084000
ATCDSPLQ EQU   ISTATCVT+888                                             01085000
ATCVARYQ EQU   ISTATCVT+884                                             01086000
ATCHALTQ EQU   ISTATCVT+880                                             01087000
ATCMODQ  EQU   ISTATCVT+876                                             01088000
ATCSRT   EQU   ISTATCVT+872                                             01089000
ATCRDT   EQU   ISTATCVT+868                                             01090000
ATCSDVT  EQU   ISTATCVT+864                                             01091000
ATCDLRPT EQU   ISTATCVT+860                                             01092000
ATCACDA  EQU   ISTATCVT+852                                             01093000
ATCMNT   EQU   ISTATCVT+848                                             01094000
ATCNODDS EQU   ISTATCVT+840                                             01095000
ATCITRT  EQU   ISTATCVT+836                                             01096000
ATCTODVT EQU   ISTATCVT+832                                             01097000
ATCTRCPT EQU   ISTATCVT+828                                             01098000
ATCMODTB EQU   ISTATCVT+824                                             01099000
ATCUSSPT EQU   ISTATCVT+820                                             01100000
ATCTUBUF EQU   ISTATCVT+816                                             01101000
ATCTACB  EQU   ISTATCVT+812                                             01102000
ATCDWA   EQU   ISTATCVT+808                                             01103000
ATCCFCR2 EQU   ATCPODVT                                                 01104000
ATCEPA   EQU   ISTATCVT+800                                             01105000
ATCPULQB EQU   @NM00095+16                                              01106000
ATCMCQAB EQU   @NM00095+12                                              01107000
ATCLUSMQ EQU   @NM00095+8                                               01108000
ATCLUIOQ EQU   @NM00095+4                                               01109000
ATCIOLQB EQU   @NM00095                                                 01110000
ATCTSCAP EQU   ATCANYDT                                                 01111000
ATCTSCCO EQU   ATCLUDVT+4                                               01112000
ATCTSCSR EQU   ATCLUDVT                                                 01113000
ATCVTLOD EQU   ISTATCVT+764                                             01114000
ATCTSCLF EQU   ISTATCVT+760                                             01115000
ATCTSCLE EQU   ISTATCVT+756                                             01116000
ATCTSCLB EQU   ISTATCVT+752                                             01117000
ATCTSCLS EQU   ISTATCVT+748                                             01118000
ATCTSCCF EQU   ISTATCVT+744                                             01119000
ATCTSCFV EQU   ISTATCVT+740                                             01120000
ATCTSCCE EQU   ISTATCVT+736                                             01121000
ATCTSCCB EQU   ISTATCVT+732                                             01122000
ATCTSCWS EQU   ISTATCVT+728                                             01123000
ATCTSCEM EQU   ISTATCVT+724                                             01124000
ATCTSCNS EQU   ISTATCVT+720                                             01125000
ATCTSCER EQU   ISTATCVT+716                                             01126000
ATCTSCPR EQU   ISTATCVT+712                                             01127000
ATCTSCGR EQU   ISTATCVT+708                                             01128000
ATCTSCCI EQU   ISTATCVT+704                                             01129000
ATCTSVT  EQU   ISTATCVT+700                                             01130000
ATCDVLOD EQU   ISTATCVT+696                                             01131000
ATCCDCNR EQU   ISTATCVT+692                                             01132000
ATCCDCNF EQU   ISTATCVT+688                                             01133000
ATCCDCND EQU   ISTATCVT+684                                             01134000
ATCCDCNA EQU   ISTATCVT+680                                             01135000
ATCCDCCP EQU   ISTATCVT+676                                             01136000
ATCCDFDN EQU   ISTATCVT+672                                             01137000
ATCCDFIN EQU   ISTATCVT+668                                             01138000
ATCCDFND EQU   ISTATCVT+664                                             01139000
ATCCDDEL EQU   ISTATCVT+660                                             01140000
ATCCDADD EQU   ISTATCVT+656                                             01141000
ATCTCLIM EQU   ISTATCVT+652                                             01142000
ATCRACTR EQU   ISTATCVT+648                                             01143000
ATCRACTI EQU   ISTATCVT+644                                             01144000
ATCREMOV EQU   ISTATCVT+640                                             01145000
ATCRACIO EQU   ISTATCVT+636                                             01146000
ATCADD   EQU   ISTATCVT+632                                             01147000
ATCPUCRT EQU   ISTATCVT+628                                             01148000
ATCORCPX EQU   ISTATCVT+616                                             01149000
ATCORCAF EQU   ISTATCVT+612                                             01150000
ATCFRSTR EQU   ATCGTSTR                                                 01151000
ATCSTMA  EQU   ISTATCVT+604                                             01152000
ATCSRTAD EQU   ISTATCVT+600                                             01153000
ATCOCRT  EQU   ISTATCVT+596                                             01154000
ATCOCCFS EQU   ISTATCVT+592                                             01155000
ATCOCCFP EQU   ISTATCVT+588                                             01156000
ATCSRTDF EQU   ISTATCVT+584                                             01157000
ATCLUCRT EQU   ISTATCVT+580                                             01158000
ATCINCY5 EQU   ISTATCVT+576                                             01159000
ATCINCW3 EQU   ISTATCVT+572                                             01160000
ATCINCU6 EQU   ISTATCVT+568                                             01161000
ATCINCTQ EQU   ISTATCVT+564                                             01162000
ATCINCS1 EQU   ISTATCVT+560                                             01163000
ATCSRTAB EQU   ISTATCVT+556                                             01164000
ATCINCRD EQU   ISTATCVT+552                                             01165000
ATCINCPH EQU   ISTATCVT+548                                             01166000
ATCINCLQ EQU   ISTATCVT+544                                             01167000
ATCNOCRT EQU   ISTATCVT+540                                             01168000
ATCINCF1 EQU   ISTATCVT+536                                             01169000
ATCINCCI EQU   ISTATCVT+532                                             01170000
ATCINCCO EQU   ISTATCVT+528                                             01171000
ATCBLDLA EQU   ISTATCVT+524                                             01172000
ATCALOAD EQU   ISTATCVT+520                                             01173000
ATCADEL  EQU   ISTATCVT+516                                             01174000
ATCESC02 EQU   ISTATCVT+512                                             01175000
ATCESC01 EQU   ISTATCVT+508                                             01176000
ATCDEC01 EQU   ISTATCVT+504                                             01177000
ATCDEC00 EQU   ISTATCVT+500                                             01178000
ATCCPCRT EQU   ISTATCVT+496                                             01179000
ATCMSGM  EQU   ISTATCVT+492                                             01180000
ATCCPCFR EQU   ISTATCVT+488                                             01181000
ATCCPCGR EQU   ISTATCVT+484                                             01182000
ATCCPCPP EQU   ISTATCVT+480                                             01183000
ATCMSGP  EQU   ISTATCVT+476                                             01184000
ATCCPCNT EQU   ISTATCVT+472                                             01185000
ATCAUTHA EQU   ISTATCVT+468                                             01186000
ATCACCTA EQU   ISTATCVT+464                                             01187000
ATCAP39  EQU   ISTATCVT+460                                             01188000
ATCAP36  EQU   ISTATCVT+456                                             01189000
ATCAP35  EQU   ISTATCVT+452                                             01190000
ATCAP33  EQU   ISTATCVT+448                                             01191000
ATCAPCR5 EQU   ISTATCVT+444                                             01192000
ATCAICPT EQU   ISTATCVT+440                                             01193000
ATCAPI   EQU   ISTATCVT+436                                             01194000
ATCAICTN EQU   ISTATCVT+432                                             01195000
ATCACC01 EQU   ISTATCVT+428                                             01196000
ATCACC00 EQU   ISTATCVT+424                                             01197000
ATCLDECB EQU   ATCLDTIL+12                                              01198000
ATCLDLCK EQU   ATCLDTIL+8                                               01199000
ATCLDLST EQU   ATCLDTIL+4                                               01200000
ATCLDNCS EQU   ATCLDTIL                                                 01201000
ATCNOSPB EQU   ISTATCVT+376                                             01202000
ATCNSPAB EQU   ISTATCVT+344                                             01203000
ATCLUSRT EQU   ISTATCVT+312                                             01204000
ATCPUIOP EQU   ISTATCVT+280                                             01205000
ATCPUPAB EQU   ISTATCVT+248                                             01206000
ATCPXPAB EQU   ISTATCVT+216                                             01207000
ATCPOPAB EQU   ISTATCVT+184                                             01208000
@NM00094 EQU   ATCVDPAB+16                                              01209000
ATCFEPAB EQU   ATCVDPAB                                                 01210000
ATCTCIPB EQU   ISTATCVT+120                                             01211000
ATCCSPAB EQU   ATCSMPAB+16                                              01212000
@NM00093 EQU   ATCSMPAB                                                 01213000
ATCTMRPB EQU   ISTATCVT+56                                              01214000
ATCITPAB EQU   ISTATCVT+24                                              01215000
@NM00092 EQU   ATCITRA1                                                 01216000
ATCITSCP EQU   ATCITRA1                                                 01217000
ATCITMSG EQU   ATCITRA1                                                 01218000
ATCITPIU EQU   ATCITRA1                                                 01219000
ATCITSMS EQU   ATCITRA1                                                 01220000
ATCITPSS EQU   ATCITRA1                                                 01221000
ATCITLCK EQU   ATCITRA1                                                 01222000
ATCITAPI EQU   ATCITRA1                                                 01223000
ATCITCNT EQU   ATCITFLG                                                 01224000
ATCITRPH EQU   ATCITCDS                                                 01225000
ATCITTBL EQU   ATCITFLD+4                                               01226000
ATCITPRM EQU   ATCITFLD                                                 01227000
ATCPTCHA EQU   ATCRPTCH+4                                               01228000
ATCVTLVL EQU   ATCRPTCH                                                 01229000
RPHUPSTA EQU   ISTRPH+104                                               01230000
RPHSAV16 EQU   RPHWORK+60                                               01231000
RPHSAV15 EQU   RPHWORK+56                                               01232000
RPHSAV14 EQU   RPHWORK+52                                               01233000
RPHSAV13 EQU   RPHWORK+48                                               01234000
RPHSAV12 EQU   RPHWORK+44                                               01235000
RPHSAV11 EQU   RPHWORK+40                                               01236000
RPHSAV10 EQU   RPHWORK+36                                               01237000
RPHSAVE9 EQU   RPHWORK+32                                               01238000
RPHSAVE8 EQU   RPHWORK+28                                               01239000
RPHSAVE7 EQU   RPHWORK+24                                               01240000
RPHSAVE6 EQU   RPHWORK+20                                               01241000
RPHSAVE5 EQU   RPHWORK+16                                               01242000
RPHSAVE4 EQU   RPHWORK+12                                               01243000
RPHSAVE3 EQU   RPHWORK+8                                                01244000
RPHSAVE2 EQU   RPHWORK+4                                                01245000
RPHSHALF EQU   RPHSAVE1+2                                               01246000
RPHSBIT8 EQU   RPHSBITS                                                 01247000
RPHSBIT7 EQU   RPHSBITS                                                 01248000
RPHSBIT6 EQU   RPHSBITS                                                 01249000
RPHSBIT5 EQU   RPHSBITS                                                 01250000
RPHSBIT4 EQU   RPHSBITS                                                 01251000
RPHSBIT3 EQU   RPHSBITS                                                 01252000
RPHSBIT2 EQU   RPHSBITS                                                 01253000
RPHSBIT1 EQU   RPHSBITS                                                 01254000
RPHSBYTE EQU   RPHSAVE1                                                 01255000
RPHPABQP EQU   RPHPABQA+1                                               01256000
RPHPABFG EQU   RPHPABQA                                                 01257000
RPHCRR   EQU   ISTRPH+32                                                01258000
RPHSRP34 EQU   RPHSRPRM+2                                               01259000
RPHSRP12 EQU   RPHSRPRM                                                 01260000
RPHWEGT  EQU   RPHCSPA                                                  01261000
RPHMAJCB EQU   ISTRPH+21                                                01262000
RPHPABOF EQU   ISTRPH+20                                                01263000
RPHRESUM EQU   RPHRESMA+1                                               01264000
@NM00091 EQU   RPHWPFLG                                                 01265000
RPHPURGE EQU   RPHWPFLG                                                 01266000
RPHPT    EQU   RPHWPFLG                                                 01267000
RPHWT    EQU   RPHWPFLG                                                 01268000
RPHRSKEY EQU   RPHWPFLG                                                 01269000
RPHDVTA  EQU   ISTRPH+12                                                01270000
RPHTIK   EQU   RPHTSKID+3                                               01271000
@NM00090 EQU   RPHTSKID                                                 01272000
RPHRPHAP EQU   RPHRPHA+1                                                01273000
@NM00089 EQU   RPHRPHA                                                  01274000
RPHGATE  EQU   RPHRPHA                                                  01275000
RPHABEND EQU   RPHFLGB                                                  01276000
RPHUWAIT EQU   RPHFLGB                                                  01277000
RPHRLCRA EQU   RPHFLGB                                                  01278000
@NM00088 EQU   RPHFLGB                                                  01279000
RPHPGCMP EQU   RPHFLGB                                                  01280000
RPHFBAPS EQU   RPHFLGB                                                  01281000
RPHBSSP  EQU   RPHFLGB                                                  01282000
RPHLOCK  EQU   RPHFLGB                                                  01283000
RPHFNFLG EQU   RPHFSTLC                                                 01284000
RPHMLTCP EQU   RPHFLAGS                                                 01285000
RPHSMCLR EQU   RPHFLAGS                                                 01286000
RPHSMTYP EQU   RPHFLAGS                                                 01287000
RPHSMQ   EQU   RPHFLAGS                                                 01288000
RPHAPTYP EQU   RPHFLAGS                                                 01289000
RPHSPGIN EQU   RPHFLAGS                                                 01290000
RPHOGIND EQU   RPHFLAGS                                                 01291000
RPHLNGTH EQU   RPHCNTL+1                                                01292000
RPHTYPE  EQU   RPHCNTL                                                  01293000
DYPPAB   EQU   ISTDYPAB+16                                              01294000
DYPOCRPH EQU   DYPPACMD                                                 01295000
DYPTSKID EQU   ISTDYPAB+8                                               01296000
DYPPACTB EQU   DYPCHAIN                                                 01297000
DYPFLGS  EQU   ISTDYPAB+2                                               01298000
DYPLNGTH EQU   ISTDYPAB+1                                               01299000
DYPTYPE  EQU   ISTDYPAB                                                 01300000
@NM00087 EQU   ISTACDEB+120                                             01301000
ACDNIB   EQU   ISTACDEB+116                                             01302000
ACDEAS   EQU   ISTACDEB+112                                             01303000
ACDUNTNM EQU   ISTACDEB+104                                             01304000
@NM00086 EQU   ACDLUFLG+1                                               01305000
ACDAACQ  EQU   ACDLUFLG+1                                               01306000
ACDAPASS EQU   ACDLUFLG+1                                               01307000
ACDCSM   EQU   ACDLUFLG+1                                               01308000
ACDPARS  EQU   ACDLUFLG+1                                               01309000
ACDTSO   EQU   ACDLUFLG+1                                               01310000
ACDSCIP  EQU   ACDLUFLG+1                                               01311000
ACDNSEXT EQU   ACDLUFLG+1                                               01312000
ACDAUTHE EQU   ACDLUFLG                                                 01313000
ACDTPEND EQU   ACDLUFLG                                                 01314000
ACDABEND EQU   ACDLUFLG                                                 01315000
ACDCLOSE EQU   ACDLUFLG                                                 01316000
ACDQUIES EQU   ACDLUFLG                                                 01317000
ACDNSESS EQU   ACDLUFLG                                                 01318000
ACDREADY EQU   ACDLUFLG                                                 01319000
ACDACTIV EQU   ACDLUFLG                                                 01320000
ACDRQID  EQU   ISTACDEB+100                                             01321000
ACDSMCNT EQU   ISTACDEB+96                                              01322000
ACDPACNT EQU   ISTACDEB+92                                              01323000
ACDASCNT EQU   ISTACDEB+88                                              01324000
ACDSMQ   EQU   ISTACDEB+84                                              01325000
ACDSSCNT EQU   ISTACDEB+80                                              01326000
ACDECB   EQU   ISTACDEB+76                                              01327000
ACDLUCBA EQU   ISTACDEB+72                                              01328000
ACDLOCK  EQU   ISTACDEB+68                                              01329000
ACDDEB   EQU   ISTACDEB+60                                              01330000
ACDTCB   EQU   ISTACDEB+56                                              01331000
ACDRARQ  EQU   ACDANYQ+4                                                01332000
ACDRAFQ  EQU   ACDANYQ                                                  01333000
ACDSSPAB EQU   ISTACDEB+32                                              01334000
ACDNEPAB EQU   ISTACDEB+16                                              01335000
ACDRDTE  EQU   ISTACDEB+12                                              01336000
ACDCHN   EQU   ISTACDEB+4                                               01337000
ACDSAF   EQU   ISTACDEB+2                                               01338000
ACDLNGTH EQU   ISTACDEB+1                                               01339000
ACDTYPE  EQU   ISTACDEB                                                 01340000
PABRPHA  EQU   PABRPHFG+1                                               01341000
PABNODQ  EQU   PABFLAGS                                                 01342000
PABINHBT EQU   PABFLAGS                                                 01343000
PABERLOK EQU   PABERRLK                                                 01344000
PABSSN   EQU   PABFLAGS                                                 01345000
PABDYNAM EQU   PABFLAGS                                                 01346000
PABXTND  EQU   PABFLAGS                                                 01347000
PABPRIOR EQU   PABFLAGS                                                 01348000
PABCHNGP EQU   PABCHAIN+1                                               01349000
PABRSV02 EQU   PABCHAIN                                                 01350000
PABDELAY EQU   PABCHAIN                                                 01351000
PABQUED  EQU   PABRUNNG                                                 01352000
PABRESET EQU   PABCHAIN                                                 01353000
PABUNCON EQU   PABCHAIN                                                 01354000
PABCDP   EQU   PABCHAIN                                                 01355000
PABRESCH EQU   PABCHAIN                                                 01356000
PABCHNG  EQU   PABCHAIN                                                 01357000
PABWEQP  EQU   PABWEQA+1                                                01358000
PABRSV01 EQU   PABWEQA                                                  01359000
PABWEQG  EQU   PABWEQA                                                  01360000
LOKXCL   EQU   @NM00083                                                 01361000
LOKPRY   EQU   @NM00083                                                 01362000
@NM00084 EQU   @NM00083                                                 01363000
@NM00082 EQU   LOKCHNG                                                  01364000
LOKCT    EQU   ISTLOK                                                   01365000
@NM00081 EQU   SRBSECT+40                                               01366000
@NM00080 EQU   SRBSECT+38                                               01367000
SRBPRIOR EQU   SRBSECT+37                                               01368000
SRBPKF   EQU   SRBSECT+36                                               01369000
SRBSAVE  EQU   SRBSECT+32                                               01370000
SRBPARM  EQU   SRBSECT+28                                               01371000
SRBRMTR  EQU   SRBSECT+24                                               01372000
SRBEP    EQU   SRBSECT+20                                               01373000
SRBPTCB  EQU   SRBFLC+4                                                 01374000
SRBPASID EQU   SRBFLC+2                                                 01375000
SRBCPAFF EQU   SRBFLC                                                   01376000
SRBASCB  EQU   SRBSECT+8                                                01377000
SRBFLNK  EQU   SRBSECT+4                                                01378000
SRBID    EQU   SRBSECT                                                  01379000
ASXBEND  EQU   ASXB+232                                                 01380000
ASXBRV25 EQU   ASXB+228                                                 01381000
ASXBRV24 EQU   ASXB+224                                                 01382000
ASXBPT0E EQU   ASXB+220                                                 01383000
ASXBCRB4 EQU   ASXBCASW+3                                               01384000
ASXBCRB3 EQU   ASXBCASW+2                                               01385000
ASXBCRB2 EQU   ASXBCASW+1                                               01386000
ASXBCR06 EQU   ASXBCRB1                                                 01387000
ASXBCR05 EQU   ASXBCRB1                                                 01388000
ASXBCR04 EQU   ASXBCRB1                                                 01389000
ASXBCR03 EQU   ASXBCRB1                                                 01390000
ASXBCR02 EQU   ASXBCRB1                                                 01391000
ASXBCR01 EQU   ASXBCRB1                                                 01392000
ASXBTFD  EQU   ASXBCRB1                                                 01393000
ASXBPIP  EQU   ASXBCRB1                                                 01394000
ASXBCTDC EQU   ASXB+212                                                 01395000
ASXBTDCB EQU   ASXB+208                                                 01396000
ASXBRV19 EQU   ASXB+204                                                 01397000
ASXBRV18 EQU   ASXB+200                                                 01398000
ASXBRV17 EQU   ASXB+196                                                 01399000
ASXBRV16 EQU   ASXB+192                                                 01400000
ASXBLSRB EQU   ASXBAEQ+20                                               01401000
ASXBFSRB EQU   ASXBAEQ+16                                               01402000
ASXBLRQE EQU   ASXBAEQ+12                                               01403000
ASXBFRQE EQU   ASXBAEQ+8                                                01404000
ASXBLIQE EQU   ASXBAEQ+4                                                01405000
ASXBFIQE EQU   ASXBAEQ                                                  01406000
ASXBETSK EQU   ASXB+164                                                 01407000
ASXBSIRB EQU   ASXB+160                                                 01408000
ASXBPSWD EQU   ASXB+152                                                 01409000
ASXBPRG  EQU   ASXB+136                                                 01410000
ASXBRV26 EQU   ASXB+132                                                 01411000
ASXBOUSB EQU   ASXB+128                                                 01412000
ASXBDDR  EQU   ASXB+124                                                 01413000
ASXBRCTD EQU   ASXB+120                                                 01414000
ASXBRSMD EQU   ASXB+116                                                 01415000
ASXBSPSA EQU   ASXB+112                                                 01416000
ASXBFRWA EQU   ASXB+108                                                 01417000
ASXBFLSA EQU   ASXB+36                                                  01418000
ASXBIHSA EQU   ASXB+32                                                  01419000
ASXBRV15 EQU   ASXB+28                                                  01420000
ASXBRV14 EQU   ASXB+24                                                  01421000
ASXBLWA  EQU   ASXB+20                                                  01422000
ASXBRS00 EQU   ASXB+14                                                  01423000
ASXBTCBS EQU   ASXB+12                                                  01424000
ASXBLTCB EQU   ASXB+8                                                   01425000
ASXBFTCB EQU   ASXB+4                                                   01426000
ASXBASXB EQU   ASXB                                                     01427000
ASXBEGIN EQU   ASXB                                                     01428000
ASCBEND  EQU   ASCB+208                                                 01429000
ASCBSRBT EQU   ASCB+200                                                 01430000
ASCBSWTL EQU   ASCB+196                                                 01431000
ASCBRS14 EQU   ASCB+195                                                 01432000
ASCBSMCT EQU   ASCB+194                                                 01433000
ASCBRS12 EQU   ASCB+192                                                 01434000
ASCBPCTT EQU   ASCB+188                                                 01435000
ASCBVGTT EQU   ASCB+184                                                 01436000
ASCBRV43 EQU   ASCBSRQ4                                                 01437000
ASCBRV42 EQU   ASCBSRQ4                                                 01438000
ASCBRV41 EQU   ASCBSRQ4                                                 01439000
ASCBRV40 EQU   ASCBSRQ4                                                 01440000
ASCBRV39 EQU   ASCBSRQ4                                                 01441000
ASCBRV38 EQU   ASCBSRQ4                                                 01442000
ASCBRV37 EQU   ASCBSRQ4                                                 01443000
ASCBRV36 EQU   ASCBSRQ4                                                 01444000
ASCBRV35 EQU   ASCBSRQ3                                                 01445000
ASCBRV34 EQU   ASCBSRQ3                                                 01446000
ASCBRV33 EQU   ASCBSRQ3                                                 01447000
ASCBRV32 EQU   ASCBSRQ3                                                 01448000
ASCBRV31 EQU   ASCBSRQ3                                                 01449000
ASCBRV30 EQU   ASCBSRQ3                                                 01450000
ASCBRV29 EQU   ASCBSRQ3                                                 01451000
ASCBRV28 EQU   ASCBSRQ3                                                 01452000
ASCBRV27 EQU   ASCBSRQ2                                                 01453000
ASCBRV26 EQU   ASCBSRQ2                                                 01454000
ASCBRV25 EQU   ASCBSRQ2                                                 01455000
ASCBRV24 EQU   ASCBSRQ2                                                 01456000
ASCBRV23 EQU   ASCBSRQ2                                                 01457000
ASCBRV22 EQU   ASCBSRQ2                                                 01458000
ASCBRV21 EQU   ASCBSRQ2                                                 01459000
ASCBRV20 EQU   ASCBSRQ2                                                 01460000
ASCBRV19 EQU   ASCBSRQ1                                                 01461000
ASCBRV18 EQU   ASCBSRQ1                                                 01462000
ASCBRV17 EQU   ASCBSRQ1                                                 01463000
ASCBRV16 EQU   ASCBSRQ1                                                 01464000
ASCBRV15 EQU   ASCBSRQ1                                                 01465000
ASCBRV14 EQU   ASCBSRQ1                                                 01466000
ASCBRV13 EQU   ASCBSRQ1                                                 01467000
ASCBSTA  EQU   ASCBSRQ1                                                 01468000
ASCBJBNS EQU   ASCB+176                                                 01469000
ASCBJBNI EQU   ASCB+172                                                 01470000
ASCBMCC  EQU   ASCB+168                                                 01471000
ASCBRTWA EQU   ASCB+164                                                 01472000
ASCBIQEA EQU   ASCB+160                                                 01473000
ASCBXMPQ EQU   ASCB+156                                                 01474000
ASCBRS01 EQU   ASCB+154                                                 01475000
ASCBFMCT EQU   ASCB+152                                                 01476000
ASCBOUXB EQU   ASCB+148                                                 01477000
ASCBOUCB EQU   ASCB+144                                                 01478000
ASCBMECB EQU   ASCB+140                                                 01479000
ASCBQECB EQU   ASCB+136                                                 01480000
ASCBLSQH EQU   ASCBLKGP+4                                               01481000
ASCBLOCK EQU   ASCBLKGP                                                 01482000
ASCBTCBS EQU   ASCB+124                                                 01483000
ASCBNVSC EQU   ASCB+122                                                 01484000
ASCBVSC  EQU   ASCB+120                                                 01485000
ASCBSRBS EQU   ASCB+118                                                 01486000
ASCBSSRB EQU   ASCB+116                                                 01487000
ASCBRV06 EQU   ASCBFLG2                                                 01488000
ASCBRV05 EQU   ASCBFLG2                                                 01489000
ASCBRV04 EQU   ASCBFLG2                                                 01490000
ASCBSNQS EQU   ASCBFLG2                                                 01491000
ASCBS2S  EQU   ASCBFLG2                                                 01492000
ASCBCEXT EQU   ASCBFLG2                                                 01493000
ASCBPXMT EQU   ASCBFLG2                                                 01494000
ASCBXMPT EQU   ASCBFLG2                                                 01495000
ASCBRF07 EQU   ASCBDSP1                                                 01496000
ASCBRF06 EQU   ASCBDSP1                                                 01497000
ASCBRF05 EQU   ASCBDSP1                                                 01498000
ASCBRF04 EQU   ASCBDSP1                                                 01499000
ASCBRF03 EQU   ASCBDSP1                                                 01500000
ASCBRF02 EQU   ASCBDSP1                                                 01501000
ASCBFAIL EQU   ASCBDSP1                                                 01502000
ASCBNOQ  EQU   ASCBDSP1                                                 01503000
ASCBSWCT EQU   ASCB+112                                                 01504000
ASCBTMCH EQU   ASCB+104                                                 01505000
ASCBNSWP EQU   ASCBFLG1                                                 01506000
ASCBTYP1 EQU   ASCBFLG1                                                 01507000
ASCBSTND EQU   ASCBFLG1                                                 01508000
ASCBABNT EQU   ASCBFLG1                                                 01509000
ASCBTERM EQU   ASCBFLG1                                                 01510000
ASCBS3S  EQU   ASCBFLG1                                                 01511000
ASCBCMSH EQU   ASCBFLG1                                                 01512000
ASCBTOFF EQU   ASCBFLG1                                                 01513000
ASCBRF01 EQU   ASCBRCTF                                                 01514000
ASCBTMLW EQU   ASCBRCTF                                                 01515000
ASCBOUT  EQU   ASCBRCTF                                                 01516000
ASCBWAIT EQU   ASCBRCTF                                                 01517000
ASCBRV08 EQU   ASCBRCTF                                                 01518000
ASCBFQU  EQU   ASCBRCTF                                                 01519000
ASCBFRS  EQU   ASCBRCTF                                                 01520000
ASCBTMNO EQU   ASCBRCTF                                                 01521000
ASCBAFFN EQU   ASCBFW1                                                  01522000
ASCBDUMP EQU   ASCB+96                                                  01523000
ASCBQSVC EQU   ASCB+92                                                  01524000
ASCBUBET EQU   ASCB+88                                                  01525000
ASCBECB  EQU   ASCB+84                                                  01526000
ASCBJSTL EQU   ASCB+80                                                  01527000
ASCBEWST EQU   ASCB+72                                                  01528000
ASCBEJST EQU   ASCB+64                                                  01529000
ASCBTSB  EQU   ASCB+60                                                  01530000
ASCBCSCB EQU   ASCB+56                                                  01531000
ASCBRSM  EQU   ASCB+52                                                  01532000
ASCBLDA  EQU   ASCB+48                                                  01533000
ASCBSTOR EQU   ASCB+44                                                  01534000
ASCBDP   EQU   ASCB+43                                                  01535000
ASCBRV07 EQU   ASCB+42                                                  01536000
ASCBIOSM EQU   ASCB+40                                                  01537000
ASCBSEQN EQU   ASCB+38                                                  01538000
ASCBASID EQU   ASCB+36                                                  01539000
ASCBCPUS EQU   ASCB+32                                                  01540000
ASCBSPL  EQU   ASCB+28                                                  01541000
ASCBIOSP EQU   ASCB+24                                                  01542000
ASCBSYNC EQU   ASCBSUPC+4                                               01543000
ASCBSVRB EQU   ASCBSUPC                                                 01544000
ASCBCMSF EQU   ASCB+12                                                  01545000
ASCBBWDP EQU   ASCB+8                                                   01546000
ASCBFWDP EQU   ASCB+4                                                   01547000
ASCBASCB EQU   ASCB                                                     01548000
ASCBEGIN EQU   ASCB                                                     01549000
EXLEADDR EQU   EXLEXITP                                                 01550000
@NM00055 EQU   EXLENFL                                                  01551000
EXLLNK   EQU   EXLENFL                                                  01552000
EXLACTM  EQU   EXLENFL                                                  01553000
EXLSPEC  EQU   EXLENFL                                                  01554000
EXLRESPP EQU   EXLRESP+1                                                01555000
@NM00054 EQU   EXLRESPF                                                 01556000
EXLRESPK EQU   EXLRESPF                                                 01557000
EXLRESPA EQU   EXLRESPF                                                 01558000
EXLRESPS EQU   EXLRESPF                                                 01559000
EXLDFASP EQU   EXLDFAS+1                                                01560000
@NM00053 EQU   EXLDFASF                                                 01561000
EXLDFASK EQU   EXLDFASF                                                 01562000
EXLDFASA EQU   EXLDFASF                                                 01563000
EXLDFASS EQU   EXLDFASF                                                 01564000
EXLTNSEP EQU   EXLVTEXT+26                                              01565000
@NM00052 EQU   EXLTNSEF                                                 01566000
EXLTNSEK EQU   EXLTNSEF                                                 01567000
EXLTNSEA EQU   EXLTNSEF                                                 01568000
EXLTNSES EQU   EXLTNSEF                                                 01569000
EXLTPNDP EQU   EXLVTEXT+21                                              01570000
@NM00051 EQU   EXLTPNDF                                                 01571000
EXLTPNDK EQU   EXLTPNDF                                                 01572000
EXLTPNDA EQU   EXLTPNDF                                                 01573000
EXLTPNDS EQU   EXLTPNDF                                                 01574000
EXLATTNP EQU   EXLVTEXT+16                                              01575000
@NM00050 EQU   EXLATTNF                                                 01576000
EXLATTNK EQU   EXLATTNF                                                 01577000
EXLATTNA EQU   EXLATTNF                                                 01578000
EXLATTNS EQU   EXLATTNF                                                 01579000
@NM00049 EQU   EXLVTEXT+10                                              01580000
EXLRLRQP EQU   EXLVTEXT+6                                               01581000
@NM00048 EQU   EXLRLRQF                                                 01582000
EXLRLRQK EQU   EXLRLRQF                                                 01583000
EXLRLRQA EQU   EXLRLRQF                                                 01584000
EXLRLRQS EQU   EXLRLRQF                                                 01585000
EXLNLGNP EQU   EXLVTEXT+1                                               01586000
@NM00047 EQU   EXLNLGNF                                                 01587000
EXLNLGNK EQU   EXLNLGNF                                                 01588000
EXLNLGNA EQU   EXLNLGNF                                                 01589000
EXLNLGNS EQU   EXLNLGNF                                                 01590000
EXLOPNP  EQU   EXLCOMN+36                                               01591000
@NM00046 EQU   EXLOPNF                                                  01592000
EXLOPNK  EQU   EXLOPNF                                                  01593000
EXLOPNA  EQU   EXLOPNF                                                  01594000
EXLOPNS  EQU   EXLOPNF                                                  01595000
EXLJRNP  EQU   EXLCOMN+31                                               01596000
@NM00045 EQU   EXLJRNF                                                  01597000
EXLJRNK  EQU   EXLJRNF                                                  01598000
EXLJRNA  EQU   EXLJRNF                                                  01599000
EXLJRNS  EQU   EXLJRNF                                                  01600000
EXLLGNP  EQU   EXLCOMN+26                                               01601000
@NM00044 EQU   EXLLGNF                                                  01602000
EXLLGNK  EQU   EXLLGNF                                                  01603000
EXLLGNA  EQU   EXLLGNF                                                  01604000
EXLLGNS  EQU   EXLLGNF                                                  01605000
EXLUPADP EQU   EXLSCIPP                                                 01606000
@NM00043 EQU   EXLUPADF                                                 01607000
EXLUPADK EQU   EXLSCIPK                                                 01608000
EXLUPADA EQU   EXLSCIPA                                                 01609000
EXLUPADS EQU   EXLSCIPS                                                 01610000
EXLLERP  EQU   EXLCOMN+16                                               01611000
@NM00042 EQU   EXLLERF                                                  01612000
EXLLERK  EQU   EXLLERF                                                  01613000
EXLLERA  EQU   EXLLERF                                                  01614000
EXLLERS  EQU   EXLLERF                                                  01615000
EXLSYNP  EQU   EXLCOMN+11                                               01616000
@NM00041 EQU   EXLSYNF                                                  01617000
EXLSYNK  EQU   EXLSYNF                                                  01618000
EXLSYNA  EQU   EXLSYNF                                                  01619000
EXLSYNS  EQU   EXLSYNF                                                  01620000
EXLEODP  EQU   EXLCOMN+6                                                01621000
@NM00040 EQU   EXLEODF                                                  01622000
EXLEODK  EQU   EXLEODF                                                  01623000
EXLEODA  EQU   EXLEODF                                                  01624000
EXLEODS  EQU   EXLEODF                                                  01625000
@NM00039 EQU   EXLCOMN+4                                                01626000
EXLLEN2  EQU   EXLLEN                                                   01627000
EXLSTYP  EQU   EXLCOMN+1                                                01628000
EXLID    EQU   EXLCOMN                                                  01629000
ACBTNIB  EQU   ACBVTEXT+12                                              01630000
@NM00038 EQU   ACBVTEXT+8                                               01631000
@NM00037 EQU   ACBVTEXT+6                                               01632000
ACBRTN   EQU   ACBVTEXT                                                 01633000
ACBAMAX  EQU   ACBAPID                                                  01634000
@NM00036 EQU   ACBCOMN+70                                               01635000
ACBSRID  EQU   ACBCOMN+68                                               01636000
ACBUAPTR EQU   ACBCOMN+64                                               01637000
ACBLRECL EQU   ACBCOMN+62                                               01638000
ACBMSGLN EQU   ACBBLKSZ                                                 01639000
ACBBUFSP EQU   ACBCOMN+56                                               01640000
@NM00035 EQU   ACBUJFCB+1                                               01641000
ACBOPTN  EQU   ACBUJFCB                                                 01642000
@NM00034 EQU   ACBINFL2                                                 01643000
ACBCBIC  EQU   ACBINFL2                                                 01644000
ACBSOPEN EQU   ACBINFL2                                                 01645000
ACBSWARN EQU   ACBINFL2                                                 01646000
ACBBYPSS EQU   ACBINFL1                                                 01647000
ACBSDS   EQU   ACBVVIC                                                  01648000
ACBUCRA  EQU   ACBINFL1                                                 01649000
ACBSCRA  EQU   ACBINFL1                                                 01650000
ACBCAT   EQU   ACBINFL1                                                 01651000
ACBIJRQE EQU   ACBINFL1                                                 01652000
ACBJEPS  EQU   ACBINFL1                                                 01653000
@NM00033 EQU   ACBINFL1                                                 01654000
ACBERFLG EQU   ACBCOMN+49                                               01655000
ACBBUSY  EQU   ACBIOSFG                                                 01656000
ACBLOCK  EQU   ACBEXFG                                                  01657000
@NM00032 EQU   ACBOFLGS                                                 01658000
ACBDSERR EQU   ACBOFLGS                                                 01659000
ACBOPEN  EQU   ACBOFLGS                                                 01660000
ACBEOV   EQU   ACBOFLGS                                                 01661000
@NM00031 EQU   ACBOFLGS                                                 01662000
ACBDEB   EQU   ACBDDNM+5                                                01663000
ACBERFL  EQU   ACBDDNM+4                                                01664000
ACBAM    EQU   ACBAMETH                                                 01665000
ACBINFL  EQU   ACBDDNM+2                                                01666000
ACBTIOT  EQU   ACBDDNM                                                  01667000
ACBUEL   EQU   ACBEXLST                                                 01668000
ACBPASSW EQU   ACBCOMN+32                                               01669000
ACBMSGAR EQU   ACBCOMN+28                                               01670000
@NM00030 EQU   ACBDSOR2                                                 01671000
ACBDORGA EQU   ACBDSOR2                                                 01672000
@NM00029 EQU   ACBDSOR2                                                 01673000
@NM00028 EQU   ACBDSOR1                                                 01674000
ACBOPTJ  EQU   ACBDVIND                                                 01675000
ACBCRNRE EQU   ACBCROPS                                                 01676000
ACBCRNCK EQU   ACBCROPS                                                 01677000
ACBASA   EQU   ACBCCTYP                                                 01678000
@NM00027 EQU   ACBCCTYP                                                 01679000
ACBRECAF EQU   ACBRECFM                                                 01680000
ACBJBUF  EQU   ACBBUFPL+2                                               01681000
ACBMACR4 EQU   ACBBUFPL+1                                               01682000
@NM00026 EQU   ACBMACR3                                                 01683000
ACBNCFX  EQU   ACBMACR3                                                 01684000
ACBSIS   EQU   ACBMACR3                                                 01685000
ACBDFR   EQU   ACBMACR3                                                 01686000
ACBICI   EQU   ACBMACR3                                                 01687000
ACBGSR   EQU   ACBMACR3                                                 01688000
ACBLSR   EQU   ACBMACR3                                                 01689000
@NM00025 EQU   ACBMACR3                                                 01690000
ACBBUFNI EQU   ACBCOMN+18                                               01691000
ACBBUFND EQU   ACBCOMN+16                                               01692000
ACBSTRNO EQU   ACBCOMN+15                                               01693000
ACBBSTNO EQU   ACBCOMN+14                                               01694000
ACBAIX   EQU   ACBMACR2                                                 01695000
ACBDSN   EQU   ACBMACR2                                                 01696000
ACBRST   EQU   ACBMACR2                                                 01697000
ACBLOGON EQU   ACBMACR2                                                 01698000
ACBSKP   EQU   ACBMACR2                                                 01699000
@NM00024 EQU   ACBMACR2                                                 01700000
ACBUBF   EQU   ACBMACR1                                                 01701000
ACBOUT   EQU   ACBMACR1                                                 01702000
ACBIN    EQU   ACBMACR1                                                 01703000
ACBDIR   EQU   ACBMACR1                                                 01704000
ACBSEQ   EQU   ACBMACR1                                                 01705000
ACBBLK   EQU   ACBCNV                                                   01706000
ACBADD   EQU   ACBADR                                                   01707000
ACBKEY   EQU   ACBMACR1                                                 01708000
ACBINRTN EQU   ACBCOMN+8                                                01709000
ACBAMWAP EQU   ACBIBCT                                                  01710000
ACBLEN2  EQU   ACBLENG2                                                 01711000
ACBSTYP  EQU   ACBCOMN+1                                                01712000
ACBID    EQU   ACBCOMN                                                  01713000
RPLSEQNO EQU   RPLOF60+6                                                01714000
@NM00023 EQU   RPLIBSQ                                                  01715000
RPLIINV  EQU   RPLIBSQ                                                  01716000
RPLINEG  EQU   RPLIBSQ                                                  01717000
RPLIPOS  EQU   RPLIBSQ                                                  01718000
RPLIIGN  EQU   RPLIBSQ                                                  01719000
RPLIRSET EQU   RPLIBSQ                                                  01720000
RPLITST  EQU   RPLIBSQ                                                  01721000
RPLISET  EQU   RPLIBSQ                                                  01722000
@NM00022 EQU   RPLOBSQ                                                  01723000
RPLOINV  EQU   RPLOBSQ                                                  01724000
RPLONEG  EQU   RPLOBSQ                                                  01725000
RPLOPOS  EQU   RPLOBSQ                                                  01726000
RPLOIGN  EQU   RPLOBSQ                                                  01727000
RPLORSET EQU   RPLOBSQ                                                  01728000
RPLOTST  EQU   RPLOBSQ                                                  01729000
RPLOSET  EQU   RPLOBSQ                                                  01730000
RPLIBSQV EQU   RPLOF60+2                                                01731000
RPLOBSQV EQU   RPLOF60                                                  01732000
@NM00021 EQU   RPLCNTSC                                                 01733000
RPLRSHUT EQU   RPLCNTSC                                                 01734000
RPLRQR   EQU   RPLCNTSC                                                 01735000
RPLSHUTC EQU   RPLCNTSC                                                 01736000
RPLSHUTD EQU   RPLCNTSC                                                 01737000
RPLSTSN  EQU   RPLCNTSC                                                 01738000
RPLCLEAR EQU   RPLCNTSC                                                 01739000
RPLSDT   EQU   RPLCNTSC                                                 01740000
RPLBIS   EQU   RPLCNTDC                                                 01741000
RPLSBI   EQU   RPLCNTDC                                                 01742000
RPLTUNBD EQU   RPLCNTDC                                                 01743000
RPLTBIND EQU   RPLCNTDC                                                 01744000
RPLSIGNL EQU   RPLCNTDC                                                 01745000
RPLLUS   EQU   RPLCNTDC                                                 01746000
RPLRTR   EQU   RPLCNTDC                                                 01747000
RPLBID   EQU   RPLCNTDC                                                 01748000
@NM00020 EQU   RPLCNTDF                                                 01749000
RPLQI    EQU   RPLCNTDF                                                 01750000
RPLRELQ  EQU   RPLCNTDF                                                 01751000
RPLCHASE EQU   RPLCNTDF                                                 01752000
RPLQEC   EQU   RPLCNTDF                                                 01753000
RPLQC    EQU   RPLCNTDF                                                 01754000
RPLCNCEL EQU   RPLCNTDF                                                 01755000
RPLDATA  EQU   RPLCNTDF                                                 01756000
RPLRRN   EQU   RPLRESP                                                  01757000
RPLNFME  EQU   RPLRESP                                                  01758000
RPLEX    EQU   RPLRESP                                                  01759000
RPLQRI   EQU   RPLRESP                                                  01760000
@NM00019 EQU   RPLPOSTV                                                 01761000
RPLSCHED EQU   RPLPOSTV                                                 01762000
@NM00018 EQU   RPLVTFL1                                                 01763000
RPLTLGAC EQU   RPLVTFL1                                                 01764000
RPLTNDSP EQU   RPLVTFL1                                                 01765000
RPLAUTUS EQU   RPLVTFL1                                                 01766000
RPLVTUSE EQU   RPLVTFL1                                                 01767000
@NM00017 EQU   RPLVTFL1                                                 01768000
@NM00016 EQU   RPLCHN                                                   01769000
RPLONLY  EQU   RPLCHN                                                   01770000
RPLLAST  EQU   RPLCHN                                                   01771000
RPLMIDLE EQU   RPLCHN                                                   01772000
RPLFIRST EQU   RPLCHN                                                   01773000
@NM00015 EQU   RPLRTYPE                                                 01774000
RPLDFASY EQU   RPLRTYPE                                                 01775000
RPLNFSYN EQU   RPLRTYPE                                                 01776000
RPLRRESP EQU   RPLRTYPE                                                 01777000
@NM00014 EQU   RPLSTYPE                                                 01778000
RPLSRESP EQU   RPLSTYPE                                                 01779000
@NM00013 EQU   RPLRH3                                                   01780000
RPLCSI   EQU   RPLRH3                                                   01781000
RPLCHREQ EQU   RPLRH3                                                   01782000
RPLCMD   EQU   RPLRH3                                                   01783000
RPLEB    EQU   RPLRH3                                                   01784000
RPLBB    EQU   RPLRH3                                                   01785000
RPLSIGDA EQU   RPLVTEXT+32                                              01786000
RPLSAV13 EQU   RPLVTEXT+28                                              01787000
RPLUSNSO EQU   RPLOSENS+2                                               01788000
RPLSSMO  EQU   RPLSSNSO+1                                               01789000
@NM00012 EQU   RPLSSEO                                                  01790000
RPLRRO   EQU   RPLSSEO                                                  01791000
RPLFIO   EQU   RPLSSEO                                                  01792000
RPLSTATO EQU   RPLSSEO                                                  01793000
RPLCPMO  EQU   RPLSSEO                                                  01794000
@NM00011 EQU   RPLSSEO                                                  01795000
RPLFMHDR EQU   RPLOPT12                                                 01796000
@NM00010 EQU   RPLOPT12                                                 01797000
@NM00009 EQU   RPLOPT12                                                 01798000
@NM00008 EQU   RPLOPT12                                                 01799000
RPLNIBTK EQU   RPLOPT12                                                 01800000
RPLTRUNC EQU   RPLOPT12                                                 01801000
RPLKEEP  EQU   RPLOPT12                                                 01802000
@NM00007 EQU   RPLOPT12                                                 01803000
RPLRSVE8 EQU   RPLOPT11                                                 01804000
RPLRSVE7 EQU   RPLOPT11                                                 01805000
RPLRSVE6 EQU   RPLOPT11                                                 01806000
RPLRSVE5 EQU   RPLOPT11                                                 01807000
RPLRSVE4 EQU   RPLOPT11                                                 01808000
RPLSTOP  EQU   RPLOPT11                                                 01809000
RPLSTART EQU   RPLOPT11                                                 01810000
RPLQUIES EQU   RPLOPT11                                                 01811000
RPLRSVI6 EQU   RPLOPT10                                                 01812000
RPLRSVI5 EQU   RPLOPT10                                                 01813000
RPLRSVI4 EQU   RPLOPT10                                                 01814000
RPLRSVI3 EQU   RPLOPT10                                                 01815000
RPLTSKY  EQU   RPLOPT10                                                 01816000
RPLSPARM EQU   RPLOPT10                                                 01817000
RPLDSPLY EQU   RPLOPT10                                                 01818000
RPLBSCID EQU   RPLOPT10                                                 01819000
RPLTOPL  EQU   RPLOPT9                                                  01820000
RPLCIDE  EQU   RPLOPT9                                                  01821000
RPLRNNM  EQU   RPLOPT9                                                  01822000
RPLAPPST EQU   RPLOPT9                                                  01823000
RPLCOUNT EQU   RPLOPT9                                                  01824000
RPLTERMS EQU   RPLOPT9                                                  01825000
RPLDEVCH EQU   RPLOPT9                                                  01826000
RPLLOGON EQU   RPLOPT9                                                  01827000
RPLUSFLD EQU   RPLVTEXT+16                                              01828000
RPLESR2  EQU   RPLUSNSI+1                                               01829000
RPLESR1  EQU   RPLUSNSI                                                 01830000
RPLSSMI  EQU   RPLDSB2                                                  01831000
@NM00006 EQU   RPLSSEI                                                  01832000
RPLRRI   EQU   RPLSSEI                                                  01833000
RPLFII   EQU   RPLSSEI                                                  01834000
RPLSTATI EQU   RPLSSEI                                                  01835000
RPLCPMI  EQU   RPLSSEI                                                  01836000
RPLPATHI EQU   RPLSSEI                                                  01837000
RPLARCLN EQU   RPLVTEXT+8                                               01838000
RPLAARLN EQU   RPLVTEXT+4                                               01839000
RPLAAREA EQU   RPLVTEXT                                                 01840000
RPLERMSA EQU   RPLCOMN+72                                               01841000
RPLEMLEN EQU   RPLCOMN+70                                               01842000
RPLACTIV EQU   RPLCOMN+69                                               01843000
RPLBRANC EQU   RPLEXTD1                                                 01844000
RPLNIB   EQU   RPLEXTD1                                                 01845000
RPLTCRYP EQU   RPLEXTD1                                                 01846000
@NM00005 EQU   RPLEXTD1                                                 01847000
RPLEXIT  EQU   RPLEXTD1                                                 01848000
RPLNEXIT EQU   RPLEXTD1                                                 01849000
RPLEXSCH EQU   RPLEXTD1                                                 01850000
RPLDDDD  EQU   RPLRBAR+4                                                01851000
@NM00004 EQU   RPLRBAR+3                                                01852000
@NM00003 EQU   RPLAIXID                                                 01853000
RPLAXPKP EQU   RPLAIXID                                                 01854000
RPLAIXPC EQU   RPLRBAR                                                  01855000
RPLRSV88 EQU   RPLOPT8                                                  01856000
RPLUNCON EQU   RPLOPT8                                                  01857000
RPLACTV  EQU   RPLOPT8                                                  01858000
RPLSESS  EQU   RPLOPT8                                                  01859000
RPLPEND  EQU   RPLOPT8                                                  01860000
RPLODPRM EQU   RPLOPT8                                                  01861000
RPLODACP EQU   RPLOPT8                                                  01862000
RPLODACQ EQU   RPLOPT8                                                  01863000
RPLRSV78 EQU   RPLOPT7                                                  01864000
RPLTCRNO EQU   RPLOPT7                                                  01865000
RPLRLSOP EQU   RPLOPT7                                                  01866000
RPLTPOST EQU   RPLOPT7                                                  01867000
RPLQOPT  EQU   RPLOPT7                                                  01868000
RPLCNIMM EQU   RPLCNOPT                                                 01869000
RPLCNANY EQU   RPLCNOPT                                                 01870000
RPLCNALL EQU   RPLCNOPT                                                 01871000
RPLRSV68 EQU   RPLOPT6                                                  01872000
RPLRSV67 EQU   RPLOPT6                                                  01873000
RPLLOCK  EQU   RPLOPT6                                                  01874000
RPLNCOND EQU   RPLOPT6                                                  01875000
RPLCOND  EQU   RPLOPT6                                                  01876000
RPLEOT   EQU   RPLUNTYP                                                 01877000
RPLEOM   EQU   RPLUNTYP                                                 01878000
RPLEOB   EQU   RPLUNTYP                                                 01879000
RPLWROPT EQU   RPLOPT5                                                  01880000
RPLNODE  EQU   RPLOPT5                                                  01881000
RPLERACE EQU   RPLWRTYP                                                 01882000
RPLEAU   EQU   RPLWRTYP                                                 01883000
RPLNERAS EQU   RPLWRTYP                                                 01884000
RPLPSOPT EQU   RPLOPT5                                                  01885000
@NM00002 EQU   RPLOPT5                                                  01886000
RPLDLGIN EQU   RPLOPT5                                                  01887000
RPLBUFL  EQU   RPLCOMN+52                                               01888000
RPLRLEN  EQU   RPLCOMN+48                                               01889000
RPLCHAIN EQU   RPLNXTRP                                                 01890000
@NM00001 EQU   RPLOPT4                                                  01891000
RPLMKFRM EQU   RPLOPT4                                                  01892000
RPLENDTR EQU   RPLOPT4                                                  01893000
RPLALIGN EQU   RPLOPT3                                                  01894000
RPLFMT   EQU   RPLOPT3                                                  01895000
RPLFLD   EQU   RPLOPT3                                                  01896000
RPLVFY   EQU   RPLOPT3                                                  01897000
RPLBLK   EQU   RPLOPT3                                                  01898000
RPLSFORM EQU   RPLOPT3                                                  01899000
RPLEODS  EQU   RPLOPT3                                                  01900000
RPLNSP   EQU   RPLOPT2                                                  01901000
RPLUPD   EQU   RPLOPT2                                                  01902000
RPLWAITX EQU   RPLOPT2                                                  01903000
RPLLRD   EQU   RPLOPT2                                                  01904000
RPLBWD   EQU   RPLOPT2                                                  01905000
RPLCNV   EQU   RPLOPT2                                                  01906000
RPLADD   EQU   RPLADR                                                   01907000
RPLKEY   EQU   RPLOPT2                                                  01908000
RPLECBIN EQU   RPLECBSW                                                 01909000
RPLGEN   EQU   RPLOPT1                                                  01910000
RPLKGE   EQU   RPLOPT1                                                  01911000
RPLASY   EQU   RPLOPT1                                                  01912000
RPLSKP   EQU   RPLOPT1                                                  01913000
RPLSEQ   EQU   RPLOPT1                                                  01914000
RPLDIR   EQU   RPLOPT1                                                  01915000
RPLLOC   EQU   RPLOPT1                                                  01916000
RPLDAF   EQU   RPLARG+2                                                 01917000
RPLSAF   EQU   RPLARG                                                   01918000
RPLTCBPT EQU   RPLCOMN+28                                               01919000
RPLDACB  EQU   RPLCOMN+24                                               01920000
RPLCCHAR EQU   RPLCOMN+20                                               01921000
RPLSTRID EQU   RPLCOMN+18                                               01922000
RPLKEYL  EQU   RPLKEYLE                                                 01923000
RPLRDSOH EQU   RPLFDB3                                                  01924000
RPLRLG   EQU   RPLFDB3                                                  01925000
RPLLGFRC EQU   RPLFDB3                                                  01926000
RPLREOT  EQU   RPLFDB3                                                  01927000
RPLREOM  EQU   RPLFDB3                                                  01928000
RPLREOB  EQU   RPLFDB3                                                  01929000
RPLSV32  EQU   RPLFDB3                                                  01930000
RPLUINPT EQU   RPLFDB3                                                  01931000
RPLSTSAV EQU   RPLFDB2                                                  01932000
RPLCUERR EQU   RPLFDB2                                                  01933000
RPLDLGFL EQU   RPLFDB2                                                  01934000
RPLIOERR EQU   RPLFDB2                                                  01935000
RPLDVUNS EQU   RPLFDB2                                                  01936000
RPLATND  EQU   RPLFDB2                                                  01937000
RPLRVID  EQU   RPLFDB2                                                  01938000
RPLERLK  EQU   RPLFDB2                                                  01939000
RPLERREG EQU   RPLRTNCD                                                 01940000
RPLSTAT  EQU   RPLFDBWD                                                 01941000
RPLPOST  EQU   RPLEXITP                                                 01942000
RPLWAIT  EQU   RPLEXITP                                                 01943000
RPLPLHPT EQU   RPLCOMN+4                                                01944000
RPLLEN2  EQU   RPLLEN                                                   01945000
RPLREQ   EQU   RPLIDWD+2                                                01946000
RPLSTYP  EQU   RPLIDWD+1                                                01947000
RPLID    EQU   RPLIDWD                                                  01948000
@NM00079 EQU   PSA+3668                                                 01949000
PSASTAK  EQU   PSA+3072                                                 01950000
@NM00078 EQU   PSA+1048                                                 01951000
PSAUSEND EQU   PSA+1048                                                 01952000
PSARV062 EQU   PSA+1044                                                 01953000
PSACDAL  EQU   PSA+1040                                                 01954000
PSAWTCOD EQU   PSA+1036                                                 01955000
PSAATCVT EQU   PSA+1032                                                 01956000
PSAPCPSW EQU   PSA+1024                                                 01957000
PSAPIR2  EQU   PSA+1020                                                 01958000
PSARV059 EQU   PSA+1018                                                 01959000
PSASVC13 EQU   PSA+1016                                                 01960000
PSALSFCC EQU   PSA+1012                                                 01961000
PSASFACC EQU   PSA+1008                                                 01962000
PSASTOP  EQU   PSA+992                                                  01963000
PSASTART EQU   PSA+976                                                  01964000
PSARSPSW EQU   PSA+968                                                  01965000
PSASRPSW EQU   PSA+960                                                  01966000
PSARV045 EQU   PSA+892                                                  01967000
PSARV044 EQU   PSA+888                                                  01968000
PSARV043 EQU   PSA+884                                                  01969000
PSARV042 EQU   PSA+880                                                  01970000
PSARV041 EQU   PSA+876                                                  01971000
PSARV040 EQU   PSA+872                                                  01972000
PSARV025 EQU   PSA+868                                                  01973000
PSADSSED EQU   PSA+868                                                  01974000
PSADSSPR EQU   PSA+864                                                  01975000
PSADSSFW EQU   PSA+860                                                  01976000
PSADSS14 EQU   PSA+856                                                  01977000
PSADSSPP EQU   PSA+848                                                  01978000
PSADSSRP EQU   PSA+840                                                  01979000
PSADSS05 EQU   PSADSSF4                                                 01980000
PSADSS10 EQU   PSADSSF4                                                 01981000
PSADSSVE EQU   PSADSSF4                                                 01982000
PSADSSDE EQU   PSADSSF4                                                 01983000
PSADSSC0 EQU   PSADSSF4                                                 01984000
PSADSSIE EQU   PSADSSF4                                                 01985000
PSADSS12 EQU   PSADSSF4                                                 01986000
PSADSSRC EQU   PSADSSF4                                                 01987000
PSARV057 EQU   PSADSSF3                                                 01988000
PSARV056 EQU   PSADSSF3                                                 01989000
PSARV055 EQU   PSADSSF3                                                 01990000
PSADSSMC EQU   PSADSSF3                                                 01991000
PSADSSRW EQU   PSADSSF3                                                 01992000
PSADSSNM EQU   PSADSSF3                                                 01993000
PSADSSES EQU   PSADSSF3                                                 01994000
PSADSSGP EQU   PSADSSF3                                                 01995000
PSADSSF2 EQU   PSADSSFL+1                                               01996000
PSADSSPI EQU   PSADSSF1                                                 01997000
PSADSSOI EQU   PSADSSF1                                                 01998000
PSADSSSP EQU   PSADSSF1                                                 01999000
PSADSSTP EQU   PSADSSF1                                                 02000000
PSADSSDW EQU   PSADSSF1                                                 02001000
PSADSSDD EQU   PSADSSF1                                                 02002000
PSADSSDM EQU   PSADSSF1                                                 02003000
PSADSSMV EQU   PSADSSF1                                                 02004000
PSADSSTS EQU   PSA+816                                                  02005000
PSADSSWK EQU   PSA+812                                                  02006000
PSADSSR3 EQU   PSA+808                                                  02007000
PSADSSR2 EQU   PSA+804                                                  02008000
PSADSSRS EQU   PSA+800                                                  02009000
PSASTOR  EQU   PSA+796                                                  02010000
PSACPUSA EQU   PSA+794                                                  02011000
PSAVSTAP EQU   PSA+792                                                  02012000
PSAWKVAP EQU   PSA+788                                                  02013000
PSAWKRAP EQU   PSA+784                                                  02014000
PSAMCHIC EQU   PSA+783                                                  02015000
PSARV061 EQU   PSA+782                                                  02016000
PSASYMSK EQU   PSA+781                                                  02017000
PSAMCHFL EQU   PSA+780                                                  02018000
PSACR0   EQU   PSA+776                                                  02019000
PSAPSWSV EQU   PSA+768                                                  02020000
PSALITA  EQU   PSA+764                                                  02021000
PSACLHS  EQU   PSAHLHI                                                  02022000
PSALKR15 EQU   PSALKSA+60                                               02023000
PSALKR14 EQU   PSALKSA+56                                               02024000
PSALKR13 EQU   PSALKSA+52                                               02025000
PSALKR12 EQU   PSALKSA+48                                               02026000
PSALKR11 EQU   PSALKSA+44                                               02027000
PSALKR10 EQU   PSALKSA+40                                               02028000
PSALKR9  EQU   PSALKSA+36                                               02029000
PSALKR8  EQU   PSALKSA+32                                               02030000
PSALKR7  EQU   PSALKSA+28                                               02031000
PSALKR6  EQU   PSALKSA+24                                               02032000
PSALKR5  EQU   PSALKSA+20                                               02033000
PSALKR4  EQU   PSALKSA+16                                               02034000
PSALKR3  EQU   PSALKSA+12                                               02035000
PSALKR2  EQU   PSALKSA+8                                                02036000
PSALKR1  EQU   PSALKSA+4                                                02037000
PSALKR0  EQU   PSALKSA                                                  02038000
PSARV023 EQU   PSACLHT+52                                               02039000
PSALOCAL EQU   PSACLHT+48                                               02040000
PSACMSL  EQU   PSACLHT+44                                               02041000
PSAOPTL  EQU   PSACLHT+40                                               02042000
PSATPACL EQU   PSACLHT+36                                               02043000
PSATPDNL EQU   PSACLHT+32                                               02044000
PSATPNCL EQU   PSACLHT+28                                               02045000
PSAIOSLL EQU   PSACLHT+24                                               02046000
PSAIOSUL EQU   PSACLHT+20                                               02047000
PSAIOSCL EQU   PSACLHT+16                                               02048000
PSAIOSSL EQU   PSACLHT+12                                               02049000
PSASALCL EQU   PSACLHT+8                                                02050000
PSAASML  EQU   PSACLHT+4                                                02051000
PSADISPL EQU   PSACLHT                                                  02052000
PSASRSA  EQU   PSA+636                                                  02053000
PSARV050 EQU   PSA+634                                                  02054000
PSADSSGO EQU   PSA+633                                                  02055000
PSARECUR EQU   PSA+632                                                  02056000
PSAHLHIS EQU   PSA+628                                                  02057000
PSAIPCSA EQU   PSA+624                                                  02058000
@NM00077 EQU   PSA+621                                                  02059000
PSAIPCDM EQU   PSA+620                                                  02060000
PSAIPCD  EQU   PSA+616                                                  02061000
@NM00076 EQU   PSA+613                                                  02062000
PSAIPCRM EQU   PSA+612                                                  02063000
PSAIPCR  EQU   PSA+608                                                  02064000
PSAMCHEX EQU   PSA+600                                                  02065000
PSAMPSW  EQU   PSA+592                                                  02066000
PSAEXPS2 EQU   PSA+584                                                  02067000
PSAEXPS1 EQU   PSA+576                                                  02068000
PSAPIREG EQU   PSA+572                                                  02069000
PSARSREG EQU   PSA+568                                                  02070000
PSAGPREG EQU   PSA+556                                                  02071000
PSARV022 EQU   PSASUP4                                                  02072000
PSARV021 EQU   PSASUP4                                                  02073000
PSARV020 EQU   PSASUP4                                                  02074000
PSARV019 EQU   PSASUP4                                                  02075000
PSARV018 EQU   PSASUP4                                                  02076000
PSARV017 EQU   PSASUP4                                                  02077000
PSARV016 EQU   PSASUP4                                                  02078000
PSARV015 EQU   PSASUP4                                                  02079000
PSARV014 EQU   PSASUP3                                                  02080000
PSARV013 EQU   PSASUP3                                                  02081000
PSARV012 EQU   PSASUP3                                                  02082000
PSARV011 EQU   PSASUP3                                                  02083000
PSASPR   EQU   PSASUP3                                                  02084000
PSAPSREG EQU   PSASUP3                                                  02085000
PSAPI2   EQU   PSASUP3                                                  02086000
PSAIOSUP EQU   PSASUP3                                                  02087000
PSALCR   EQU   PSASUP2                                                  02088000
PSARTM   EQU   PSASUP2                                                  02089000
PSAACR   EQU   PSASUP2                                                  02090000
PSAIPCE2 EQU   PSASUP2                                                  02091000
PSAIPCES EQU   PSASUP2                                                  02092000
PSAIPCEC EQU   PSASUP2                                                  02093000
PSAGTF   EQU   PSASUP2                                                  02094000
PSAIPCRI EQU   PSASUP2                                                  02095000
PSARV063 EQU   PSASUP1                                                  02096000
PSATCTL  EQU   PSASUP1                                                  02097000
PSADISP  EQU   PSASUP1                                                  02098000
PSALOCK  EQU   PSASUP1                                                  02099000
PSAPI    EQU   PSASUP1                                                  02100000
PSAEXT   EQU   PSASUP1                                                  02101000
PSASVC   EQU   PSASUP1                                                  02102000
PSAIO    EQU   PSASUP1                                                  02103000
PSAANEW  EQU   PSA+544                                                  02104000
PSATOLD  EQU   PSA+540                                                  02105000
PSATNEW  EQU   PSA+536                                                  02106000
PSALCCAR EQU   PSA+532                                                  02107000
PSALCCAV EQU   PSA+528                                                  02108000
PSAPCCAR EQU   PSA+524                                                  02109000
PSAPCCAV EQU   PSA+520                                                  02110000
PSACPULA EQU   PSA+518                                                  02111000
PSACPUPA EQU   PSA+516                                                  02112000
PSAPSA   EQU   PSA+512                                                  02113000
FLCHDEND EQU   PSA+512                                                  02114000
FLCCRSAV EQU   FLCMCLA+280                                              02115000
FLCGRSAV EQU   FLCMCLA+216                                              02116000
FLCFPSAV EQU   FLCMCLA+184                                              02117000
FLCFLA   EQU   FLCMCLA+88                                               02118000
FLCRGNCD EQU   FLCMCLA+84                                               02119000
FLCFSAA  EQU   FLCFSA+1                                                 02120000
@NM00075 EQU   FLCFSA                                                   02121000
@NM00074 EQU   FLCMCLA+72                                               02122000
FLCMCIC  EQU   FLCMCLA+64                                               02123000
@NM00073 EQU   FLCMCLA+20                                               02124000
FLCIOAA  EQU   FLCIOA+1                                                 02125000
@NM00072 EQU   FLCIOA                                                   02126000
@NM00071 EQU   FLCMCLA+15                                               02127000
@NM00070 EQU   FLCMCLA+14                                               02128000
@NM00069 EQU   FLCMCLA+12                                               02129000
FLCLCL   EQU   FLCMCLA+8                                                02130000
FLCIOELA EQU   FLCIOEL+1                                                02131000
@NM00068 EQU   FLCIOEL                                                  02132000
FLCCHNID EQU   FLCMCLA                                                  02133000
@NM00067 EQU   PSA+160                                                  02134000
FLCMTRCD EQU   PSA+157                                                  02135000
@NM00066 EQU   PSA+156                                                  02136000
FLCPERA  EQU   FLCPER+1                                                 02137000
@NM00065 EQU   FLCPER                                                   02138000
@NM00064 EQU   PSA+151                                                  02139000
FLCPERCD EQU   PSA+150                                                  02140000
FLCMCNUM EQU   PSA+149                                                  02141000
@NM00063 EQU   PSA+148                                                  02142000
FLCTEAA  EQU   FLCTEA+1                                                 02143000
@NM00062 EQU   FLCTEA                                                   02144000
PSAPIPC  EQU   PSAPICOD                                                 02145000
PSAPIMC  EQU   PSAPICOD                                                 02146000
PSAPIPER EQU   PSAPICOD                                                 02147000
PSARV049 EQU   FLCPICOD                                                 02148000
FLCPILCB EQU   FLCPIILC                                                 02149000
@NM00061 EQU   FLCPIILC                                                 02150000
@NM00060 EQU   PSAEPPSW                                                 02151000
FLCSVCN  EQU   PSAESPSW+2                                               02152000
FLCSILCB EQU   FLCSVILC                                                 02153000
@NM00059 EQU   FLCSVILC                                                 02154000
@NM00058 EQU   PSAESPSW                                                 02155000
FLCEICOD EQU   PSAEEPSW+2                                               02156000
PSASPAD  EQU   PSAEEPSW                                                 02157000
@NM00057 EQU   PSA+128                                                  02158000
FLCINPSW EQU   PSA+120                                                  02159000
FLCMNPSW EQU   PSA+112                                                  02160000
FLCPNPSW EQU   PSA+104                                                  02161000
FLCSNPSW EQU   PSA+96                                                   02162000
FLCENPSW EQU   PSA+88                                                   02163000
FLCTRACE EQU   PSA+84                                                   02164000
FLCTIMER EQU   PSA+80                                                   02165000
FLCCVT2  EQU   PSA+76                                                   02166000
FLCCAW   EQU   PSA+72                                                   02167000
FLCCSW   EQU   PSA+64                                                   02168000
FLCIOPSW EQU   PSA+56                                                   02169000
FLCMOPSW EQU   PSA+48                                                   02170000
FLCPOPSW EQU   PSA+40                                                   02171000
FLCSOPSW EQU   PSA+32                                                   02172000
FLCEOPSW EQU   PSA+24                                                   02173000
@NM00056 EQU   FLCICCW2+4                                               02174000
FLCCVT   EQU   FLCICCW2                                                 02175000
FLCICCW1 EQU   FLCROPSW                                                 02176000
FLCIPPSW EQU   FLCRNPSW                                                 02177000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02178000
@RC00164 EQU   @RC00141                                                 02179000
@ENDDATA EQU   *                                                        02180000
         END   IKTIST00,(C'PLS1022',0702,78336)                         02181000
