         TITLE 'ISTAPC64-ABEND CLEANUP INTERFACE ROUTINE'               00001000
ISTAPC64 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTAPC64  78.336'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @08,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@08                                         0001 00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
         PRINT OFF                                                      00014000
         PRINT ON                                                       00015000
*                                                                  0225 00016000
*           DO; /* LISATCVT CVTBASE(PAGEABLE,(ATCVTREG)) */        0226 00017000
*             ATCVTREG = ATCLCPTR; /*SET UP ATCVT POINTER*/        0227 00018000
         L     ATCVTREG,ATCLCPTR                                   0227 00019000
*           END; /*LISATCVT*/                                      0228 00020000
*          REG4=CRAREG;                 /*GET ADDR OF CRA FOR APC33 */  00021000
         LR    REG4,CRAREG                                         0229 00022000
*RFY ISTCRA BASED(REG4);                                           0230 00023000
*LKLOOP:   REG0='00000001'X;            /*INITLZ MASK REG FOR APC33 */  00024000
LKLOOP   LA    REG0,1                                              0231 00025000
*          LEVELREG=CRALKACT;           /*INITLZ DOWHIL REG FOR LOOP*/  00026000
         L     LEVELREG,CRALKACT(,REG4)                            0232 00027000
*          REG3=ADDR(CRAL1PTR);         /*INITLZ PTR TO LOK PTR WORD*/  00028000
         LA    REG3,CRAL1PTR(,REG4)                                0233 00029000
*          RPHREG=ADDR(CRARPH);         /*GET ADDR OF RPH           */  00030000
         LA    RPHREG,CRARPH(,REG4)                                0234 00031000
*/*DOW01*/ DO WHILE(LEVELREG^=0);       /*LOOP TILL ALL LOKS UNLOKED*/  00032000
         B     @DE00235                                            0235 00033000
@DL00235 DS    0H                                                  0236 00034000
*            IF (LEVELREG & '00000001'X) ^= 0   /* THIS LEVEL LOKED */  00035000
*            THEN                               /* YES */          0236 00036000
         SLR   @06,@06                                             0236 00037000
         LR    @05,LEVELREG                                        0236 00038000
         N     @05,@CF01196                                        0236 00039000
         CLR   @05,@06                                             0236 00040000
         BE    @RF00236                                            0236 00041000
*/*TGPR03*/      DO;                                               0237 00042000
*              REG2=LOKPTRWD;           /*ACCESS LOK PTR WORD IN CRA*/  00043000
         L     REG2,LOKPTRWD(,REG3)                                0238 00044000
*              IF REG2<0                /*IS IT A MULTI-LEVEL LOCK  */  00045000
*              THEN;                    /* YES */                  0239 00046000
         CR    REG2,@06                                            0239 00047000
         BL    @RT00239                                            0239 00048000
*              ELSE                     /* NO  */                  0241 00049000
*/*ELS04*/       DO;                                               0241 00050000
*/**/                                                              0242 00051000
*/* GPR15 NOT SAVED AS TPUNLOCK USES RPHSAV16*/                    0242 00052000
*/**/                                                              0242 00053000
*                STM (GPR0,GPR14,RPHWORK);                         0242 00054000
*                                                                  0242 00055000
         STM   GPR0,GPR14,RPHWORK(RPHREG)                          0242 00056000
*                 DO; /* LISATCVT CVTBASE(PAGEABLE,(ATCVTREG)) */  0243 00057000
*                   ATCVTREG = ATCLCPTR; /*SET UP ATCVT POINTER*/  0244 00058000
         L     ATCVTREG,ATCLCPTR                                   0244 00059000
*                 END; /*LISATCVT*/                                0245 00060000
*                GPR15=ATCVTREG->ATCAP33;                          0246 00061000
         L     GPR15,ATCAP33(,ATCVTREG)                            0246 00062000
*                CALL APC33;            /*CALL UNLOCK ROUTINE       */  00063000
         BALR  @14,@15                                             0247 00064000
*                LM (GPR0,GPR14,RPHWORK);                          0248 00065000
         LM    GPR0,GPR14,RPHWORK(RPHREG)                          0248 00066000
*/*END ELS04*/   END;                                              0249 00067000
*/*END TRO3*/  END;                                                0250 00068000
*            ELSE;                                                 0251 00069000
@RF00236 DS    0H                                                  0252 00070000
*            REG0=REG0*2;               /*SHIFT MASK WORD LEFT ONE  */  00071000
@RC00236 ALR   REG0,REG0                                           0252 00072000
*            REG3=REG3+4;               /*UPDATE PTR TO LOK PTR WORD*/  00073000
         AL    REG3,@CF00053                                       0253 00074000
*            LEVELREG=LEVELREG/2;       /*SHIFT LOOP REG RIGHT ONE  */  00075000
         SRL   LEVELREG,1                                          0254 00076000
*/*END DOW01*/ END;                                                0255 00077000
@DE00235 SLR   @06,@06                                             0255 00078000
         CLR   LEVELREG,@06                                        0255 00079000
         BNE   @DL00235                                            0255 00080000
*/********************************************************************/ 00081000
*/* A CHECK IS MADE FOR THE LOCK ACCOUNTING WORD TO BE ZERO. IF NOT, */ 00082000
*/* THE MODULE BRANCHES BACK TO UNLOCK ANY LOCKS WHICH HAVE BEEN     */ 00083000
*/* SUBSEQUENLY LOCKED.  IF THE LOCK ACCOUNTING WORD IS ZERO, THEN   */ 00084000
*/* A CHECK IS MADE OF A BIT (RPHRLCRA) INDICATING THAT THE CRA MAY  */ 00085000
*/* BE FREED.  IF ON, RELSTORE MACRO IS ISSUED TO FREE CRA.   IF OFF,*/ 00086000
*/* THE RPH IS MARKED PURGE-COMPLETE, INDICATING TO ISTAPC33 THAT    */ 00087000
*/* ALL CURRENTLY HELD LOCKS HAVE BEEN FREED.  RETURN IS MADE TO THE */ 00088000
*/* CALLER.                                                          */ 00089000
*/********************************************************************/ 00090000
*    RFY (GPR0,APCREG) UNRSTD;                                     0256 00091000
*    RFY (COMP,SWAP,MPSTPTR) RSTD;                                 0257 00092000
*    COMP=RPHCNTL;   /*PICK UP FLAG FIELD FOR SETTING PURGE COMPLETE*/  00093000
         L     COMP,RPHCNTL(,RPHREG)                               0258 00094000
*    IF CRALKACT^=0  /*IF ANY NEW LOCK  HELD   */                  0259 00095000
*    THEN GO TO LKLOOP; /*START OVER AND UNLOCK IT */              0259 00096000
         SLR   @05,@05                                             0259 00097000
         CL    @05,CRALKACT(,REG4)                                 0259 00098000
         BNE   @RT00259                                            0259 00099000
*    ELSE DO;         /*ELSE SEE IF RPH HAS BEEN POSTED */         0261 00100000
*PGLOOP: IF RPHRLCRA = ONCON   /*IF ALREADY  POSTED */             0262 00101000
*    THEN DO;    /*THEN PREPARE FOR RELEASING CRA */               0262 00102000
PGLOOP   TM    RPHRLCRA(RPHREG),B'00000100'                        0262 00103000
         BNO   @RF00262                                            0262 00104000
*      RFY ISTMPST BASED(MPSTPTR);                                 0264 00105000
*      MPSTPTR=PSAAOLD->ASCBASXB->ASXBMPST; /*GET MPST ADDR */     0265 00106000
         L     @05,PSAAOLD                                         0265 00107000
         L     @05,ASCBASXB(,@05)                                  0265 00108000
         L     MPSTPTR,ASXBMPST(,@05)                              0265 00109000
*      IF MPSTPTR=0 THEN;  /*NO MPST, CAN'T DO RELSTORE */         0266 00110000
         LTR   MPSTPTR,MPSTPTR                                     0266 00111000
         BZ    @RT00266                                            0266 00112000
*      ELSE DO;          /*ELSE, USE MPST SAVE AREA */             0268 00113000
*      GPR3=GPR14;       /*SAVE RETURN ADDRESS ACROSS SETLOCK */   0269 00114000
         LR    GPR3,GPR14                                          0269 00115000
*      /*SETLOCK WILL DESTROY REGS 14,15,0,1.  ON RETURN, REG15    0270 00116000
*        WILL CONTAIN RETURN CODE=0 IF APC64 IS FIRST OWNER OF LOCK*/   00117000
*       LOCKST:  GEN   REFS(GPR0,GPR1,GPR14,GPR15,PSALITA,FLC);    0270 00118000
LOCKST   DS    0H                                                  0270 00119000
        SETLOCK OBTAIN,TYPE=LOCAL,REGS=USE,MODE=UNCOND,                X00120000
               RELATED=(ISTAPC64(UNLKST))                               00121000
*      GPR14=GPR3;     /*RESTORE RETURN ADDR */                    0271 00122000
         LR    GPR14,GPR3                                          0271 00123000
*      STM (GPR8,GPR15,MPSSAVE);    /*SAVE REGISTERS IN MPST SAVE */    00124000
         STM   GPR8,GPR15,MPSSAVE(MPSTPTR)                         0272 00125000
*      GPR11=MPSTPTR;  /*SAVE MPST ADDR ACROSS RELSTORE         */ 0273 00126000
         LR    GPR11,MPSTPTR                                       0273 00127000
*            /*RELSTORE DESTROYS REGS 14-0,2-10      */            0274 00128000
*       DO; /* RELSTORE  BUFADDR(REG4)SAVE(NO) */                  0274 00129000
*       /*RELSTORE BUFADDR(REG4)SAVE(NO)*/                         0275 00130000
*        DO;                                                       0275 00131000
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  0276 00132000
*/* END OF ATBUILD */                                              0276 00133000
*                                                                  0276 00134000
*       DO;                                                        0276 00135000
*       END;                                                       0277 00136000
*                                                                  0278 00137000
*       DO;                                                        0278 00138000
*       RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                    0279 00139000
*       END;                                                       0280 00140000
*         GPR04P=REG4;                                             0281 00141000
*         DCL 1 FMZA0013 FIXED(31) STATIC LOCAL,                   0282 00142000
*             2 * FIXED(8) INIT(0),                                0282 00143000
*             2 * PTR(24) INIT(0);                                 0282 00144000
*         GPR03F = FMZA0013;                                       0283 00145000
*                                                                  0283 00146000
         L     GPR03F,FMZA0013                                     0283 00147000
*       DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */              0284 00148000
*         GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/              0285 00149000
         L     GPR15P,ATCLCPTR                                     0285 00150000
*       END; /*LISATCVT*/                                          0286 00151000
*         GPR02P = GPR15P->ATCBPDA;                                0287 00152000
         L     GPR02P,ATCBPDA(,GPR15P)                             0287 00153000
*         GPR15P=GPR15P->ATCSMRS;                                  0288 00154000
         L     GPR15P,ATCSMRS(,GPR15P)                             0288 00155000
*         DCL FMZL0013 BASED(GPR15P) LABEL VALUERANGE(*);          0289 00156000
*         CALL FMZL0013;                                           0290 00157000
*                                                                  0290 00158000
         BALR  @14,@15                                             0290 00159000
*       DO;                                                        0291 00160000
*       RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                  0292 00161000
*       END;                                                       0293 00162000
*                                                                  0294 00163000
*       END ;                                                      0294 00164000
*                                                                  0294 00165000
*       END;/* RELSTORE */ /*FREE THE CRA     @ZM42163*/           0295 00166000
*      MPSTPTR=GPR11; /*RESTORE MPST ADDR AFTER RELSTORE  */       0296 00167000
         LR    MPSTPTR,GPR11                                       0296 00168000
*     LM (GPR8,GPR15,MPSSAVE); /*RESTORE REGS FROM MPST SAVE */    0297 00169000
         LM    GPR8,GPR15,MPSSAVE(MPSTPTR)                         0297 00170000
*     IF GPR15=0     /*IF APC64 IS 1ST OWNER OF MEMORY LOCK, THEN  0298 00171000
*                      APC64 SHOULD RELEASE IT */                  0298 00172000
*      THEN DO;                                                    0298 00173000
         LTR   GPR15,GPR15                                         0298 00174000
         BNZ   @RF00298                                            0298 00175000
*      GPR3=GPR14; /*SAVE RETURN REG ACROSS SETLOCK MACRO */       0300 00176000
         LR    GPR3,GPR14                                          0300 00177000
*   UNLKST: GEN REFS(GPR0,GPR1,GPR14,GPR15,PSALITA,FLC);           0301 00178000
UNLKST   DS    0H                                                  0301 00179000
          SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                         X00180000
               RELATED=(ISTAPC64(LOCKST))                               00181000
*       GPR14=GPR3; /*RESTORE RETURN REG */                        0302 00182000
         LR    GPR14,GPR3                                          0302 00183000
*           END;  /*END APC64 SHOULD RELEASE LOCAL MEMORY LOCK */  0303 00184000
*       ELSE;     /*ELSE LOCK PREVIOUSLY HELD, LEAVE IT */         0304 00185000
@RF00298 DS    0H                                                  0305 00186000
*       END;  /*END USE MPST SAVE AREA */                          0305 00187000
*  END;      /*END RPH ALREADY POSTED */                           0306 00188000
*  ELSE DO; /*NOT POSTED, TURN ON PURGE COMPLETE */                0307 00189000
         B     @RC00262                                            0307 00190000
@RF00262 DS    0H                                                  0308 00191000
*    SWAP=COMP|'00000010'X; /*TURN ON PURGE COMPLETE IN REGISTER*/ 0308 00192000
         LR    SWAP,COMP                                           0308 00193000
         O     SWAP,@CF02583                                       0308 00194000
*    CS (COMP,SWAP,RPHCNTL); /*TRY TO TURN IN ON IN RPH */         0309 00195000
         CS    COMP,@07,RPHCNTL(RPHREG)                            0309 00196000
*    BC (7,PGLOOP);    /*IF FAIL, GO CHECK RPHRLCRA AGAIN */       0310 00197000
         BC    7,PGLOOP                                            0310 00198000
*    RFY (COMP,MPSTPTR,SWAP) UNRSTD;                               0311 00199000
*     DO; /* SMSID  BUFF(RPHCRR)TSKID(0) */                        0312 00200000
*      DCL 1 CMZ0036A PTR(31) BASED((RPHCRR)-8),                   0313 00201000
*            2 * BIT(8),                                           0313 00202000
*            2 CMZ0036 PTR(24);                                    0313 00203000
*          CMZ0036=(0);                                            0314 00204000
*                                                                  0314 00205000
         L     @06,RPHCRR(,RPHREG)                                 0314 00206000
         AL    @06,@CF02741                                        0314 00207000
         SLR   @05,@05                                             0314 00208000
         STCM  @05,7,CMZ0036-1(@06)                                0314 00209000
*     END;/* SMSID */ /*DISSOCIATE CRA FROM USER TASK */           0315 00210000
*  END;     /*END TURN ON PURGE COMPLETE */                        0316 00211000
* END;       /*END SEE IF RPH POSTED */                            0317 00212000
*                                                                  0317 00213000
@RC00262 DS    0H                                                  0318 00214000
* DO; /* TPEPILOG   */                                             0318 00215000
*                                                                  0319 00216000
* GEN (PRINT OFF);                                                 0319 00217000
*                                                                  0319 00218000
         PRINT OFF                                                      00219000
* DO;                                                              0320 00220000
* DCL GPR00F FIXED(31) REG(00),GPR00P PTR(31) REG(00),GPR01F FIXED(31)  00221000
*EG(01),GPR01P PTR(31) REG(01),GPR02F FIXED(31) REG(02),GPR02P PTR(31)  00222000
*EG(02),GPR03F FIXED(31) REG(03),GPR03P PTR(31) REG(03),GPR04F FIXED(31 00223000
* REG(04),GPR04P PTR(31) REG(04),GPR05F FIXED(31) REG(05),GPR05P PTR(31 00224000
* REG(05),GPR06F FIXED(31) REG(06),GPR06P PTR(31) REG(06),GPR07F FIXED( 00225000
*1) REG(07),GPR07P PTR(31) REG(07),GPR08F FIXED(31) REG(08),GPR08P PTR( 00226000
*1) REG(08),GPR09F FIXED(31) REG(09),GPR09P PTR(31) REG(09),GPR10F FIXE 00227000
*(31) REG(10),GPR10P PTR(31) REG(10),GPR11F FIXED(31) REG(11),GPR11P PT 00228000
*(31) REG(11),GPR12F FIXED(31) REG(12),GPR12P PTR(31) REG(12),GPR13F FI 00229000
*ED(31) REG(13),GPR13P PTR(31) REG(13),GPR14F FIXED(31) REG(14),GPR14P  00230000
*TR(31) REG(14),GPR15F FIXED(31) REG(15),GPR15P PTR(31) REG(15);   0321 00231000
* END;                                                             0322 00232000
*                                                                  0323 00233000
* GEN (PRINT ON);                                                  0323 00234000
         PRINT ON                                                       00235000
* END;/* TPEPILOG */                                               0324 00236000
*          END ISTAPC64                                            0325 00237000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00238000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00239000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00240000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 00241000
*/*%INCLUDE SYSLIB  (IHAASXB )                                        * 00242000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00243000
*;                                                                 0325 00244000
@EL00001 DS    0H                                                  0325 00245000
@EF00001 DS    0H                                                  0325 00246000
@ER00001 BR    @14                                                 0325 00247000
@DATA    DS    0H                                                       00248000
@DATD    DSECT                                                          00249000
         DS    0F                                                       00250000
ISTAPC64 CSECT                                                          00251000
         DS    0F                                                       00252000
@CF00053 DC    F'4'                                                     00253000
@CF02741 DC    F'-7'                                                    00254000
@CF01196 DC    XL4'00000001'                                            00255000
@CF02583 DC    XL4'00000010'                                            00256000
@DATD    DSECT                                                          00257000
         DS    0D                                                       00258000
CVTPTR   DS    A                                                        00259000
ASCBPTR  DS    A                                                        00260000
ASXBPTR  DS    A                                                        00261000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00262000
@ENDDATD EQU   *                                                        00263000
ISTAPC64 CSECT                                                          00264000
         DS    0F                                                       00265000
@SIZDATD DC    AL1(0)                                                   00266000
         DC    AL3(@ENDDATD-@DATD)                                      00267000
         DS    0D                                                       00268000
FMZA0013 DS    FL4                                                      00269000
         ORG   FMZA0013                                                 00270000
@NM00107 DC    AL1(0)                                                   00271000
@NM00108 DC    AL3(0)                                                   00272000
         ORG   FMZA0013+4                                               00273000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00274000
@01      EQU   01                                                       00275000
@02      EQU   02                                                       00276000
@03      EQU   03                                                       00277000
@04      EQU   04                                                       00278000
@05      EQU   05                                                       00279000
@06      EQU   06                                                       00280000
@07      EQU   07                                                       00281000
@08      EQU   08                                                       00282000
@09      EQU   09                                                       00283000
@10      EQU   10                                                       00284000
@11      EQU   11                                                       00285000
@12      EQU   12                                                       00286000
@13      EQU   13                                                       00287000
@14      EQU   14                                                       00288000
@15      EQU   15                                                       00289000
RPHPTR   EQU   @01                                                      00290000
GPR0     EQU   @00                                                      00291000
GPR1     EQU   @01                                                      00292000
RPHREG   EQU   @01                                                      00293000
CRAREG   EQU   @01                                                      00294000
APCREG   EQU   @02                                                      00295000
GPR3     EQU   @03                                                      00296000
REG3     EQU   @03                                                      00297000
REG4     EQU   @04                                                      00298000
COMP     EQU   @06                                                      00299000
MPSTPTR  EQU   @07                                                      00300000
SWAP     EQU   @07                                                      00301000
GPR8     EQU   @08                                                      00302000
GPR9     EQU   @09                                                      00303000
GPR10    EQU   @10                                                      00304000
GPR11    EQU   @11                                                      00305000
GPR12    EQU   @12                                                      00306000
GPR13    EQU   @13                                                      00307000
GPR14    EQU   @14                                                      00308000
GPR15    EQU   @15                                                      00309000
ATCVTREG EQU   @15                                                      00310000
REG2     EQU   @02                                                      00311000
REG0     EQU   @00                                                      00312000
LEVELREG EQU   @07                                                      00313000
GPR02P   EQU   @02                                                      00314000
GPR03P   EQU   @03                                                      00315000
GPR04P   EQU   @04                                                      00316000
GPR15P   EQU   @15                                                      00317000
GPR03F   EQU   @03                                                      00318000
GPR00F   EQU   @00                                                      00319000
GPR00P   EQU   @00                                                      00320000
GPR01F   EQU   @01                                                      00321000
GPR01P   EQU   @01                                                      00322000
GPR02F   EQU   @02                                                      00323000
GPR04F   EQU   @04                                                      00324000
GPR05F   EQU   @05                                                      00325000
GPR05P   EQU   @05                                                      00326000
GPR06F   EQU   @06                                                      00327000
GPR06P   EQU   @06                                                      00328000
GPR07F   EQU   @07                                                      00329000
GPR07P   EQU   @07                                                      00330000
GPR08F   EQU   @08                                                      00331000
GPR08P   EQU   @08                                                      00332000
GPR09F   EQU   @09                                                      00333000
GPR09P   EQU   @09                                                      00334000
GPR10F   EQU   @10                                                      00335000
GPR10P   EQU   @10                                                      00336000
GPR11F   EQU   @11                                                      00337000
GPR11P   EQU   @11                                                      00338000
GPR12F   EQU   @12                                                      00339000
GPR12P   EQU   @12                                                      00340000
GPR13F   EQU   @13                                                      00341000
GPR13P   EQU   @13                                                      00342000
GPR14F   EQU   @14                                                      00343000
GPR14P   EQU   @14                                                      00344000
GPR15F   EQU   @15                                                      00345000
PSA      EQU   0                                                        00346000
FLCRNPSW EQU   PSA                                                      00347000
FLCROPSW EQU   PSA+8                                                    00348000
FLCICCW2 EQU   PSA+16                                                   00349000
PSAEEPSW EQU   PSA+132                                                  00350000
PSAESPSW EQU   PSA+136                                                  00351000
FLCSVILC EQU   PSAESPSW+1                                               00352000
PSAEPPSW EQU   PSA+140                                                  00353000
FLCPIILC EQU   PSAEPPSW+1                                               00354000
FLCPICOD EQU   PSAEPPSW+2                                               00355000
PSAPICOD EQU   FLCPICOD+1                                               00356000
FLCTEA   EQU   PSAEPPSW+4                                               00357000
FLCPER   EQU   PSA+152                                                  00358000
FLCMCLA  EQU   PSA+168                                                  00359000
FLCIOEL  EQU   FLCMCLA+4                                                00360000
FLCIOA   EQU   FLCMCLA+16                                               00361000
FLCFSA   EQU   FLCMCLA+80                                               00362000
PSAAOLD  EQU   PSA+548                                                  00363000
PSASUPER EQU   PSA+552                                                  00364000
PSASUP1  EQU   PSASUPER                                                 00365000
PSASUP2  EQU   PSASUPER+1                                               00366000
PSASUP3  EQU   PSASUPER+2                                               00367000
PSASUP4  EQU   PSASUPER+3                                               00368000
PSACLHT  EQU   PSA+640                                                  00369000
PSALKSA  EQU   PSA+696                                                  00370000
PSAHLHI  EQU   PSA+760                                                  00371000
PSALITA  EQU   PSA+764                                                  00372000
PSADSSFL EQU   PSA+836                                                  00373000
PSADSSF1 EQU   PSADSSFL                                                 00374000
PSADSSF3 EQU   PSADSSFL+2                                               00375000
PSADSSF4 EQU   PSADSSFL+3                                               00376000
PSARSVT  EQU   PSA+896                                                  00377000
ATCLCPTR EQU   1032                                                     00378000
CVTMAP   EQU   0                                                        00379000
CVTDAR   EQU   CVTMAP+72                                                00380000
CVTFLGS1 EQU   CVTDAR                                                   00381000
CVTDCB   EQU   CVTMAP+116                                               00382000
CVTIERLC EQU   CVTMAP+144                                               00383000
CVTOPTA  EQU   CVTMAP+182                                               00384000
CVTOPTB  EQU   CVTMAP+183                                               00385000
CVTGTF   EQU   CVTMAP+236                                               00386000
CVTGTFST EQU   CVTGTF                                                   00387000
CVTGTFS  EQU   CVTGTFST                                                 00388000
CVTSTATE EQU   CVTGTFST                                                 00389000
CVTTMODE EQU   CVTGTFST                                                 00390000
CVTFORM  EQU   CVTGTFST                                                 00391000
CVTAQAVT EQU   CVTMAP+240                                               00392000
CVTTCMFG EQU   CVTAQAVT                                                 00393000
CVTVOLM2 EQU   CVTMAP+244                                               00394000
CVTTATA  EQU   CVTVOLM2                                                 00395000
CVTTSKS  EQU   CVTTATA                                                  00396000
CVTVOLF2 EQU   CVTTSKS                                                  00397000
CVTTAT   EQU   CVTTATA+1                                                00398000
CVTATER  EQU   CVTMAP+248                                               00399000
CVTEXT1  EQU   CVTMAP+252                                               00400000
CVTPURG  EQU   CVTMAP+260                                               00401000
CVTQMSG  EQU   CVTMAP+268                                               00402000
CVTDMSR  EQU   CVTMAP+272                                               00403000
CVTRSV37 EQU   CVTDMSR                                                  00404000
CVTDMSRF EQU   CVTRSV37                                                 00405000
CVTERPV  EQU   CVTMAP+316                                               00406000
CVTINTLA EQU   CVTMAP+320                                               00407000
CVTAPF   EQU   CVTMAP+324                                               00408000
CVTEXT2  EQU   CVTMAP+328                                               00409000
CVTHJES  EQU   CVTMAP+332                                               00410000
CVTPGSIA EQU   CVTMAP+348                                               00411000
CVTA1F1  EQU   CVTMAP+356                                               00412000
CVTSYSK  EQU   CVTMAP+357                                               00413000
CVTVOLM1 EQU   CVTMAP+380                                               00414000
CVTVOLF1 EQU   CVTVOLM1                                                 00415000
CVTXTNT1 EQU   0                                                        00416000
CVTXTNT2 EQU   0                                                        00417000
CVTDSSV  EQU   CVTXTNT2                                                 00418000
CVTFLGBT EQU   CVTXTNT2+5                                               00419000
CVTQID   EQU   CVTXTNT2+24                                              00420000
CVTRV400 EQU   CVTXTNT2+52                                              00421000
CVTRV409 EQU   CVTXTNT2+53                                              00422000
CVTATCVT EQU   CVTXTNT2+64                                              00423000
CVTRV429 EQU   CVTXTNT2+84                                              00424000
CVTRV438 EQU   CVTXTNT2+85                                              00425000
CVTRV457 EQU   CVTXTNT2+112                                             00426000
CVTRV466 EQU   CVTXTNT2+113                                             00427000
CVTFIX   EQU   0                                                        00428000
CVTRELNO EQU   CVTFIX+252                                               00429000
ASCB     EQU   0                                                        00430000
ASCBSUPC EQU   ASCB+16                                                  00431000
ASCBFW1  EQU   ASCB+100                                                 00432000
ASCBRCTF EQU   ASCBFW1+2                                                00433000
ASCBFLG1 EQU   ASCBFW1+3                                                00434000
ASCBASXB EQU   ASCB+108                                                 00435000
ASCBDSP1 EQU   ASCB+114                                                 00436000
ASCBFLG2 EQU   ASCB+115                                                 00437000
ASCBLKGP EQU   ASCB+128                                                 00438000
ASCBSRQ  EQU   ASCB+180                                                 00439000
ASCBSRQ1 EQU   ASCBSRQ                                                  00440000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00441000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00442000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00443000
ASXB     EQU   0                                                        00444000
ASXBMPST EQU   ASXB+16                                                  00445000
ASXBAEQ  EQU   ASXB+168                                                 00446000
ASXBCASW EQU   ASXB+216                                                 00447000
ASXBCRB1 EQU   ASXBCASW                                                 00448000
SRBSECT  EQU   0                                                        00449000
SRBFLC   EQU   SRBSECT+12                                               00450000
SRBPTR   EQU   0                                                        00451000
ISTLOK   EQU   0                                                        00452000
LOKCHN   EQU   ISTLOK+1                                                 00453000
LOKCHNG  EQU   LOKCHN                                                   00454000
@NM00030 EQU   LOKCHNG+2                                                00455000
ISTPAB   EQU   0                                                        00456000
PABWQCHN EQU   ISTPAB                                                   00457000
PABWEQA  EQU   PABWQCHN                                                 00458000
PABCHAIN EQU   PABWQCHN+4                                               00459000
PABRUNNG EQU   PABCHAIN                                                 00460000
PABRPHFG EQU   ISTPAB+12                                                00461000
PABFLAGS EQU   PABRPHFG                                                 00462000
PABERLCK EQU   PABFLAGS                                                 00463000
PABERRLK EQU   PABERLCK                                                 00464000
PABEND   EQU   ISTPAB+16                                                00465000
ISTDYPAB EQU   0                                                        00466000
DYPCHAIN EQU   ISTDYPAB+4                                               00467000
DYPPACMD EQU   ISTDYPAB+12                                              00468000
ISTAVT   EQU   0                                                        00469000
ISTRETRG EQU   ISTAVT+44                                                00470000
ISTRPH   EQU   0                                                        00471000
RPHCNTL  EQU   ISTRPH                                                   00472000
RPHFLAGS EQU   RPHCNTL+2                                                00473000
RPHFSTLC EQU   RPHFLAGS                                                 00474000
RPHFLGB  EQU   RPHCNTL+3                                                00475000
RPHRLCRA EQU   RPHFLGB                                                  00476000
RPHRPHA  EQU   ISTRPH+4                                                 00477000
RPHTSKID EQU   ISTRPH+8                                                 00478000
RPHRESMA EQU   ISTRPH+16                                                00479000
RPHWPFLG EQU   RPHRESMA                                                 00480000
RPHWEA   EQU   ISTRPH+24                                                00481000
RPHCSPA  EQU   RPHWEA                                                   00482000
RPHSRPRM EQU   ISTRPH+28                                                00483000
RPHCRR   EQU   ISTRPH+32                                                00484000
RPHPABQA EQU   ISTRPH+36                                                00485000
RPHWORK  EQU   ISTRPH+40                                                00486000
RPHSAVE1 EQU   RPHWORK                                                  00487000
RPHSBITS EQU   RPHSAVE1+1                                               00488000
RPHSAV16 EQU   RPHWORK+60                                               00489000
ISTATCVT EQU   0                                                        00490000
ATCRPTCH EQU   ISTATCVT                                                 00491000
ATCITFLD EQU   ISTATCVT+8                                               00492000
ATCITCDS EQU   ATCITFLD+8                                               00493000
ATCITFLG EQU   ATCITCDS+4                                               00494000
ATCITRA1 EQU   ATCITFLG+2                                               00495000
ATCSMPAB EQU   ISTATCVT+88                                              00496000
ATCVDPAB EQU   ISTATCVT+152                                             00497000
ATCLDTIL EQU   ISTATCVT+408                                             00498000
ATCAP33  EQU   ISTATCVT+448                                             00499000
ATCGTSTR EQU   ISTATCVT+608                                             00500000
ATCSMRS  EQU   ISTATCVT+624                                             00501000
ATCLUDVT EQU   ISTATCVT+768                                             00502000
ATCANYDT EQU   ISTATCVT+776                                             00503000
@NM00040 EQU   ISTATCVT+780                                             00504000
ATCPODVT EQU   ISTATCVT+804                                             00505000
ATCBPDA  EQU   ISTATCVT+856                                             00506000
ATCSTAT  EQU   ISTATCVT+936                                             00507000
ATCSTAT1 EQU   ATCSTAT                                                  00508000
ATCPOFLG EQU   ATCSTAT+2                                                00509000
ATCSTAT4 EQU   ATCSTAT+3                                                00510000
ATCBITAN EQU   ISTATCVT+940                                             00511000
ATCFLAG2 EQU   ATCBITAN+1                                               00512000
ATCONID  EQU   ISTATCVT+944                                             00513000
ATCSSCPA EQU   ISTATCVT+948                                             00514000
ATCHPGM  EQU   ISTATCVT+1012                                            00515000
ATCVLCNT EQU   ISTATCVT+1016                                            00516000
ATCRNO   EQU   ISTATCVT+1020                                            00517000
@NM00063 EQU   ISTATCVT+1028                                            00518000
ATCSHRFG EQU   @NM00063+8                                               00519000
ATCCPDVT EQU   ISTATCVT+1096                                            00520000
ATCSMSDQ EQU   ISTATCVT+1140                                            00521000
ATCRID   EQU   ISTATCVT+1152                                            00522000
ATCLDAPP EQU   ISTATCVT+1288                                            00523000
ATCSQAFR EQU   ISTATCVT+1312                                            00524000
ATCORTCB EQU   ATCSQAFR+4                                               00525000
ATCORSRB EQU   ATCORTCB                                                 00526000
ATCICAPP EQU   ISTATCVT+1320                                            00527000
ATCDAPVT EQU   ISTATCVT+1340                                            00528000
ATCGSRBQ EQU   ISTATCVT+1472                                            00529000
ATCGSRBG EQU   ATCGSRBQ                                                 00530000
ATCENFLG EQU   ISTATCVT+1512                                            00531000
@NM00078 EQU   ISTATCVT+1575                                            00532000
ATCVTFLG EQU   ISTATCVT+1576                                            00533000
ATCZFLAG EQU   ISTATCVT+1696                                            00534000
ATCCRA   EQU   ISTATCVT+1720                                            00535000
ATCCRACN EQU   ATCCRA+4                                                 00536000
ATCSRB   EQU   ISTATCVT+1728                                            00537000
ATCSRBCN EQU   ATCSRB+4                                                 00538000
ATCCRPL  EQU   ISTATCVT+1736                                            00539000
ATCRPLCN EQU   ATCCRPL+4                                                00540000
ISTPFCRR EQU   0                                                        00541000
PFCCRR   EQU   ISTPFCRR                                                 00542000
PFCCRRID EQU   PFCCRR                                                   00543000
PFCCRRLN EQU   PFCCRR+2                                                 00544000
PFCHDR   EQU   ISTPFCRR+4                                               00545000
PFCCRRO  EQU   PFCHDR                                                   00546000
PFCFRRO  EQU   PFCHDR+4                                                 00547000
ISTCFCRR EQU   0                                                        00548000
CFCAUDIT EQU   ISTCFCRR                                                 00549000
CFCNTRD  EQU   CFCAUDIT                                                 00550000
CFCCRT   EQU   CFCAUDIT+1                                               00551000
ISTDCCRR EQU   0                                                        00552000
CRRSPACE EQU   ISTDCCRR+12                                              00553000
CRRSAREA EQU   0                                                        00554000
CRRMAS   EQU   CRRSAREA+148                                             00555000
CRRMAS1  EQU   CRRMAS                                                   00556000
CRRMAS2  EQU   CRRMAS+1                                                 00557000
CRRMAS3  EQU   CRRMAS+2                                                 00558000
CRRMAS4  EQU   CRRMAS+3                                                 00559000
CRRRMAS1 EQU   CRRMAS+4                                                 00560000
CRRRMAS2 EQU   CRRMAS+5                                                 00561000
CRRRMAS3 EQU   CRRMAS+6                                                 00562000
CRRSMAS  EQU   CRRRMAS3                                                 00563000
CRRATS   EQU   CRRSAREA+156                                             00564000
CRRATS1  EQU   CRRATS                                                   00565000
CRRATS2  EQU   CRRATS+1                                                 00566000
CRRATS3  EQU   CRRATS+2                                                 00567000
CRRATS4  EQU   CRRATS+3                                                 00568000
CRRRATS1 EQU   CRRATS+4                                                 00569000
CRRRATS2 EQU   CRRATS+5                                                 00570000
CRRRATS3 EQU   CRRATS+6                                                 00571000
CRRSATS  EQU   CRRRATS3                                                 00572000
CRRFLGS1 EQU   CRRSAREA+164                                             00573000
CRRFLGS2 EQU   CRRSAREA+165                                             00574000
CRRFLGS3 EQU   CRRSAREA+166                                             00575000
CRRFLGS4 EQU   CRRSAREA+167                                             00576000
CRRFLGS  EQU   CRRSAREA+168                                             00577000
CRRRFLG1 EQU   CRRSAREA+169                                             00578000
CRRRTYPE EQU   CRRRFLG1                                                 00579000
CRRFDBK1 EQU   CRRSAREA+170                                             00580000
CRRFDB2  EQU   CRRFDBK1+1                                               00581000
CRRFDB3  EQU   CRRFDBK1+2                                               00582000
CRRFDBK2 EQU   CRRSAREA+176                                             00583000
CRRDSB   EQU   CRRFDBK2                                                 00584000
CRRESR   EQU   CRRFDBK2+2                                               00585000
CRRTRBUF EQU   CRRSAREA+204                                             00586000
CRRBFLGS EQU   CRRSAREA+280                                             00587000
ISTASCRR EQU   0                                                        00588000
ASCFLAGS EQU   ISTASCRR+16                                              00589000
ASCFLG1  EQU   ASCFLAGS                                                 00590000
ASCFLG2  EQU   ASCFLAGS+2                                               00591000
ASCFLG3  EQU   ASCFLAGS+4                                               00592000
ASCUSRGS EQU   ISTASCRR+28                                              00593000
ISTAPCRR EQU   0                                                        00594000
APCATFLG EQU   ISTAPCRR+16                                              00595000
APCRFLG  EQU   ISTAPCRR+18                                              00596000
APCRTRN  EQU   ISTAPCRR+28                                              00597000
APCAUT   EQU   APCRTRN                                                  00598000
APCSAVE  EQU   ISTAPCRR+44                                              00599000
APCCOMF  EQU   ISTAPCRR+116                                             00600000
APCCOMF1 EQU   APCCOMF                                                  00601000
APC31FLG EQU   ISTAPCRR+132                                             00602000
APC52FLG EQU   ISTAPCRR+133                                             00603000
APC53FLG EQU   ISTAPCRR+134                                             00604000
APC54FLG EQU   ISTAPCRR+135                                             00605000
APC57FLG EQU   ISTAPCRR+136                                             00606000
ISTCRA   EQU   0                                                        00607000
CRABASIC EQU   ISTCRA                                                   00608000
CRAHDR   EQU   CRABASIC                                                 00609000
CRALKACT EQU   CRABASIC+8                                               00610000
CRAL1PTR EQU   CRABASIC+12                                              00611000
CRARPH   EQU   ISTCRA+52                                                00612000
CRAPSS   EQU   ISTCRA+160                                               00613000
CRAPROCR EQU   ISTCRA+312                                               00614000
CRASVC   EQU   ISTCRA+924                                               00615000
CRABUFA  EQU   CRASVC+68                                                00616000
CRARSV01 EQU   ISTCRA+996                                               00617000
CRARSV02 EQU   ISTCRA+1000                                              00618000
CRAIDS   EQU   ISTCRA+1004                                              00619000
CRACHAIN EQU   ISTCRA+1012                                              00620000
ISTMPST  EQU   0                                                        00621000
MPSRSV07 EQU   ISTMPST+4                                                00622000
MPSRQFGA EQU   ISTMPST+8                                                00623000
MPSRQUE  EQU   MPSRQFGA                                                 00624000
MPSFLGA  EQU   MPSRQFGA+4                                               00625000
MPSFLGAA EQU   MPSFLGA                                                  00626000
MPSFLGAB EQU   MPSFLGA+1                                                00627000
MPSCRA   EQU   ISTMPST+24                                               00628000
MPSCRACT EQU   MPSCRA+4                                                 00629000
MPSSRB   EQU   ISTMPST+32                                               00630000
MPSSRBCT EQU   MPSSRB+4                                                 00631000
MPSCRPL  EQU   ISTMPST+40                                               00632000
MPSRPLCT EQU   MPSCRPL+4                                                00633000
MPSSAVE  EQU   ISTMPST+140                                              00634000
LOKPTRWD EQU   0                                                        00635000
APC33    EQU   0                                                        00636000
FMZL0013 EQU   0                                                        00637000
CMZ0036A EQU   0                                                        00638000
CMZ0036  EQU   CMZ0036A+1                                               00639000
ISTXDYP  EQU   0                                                        00640000
ISTXPAB  EQU   0                                                        00641000
CVTS01   EQU   CVTPGSIA                                                 00642000
CVTLPDIA EQU   CVTS01+12                                                00643000
CVTDIRST EQU   CVTLPDIA                                                 00644000
CVTSLIDA EQU   CVTS01+24                                                00645000
CVTCTLFG EQU   CVTS01+50                                                00646000
CVTRV210 EQU   CVTS01+424                                               00647000
CVTRV219 EQU   CVTS01+425                                               00648000
CVTRV228 EQU   CVTS01+426                                               00649000
CVTRV237 EQU   CVTS01+427                                               00650000
CVTMFRTR EQU   CVTS01+452                                               00651000
CVTRV262 EQU   CVTS01+468                                               00652000
CVTRV271 EQU   CVTS01+469                                               00653000
CVTRV280 EQU   CVTS01+470                                               00654000
CVTRV289 EQU   CVTS01+471                                               00655000
CVTGSDA  EQU   CVTS01+600                                               00656000
FLC      EQU   PSA                                                      00657000
PSARSVTE EQU   PSARSVT                                                  00658000
PABXTNSN EQU   PABEND                                                   00659000
@NM00105 EQU   CRAPROCR                                                 00660000
CRACFCRR EQU   CRAPROCR                                                 00661000
SRB      EQU   SRBSECT                                                  00662000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00663000
CRACRRSA EQU   @NM00105+12                                              00664000
@NM00106 EQU   @NM00105                                                 00665000
@NM00032 EQU   PABXTNSN+12                                              00666000
PABNPSSQ EQU   PABXTNSN+8                                               00667000
PABLOCK  EQU   PABXTNSN+4                                               00668000
PABLAST  EQU   PABXTNSN                                                 00669000
PSARSAV  EQU   PSARSVTE+60                                              00670000
PSARSTK  EQU   PSARSVTE+56                                              00671000
PSAESAV3 EQU   PSARSVTE+52                                              00672000
PSAESTK3 EQU   PSARSVTE+48                                              00673000
PSAESAV2 EQU   PSARSVTE+44                                              00674000
PSAESTK2 EQU   PSARSVTE+40                                              00675000
PSAESAV1 EQU   PSARSVTE+36                                              00676000
PSAESTK1 EQU   PSARSVTE+32                                              00677000
PSAPSAV  EQU   PSARSVTE+28                                              00678000
PSAPSTK  EQU   PSARSVTE+24                                              00679000
PSAMSAV  EQU   PSARSVTE+20                                              00680000
PSAMSTK  EQU   PSARSVTE+16                                              00681000
PSASSAV  EQU   PSARSVTE+12                                              00682000
PSASSTK  EQU   PSARSVTE+8                                               00683000
PSANSTK  EQU   PSARSVTE+4                                               00684000
PSACSTK  EQU   PSARSVTE                                                 00685000
CVTRV628 EQU   CVTS01+728                                               00686000
CVTRV627 EQU   CVTS01+724                                               00687000
CVTRV626 EQU   CVTS01+720                                               00688000
CVTRV625 EQU   CVTS01+716                                               00689000
CVTRV624 EQU   CVTS01+712                                               00690000
CVTRV623 EQU   CVTS01+708                                               00691000
CVTRV622 EQU   CVTS01+704                                               00692000
CVTRV621 EQU   CVTS01+700                                               00693000
CVTIHASU EQU   CVTS01+696                                               00694000
CVTSUSP  EQU   CVTS01+692                                               00695000
CVTT6SVC EQU   CVTS01+688                                               00696000
CVTCDAL  EQU   CVTS01+684                                               00697000
CVTTCTL  EQU   CVTS01+680                                               00698000
CVTRSUME EQU   CVTS01+676                                               00699000
CVTJTERM EQU   CVTS01+672                                               00700000
CVTASMRM EQU   CVTS01+668                                               00701000
CVTTCASP EQU   CVTS01+664                                               00702000
CVT0PT03 EQU   CVTS01+660                                               00703000
CVT0PT0E EQU   CVTS01+656                                               00704000
CVTRV609 EQU   CVTS01+652                                               00705000
CVTCGK   EQU   CVTS01+648                                               00706000
CVTRAC   EQU   CVTS01+644                                               00707000
CVTRV606 EQU   CVTS01+640                                               00708000
CVTRV605 EQU   CVTS01+636                                               00709000
CVTRV604 EQU   CVTS01+632                                               00710000
CVTEFF02 EQU   CVTS01+628                                               00711000
CVTCBBR  EQU   CVTS01+624                                               00712000
CVTSSCR  EQU   CVTS01+620                                               00713000
CVTEVENT EQU   CVTS01+616                                               00714000
CVTCRCA  EQU   CVTS01+612                                               00715000
CVTTPIO  EQU   CVTS01+608                                               00716000
CVTADV   EQU   CVTS01+604                                               00717000
CVTGSDAB EQU   CVTGSDA                                                  00718000
CVTQV3   EQU   CVTS01+596                                               00719000
CVTQV2   EQU   CVTS01+592                                               00720000
CVTQV1   EQU   CVTS01+588                                               00721000
CVTRPT   EQU   CVTS01+584                                               00722000
CVTSSRB  EQU   CVTS01+580                                               00723000
CVTCSDRL EQU   CVTS01+576                                               00724000
CVTEXP1  EQU   CVTS01+572                                               00725000
CVTRMPMT EQU   CVTS01+568                                               00726000
CVTRMPTT EQU   CVTS01+564                                               00727000
CVTVPSA  EQU   CVTS01+560                                               00728000
CVTVSTOP EQU   CVTS01+556                                               00729000
CVTGTFR8 EQU   CVTS01+552                                               00730000
CVTQUIT  EQU   CVTS01+548                                               00731000
CVTVACR  EQU   CVTS01+544                                               00732000
CVTWTCB  EQU   CVTS01+540                                               00733000
CVTSTPRS EQU   CVTS01+536                                               00734000
CVT0PT02 EQU   CVTS01+532                                               00735000
CVTDARCM EQU   CVTS01+528                                               00736000
CVTIRECM EQU   CVTS01+524                                               00737000
CVTJRECM EQU   CVTS01+520                                               00738000
CVTVEMS0 EQU   CVTS01+516                                               00739000
CVTSPFRR EQU   CVTS01+512                                               00740000
CVTRLSTG EQU   CVTS01+508                                               00741000
CVT0TC0A EQU   CVTS01+504                                               00742000
CVTGMBR  EQU   CVTS01+500                                               00743000
CVTLFRM  EQU   CVTS01+496                                               00744000
CVTRMBR  EQU   CVTS01+492                                               00745000
CVTVIOP  EQU   CVTS01+488                                               00746000
CVTRV307 EQU   CVTS01+486                                               00747000
CVTRV306 EQU   CVTS01+484                                               00748000
CVTRV305 EQU   CVTS01+482                                               00749000
CVTRV304 EQU   CVTS01+480                                               00750000
CVTRV303 EQU   CVTS01+478                                               00751000
CVTRV302 EQU   CVTS01+476                                               00752000
CVTTRCA  EQU   CVTS01+472                                               00753000
CVTRV297 EQU   CVTRV289                                                 00754000
CVTRV296 EQU   CVTRV289                                                 00755000
CVTRV295 EQU   CVTRV289                                                 00756000
CVTRV294 EQU   CVTRV289                                                 00757000
CVTRV293 EQU   CVTRV289                                                 00758000
CVTRV292 EQU   CVTRV289                                                 00759000
CVTRV291 EQU   CVTRV289                                                 00760000
CVTRV290 EQU   CVTRV289                                                 00761000
CVTRV288 EQU   CVTRV280                                                 00762000
CVTRV287 EQU   CVTRV280                                                 00763000
CVTRV286 EQU   CVTRV280                                                 00764000
CVTRV285 EQU   CVTRV280                                                 00765000
CVTRV284 EQU   CVTRV280                                                 00766000
CVTRV283 EQU   CVTRV280                                                 00767000
CVTRV282 EQU   CVTRV280                                                 00768000
CVTRV281 EQU   CVTRV280                                                 00769000
CVTRV279 EQU   CVTRV271                                                 00770000
CVTRV278 EQU   CVTRV271                                                 00771000
CVTRV277 EQU   CVTRV271                                                 00772000
CVTRV276 EQU   CVTRV271                                                 00773000
CVTRV275 EQU   CVTRV271                                                 00774000
CVTRV274 EQU   CVTRV271                                                 00775000
CVTRV273 EQU   CVTRV271                                                 00776000
CVTRV272 EQU   CVTRV271                                                 00777000
CVTRV270 EQU   CVTRV262                                                 00778000
CVTRV269 EQU   CVTRV262                                                 00779000
CVTRV268 EQU   CVTRV262                                                 00780000
CVTRV267 EQU   CVTRV262                                                 00781000
CVTRV266 EQU   CVTRV262                                                 00782000
CVTRV265 EQU   CVTRV262                                                 00783000
CVTRV264 EQU   CVTRV262                                                 00784000
CVTRV263 EQU   CVTRV262                                                 00785000
CVTVFP   EQU   CVTS01+464                                               00786000
CVTVSI   EQU   CVTS01+460                                               00787000
CVTVPSIB EQU   CVTS01+456                                               00788000
CVTMFACT EQU   CVTMFRTR                                                 00789000
CVTMFCTL EQU   CVTS01+448                                               00790000
CVTPVBP  EQU   CVTS01+444                                               00791000
CVTPWI   EQU   CVTS01+440                                               00792000
CVTRV254 EQU   CVTS01+438                                               00793000
CVTRV253 EQU   CVTS01+436                                               00794000
CVTRV252 EQU   CVTS01+434                                               00795000
CVTRV251 EQU   CVTS01+433                                               00796000
CVTRV250 EQU   CVTS01+432                                               00797000
CVTRV249 EQU   CVTS01+431                                               00798000
CVTRV248 EQU   CVTS01+430                                               00799000
CVTRV247 EQU   CVTS01+429                                               00800000
CVTRV246 EQU   CVTS01+428                                               00801000
CVTRV245 EQU   CVTRV237                                                 00802000
CVTRV244 EQU   CVTRV237                                                 00803000
CVTRV243 EQU   CVTRV237                                                 00804000
CVTRV242 EQU   CVTRV237                                                 00805000
CVTRV241 EQU   CVTRV237                                                 00806000
CVTRV240 EQU   CVTRV237                                                 00807000
CVTRV239 EQU   CVTRV237                                                 00808000
CVTRV238 EQU   CVTRV237                                                 00809000
CVTRV236 EQU   CVTRV228                                                 00810000
CVTRV235 EQU   CVTRV228                                                 00811000
CVTRV234 EQU   CVTRV228                                                 00812000
CVTRV233 EQU   CVTRV228                                                 00813000
CVTRV232 EQU   CVTRV228                                                 00814000
CVTRV231 EQU   CVTRV228                                                 00815000
CVTRV230 EQU   CVTRV228                                                 00816000
CVTRV229 EQU   CVTRV228                                                 00817000
CVTRV227 EQU   CVTRV219                                                 00818000
CVTRV226 EQU   CVTRV219                                                 00819000
CVTRV225 EQU   CVTRV219                                                 00820000
CVTRV224 EQU   CVTRV219                                                 00821000
CVTRV223 EQU   CVTRV219                                                 00822000
CVTRV222 EQU   CVTRV219                                                 00823000
CVTRV221 EQU   CVTRV219                                                 00824000
CVTRV220 EQU   CVTRV219                                                 00825000
CVTRV218 EQU   CVTRV210                                                 00826000
CVTRV217 EQU   CVTRV210                                                 00827000
CVTRV216 EQU   CVTRV210                                                 00828000
CVTRV215 EQU   CVTRV210                                                 00829000
CVTRV214 EQU   CVTRV210                                                 00830000
CVTRV213 EQU   CVTRV210                                                 00831000
CVTRV212 EQU   CVTRV210                                                 00832000
CVTRV211 EQU   CVTRV210                                                 00833000
CVTLCCAT EQU   CVTS01+420                                               00834000
CVTPCCAT EQU   CVTS01+416                                               00835000
CVTIPCRP EQU   CVTS01+412                                               00836000
CVTIPCRI EQU   CVTS01+408                                               00837000
CVTIPCDS EQU   CVTS01+404                                               00838000
CVTAIDVT EQU   CVTS01+400                                               00839000
CVTSSAP  EQU   CVTS01+396                                               00840000
CVTEHCIR EQU   CVTS01+392                                               00841000
CVTEHDEF EQU   CVTS01+388                                               00842000
CVTDAIR  EQU   CVTS01+384                                               00843000
CVTPERFM EQU   CVTS01+380                                               00844000
CVT044R2 EQU   CVTS01+376                                               00845000
CVTFETCH EQU   CVTS01+372                                               00846000
CVTRSTWD EQU   CVTS01+368                                               00847000
CVTSPOST EQU   CVTS01+364                                               00848000
CVTIOBP  EQU   CVTS01+360                                               00849000
CVTASMVT EQU   CVTS01+356                                               00850000
CVTRECRQ EQU   CVTS01+352                                               00851000
CVTWSAC  EQU   CVTS01+348                                               00852000
CVTRV149 EQU   CVTS01+344                                               00853000
CVTWSAL  EQU   CVTS01+340                                               00854000
CVTSPSA  EQU   CVTS01+336                                               00855000
CVTGLMN  EQU   CVTS01+332                                               00856000
CVTVEAC0 EQU   CVTS01+328                                               00857000
CVT062R1 EQU   CVTS01+324                                               00858000
CVTRPOST EQU   CVTS01+320                                               00859000
CVTDQIQE EQU   CVTS01+316                                               00860000
CVTCSD   EQU   CVTS01+312                                               00861000
CVTLKRMA EQU   CVTS01+308                                               00862000
CVTRSPIE EQU   CVTS01+304                                               00863000
CVTRENQ  EQU   CVTS01+300                                               00864000
CVTLQCB  EQU   CVTS01+296                                               00865000
CVTFQCB  EQU   CVTS01+292                                               00866000
CVTQCS01 EQU   CVTS01+288                                               00867000
CVTAPFT  EQU   CVTS01+284                                               00868000
CVTPARRL EQU   CVTS01+280                                               00869000
CVTVWAIT EQU   CVTS01+276                                               00870000
CVTGSPL  EQU   CVTS01+272                                               00871000
CVTLSMQ  EQU   CVTS01+268                                               00872000
CVTGSMQ  EQU   CVTS01+264                                               00873000
CVTEXPRO EQU   CVTS01+260                                               00874000
CVTOPCTP EQU   CVTS01+256                                               00875000
CVTSIC   EQU   CVTS01+252                                               00876000
CVTTPIOS EQU   CVTS01+248                                               00877000
CVTRTMS  EQU   CVTS01+244                                               00878000
CVTSDBF  EQU   CVTS01+240                                               00879000
CVTSCBP  EQU   CVTS01+236                                               00880000
CVTSDMP  EQU   CVTS01+232                                               00881000
CVTSV60  EQU   CVTS01+228                                               00882000
CVTRTMCT EQU   CVTS01+224                                               00883000
CVTASCBL EQU   CVTS01+220                                               00884000
CVTASCBH EQU   CVTS01+216                                               00885000
CVTGDA   EQU   CVTS01+212                                               00886000
CVTASVT  EQU   CVTS01+208                                               00887000
CVTVVMDI EQU   CVTS01+204                                               00888000
CVTAQTOP EQU   CVTS01+200                                               00889000
CVTIOSCS EQU   CVTS01+196                                               00890000
CVTSDRM  EQU   CVTS01+192                                               00891000
CVTOPTE  EQU   CVTS01+188                                               00892000
CVTSTXU  EQU   CVTS01+184                                               00893000
CVTQUIS  EQU   CVTS01+180                                               00894000
CVTPARS  EQU   CVTS01+176                                               00895000
CVTS1EE  EQU   CVTS01+172                                               00896000
CVTFRAS  EQU   CVTS01+168                                               00897000
CVTQSAS  EQU   CVTS01+164                                               00898000
CVTCRAS  EQU   CVTS01+160                                               00899000
CVTCRMN  EQU   CVTS01+156                                               00900000
CVTDELCP EQU   CVTS01+152                                               00901000
CVTFRECL EQU   CVTS01+148                                               00902000
CVTGETCL EQU   CVTS01+144                                               00903000
CVTBLDCP EQU   CVTS01+140                                               00904000
CVTAUTHL EQU   CVTS01+136                                               00905000
CVTSCAN  EQU   CVTS01+132                                               00906000
CVTRV144 EQU   CVTS01+130                                               00907000
CVTMAXMP EQU   CVTS01+128                                               00908000
CVTSTCK  EQU   CVTS01+124                                               00909000
CVTRV139 EQU   CVTS01+123                                               00910000
CVTDSSAC EQU   CVTS01+122                                               00911000
CVTRV513 EQU   CVTS01+121                                               00912000
CVTIOSPL EQU   CVTS01+120                                               00913000
CVTPTGT  EQU   CVTS01+116                                               00914000
CVTCSPIE EQU   CVTS01+112                                               00915000
CVTSMFEX EQU   CVTS01+108                                               00916000
CVTOLT0A EQU   CVTS01+104                                               00917000
CVTSRBRT EQU   CVTS01+100                                               00918000
CVTPUTL  EQU   CVTS01+96                                                00919000
CVTASCRL EQU   CVTS01+92                                                00920000
CVTASCRF EQU   CVTS01+88                                                00921000
CVTRV326 EQU   CVTS01+84                                                00922000
CVTRV325 EQU   CVTS01+80                                                00923000
CVTRV324 EQU   CVTS01+76                                                00924000
CVT0VL01 EQU   CVTS01+72                                                00925000
CVTSHRVM EQU   CVTS01+68                                                00926000
CVTRV332 EQU   CVTS01+64                                                00927000
CVTTAS   EQU   CVTS01+60                                                00928000
CVTRSCN  EQU   CVTS01+56                                                00929000
CVTTRAC2 EQU   CVTS01+54                                                00930000
CVTTRACE EQU   CVTS01+52                                                00931000
CVTAPG   EQU   CVTS01+51                                                00932000
CVTSDTRC EQU   CVTCTLFG                                                 00933000
CVTGTRCE EQU   CVTCTLFG                                                 00934000
CVTNOMP  EQU   CVTCTLFG                                                 00935000
CVTRSV79 EQU   CVTCTLFG                                                 00936000
CVTDSTAT EQU   CVTCTLFG                                                 00937000
CVTRSV78 EQU   CVTCTLFG                                                 00938000
CVTRV333 EQU   CVTCTLFG                                                 00939000
CVTRV323 EQU   CVTCTLFG                                                 00940000
CVTSPVLK EQU   CVTS01+49                                                00941000
CVTRSV77 EQU   CVTS01+48                                                00942000
CVTRV331 EQU   CVTS01+44                                                00943000
CVTRV330 EQU   CVTS01+40                                                00944000
CVTRV329 EQU   CVTS01+36                                                00945000
CVTRV328 EQU   CVTS01+32                                                00946000
CVTRV322 EQU   CVTS01+28                                                00947000
CVTSLID  EQU   CVTSLIDA+1                                               00948000
CVTSYLK  EQU   CVTSLIDA                                                 00949000
CVTRV321 EQU   CVTS01+20                                                00950000
CVTRV320 EQU   CVTS01+16                                                00951000
CVTLPDIR EQU   CVTLPDIA+1                                               00952000
CVTRSV69 EQU   CVTDIRST                                                 00953000
CVTRSV68 EQU   CVTDIRST                                                 00954000
CVTRSV67 EQU   CVTDIRST                                                 00955000
CVTRSV66 EQU   CVTDIRST                                                 00956000
CVTRSV65 EQU   CVTDIRST                                                 00957000
CVTRSV64 EQU   CVTDIRST                                                 00958000
CVTRSV63 EQU   CVTDIRST                                                 00959000
CVTDICOM EQU   CVTDIRST                                                 00960000
CVTPVTP  EQU   CVTS01+8                                                 00961000
CVTLPDSR EQU   CVTS01+4                                                 00962000
CVTGETL  EQU   CVTS01                                                   00963000
@NM00109 EQU   CMZ0036A                                                 00964000
MPSSRB1  EQU   ISTMPST+172                                              00965000
MPSMQLBP EQU   ISTMPST+136                                              00966000
MPSSYSRT EQU   ISTMPST+132                                              00967000
MPSQEL   EQU   ISTMPST+128                                              00968000
MPSDBTBL EQU   ISTMPST+124                                              00969000
MPSASCB  EQU   ISTMPST+120                                              00970000
MPSTPPAB EQU   ISTMPST+88                                               00971000
MPSSMPAB EQU   ISTMPST+56                                               00972000
MPSSMRPH EQU   ISTMPST+52                                               00973000
MPSSRB55 EQU   ISTMPST+48                                               00974000
MPSRPLAC EQU   MPSRPLCT+2                                               00975000
MPSRPLRC EQU   MPSRPLCT                                                 00976000
MPSCRPLQ EQU   MPSCRPL                                                  00977000
MPSSRBAC EQU   MPSSRBCT+2                                               00978000
MPSSRBRC EQU   MPSSRBCT                                                 00979000
MPSSRBQ  EQU   MPSSRB                                                   00980000
MPSCRAAC EQU   MPSCRACT+2                                               00981000
MPSCRARC EQU   MPSCRACT                                                 00982000
MPSCRAQ  EQU   MPSCRA                                                   00983000
MPSMPSTP EQU   ISTMPST+20                                               00984000
MPSPSTCT EQU   ISTMPST+16                                               00985000
MPSASID  EQU   MPSFLGA+2                                                00986000
MPSRMGOC EQU   MPSFLGAB                                                 00987000
MPSPSTAB EQU   MPSFLGAA                                                 00988000
MPSRSV01 EQU   MPSFLGAA                                                 00989000
MPSTPBU  EQU   MPSFLGAA                                                 00990000
MPMEMTRM EQU   MPSFLGAA                                                 00991000
MPSAUTH  EQU   MPSFLGAA                                                 00992000
MPSCRAO  EQU   MPSFLGAA                                                 00993000
MPSSRBO  EQU   MPSFLGAA                                                 00994000
MPSRQUEG EQU   MPSRQUE                                                  00995000
MPSTSOIR EQU   MPSRSV07                                                 00996000
MPSTSOIW EQU   MPSRSV07                                                 00997000
MPSID    EQU   ISTMPST                                                  00998000
CRAID    EQU   CRAIDS+4                                                 00999000
CRAASID  EQU   CRAIDS+2                                                 01000000
@NM00104 EQU   CRAIDS                                                   01001000
CRABFTBA EQU   CRABUFA                                                  01002000
CRAMASK  EQU   CRASVC+64                                                01003000
CRAHSIZ  EQU   CRASVC+60                                                01004000
CRAASCRR EQU   CRASVC                                                   01005000
@NM00103 EQU   CRAPROCR                                                 01006000
CRALAPTR EQU   CRABASIC+48                                              01007000
CRAL9PTR EQU   CRABASIC+44                                              01008000
CRAL8PTR EQU   CRABASIC+40                                              01009000
CRAL7PTR EQU   CRABASIC+36                                              01010000
CRAL6PTR EQU   CRABASIC+32                                              01011000
CRAL5PTR EQU   CRABASIC+28                                              01012000
CRAL4PTR EQU   CRABASIC+24                                              01013000
CRAL3PTR EQU   CRABASIC+20                                              01014000
CRAL2PTR EQU   CRABASIC+16                                              01015000
CRALEV01 EQU   CRALKACT+3                                               01016000
CRALEV02 EQU   CRALKACT+3                                               01017000
CRALEV03 EQU   CRALKACT+3                                               01018000
CRALEV04 EQU   CRALKACT+3                                               01019000
CRALEV05 EQU   CRALKACT+3                                               01020000
CRALEV06 EQU   CRALKACT+3                                               01021000
CRALEV07 EQU   CRALKACT+3                                               01022000
CRALEV08 EQU   CRALKACT+3                                               01023000
CRALEV09 EQU   CRALKACT+2                                               01024000
CRALEV10 EQU   CRALKACT+2                                               01025000
CRALEV11 EQU   CRALKACT+2                                               01026000
CRALEV12 EQU   CRALKACT+2                                               01027000
CRALEV13 EQU   CRALKACT+2                                               01028000
CRALEV14 EQU   CRALKACT+2                                               01029000
CRALEV15 EQU   CRALKACT+2                                               01030000
CRALEV16 EQU   CRALKACT+2                                               01031000
CRALEV17 EQU   CRALKACT+1                                               01032000
CRALEV18 EQU   CRALKACT+1                                               01033000
CRALEV19 EQU   CRALKACT+1                                               01034000
CRALEV20 EQU   CRALKACT+1                                               01035000
CRALEV21 EQU   CRALKACT+1                                               01036000
CRALEV22 EQU   CRALKACT+1                                               01037000
CRALEV23 EQU   CRALKACT+1                                               01038000
CRALEV24 EQU   CRALKACT+1                                               01039000
CRALEV25 EQU   CRALKACT                                                 01040000
CRALEV26 EQU   CRALKACT                                                 01041000
CRALEV27 EQU   CRALKACT                                                 01042000
CRALEV28 EQU   CRALKACT                                                 01043000
CRALEV29 EQU   CRALKACT                                                 01044000
CRALEV30 EQU   CRALKACT                                                 01045000
CRALEV31 EQU   CRALKACT                                                 01046000
CRALEV32 EQU   CRALKACT                                                 01047000
CRAFRR   EQU   CRAHDR+4                                                 01048000
CRACRR   EQU   CRAHDR                                                   01049000
@NM00102 EQU   ISTAPCRR+144                                             01050000
APCSVRB  EQU   ISTAPCRR+140                                             01051000
@NM00101 EQU   ISTAPCRR+137                                             01052000
@NM00100 EQU   APC57FLG                                                 01053000
APCNREL  EQU   APC57FLG                                                 01054000
APCRECRA EQU   APC57FLG                                                 01055000
@NM00099 EQU   APC54FLG                                                 01056000
APCRLST  EQU   APC54FLG                                                 01057000
APCPR153 EQU   APC53FLG                                                 01058000
@NM00098 EQU   APC52FLG                                                 01059000
APCWKF   EQU   APC52FLG                                                 01060000
APCNWF   EQU   APC52FLG                                                 01061000
APCRDQ   EQU   APC52FLG                                                 01062000
APCQENQ  EQU   APC52FLG                                                 01063000
APCSMSR  EQU   APC52FLG                                                 01064000
APCCKRQ  EQU   APC52FLG                                                 01065000
@NM00097 EQU   APC31FLG                                                 01066000
APCSORT  EQU   APC31FLG                                                 01067000
APCRESCH EQU   APC31FLG                                                 01068000
APCTPXIT EQU   APC31FLG                                                 01069000
APCSWTWD EQU   ISTAPCRR+128                                             01070000
APCSAV2  EQU   ISTAPCRR+124                                             01071000
APCSAV1  EQU   ISTAPCRR+120                                             01072000
APCRETCD EQU   APCCOMF+2                                                01073000
@NM00096 EQU   APCCOMF1+1                                               01074000
APCTSO   EQU   APCCOMF1+1                                               01075000
APCAUTHE EQU   APCCOMF1+1                                               01076000
APCZLBER EQU   APCCOMF1                                                 01077000
APCEXIT  EQU   APCCOMF1                                                 01078000
APCRELR  EQU   APCCOMF1                                                 01079000
APCIRB2  EQU   APCCOMF1                                                 01080000
APCIRB1  EQU   APCCOMF1                                                 01081000
APCSMCR  EQU   APCCOMF1                                                 01082000
APCUETSK EQU   APCCOMF1                                                 01083000
APCSSTSK EQU   APCCOMF1                                                 01084000
APCESTAL EQU   APCSAVE                                                  01085000
APCFRRPM EQU   ISTAPCRR+40                                              01086000
APCQWFO  EQU   ISTAPCRR+36                                              01087000
APCPABSV EQU   ISTAPCRR+32                                              01088000
APCRTRNA EQU   APCRTRN+1                                                01089000
@NM00095 EQU   APCAUT                                                   01090000
APCAUTEX EQU   APCAUT                                                   01091000
APCTCBA  EQU   ISTAPCRR+24                                              01092000
APCPSTA  EQU   ISTAPCRR+20                                              01093000
@NM00094 EQU   APCRFLG+1                                                01094000
APC31R   EQU   APCRFLG                                                  01095000
APC58R   EQU   APCRFLG                                                  01096000
APC57R   EQU   APCRFLG                                                  01097000
APC56R   EQU   APCRFLG                                                  01098000
APC54R   EQU   APCRFLG                                                  01099000
APC53R   EQU   APCRFLG                                                  01100000
APC52R   EQU   APCRFLG                                                  01101000
APC51R   EQU   APCRFLG                                                  01102000
@NM00093 EQU   APCATFLG+1                                               01103000
APC31E   EQU   APCATFLG                                                 01104000
APC58E   EQU   APCATFLG                                                 01105000
APC57E   EQU   APCATFLG                                                 01106000
APC56E   EQU   APCATFLG                                                 01107000
APC54E   EQU   APCATFLG                                                 01108000
APC53E   EQU   APCATFLG                                                 01109000
APC52E   EQU   APCATFLG                                                 01110000
APC51E   EQU   APCATFLG                                                 01111000
APCHDRSV EQU   ISTAPCRR                                                 01112000
ASCPSREG EQU   ISTASCRR+44                                              01113000
ASCUSR01 EQU   ASCUSRGS+12                                              01114000
ASCUSR00 EQU   ASCUSRGS+8                                               01115000
ASCUSR15 EQU   ASCUSRGS+4                                               01116000
ASCUSR14 EQU   ASCUSRGS                                                 01117000
ASCETRYA EQU   ISTASCRR+24                                              01118000
ASCKEY   EQU   ISTASCRR+23                                              01119000
ASCAUDIT EQU   ASCFLG3                                                  01120000
ASCFBDUD EQU   ASCFLG3                                                  01121000
ASCLLKF  EQU   ASCFLG3                                                  01122000
ASCKEYF  EQU   ASCFLG3                                                  01123000
ASCFBDAL EQU   ASCFLG3                                                  01124000
ASCFSRGT EQU   ASCFLG3                                                  01125000
ASCICR   EQU   ASCFLG2                                                  01126000
ASCFSRIC EQU   ASCFLG2                                                  01127000
ASCFBDIC EQU   ASCFLG2                                                  01128000
ASCFBAIC EQU   ASCFLG2                                                  01129000
ASCPASTR EQU   ASCFLG1                                                  01130000
ASCFSR   EQU   ASCFLG1                                                  01131000
ASCFBD   EQU   ASCFLG1                                                  01132000
ASCFBA   EQU   ASCFLG1                                                  01133000
ASCPFCRR EQU   ISTASCRR                                                 01134000
CRRRVPT5 EQU   CRRSAREA+316                                             01135000
CRRRVPT4 EQU   CRRSAREA+312                                             01136000
CRRRVPT3 EQU   CRRSAREA+308                                             01137000
CRRRVPT2 EQU   CRRSAREA+304                                             01138000
CRRRVPT1 EQU   CRRSAREA+300                                             01139000
CRRRVCR2 EQU   CRRSAREA+296                                             01140000
CRRCID   EQU   CRRSAREA+292                                             01141000
CRRRVCR1 EQU   CRRSAREA+291                                             01142000
CRRXFNCD EQU   CRRSAREA+290                                             01143000
CRRLDOCT EQU   CRRSAREA+288                                             01144000
CRRBTLEN EQU   CRRSAREA+284                                             01145000
CRRBLEN  EQU   CRRSAREA+282                                             01146000
CRRBRTCD EQU   CRRSAREA+281                                             01147000
@NM00092 EQU   CRRBFLGS                                                 01148000
CRRBFLG1 EQU   CRRBFLGS                                                 01149000
CRRBLDAD EQU   CRRSAREA+276                                             01150000
CRRBARAD EQU   CRRSAREA+272                                             01151000
CRRRTN12 EQU   CRRSAREA+268                                             01152000
CRRRTN11 EQU   CRRSAREA+264                                             01153000
CRRRTN10 EQU   CRRSAREA+260                                             01154000
CRRRTN9  EQU   CRRSAREA+256                                             01155000
CRRRTN8  EQU   CRRSAREA+252                                             01156000
CRRRTN7  EQU   CRRSAREA+248                                             01157000
CRRRTN6  EQU   CRRSAREA+244                                             01158000
CRRRTN5  EQU   CRRSAREA+240                                             01159000
CRRRTN4  EQU   CRRSAREA+236                                             01160000
CRRRTN3  EQU   CRRSAREA+232                                             01161000
CRRRTN2  EQU   CRRSAREA+228                                             01162000
CRRRTN1  EQU   CRRSAREA+224                                             01163000
CRRRES1  EQU   CRRSAREA+222                                             01164000
CRRLCNT  EQU   CRRSAREA+220                                             01165000
CRRATCVT EQU   CRRSAREA+216                                             01166000
CRRVALCK EQU   CRRSAREA+212                                             01167000
CRRARPL  EQU   CRRTRBUF+4                                               01168000
CRRBIND  EQU   CRRTRBUF+3                                               01169000
CRRTRRES EQU   CRRTRBUF                                                 01170000
CRRCLDO  EQU   CRRSAREA+200                                             01171000
CRRUECB  EQU   CRRSAREA+196                                             01172000
CRRLCPB  EQU   CRRSAREA+192                                             01173000
CRRCMDAD EQU   CRRSAREA+188                                             01174000
CRRFMCB  EQU   CRRSAREA+184                                             01175000
CRRCLCCW EQU   CRRSAREA+180                                             01176000
CRRESR2  EQU   CRRESR+1                                                 01177000
CRRESR1  EQU   CRRESR                                                   01178000
CRRDSB2  EQU   CRRDSB+1                                                 01179000
CRRDSB1  EQU   CRRDSB                                                   01180000
CRRDTACT EQU   CRRSAREA+174                                             01181000
CRRRSV99 EQU   CRRSAREA+173                                             01182000
CRRRDSOH EQU   CRRFDB3                                                  01183000
CRRRLG   EQU   CRRFDB3                                                  01184000
CRRLGFRC EQU   CRRFDB3                                                  01185000
CRRRDEOT EQU   CRRFDB3                                                  01186000
CRRRDEOM EQU   CRRFDB3                                                  01187000
CRRRDEOB EQU   CRRFDB3                                                  01188000
CRRUNUSD EQU   CRRFDB3                                                  01189000
CRRUINPT EQU   CRRFDB3                                                  01190000
CRRSTSAV EQU   CRRFDB2                                                  01191000
CRRCUERR EQU   CRRFDB2                                                  01192000
CRRDLGFL EQU   CRRFDB2                                                  01193000
CRRIOERR EQU   CRRFDB2                                                  01194000
CRRDVUNS EQU   CRRFDB2                                                  01195000
CRRATND  EQU   CRRFDB2                                                  01196000
CRRRVID  EQU   CRRFDB2                                                  01197000
CRRERLK  EQU   CRRFDB2                                                  01198000
CRRRTNCD EQU   CRRFDBK1                                                 01199000
CRRNSNA  EQU   CRRRTYPE                                                 01200000
CRRDFSYN EQU   CRRRTYPE                                                 01201000
CRRRESP  EQU   CRRRTYPE                                                 01202000
CRRDFASY EQU   CRRRTYPE                                                 01203000
CRRDBLCK EQU   CRRRFLG1                                                 01204000
CRRRPSBD EQU   CRRRFLG1                                                 01205000
CRRRPLOQ EQU   CRRRFLG1                                                 01206000
CRRRPLS  EQU   CRRRFLG1                                                 01207000
CRRSW7   EQU   CRRFLGS                                                  01208000
CRRSW6   EQU   CRRFLGS                                                  01209000
CRRSW5   EQU   CRRFLGS                                                  01210000
CRRSW4   EQU   CRRFLGS                                                  01211000
CRRSW3   EQU   CRRFLGS                                                  01212000
CRRSW2   EQU   CRRFLGS                                                  01213000
CRRSW1   EQU   CRRFLGS                                                  01214000
CRRSW0   EQU   CRRFLGS                                                  01215000
CRRRSV04 EQU   CRRFLGS4                                                 01216000
CRRFMCLK EQU   CRRFLGS4                                                 01217000
CRRDLCCW EQU   CRRFLGS3                                                 01218000
CRRRESET EQU   CRRFLGS3                                                 01219000
CRRSUBBK EQU   CRRFLGS3                                                 01220000
CRRRSV08 EQU   CRRFLGS3                                                 01221000
CRRDEBQ  EQU   CRRFLGS3                                                 01222000
CRRSTSPR EQU   CRRFLGS3                                                 01223000
CRRDREQ  EQU   CRRFLGS3                                                 01224000
CRRDFDBK EQU   CRRFLGS3                                                 01225000
CRRDFSB  EQU   CRRFLGS2                                                 01226000
CRRDPROC EQU   CRRFLGS2                                                 01227000
CRREXTS  EQU   CRRFLGS2                                                 01228000
CRRELSRI EQU   CRRFLGS2                                                 01229000
CRRPOST  EQU   CRRFLGS2                                                 01230000
CRRENDLW EQU   CRRFLGS2                                                 01231000
CRRPRGIP EQU   CRRFLGS2                                                 01232000
CRRDEXP  EQU   CRRFLGS2                                                 01233000
CRRSOLRQ EQU   CRRFLGS1                                                 01234000
CRRREQP  EQU   CRRFLGS1                                                 01235000
CRRCPROC EQU   CRRFLGS1                                                 01236000
CRRFINI  EQU   CRRFLGS1                                                 01237000
CRRPREIO EQU   CRRFLGS1                                                 01238000
CRRINIO  EQU   CRRFLGS1                                                 01239000
CRRFLDOS EQU   CRRFLGS1                                                 01240000
CRRDOCUR EQU   CRRFLGS1                                                 01241000
CRRRATS4 EQU   CRRATS+7                                                 01242000
CRRASC31 EQU   CRRSATS                                                  01243000
CRRASC11 EQU   CRRSATS                                                  01244000
CRRASC51 EQU   CRRSATS                                                  01245000
CRRASC40 EQU   CRRSATS                                                  01246000
CRRASC30 EQU   CRRSATS                                                  01247000
CRRASC21 EQU   CRRSATS                                                  01248000
CRRASC10 EQU   CRRSATS                                                  01249000
CRRASC01 EQU   CRRSATS                                                  01250000
CRRSCBND EQU   CRRRATS2                                                 01251000
CRRPLIC  EQU   CRRRATS2                                                 01252000
CRRRC81  EQU   CRRRATS2                                                 01253000
CRRRC80  EQU   CRRRATS2                                                 01254000
CRRRC65  EQU   CRRRATS2                                                 01255000
CRRRC63  EQU   CRRRATS2                                                 01256000
CRRRC55  EQU   CRRRATS2                                                 01257000
CRRRC54  EQU   CRRRATS2                                                 01258000
CRRRC53  EQU   CRRRATS1                                                 01259000
CRRRC52  EQU   CRRRATS1                                                 01260000
CRRRC51  EQU   CRRRATS1                                                 01261000
CRRRC30  EQU   CRRRATS1                                                 01262000
CRRRC26  EQU   CRRRATS1                                                 01263000
CRRRC23  EQU   CRRRATS1                                                 01264000
CRRRC22  EQU   CRRRATS1                                                 01265000
CRRRC21  EQU   CRRRATS1                                                 01266000
@NM00091 EQU   CRRATS4                                                  01267000
CRRC3X   EQU   CRRATS4                                                  01268000
CRRC85   EQU   CRRATS4                                                  01269000
CRRC83   EQU   CRRATS4                                                  01270000
CRRC82   EQU   CRRATS4                                                  01271000
CRRC61   EQU   CRRATS4                                                  01272000
CRRC60   EQU   CRRATS4                                                  01273000
CRRC81   EQU   CRRATS3                                                  01274000
CRRC80   EQU   CRRATS3                                                  01275000
CRRC75   EQU   CRRATS3                                                  01276000
CRRC51   EQU   CRRATS3                                                  01277000
CRRC50   EQU   CRRATS3                                                  01278000
CRRC42   EQU   CRRATS3                                                  01279000
CRRC41   EQU   CRRATS3                                                  01280000
CRRC40   EQU   CRRATS3                                                  01281000
CRRC32   EQU   CRRATS2                                                  01282000
CRRC31   EQU   CRRATS2                                                  01283000
CRRC30   EQU   CRRATS2                                                  01284000
CRRC25   EQU   CRRATS2                                                  01285000
CRRC24   EQU   CRRATS2                                                  01286000
CRRC23   EQU   CRRATS2                                                  01287000
CRRC22   EQU   CRRATS2                                                  01288000
CRRC21   EQU   CRRATS2                                                  01289000
CRRC20   EQU   CRRATS1                                                  01290000
CRRC13   EQU   CRRATS1                                                  01291000
CRRC12   EQU   CRRATS1                                                  01292000
CRRC11   EQU   CRRATS1                                                  01293000
CRRC10   EQU   CRRATS1                                                  01294000
CRRC02   EQU   CRRATS1                                                  01295000
CRRC01   EQU   CRRATS1                                                  01296000
CRRC00   EQU   CRRATS1                                                  01297000
CRRRMAS4 EQU   CRRMAS+7                                                 01298000
CRRMSC31 EQU   CRRSMAS                                                  01299000
CRRMSC11 EQU   CRRSMAS                                                  01300000
CRRMSC51 EQU   CRRSMAS                                                  01301000
CRRMSC40 EQU   CRRSMAS                                                  01302000
CRRMSC30 EQU   CRRSMAS                                                  01303000
CRRMSC21 EQU   CRRSMAS                                                  01304000
CRRMSC10 EQU   CRRSMAS                                                  01305000
CRRMSC01 EQU   CRRSMAS                                                  01306000
@NM00090 EQU   CRRRMAS2                                                 01307000
CRRRM81  EQU   CRRRMAS2                                                 01308000
CRRRM80  EQU   CRRRMAS2                                                 01309000
CRRRM65  EQU   CRRRMAS2                                                 01310000
CRRRM63  EQU   CRRRMAS2                                                 01311000
CRRRM55  EQU   CRRRMAS2                                                 01312000
CRRRM54  EQU   CRRRMAS2                                                 01313000
CRRRM53  EQU   CRRRMAS1                                                 01314000
CRRRM52  EQU   CRRRMAS1                                                 01315000
CRRRM51  EQU   CRRRMAS1                                                 01316000
CRRRM30  EQU   CRRRMAS1                                                 01317000
CRRRM26  EQU   CRRRMAS1                                                 01318000
CRRRM23  EQU   CRRRMAS1                                                 01319000
CRRRM22  EQU   CRRRMAS1                                                 01320000
CRRRM21  EQU   CRRRMAS1                                                 01321000
@NM00089 EQU   CRRMAS4                                                  01322000
CRRM3X   EQU   CRRMAS4                                                  01323000
CRRM85   EQU   CRRMAS4                                                  01324000
CRRM83   EQU   CRRMAS4                                                  01325000
CRRM82   EQU   CRRMAS4                                                  01326000
CRRM61   EQU   CRRMAS4                                                  01327000
CRRM60   EQU   CRRMAS4                                                  01328000
CRRM81   EQU   CRRMAS3                                                  01329000
CRRM80   EQU   CRRMAS3                                                  01330000
CRRM75   EQU   CRRMAS3                                                  01331000
CRRM51   EQU   CRRMAS3                                                  01332000
CRRM50   EQU   CRRMAS3                                                  01333000
CRRM42   EQU   CRRMAS3                                                  01334000
CRRM41   EQU   CRRMAS3                                                  01335000
CRRM40   EQU   CRRMAS3                                                  01336000
CRRM32   EQU   CRRMAS2                                                  01337000
CRRM31   EQU   CRRMAS2                                                  01338000
CRRM30   EQU   CRRMAS2                                                  01339000
CRRM25   EQU   CRRMAS2                                                  01340000
CRRM24   EQU   CRRMAS2                                                  01341000
CRRM23   EQU   CRRMAS2                                                  01342000
CRRM22   EQU   CRRMAS2                                                  01343000
CRRM21   EQU   CRRMAS2                                                  01344000
CRRM20   EQU   CRRMAS1                                                  01345000
CRRM13   EQU   CRRMAS1                                                  01346000
CRRM12   EQU   CRRMAS1                                                  01347000
CRRM11   EQU   CRRMAS1                                                  01348000
CRRM10   EQU   CRRMAS1                                                  01349000
CRRM02   EQU   CRRMAS1                                                  01350000
CRRM01   EQU   CRRMAS1                                                  01351000
CRRM00   EQU   CRRMAS1                                                  01352000
CRRFSB   EQU   CRRSAREA+144                                             01353000
CRRSAVE1 EQU   CRRSAREA+72                                              01354000
CRRSAVE  EQU   CRRSAREA                                                 01355000
CRRRSV22 EQU   ISTDCCRR+4                                               01356000
CRRCRR   EQU   ISTDCCRR                                                 01357000
CCFRSVD1 EQU   CFCCRT                                                   01358000
CCFCR2   EQU   CFCCRT                                                   01359000
CCFCRP   EQU   CFCCRT                                                   01360000
CCFCR1   EQU   CFCCRT                                                   01361000
CCFCS2   EQU   CFCCRT                                                   01362000
CCFCS1   EQU   CFCCRT                                                   01363000
NCFRSVD  EQU   CFCNTRD                                                  01364000
NCFCR2   EQU   CFCNTRD                                                  01365000
NCFCRP   EQU   CFCNTRD                                                  01366000
NCFCR1   EQU   CFCNTRD                                                  01367000
NCFCS2   EQU   CFCNTRD                                                  01368000
NCFCS1   EQU   CFCNTRD                                                  01369000
PFCRSV01 EQU   ISTPFCRR+13                                              01370000
PFCFTA   EQU   ISTPFCRR+12                                              01371000
CRRFRR   EQU   PFCFRRO                                                  01372000
CRRCHAIN EQU   PFCCRRO                                                  01373000
CRRLEN   EQU   PFCCRRLN                                                 01374000
PFCRSV10 EQU   PFCCRR+1                                                 01375000
CRRID    EQU   PFCCRRID                                                 01376000
ATCAOS   EQU   ISTATCVT+1868                                            01377000
@NM00088 EQU   ISTATCVT+1860                                            01378000
@NM00087 EQU   ISTATCVT+1852                                            01379000
@NM00086 EQU   ISTATCVT+1844                                            01380000
@NM00085 EQU   ISTATCVT+1836                                            01381000
@NM00084 EQU   ISTATCVT+1828                                            01382000
@NM00083 EQU   ISTATCVT+1820                                            01383000
@NM00082 EQU   ISTATCVT+1816                                            01384000
ATCCACSA EQU   ISTATCVT+1812                                            01385000
ATCMXCSA EQU   ISTATCVT+1808                                            01386000
ATCTPMPB EQU   ISTATCVT+1776                                            01387000
ATCTRMPB EQU   ISTATCVT+1744                                            01388000
ATCRPLAC EQU   ATCRPLCN+2                                               01389000
ATCRPLRC EQU   ATCRPLCN                                                 01390000
ATCCRPLQ EQU   ATCCRPL                                                  01391000
ATCSRBAC EQU   ATCSRBCN+2                                               01392000
ATCSRBRC EQU   ATCSRBCN                                                 01393000
ATCSRBQ  EQU   ATCSRB                                                   01394000
ATCCRAAC EQU   ATCCRACN+2                                               01395000
ATCCRARC EQU   ATCCRACN                                                 01396000
ATCCRAQ  EQU   ATCCRA                                                   01397000
ATCLUFFD EQU   ISTATCVT+1716                                            01398000
ATCVIOPM EQU   ISTATCVT+1712                                            01399000
ATCTPMMI EQU   ISTATCVT+1708                                            01400000
ATCPXSRB EQU   ISTATCVT+1704                                            01401000
ATCRPLCT EQU   ISTATCVT+1702                                            01402000
ATCCRACT EQU   ISTATCVT+1700                                            01403000
ATCSRBCT EQU   ISTATCVT+1698                                            01404000
ATCSTNSM EQU   ISTATCVT+1697                                            01405000
@NM00081 EQU   ATCZFLAG                                                 01406000
ATCZF001 EQU   ATCZFLAG                                                 01407000
ATCTPCP1 EQU   ISTATCVT+1692                                            01408000
ATCTPCP0 EQU   ISTATCVT+1688                                            01409000
ATCZR01  EQU   ISTATCVT+1684                                            01410000
ATCMPLTA EQU   ISTATCVT+1680                                            01411000
ATCASCB  EQU   ISTATCVT+1676                                            01412000
ATCAP86  EQU   ISTATCVT+1672                                            01413000
ATCAP85  EQU   ISTATCVT+1668                                            01414000
ATCAP84  EQU   ISTATCVT+1664                                            01415000
ATCAP83  EQU   ISTATCVT+1660                                            01416000
ATCAP82  EQU   ISTATCVT+1656                                            01417000
ATCAP69  EQU   ISTATCVT+1652                                            01418000
ATCAP66  EQU   ISTATCVT+1648                                            01419000
ATCAP62  EQU   ISTATCVT+1644                                            01420000
ATCAPC59 EQU   ISTATCVT+1640                                            01421000
ATCAP56  EQU   ISTATCVT+1636                                            01422000
ATCAP55  EQU   ISTATCVT+1632                                            01423000
ATCAP41  EQU   ISTATCVT+1628                                            01424000
ATCAPC25 EQU   ISTATCVT+1624                                            01425000
ATCAP23  EQU   ISTATCVT+1620                                            01426000
ATCAPBE  EQU   ISTATCVT+1616                                            01427000
ATCPSTA  EQU   ISTATCVT+1612                                            01428000
ATCSMABF EQU   ISTATCVT+1608                                            01429000
ATCSMAPR EQU   ISTATCVT+1604                                            01430000
ATCTPWQA EQU   ISTATCVT+1600                                            01431000
ATCSMAID EQU   ISTATCVT+1596                                            01432000
ATCSMARA EQU   ISTATCVT+1592                                            01433000
ATCCACXA EQU   ISTATCVT+1588                                            01434000
ATCATA10 EQU   ISTATCVT+1584                                            01435000
ATCHLTCB EQU   ISTATCVT+1580                                            01436000
@NM00080 EQU   ATCVTFLG                                                 01437000
ATCVTACT EQU   ATCVTFLG                                                 01438000
@NM00079 EQU   @NM00078                                                 01439000
ATCVTMAB EQU   @NM00078                                                 01440000
ATCVTBAM EQU   ISTATCVT+1572                                            01441000
@NM00077 EQU   ISTATCVT+1568                                            01442000
@NM00076 EQU   ISTATCVT+1520                                            01443000
ATCCCOOC EQU   ISTATCVT+1516                                            01444000
@NM00075 EQU   ISTATCVT+1513                                            01445000
ATCSNUF  EQU   ATCENFLG                                                 01446000
ATCOPKL  EQU   ATCENFLG                                                 01447000
ATCABEN  EQU   ATCENFLG                                                 01448000
ATCSRDN  EQU   ATCENFLG                                                 01449000
ATCDLDN  EQU   ATCENFLG                                                 01450000
ATCTIMER EQU   ISTATCVT+1508                                            01451000
ATCAIWT  EQU   ISTATCVT+1504                                            01452000
ATCOROBT EQU   ISTATCVT+1500                                            01453000
ATCDMAPP EQU   ISTATCVT+1496                                            01454000
ATCZDVTX EQU   ISTATCVT+1492                                            01455000
ATCPXCRA EQU   ISTATCVT+1488                                            01456000
ATCICNCB EQU   ISTATCVT+1484                                            01457000
ATCCMTCB EQU   ISTATCVT+1480                                            01458000
ATCPRPH  EQU   ISTATCVT+1476                                            01459000
ATCGSRBF EQU   ATCGSRBG                                                 01460000
ATCSRBRT EQU   ISTATCVT+1468                                            01461000
ATCTSCPC EQU   ISTATCVT+1464                                            01462000
@NM00074 EQU   ISTATCVT+1460                                            01463000
ATCCDTCB EQU   ISTATCVT+1456                                            01464000
ATCORFRL EQU   ISTATCVT+1452                                            01465000
ATCORFPX EQU   ISTATCVT+1448                                            01466000
ATCORFMG EQU   ISTATCVT+1444                                            01467000
ATCSMBQ  EQU   ISTATCVT+1440                                            01468000
ATCINFDD EQU   ISTATCVT+1436                                            01469000
ATCAP67  EQU   ISTATCVT+1432                                            01470000
ATCAP65  EQU   ISTATCVT+1428                                            01471000
ATCAP64  EQU   ISTATCVT+1424                                            01472000
ATCAP63  EQU   ISTATCVT+1420                                            01473000
ATCAP61  EQU   ISTATCVT+1416                                            01474000
ATCAP58  EQU   ISTATCVT+1412                                            01475000
ATCAP57  EQU   ISTATCVT+1408                                            01476000
ATCAP54  EQU   ISTATCVT+1404                                            01477000
ATCAP53  EQU   ISTATCVT+1400                                            01478000
ATCAP52  EQU   ISTATCVT+1396                                            01479000
ATCAP51  EQU   ISTATCVT+1392                                            01480000
ATCAP38  EQU   ISTATCVT+1388                                            01481000
ATCAP37  EQU   ISTATCVT+1384                                            01482000
ATCAP34  EQU   ISTATCVT+1380                                            01483000
ATCAP32  EQU   ISTATCVT+1376                                            01484000
ATCAP31  EQU   ISTATCVT+1372                                            01485000
ATCAP12  EQU   ISTATCVT+1368                                            01486000
ATCAP11  EQU   ISTATCVT+1364                                            01487000
ATCDAPDG EQU   ATCDAPVT+20                                              01488000
ATCDXCEA EQU   ATCDAPVT+16                                              01489000
ATCDCEA  EQU   ATCDAPVT+12                                              01490000
ATCDPCIA EQU   ATCDAPVT+8                                               01491000
ATCDSIOA EQU   ATCDAPVT+4                                               01492000
ATCDEOEA EQU   ATCDAPVT                                                 01493000
ATCZAEA  EQU   ATCICAPP+16                                              01494000
ATCZCEA  EQU   ATCICAPP+12                                              01495000
ATCZCPCI EQU   ATCICAPP+8                                               01496000
ATCZSIOA EQU   ATCICAPP+4                                               01497000
ATCCDRPH EQU   ATCICAPP                                                 01498000
ATCORQG  EQU   ATCORSRB                                                 01499000
ATCORTBF EQU   ATCSQAFR                                                 01500000
@NM00073 EQU   ISTATCVT+1308                                            01501000
ATCZLAEA EQU   ATCLDAPP+16                                              01502000
ATCZLCEA EQU   ATCLDAPP+12                                              01503000
ATCZLPCI EQU   ATCLDAPP+8                                               01504000
ATCSMFRR EQU   ATCLDAPP+4                                               01505000
ATCCDTID EQU   ATCLDAPP                                                 01506000
@NM00072 EQU   ISTATCVT+1256                                            01507000
ATCZPAB2 EQU   ISTATCVT+1224                                            01508000
@NM00071 EQU   ISTATCVT+1224                                            01509000
@NM00070 EQU   ISTATCVT+1164                                            01510000
ATCCPCFE EQU   ISTATCVT+1160                                            01511000
@NM00069 EQU   ATCRID+2                                                 01512000
ATCCDRMA EQU   ATCRID                                                   01513000
@NM00068 EQU   ATCSMSDQ+8                                               01514000
@NM00067 EQU   ATCSMSDQ+4                                               01515000
@NM00066 EQU   ATCSMSDQ                                                 01516000
ATCSEQNO EQU   ISTATCVT+1136                                            01517000
ATCSMPMD EQU   ISTATCVT+1132                                            01518000
ATCPAREA EQU   ISTATCVT+1128                                            01519000
ATCCPCSM EQU   ISTATCVT+1124                                            01520000
ATCQLOCK EQU   ISTATCVT+1120                                            01521000
ATCITQLE EQU   ISTATCVT+1116                                            01522000
ATCSQCDS EQU   ISTATCVT+1112                                            01523000
ATCUSSVT EQU   ISTATCVT+1108                                            01524000
ATCNOSQ  EQU   ISTATCVT+1104                                            01525000
ATCINCIP EQU   ATCCPDVT+4                                               01526000
ATCTSCNI EQU   ATCCPDVT                                                 01527000
ATCMGCRT EQU   ISTATCVT+1092                                            01528000
ATCMACRT EQU   ISTATCVT+1088                                            01529000
ATCCSMT  EQU   ISTATCVT+1084                                            01530000
ATCDRUSL EQU   ISTATCVT+1080                                            01531000
ATCDRULL EQU   ISTATCVT+1076                                            01532000
ATCCFCDR EQU   ISTATCVT+1072                                            01533000
@NM00065 EQU   ISTATCVT+1069                                            01534000
ATCMROUT EQU   ISTATCVT+1060                                            01535000
ATCONFIG EQU   ISTATCVT+1052                                            01536000
ATCNODEL EQU   ISTATCVT+1044                                            01537000
@NM00064 EQU   @NM00063+9                                               01538000
ATCLAST  EQU   ATCSHRFG                                                 01539000
ATCSHRTN EQU   @NM00063                                                 01540000
@NM00062 EQU   ISTATCVT+1026                                            01541000
ATCNMCTR EQU   ISTATCVT+1024                                            01542000
ATCPOIA  EQU   ATCRNO+1                                                 01543000
@NM00061 EQU   ATCRNO                                                   01544000
ATCLCLCT EQU   ATCVLCNT+2                                               01545000
ATCRNCNT EQU   ATCVLCNT                                                 01546000
ATCHBSIZ EQU   ATCHPGM+2                                                01547000
ATCHBFNO EQU   ATCHPGM                                                  01548000
@NM00060 EQU   ISTATCVT+1011                                            01549000
ATCXRANG EQU   ISTATCVT+1010                                            01550000
ATCMAXID EQU   ISTATCVT+1009                                            01551000
ATCMSGSP EQU   ISTATCVT+1008                                            01552000
ATCCIDM  EQU   ISTATCVT+1006                                            01553000
ATCACTRM EQU   ISTATCVT+1004                                            01554000
ATCECTLP EQU   ISTATCVT+1000                                            01555000
ATCECNET EQU   ISTATCVT+996                                             01556000
ATCECOPC EQU   ISTATCVT+992                                             01557000
ATCECSES EQU   ISTATCVT+988                                             01558000
ATCECDSP EQU   ISTATCVT+984                                             01559000
ATCECVRY EQU   ISTATCVT+980                                             01560000
ATCECHLT EQU   ISTATCVT+976                                             01561000
ATCECMOD EQU   ISTATCVT+972                                             01562000
ATCVDLOK EQU   ISTATCVT+968                                             01563000
ATCRDTLK EQU   ISTATCVT+964                                             01564000
ATCVOCLK EQU   ISTATCVT+960                                             01565000
ATCITLIM EQU   ISTATCVT+958                                             01566000
ATCTMINV EQU   ISTATCVT+956                                             01567000
ATCHOSTA EQU   ISTATCVT+954                                             01568000
ATCPUNSA EQU   ISTATCVT+952                                             01569000
ATCSAF   EQU   ISTATCVT+950                                             01570000
ATCVTMID EQU   ATCSSCPA                                                 01571000
ATCHCNID EQU   ATCONID+2                                                01572000
ATCSCNID EQU   ATCONID                                                  01573000
@NM00059 EQU   ATCBITAN+3                                               01574000
@NM00058 EQU   ATCBITAN+2                                               01575000
@NM00057 EQU   ATCFLAG2                                                 01576000
@NM00056 EQU   ATCFLAG2                                                 01577000
@NM00055 EQU   ATCFLAG2                                                 01578000
ATCCRYPF EQU   ATCFLAG2                                                 01579000
ATCTUNCL EQU   ATCFLAG2                                                 01580000
ATCTUNRQ EQU   ATCFLAG2                                                 01581000
ATCTUNAC EQU   ATCFLAG2                                                 01582000
ATCCDLRA EQU   ATCFLAG2                                                 01583000
@NM00054 EQU   ATCBITAN                                                 01584000
@NM00053 EQU   ATCSTAT4                                                 01585000
@NM00052 EQU   ATCSTAT4                                                 01586000
@NM00051 EQU   ATCSTAT4                                                 01587000
@NM00050 EQU   ATCSTAT4                                                 01588000
@NM00049 EQU   ATCSTAT4                                                 01589000
ATCPRTAT EQU   ATCSTAT4                                                 01590000
ATCNCSD  EQU   ATCSTAT4                                                 01591000
ATCMTST  EQU   ATCSTAT4                                                 01592000
@NM00048 EQU   ATCPOFLG                                                 01593000
@NM00047 EQU   ATCPOFLG                                                 01594000
@NM00046 EQU   ATCPOFLG                                                 01595000
@NM00045 EQU   ATCPOFLG                                                 01596000
@NM00044 EQU   ATCPOFLG                                                 01597000
@NM00043 EQU   ATCPOFLG                                                 01598000
@NM00042 EQU   ATCPOFLG                                                 01599000
ATCPOUNS EQU   ATCPOFLG                                                 01600000
@NM00041 EQU   ATCSTAT+1                                                01601000
ATCHIP   EQU   ATCSTAT1                                                 01602000
ATCMDHLT EQU   ATCSTAT1                                                 01603000
ATCINHLT EQU   ATCSTAT1                                                 01604000
ATCNETSL EQU   ATCSTAT1                                                 01605000
ATCQKHLT EQU   ATCSTAT1                                                 01606000
ATCSNHLT EQU   ATCSTAT1                                                 01607000
ATCACTIV EQU   ATCSTAT1                                                 01608000
ATCSTART EQU   ATCSTAT1                                                 01609000
ATCNOP00 EQU   ISTATCVT+932                                             01610000
ATCTSBUF EQU   ISTATCVT+928                                             01611000
ATCFEPT  EQU   ISTATCVT+924                                             01612000
ATCFDVT  EQU   ISTATCVT+920                                             01613000
ATCCONFT EQU   ISTATCVT+916                                             01614000
ATCRDTH  EQU   ISTATCVT+912                                             01615000
ATCSIBQ  EQU   ISTATCVT+908                                             01616000
ATCHLTMS EQU   ISTATCVT+904                                             01617000
ATCECPRM EQU   ISTATCVT+900                                             01618000
ATCVPARM EQU   ISTATCVT+896                                             01619000
ATCOCHA  EQU   ISTATCVT+892                                             01620000
ATCDSPLQ EQU   ISTATCVT+888                                             01621000
ATCVARYQ EQU   ISTATCVT+884                                             01622000
ATCHALTQ EQU   ISTATCVT+880                                             01623000
ATCMODQ  EQU   ISTATCVT+876                                             01624000
ATCSRT   EQU   ISTATCVT+872                                             01625000
ATCRDT   EQU   ISTATCVT+868                                             01626000
ATCSDVT  EQU   ISTATCVT+864                                             01627000
ATCDLRPT EQU   ISTATCVT+860                                             01628000
ATCACDA  EQU   ISTATCVT+852                                             01629000
ATCMNT   EQU   ISTATCVT+848                                             01630000
ATCUEP   EQU   ISTATCVT+844                                             01631000
ATCNODDS EQU   ISTATCVT+840                                             01632000
ATCITRT  EQU   ISTATCVT+836                                             01633000
ATCTODVT EQU   ISTATCVT+832                                             01634000
ATCTRCPT EQU   ISTATCVT+828                                             01635000
ATCMODTB EQU   ISTATCVT+824                                             01636000
ATCUSSPT EQU   ISTATCVT+820                                             01637000
ATCTUBUF EQU   ISTATCVT+816                                             01638000
ATCTACB  EQU   ISTATCVT+812                                             01639000
ATCDWA   EQU   ISTATCVT+808                                             01640000
ATCCFCR2 EQU   ATCPODVT                                                 01641000
ATCEPA   EQU   ISTATCVT+800                                             01642000
ATCPULQB EQU   @NM00040+16                                              01643000
ATCMCQAB EQU   @NM00040+12                                              01644000
ATCLUSMQ EQU   @NM00040+8                                               01645000
ATCLUIOQ EQU   @NM00040+4                                               01646000
ATCIOLQB EQU   @NM00040                                                 01647000
ATCTSCAP EQU   ATCANYDT                                                 01648000
ATCTSCCO EQU   ATCLUDVT+4                                               01649000
ATCTSCSR EQU   ATCLUDVT                                                 01650000
ATCVTLOD EQU   ISTATCVT+764                                             01651000
ATCTSCLF EQU   ISTATCVT+760                                             01652000
ATCTSCLE EQU   ISTATCVT+756                                             01653000
ATCTSCLB EQU   ISTATCVT+752                                             01654000
ATCTSCLS EQU   ISTATCVT+748                                             01655000
ATCTSCCF EQU   ISTATCVT+744                                             01656000
ATCTSCFV EQU   ISTATCVT+740                                             01657000
ATCTSCCE EQU   ISTATCVT+736                                             01658000
ATCTSCCB EQU   ISTATCVT+732                                             01659000
ATCTSCWS EQU   ISTATCVT+728                                             01660000
ATCTSCEM EQU   ISTATCVT+724                                             01661000
ATCTSCNS EQU   ISTATCVT+720                                             01662000
ATCTSCER EQU   ISTATCVT+716                                             01663000
ATCTSCPR EQU   ISTATCVT+712                                             01664000
ATCTSCGR EQU   ISTATCVT+708                                             01665000
ATCTSCCI EQU   ISTATCVT+704                                             01666000
ATCTSVT  EQU   ISTATCVT+700                                             01667000
ATCDVLOD EQU   ISTATCVT+696                                             01668000
ATCCDCNR EQU   ISTATCVT+692                                             01669000
ATCCDCNF EQU   ISTATCVT+688                                             01670000
ATCCDCND EQU   ISTATCVT+684                                             01671000
ATCCDCNA EQU   ISTATCVT+680                                             01672000
ATCCDCCP EQU   ISTATCVT+676                                             01673000
ATCCDFDN EQU   ISTATCVT+672                                             01674000
ATCCDFIN EQU   ISTATCVT+668                                             01675000
ATCCDFND EQU   ISTATCVT+664                                             01676000
ATCCDDEL EQU   ISTATCVT+660                                             01677000
ATCCDADD EQU   ISTATCVT+656                                             01678000
ATCTCLIM EQU   ISTATCVT+652                                             01679000
ATCRACTR EQU   ISTATCVT+648                                             01680000
ATCRACTI EQU   ISTATCVT+644                                             01681000
ATCREMOV EQU   ISTATCVT+640                                             01682000
ATCRACIO EQU   ISTATCVT+636                                             01683000
ATCADD   EQU   ISTATCVT+632                                             01684000
ATCPUCRT EQU   ISTATCVT+628                                             01685000
ATCSMRQ  EQU   ISTATCVT+620                                             01686000
ATCORCPX EQU   ISTATCVT+616                                             01687000
ATCORCAF EQU   ISTATCVT+612                                             01688000
ATCFRSTR EQU   ATCGTSTR                                                 01689000
ATCSTMA  EQU   ISTATCVT+604                                             01690000
ATCSRTAD EQU   ISTATCVT+600                                             01691000
ATCOCRT  EQU   ISTATCVT+596                                             01692000
ATCOCCFS EQU   ISTATCVT+592                                             01693000
ATCOCCFP EQU   ISTATCVT+588                                             01694000
ATCSRTDF EQU   ISTATCVT+584                                             01695000
ATCLUCRT EQU   ISTATCVT+580                                             01696000
ATCINCY5 EQU   ISTATCVT+576                                             01697000
ATCINCW3 EQU   ISTATCVT+572                                             01698000
ATCINCU6 EQU   ISTATCVT+568                                             01699000
ATCINCTQ EQU   ISTATCVT+564                                             01700000
ATCINCS1 EQU   ISTATCVT+560                                             01701000
ATCSRTAB EQU   ISTATCVT+556                                             01702000
ATCINCRD EQU   ISTATCVT+552                                             01703000
ATCINCPH EQU   ISTATCVT+548                                             01704000
ATCINCLQ EQU   ISTATCVT+544                                             01705000
ATCNOCRT EQU   ISTATCVT+540                                             01706000
ATCINCF1 EQU   ISTATCVT+536                                             01707000
ATCINCCI EQU   ISTATCVT+532                                             01708000
ATCINCCO EQU   ISTATCVT+528                                             01709000
ATCBLDLA EQU   ISTATCVT+524                                             01710000
ATCALOAD EQU   ISTATCVT+520                                             01711000
ATCADEL  EQU   ISTATCVT+516                                             01712000
ATCESC02 EQU   ISTATCVT+512                                             01713000
ATCESC01 EQU   ISTATCVT+508                                             01714000
ATCDEC01 EQU   ISTATCVT+504                                             01715000
ATCDEC00 EQU   ISTATCVT+500                                             01716000
ATCCPCRT EQU   ISTATCVT+496                                             01717000
ATCMSGM  EQU   ISTATCVT+492                                             01718000
ATCCPCFR EQU   ISTATCVT+488                                             01719000
ATCCPCGR EQU   ISTATCVT+484                                             01720000
ATCCPCPP EQU   ISTATCVT+480                                             01721000
ATCMSGP  EQU   ISTATCVT+476                                             01722000
ATCCPCNT EQU   ISTATCVT+472                                             01723000
ATCAUTHA EQU   ISTATCVT+468                                             01724000
ATCACCTA EQU   ISTATCVT+464                                             01725000
ATCAP39  EQU   ISTATCVT+460                                             01726000
ATCAP36  EQU   ISTATCVT+456                                             01727000
ATCAP35  EQU   ISTATCVT+452                                             01728000
ATCAPCR5 EQU   ISTATCVT+444                                             01729000
ATCAICPT EQU   ISTATCVT+440                                             01730000
ATCAPI   EQU   ISTATCVT+436                                             01731000
ATCAICTN EQU   ISTATCVT+432                                             01732000
ATCACC01 EQU   ISTATCVT+428                                             01733000
ATCACC00 EQU   ISTATCVT+424                                             01734000
ATCLDECB EQU   ATCLDTIL+12                                              01735000
ATCLDLCK EQU   ATCLDTIL+8                                               01736000
ATCLDLST EQU   ATCLDTIL+4                                               01737000
ATCLDNCS EQU   ATCLDTIL                                                 01738000
ATCNOSPB EQU   ISTATCVT+376                                             01739000
ATCNSPAB EQU   ISTATCVT+344                                             01740000
ATCLUSRT EQU   ISTATCVT+312                                             01741000
ATCPUIOP EQU   ISTATCVT+280                                             01742000
ATCPUPAB EQU   ISTATCVT+248                                             01743000
ATCPXPAB EQU   ISTATCVT+216                                             01744000
ATCPOPAB EQU   ISTATCVT+184                                             01745000
@NM00039 EQU   ATCVDPAB+16                                              01746000
ATCFEPAB EQU   ATCVDPAB                                                 01747000
ATCTCIPB EQU   ISTATCVT+120                                             01748000
ATCCSPAB EQU   ATCSMPAB+16                                              01749000
@NM00038 EQU   ATCSMPAB                                                 01750000
ATCTMRPB EQU   ISTATCVT+56                                              01751000
ATCITPAB EQU   ISTATCVT+24                                              01752000
@NM00037 EQU   ATCITRA1                                                 01753000
ATCITSCP EQU   ATCITRA1                                                 01754000
ATCITMSG EQU   ATCITRA1                                                 01755000
ATCITPIU EQU   ATCITRA1                                                 01756000
ATCITSMS EQU   ATCITRA1                                                 01757000
ATCITPSS EQU   ATCITRA1                                                 01758000
ATCITLCK EQU   ATCITRA1                                                 01759000
ATCITAPI EQU   ATCITRA1                                                 01760000
ATCITCNT EQU   ATCITFLG                                                 01761000
ATCITRPH EQU   ATCITCDS                                                 01762000
ATCITTBL EQU   ATCITFLD+4                                               01763000
ATCITPRM EQU   ATCITFLD                                                 01764000
ATCPTCHA EQU   ATCRPTCH+4                                               01765000
ATCVTLVL EQU   ATCRPTCH                                                 01766000
RPHUPSTA EQU   ISTRPH+104                                               01767000
RPHSAV15 EQU   RPHWORK+56                                               01768000
RPHSAV14 EQU   RPHWORK+52                                               01769000
RPHSAV13 EQU   RPHWORK+48                                               01770000
RPHSAV12 EQU   RPHWORK+44                                               01771000
RPHSAV11 EQU   RPHWORK+40                                               01772000
RPHSAV10 EQU   RPHWORK+36                                               01773000
RPHSAVE9 EQU   RPHWORK+32                                               01774000
RPHSAVE8 EQU   RPHWORK+28                                               01775000
RPHSAVE7 EQU   RPHWORK+24                                               01776000
RPHSAVE6 EQU   RPHWORK+20                                               01777000
RPHSAVE5 EQU   RPHWORK+16                                               01778000
RPHSAVE4 EQU   RPHWORK+12                                               01779000
RPHSAVE3 EQU   RPHWORK+8                                                01780000
RPHSAVE2 EQU   RPHWORK+4                                                01781000
RPHSHALF EQU   RPHSAVE1+2                                               01782000
RPHSBIT8 EQU   RPHSBITS                                                 01783000
RPHSBIT7 EQU   RPHSBITS                                                 01784000
RPHSBIT6 EQU   RPHSBITS                                                 01785000
RPHSBIT5 EQU   RPHSBITS                                                 01786000
RPHSBIT4 EQU   RPHSBITS                                                 01787000
RPHSBIT3 EQU   RPHSBITS                                                 01788000
RPHSBIT2 EQU   RPHSBITS                                                 01789000
RPHSBIT1 EQU   RPHSBITS                                                 01790000
RPHSBYTE EQU   RPHSAVE1                                                 01791000
RPHPABQP EQU   RPHPABQA+1                                               01792000
RPHPABFG EQU   RPHPABQA                                                 01793000
RPHSRP34 EQU   RPHSRPRM+2                                               01794000
RPHSRP12 EQU   RPHSRPRM                                                 01795000
RPHWEGT  EQU   RPHCSPA                                                  01796000
RPHMAJCB EQU   ISTRPH+21                                                01797000
RPHPABOF EQU   ISTRPH+20                                                01798000
RPHRESUM EQU   RPHRESMA+1                                               01799000
@NM00036 EQU   RPHWPFLG                                                 01800000
RPHPURGE EQU   RPHWPFLG                                                 01801000
RPHPT    EQU   RPHWPFLG                                                 01802000
RPHWT    EQU   RPHWPFLG                                                 01803000
RPHRSKEY EQU   RPHWPFLG                                                 01804000
RPHDVTA  EQU   ISTRPH+12                                                01805000
RPHTIK   EQU   RPHTSKID+3                                               01806000
@NM00035 EQU   RPHTSKID                                                 01807000
RPHRPHAP EQU   RPHRPHA+1                                                01808000
@NM00034 EQU   RPHRPHA                                                  01809000
RPHGATE  EQU   RPHRPHA                                                  01810000
RPHABEND EQU   RPHFLGB                                                  01811000
RPHUWAIT EQU   RPHFLGB                                                  01812000
@NM00033 EQU   RPHFLGB                                                  01813000
RPHPGCMP EQU   RPHFLGB                                                  01814000
RPHFBAPS EQU   RPHFLGB                                                  01815000
RPHBSSP  EQU   RPHFLGB                                                  01816000
RPHLOCK  EQU   RPHFLGB                                                  01817000
RPHFNFLG EQU   RPHFSTLC                                                 01818000
RPHMLTCP EQU   RPHFLAGS                                                 01819000
RPHSMCLR EQU   RPHFLAGS                                                 01820000
RPHSMTYP EQU   RPHFLAGS                                                 01821000
RPHSMQ   EQU   RPHFLAGS                                                 01822000
RPHAPTYP EQU   RPHFLAGS                                                 01823000
RPHSPGIN EQU   RPHFLAGS                                                 01824000
RPHOGIND EQU   RPHFLAGS                                                 01825000
RPHLNGTH EQU   RPHCNTL+1                                                01826000
RPHTYPE  EQU   RPHCNTL                                                  01827000
ISTRETR7 EQU   ISTRETRG+4                                               01828000
ISTRETR6 EQU   ISTRETRG                                                 01829000
ISTRSV01 EQU   ISTAVT+42                                                01830000
ISTPDAVP EQU   ISTAVT+38                                                01831000
ISTVTTP  EQU   ISTAVT+36                                                01832000
ISTAGTWT EQU   ISTAVT+34                                                01833000
ISTATRT  EQU   ISTAVT+32                                                01834000
ISTARID  EQU   ISTAVT+30                                                01835000
ISTX1    EQU   ISTAVT+29                                                01836000
ISTPHNM  EQU   ISTAVT+24                                                01837000
ISTAPSEX EQU   ISTAVT+20                                                01838000
ISTVTTIK EQU   ISTAVT+18                                                01839000
AVTASID  EQU   ISTAVT+16                                                01840000
ISTAPSTA EQU   ISTAVT+12                                                01841000
ISTAS53  EQU   ISTAVT+8                                                 01842000
ISTAS49  EQU   ISTAVT+4                                                 01843000
ISTACVT  EQU   ISTAVT                                                   01844000
DYPPAB   EQU   ISTDYPAB+16                                              01845000
DYPOCRPH EQU   DYPPACMD                                                 01846000
DYPTSKID EQU   ISTDYPAB+8                                               01847000
DYPPACTB EQU   DYPCHAIN                                                 01848000
DYPFLGS  EQU   ISTDYPAB+2                                               01849000
DYPLNGTH EQU   ISTDYPAB+1                                               01850000
DYPTYPE  EQU   ISTDYPAB                                                 01851000
PABRPHA  EQU   PABRPHFG+1                                               01852000
PABNODQ  EQU   PABFLAGS                                                 01853000
PABINHBT EQU   PABFLAGS                                                 01854000
PABERLOK EQU   PABERRLK                                                 01855000
PABSSN   EQU   PABFLAGS                                                 01856000
PABDYNAM EQU   PABFLAGS                                                 01857000
PABXTND  EQU   PABFLAGS                                                 01858000
PABPRIOR EQU   PABFLAGS                                                 01859000
PABAPYP  EQU   PABFLAGS                                                 01860000
PABDVTA  EQU   ISTPAB+9                                                 01861000
PABOFFST EQU   ISTPAB+8                                                 01862000
PABCHNGP EQU   PABCHAIN+1                                               01863000
PABRSV02 EQU   PABCHAIN                                                 01864000
PABDELAY EQU   PABCHAIN                                                 01865000
PABQUED  EQU   PABRUNNG                                                 01866000
PABRESET EQU   PABCHAIN                                                 01867000
PABUNCON EQU   PABCHAIN                                                 01868000
PABCDP   EQU   PABCHAIN                                                 01869000
PABRESCH EQU   PABCHAIN                                                 01870000
PABCHNG  EQU   PABCHAIN                                                 01871000
PABWEQP  EQU   PABWEQA+1                                                01872000
PABRSV01 EQU   PABWEQA                                                  01873000
PABWEQG  EQU   PABWEQA                                                  01874000
LOKXCL   EQU   @NM00030                                                 01875000
LOKPRY   EQU   @NM00030                                                 01876000
@NM00031 EQU   @NM00030                                                 01877000
@NM00029 EQU   LOKCHNG                                                  01878000
LOKCT    EQU   ISTLOK                                                   01879000
@NM00028 EQU   SRBSECT+40                                               01880000
@NM00027 EQU   SRBSECT+38                                               01881000
SRBPRIOR EQU   SRBSECT+37                                               01882000
SRBPKF   EQU   SRBSECT+36                                               01883000
SRBSAVE  EQU   SRBSECT+32                                               01884000
SRBPARM  EQU   SRBSECT+28                                               01885000
SRBRMTR  EQU   SRBSECT+24                                               01886000
SRBEP    EQU   SRBSECT+20                                               01887000
SRBPTCB  EQU   SRBFLC+4                                                 01888000
SRBPASID EQU   SRBFLC+2                                                 01889000
SRBCPAFF EQU   SRBFLC                                                   01890000
SRBASCB  EQU   SRBSECT+8                                                01891000
SRBFLNK  EQU   SRBSECT+4                                                01892000
SRBID    EQU   SRBSECT                                                  01893000
ASXBEND  EQU   ASXB+232                                                 01894000
ASXBRV25 EQU   ASXB+228                                                 01895000
ASXBRV24 EQU   ASXB+224                                                 01896000
ASXBPT0E EQU   ASXB+220                                                 01897000
ASXBCRB4 EQU   ASXBCASW+3                                               01898000
ASXBCRB3 EQU   ASXBCASW+2                                               01899000
ASXBCRB2 EQU   ASXBCASW+1                                               01900000
ASXBCR06 EQU   ASXBCRB1                                                 01901000
ASXBCR05 EQU   ASXBCRB1                                                 01902000
ASXBCR04 EQU   ASXBCRB1                                                 01903000
ASXBCR03 EQU   ASXBCRB1                                                 01904000
ASXBCR02 EQU   ASXBCRB1                                                 01905000
ASXBCR01 EQU   ASXBCRB1                                                 01906000
ASXBTFD  EQU   ASXBCRB1                                                 01907000
ASXBPIP  EQU   ASXBCRB1                                                 01908000
ASXBCTDC EQU   ASXB+212                                                 01909000
ASXBTDCB EQU   ASXB+208                                                 01910000
ASXBRV19 EQU   ASXB+204                                                 01911000
ASXBRV18 EQU   ASXB+200                                                 01912000
ASXBRV17 EQU   ASXB+196                                                 01913000
ASXBRV16 EQU   ASXB+192                                                 01914000
ASXBLSRB EQU   ASXBAEQ+20                                               01915000
ASXBFSRB EQU   ASXBAEQ+16                                               01916000
ASXBLRQE EQU   ASXBAEQ+12                                               01917000
ASXBFRQE EQU   ASXBAEQ+8                                                01918000
ASXBLIQE EQU   ASXBAEQ+4                                                01919000
ASXBFIQE EQU   ASXBAEQ                                                  01920000
ASXBETSK EQU   ASXB+164                                                 01921000
ASXBSIRB EQU   ASXB+160                                                 01922000
ASXBPSWD EQU   ASXB+152                                                 01923000
ASXBPRG  EQU   ASXB+136                                                 01924000
ASXBRV26 EQU   ASXB+132                                                 01925000
ASXBOUSB EQU   ASXB+128                                                 01926000
ASXBDDR  EQU   ASXB+124                                                 01927000
ASXBRCTD EQU   ASXB+120                                                 01928000
ASXBRSMD EQU   ASXB+116                                                 01929000
ASXBSPSA EQU   ASXB+112                                                 01930000
ASXBFRWA EQU   ASXB+108                                                 01931000
ASXBFLSA EQU   ASXB+36                                                  01932000
ASXBIHSA EQU   ASXB+32                                                  01933000
ASXBRV15 EQU   ASXB+28                                                  01934000
ASXBRV14 EQU   ASXB+24                                                  01935000
ASXBLWA  EQU   ASXB+20                                                  01936000
ASXBRS00 EQU   ASXB+14                                                  01937000
ASXBTCBS EQU   ASXB+12                                                  01938000
ASXBLTCB EQU   ASXB+8                                                   01939000
ASXBFTCB EQU   ASXB+4                                                   01940000
ASXBASXB EQU   ASXB                                                     01941000
ASXBEGIN EQU   ASXB                                                     01942000
ASCBEND  EQU   ASCB+208                                                 01943000
ASCBSRBT EQU   ASCB+200                                                 01944000
ASCBSWTL EQU   ASCB+196                                                 01945000
ASCBRS14 EQU   ASCB+195                                                 01946000
ASCBSMCT EQU   ASCB+194                                                 01947000
ASCBRS12 EQU   ASCB+192                                                 01948000
ASCBPCTT EQU   ASCB+188                                                 01949000
ASCBVGTT EQU   ASCB+184                                                 01950000
ASCBRV43 EQU   ASCBSRQ4                                                 01951000
ASCBRV42 EQU   ASCBSRQ4                                                 01952000
ASCBRV41 EQU   ASCBSRQ4                                                 01953000
ASCBRV40 EQU   ASCBSRQ4                                                 01954000
ASCBRV39 EQU   ASCBSRQ4                                                 01955000
ASCBRV38 EQU   ASCBSRQ4                                                 01956000
ASCBRV37 EQU   ASCBSRQ4                                                 01957000
ASCBRV36 EQU   ASCBSRQ4                                                 01958000
ASCBRV35 EQU   ASCBSRQ3                                                 01959000
ASCBRV34 EQU   ASCBSRQ3                                                 01960000
ASCBRV33 EQU   ASCBSRQ3                                                 01961000
ASCBRV32 EQU   ASCBSRQ3                                                 01962000
ASCBRV31 EQU   ASCBSRQ3                                                 01963000
ASCBRV30 EQU   ASCBSRQ3                                                 01964000
ASCBRV29 EQU   ASCBSRQ3                                                 01965000
ASCBRV28 EQU   ASCBSRQ3                                                 01966000
ASCBRV27 EQU   ASCBSRQ2                                                 01967000
ASCBRV26 EQU   ASCBSRQ2                                                 01968000
ASCBRV25 EQU   ASCBSRQ2                                                 01969000
ASCBRV24 EQU   ASCBSRQ2                                                 01970000
ASCBRV23 EQU   ASCBSRQ2                                                 01971000
ASCBRV22 EQU   ASCBSRQ2                                                 01972000
ASCBRV21 EQU   ASCBSRQ2                                                 01973000
ASCBRV20 EQU   ASCBSRQ2                                                 01974000
ASCBRV19 EQU   ASCBSRQ1                                                 01975000
ASCBRV18 EQU   ASCBSRQ1                                                 01976000
ASCBRV17 EQU   ASCBSRQ1                                                 01977000
ASCBRV16 EQU   ASCBSRQ1                                                 01978000
ASCBRV15 EQU   ASCBSRQ1                                                 01979000
ASCBRV14 EQU   ASCBSRQ1                                                 01980000
ASCBRV13 EQU   ASCBSRQ1                                                 01981000
ASCBSTA  EQU   ASCBSRQ1                                                 01982000
ASCBJBNS EQU   ASCB+176                                                 01983000
ASCBJBNI EQU   ASCB+172                                                 01984000
ASCBMCC  EQU   ASCB+168                                                 01985000
ASCBRTWA EQU   ASCB+164                                                 01986000
ASCBIQEA EQU   ASCB+160                                                 01987000
ASCBXMPQ EQU   ASCB+156                                                 01988000
ASCBRS01 EQU   ASCB+154                                                 01989000
ASCBFMCT EQU   ASCB+152                                                 01990000
ASCBOUXB EQU   ASCB+148                                                 01991000
ASCBOUCB EQU   ASCB+144                                                 01992000
ASCBMECB EQU   ASCB+140                                                 01993000
ASCBQECB EQU   ASCB+136                                                 01994000
ASCBLSQH EQU   ASCBLKGP+4                                               01995000
ASCBLOCK EQU   ASCBLKGP                                                 01996000
ASCBTCBS EQU   ASCB+124                                                 01997000
ASCBNVSC EQU   ASCB+122                                                 01998000
ASCBVSC  EQU   ASCB+120                                                 01999000
ASCBSRBS EQU   ASCB+118                                                 02000000
ASCBSSRB EQU   ASCB+116                                                 02001000
ASCBRV06 EQU   ASCBFLG2                                                 02002000
ASCBRV05 EQU   ASCBFLG2                                                 02003000
ASCBRV04 EQU   ASCBFLG2                                                 02004000
ASCBSNQS EQU   ASCBFLG2                                                 02005000
ASCBS2S  EQU   ASCBFLG2                                                 02006000
ASCBCEXT EQU   ASCBFLG2                                                 02007000
ASCBPXMT EQU   ASCBFLG2                                                 02008000
ASCBXMPT EQU   ASCBFLG2                                                 02009000
ASCBRF07 EQU   ASCBDSP1                                                 02010000
ASCBRF06 EQU   ASCBDSP1                                                 02011000
ASCBRF05 EQU   ASCBDSP1                                                 02012000
ASCBRF04 EQU   ASCBDSP1                                                 02013000
ASCBRF03 EQU   ASCBDSP1                                                 02014000
ASCBRF02 EQU   ASCBDSP1                                                 02015000
ASCBFAIL EQU   ASCBDSP1                                                 02016000
ASCBNOQ  EQU   ASCBDSP1                                                 02017000
ASCBSWCT EQU   ASCB+112                                                 02018000
ASCBTMCH EQU   ASCB+104                                                 02019000
ASCBNSWP EQU   ASCBFLG1                                                 02020000
ASCBTYP1 EQU   ASCBFLG1                                                 02021000
ASCBSTND EQU   ASCBFLG1                                                 02022000
ASCBABNT EQU   ASCBFLG1                                                 02023000
ASCBTERM EQU   ASCBFLG1                                                 02024000
ASCBS3S  EQU   ASCBFLG1                                                 02025000
ASCBCMSH EQU   ASCBFLG1                                                 02026000
ASCBTOFF EQU   ASCBFLG1                                                 02027000
ASCBRF01 EQU   ASCBRCTF                                                 02028000
ASCBTMLW EQU   ASCBRCTF                                                 02029000
ASCBOUT  EQU   ASCBRCTF                                                 02030000
ASCBWAIT EQU   ASCBRCTF                                                 02031000
ASCBRV08 EQU   ASCBRCTF                                                 02032000
ASCBFQU  EQU   ASCBRCTF                                                 02033000
ASCBFRS  EQU   ASCBRCTF                                                 02034000
ASCBTMNO EQU   ASCBRCTF                                                 02035000
ASCBAFFN EQU   ASCBFW1                                                  02036000
ASCBDUMP EQU   ASCB+96                                                  02037000
ASCBQSVC EQU   ASCB+92                                                  02038000
ASCBUBET EQU   ASCB+88                                                  02039000
ASCBECB  EQU   ASCB+84                                                  02040000
ASCBJSTL EQU   ASCB+80                                                  02041000
ASCBEWST EQU   ASCB+72                                                  02042000
ASCBEJST EQU   ASCB+64                                                  02043000
ASCBTSB  EQU   ASCB+60                                                  02044000
ASCBCSCB EQU   ASCB+56                                                  02045000
ASCBRSM  EQU   ASCB+52                                                  02046000
ASCBLDA  EQU   ASCB+48                                                  02047000
ASCBSTOR EQU   ASCB+44                                                  02048000
ASCBDP   EQU   ASCB+43                                                  02049000
ASCBRV07 EQU   ASCB+42                                                  02050000
ASCBIOSM EQU   ASCB+40                                                  02051000
ASCBSEQN EQU   ASCB+38                                                  02052000
ASCBASID EQU   ASCB+36                                                  02053000
ASCBCPUS EQU   ASCB+32                                                  02054000
ASCBSPL  EQU   ASCB+28                                                  02055000
ASCBIOSP EQU   ASCB+24                                                  02056000
ASCBSYNC EQU   ASCBSUPC+4                                               02057000
ASCBSVRB EQU   ASCBSUPC                                                 02058000
ASCBCMSF EQU   ASCB+12                                                  02059000
ASCBBWDP EQU   ASCB+8                                                   02060000
ASCBFWDP EQU   ASCB+4                                                   02061000
ASCBASCB EQU   ASCB                                                     02062000
ASCBEGIN EQU   ASCB                                                     02063000
CVTLEVL  EQU   CVTRELNO+2                                               02064000
CVTNUMB  EQU   CVTRELNO                                                 02065000
CVTMDL   EQU   CVTFIX+250                                               02066000
@NM00002 EQU   CVTFIX+248                                               02067000
@NM00001 EQU   CVTFIX                                                   02068000
CVTRV482 EQU   CVTXTNT2+128                                             02069000
CVTRV481 EQU   CVTXTNT2+124                                             02070000
CVTRV480 EQU   CVTXTNT2+120                                             02071000
CVTRV479 EQU   CVTXTNT2+118                                             02072000
CVTRV478 EQU   CVTXTNT2+117                                             02073000
CVTRV477 EQU   CVTXTNT2+116                                             02074000
CVTRV476 EQU   CVTXTNT2+115                                             02075000
CVTRV475 EQU   CVTXTNT2+114                                             02076000
CVTRV474 EQU   CVTRV466                                                 02077000
CVTRV473 EQU   CVTRV466                                                 02078000
CVTRV472 EQU   CVTRV466                                                 02079000
CVTRV471 EQU   CVTRV466                                                 02080000
CVTRV470 EQU   CVTRV466                                                 02081000
CVTRV469 EQU   CVTRV466                                                 02082000
CVTRV468 EQU   CVTRV466                                                 02083000
CVTRV467 EQU   CVTRV466                                                 02084000
CVTRV465 EQU   CVTRV457                                                 02085000
CVTRV464 EQU   CVTRV457                                                 02086000
CVTRV463 EQU   CVTRV457                                                 02087000
CVTRV462 EQU   CVTRV457                                                 02088000
CVTRV461 EQU   CVTRV457                                                 02089000
CVTRV460 EQU   CVTRV457                                                 02090000
CVTRV459 EQU   CVTRV457                                                 02091000
CVTRV458 EQU   CVTRV457                                                 02092000
CVTRV456 EQU   CVTXTNT2+108                                             02093000
CVTRV455 EQU   CVTXTNT2+104                                             02094000
CVTRV454 EQU   CVTXTNT2+100                                             02095000
CVTRV453 EQU   CVTXTNT2+96                                              02096000
CVTRV452 EQU   CVTXTNT2+94                                              02097000
CVTRV451 EQU   CVTXTNT2+92                                              02098000
CVTRV450 EQU   CVTXTNT2+90                                              02099000
CVTRV449 EQU   CVTXTNT2+88                                              02100000
CVTRV448 EQU   CVTXTNT2+87                                              02101000
CVTRV447 EQU   CVTXTNT2+86                                              02102000
CVTRV446 EQU   CVTRV438                                                 02103000
CVTRV445 EQU   CVTRV438                                                 02104000
CVTRV444 EQU   CVTRV438                                                 02105000
CVTRV443 EQU   CVTRV438                                                 02106000
CVTRV442 EQU   CVTRV438                                                 02107000
CVTRV441 EQU   CVTRV438                                                 02108000
CVTRV440 EQU   CVTRV438                                                 02109000
CVTRV439 EQU   CVTRV438                                                 02110000
CVTRV437 EQU   CVTRV429                                                 02111000
CVTRV436 EQU   CVTRV429                                                 02112000
CVTRV435 EQU   CVTRV429                                                 02113000
CVTRV434 EQU   CVTRV429                                                 02114000
CVTRV433 EQU   CVTRV429                                                 02115000
CVTRV432 EQU   CVTRV429                                                 02116000
CVTRV431 EQU   CVTRV429                                                 02117000
CVTRV430 EQU   CVTRV429                                                 02118000
CVTRV428 EQU   CVTXTNT2+80                                              02119000
CVTRV427 EQU   CVTXTNT2+76                                              02120000
CVTRV426 EQU   CVTXTNT2+72                                              02121000
CVTRV425 EQU   CVTXTNT2+68                                              02122000
CVTATACT EQU   CVTATCVT                                                 02123000
CVTRV423 EQU   CVTXTNT2+62                                              02124000
CVTRV422 EQU   CVTXTNT2+60                                              02125000
CVTRV421 EQU   CVTXTNT2+58                                              02126000
CVTRV420 EQU   CVTXTNT2+56                                              02127000
CVTRV419 EQU   CVTXTNT2+55                                              02128000
CVTRV418 EQU   CVTXTNT2+54                                              02129000
CVTRV417 EQU   CVTRV409                                                 02130000
CVTRV416 EQU   CVTRV409                                                 02131000
CVTRV415 EQU   CVTRV409                                                 02132000
CVTRV414 EQU   CVTRV409                                                 02133000
CVTRV413 EQU   CVTRV409                                                 02134000
CVTRV412 EQU   CVTRV409                                                 02135000
CVTRV411 EQU   CVTRV409                                                 02136000
CVTRV410 EQU   CVTRV409                                                 02137000
CVTRV408 EQU   CVTRV400                                                 02138000
CVTRV407 EQU   CVTRV400                                                 02139000
CVTRV406 EQU   CVTRV400                                                 02140000
CVTRV405 EQU   CVTRV400                                                 02141000
CVTRV404 EQU   CVTRV400                                                 02142000
CVTRV403 EQU   CVTRV400                                                 02143000
CVTRV402 EQU   CVTRV400                                                 02144000
CVTRV401 EQU   CVTRV400                                                 02145000
CVTICB   EQU   CVTXTNT2+48                                              02146000
CVTSKTA  EQU   CVTXTNT2+44                                              02147000
CVTCCVT  EQU   CVTXTNT2+40                                              02148000
CVTRSV98 EQU   CVTXTNT2+36                                              02149000
CVTRSV97 EQU   CVTXTNT2+34                                              02150000
CVTRSV96 EQU   CVTXTNT2+32                                              02151000
CVTOLTEP EQU   CVTXTNT2+28                                              02152000
CVTQIDA  EQU   CVTQID+1                                                 02153000
CVTRSV95 EQU   CVTQID                                                   02154000
CVTRSV94 EQU   CVTXTNT2+20                                              02155000
CVTRSV93 EQU   CVTXTNT2+16                                              02156000
CVTRSV92 EQU   CVTXTNT2+12                                              02157000
CVTDEBVR EQU   CVTXTNT2+8                                               02158000
CVTRSV91 EQU   CVTXTNT2+6                                               02159000
CVTRSV9H EQU   CVTFLGBT                                                 02160000
CVTRSV9G EQU   CVTFLGBT                                                 02161000
CVTRSV9F EQU   CVTFLGBT                                                 02162000
CVTRSV9E EQU   CVTFLGBT                                                 02163000
CVTRSV9D EQU   CVTFLGBT                                                 02164000
CVTBAH   EQU   CVTFLGBT                                                 02165000
CVTVME   EQU   CVTFLGBT                                                 02166000
CVTNPE   EQU   CVTFLGBT                                                 02167000
CVTNUCLS EQU   CVTXTNT2+4                                               02168000
CVTDSSVA EQU   CVTDSSV+1                                                02169000
CVTRSV89 EQU   CVTDSSV                                                  02170000
CVTRSV88 EQU   CVTXTNT1+8                                               02171000
CVTRSV87 EQU   CVTXTNT1+4                                               02172000
CVTFACHN EQU   CVTXTNT1                                                 02173000
CVTRV488 EQU   CVTMAP+412                                               02174000
CVTRV487 EQU   CVTMAP+408                                               02175000
CVTRV486 EQU   CVTMAP+404                                               02176000
CVTRV485 EQU   CVTMAP+400                                               02177000
CVTACTAP EQU   CVTMAP+396                                               02178000
CVTAUTH  EQU   CVTMAP+392                                               02179000
CVTRV490 EQU   CVTMAP+388                                               02180000
CVTSU    EQU   CVTMAP+384                                               02181000
CVTVOLT1 EQU   CVTVOLM1+1                                               02182000
CVTVOLI1 EQU   CVTVOLF1                                                 02183000
CVTSTOA  EQU   CVTMAP+376                                               02184000
CVTRSV58 EQU   CVTMAP+374                                               02185000
CVTRSV57 EQU   CVTMAP+372                                               02186000
CVTDDCE  EQU   CVTMAP+368                                               02187000
CVTPNWFR EQU   CVTMAP+364                                               02188000
CVTSMF   EQU   CVTMAP+360                                               02189000
CVTSULK  EQU   CVTMAP+358                                               02190000
CVTSLKO  EQU   CVTSYSK                                                  02191000
CVTSLKP  EQU   CVTSYSK                                                  02192000
CVTSLKQ  EQU   CVTSYSK                                                  02193000
CVTSLKR  EQU   CVTSYSK                                                  02194000
CVTRSV56 EQU   CVTSYSK                                                  02195000
CVTRSV55 EQU   CVTSYSK                                                  02196000
CVTRSV54 EQU   CVTSYSK                                                  02197000
CVTRSV53 EQU   CVTSYSK                                                  02198000
CVTRSV52 EQU   CVTA1F1                                                  02199000
CVTRSV51 EQU   CVTA1F1                                                  02200000
CVTRSV50 EQU   CVTA1F1                                                  02201000
CVTRSV49 EQU   CVTA1F1                                                  02202000
CVTRSV48 EQU   CVTA1F1                                                  02203000
CVTRSV47 EQU   CVTA1F1                                                  02204000
CVTSRSW  EQU   CVTA1F1                                                  02205000
CVTPFSW  EQU   CVTA1F1                                                  02206000
CVTPCVT  EQU   CVTMAP+352                                               02207000
CVTRSV46 EQU   CVTMAP+344                                               02208000
CVTRSV45 EQU   CVTMAP+340                                               02209000
CVTRSV44 EQU   CVTMAP+338                                               02210000
CVTRSV43 EQU   CVTMAP+336                                               02211000
CVTHJESA EQU   CVTHJES+1                                                02212000
CVTRSV42 EQU   CVTHJES                                                  02213000
CVTEXT2A EQU   CVTEXT2+1                                                02214000
CVTRSV41 EQU   CVTEXT2                                                  02215000
CVTAPFA  EQU   CVTAPF+1                                                 02216000
CVTRSV40 EQU   CVTAPF                                                   02217000
CVTRV518 EQU   CVTINTLA                                                 02218000
CVTRV517 EQU   CVTERPV                                                  02219000
CVTEORM  EQU   CVTMAP+312                                               02220000
CVTMCHPR EQU   CVTMAP+308                                               02221000
CVTTZ    EQU   CVTMAP+304                                               02222000
CVTJEPS  EQU   CVTMAP+300                                               02223000
CVTJESCT EQU   CVTMAP+296                                               02224000
CVTMODE  EQU   CVTMAP+292                                               02225000
CVTPTRV  EQU   CVTMAP+288                                               02226000
CVTREAL  EQU   CVTMAP+284                                               02227000
CVTRSV39 EQU   CVTMAP+280                                               02228000
CVTRSV38 EQU   CVTMAP+276                                               02229000
CVTDMSRA EQU   CVTDMSR+1                                                02230000
CVTRV634 EQU   CVTDMSRF                                                 02231000
CVTRV633 EQU   CVTDMSRF                                                 02232000
CVTRV632 EQU   CVTDMSRF                                                 02233000
CVTRV631 EQU   CVTDMSRF                                                 02234000
CVTRV630 EQU   CVTDMSRF                                                 02235000
CVTRV629 EQU   CVTDMSRF                                                 02236000
CVTUDUMP EQU   CVTDMSRF                                                 02237000
CVTSDUMP EQU   CVTDMSRF                                                 02238000
CVTQMSGA EQU   CVTQMSG+1                                                02239000
CVTRSV36 EQU   CVTQMSG                                                  02240000
CVTAMFF  EQU   CVTMAP+264                                               02241000
CVTPURGA EQU   CVTPURG+1                                                02242000
CVTRSV35 EQU   CVTPURG                                                  02243000
CVTCBSP  EQU   CVTMAP+256                                               02244000
CVTATERA EQU   CVTATER+1                                                02245000
CVTSYST  EQU   CVTATER                                                  02246000
CVTVOLT2 EQU   CVTTAT                                                   02247000
CVTVOLI2 EQU   CVTVOLF2                                                 02248000
CVTAQAVB EQU   CVTAQAVT+1                                               02249000
CVTRSV34 EQU   CVTTCMFG                                                 02250000
CVTRSV33 EQU   CVTTCMFG                                                 02251000
CVTRSV32 EQU   CVTTCMFG                                                 02252000
CVTRSV31 EQU   CVTTCMFG                                                 02253000
CVTRSV30 EQU   CVTTCMFG                                                 02254000
CVTRSV29 EQU   CVTTCMFG                                                 02255000
CVTLDEV  EQU   CVTTCMFG                                                 02256000
CVTTCRDY EQU   CVTTCMFG                                                 02257000
CVTGTFA  EQU   CVTGTF+1                                                 02258000
CVTRSV27 EQU   CVTGTFST                                                 02259000
CVTRNIO  EQU   CVTGTFST                                                 02260000
CVTUSR   EQU   CVTGTFST                                                 02261000
CVTRV318 EQU   CVTFORM                                                  02262000
CVTRV317 EQU   CVTTMODE                                                 02263000
CVTRV316 EQU   CVTSTATE                                                 02264000
CVTRV315 EQU   CVTGTFS                                                  02265000
CVTGTFAV EQU   CVTGTFS                                                  02266000
CVT0SCR1 EQU   CVTMAP+232                                               02267000
CVTRV515 EQU   CVTMAP+228                                               02268000
CVTRMS   EQU   CVTMAP+224                                               02269000
CVTPATCH EQU   CVTMAP+220                                               02270000
CVTTSCE  EQU   CVTMAP+216                                               02271000
CVTLNKSC EQU   CVTMAP+214                                               02272000
CVTQABST EQU   CVTMAP+212                                               02273000
CVTMDLDS EQU   CVTMAP+208                                               02274000
CVTUSER  EQU   CVTMAP+204                                               02275000
CVTABEND EQU   CVTMAP+200                                               02276000
CVTSMCA  EQU   CVTMAP+196                                               02277000
CVTRSV18 EQU   CVTMAP+192                                               02278000
CVTQLPAQ EQU   CVTMAP+188                                               02279000
CVTQCDSR EQU   CVTMAP+184                                               02280000
CVTVS1B  EQU   CVTOPTB                                                  02281000
CVTVS1A  EQU   CVTOPTB                                                  02282000
CVTFP    EQU   CVTOPTB                                                  02283000
CVTAPTHR EQU   CVTOPTB                                                  02284000
CVTNLOG  EQU   CVTOPTB                                                  02285000
CVTTOD   EQU   CVTOPTB                                                  02286000
CVTCTIMS EQU   CVTOPTB                                                  02287000
CVTPROT  EQU   CVTOPTB                                                  02288000
CVTXPFP  EQU   CVTOPTA                                                  02289000
CVTASCII EQU   CVTOPTA                                                  02290000
CVTRSV13 EQU   CVTOPTA                                                  02291000
CVTRSV12 EQU   CVTOPTA                                                  02292000
CVTNIP   EQU   CVTOPTA                                                  02293000
CVTDDR   EQU   CVTOPTA                                                  02294000
CVTAPR   EQU   CVTOPTA                                                  02295000
CVTCCH   EQU   CVTOPTA                                                  02296000
CVTSNCTR EQU   CVTMAP+180                                               02297000
CVTQMWR  EQU   CVTMAP+176                                               02298000
CVTQOCR  EQU   CVTMAP+172                                               02299000
CVT1EF00 EQU   CVTMAP+168                                               02300000
CVTMZ00  EQU   CVTMAP+164                                               02301000
CVTHEAD  EQU   CVTMAP+160                                               02302000
CVTRSV11 EQU   CVTMAP+156                                               02303000
CVT0PT01 EQU   CVTMAP+152                                               02304000
CVTMSER  EQU   CVTMAP+148                                               02305000
CVTRV516 EQU   CVTIERLC                                                 02306000
CVTILCH  EQU   CVTMAP+140                                               02307000
CVT0DS   EQU   CVTMAP+136                                               02308000
CVTFBOSV EQU   CVTMAP+132                                               02309000
CVTNUCB  EQU   CVTMAP+128                                               02310000
CVTIXAVL EQU   CVTMAP+124                                               02311000
CVTIOQET EQU   CVTMAP+120                                               02312000
CVTDCBA  EQU   CVTMAP+117                                               02313000
CVTMVS2  EQU   CVTDCB                                                   02314000
CVT6DAT  EQU   CVTDCB                                                   02315000
CVT4MPS  EQU   CVTDCB                                                   02316000
CVTRSV09 EQU   CVTDCB                                                   02317000
CVT4MS1  EQU   CVTDCB                                                   02318000
CVT2SPS  EQU   CVTDCB                                                   02319000
CVT1SSS  EQU   CVTDCB                                                   02320000
CVTRSV08 EQU   CVTDCB                                                   02321000
CVTSTB   EQU   CVTMAP+112                                               02322000
CVTQTD00 EQU   CVTMAP+108                                               02323000
CVTQTE00 EQU   CVTMAP+104                                               02324000
CVTCUCB  EQU   CVTMAP+100                                               02325000
CVTSJQ   EQU   CVTMAP+96                                                02326000
CVTPBLDL EQU   CVTMAP+92                                                02327000
CVTTPC   EQU   CVTMAP+88                                                02328000
CVTSVDCB EQU   CVTMAP+84                                                02329000
CVTBRET  EQU   CVTMAP+82                                                02330000
CVTEXIT  EQU   CVTMAP+80                                                02331000
CVT0FN00 EQU   CVTMAP+76                                                02332000
CVTDARA  EQU   CVTDAR+1                                                 02333000
CVTRSV07 EQU   CVTFLGS1                                                 02334000
CVTRSV06 EQU   CVTFLGS1                                                 02335000
CVTRSV05 EQU   CVTFLGS1                                                 02336000
CVTRSV04 EQU   CVTFLGS1                                                 02337000
CVTRSV03 EQU   CVTFLGS1                                                 02338000
CVTRSV02 EQU   CVTFLGS1                                                 02339000
CVTRSV01 EQU   CVTFLGS1                                                 02340000
CVTDMPLK EQU   CVTFLGS1                                                 02341000
CVTXITP  EQU   CVTMAP+68                                                02342000
CVTZDTAB EQU   CVTMAP+64                                                02343000
CVTMSLT  EQU   CVTMAP+60                                                02344000
CVTDATE  EQU   CVTMAP+56                                                02345000
CVTBTERM EQU   CVTMAP+52                                                02346000
CVTSYSAD EQU   CVTMAP+48                                                02347000
CVTXTLER EQU   CVTMAP+44                                                02348000
CVTILK2  EQU   CVTMAP+40                                                02349000
CVTILK1  EQU   CVTMAP+36                                                02350000
CVTPRLTV EQU   CVTMAP+32                                                02351000
CVTPCNVT EQU   CVTMAP+28                                                02352000
CVT0VL00 EQU   CVTMAP+24                                                02353000
CVTXAPG  EQU   CVTMAP+20                                                02354000
CVTBUF   EQU   CVTMAP+16                                                02355000
CVTJOB   EQU   CVTMAP+12                                                02356000
CVTLINK  EQU   CVTMAP+8                                                 02357000
CVT0EF00 EQU   CVTMAP+4                                                 02358000
CVTTCBP  EQU   CVTMAP                                                   02359000
CVT      EQU   CVTMAP                                                   02360000
@NM00026 EQU   PSA+3668                                                 02361000
PSASTAK  EQU   PSA+3072                                                 02362000
@NM00025 EQU   PSA+1048                                                 02363000
PSAUSEND EQU   PSA+1048                                                 02364000
PSARV062 EQU   PSA+1044                                                 02365000
PSACDAL  EQU   PSA+1040                                                 02366000
PSAWTCOD EQU   PSA+1036                                                 02367000
PSAATCVT EQU   PSA+1032                                                 02368000
PSAPCPSW EQU   PSA+1024                                                 02369000
PSAPIR2  EQU   PSA+1020                                                 02370000
PSARV059 EQU   PSA+1018                                                 02371000
PSASVC13 EQU   PSA+1016                                                 02372000
PSALSFCC EQU   PSA+1012                                                 02373000
PSASFACC EQU   PSA+1008                                                 02374000
PSASTOP  EQU   PSA+992                                                  02375000
PSASTART EQU   PSA+976                                                  02376000
PSARSPSW EQU   PSA+968                                                  02377000
PSASRPSW EQU   PSA+960                                                  02378000
PSARV045 EQU   PSA+892                                                  02379000
PSARV044 EQU   PSA+888                                                  02380000
PSARV043 EQU   PSA+884                                                  02381000
PSARV042 EQU   PSA+880                                                  02382000
PSARV041 EQU   PSA+876                                                  02383000
PSARV040 EQU   PSA+872                                                  02384000
PSARV025 EQU   PSA+868                                                  02385000
PSADSSED EQU   PSA+868                                                  02386000
PSADSSPR EQU   PSA+864                                                  02387000
PSADSSFW EQU   PSA+860                                                  02388000
PSADSS14 EQU   PSA+856                                                  02389000
PSADSSPP EQU   PSA+848                                                  02390000
PSADSSRP EQU   PSA+840                                                  02391000
PSADSS05 EQU   PSADSSF4                                                 02392000
PSADSS10 EQU   PSADSSF4                                                 02393000
PSADSSVE EQU   PSADSSF4                                                 02394000
PSADSSDE EQU   PSADSSF4                                                 02395000
PSADSSC0 EQU   PSADSSF4                                                 02396000
PSADSSIE EQU   PSADSSF4                                                 02397000
PSADSS12 EQU   PSADSSF4                                                 02398000
PSADSSRC EQU   PSADSSF4                                                 02399000
PSARV057 EQU   PSADSSF3                                                 02400000
PSARV056 EQU   PSADSSF3                                                 02401000
PSARV055 EQU   PSADSSF3                                                 02402000
PSADSSMC EQU   PSADSSF3                                                 02403000
PSADSSRW EQU   PSADSSF3                                                 02404000
PSADSSNM EQU   PSADSSF3                                                 02405000
PSADSSES EQU   PSADSSF3                                                 02406000
PSADSSGP EQU   PSADSSF3                                                 02407000
PSADSSF2 EQU   PSADSSFL+1                                               02408000
PSADSSPI EQU   PSADSSF1                                                 02409000
PSADSSOI EQU   PSADSSF1                                                 02410000
PSADSSSP EQU   PSADSSF1                                                 02411000
PSADSSTP EQU   PSADSSF1                                                 02412000
PSADSSDW EQU   PSADSSF1                                                 02413000
PSADSSDD EQU   PSADSSF1                                                 02414000
PSADSSDM EQU   PSADSSF1                                                 02415000
PSADSSMV EQU   PSADSSF1                                                 02416000
PSADSSTS EQU   PSA+816                                                  02417000
PSADSSWK EQU   PSA+812                                                  02418000
PSADSSR3 EQU   PSA+808                                                  02419000
PSADSSR2 EQU   PSA+804                                                  02420000
PSADSSRS EQU   PSA+800                                                  02421000
PSASTOR  EQU   PSA+796                                                  02422000
PSACPUSA EQU   PSA+794                                                  02423000
PSAVSTAP EQU   PSA+792                                                  02424000
PSAWKVAP EQU   PSA+788                                                  02425000
PSAWKRAP EQU   PSA+784                                                  02426000
PSAMCHIC EQU   PSA+783                                                  02427000
PSARV061 EQU   PSA+782                                                  02428000
PSASYMSK EQU   PSA+781                                                  02429000
PSAMCHFL EQU   PSA+780                                                  02430000
PSACR0   EQU   PSA+776                                                  02431000
PSAPSWSV EQU   PSA+768                                                  02432000
PSACLHS  EQU   PSAHLHI                                                  02433000
PSALKR15 EQU   PSALKSA+60                                               02434000
PSALKR14 EQU   PSALKSA+56                                               02435000
PSALKR13 EQU   PSALKSA+52                                               02436000
PSALKR12 EQU   PSALKSA+48                                               02437000
PSALKR11 EQU   PSALKSA+44                                               02438000
PSALKR10 EQU   PSALKSA+40                                               02439000
PSALKR9  EQU   PSALKSA+36                                               02440000
PSALKR8  EQU   PSALKSA+32                                               02441000
PSALKR7  EQU   PSALKSA+28                                               02442000
PSALKR6  EQU   PSALKSA+24                                               02443000
PSALKR5  EQU   PSALKSA+20                                               02444000
PSALKR4  EQU   PSALKSA+16                                               02445000
PSALKR3  EQU   PSALKSA+12                                               02446000
PSALKR2  EQU   PSALKSA+8                                                02447000
PSALKR1  EQU   PSALKSA+4                                                02448000
PSALKR0  EQU   PSALKSA                                                  02449000
PSARV023 EQU   PSACLHT+52                                               02450000
PSALOCAL EQU   PSACLHT+48                                               02451000
PSACMSL  EQU   PSACLHT+44                                               02452000
PSAOPTL  EQU   PSACLHT+40                                               02453000
PSATPACL EQU   PSACLHT+36                                               02454000
PSATPDNL EQU   PSACLHT+32                                               02455000
PSATPNCL EQU   PSACLHT+28                                               02456000
PSAIOSLL EQU   PSACLHT+24                                               02457000
PSAIOSUL EQU   PSACLHT+20                                               02458000
PSAIOSCL EQU   PSACLHT+16                                               02459000
PSAIOSSL EQU   PSACLHT+12                                               02460000
PSASALCL EQU   PSACLHT+8                                                02461000
PSAASML  EQU   PSACLHT+4                                                02462000
PSADISPL EQU   PSACLHT                                                  02463000
PSASRSA  EQU   PSA+636                                                  02464000
PSARV050 EQU   PSA+634                                                  02465000
PSADSSGO EQU   PSA+633                                                  02466000
PSARECUR EQU   PSA+632                                                  02467000
PSAHLHIS EQU   PSA+628                                                  02468000
PSAIPCSA EQU   PSA+624                                                  02469000
@NM00024 EQU   PSA+621                                                  02470000
PSAIPCDM EQU   PSA+620                                                  02471000
PSAIPCD  EQU   PSA+616                                                  02472000
@NM00023 EQU   PSA+613                                                  02473000
PSAIPCRM EQU   PSA+612                                                  02474000
PSAIPCR  EQU   PSA+608                                                  02475000
PSAMCHEX EQU   PSA+600                                                  02476000
PSAMPSW  EQU   PSA+592                                                  02477000
PSAEXPS2 EQU   PSA+584                                                  02478000
PSAEXPS1 EQU   PSA+576                                                  02479000
PSAPIREG EQU   PSA+572                                                  02480000
PSARSREG EQU   PSA+568                                                  02481000
PSAGPREG EQU   PSA+556                                                  02482000
PSARV022 EQU   PSASUP4                                                  02483000
PSARV021 EQU   PSASUP4                                                  02484000
PSARV020 EQU   PSASUP4                                                  02485000
PSARV019 EQU   PSASUP4                                                  02486000
PSARV018 EQU   PSASUP4                                                  02487000
PSARV017 EQU   PSASUP4                                                  02488000
PSARV016 EQU   PSASUP4                                                  02489000
PSARV015 EQU   PSASUP4                                                  02490000
PSARV014 EQU   PSASUP3                                                  02491000
PSARV013 EQU   PSASUP3                                                  02492000
PSARV012 EQU   PSASUP3                                                  02493000
PSARV011 EQU   PSASUP3                                                  02494000
PSASPR   EQU   PSASUP3                                                  02495000
PSAPSREG EQU   PSASUP3                                                  02496000
PSAPI2   EQU   PSASUP3                                                  02497000
PSAIOSUP EQU   PSASUP3                                                  02498000
PSALCR   EQU   PSASUP2                                                  02499000
PSARTM   EQU   PSASUP2                                                  02500000
PSAACR   EQU   PSASUP2                                                  02501000
PSAIPCE2 EQU   PSASUP2                                                  02502000
PSAIPCES EQU   PSASUP2                                                  02503000
PSAIPCEC EQU   PSASUP2                                                  02504000
PSAGTF   EQU   PSASUP2                                                  02505000
PSAIPCRI EQU   PSASUP2                                                  02506000
PSARV063 EQU   PSASUP1                                                  02507000
PSATCTL  EQU   PSASUP1                                                  02508000
PSADISP  EQU   PSASUP1                                                  02509000
PSALOCK  EQU   PSASUP1                                                  02510000
PSAPI    EQU   PSASUP1                                                  02511000
PSAEXT   EQU   PSASUP1                                                  02512000
PSASVC   EQU   PSASUP1                                                  02513000
PSAIO    EQU   PSASUP1                                                  02514000
PSAANEW  EQU   PSA+544                                                  02515000
PSATOLD  EQU   PSA+540                                                  02516000
PSATNEW  EQU   PSA+536                                                  02517000
PSALCCAR EQU   PSA+532                                                  02518000
PSALCCAV EQU   PSA+528                                                  02519000
PSAPCCAR EQU   PSA+524                                                  02520000
PSAPCCAV EQU   PSA+520                                                  02521000
PSACPULA EQU   PSA+518                                                  02522000
PSACPUPA EQU   PSA+516                                                  02523000
PSAPSA   EQU   PSA+512                                                  02524000
FLCHDEND EQU   PSA+512                                                  02525000
FLCCRSAV EQU   FLCMCLA+280                                              02526000
FLCGRSAV EQU   FLCMCLA+216                                              02527000
FLCFPSAV EQU   FLCMCLA+184                                              02528000
FLCFLA   EQU   FLCMCLA+88                                               02529000
FLCRGNCD EQU   FLCMCLA+84                                               02530000
FLCFSAA  EQU   FLCFSA+1                                                 02531000
@NM00022 EQU   FLCFSA                                                   02532000
@NM00021 EQU   FLCMCLA+72                                               02533000
FLCMCIC  EQU   FLCMCLA+64                                               02534000
@NM00020 EQU   FLCMCLA+20                                               02535000
FLCIOAA  EQU   FLCIOA+1                                                 02536000
@NM00019 EQU   FLCIOA                                                   02537000
@NM00018 EQU   FLCMCLA+15                                               02538000
@NM00017 EQU   FLCMCLA+14                                               02539000
@NM00016 EQU   FLCMCLA+12                                               02540000
FLCLCL   EQU   FLCMCLA+8                                                02541000
FLCIOELA EQU   FLCIOEL+1                                                02542000
@NM00015 EQU   FLCIOEL                                                  02543000
FLCCHNID EQU   FLCMCLA                                                  02544000
@NM00014 EQU   PSA+160                                                  02545000
FLCMTRCD EQU   PSA+157                                                  02546000
@NM00013 EQU   PSA+156                                                  02547000
FLCPERA  EQU   FLCPER+1                                                 02548000
@NM00012 EQU   FLCPER                                                   02549000
@NM00011 EQU   PSA+151                                                  02550000
FLCPERCD EQU   PSA+150                                                  02551000
FLCMCNUM EQU   PSA+149                                                  02552000
@NM00010 EQU   PSA+148                                                  02553000
FLCTEAA  EQU   FLCTEA+1                                                 02554000
@NM00009 EQU   FLCTEA                                                   02555000
PSAPIPC  EQU   PSAPICOD                                                 02556000
PSAPIMC  EQU   PSAPICOD                                                 02557000
PSAPIPER EQU   PSAPICOD                                                 02558000
PSARV049 EQU   FLCPICOD                                                 02559000
FLCPILCB EQU   FLCPIILC                                                 02560000
@NM00008 EQU   FLCPIILC                                                 02561000
@NM00007 EQU   PSAEPPSW                                                 02562000
FLCSVCN  EQU   PSAESPSW+2                                               02563000
FLCSILCB EQU   FLCSVILC                                                 02564000
@NM00006 EQU   FLCSVILC                                                 02565000
@NM00005 EQU   PSAESPSW                                                 02566000
FLCEICOD EQU   PSAEEPSW+2                                               02567000
PSASPAD  EQU   PSAEEPSW                                                 02568000
@NM00004 EQU   PSA+128                                                  02569000
FLCINPSW EQU   PSA+120                                                  02570000
FLCMNPSW EQU   PSA+112                                                  02571000
FLCPNPSW EQU   PSA+104                                                  02572000
FLCSNPSW EQU   PSA+96                                                   02573000
FLCENPSW EQU   PSA+88                                                   02574000
FLCTRACE EQU   PSA+84                                                   02575000
FLCTIMER EQU   PSA+80                                                   02576000
FLCCVT2  EQU   PSA+76                                                   02577000
FLCCAW   EQU   PSA+72                                                   02578000
FLCCSW   EQU   PSA+64                                                   02579000
FLCIOPSW EQU   PSA+56                                                   02580000
FLCMOPSW EQU   PSA+48                                                   02581000
FLCPOPSW EQU   PSA+40                                                   02582000
FLCSOPSW EQU   PSA+32                                                   02583000
FLCEOPSW EQU   PSA+24                                                   02584000
@NM00003 EQU   FLCICCW2+4                                               02585000
FLCCVT   EQU   FLCICCW2                                                 02586000
FLCICCW1 EQU   FLCROPSW                                                 02587000
FLCIPPSW EQU   FLCRNPSW                                                 02588000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02589000
@RT00239 EQU   @RC00236                                                 02590000
@RT00259 EQU   LKLOOP                                                   02591000
@RT00266 EQU   @RC00262                                                 02592000
@ENDDATA EQU   *                                                        02593000
         END   ISTAPC64,(C'PLS1251',0702,78336)                         02594000
