         TITLE 'ISTAPM52-PST DISPATCHER'                                00001000
ISTAPC52 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTAPC52  79.172'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@12                                         0001 00011000
RBPRFXLN EQU 64                                                         00012000
RBPRFLNA EQU 32                                                         00013000
PRBLEN   EQU 136                                                        00014000
SIRBLEN  EQU 200                                                        00015000
TIRBLEN  EQU 136                                                        00016000
IRBLEN   EQU 128                                                        00017000
SVRBLEN  EQU 224                                                        00018000
         PRINT OFF                                                      00019000
         PRINT ON                                                       00020000
         PRINT OFF                                                      00021000
         PRINT ON                                                       00022000
*                                                                  0279 00023000
*/********************************************************************/ 00024000
*/*                                                                  */ 00025000
*/*                              CODE                                */ 00026000
*/*                                                                  */ 00027000
*/********************************************************************/ 00028000
*                                                                  0279 00029000
*                                   /*                               */ 00030000
*                                                                  0279 00031000
*   /*****************************************************************/ 00032000
*   /*                                                               */ 00033000
*   /* CLEAR AND SET CRR AUDIT SWITCHES FOR APC52                    */ 00034000
*   /*                                                               */ 00035000
*   /*****************************************************************/ 00036000
*                                                                  0279 00037000
*   APCSWTWD=0;                     /* CLEAR SWITCHES WHICH ARE NOT     00038000
*                                      USED                  @Z30APGA*/ 00039000
         SLR   @07,@07                                             0279 00040000
         ST    @07,APCSWTWD(,CRRREG)                               0279 00041000
*   APCRFLG=0;                      /* CLEAR RUNNING FLAGS   @Z30APGA*/ 00042000
         STH   @07,APCRFLG(,CRRREG)                                0280 00043000
*   APC52R=ON;                      /* SET RUNNING FLG       @Z30APGA*/ 00044000
         OI    APC52R(CRRREG),B'01000000'                          0281 00045000
*   APC52E=ON;                      /* SET ENTERED FLG       @Z30APGA*/ 00046000
         OI    APC52E(CRRREG),B'01000000'                          0282 00047000
*   DO;                             /* LISATCVT                    0283 00048000
*                                      CVTBASE(PAGEABLE,(VCVTREG))   */ 00049000
*     VCVTREG=ATCLCPTR;             /* SET UP ATCVT POINTER          */ 00050000
         L     VCVTREG,ATCLCPTR                                    0284 00051000
*   END;                            /* LISATCVT VTAM CVT PTR         */ 00052000
*   PSTREG=APCPSTA;                 /* PST PTR FOR THIS TASK         */ 00053000
         L     PSTREG,APCPSTA(,CRRREG)                             0286 00054000
*SCNRDYQ:                                                          0287 00055000
*   IF PSTRQUE^=PSTGATE1 THEN       /* ANY THING ON RDY Q?           */ 00056000
SCNRDYQ  CLC   PSTRQUE(4,PSTREG),@CF02709                          0287 00057000
         BE    @RF00287                                            0287 00058000
*DEQENQ:                                                           0288 00059000
*     DO;                           /* DEQ AND ENQ OR DSP IT OR    0288 00060000
*                                      HANDLE SMS                    */ 00061000
DEQENQ   DS    0H                                                  0289 00062000
*       SWAPREG=PSTGATE1;           /* SET UP FOR C&S                */ 00063000
         L     SWAPREG,@CF02709                                    0289 00064000
*       PABREG=PSTRQUE;             /* LOAD UP COMPARE REG           */ 00065000
         L     PABREG,PSTRQUE(,PSTREG)                             0290 00066000
*       ANCHREG=0;                  /* IND. 1 PAB ONLY LEFT ON RDY Q */ 00067000
         SLR   ANCHREG,ANCHREG                                     0291 00068000
*       DO WHILE(PABREG->PABCHNGP^=0);/* FIND LAST PAB ON CHAIN      */ 00069000
         B     @DE00292                                            0292 00070000
@DL00292 DS    0H                                                  0293 00071000
*         ANCHREG=PABREG;           /* KEEP TRACK OF THE BACK PAB    */ 00072000
         LR    ANCHREG,PABREG                                      0293 00073000
*         PABREG=PABREG->PABCHNGP;  /* STEP TO NEXT PAB ON RDY Q     */ 00074000
         L     @07,PABCHNGP-1(,PABREG)                             0294 00075000
         LA    @07,0(,@07)                                         0294 00076000
         LR    PABREG,@07                                          0294 00077000
*       END;                        /* OUT OF DO WHILE ON LAST PAB   */ 00078000
@DE00292 L     @07,PABCHNGP-1(,PABREG)                             0295 00079000
         LA    @07,0(,@07)                                         0295 00080000
         LTR   @07,@07                                             0295 00081000
         BNZ   @DL00292                                            0295 00082000
*       IF ANCHREG=0 THEN           /* IF LAST PAB ON RDY Q          */ 00083000
         LTR   ANCHREG,ANCHREG                                     0296 00084000
         BNZ   @RF00296                                            0296 00085000
*         DO;                       /* DEQUE FROM PSTRQUE            */ 00086000
*           CS(PABREG,SWAPREG,PSTRQUE);/* SWAP LAST PAB OFF RDY Q    */ 00087000
         CS    PABREG,@06,PSTRQUE(PSTREG)                          0298 00088000
*           BC(EQ,DEQEND);          /* OK - ENQ OR HANDLE OR DSP     */ 00089000
         BC    8,DEQEND                                            0299 00090000
*           IF PABREG^=PSTGATE1     /* ANOTHER PAB QUED UP?          */ 00091000
*             THEN                                                 0300 00092000
         CL    PABREG,@CF02709                                     0300 00093000
         BNE   @RT00300                                            0300 00094000
*             GOTO DEQENQ;          /* YES - DEQ IT                  */ 00095000
*           ELSE                                                   0302 00096000
*             GOTO SCNRDYQ;         /* NO PAB THERE - START ALL OVER */ 00097000
         B     SCNRDYQ                                             0302 00098000
*         END;                      /* END - LAST PAB ON RDY Q       */ 00099000
*       ELSE                                                       0304 00100000
*         ANCHREG->PABCHNGP=0;      /* DEQUE LAST PAB ON CHAIN       */ 00101000
@RF00296 SLR   @07,@07                                             0304 00102000
         STCM  @07,7,PABCHNGP(ANCHREG)                             0304 00103000
*DEQEND:                                                           0305 00104000
*       PABREG=PABREG&ZCLHIBYT;     /* CLEAR HIGH BYTE               */ 00105000
DEQEND   N     PABREG,@CF03484                                     0305 00106000
*       WORKREG=ADDR(PSTSMDYP);     /* SMS DYN PAB WITH HDR          */ 00107000
         LA    WORKREG,PSTSMDYP(,PSTREG)                           0306 00108000
*       WORKREG=ADDR(WORKREG->DYPPAB);/* SMS DYN PAB LESS HR         */ 00109000
         LA    @07,DYPPAB(,WORKREG)                                0307 00110000
         LR    WORKREG,@07                                         0307 00111000
*       IF PABREG=WORKREG THEN      /* IS THIS SMS PAB               */ 00112000
         CR    PABREG,WORKREG                                      0308 00113000
         BNE   @RF00308                                            0308 00114000
*/********************************************************************/ 00115000
*/* HANDLE THE SPECIAL CASE OF A PAB BEING FOR VTAM STORAGE MANAGE-  */ 00116000
*/* MENT TO OBTAIN RPH MAIN STORAGE.                                 */ 00117000
*/********************************************************************/ 00118000
*                                                                  0309 00119000
*         DO;                       /* HANDLE PAB FOR STOR MGT RPH   */ 00120000
*           APCSMSR=ON;             /* SMS RPH BEING RETURNED        */ 00121000
         OI    APCSMSR(CRRREG),B'01000000'                         0310 00122000
*           IF APCSMCR=ON           /* IF STORAGE MANAGEMENT CRA     */ 00123000
*             THEN                  /* BEING USED THEN               */ 00124000
         TM    APCSMCR(CRRREG),B'00100000'                         0311 00125000
         BNO   @RF00311                                            0311 00126000
*             DO;                   /* SETUP TO USE A NEW CRA        */ 00127000
*               CRAREG=PSTCRRS;     /* SMS CRA                       */ 00128000
         L     @07,PSTCRRS(,PSTREG)                                0313 00129000
         LR    CRAREG,@07                                          0313 00130000
*               RPHREG=ADDR(CRARPH);/* SMS RPH                       */ 00131000
         LA    RPHREG,CRARPH(,CRAREG)                              0314 00132000
*               CRAREG=RPHSRPRM;    /* CRA RETURNED BY SMS           */ 00133000
         L     CRAREG,RPHSRPRM(,RPHREG)                            0315 00134000
*               RPHREG=ADDR(CRARPH);/* RPH RETURNED WITH CRA         */ 00135000
         LA    RPHREG,CRARPH(,CRAREG)                              0316 00136000
*               RPHCRR=CRAREG;      /* CRA PTR IN RPH                */ 00137000
         ST    CRAREG,RPHCRR(,RPHREG)                              0317 00138000
*/*INITIALIZE CRA                                                    */ 00139000
*                                                                  0318 00140000
*               CRALKACT=0;         /* CLEAR ACTIVE LOCKS            */ 00141000
         SLR   @05,@05                                             0318 00142000
         ST    @05,CRALKACT(,CRAREG)                               0318 00143000
*               CRACRR=ADDR(CRAPSS);/* CRR FOR PSS                   */ 00144000
         LA    @05,CRAPSS(,CRAREG)                                 0319 00145000
         ST    @05,CRACRR(,CRAREG)                                 0319 00146000
*/*INITIALIZE NEW PSS CRR FROM CRR IN THE CRA FOR SMS                */ 00147000
*                                                                  0320 00148000
*               CRRREG=CRACRR;                                     0320 00149000
         LR    CRRREG,@05                                          0320 00150000
*               MISCREG=ADDR(PSTCRRS->CRAPSS);/* ADDR-SMS CRR        */ 00151000
         LA    MISCREG,CRAPSS(,@07)                                0321 00152000
*               APCHDRSV=APCHDRSV&&APCHDRSV;/* CLEAR CRR HDR         */ 00153000
         XC    APCHDRSV(16,CRRREG),APCHDRSV(CRRREG)                0322 00154000
*               APCTCBA=MISCREG->APCTCBA;/* ADDR OF TCB TASK         */ 00155000
         L     @07,APCTCBA(,MISCREG)                               0323 00156000
         ST    @07,APCTCBA(,CRRREG)                                0323 00157000
*               APCPSTA=MISCREG->APCPSTA;/* PST ADDRESS              */ 00158000
         L     @07,APCPSTA(,MISCREG)                               0324 00159000
         ST    @07,APCPSTA(,CRRREG)                                0324 00160000
*               APCCOMF=MISCREG->APCCOMF;/* CROSS PROC. FLAGS        */ 00161000
         MVC   APCCOMF(4,CRRREG),APCCOMF(MISCREG)                  0325 00162000
*               APCSWTWD=MISCREG->APCSWTWD;/* SWITCH WORDS           */ 00163000
         MVC   APCSWTWD(4,CRRREG),APCSWTWD(MISCREG)                0326 00164000
*               APCATFLG=MISCREG->APCATFLG;/* AUDIT TRACE FL         */ 00165000
         MVC   APCATFLG(2,CRRREG),APCATFLG(MISCREG)                0327 00166000
*               APCRFLG=MISCREG->APCRFLG;/* AUDIT TRACE FL           */ 00167000
         MVC   APCRFLG(2,CRRREG),APCRFLG(MISCREG)                  0328 00168000
*               APCRTRN=MISCREG->APCRTRN;/* PSS RETRN PTR            */ 00169000
         L     @07,APCRTRN(,MISCREG)                               0329 00170000
         ST    @07,APCRTRN(,CRRREG)                                0329 00171000
*               APC52FLG=MISCREG->APC52FLG;/* 52 AUDIT TRACE         */ 00172000
         MVC   APC52FLG(1,CRRREG),APC52FLG(MISCREG)                0330 00173000
*/*TURN SMS CRA IN USE FLAG OFF IN PST USING CS                      */ 00174000
*                                                                  0331 00175000
*               COMPREG=PSTFLGA;                                   0331 00176000
         L     COMPREG,PSTFLGA(,PSTREG)                            0331 00177000
*MCS1:                                                             0332 00178000
*               SWAPREG=COMPREG&PSTSMCU0;/* TURN OFF BIT             */ 00179000
MCS1     LR    SWAPREG,COMPREG                                     0332 00180000
         N     SWAPREG,@CF02633                                    0332 00181000
*               CS(COMPREG,SWAPREG,PSTFLGA);/* EQ-BIT OFF            */ 00182000
         CS    COMPREG,@06,PSTFLGA(PSTREG)                         0333 00183000
*               BC(NE,MCS1);        /* FAIL-GO AGAIN                 */ 00184000
         BC    7,MCS1                                              0334 00185000
*               ESCRAREG=RPHCRR;    /* CRA PTR-ESTAE                 */ 00186000
         L     ESCRAREG,RPHCRR(,RPHREG)                            0335 00187000
*               RETRYREG=ATCAP61;   /* FOR ESTAE                     */ 00188000
         L     RETRYREG,ATCAP61(,VCVTREG)                          0336 00189000
*               MISCREG=RPHREG;     /* SAVE ACR-ESTAE                */ 00190000
         LR    MISCREG,RPHREG                                      0337 00191000
*               REG1=ADDR(APCESTAL);/* FOR ESTAE                     */ 00192000
         LA    REG1,APCESTAL(,CRRREG)                              0338 00193000
*               WORKREG=(ADDR(ESTEND))-(ADDR(ESTST));/* LENGTH ESTAE    00194000
*                                      LIST                  @Z40GKF6*/ 00195000
         LA    WORKREG,ESTEND                                      0339 00196000
         LA    @07,ESTST                                           0339 00197000
         SLR   WORKREG,@07                                         0339 00198000
*               APCESTAL(1:WORKREG)=ZLIST(1:WORKREG);/* MOVE ESTAE 0340 00199000
*                                      LIST                  @Z40GKF6*/ 00200000
         LR    @07,WORKREG                                         0340 00201000
         BCTR  @07,0                                               0340 00202000
         EX    @07,@SM03539                                        0340 00203000
*               GEN REFS(REG1,RETRYREG,ESCRAREG);                  0341 00204000
*                                            /*GENERATE ESTAE MACRO*/   00205000
         ESTAE  (RETRYREG),OV,PARAM=(ESCRAREG),MF=(E,(1))               00206000
*               RPHREG=MISCREG;     /* REST.AFT ESTAE                */ 00207000
         LR    RPHREG,MISCREG                                      0342 00208000
*             END;                  /* END - INIT NEW CRA            */ 00209000
*           ELSE                    /* NOT USING SMS CRA             */ 00210000
*             DO;                   /* RELEASE EXTRA RPH             */ 00211000
         B     @RC00311                                            0344 00212000
@RF00311 DS    0H                                                  0345 00213000
*               APCEXIT=OFF;        /* ISTAPC58 NOT TO RET TO SYS    */ 00214000
*               APCRELR=ON;         /* ISTAPC58 TO RELEASE RPH       */ 00215000
         OI    APCRELR(CRRREG),B'00000100'                         0346 00216000
         NI    APCEXIT(CRRREG),B'11111101'                         0346 00217000
*               RFY                                                0347 00218000
*                (ZEROREG) RSTD;    /* ISTAPC58 NEEDS REG 0 SET TO 0347 00219000
*                                                                @CRA*/ 00220000
*               ZEROREG=PABRPHA->RPHSRPRM;/* R0=@EXTRA CRA TO RELEASE*/ 00221000
         L     @07,PABRPHA-1(,PABREG)                              0348 00222000
         L     ZEROREG,RPHSRPRM(,@07)                              0348 00223000
*               REG15=ATCAP58;      /* GET ADDR OF ISTAPC58          */ 00224000
         L     REG15,ATCAP58(,VCVTREG)                             0349 00225000
*               CALL APC58;         /* WILL RELEASE CRA              */ 00226000
         BALR  @14,@15                                             0350 00227000
*               RFY                                                0351 00228000
*                (ZEROREG) UNRSTD;  /* DONE WITH R0                  */ 00229000
*             END;                  /* END - RELEASE EXTRA CRA       */ 00230000
*/*TURN SMS RPH QUEUED FOR STORAGE FLAG OFF IN PST  USING CS         */ 00231000
*                                                                  0353 00232000
*           COMPREG=PSTFLGA;                                       0353 00233000
@RC00311 L     COMPREG,PSTFLGA(,PSTREG)                            0353 00234000
*MCS2:                                                             0354 00235000
*           SWAPREG=COMPREG&PSTSMQR0;/* TURN OFF BIT                 */ 00236000
MCS2     LR    SWAPREG,COMPREG                                     0354 00237000
         N     SWAPREG,@CF02629                                    0354 00238000
*           CS(COMPREG,SWAPREG,PSTFLGA);/* EQ-BIT OFF                */ 00239000
         CS    COMPREG,@06,PSTFLGA(PSTREG)                         0355 00240000
*           BC(NE,MCS2);            /* FAIL-GO AGAIN                 */ 00241000
         BC    7,MCS2                                              0356 00242000
*           APCSMCR=OFF;            /* SMS CRA NOT BEING UTILIZED    */ 00243000
         NI    APCSMCR(CRRREG),B'11011111'                         0357 00244000
*           GOTO SCNRDYQ;           /* SCAN RDY Q FOR MORE PABS      */ 00245000
         B     SCNRDYQ                                             0358 00246000
*         END;                      /* END - HANDLE SMS PAB          */ 00247000
*ENQORDSP:                                                         0360 00248000
*       IF PABAPYP=ON               /* DEQUED PAB FOR USER EXIT ?    */ 00249000
*         THEN                                                     0360 00250000
@RF00308 DS    0H                                                  0360 00251000
ENQORDSP TM    PABAPYP(PABREG),B'10000000'                         0360 00252000
         BNO   @RF00360                                            0360 00253000
*         ANCHREG=ADDR(PSTUEQ);     /* YES - SET UP FOR ENQ ON UEQ   */ 00254000
         LA    ANCHREG,PSTUEQ(,PSTREG)                             0361 00255000
*       ELSE                                                       0362 00256000
*         DO;                       /* DEQUED PAB FOR SYS SERVICE    */ 00257000
         B     @RC00360                                            0362 00258000
@RF00360 DS    0H                                                  0363 00259000
*/********************************************************************/ 00260000
*/* SYS SERVICE PAB DEQUED - TRY TO QUICK DISPATCH IT.               */ 00261000
*/*  TP POSTED PAB CAN BE QUICK DISPATCHED IF                        */ 00262000
*/*       LAST PAB ON RDY Q & PSTPSSQ IS EMPTY                       */ 00263000
*/*  NORM PAB CAN BE QUICK DISPATCHED IF                             */ 00264000
*/*       LAST ON RDY Q & NOT USING SMS CRA                          */ 00265000
*/*       & BOTH PSTPSSQ AND NSSQ ARE EMPTY                          */ 00266000
*/********************************************************************/ 00267000
*                                                                  0363 00268000
*           IF PABRPHA^=0           /* TP POSTED ?                   */ 00269000
*             THEN                                                 0363 00270000
         L     @07,PABRPHA-1(,PABREG)                              0363 00271000
         LA    @07,0(,@07)                                         0363 00272000
         LTR   @07,@07                                             0363 00273000
         BZ    @RF00363                                            0363 00274000
*             IF(ANCHREG=0)&(PSTPSSQ=0)/* LAST PAB & PSSQ EMPTY    0364 00275000
*                                                            @ZM00787*/ 00276000
*               THEN                                               0364 00277000
         SLR   @07,@07                                             0364 00278000
         CR    ANCHREG,@07                                         0364 00279000
         BNE   @RF00364                                            0364 00280000
         C     @07,PSTPSSQ(,PSTREG)                                0364 00281000
         BE    @RT00364                                            0364 00282000
*               GOTO DSPOSTD;       /* DIRECT DISPATCH               */ 00283000
*             ELSE                                                 0366 00284000
*               ANCHREG=ADDR(PSTPSSQ);/* SETUP TO ENQ ON PSSQ        */ 00285000
@RF00364 LA    ANCHREG,PSTPSSQ(,PSTREG)                            0366 00286000
*           ELSE                                                   0367 00287000
*             DO;                   /* NORM SYS SERVICE PAB          */ 00288000
         B     @RC00363                                            0367 00289000
@RF00363 DS    0H                                                  0368 00290000
*               IF(APCSMCR^=ON)&(ANCHREG=0)/* LAST PAB & CRA AVAIL?  */ 00291000
*                 THEN                                             0368 00292000
         TM    APCSMCR(CRRREG),B'00100000'                         0368 00293000
         BO    @RF00368                                            0368 00294000
         SLR   @07,@07                                             0368 00295000
         CR    ANCHREG,@07                                         0368 00296000
         BNE   @RF00368                                            0368 00297000
*                 IF(PSTPSSQ=0)&(PSTNSSQ=0)/* BOTH Q,S EMPTY?      0369 00298000
*                                                            @ZM00787*/ 00299000
*                   THEN                                           0369 00300000
         C     @07,PSTPSSQ(,PSTREG)                                0369 00301000
         BNE   @RF00369                                            0369 00302000
         C     @07,PSTNSSQ(,PSTREG)                                0369 00303000
         BE    @RT00369                                            0369 00304000
*                   GOTO DSPNORM;   /* DIRECT DISPATCH PAB           */ 00305000
*               ANCHREG=ADDR(PSTNSSQ);/* SETUP FOR ENQ ON NSSQ       */ 00306000
@RF00369 DS    0H                                                  0371 00307000
@RF00368 LA    ANCHREG,PSTNSSQ(,PSTREG)                            0371 00308000
*             END;                  /* END CHECK FOR QUICK DISP NORM    00309000
*                                      PAB                           */ 00310000
*         END;                      /* END CHECK SYS SERVICE PAB FOR    00311000
*                                      QUICK DISP                    */ 00312000
@RC00363 DS    0H                                                  0374 00313000
*ENQPAB:                                                           0374 00314000
*       PABCHNGP=QUEUEA;            /* SET PABCHNGP TO 1ST PAB ON Q  */ 00315000
@RC00360 DS    0H                                                  0374 00316000
ENQPAB   MVC   PABCHNGP(3,PABREG),QUEUEA+1(ANCHREG)                0374 00317000
*       QUEUEA=PABREG;              /* PAB NOW NEWEST ON Q           */ 00318000
         ST    PABREG,QUEUEA(,ANCHREG)                             0375 00319000
*       GOTO SCNRDYQ;               /* GO CHECK FOR MORE PABS ON RDYQ*/ 00320000
         B     SCNRDYQ                                             0376 00321000
*     END DEQENQ;                   /* END OF DEQUE ENQUE/HANDLE   0377 00322000
*                                      SMS/QUICK DISPATCH            */ 00323000
*/********************************************************************/ 00324000
*/* SEARCH DISPATCHING QUEUES FOR WORK                               */ 00325000
*/********************************************************************/ 00326000
*                                                                  0378 00327000
*   IF QUEUES=NOPABS                /* IS THERE ANY WORK     @ZM00787*/ 00328000
*     THEN                                                         0378 00329000
@RF00287 CLC   QUEUES(12,PSTREG),NOPABS                            0378 00330000
         BE    @RT00378                                            0378 00331000
*     GOTO SSCHECK;                 /* NO                    @ZM00787*/ 00332000
*   ELSE                                                           0380 00333000
*     DO;                           /* YES                   @ZM00787*/ 00334000
*       ANCHREG=ADDR(PSTPSSQ);      /* CHECK PSSQ 1ST                */ 00335000
         LA    ANCHREG,PSTPSSQ(,PSTREG)                            0381 00336000
*       IF QUEUEA^=0                /* PSTPSSQ EMPTY ?               */ 00337000
*         THEN                                                     0382 00338000
         SLR   @07,@07                                             0382 00339000
         C     @07,QUEUEA(,ANCHREG)                                0382 00340000
         BNE   @RT00382                                            0382 00341000
*         GOTO DEQDSP;              /* NO - THEN GO DEQUE AND DSP    */ 00342000
*       IF APCSMCR^=ON              /* RUN ONLY TP POSTED IF SMS CRA    00343000
*                                      BEING USED                    */ 00344000
*         THEN                                                     0384 00345000
         TM    APCSMCR(CRRREG),B'00100000'                         0384 00346000
         BO    @RF00384                                            0384 00347000
*         DO;                       /* NOT USING SMS CRA. CHECK NSSQ    00348000
*                                      THEN UEQ                      */ 00349000
*           ANCHREG=ADDR(PSTNSSQ);  /* CHECK NSSQ                    */ 00350000
         LA    ANCHREG,PSTNSSQ(,PSTREG)                            0386 00351000
*           IF QUEUEA^=0            /* IF NSSQ IS NOT EMPTY          */ 00352000
*             THEN                                                 0387 00353000
         C     @07,QUEUEA(,ANCHREG)                                0387 00354000
         BNE   @RT00387                                            0387 00355000
*             GOTO DEQDSP;          /* GO DEQ A PAB AND DISPATCH IT  */ 00356000
*           ANCHREG=ADDR(PSTUEQ);   /* PSSQ & NSSQ EMPTY .. CHECK UEQ*/ 00357000
         LA    ANCHREG,PSTUEQ(,PSTREG)                             0389 00358000
*           IF QUEUEA^=0            /* IF UEQ IS NOT EMPTY           */ 00359000
*             THEN                                                 0390 00360000
         C     @07,QUEUEA(,ANCHREG)                                0390 00361000
         BNE   @RT00390                                            0390 00362000
*             GOTO DSPUSR;          /* GO TRY TO RUN USER EXITS      */ 00363000
*         END;                      /* END CHECK NSSQ AND UEQ FOR  0392 00364000
*                                      WORK                          */ 00365000
*     END;                          /* END ALL QUEUE SEARCH  @ZM00787*/ 00366000
@RF00384 DS    0H                                                  0394 00367000
*                                                                  0394 00368000
*/********************************************************************/ 00369000
*/*  NO WORK FOUND - OR ELSE UNABLE TO RUN USER EXITS                */ 00370000
*/*    TRY TO UNGATE PSTRDYQ AND GET OUT                             */ 00371000
*/*     IF UNGATE FAILS RE-SCAN ALL QUES AGAIN                       */ 00372000
*/********************************************************************/ 00373000
*                                                                  0394 00374000
*SSCHECK:                                                          0394 00375000
*   RFY                                                            0394 00376000
*    (COMPODD,                                                     0394 00377000
*     SWAPODD) RSTD;                                               0394 00378000
SSCHECK  DS    0H                                                  0395 00379000
*   COMPEVN=PSTGATE1;               /* RDYQ GATED EMPTY              */ 00380000
         L     COMPEVN,@CF02709                                    0395 00381000
*   COMPODD=PSTFLGA;                /* PST FLAGS AT PRESENT          */ 00382000
         L     COMPODD,PSTFLGA(,PSTREG)                            0396 00383000
*   SWAPEVN=0;                      /* TO UNGATE RDYQ                */ 00384000
         SLR   SWAPEVN,SWAPEVN                                     0397 00385000
*   IF APCIRB1=ON                   /* IF IRB1 IN USE?               */ 00386000
*     THEN                          /* THEN                          */ 00387000
         TM    APCIRB1(CRRREG),B'00010000'                         0398 00388000
         BNO   @RF00398                                            0398 00389000
*     SWAPODD=COMPODD&PSTIRB10;     /* YES - CLEAR FLAG IN PST       */ 00390000
         LR    SWAPODD,COMPODD                                     0399 00391000
         N     SWAPODD,@CF02836                                    0399 00392000
*   ELSE                            /* NOT IRB1 - MUST BE IRB2       */ 00393000
*     SWAPODD=COMPODD&PSTIRB20;     /* CLEAR IRB2 IN USE FLAG        */ 00394000
         B     @RC00398                                            0400 00395000
@RF00398 LR    SWAPODD,COMPODD                                     0400 00396000
         N     SWAPODD,@CF02841                                    0400 00397000
*   CDS(COMPEVN,SWAPEVN,PSTRQFGA);  /* EQUAL-QUE UNGATED & FLAG OFF  */ 00398000
@RC00398 CDS   COMPEVN,SWAPEVN,PSTRQFGA(PSTREG)                    0401 00399000
*   BC(NE,SCNRDYQ);                 /* FAIL-SCAN QUES AGAIN          */ 00400000
         BC    7,SCNRDYQ                                           0402 00401000
*   RFY                                                            0403 00402000
*    (COMPODD,                                                     0403 00403000
*     SWAPODD) UNRSTD;                                             0403 00404000
*GETOUT:                            /* RDYQ UNGATED AND PSTIRB IN USE   00405000
*                                      FLG OFF                       */ 00406000
*   IF APCSMCR=ON                   /* RUNNING WITH SMS CRA?         */ 00407000
*     THEN                                                         0404 00408000
GETOUT   TM    APCSMCR(CRRREG),B'00100000'                         0404 00409000
         BNO   @RF00404                                            0404 00410000
*     DO;                           /* SET UP TO RELEASE SMS CRA     */ 00411000
*       APCRELR=ON;                 /* RPH TO BE RELEASED            */ 00412000
         OI    APCRELR(CRRREG),B'00000100'                         0406 00413000
*       RFY                                                        0407 00414000
*        (ZEROREG) RSTD;                                           0407 00415000
*       ZEROREG=PSTCRRS;            /* SMS CRA                       */ 00416000
         L     ZEROREG,PSTCRRS(,PSTREG)                            0408 00417000
*     END;                          /* END SET UP TO RELEASE SMS CRA */ 00418000
*   ELSE                                                           0410 00419000
*     APCRELR=OFF;                  /* ISTAPC58 WILL RELEASE NORM CRA*/ 00420000
         B     @RC00404                                            0410 00421000
@RF00404 NI    APCRELR(CRRREG),B'11111011'                         0410 00422000
*   APCEXIT=ON;                     /* ISTAPC58 IS TO RETURN TO    0411 00423000
*                                      SYSTEM                        */ 00424000
@RC00404 OI    APCEXIT(CRRREG),B'00000010'                         0411 00425000
*   APC52R=OFF;                     /* RESET RUNNING BIT     @Z30APGA*/ 00426000
         NI    APC52R(CRRREG),B'10111111'                          0412 00427000
*   REG15=ATCAP58;                  /* GET ADDR OF ISTAPC58 FROM   0413 00428000
*                                      ATCVT                         */ 00429000
         L     REG15,ATCAP58(,VCVTREG)                             0413 00430000
*   GOTO APC58;                     /* EXIT TO ISTAPC58              */ 00431000
         BR    REG15                                               0414 00432000
*   RFY                                                            0415 00433000
*    (ZEROREG) UNRSTD;                                             0415 00434000
*                                                                  0416 00435000
*/********************************************************************/ 00436000
*/*  WORK FOUND ON A SYS SERVICE DISPATCH QUE. DEQUE THE OLDEST PAB  */ 00437000
*/*   FROM THE QUEUE ADDRESSED BY ANCHREG THEN SETUP RPH REG1 AND    */ 00438000
*/*   GO TO ISTAPC57.                                                */ 00439000
*/********************************************************************/ 00440000
*                                                                  0416 00441000
*DEQDSP:                                                           0416 00442000
*   PABREG=QUEUEA;                  /* QUE HEAD ADDRESS              */ 00443000
DEQDSP   L     PABREG,QUEUEA(,ANCHREG)                             0416 00444000
*/*SEARCH TO END OF QUEUE FOR LAST PAB                               */ 00445000
*                                                                  0417 00446000
*   WORKREG=0;                      /* IND.IF ONLY ONE PAB           */ 00447000
         SLR   WORKREG,WORKREG                                     0417 00448000
*   DO WHILE(PABCHNGP^=0);          /* FIND END OF CHAIN             */ 00449000
         B     @DE00418                                            0418 00450000
@DL00418 DS    0H                                                  0419 00451000
*     WORKREG=PABREG;               /* MORE THAN ONE PAB ON Q        */ 00452000
         LR    WORKREG,PABREG                                      0419 00453000
*     PABREG=PABCHNGP;              /* STEP TO NEXT PAB              */ 00454000
         L     @07,PABCHNGP-1(,PABREG)                             0420 00455000
         LA    @07,0(,@07)                                         0420 00456000
         LR    PABREG,@07                                          0420 00457000
*   END;                            /* DO WHILE                      */ 00458000
@DE00418 L     @07,PABCHNGP-1(,PABREG)                             0421 00459000
         LA    @07,0(,@07)                                         0421 00460000
         LTR   @07,@07                                             0421 00461000
         BNZ   @DL00418                                            0421 00462000
*   IF WORKREG=0                    /* ONLY ONE PAB ON QUEUE         */ 00463000
*     THEN                          /* DEQUE PAB BY CLEARING         */ 00464000
         SLR   @07,@07                                             0422 00465000
         CR    WORKREG,@07                                         0422 00466000
         BNE   @RF00422                                            0422 00467000
*     QUEUEA=0;                     /* PSTQUE SLOT-NOT HIBYTE        */ 00468000
         ST    @07,QUEUEA(,ANCHREG)                                0423 00469000
*   ELSE                            /* DEQUE LAST PAB ON QUE         */ 00470000
*     WORKREG->PABCHNGP=0;          /* FROM PREVIOUS                 */ 00471000
         B     @RC00422                                            0424 00472000
@RF00422 SLR   @07,@07                                             0424 00473000
         STCM  @07,7,PABCHNGP(WORKREG)                             0424 00474000
*   IF PABRPHA=0                    /* IF PAB NOT TPPOSTED           */ 00475000
*     THEN                          /* THEN IT WILL NEED AN RPH      */ 00476000
@RC00422 L     @07,PABRPHA-1(,PABREG)                              0425 00477000
         LA    @07,0(,@07)                                         0425 00478000
         LTR   @07,@07                                             0425 00479000
         BNZ   @RF00425                                            0425 00480000
*DSPNORM:                                                          0426 00481000
*     DO;                           /* NORM SS PAB SET UP            */ 00482000
DSPNORM  DS    0H                                                  0427 00483000
*       PABRPHA=RPHREG;             /* CONNECT PAB TO RPH            */ 00484000
         STCM  RPHREG,7,PABRPHA(PABREG)                            0427 00485000
*       RPHRESMA=0;                 /* APC57 WILL INIT. RPH          */ 00486000
         SLR   @07,@07                                             0428 00487000
         ST    @07,RPHRESMA(,RPHREG)                               0428 00488000
*       RPHREG=0;                   /* CLEAR R1 FOR ISTAPC57         */ 00489000
         SLR   RPHREG,RPHREG                                       0429 00490000
*     END DSPNORM;                  /* END DISPATCH SETUP            */ 00491000
*   ELSE                            /* ELSE POSTED PAB HAS ITS OWN 0431 00492000
*                                      RPH                           */ 00493000
*DSPOSTD:                                                          0431 00494000
*     DO;                           /* POSTED PAB SET UP             */ 00495000
         B     @RC00425                                            0431 00496000
@RF00425 DS    0H                                                  0431 00497000
DSPOSTD  DS    0H                                                  0432 00498000
*       IF RPHREG=0                 /* IF USING SMS CRA              */ 00499000
*         THEN                      /* THEN GIVE ISTAPC57        @SMS   00500000
*                                      RPH                           */ 00501000
         LTR   RPHREG,RPHREG                                       0432 00502000
         BNZ   @RF00432                                            0432 00503000
*         RPHREG=ADDR(PSTCRRS->CRARPH);/* SMS RPH IN CRA             */ 00504000
         L     RPHREG,PSTCRRS(,PSTREG)                             0433 00505000
         LA    RPHREG,CRARPH(,RPHREG)                              0433 00506000
*     END DSPOSTD;                                                 0434 00507000
@RF00432 DS    0H                                                  0435 00508000
*   APC52R=OFF;                     /* RESET RUNNING FLG     @Z30APGA*/ 00509000
@RC00425 NI    APC52R(CRRREG),B'10111111'                          0435 00510000
*   REG15=ATCAP57;                                                 0436 00511000
         L     REG15,ATCAP57(,VCVTREG)                             0436 00512000
*   GOTO APC57;                     /* TO DISPATCH PAB-NO RET        */ 00513000
         BR    REG15                                               0437 00514000
*                                                                  0438 00515000
*/********************************************************************/ 00516000
*/* RUN USER EXITS. PSSQ & NSSQ ARE EMPTY.                           */ 00517000
*/*  FLAG PST AND CRR AS RUNNING USER EXITS.                         */ 00518000
*/*  UNGATE PSTRQUE. IF CANT UNGATE THEN SCHEDULE                    */ 00519000
*/*    ANOTHER IRB TO RUN THE NEW PAB.                               */ 00520000
*/*  CALL APC54 UNTIL UEQ IS EMPTY THEN TURN OFF                     */ 00521000
*/*    PST FLAGS FOR IRB IN USE AND UE RUNNING                       */ 00522000
*/*  THEN GET OUT                                                    */ 00523000
*/********************************************************************/ 00524000
*                                                                  0438 00525000
*DSPUSR:                                                           0438 00526000
*   IF PSTUERN^=ON                  /* USER EXIT RUNNING ON THIS IRB?*/ 00527000
*     THEN                          /* NO- SET UP TO RUN USER EXITS  */ 00528000
DSPUSR   TM    PSTUERN(PSTREG),B'01000000'                         0438 00529000
         BO    @RF00438                                            0438 00530000
*UNGFLG:                                                           0439 00531000
*     DO;                           /* SET EXIT RUNNING FLAGS        */ 00532000
UNGFLG   DS    0H                                                  0440 00533000
*       IF PSTIQE11->IQEIRB->RBFACTV=ON/* IF IRB1 IS IN USE  @ZA18946*/ 00534000
*           &PSTIQE21->IQEIRB->RBFACTV=ON/* AND IRB2 IS ALSO @ZA18946*/ 00535000
*         THEN                      /*                       @ZA34753*/ 00536000
         L     @07,PSTIQE11(,PSTREG)                               0440 00537000
         L     @07,IQEIRB(,@07)                                    0440 00538000
         TM    RBFACTV(@07),B'01000000'                            0440 00539000
         BNO   @RF00440                                            0440 00540000
         L     @07,PSTIQE21(,PSTREG)                               0440 00541000
         L     @07,IQEIRB(,@07)                                    0440 00542000
         TM    RBFACTV(@07),B'01000000'                            0440 00543000
         BNO   @RF00440                                            0440 00544000
*         DO;                       /* REQUE USER EXIT PAB   @ZA18946   00545000
*                                                            @ZA34753*/ 00546000
*           REG9=REG1;              /* SAVE R1 ACROSS CALL   @ZA34753*/ 00547000
         LR    REG9,REG1                                           0442 00548000
*           REG1=PSTREG;            /* PSTPTR FOR ISTAPC41   @ZA34753*/ 00549000
         LR    REG1,PSTREG                                         0443 00550000
*           REG15=ATCAP41;          /* GET ADDR APC41 FROM ATCVT   0444 00551000
*                                                            @ZA34753*/ 00552000
         L     REG15,ATCAP41(,VCVTREG)                             0444 00553000
*           CALL APC41;             /* CALL ISTAPC41 TO SCHED IRB  0445 00554000
*                                                            @ZA34753*/ 00555000
         BALR  @14,@15                                             0445 00556000
*           REG1=REG9;              /* RESTORE REG1 AFTER ACTAP    0446 00557000
*                                                            @ZA34753*/ 00558000
         LR    REG1,REG9                                           0446 00559000
*           GO TO CUSR41;           /* GO TO EXIT THIS IRB   @ZA34753*/ 00560000
         B     CUSR41                                              0447 00561000
*         END;                      /* ON OTHER IRB          @ZA34753*/ 00562000
*       COMPREG=PSTFLGA;            /* COMPARE REG FOR CS    @ZM31813*/ 00563000
@RF00440 L     COMPREG,PSTFLGA(,PSTREG)                            0449 00564000
*       SWAPREG=COMPREG|PSTUERN1;   /* PST UERN ON           @ZM31813*/ 00565000
         LR    SWAPREG,COMPREG                                     0450 00566000
         O     SWAPREG,@CF02711                                    0450 00567000
*       CS(COMPREG,SWAPREG,PSTFLGA);/* USE CS LOGIC          @ZM31813*/ 00568000
         CS    COMPREG,@06,PSTFLGA(PSTREG)                         0451 00569000
*       BC(NE,DSPUSR);              /* IF FAIL CHECK AGAIN   @ZM31813*/ 00570000
         BC    7,DSPUSR                                            0452 00571000
*       APCUETSK=ON;                /* SET CRR FLG AS RUNNING USER 0453 00572000
*                                      EXIT                          */ 00573000
         OI    APCUETSK(CRRREG),B'01000000'                        0453 00574000
*/* UNGATE PSTRQUE IF EMPTY. IF NOT EMPTY SCHED IRB                  */ 00575000
*                                                                  0454 00576000
*RUNUSR:                            /*                       @ZA32434*/ 00577000
*       COMPREG=PSTGATE1;           /* GATED EMPTY READY QUE         */ 00578000
RUNUSR   L     COMPREG,@CF02709                                    0454 00579000
*       SWAPREG=0;                  /* TO CLEAR GATE BIT             */ 00580000
         SLR   SWAPREG,SWAPREG                                     0455 00581000
*       CS(COMPREG,SWAPREG,PSTRQUE);/* EQ-PST RDY Q UNGATED          */ 00582000
         CS    COMPREG,@06,PSTRQUE(PSTREG)                         0456 00583000
*       BC(EQ,UNGTOK);              /* FAIL-SCHED IRB                */ 00584000
         BC    8,UNGTOK                                            0457 00585000
*       REG9=REG1;                  /* MOVE LABEL CUSR41     @ZA34753*/ 00586000
         LR    REG9,REG1                                           0458 00587000
*       REG1=PSTREG;                /* PSTPTR FOR ISTAPC41           */ 00588000
         LR    REG1,PSTREG                                         0459 00589000
*       REG15=ATCAP41;              /* GET ADDR OF ISTAPC41 FROM   0460 00590000
*                                      ATCVT                         */ 00591000
         L     REG15,ATCAP41(,VCVTREG)                             0460 00592000
*       CALL APC41;                 /* CALL ISTAPC41 TO SCHED IRB    */ 00593000
         BALR  @14,@15                                             0461 00594000
*       REG1=REG9;                  /* RESTORE R1 AFTER ACTAP        */ 00595000
         LR    REG1,REG9                                           0462 00596000
*UNGTOK:                                                           0463 00597000
*     END UNGFLG;                   /* END SET UP TO RUN USER EXITS  */ 00598000
UNGTOK   DS    0H                                                  0464 00599000
*   IF APCUETSK=ON                  /* CRR SET TO RUN USER ?         */ 00600000
*     THEN                          /* THEN RUN USER EXITS UNTIL   0464 00601000
*                                      PSTUEQ IS EMPTY               */ 00602000
@RF00438 TM    APCUETSK(CRRREG),B'01000000'                        0464 00603000
         BNO   @RF00464                                            0464 00604000
*     DO;                           /* RUN USER EXITS VIA ISTAPC54   */ 00605000
*       REG15=ATCAP54;              /* GET ADDR OF ISTAPC54 FROM   0466 00606000
*                                      ATCVT                         */ 00607000
         L     REG15,ATCAP54(,VCVTREG)                             0466 00608000
*       CALL APC54;                 /* DISP USER EXITS               */ 00609000
         BALR  @14,@15                                             0467 00610000
*/* IF THE PST READY QUEUE IS NON-ZERO AT LABEL UERES0, AN   @ZA37293*/ 00611000
*/* IRB MUST HAVE BEEN SCHEDULED.  ISTAPC52 WILL LOOP UNTIL  @ZA37293*/ 00612000
*/* THAT SECOND IRB HAS PRE-EMPTED THE ONE WE'RE RUNNING     @ZA37293*/ 00613000
*/* UNDER AND CLEARED THE READY QUEUE.                       @ZA37293*/ 00614000
*                                                                  0468 00615000
*UERES0:                                                           0468 00616000
*       COMPREG=0;                  /* COMPARE REG FOR CS    @ZA32434*/ 00617000
UERES0   SLR   COMPREG,COMPREG                                     0468 00618000
*       SWAPREG=PSTGATE1;           /* TURN ON READY QUEUE GATE    0469 00619000
*                                                            @ZA32434*/ 00620000
         L     SWAPREG,@CF02709                                    0469 00621000
*       CS(COMPREG,SWAPREG,PSTRQUE);/* USE CS LOGIC          @ZA32434*/ 00622000
         CS    COMPREG,@06,PSTRQUE(PSTREG)                         0470 00623000
*       BC(EQ,GATOK);               /* IF SUCCESSFUL, CONTINUE     0471 00624000
*                                                            @ZM31813   00625000
*                                                            @ZA39860*/ 00626000
         BC    8,GATOK                                             0471 00627000
*/* THE CALLDISP MACRO (SVC 116) WILL GIVE CONTROL TO THE     @ZA39860  00628000
*                                                                    */ 00629000
*/* MVS DISPATCHER.  THAT WILL RESULT IN THE DISPATCH OF THE  @ZA39860  00630000
*                                                                    */ 00631000
*/* IRB THAT WILL CLEAR OFF THE PST READY QUEUE.              @ZA39860  00632000
*                                                                    */ 00633000
*                                                                  0472 00634000
*       GENERATE;                                                  0472 00635000
*                                                           /*@ZA39860* 00636000
            LA 15,8(0,0)                                                00637000
            SVC 116                                                     00638000
*       GOTO UERES0;                /* TRY AGAIN TO GATE THE READY 0473 00639000
*                                      QUEUE                 @ZA39860*/ 00640000
         B     UERES0                                              0473 00641000
*GATOK:                             /*                       @ZA39860*/ 00642000
*       IF PSTUEQ^=0                /* IF USER EXIT QUE IS NOT EMPTY    00643000
*                                                            @VS40787*/ 00644000
*         THEN                                                     0474 00645000
GATOK    L     @07,PSTUEQ(,PSTREG)                                 0474 00646000
         LTR   @07,@07                                             0474 00647000
         BNZ   @RT00474                                            0474 00648000
*         GOTO RUNUSR;              /* THEN BRANCH TO RUN SOME MORE     00649000
*                                                            @ZA32434*/ 00650000
*CKUERN:                                                           0476 00651000
*       COMPREG=PSTFLGA;            /* COMP REG FOR CS       @ZA32434*/ 00652000
CKUERN   L     COMPREG,PSTFLGA(,PSTREG)                            0476 00653000
*       SWAPREG=COMPREG&PSTUERN0;   /* SWAP UERN OFF         @ZA32434*/ 00654000
         LR    SWAPREG,COMPREG                                     0477 00655000
         N     SWAPREG,@CF02833                                    0477 00656000
*       CS(COMPREG,SWAPREG,PSTFLGA);/* USE CS LOGIC          @ZM31813*/ 00657000
         CS    COMPREG,@06,PSTFLGA(PSTREG)                         0478 00658000
*       BC(NE,CKUERN);              /* IF FAIL RECHECK PSTFLAGA    0479 00659000
*                                                            @ZA32434*/ 00660000
         BC    7,CKUERN                                            0479 00661000
*       GOTO SSCHECK;               /* GOTO UNGATE READY QUEUE AND 0480 00662000
*                                      EXIT                          */ 00663000
         B     SSCHECK                                             0480 00664000
*/* THIS CODE IS RUN IF BOTH IRBS ARE ACTIVE AND THE          @ZA34753  00665000
*                                                                    */ 00666000
*/* WORK WE ARE TRYING TO SCHEDULE IS A USER EXIT PAB         @ZA34753  00667000
*                                                                    */ 00668000
*                                                                  0481 00669000
*CUSR41:                            /*                       @ZA34753*/ 00670000
*       COMPREG=PSTFLGA;            /* COMPARE REG FOR CS    @ZA34753*/ 00671000
CUSR41   L     COMPREG,PSTFLGA(,PSTREG)                            0481 00672000
*       IF APCIRB1=ON               /* IF RUNNING UNDER IRB1 @ZA34753*/ 00673000
*         THEN                      /* SET UP TO SWAP IRB1 OFF     0482 00674000
*                                                            @ZA34753*/ 00675000
         TM    APCIRB1(CRRREG),B'00010000'                         0482 00676000
         BNO   @RF00482                                            0482 00677000
*         SWAPREG=COMPREG&PSTIRB10; /* IRB1 IN USE OFF       @ZA34753*/ 00678000
         LR    SWAPREG,COMPREG                                     0483 00679000
         N     SWAPREG,@CF02836                                    0483 00680000
*       ELSE                        /* NOT IRB1 - MUST BE IRB2     0484 00681000
*                                                            @ZA34753*/ 00682000
*         SWAPREG=COMPREG&PSTIRB20; /* IRB2 IN USE OFF       @ZA34753*/ 00683000
         B     @RC00482                                            0484 00684000
@RF00482 LR    SWAPREG,COMPREG                                     0484 00685000
         N     SWAPREG,@CF02841                                    0484 00686000
*       CS(COMPREG,SWAPREG,PSTFLGA);/* USE CS LOGIC          @ZA34753*/ 00687000
@RC00482 CS    COMPREG,@06,PSTFLGA(PSTREG)                         0485 00688000
*       BC(NE,CUSR41);              /* IF FAIL SET UP AND TRY AGAIN     00689000
*                                                            @ZA34753*/ 00690000
         BC    7,CUSR41                                            0486 00691000
*       GOTO GETOUT;                /* NO MORE USER EXIT PABS TO   0487 00692000
*                                      DISPATCH, SO OUT      @ZA34753*/ 00693000
         B     GETOUT                                              0487 00694000
*/* FOLLOWING 11 LINES REMOVED BY APAR AZ32434                @ZA32434* 00695000
* *PSTUERN OFF OR UEQ EMPTY. RESET IRB IN USE FLAG & GETOUT   @ZM31813* 00696000
*   COMPREG=PSTFLGA                *COMPARE REG FOR CS        @ZM31813* 00697000
*           IF APCIRB1=ON          *IF RUNNING UNDER IRB ONE          * 00698000
*            THEN                  *SET UP TO SWAP IRB1 OFF           * 00699000
*   SWAPREG=COMPREG & PSTIRB10     * IRB1 IN USE  OFF         @ZM31813* 00700000
*            ELSE                  *NOT IRB1 -MUST BE IRB2            * 00701000
*   SWAPREG=COMPREG & PSTIRB20     * IRB2 IN USE  OFF         @ZM31813* 00702000
*IRBRES0: CS (COMPREG,SWAPREG,PSTFLGA)    *USE CS LOGIC       @ZM31813* 00703000
*        BC (NE,IRBRES0)           *IF FAIL - SET UP AND TRY AGAIN    * 00704000
*        GOTO GETOUT               *NO MORE USER EXIT PABS         0488 00705000
*                                              TO DISPATCH, SO OUT    * 00706000
*  ABOVE LINES REMOVED BY APAR AZ32434                        @ZA32434  00707000
*                                                                    */ 00708000
*                                                                  0488 00709000
*     END;                          /* END OF PROCESS TO RUN USER  0488 00710000
*                                      EXITS                 @ZA32434*/ 00711000
*   ELSE                                                           0489 00712000
*     GOTO SSCHECK;                 /* CANT RUN USER. APCUETSK OFF -    00713000
*                                      GO TO UNGATE & TURN OFF IRB 0489 00714000
*                                      USE FLG                       */ 00715000
*   GENERATE DEFS(ESTST,ESTEND);                                   0490 00716000
        DS    0F                                                        00717000
ESTST  EQU *                                                            00718000
  ESTAE ,OV,XCTL=NO,PURGE=NONE,ASYNCH=YES,ESTAR=NO,MF=L,TERM=YES        00719000
ESTEND  EQU *                                                           00720000
*   DO;                             /* TPEPILOG                      */ 00721000
*     GEN(PRINT OFF);                                              0492 00722000
         PRINT OFF                                                      00723000
*     GEN(PRINT ON);                                               0493 00724000
         PRINT ON                                                       00725000
*   END;                            /* TPEPILOG                      */ 00726000
*   END ISTAPC52                                                   0495 00727000
*                                                                  0495 00728000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00729000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00730000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00731000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 00732000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 00733000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 00734000
*/*%INCLUDE SYSLIB  (IHAIQE  )                                       */ 00735000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00736000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00737000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00738000
*                                                                  0495 00739000
*       ;                                                          0495 00740000
@EL00001 DS    0H                                                  0495 00741000
@EF00001 DS    0H                                                  0495 00742000
@ER00001 BR    @14                                                 0495 00743000
@DATA    DS    0H                                                       00744000
@SM03539 MVC   APCESTAL(0,CRRREG),ZLIST                                 00745000
@DATD    DSECT                                                          00746000
         DS    0F                                                       00747000
ISTAPC52 CSECT                                                          00748000
         DS    0F                                                       00749000
@CF02629 DC    XL4'F7FFFFFF'                                            00750000
@CF02633 DC    XL4'FBFFFFFF'                                            00751000
@CF02709 DC    XL4'80000000'                                            00752000
@CF02711 DC    XL4'40000000'                                            00753000
@CF02833 DC    XL4'BFFFFFFF'                                            00754000
@CF02836 DC    XL4'DFFFFFFF'                                            00755000
@CF02841 DC    XL4'EFFFFFFF'                                            00756000
@CF03484 DC    XL4'00FFFFFF'                                            00757000
@DATD    DSECT                                                          00758000
         DS    0D                                                       00759000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00760000
@ENDDATD EQU   *                                                        00761000
ISTAPC52 CSECT                                                          00762000
         DS    0F                                                       00763000
@SIZDATD DC    AL1(0)                                                   00764000
         DC    AL3(@ENDDATD-@DATD)                                      00765000
         DS    0D                                                       00766000
NOPABS   DS    CL12                                                     00767000
         ORG   NOPABS                                                   00768000
@NM00146 DC    12AL1(0)                                                 00769000
         ORG   NOPABS+12                                                00770000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00771000
@01      EQU   01                                                       00772000
@02      EQU   02                                                       00773000
@03      EQU   03                                                       00774000
@04      EQU   04                                                       00775000
@05      EQU   05                                                       00776000
@06      EQU   06                                                       00777000
@07      EQU   07                                                       00778000
@08      EQU   08                                                       00779000
@09      EQU   09                                                       00780000
@10      EQU   10                                                       00781000
@11      EQU   11                                                       00782000
@12      EQU   12                                                       00783000
@13      EQU   13                                                       00784000
@14      EQU   14                                                       00785000
@15      EQU   15                                                       00786000
RPHPTR   EQU   @01                                                      00787000
ZEROREG  EQU   @00                                                      00788000
RPHREG   EQU   @01                                                      00789000
REG1     EQU   @01                                                      00790000
COMPREG  EQU   @04                                                      00791000
COMPEVN  EQU   @04                                                      00792000
RETRYREG EQU   @04                                                      00793000
COMPODD  EQU   @05                                                      00794000
SWAPREG  EQU   @06                                                      00795000
SWAPEVN  EQU   @06                                                      00796000
ESCRAREG EQU   @06                                                      00797000
SWAPODD  EQU   @07                                                      00798000
VCVTREG  EQU   @08                                                      00799000
PABREG   EQU   @09                                                      00800000
REG9     EQU   @09                                                      00801000
PSTREG   EQU   @10                                                      00802000
ANCHREG  EQU   @11                                                      00803000
MISCREG  EQU   @11                                                      00804000
BASEREG  EQU   @12                                                      00805000
CRRREG   EQU   @13                                                      00806000
CRAREG   EQU   @13                                                      00807000
BACREG   EQU   @14                                                      00808000
WORKREG  EQU   @15                                                      00809000
REG15    EQU   @15                                                      00810000
PSA      EQU   0                                                        00811000
FLCRNPSW EQU   PSA                                                      00812000
FLCROPSW EQU   PSA+8                                                    00813000
FLCICCW2 EQU   PSA+16                                                   00814000
PSAEEPSW EQU   PSA+132                                                  00815000
PSAESPSW EQU   PSA+136                                                  00816000
FLCSVILC EQU   PSAESPSW+1                                               00817000
PSAEPPSW EQU   PSA+140                                                  00818000
FLCPIILC EQU   PSAEPPSW+1                                               00819000
FLCPICOD EQU   PSAEPPSW+2                                               00820000
PSAPICOD EQU   FLCPICOD+1                                               00821000
FLCTEA   EQU   PSAEPPSW+4                                               00822000
FLCPER   EQU   PSA+152                                                  00823000
FLCMCLA  EQU   PSA+168                                                  00824000
FLCIOEL  EQU   FLCMCLA+4                                                00825000
FLCIOA   EQU   FLCMCLA+16                                               00826000
FLCFSA   EQU   FLCMCLA+80                                               00827000
PSASUPER EQU   PSA+552                                                  00828000
PSASUP1  EQU   PSASUPER                                                 00829000
PSASUP2  EQU   PSASUPER+1                                               00830000
PSASUP3  EQU   PSASUPER+2                                               00831000
PSASUP4  EQU   PSASUPER+3                                               00832000
PSACLHT  EQU   PSA+640                                                  00833000
PSALKSA  EQU   PSA+696                                                  00834000
PSAHLHI  EQU   PSA+760                                                  00835000
PSADSSFL EQU   PSA+836                                                  00836000
PSADSSF1 EQU   PSADSSFL                                                 00837000
PSADSSF3 EQU   PSADSSFL+2                                               00838000
PSADSSF4 EQU   PSADSSFL+3                                               00839000
PSARSVT  EQU   PSA+896                                                  00840000
ATCLCPTR EQU   1032                                                     00841000
ASCB     EQU   0                                                        00842000
ASCBSUPC EQU   ASCB+16                                                  00843000
ASCBFW1  EQU   ASCB+100                                                 00844000
ASCBRCTF EQU   ASCBFW1+2                                                00845000
ASCBFLG1 EQU   ASCBFW1+3                                                00846000
ASCBDSP1 EQU   ASCB+114                                                 00847000
ASCBFLG2 EQU   ASCB+115                                                 00848000
ASCBLKGP EQU   ASCB+128                                                 00849000
ASCBSRQ  EQU   ASCB+180                                                 00850000
ASCBSRQ1 EQU   ASCBSRQ                                                  00851000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00852000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00853000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00854000
ASXB     EQU   0                                                        00855000
ASXBAEQ  EQU   ASXB+168                                                 00856000
ASXBCASW EQU   ASXB+216                                                 00857000
ASXBCRB1 EQU   ASXBCASW                                                 00858000
RBPRFX   EQU   0                                                        00859000
RBBASIC  EQU   0                                                        00860000
RBEXRTNM EQU   RBBASIC                                                  00861000
RBTMFLD  EQU   RBEXRTNM                                                 00862000
RBSTAB   EQU   RBBASIC+10                                               00863000
XSTAB    EQU   RBSTAB                                                   00864000
RBSTAB1  EQU   XSTAB                                                    00865000
XSTAB1   EQU   RBSTAB1                                                  00866000
RBFTCKPT EQU   XSTAB1                                                   00867000
RBSTAB2  EQU   XSTAB+1                                                  00868000
XSTAB2   EQU   RBSTAB2                                                  00869000
RBTCBNXT EQU   XSTAB2                                                   00870000
RBFACTV  EQU   XSTAB2                                                   00871000
RBFDYN   EQU   XSTAB2                                                   00872000
RBECBWT  EQU   XSTAB2                                                   00873000
RBOPSW   EQU   RBBASIC+16                                               00874000
XRBPSW   EQU   RBOPSW                                                   00875000
RBOPSWB2 EQU   XRBPSW+1                                                 00876000
RBLINK   EQU   RBBASIC+28                                               00877000
XRBLNK   EQU   RBLINK                                                   00878000
RBWCF    EQU   XRBLNK                                                   00879000
RBLINKB  EQU   XRBLNK+1                                                 00880000
RBGRSAVE EQU   RBBASIC+32                                               00881000
XRBREG   EQU   RBGRSAVE                                                 00882000
RBGRS0   EQU   XRBREG                                                   00883000
RBGRS1   EQU   XRBREG+4                                                 00884000
RBGRS2   EQU   XRBREG+8                                                 00885000
RBGRS3   EQU   XRBREG+12                                                00886000
RBGRS4   EQU   XRBREG+16                                                00887000
RBGRS5   EQU   XRBREG+20                                                00888000
RBGRS6   EQU   XRBREG+24                                                00889000
RBGRS7   EQU   XRBREG+28                                                00890000
RBGRS8   EQU   XRBREG+32                                                00891000
RBGRS9   EQU   XRBREG+36                                                00892000
RBGRS10  EQU   XRBREG+40                                                00893000
RBGRS11  EQU   XRBREG+44                                                00894000
RBGRS12  EQU   XRBREG+48                                                00895000
RBGRS13  EQU   XRBREG+52                                                00896000
RBGRS14  EQU   XRBREG+56                                                00897000
RBGRS15  EQU   XRBREG+60                                                00898000
XRBESA   EQU   RBBASIC+96                                               00899000
RBPREFIX EQU   0                                                        00900000
RBRSV019 EQU   RBPREFIX+14                                              00901000
RBRSV028 EQU   RBPREFIX+15                                              00902000
RBRSV041 EQU   RBPREFIX+27                                              00903000
RBRSV054 EQU   RBPREFIX+39                                              00904000
RBRTOPSW EQU   RBPREFIX+40                                              00905000
RBRTPSW2 EQU   RBRTOPSW+8                                               00906000
RBRTICIL EQU   RBRTPSW2                                                 00907000
RBFLAGS1 EQU   RBPREFIX+56                                              00908000
RBINTCDA EQU   RBPREFIX+61                                              00909000
RBSECT   EQU   0                                                        00910000
RBPPSAV  EQU   RBSECT                                                   00911000
@NM00036 EQU   RBSECT+10                                                00912000
@NM00037 EQU   @NM00036                                                 00913000
RBTRSVRB EQU   @NM00037                                                 00914000
@NM00039 EQU   @NM00036+1                                               00915000
RBETXR   EQU   @NM00039                                                 00916000
RBEP     EQU   RBSECT+12                                                00917000
RBPGMQ   EQU   RBSECT+24                                                00918000
@NM00046 EQU   RBSECT+28                                                00919000
@NM00047 EQU   @NM00046                                                 00920000
IRBEND   EQU   RBSECT+96                                                00921000
@NM00050 EQU   RBSECT+96                                                00922000
RBRSV138 EQU   @NM00050+7                                               00923000
RBSCBB   EQU   RBSECT+144                                               00924000
RBSPARM  EQU   RBSCBB+8                                                 00925000
RBSFLGS1 EQU   RBSPARM                                                  00926000
RBSIOPRC EQU   RBSFLGS1                                                 00927000
RBSOWNR  EQU   RBSCBB+12                                                00928000
RBSFLGS2 EQU   RBSOWNR                                                  00929000
RBSDATA  EQU   RBSCBB+16                                                00930000
RBSFLG3  EQU   RBSDATA                                                  00931000
RBRSV150 EQU   RBSECT+167                                               00932000
IQESECT  EQU   0                                                        00933000
IQELNK   EQU   IQESECT                                                  00934000
IQEIRB   EQU   IQESECT+8                                                00935000
IQEFLAGS EQU   IQEIRB                                                   00936000
IQETCB   EQU   IQESECT+12                                               00937000
TCBFIX   EQU   0                                                        00938000
TCBFRS   EQU   TCBFIX                                                   00939000
TCB      EQU   0                                                        00940000
TCBPIE   EQU   TCB+4                                                    00941000
TCBPMASK EQU   TCBPIE                                                   00942000
TCBCMP   EQU   TCB+16                                                   00943000
TCBCMPF  EQU   TCBCMP                                                   00944000
TCBCPP   EQU   TCBCMPF                                                  00945000
TCBSTCC  EQU   TCBCMPF                                                  00946000
TCBCDBL  EQU   TCBCMPF                                                  00947000
TCBCWTO  EQU   TCBCMPF                                                  00948000
TCBCIND  EQU   TCBCMPF                                                  00949000
TCBCMSG  EQU   TCBCMPF                                                  00950000
TCBTRN   EQU   TCB+20                                                   00951000
TCBABF   EQU   TCBTRN                                                   00952000
TCBMSS   EQU   TCB+24                                                   00953000
TCBPKF   EQU   TCB+28                                                   00954000
TCBFLGS  EQU   TCB+29                                                   00955000
TCBFLGS1 EQU   TCBFLGS                                                  00956000
TCBFLGS2 EQU   TCBFLGS+1                                                00957000
TCBFLGS3 EQU   TCBFLGS+2                                                00958000
TCBFLGS4 EQU   TCBFLGS+3                                                00959000
TCBFLGS5 EQU   TCBFLGS+4                                                00960000
TCBABWF  EQU   TCBFLGS5                                                 00961000
TCBJPQ   EQU   TCB+44                                                   00962000
TCBPURGE EQU   TCBJPQ                                                   00963000
TCBGRS   EQU   TCB+48                                                   00964000
TCBFSA   EQU   TCB+112                                                  00965000
TCBTME   EQU   TCB+120                                                  00966000
TCBJSTCB EQU   TCB+124                                                  00967000
TCBTSFLG EQU   TCB+148                                                  00968000
TCBTSTSK EQU   TCBTSFLG                                                 00969000
TCBSTAB  EQU   TCB+160                                                  00970000
TCBNSTAE EQU   TCBSTAB                                                  00971000
TCBTCT   EQU   TCB+164                                                  00972000
TCBTCTGF EQU   TCBTCT                                                   00973000
TCBSCNDY EQU   TCB+172                                                  00974000
TCBNDSP  EQU   TCBSCNDY                                                 00975000
TCBNDSP1 EQU   TCBNDSP+1                                                00976000
TCBNDSP2 EQU   TCBNDSP+2                                                00977000
TCBNDSP3 EQU   TCBNDSP+3                                                00978000
TCBJSCB  EQU   TCB+180                                                  00979000
TCBRECDE EQU   TCBJSCB                                                  00980000
TCBEXT1  EQU   TCB+196                                                  00981000
TCBBITS  EQU   TCB+200                                                  00982000
TCBNDSP4 EQU   TCBBITS                                                  00983000
TCBNDSP5 EQU   TCBBITS+1                                                00984000
TCBFLGS6 EQU   TCBBITS+2                                                00985000
TCBFLGS7 EQU   TCBBITS+3                                                00986000
TCBDAR   EQU   TCB+204                                                  00987000
TCBDARC  EQU   TCBDAR                                                   00988000
TCBEXT2  EQU   TCB+208                                                  00989000
TCBFOE   EQU   TCB+244                                                  00990000
TCBESTAE EQU   TCB+264                                                  00991000
TCBESTRM EQU   TCBESTAE+1                                               00992000
TCBFBYT1 EQU   TCB+276                                                  00993000
TCBFBYT2 EQU   TCB+277                                                  00994000
TCBRV124 EQU   TCB+278                                                  00995000
TCBRV133 EQU   TCB+279                                                  00996000
TCBXTNT2 EQU   0                                                        00997000
TCBGTF   EQU   TCBXTNT2                                                 00998000
TCBTFLG  EQU   TCBGTF                                                   00999000
TCBRV146 EQU   TCBXTNT2+28                                              01000000
TCBRV155 EQU   TCBXTNT2+29                                              01001000
TCBRV164 EQU   TCBXTNT2+30                                              01002000
TCBRV173 EQU   TCBXTNT2+31                                              01003000
CVTMAP   EQU   0                                                        01004000
CVTDAR   EQU   CVTMAP+72                                                01005000
CVTFLGS1 EQU   CVTDAR                                                   01006000
CVTDCB   EQU   CVTMAP+116                                               01007000
CVTIERLC EQU   CVTMAP+144                                               01008000
CVTOPTA  EQU   CVTMAP+182                                               01009000
CVTOPTB  EQU   CVTMAP+183                                               01010000
CVTGTF   EQU   CVTMAP+236                                               01011000
CVTGTFST EQU   CVTGTF                                                   01012000
CVTGTFS  EQU   CVTGTFST                                                 01013000
CVTSTATE EQU   CVTGTFST                                                 01014000
CVTTMODE EQU   CVTGTFST                                                 01015000
CVTFORM  EQU   CVTGTFST                                                 01016000
CVTAQAVT EQU   CVTMAP+240                                               01017000
CVTTCMFG EQU   CVTAQAVT                                                 01018000
CVTVOLM2 EQU   CVTMAP+244                                               01019000
CVTTATA  EQU   CVTVOLM2                                                 01020000
CVTTSKS  EQU   CVTTATA                                                  01021000
CVTVOLF2 EQU   CVTTSKS                                                  01022000
CVTTAT   EQU   CVTTATA+1                                                01023000
CVTATER  EQU   CVTMAP+248                                               01024000
CVTEXT1  EQU   CVTMAP+252                                               01025000
CVTPURG  EQU   CVTMAP+260                                               01026000
CVTQMSG  EQU   CVTMAP+268                                               01027000
CVTDMSR  EQU   CVTMAP+272                                               01028000
CVTRSV37 EQU   CVTDMSR                                                  01029000
CVTDMSRF EQU   CVTRSV37                                                 01030000
CVTERPV  EQU   CVTMAP+316                                               01031000
CVTINTLA EQU   CVTMAP+320                                               01032000
CVTAPF   EQU   CVTMAP+324                                               01033000
CVTEXT2  EQU   CVTMAP+328                                               01034000
CVTHJES  EQU   CVTMAP+332                                               01035000
CVTPGSIA EQU   CVTMAP+348                                               01036000
CVTA1F1  EQU   CVTMAP+356                                               01037000
CVTSYSK  EQU   CVTMAP+357                                               01038000
CVTVOLM1 EQU   CVTMAP+380                                               01039000
CVTVOLF1 EQU   CVTVOLM1                                                 01040000
CVTXTNT1 EQU   0                                                        01041000
CVTXTNT2 EQU   0                                                        01042000
CVTDSSV  EQU   CVTXTNT2                                                 01043000
CVTFLGBT EQU   CVTXTNT2+5                                               01044000
CVTQID   EQU   CVTXTNT2+24                                              01045000
CVTRV400 EQU   CVTXTNT2+52                                              01046000
CVTRV409 EQU   CVTXTNT2+53                                              01047000
CVTATCVT EQU   CVTXTNT2+64                                              01048000
CVTRV429 EQU   CVTXTNT2+84                                              01049000
CVTRV438 EQU   CVTXTNT2+85                                              01050000
CVTRV457 EQU   CVTXTNT2+112                                             01051000
CVTRV466 EQU   CVTXTNT2+113                                             01052000
CVTFIX   EQU   0                                                        01053000
CVTRELNO EQU   CVTFIX+252                                               01054000
SRBSECT  EQU   0                                                        01055000
SRBFLC   EQU   SRBSECT+12                                               01056000
ISTPFCRR EQU   0                                                        01057000
PFCCRR   EQU   ISTPFCRR                                                 01058000
PFCCRRID EQU   PFCCRR                                                   01059000
PFCCRRLN EQU   PFCCRR+2                                                 01060000
PFCHDR   EQU   ISTPFCRR+4                                               01061000
PFCCRRO  EQU   PFCHDR                                                   01062000
PFCFRRO  EQU   PFCHDR+4                                                 01063000
ISTCFCRR EQU   0                                                        01064000
CFCAUDIT EQU   ISTCFCRR                                                 01065000
CFCNTRD  EQU   CFCAUDIT                                                 01066000
CFCCRT   EQU   CFCAUDIT+1                                               01067000
ISTDCCRR EQU   0                                                        01068000
CRRSPACE EQU   ISTDCCRR+12                                              01069000
CRRSAREA EQU   0                                                        01070000
CRRMAS   EQU   CRRSAREA+148                                             01071000
CRRMAS1  EQU   CRRMAS                                                   01072000
CRRMAS2  EQU   CRRMAS+1                                                 01073000
CRRMAS3  EQU   CRRMAS+2                                                 01074000
CRRMAS4  EQU   CRRMAS+3                                                 01075000
CRRRMAS1 EQU   CRRMAS+4                                                 01076000
CRRRMAS2 EQU   CRRMAS+5                                                 01077000
CRRRMAS3 EQU   CRRMAS+6                                                 01078000
CRRSMAS  EQU   CRRRMAS3                                                 01079000
CRRATS   EQU   CRRSAREA+156                                             01080000
CRRATS1  EQU   CRRATS                                                   01081000
CRRATS2  EQU   CRRATS+1                                                 01082000
CRRATS3  EQU   CRRATS+2                                                 01083000
CRRATS4  EQU   CRRATS+3                                                 01084000
CRRRATS1 EQU   CRRATS+4                                                 01085000
CRRRATS2 EQU   CRRATS+5                                                 01086000
CRRRATS3 EQU   CRRATS+6                                                 01087000
CRRSATS  EQU   CRRRATS3                                                 01088000
CRRFLGS1 EQU   CRRSAREA+164                                             01089000
CRRFLGS2 EQU   CRRSAREA+165                                             01090000
CRRFLGS3 EQU   CRRSAREA+166                                             01091000
CRRFLGS4 EQU   CRRSAREA+167                                             01092000
CRRFLGS  EQU   CRRSAREA+168                                             01093000
CRRRFLG1 EQU   CRRSAREA+169                                             01094000
CRRRTYPE EQU   CRRRFLG1                                                 01095000
CRRFDBK1 EQU   CRRSAREA+170                                             01096000
CRRFDB2  EQU   CRRFDBK1+1                                               01097000
CRRFDB3  EQU   CRRFDBK1+2                                               01098000
CRRFDBK2 EQU   CRRSAREA+176                                             01099000
CRRDSB   EQU   CRRFDBK2                                                 01100000
CRRESR   EQU   CRRFDBK2+2                                               01101000
CRRTRBUF EQU   CRRSAREA+204                                             01102000
CRRBFLGS EQU   CRRSAREA+280                                             01103000
ISTASCRR EQU   0                                                        01104000
ASCFLAGS EQU   ISTASCRR+16                                              01105000
ASCFLG1  EQU   ASCFLAGS                                                 01106000
ASCFLG2  EQU   ASCFLAGS+2                                               01107000
ASCFLG3  EQU   ASCFLAGS+4                                               01108000
ASCUSRGS EQU   ISTASCRR+28                                              01109000
ISTAPCRR EQU   0                                                        01110000
APCHDRSV EQU   ISTAPCRR                                                 01111000
APCATFLG EQU   ISTAPCRR+16                                              01112000
APC52E   EQU   APCATFLG                                                 01113000
APCRFLG  EQU   ISTAPCRR+18                                              01114000
APC52R   EQU   APCRFLG                                                  01115000
APCPSTA  EQU   ISTAPCRR+20                                              01116000
APCTCBA  EQU   ISTAPCRR+24                                              01117000
APCRTRN  EQU   ISTAPCRR+28                                              01118000
APCAUT   EQU   APCRTRN                                                  01119000
APCSAVE  EQU   ISTAPCRR+44                                              01120000
APCESTAL EQU   APCSAVE                                                  01121000
APCCOMF  EQU   ISTAPCRR+116                                             01122000
APCCOMF1 EQU   APCCOMF                                                  01123000
APCUETSK EQU   APCCOMF1                                                 01124000
APCSMCR  EQU   APCCOMF1                                                 01125000
APCIRB1  EQU   APCCOMF1                                                 01126000
APCRELR  EQU   APCCOMF1                                                 01127000
APCEXIT  EQU   APCCOMF1                                                 01128000
APCSWTWD EQU   ISTAPCRR+128                                             01129000
APC31FLG EQU   ISTAPCRR+132                                             01130000
APC52FLG EQU   ISTAPCRR+133                                             01131000
APCSMSR  EQU   APC52FLG                                                 01132000
APC53FLG EQU   ISTAPCRR+134                                             01133000
APC54FLG EQU   ISTAPCRR+135                                             01134000
APC57FLG EQU   ISTAPCRR+136                                             01135000
ISTRPH   EQU   0                                                        01136000
RPHCNTL  EQU   ISTRPH                                                   01137000
RPHFLAGS EQU   RPHCNTL+2                                                01138000
RPHFSTLC EQU   RPHFLAGS                                                 01139000
RPHFLGB  EQU   RPHCNTL+3                                                01140000
RPHRPHA  EQU   ISTRPH+4                                                 01141000
RPHTSKID EQU   ISTRPH+8                                                 01142000
RPHRESMA EQU   ISTRPH+16                                                01143000
RPHWPFLG EQU   RPHRESMA                                                 01144000
RPHWEA   EQU   ISTRPH+24                                                01145000
RPHCSPA  EQU   RPHWEA                                                   01146000
RPHSRPRM EQU   ISTRPH+28                                                01147000
RPHCRR   EQU   ISTRPH+32                                                01148000
RPHPABQA EQU   ISTRPH+36                                                01149000
RPHWORK  EQU   ISTRPH+40                                                01150000
RPHSAVE1 EQU   RPHWORK                                                  01151000
RPHSBITS EQU   RPHSAVE1+1                                               01152000
ISTCRA   EQU   0                                                        01153000
CRABASIC EQU   ISTCRA                                                   01154000
CRAHDR   EQU   CRABASIC                                                 01155000
CRACRR   EQU   CRAHDR                                                   01156000
CRALKACT EQU   CRABASIC+8                                               01157000
CRARPH   EQU   ISTCRA+52                                                01158000
CRAPSS   EQU   ISTCRA+160                                               01159000
CRAPROCR EQU   ISTCRA+312                                               01160000
CRASVC   EQU   ISTCRA+924                                               01161000
CRABUFA  EQU   CRASVC+68                                                01162000
CRARSV01 EQU   ISTCRA+996                                               01163000
CRARSV02 EQU   ISTCRA+1000                                              01164000
CRAIDS   EQU   ISTCRA+1004                                              01165000
CRACHAIN EQU   ISTCRA+1012                                              01166000
ISTLOK   EQU   0                                                        01167000
LOKCHN   EQU   ISTLOK+1                                                 01168000
LOKCHNG  EQU   LOKCHN                                                   01169000
@NM00090 EQU   LOKCHNG+2                                                01170000
ISTPAB   EQU   0                                                        01171000
PABWQCHN EQU   ISTPAB                                                   01172000
PABWEQA  EQU   PABWQCHN                                                 01173000
PABCHAIN EQU   PABWQCHN+4                                               01174000
PABRUNNG EQU   PABCHAIN                                                 01175000
PABCHNGP EQU   PABCHAIN+1                                               01176000
PABRPHFG EQU   ISTPAB+12                                                01177000
PABFLAGS EQU   PABRPHFG                                                 01178000
PABAPYP  EQU   PABFLAGS                                                 01179000
PABERLCK EQU   PABFLAGS                                                 01180000
PABERRLK EQU   PABERLCK                                                 01181000
PABRPHA  EQU   PABRPHFG+1                                               01182000
PABEND   EQU   ISTPAB+16                                                01183000
ISTDYPAB EQU   0                                                        01184000
DYPCHAIN EQU   ISTDYPAB+4                                               01185000
DYPPACMD EQU   ISTDYPAB+12                                              01186000
DYPPAB   EQU   ISTDYPAB+16                                              01187000
ISTMPST  EQU   0                                                        01188000
MPSRSV07 EQU   ISTMPST+4                                                01189000
MPSRQFGA EQU   ISTMPST+8                                                01190000
MPSRQUE  EQU   MPSRQFGA                                                 01191000
MPSFLGA  EQU   MPSRQFGA+4                                               01192000
MPSFLGAA EQU   MPSFLGA                                                  01193000
MPSFLGAB EQU   MPSFLGA+1                                                01194000
MPSCRA   EQU   ISTMPST+24                                               01195000
MPSCRACT EQU   MPSCRA+4                                                 01196000
MPSSRB   EQU   ISTMPST+32                                               01197000
MPSSRBCT EQU   MPSSRB+4                                                 01198000
MPSCRPL  EQU   ISTMPST+40                                               01199000
MPSRPLCT EQU   MPSCRPL+4                                                01200000
ISTPST   EQU   0                                                        01201000
PSTRQFGA EQU   ISTPST+8                                                 01202000
PSTRQUE  EQU   PSTRQFGA                                                 01203000
PSTFLGA  EQU   PSTRQFGA+4                                               01204000
PSTUERN  EQU   PSTFLGA                                                  01205000
PSTABINP EQU   PSTFLGA                                                  01206000
PSTPSSQ  EQU   ISTPST+28                                                01207000
PSTNSSQ  EQU   ISTPST+32                                                01208000
PSTUEQ   EQU   ISTPST+36                                                01209000
PSTIQE11 EQU   ISTPST+40                                                01210000
PSTIQE21 EQU   ISTPST+48                                                01211000
PSTCRRS  EQU   ISTPST+60                                                01212000
PSTSMDYP EQU   ISTPST+64                                                01213000
PSTDMPS  EQU   ISTPST+132                                               01214000
ISTATCVT EQU   0                                                        01215000
ATCRPTCH EQU   ISTATCVT                                                 01216000
ATCITFLD EQU   ISTATCVT+8                                               01217000
ATCITCDS EQU   ATCITFLD+8                                               01218000
ATCITFLG EQU   ATCITCDS+4                                               01219000
ATCITRA1 EQU   ATCITFLG+2                                               01220000
ATCSMPAB EQU   ISTATCVT+88                                              01221000
ATCVDPAB EQU   ISTATCVT+152                                             01222000
ATCLDTIL EQU   ISTATCVT+408                                             01223000
ATCGTSTR EQU   ISTATCVT+608                                             01224000
ATCLUDVT EQU   ISTATCVT+768                                             01225000
ATCANYDT EQU   ISTATCVT+776                                             01226000
@NM00098 EQU   ISTATCVT+780                                             01227000
ATCPODVT EQU   ISTATCVT+804                                             01228000
ATCSTAT  EQU   ISTATCVT+936                                             01229000
ATCSTAT1 EQU   ATCSTAT                                                  01230000
ATCPOFLG EQU   ATCSTAT+2                                                01231000
ATCSTAT4 EQU   ATCSTAT+3                                                01232000
ATCBITAN EQU   ISTATCVT+940                                             01233000
ATCFLAG2 EQU   ATCBITAN+1                                               01234000
ATCONID  EQU   ISTATCVT+944                                             01235000
ATCSSCPA EQU   ISTATCVT+948                                             01236000
ATCHPGM  EQU   ISTATCVT+1012                                            01237000
ATCVLCNT EQU   ISTATCVT+1016                                            01238000
ATCRNO   EQU   ISTATCVT+1020                                            01239000
@NM00121 EQU   ISTATCVT+1028                                            01240000
ATCSHRFG EQU   @NM00121+8                                               01241000
ATCCPDVT EQU   ISTATCVT+1096                                            01242000
ATCSMSDQ EQU   ISTATCVT+1140                                            01243000
ATCRID   EQU   ISTATCVT+1152                                            01244000
ATCLDAPP EQU   ISTATCVT+1288                                            01245000
ATCSQAFR EQU   ISTATCVT+1312                                            01246000
ATCORTCB EQU   ATCSQAFR+4                                               01247000
ATCORSRB EQU   ATCORTCB                                                 01248000
ATCICAPP EQU   ISTATCVT+1320                                            01249000
ATCDAPVT EQU   ISTATCVT+1340                                            01250000
ATCAP54  EQU   ISTATCVT+1404                                            01251000
ATCAP57  EQU   ISTATCVT+1408                                            01252000
ATCAP58  EQU   ISTATCVT+1412                                            01253000
ATCAP61  EQU   ISTATCVT+1416                                            01254000
ATCGSRBQ EQU   ISTATCVT+1472                                            01255000
ATCGSRBG EQU   ATCGSRBQ                                                 01256000
ATCENFLG EQU   ISTATCVT+1512                                            01257000
@NM00136 EQU   ISTATCVT+1575                                            01258000
ATCVTFLG EQU   ISTATCVT+1576                                            01259000
ATCAP41  EQU   ISTATCVT+1628                                            01260000
ATCZFLAG EQU   ISTATCVT+1696                                            01261000
ATCCRA   EQU   ISTATCVT+1720                                            01262000
ATCCRACN EQU   ATCCRA+4                                                 01263000
ATCSRB   EQU   ISTATCVT+1728                                            01264000
ATCSRBCN EQU   ATCSRB+4                                                 01265000
ATCCRPL  EQU   ISTATCVT+1736                                            01266000
ATCRPLCN EQU   ATCCRPL+4                                                01267000
QUEUEA   EQU   0                                                        01268000
APC41    EQU   0                                                        01269000
APC54    EQU   0                                                        01270000
APC57    EQU   0                                                        01271000
APC58    EQU   0                                                        01272000
DUMPTR   EQU   0                                                        01273000
ASCBPTR  EQU   DUMPTR                                                   01274000
ASXBPTR  EQU   DUMPTR+4                                                 01275000
CVTPTR   EQU   DUMPTR+8                                                 01276000
IQEPTR   EQU   DUMPTR+12                                                01277000
RBSECPTR EQU   DUMPTR+16                                                01278000
SRBPTR   EQU   DUMPTR+20                                                01279000
TCBPTR   EQU   DUMPTR+24                                                01280000
IQEEND   EQU   0                                                        01281000
ISTXDYP  EQU   0                                                        01282000
ISTXPAB  EQU   0                                                        01283000
PSARSVTE EQU   PSARSVT                                                  01284000
RBSECS03 EQU   RBEP                                                     01285000
RBCDE    EQU   RBSECS03                                                 01286000
RBCDFLGS EQU   RBCDE                                                    01287000
RBSECS05 EQU   RBPGMQ                                                   01288000
RBSQE    EQU   RBSECS05                                                 01289000
RBSECS06 EQU   RBPGMQ                                                   01290000
RBIQE    EQU   RBSECS06                                                 01291000
RBSECS07 EQU   RBPGMQ                                                   01292000
RBIQE2   EQU   RBSECS07                                                 01293000
RBSECS08 EQU   IRBEND                                                   01294000
RBSECS09 EQU   IRBEND                                                   01295000
CVTS01   EQU   CVTPGSIA                                                 01296000
CVTLPDIA EQU   CVTS01+12                                                01297000
CVTDIRST EQU   CVTLPDIA                                                 01298000
CVTSLIDA EQU   CVTS01+24                                                01299000
CVTCTLFG EQU   CVTS01+50                                                01300000
CVTRV210 EQU   CVTS01+424                                               01301000
CVTRV219 EQU   CVTS01+425                                               01302000
CVTRV228 EQU   CVTS01+426                                               01303000
CVTRV237 EQU   CVTS01+427                                               01304000
CVTMFRTR EQU   CVTS01+452                                               01305000
CVTRV262 EQU   CVTS01+468                                               01306000
CVTRV271 EQU   CVTS01+469                                               01307000
CVTRV280 EQU   CVTS01+470                                               01308000
CVTRV289 EQU   CVTS01+471                                               01309000
CVTGSDA  EQU   CVTS01+600                                               01310000
@NM00087 EQU   CRAPROCR                                                 01311000
PABXTNSN EQU   PABEND                                                   01312000
ZLIST    EQU   ESTST                                                    01313000
QUEUES   EQU   PSTPSSQ                                                  01314000
CRACFCRR EQU   CRAPROCR                                                 01315000
FLC      EQU   PSA                                                      01316000
SRB      EQU   SRBSECT                                                  01317000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01318000
@NM00092 EQU   PABXTNSN+12                                              01319000
PABNPSSQ EQU   PABXTNSN+8                                               01320000
PABLOCK  EQU   PABXTNSN+4                                               01321000
PABLAST  EQU   PABXTNSN                                                 01322000
CRACRRSA EQU   @NM00087+12                                              01323000
@NM00088 EQU   @NM00087                                                 01324000
CVTRV628 EQU   CVTS01+728                                               01325000
CVTRV627 EQU   CVTS01+724                                               01326000
CVTRV626 EQU   CVTS01+720                                               01327000
CVTRV625 EQU   CVTS01+716                                               01328000
CVTRV624 EQU   CVTS01+712                                               01329000
CVTRV623 EQU   CVTS01+708                                               01330000
CVTRV622 EQU   CVTS01+704                                               01331000
CVTRV621 EQU   CVTS01+700                                               01332000
CVTIHASU EQU   CVTS01+696                                               01333000
CVTSUSP  EQU   CVTS01+692                                               01334000
CVTT6SVC EQU   CVTS01+688                                               01335000
CVTCDAL  EQU   CVTS01+684                                               01336000
CVTTCTL  EQU   CVTS01+680                                               01337000
CVTRSUME EQU   CVTS01+676                                               01338000
CVTJTERM EQU   CVTS01+672                                               01339000
CVTASMRM EQU   CVTS01+668                                               01340000
CVTTCASP EQU   CVTS01+664                                               01341000
CVT0PT03 EQU   CVTS01+660                                               01342000
CVT0PT0E EQU   CVTS01+656                                               01343000
CVTRV609 EQU   CVTS01+652                                               01344000
CVTCGK   EQU   CVTS01+648                                               01345000
CVTRAC   EQU   CVTS01+644                                               01346000
CVTRV606 EQU   CVTS01+640                                               01347000
CVTRV605 EQU   CVTS01+636                                               01348000
CVTRV604 EQU   CVTS01+632                                               01349000
CVTEFF02 EQU   CVTS01+628                                               01350000
CVTCBBR  EQU   CVTS01+624                                               01351000
CVTSSCR  EQU   CVTS01+620                                               01352000
CVTEVENT EQU   CVTS01+616                                               01353000
CVTCRCA  EQU   CVTS01+612                                               01354000
CVTTPIO  EQU   CVTS01+608                                               01355000
CVTADV   EQU   CVTS01+604                                               01356000
CVTGSDAB EQU   CVTGSDA                                                  01357000
CVTQV3   EQU   CVTS01+596                                               01358000
CVTQV2   EQU   CVTS01+592                                               01359000
CVTQV1   EQU   CVTS01+588                                               01360000
CVTRPT   EQU   CVTS01+584                                               01361000
CVTSSRB  EQU   CVTS01+580                                               01362000
CVTCSDRL EQU   CVTS01+576                                               01363000
CVTEXP1  EQU   CVTS01+572                                               01364000
CVTRMPMT EQU   CVTS01+568                                               01365000
CVTRMPTT EQU   CVTS01+564                                               01366000
CVTVPSA  EQU   CVTS01+560                                               01367000
CVTVSTOP EQU   CVTS01+556                                               01368000
CVTGTFR8 EQU   CVTS01+552                                               01369000
CVTQUIT  EQU   CVTS01+548                                               01370000
CVTVACR  EQU   CVTS01+544                                               01371000
CVTWTCB  EQU   CVTS01+540                                               01372000
CVTSTPRS EQU   CVTS01+536                                               01373000
CVT0PT02 EQU   CVTS01+532                                               01374000
CVTDARCM EQU   CVTS01+528                                               01375000
CVTIRECM EQU   CVTS01+524                                               01376000
CVTJRECM EQU   CVTS01+520                                               01377000
CVTVEMS0 EQU   CVTS01+516                                               01378000
CVTSPFRR EQU   CVTS01+512                                               01379000
CVTRLSTG EQU   CVTS01+508                                               01380000
CVT0TC0A EQU   CVTS01+504                                               01381000
CVTGMBR  EQU   CVTS01+500                                               01382000
CVTLFRM  EQU   CVTS01+496                                               01383000
CVTRMBR  EQU   CVTS01+492                                               01384000
CVTVIOP  EQU   CVTS01+488                                               01385000
CVTRV307 EQU   CVTS01+486                                               01386000
CVTRV306 EQU   CVTS01+484                                               01387000
CVTRV305 EQU   CVTS01+482                                               01388000
CVTRV304 EQU   CVTS01+480                                               01389000
CVTRV303 EQU   CVTS01+478                                               01390000
CVTRV302 EQU   CVTS01+476                                               01391000
CVTTRCA  EQU   CVTS01+472                                               01392000
CVTRV297 EQU   CVTRV289                                                 01393000
CVTRV296 EQU   CVTRV289                                                 01394000
CVTRV295 EQU   CVTRV289                                                 01395000
CVTRV294 EQU   CVTRV289                                                 01396000
CVTRV293 EQU   CVTRV289                                                 01397000
CVTRV292 EQU   CVTRV289                                                 01398000
CVTRV291 EQU   CVTRV289                                                 01399000
CVTRV290 EQU   CVTRV289                                                 01400000
CVTRV288 EQU   CVTRV280                                                 01401000
CVTRV287 EQU   CVTRV280                                                 01402000
CVTRV286 EQU   CVTRV280                                                 01403000
CVTRV285 EQU   CVTRV280                                                 01404000
CVTRV284 EQU   CVTRV280                                                 01405000
CVTRV283 EQU   CVTRV280                                                 01406000
CVTRV282 EQU   CVTRV280                                                 01407000
CVTRV281 EQU   CVTRV280                                                 01408000
CVTRV279 EQU   CVTRV271                                                 01409000
CVTRV278 EQU   CVTRV271                                                 01410000
CVTRV277 EQU   CVTRV271                                                 01411000
CVTRV276 EQU   CVTRV271                                                 01412000
CVTRV275 EQU   CVTRV271                                                 01413000
CVTRV274 EQU   CVTRV271                                                 01414000
CVTRV273 EQU   CVTRV271                                                 01415000
CVTRV272 EQU   CVTRV271                                                 01416000
CVTRV270 EQU   CVTRV262                                                 01417000
CVTRV269 EQU   CVTRV262                                                 01418000
CVTRV268 EQU   CVTRV262                                                 01419000
CVTRV267 EQU   CVTRV262                                                 01420000
CVTRV266 EQU   CVTRV262                                                 01421000
CVTRV265 EQU   CVTRV262                                                 01422000
CVTRV264 EQU   CVTRV262                                                 01423000
CVTRV263 EQU   CVTRV262                                                 01424000
CVTVFP   EQU   CVTS01+464                                               01425000
CVTVSI   EQU   CVTS01+460                                               01426000
CVTVPSIB EQU   CVTS01+456                                               01427000
CVTMFACT EQU   CVTMFRTR                                                 01428000
CVTMFCTL EQU   CVTS01+448                                               01429000
CVTPVBP  EQU   CVTS01+444                                               01430000
CVTPWI   EQU   CVTS01+440                                               01431000
CVTRV254 EQU   CVTS01+438                                               01432000
CVTRV253 EQU   CVTS01+436                                               01433000
CVTRV252 EQU   CVTS01+434                                               01434000
CVTRV251 EQU   CVTS01+433                                               01435000
CVTRV250 EQU   CVTS01+432                                               01436000
CVTRV249 EQU   CVTS01+431                                               01437000
CVTRV248 EQU   CVTS01+430                                               01438000
CVTRV247 EQU   CVTS01+429                                               01439000
CVTRV246 EQU   CVTS01+428                                               01440000
CVTRV245 EQU   CVTRV237                                                 01441000
CVTRV244 EQU   CVTRV237                                                 01442000
CVTRV243 EQU   CVTRV237                                                 01443000
CVTRV242 EQU   CVTRV237                                                 01444000
CVTRV241 EQU   CVTRV237                                                 01445000
CVTRV240 EQU   CVTRV237                                                 01446000
CVTRV239 EQU   CVTRV237                                                 01447000
CVTRV238 EQU   CVTRV237                                                 01448000
CVTRV236 EQU   CVTRV228                                                 01449000
CVTRV235 EQU   CVTRV228                                                 01450000
CVTRV234 EQU   CVTRV228                                                 01451000
CVTRV233 EQU   CVTRV228                                                 01452000
CVTRV232 EQU   CVTRV228                                                 01453000
CVTRV231 EQU   CVTRV228                                                 01454000
CVTRV230 EQU   CVTRV228                                                 01455000
CVTRV229 EQU   CVTRV228                                                 01456000
CVTRV227 EQU   CVTRV219                                                 01457000
CVTRV226 EQU   CVTRV219                                                 01458000
CVTRV225 EQU   CVTRV219                                                 01459000
CVTRV224 EQU   CVTRV219                                                 01460000
CVTRV223 EQU   CVTRV219                                                 01461000
CVTRV222 EQU   CVTRV219                                                 01462000
CVTRV221 EQU   CVTRV219                                                 01463000
CVTRV220 EQU   CVTRV219                                                 01464000
CVTRV218 EQU   CVTRV210                                                 01465000
CVTRV217 EQU   CVTRV210                                                 01466000
CVTRV216 EQU   CVTRV210                                                 01467000
CVTRV215 EQU   CVTRV210                                                 01468000
CVTRV214 EQU   CVTRV210                                                 01469000
CVTRV213 EQU   CVTRV210                                                 01470000
CVTRV212 EQU   CVTRV210                                                 01471000
CVTRV211 EQU   CVTRV210                                                 01472000
CVTLCCAT EQU   CVTS01+420                                               01473000
CVTPCCAT EQU   CVTS01+416                                               01474000
CVTIPCRP EQU   CVTS01+412                                               01475000
CVTIPCRI EQU   CVTS01+408                                               01476000
CVTIPCDS EQU   CVTS01+404                                               01477000
CVTAIDVT EQU   CVTS01+400                                               01478000
CVTSSAP  EQU   CVTS01+396                                               01479000
CVTEHCIR EQU   CVTS01+392                                               01480000
CVTEHDEF EQU   CVTS01+388                                               01481000
CVTDAIR  EQU   CVTS01+384                                               01482000
CVTPERFM EQU   CVTS01+380                                               01483000
CVT044R2 EQU   CVTS01+376                                               01484000
CVTFETCH EQU   CVTS01+372                                               01485000
CVTRSTWD EQU   CVTS01+368                                               01486000
CVTSPOST EQU   CVTS01+364                                               01487000
CVTIOBP  EQU   CVTS01+360                                               01488000
CVTASMVT EQU   CVTS01+356                                               01489000
CVTRECRQ EQU   CVTS01+352                                               01490000
CVTWSAC  EQU   CVTS01+348                                               01491000
CVTRV149 EQU   CVTS01+344                                               01492000
CVTWSAL  EQU   CVTS01+340                                               01493000
CVTSPSA  EQU   CVTS01+336                                               01494000
CVTGLMN  EQU   CVTS01+332                                               01495000
CVTVEAC0 EQU   CVTS01+328                                               01496000
CVT062R1 EQU   CVTS01+324                                               01497000
CVTRPOST EQU   CVTS01+320                                               01498000
CVTDQIQE EQU   CVTS01+316                                               01499000
CVTCSD   EQU   CVTS01+312                                               01500000
CVTLKRMA EQU   CVTS01+308                                               01501000
CVTRSPIE EQU   CVTS01+304                                               01502000
CVTRENQ  EQU   CVTS01+300                                               01503000
CVTLQCB  EQU   CVTS01+296                                               01504000
CVTFQCB  EQU   CVTS01+292                                               01505000
CVTQCS01 EQU   CVTS01+288                                               01506000
CVTAPFT  EQU   CVTS01+284                                               01507000
CVTPARRL EQU   CVTS01+280                                               01508000
CVTVWAIT EQU   CVTS01+276                                               01509000
CVTGSPL  EQU   CVTS01+272                                               01510000
CVTLSMQ  EQU   CVTS01+268                                               01511000
CVTGSMQ  EQU   CVTS01+264                                               01512000
CVTEXPRO EQU   CVTS01+260                                               01513000
CVTOPCTP EQU   CVTS01+256                                               01514000
CVTSIC   EQU   CVTS01+252                                               01515000
CVTTPIOS EQU   CVTS01+248                                               01516000
CVTRTMS  EQU   CVTS01+244                                               01517000
CVTSDBF  EQU   CVTS01+240                                               01518000
CVTSCBP  EQU   CVTS01+236                                               01519000
CVTSDMP  EQU   CVTS01+232                                               01520000
CVTSV60  EQU   CVTS01+228                                               01521000
CVTRTMCT EQU   CVTS01+224                                               01522000
CVTASCBL EQU   CVTS01+220                                               01523000
CVTASCBH EQU   CVTS01+216                                               01524000
CVTGDA   EQU   CVTS01+212                                               01525000
CVTASVT  EQU   CVTS01+208                                               01526000
CVTVVMDI EQU   CVTS01+204                                               01527000
CVTAQTOP EQU   CVTS01+200                                               01528000
CVTIOSCS EQU   CVTS01+196                                               01529000
CVTSDRM  EQU   CVTS01+192                                               01530000
CVTOPTE  EQU   CVTS01+188                                               01531000
CVTSTXU  EQU   CVTS01+184                                               01532000
CVTQUIS  EQU   CVTS01+180                                               01533000
CVTPARS  EQU   CVTS01+176                                               01534000
CVTS1EE  EQU   CVTS01+172                                               01535000
CVTFRAS  EQU   CVTS01+168                                               01536000
CVTQSAS  EQU   CVTS01+164                                               01537000
CVTCRAS  EQU   CVTS01+160                                               01538000
CVTCRMN  EQU   CVTS01+156                                               01539000
CVTDELCP EQU   CVTS01+152                                               01540000
CVTFRECL EQU   CVTS01+148                                               01541000
CVTGETCL EQU   CVTS01+144                                               01542000
CVTBLDCP EQU   CVTS01+140                                               01543000
CVTAUTHL EQU   CVTS01+136                                               01544000
CVTSCAN  EQU   CVTS01+132                                               01545000
CVTRV144 EQU   CVTS01+130                                               01546000
CVTMAXMP EQU   CVTS01+128                                               01547000
CVTSTCK  EQU   CVTS01+124                                               01548000
CVTRV139 EQU   CVTS01+123                                               01549000
CVTDSSAC EQU   CVTS01+122                                               01550000
CVTRV513 EQU   CVTS01+121                                               01551000
CVTIOSPL EQU   CVTS01+120                                               01552000
CVTPTGT  EQU   CVTS01+116                                               01553000
CVTCSPIE EQU   CVTS01+112                                               01554000
CVTSMFEX EQU   CVTS01+108                                               01555000
CVTOLT0A EQU   CVTS01+104                                               01556000
CVTSRBRT EQU   CVTS01+100                                               01557000
CVTPUTL  EQU   CVTS01+96                                                01558000
CVTASCRL EQU   CVTS01+92                                                01559000
CVTASCRF EQU   CVTS01+88                                                01560000
CVTRV326 EQU   CVTS01+84                                                01561000
CVTRV325 EQU   CVTS01+80                                                01562000
CVTRV324 EQU   CVTS01+76                                                01563000
CVT0VL01 EQU   CVTS01+72                                                01564000
CVTSHRVM EQU   CVTS01+68                                                01565000
CVTRV332 EQU   CVTS01+64                                                01566000
CVTTAS   EQU   CVTS01+60                                                01567000
CVTRSCN  EQU   CVTS01+56                                                01568000
CVTTRAC2 EQU   CVTS01+54                                                01569000
CVTTRACE EQU   CVTS01+52                                                01570000
CVTAPG   EQU   CVTS01+51                                                01571000
CVTSDTRC EQU   CVTCTLFG                                                 01572000
CVTGTRCE EQU   CVTCTLFG                                                 01573000
CVTNOMP  EQU   CVTCTLFG                                                 01574000
CVTRSV79 EQU   CVTCTLFG                                                 01575000
CVTDSTAT EQU   CVTCTLFG                                                 01576000
CVTRSV78 EQU   CVTCTLFG                                                 01577000
CVTRV333 EQU   CVTCTLFG                                                 01578000
CVTRV323 EQU   CVTCTLFG                                                 01579000
CVTSPVLK EQU   CVTS01+49                                                01580000
CVTRSV77 EQU   CVTS01+48                                                01581000
CVTRV331 EQU   CVTS01+44                                                01582000
CVTRV330 EQU   CVTS01+40                                                01583000
CVTRV329 EQU   CVTS01+36                                                01584000
CVTRV328 EQU   CVTS01+32                                                01585000
CVTRV322 EQU   CVTS01+28                                                01586000
CVTSLID  EQU   CVTSLIDA+1                                               01587000
CVTSYLK  EQU   CVTSLIDA                                                 01588000
CVTRV321 EQU   CVTS01+20                                                01589000
CVTRV320 EQU   CVTS01+16                                                01590000
CVTLPDIR EQU   CVTLPDIA+1                                               01591000
CVTRSV69 EQU   CVTDIRST                                                 01592000
CVTRSV68 EQU   CVTDIRST                                                 01593000
CVTRSV67 EQU   CVTDIRST                                                 01594000
CVTRSV66 EQU   CVTDIRST                                                 01595000
CVTRSV65 EQU   CVTDIRST                                                 01596000
CVTRSV64 EQU   CVTDIRST                                                 01597000
CVTRSV63 EQU   CVTDIRST                                                 01598000
CVTDICOM EQU   CVTDIRST                                                 01599000
CVTPVTP  EQU   CVTS01+8                                                 01600000
CVTLPDSR EQU   CVTS01+4                                                 01601000
CVTGETL  EQU   CVTS01                                                   01602000
RBRSV161 EQU   RBSECS09+64                                              01603000
RBSIRBWA EQU   RBSECS09                                                 01604000
RBIQEWRK EQU   RBSECS08+4                                               01605000
RBNEXAV  EQU   RBSECS08                                                 01606000
RBIQEA   EQU   RBIQE2                                                   01607000
RBIQE1   EQU   RBIQE+1                                                  01608000
RBUSE    EQU   RBIQE                                                    01609000
RBSQEA   EQU   RBSQE+1                                                  01610000
@NM00051 EQU   RBSQE                                                    01611000
RBCDE1   EQU   RBCDE+1                                                  01612000
RBCDLOAD EQU   RBCDFLGS                                                 01613000
RBCDXCTL EQU   RBCDFLGS                                                 01614000
RBCDSYNC EQU   RBCDFLGS                                                 01615000
RBCDNODE EQU   RBCDFLGS                                                 01616000
RBRSV010 EQU   RBCDFLGS                                                 01617000
RBCDATCH EQU   RBCDFLGS                                                 01618000
RBRSV009 EQU   RBCDFLGS                                                 01619000
RBNOCELL EQU   RBCDFLGS                                                 01620000
PSARSAV  EQU   PSARSVTE+60                                              01621000
PSARSTK  EQU   PSARSVTE+56                                              01622000
PSAESAV3 EQU   PSARSVTE+52                                              01623000
PSAESTK3 EQU   PSARSVTE+48                                              01624000
PSAESAV2 EQU   PSARSVTE+44                                              01625000
PSAESTK2 EQU   PSARSVTE+40                                              01626000
PSAESAV1 EQU   PSARSVTE+36                                              01627000
PSAESTK1 EQU   PSARSVTE+32                                              01628000
PSAPSAV  EQU   PSARSVTE+28                                              01629000
PSAPSTK  EQU   PSARSVTE+24                                              01630000
PSAMSAV  EQU   PSARSVTE+20                                              01631000
PSAMSTK  EQU   PSARSVTE+16                                              01632000
PSASSAV  EQU   PSARSVTE+12                                              01633000
PSASSTK  EQU   PSARSVTE+8                                               01634000
PSANSTK  EQU   PSARSVTE+4                                               01635000
PSACSTK  EQU   PSARSVTE                                                 01636000
ATCAOS   EQU   ISTATCVT+1868                                            01637000
@NM00145 EQU   ISTATCVT+1860                                            01638000
@NM00144 EQU   ISTATCVT+1852                                            01639000
@NM00143 EQU   ISTATCVT+1844                                            01640000
@NM00142 EQU   ISTATCVT+1836                                            01641000
@NM00141 EQU   ISTATCVT+1828                                            01642000
@NM00140 EQU   ISTATCVT+1820                                            01643000
ATCHWCSA EQU   ISTATCVT+1816                                            01644000
ATCCACSA EQU   ISTATCVT+1812                                            01645000
ATCMXCSA EQU   ISTATCVT+1808                                            01646000
ATCTPMPB EQU   ISTATCVT+1776                                            01647000
ATCTRMPB EQU   ISTATCVT+1744                                            01648000
ATCRPLAC EQU   ATCRPLCN+2                                               01649000
ATCRPLRC EQU   ATCRPLCN                                                 01650000
ATCCRPLQ EQU   ATCCRPL                                                  01651000
ATCSRBAC EQU   ATCSRBCN+2                                               01652000
ATCSRBRC EQU   ATCSRBCN                                                 01653000
ATCSRBQ  EQU   ATCSRB                                                   01654000
ATCCRAAC EQU   ATCCRACN+2                                               01655000
ATCCRARC EQU   ATCCRACN                                                 01656000
ATCCRAQ  EQU   ATCCRA                                                   01657000
ATCLUFFD EQU   ISTATCVT+1716                                            01658000
ATCVIOPM EQU   ISTATCVT+1712                                            01659000
ATCTPMMI EQU   ISTATCVT+1708                                            01660000
ATCPXSRB EQU   ISTATCVT+1704                                            01661000
ATCRPLCT EQU   ISTATCVT+1702                                            01662000
ATCCRACT EQU   ISTATCVT+1700                                            01663000
ATCSRBCT EQU   ISTATCVT+1698                                            01664000
ATCSTNSM EQU   ISTATCVT+1697                                            01665000
@NM00139 EQU   ATCZFLAG                                                 01666000
ATCZF001 EQU   ATCZFLAG                                                 01667000
ATCTPCP1 EQU   ISTATCVT+1692                                            01668000
ATCTPCP0 EQU   ISTATCVT+1688                                            01669000
ATCZR01  EQU   ISTATCVT+1684                                            01670000
ATCMPLTA EQU   ISTATCVT+1680                                            01671000
ATCASCB  EQU   ISTATCVT+1676                                            01672000
ATCAP86  EQU   ISTATCVT+1672                                            01673000
ATCAP85  EQU   ISTATCVT+1668                                            01674000
ATCAP84  EQU   ISTATCVT+1664                                            01675000
ATCAP83  EQU   ISTATCVT+1660                                            01676000
ATCAP82  EQU   ISTATCVT+1656                                            01677000
ATCAP69  EQU   ISTATCVT+1652                                            01678000
ATCAP66  EQU   ISTATCVT+1648                                            01679000
ATCAP62  EQU   ISTATCVT+1644                                            01680000
ATCAPC59 EQU   ISTATCVT+1640                                            01681000
ATCAP56  EQU   ISTATCVT+1636                                            01682000
ATCAP55  EQU   ISTATCVT+1632                                            01683000
ATCAPC25 EQU   ISTATCVT+1624                                            01684000
ATCAP23  EQU   ISTATCVT+1620                                            01685000
ATCAPBE  EQU   ISTATCVT+1616                                            01686000
ATCPSTA  EQU   ISTATCVT+1612                                            01687000
ATCSMABF EQU   ISTATCVT+1608                                            01688000
ATCSMAPR EQU   ISTATCVT+1604                                            01689000
ATCTPWQA EQU   ISTATCVT+1600                                            01690000
ATCSMAID EQU   ISTATCVT+1596                                            01691000
ATCSMARA EQU   ISTATCVT+1592                                            01692000
ATCCACXA EQU   ISTATCVT+1588                                            01693000
ATCATA10 EQU   ISTATCVT+1584                                            01694000
ATCHLTCB EQU   ISTATCVT+1580                                            01695000
@NM00138 EQU   ATCVTFLG                                                 01696000
ATCVTACT EQU   ATCVTFLG                                                 01697000
@NM00137 EQU   @NM00136                                                 01698000
ATCVTMAB EQU   @NM00136                                                 01699000
ATCVTBAM EQU   ISTATCVT+1572                                            01700000
@NM00135 EQU   ISTATCVT+1568                                            01701000
@NM00134 EQU   ISTATCVT+1520                                            01702000
ATCCCOOC EQU   ISTATCVT+1516                                            01703000
@NM00133 EQU   ISTATCVT+1513                                            01704000
ATCSNUF  EQU   ATCENFLG                                                 01705000
ATCOPKL  EQU   ATCENFLG                                                 01706000
ATCABEN  EQU   ATCENFLG                                                 01707000
ATCSRDN  EQU   ATCENFLG                                                 01708000
ATCDLDN  EQU   ATCENFLG                                                 01709000
ATCTIMER EQU   ISTATCVT+1508                                            01710000
ATCAIWT  EQU   ISTATCVT+1504                                            01711000
ATCOROBT EQU   ISTATCVT+1500                                            01712000
ATCDMAPP EQU   ISTATCVT+1496                                            01713000
ATCZDVTX EQU   ISTATCVT+1492                                            01714000
ATCPXCRA EQU   ISTATCVT+1488                                            01715000
ATCICNCB EQU   ISTATCVT+1484                                            01716000
ATCCMTCB EQU   ISTATCVT+1480                                            01717000
ATCPRPH  EQU   ISTATCVT+1476                                            01718000
ATCGSRBF EQU   ATCGSRBG                                                 01719000
ATCSRBRT EQU   ISTATCVT+1468                                            01720000
ATCTSCPC EQU   ISTATCVT+1464                                            01721000
@NM00132 EQU   ISTATCVT+1460                                            01722000
ATCCDTCB EQU   ISTATCVT+1456                                            01723000
ATCORFRL EQU   ISTATCVT+1452                                            01724000
ATCORFPX EQU   ISTATCVT+1448                                            01725000
ATCORFMG EQU   ISTATCVT+1444                                            01726000
ATCSMBQ  EQU   ISTATCVT+1440                                            01727000
ATCINFDD EQU   ISTATCVT+1436                                            01728000
ATCAP67  EQU   ISTATCVT+1432                                            01729000
ATCAP65  EQU   ISTATCVT+1428                                            01730000
ATCAP64  EQU   ISTATCVT+1424                                            01731000
ATCAP63  EQU   ISTATCVT+1420                                            01732000
ATCAP53  EQU   ISTATCVT+1400                                            01733000
ATCAP52  EQU   ISTATCVT+1396                                            01734000
ATCAP51  EQU   ISTATCVT+1392                                            01735000
ATCAP38  EQU   ISTATCVT+1388                                            01736000
ATCAP37  EQU   ISTATCVT+1384                                            01737000
ATCAP34  EQU   ISTATCVT+1380                                            01738000
ATCAP32  EQU   ISTATCVT+1376                                            01739000
ATCAP31  EQU   ISTATCVT+1372                                            01740000
ATCAP12  EQU   ISTATCVT+1368                                            01741000
ATCAP11  EQU   ISTATCVT+1364                                            01742000
ATCDAPDG EQU   ATCDAPVT+20                                              01743000
ATCDXCEA EQU   ATCDAPVT+16                                              01744000
ATCDCEA  EQU   ATCDAPVT+12                                              01745000
ATCDPCIA EQU   ATCDAPVT+8                                               01746000
ATCDSIOA EQU   ATCDAPVT+4                                               01747000
ATCDEOEA EQU   ATCDAPVT                                                 01748000
ATCZAEA  EQU   ATCICAPP+16                                              01749000
ATCZCEA  EQU   ATCICAPP+12                                              01750000
ATCZCPCI EQU   ATCICAPP+8                                               01751000
ATCZSIOA EQU   ATCICAPP+4                                               01752000
ATCCDRPH EQU   ATCICAPP                                                 01753000
ATCORQG  EQU   ATCORSRB                                                 01754000
ATCORTBF EQU   ATCSQAFR                                                 01755000
@NM00131 EQU   ISTATCVT+1308                                            01756000
ATCZLAEA EQU   ATCLDAPP+16                                              01757000
ATCZLCEA EQU   ATCLDAPP+12                                              01758000
ATCZLPCI EQU   ATCLDAPP+8                                               01759000
ATCSMFRR EQU   ATCLDAPP+4                                               01760000
ATCCDTID EQU   ATCLDAPP                                                 01761000
@NM00130 EQU   ISTATCVT+1256                                            01762000
ATCZPAB2 EQU   ISTATCVT+1224                                            01763000
@NM00129 EQU   ISTATCVT+1224                                            01764000
@NM00128 EQU   ISTATCVT+1164                                            01765000
ATCCPCFE EQU   ISTATCVT+1160                                            01766000
@NM00127 EQU   ATCRID+2                                                 01767000
ATCCDRMA EQU   ATCRID                                                   01768000
@NM00126 EQU   ATCSMSDQ+8                                               01769000
@NM00125 EQU   ATCSMSDQ+4                                               01770000
@NM00124 EQU   ATCSMSDQ                                                 01771000
ATCSEQNO EQU   ISTATCVT+1136                                            01772000
ATCSMPMD EQU   ISTATCVT+1132                                            01773000
ATCPAREA EQU   ISTATCVT+1128                                            01774000
ATCCPCSM EQU   ISTATCVT+1124                                            01775000
ATCQLOCK EQU   ISTATCVT+1120                                            01776000
ATCITQLE EQU   ISTATCVT+1116                                            01777000
ATCSQCDS EQU   ISTATCVT+1112                                            01778000
ATCUSSVT EQU   ISTATCVT+1108                                            01779000
ATCNOSQ  EQU   ISTATCVT+1104                                            01780000
ATCINCIP EQU   ATCCPDVT+4                                               01781000
ATCTSCNI EQU   ATCCPDVT                                                 01782000
ATCMGCRT EQU   ISTATCVT+1092                                            01783000
ATCMACRT EQU   ISTATCVT+1088                                            01784000
ATCCSMT  EQU   ISTATCVT+1084                                            01785000
ATCDRUSL EQU   ISTATCVT+1080                                            01786000
ATCDRULL EQU   ISTATCVT+1076                                            01787000
ATCCFCDR EQU   ISTATCVT+1072                                            01788000
@NM00123 EQU   ISTATCVT+1069                                            01789000
ATCMROUT EQU   ISTATCVT+1060                                            01790000
ATCONFIG EQU   ISTATCVT+1052                                            01791000
ATCNODEL EQU   ISTATCVT+1044                                            01792000
@NM00122 EQU   @NM00121+9                                               01793000
ATCLAST  EQU   ATCSHRFG                                                 01794000
ATCSHRTN EQU   @NM00121                                                 01795000
@NM00120 EQU   ISTATCVT+1026                                            01796000
ATCNMCTR EQU   ISTATCVT+1024                                            01797000
ATCPOIA  EQU   ATCRNO+1                                                 01798000
@NM00119 EQU   ATCRNO                                                   01799000
ATCLCLCT EQU   ATCVLCNT+2                                               01800000
ATCRNCNT EQU   ATCVLCNT                                                 01801000
ATCHBSIZ EQU   ATCHPGM+2                                                01802000
ATCHBFNO EQU   ATCHPGM                                                  01803000
@NM00118 EQU   ISTATCVT+1011                                            01804000
ATCXRANG EQU   ISTATCVT+1010                                            01805000
ATCMAXID EQU   ISTATCVT+1009                                            01806000
ATCMSGSP EQU   ISTATCVT+1008                                            01807000
ATCCIDM  EQU   ISTATCVT+1006                                            01808000
ATCACTRM EQU   ISTATCVT+1004                                            01809000
ATCECTLP EQU   ISTATCVT+1000                                            01810000
ATCECNET EQU   ISTATCVT+996                                             01811000
ATCECOPC EQU   ISTATCVT+992                                             01812000
ATCECSES EQU   ISTATCVT+988                                             01813000
ATCECDSP EQU   ISTATCVT+984                                             01814000
ATCECVRY EQU   ISTATCVT+980                                             01815000
ATCECHLT EQU   ISTATCVT+976                                             01816000
ATCECMOD EQU   ISTATCVT+972                                             01817000
ATCVDLOK EQU   ISTATCVT+968                                             01818000
ATCRDTLK EQU   ISTATCVT+964                                             01819000
ATCVOCLK EQU   ISTATCVT+960                                             01820000
ATCITLIM EQU   ISTATCVT+958                                             01821000
ATCTMINV EQU   ISTATCVT+956                                             01822000
ATCHOSTA EQU   ISTATCVT+954                                             01823000
ATCPUNSA EQU   ISTATCVT+952                                             01824000
ATCSAF   EQU   ISTATCVT+950                                             01825000
ATCVTMID EQU   ATCSSCPA                                                 01826000
ATCHCNID EQU   ATCONID+2                                                01827000
ATCSCNID EQU   ATCONID                                                  01828000
@NM00117 EQU   ATCBITAN+3                                               01829000
@NM00116 EQU   ATCBITAN+2                                               01830000
@NM00115 EQU   ATCFLAG2                                                 01831000
@NM00114 EQU   ATCFLAG2                                                 01832000
@NM00113 EQU   ATCFLAG2                                                 01833000
ATCCRYPF EQU   ATCFLAG2                                                 01834000
ATCTUNCL EQU   ATCFLAG2                                                 01835000
ATCTUNRQ EQU   ATCFLAG2                                                 01836000
ATCTUNAC EQU   ATCFLAG2                                                 01837000
ATCCDLRA EQU   ATCFLAG2                                                 01838000
@NM00112 EQU   ATCBITAN                                                 01839000
@NM00111 EQU   ATCSTAT4                                                 01840000
@NM00110 EQU   ATCSTAT4                                                 01841000
@NM00109 EQU   ATCSTAT4                                                 01842000
@NM00108 EQU   ATCSTAT4                                                 01843000
@NM00107 EQU   ATCSTAT4                                                 01844000
ATCPRTAT EQU   ATCSTAT4                                                 01845000
ATCNCSD  EQU   ATCSTAT4                                                 01846000
ATCMTST  EQU   ATCSTAT4                                                 01847000
@NM00106 EQU   ATCPOFLG                                                 01848000
@NM00105 EQU   ATCPOFLG                                                 01849000
@NM00104 EQU   ATCPOFLG                                                 01850000
@NM00103 EQU   ATCPOFLG                                                 01851000
@NM00102 EQU   ATCPOFLG                                                 01852000
@NM00101 EQU   ATCPOFLG                                                 01853000
@NM00100 EQU   ATCPOFLG                                                 01854000
ATCPOUNS EQU   ATCPOFLG                                                 01855000
@NM00099 EQU   ATCSTAT+1                                                01856000
ATCHIP   EQU   ATCSTAT1                                                 01857000
ATCMDHLT EQU   ATCSTAT1                                                 01858000
ATCINHLT EQU   ATCSTAT1                                                 01859000
ATCNETSL EQU   ATCSTAT1                                                 01860000
ATCQKHLT EQU   ATCSTAT1                                                 01861000
ATCSNHLT EQU   ATCSTAT1                                                 01862000
ATCACTIV EQU   ATCSTAT1                                                 01863000
ATCSTART EQU   ATCSTAT1                                                 01864000
ATCNOP00 EQU   ISTATCVT+932                                             01865000
ATCTSBUF EQU   ISTATCVT+928                                             01866000
ATCFEPT  EQU   ISTATCVT+924                                             01867000
ATCFDVT  EQU   ISTATCVT+920                                             01868000
ATCCONFT EQU   ISTATCVT+916                                             01869000
ATCRDTH  EQU   ISTATCVT+912                                             01870000
ATCSIBQ  EQU   ISTATCVT+908                                             01871000
ATCHLTMS EQU   ISTATCVT+904                                             01872000
ATCECPRM EQU   ISTATCVT+900                                             01873000
ATCVPARM EQU   ISTATCVT+896                                             01874000
ATCOCHA  EQU   ISTATCVT+892                                             01875000
ATCDSPLQ EQU   ISTATCVT+888                                             01876000
ATCVARYQ EQU   ISTATCVT+884                                             01877000
ATCHALTQ EQU   ISTATCVT+880                                             01878000
ATCMODQ  EQU   ISTATCVT+876                                             01879000
ATCSRT   EQU   ISTATCVT+872                                             01880000
ATCRDT   EQU   ISTATCVT+868                                             01881000
ATCSDVT  EQU   ISTATCVT+864                                             01882000
ATCDLRPT EQU   ISTATCVT+860                                             01883000
ATCBPDA  EQU   ISTATCVT+856                                             01884000
ATCACDA  EQU   ISTATCVT+852                                             01885000
ATCMNT   EQU   ISTATCVT+848                                             01886000
ATCUEP   EQU   ISTATCVT+844                                             01887000
ATCNODDS EQU   ISTATCVT+840                                             01888000
ATCITRT  EQU   ISTATCVT+836                                             01889000
ATCTODVT EQU   ISTATCVT+832                                             01890000
ATCTRCPT EQU   ISTATCVT+828                                             01891000
ATCMODTB EQU   ISTATCVT+824                                             01892000
ATCUSSPT EQU   ISTATCVT+820                                             01893000
ATCTUBUF EQU   ISTATCVT+816                                             01894000
ATCTACB  EQU   ISTATCVT+812                                             01895000
ATCDWA   EQU   ISTATCVT+808                                             01896000
ATCCFCR2 EQU   ATCPODVT                                                 01897000
ATCEPA   EQU   ISTATCVT+800                                             01898000
ATCPULQB EQU   @NM00098+16                                              01899000
ATCMCQAB EQU   @NM00098+12                                              01900000
ATCLUSMQ EQU   @NM00098+8                                               01901000
ATCLUIOQ EQU   @NM00098+4                                               01902000
ATCIOLQB EQU   @NM00098                                                 01903000
ATCTSCAP EQU   ATCANYDT                                                 01904000
ATCTSCCO EQU   ATCLUDVT+4                                               01905000
ATCTSCSR EQU   ATCLUDVT                                                 01906000
ATCVTLOD EQU   ISTATCVT+764                                             01907000
ATCTSCLF EQU   ISTATCVT+760                                             01908000
ATCTSCLE EQU   ISTATCVT+756                                             01909000
ATCTSCLB EQU   ISTATCVT+752                                             01910000
ATCTSCLS EQU   ISTATCVT+748                                             01911000
ATCTSCCF EQU   ISTATCVT+744                                             01912000
ATCTSCFV EQU   ISTATCVT+740                                             01913000
ATCTSCCE EQU   ISTATCVT+736                                             01914000
ATCTSCCB EQU   ISTATCVT+732                                             01915000
ATCTSCWS EQU   ISTATCVT+728                                             01916000
ATCTSCEM EQU   ISTATCVT+724                                             01917000
ATCTSCNS EQU   ISTATCVT+720                                             01918000
ATCTSCER EQU   ISTATCVT+716                                             01919000
ATCTSCPR EQU   ISTATCVT+712                                             01920000
ATCTSCGR EQU   ISTATCVT+708                                             01921000
ATCTSCCI EQU   ISTATCVT+704                                             01922000
ATCTSVT  EQU   ISTATCVT+700                                             01923000
ATCDVLOD EQU   ISTATCVT+696                                             01924000
ATCCDCNR EQU   ISTATCVT+692                                             01925000
ATCCDCNF EQU   ISTATCVT+688                                             01926000
ATCCDCND EQU   ISTATCVT+684                                             01927000
ATCCDCNA EQU   ISTATCVT+680                                             01928000
ATCCDCCP EQU   ISTATCVT+676                                             01929000
ATCCDFDN EQU   ISTATCVT+672                                             01930000
ATCCDFIN EQU   ISTATCVT+668                                             01931000
ATCCDFND EQU   ISTATCVT+664                                             01932000
ATCCDDEL EQU   ISTATCVT+660                                             01933000
ATCCDADD EQU   ISTATCVT+656                                             01934000
ATCTCLIM EQU   ISTATCVT+652                                             01935000
ATCRACTR EQU   ISTATCVT+648                                             01936000
ATCRACTI EQU   ISTATCVT+644                                             01937000
ATCREMOV EQU   ISTATCVT+640                                             01938000
ATCRACIO EQU   ISTATCVT+636                                             01939000
ATCADD   EQU   ISTATCVT+632                                             01940000
ATCPUCRT EQU   ISTATCVT+628                                             01941000
ATCSMRS  EQU   ISTATCVT+624                                             01942000
ATCSMRQ  EQU   ISTATCVT+620                                             01943000
ATCORCPX EQU   ISTATCVT+616                                             01944000
ATCORCAF EQU   ISTATCVT+612                                             01945000
ATCFRSTR EQU   ATCGTSTR                                                 01946000
ATCSTMA  EQU   ISTATCVT+604                                             01947000
ATCSRTAD EQU   ISTATCVT+600                                             01948000
ATCOCRT  EQU   ISTATCVT+596                                             01949000
ATCOCCFS EQU   ISTATCVT+592                                             01950000
ATCOCCFP EQU   ISTATCVT+588                                             01951000
ATCSRTDF EQU   ISTATCVT+584                                             01952000
ATCLUCRT EQU   ISTATCVT+580                                             01953000
ATCINCY5 EQU   ISTATCVT+576                                             01954000
ATCINCW3 EQU   ISTATCVT+572                                             01955000
ATCINCU6 EQU   ISTATCVT+568                                             01956000
ATCINCTQ EQU   ISTATCVT+564                                             01957000
ATCINCS1 EQU   ISTATCVT+560                                             01958000
ATCSRTAB EQU   ISTATCVT+556                                             01959000
ATCINCRD EQU   ISTATCVT+552                                             01960000
ATCINCPH EQU   ISTATCVT+548                                             01961000
ATCINCLQ EQU   ISTATCVT+544                                             01962000
ATCNOCRT EQU   ISTATCVT+540                                             01963000
ATCINCF1 EQU   ISTATCVT+536                                             01964000
ATCINCCI EQU   ISTATCVT+532                                             01965000
ATCINCCO EQU   ISTATCVT+528                                             01966000
ATCBLDLA EQU   ISTATCVT+524                                             01967000
ATCALOAD EQU   ISTATCVT+520                                             01968000
ATCADEL  EQU   ISTATCVT+516                                             01969000
ATCESC02 EQU   ISTATCVT+512                                             01970000
ATCESC01 EQU   ISTATCVT+508                                             01971000
ATCDEC01 EQU   ISTATCVT+504                                             01972000
ATCDEC00 EQU   ISTATCVT+500                                             01973000
ATCCPCRT EQU   ISTATCVT+496                                             01974000
ATCMSGM  EQU   ISTATCVT+492                                             01975000
ATCCPCFR EQU   ISTATCVT+488                                             01976000
ATCCPCGR EQU   ISTATCVT+484                                             01977000
ATCCPCPP EQU   ISTATCVT+480                                             01978000
ATCMSGP  EQU   ISTATCVT+476                                             01979000
ATCCPCNT EQU   ISTATCVT+472                                             01980000
ATCAUTHA EQU   ISTATCVT+468                                             01981000
ATCACCTA EQU   ISTATCVT+464                                             01982000
ATCAP39  EQU   ISTATCVT+460                                             01983000
ATCAP36  EQU   ISTATCVT+456                                             01984000
ATCAP35  EQU   ISTATCVT+452                                             01985000
ATCAP33  EQU   ISTATCVT+448                                             01986000
ATCAPCR5 EQU   ISTATCVT+444                                             01987000
ATCAICPT EQU   ISTATCVT+440                                             01988000
ATCAPI   EQU   ISTATCVT+436                                             01989000
ATCAICTN EQU   ISTATCVT+432                                             01990000
ATCACC01 EQU   ISTATCVT+428                                             01991000
ATCACC00 EQU   ISTATCVT+424                                             01992000
ATCLDECB EQU   ATCLDTIL+12                                              01993000
ATCLDLCK EQU   ATCLDTIL+8                                               01994000
ATCLDLST EQU   ATCLDTIL+4                                               01995000
ATCLDNCS EQU   ATCLDTIL                                                 01996000
ATCNOSPB EQU   ISTATCVT+376                                             01997000
ATCNSPAB EQU   ISTATCVT+344                                             01998000
ATCLUSRT EQU   ISTATCVT+312                                             01999000
ATCPUIOP EQU   ISTATCVT+280                                             02000000
ATCPUPAB EQU   ISTATCVT+248                                             02001000
ATCPXPAB EQU   ISTATCVT+216                                             02002000
ATCPOPAB EQU   ISTATCVT+184                                             02003000
@NM00097 EQU   ATCVDPAB+16                                              02004000
ATCFEPAB EQU   ATCVDPAB                                                 02005000
ATCTCIPB EQU   ISTATCVT+120                                             02006000
ATCCSPAB EQU   ATCSMPAB+16                                              02007000
@NM00096 EQU   ATCSMPAB                                                 02008000
ATCTMRPB EQU   ISTATCVT+56                                              02009000
ATCITPAB EQU   ISTATCVT+24                                              02010000
@NM00095 EQU   ATCITRA1                                                 02011000
ATCITSCP EQU   ATCITRA1                                                 02012000
ATCITMSG EQU   ATCITRA1                                                 02013000
ATCITPIU EQU   ATCITRA1                                                 02014000
ATCITSMS EQU   ATCITRA1                                                 02015000
ATCITPSS EQU   ATCITRA1                                                 02016000
ATCITLCK EQU   ATCITRA1                                                 02017000
ATCITAPI EQU   ATCITRA1                                                 02018000
ATCITCNT EQU   ATCITFLG                                                 02019000
ATCITRPH EQU   ATCITCDS                                                 02020000
ATCITTBL EQU   ATCITFLD+4                                               02021000
ATCITPRM EQU   ATCITFLD                                                 02022000
ATCPTCHA EQU   ATCRPTCH+4                                               02023000
ATCVTLVL EQU   ATCRPTCH                                                 02024000
PSTDRDYQ EQU   PSTDMPS+1                                                02025000
@NM00094 EQU   PSTDMPS                                                  02026000
PSTDGATE EQU   PSTDMPS                                                  02027000
PSTDEBP  EQU   ISTPST+128                                               02028000
PSTSAVE  EQU   ISTPST+96                                                02029000
PSTCRR1  EQU   ISTPST+56                                                02030000
PSTIQE22 EQU   ISTPST+52                                                02031000
PSTIQE12 EQU   ISTPST+44                                                02032000
PSTACBCT EQU   ISTPST+24                                                02033000
PSTMPSTP EQU   ISTPST+20                                                02034000
PSTTCBA  EQU   ISTPST+16                                                02035000
PSTRSV08 EQU   PSTFLGA+1                                                02036000
PSTPEND  EQU   PSTFLGA+1                                                02037000
PSTDMPC  EQU   PSTFLGA+1                                                02038000
PSTABEND EQU   PSTABINP                                                 02039000
PSTAUTH  EQU   PSTFLGA                                                  02040000
PSTSMCU  EQU   PSTFLGA                                                  02041000
PSTSMQR  EQU   PSTFLGA                                                  02042000
PSTIRBU2 EQU   PSTFLGA                                                  02043000
PSTIRBU1 EQU   PSTFLGA                                                  02044000
PSTSSRN  EQU   PSTFLGA                                                  02045000
PSTRQUEA EQU   PSTRQUE+1                                                02046000
PSTRSV07 EQU   PSTRQUE                                                  02047000
PSTRSV06 EQU   PSTRQUE                                                  02048000
PSTRSV05 EQU   PSTRQUE                                                  02049000
PSTRSV04 EQU   PSTRQUE                                                  02050000
PSTRSV03 EQU   PSTRQUE                                                  02051000
PSTRSV02 EQU   PSTRQUE                                                  02052000
PSTRSV01 EQU   PSTRQUE                                                  02053000
PSTRQFLG EQU   PSTRQUE                                                  02054000
PSTCHAIN EQU   ISTPST+4                                                 02055000
@NM00093 EQU   ISTPST+2                                                 02056000
PSTLNGTH EQU   ISTPST+1                                                 02057000
PSTTYPE  EQU   ISTPST                                                   02058000
MPSSRB1  EQU   ISTMPST+172                                              02059000
MPSSAVE  EQU   ISTMPST+140                                              02060000
MPSMQLBP EQU   ISTMPST+136                                              02061000
MPSSYSRT EQU   ISTMPST+132                                              02062000
MPSQEL   EQU   ISTMPST+128                                              02063000
MPSDBTBL EQU   ISTMPST+124                                              02064000
MPSASCB  EQU   ISTMPST+120                                              02065000
MPSTPPAB EQU   ISTMPST+88                                               02066000
MPSSMPAB EQU   ISTMPST+56                                               02067000
MPSSMRPH EQU   ISTMPST+52                                               02068000
MPSSRB55 EQU   ISTMPST+48                                               02069000
MPSRPLAC EQU   MPSRPLCT+2                                               02070000
MPSRPLRC EQU   MPSRPLCT                                                 02071000
MPSCRPLQ EQU   MPSCRPL                                                  02072000
MPSSRBAC EQU   MPSSRBCT+2                                               02073000
MPSSRBRC EQU   MPSSRBCT                                                 02074000
MPSSRBQ  EQU   MPSSRB                                                   02075000
MPSCRAAC EQU   MPSCRACT+2                                               02076000
MPSCRARC EQU   MPSCRACT                                                 02077000
MPSCRAQ  EQU   MPSCRA                                                   02078000
MPSMPSTP EQU   ISTMPST+20                                               02079000
MPSPSTCT EQU   ISTMPST+16                                               02080000
MPSASID  EQU   MPSFLGA+2                                                02081000
MPSRMGOC EQU   MPSFLGAB                                                 02082000
MPSPSTAB EQU   MPSFLGAA                                                 02083000
MPSRSV01 EQU   MPSFLGAA                                                 02084000
MPSTPBU  EQU   MPSFLGAA                                                 02085000
MPMEMTRM EQU   MPSFLGAA                                                 02086000
MPSAUTH  EQU   MPSFLGAA                                                 02087000
MPSCRAO  EQU   MPSFLGAA                                                 02088000
MPSSRBO  EQU   MPSFLGAA                                                 02089000
MPSRQUEG EQU   MPSRQUE                                                  02090000
MPSTSOIR EQU   MPSRSV07                                                 02091000
MPSTSOIW EQU   MPSRSV07                                                 02092000
MPSID    EQU   ISTMPST                                                  02093000
DYPOCRPH EQU   DYPPACMD                                                 02094000
DYPTSKID EQU   ISTDYPAB+8                                               02095000
DYPPACTB EQU   DYPCHAIN                                                 02096000
DYPFLGS  EQU   ISTDYPAB+2                                               02097000
DYPLNGTH EQU   ISTDYPAB+1                                               02098000
DYPTYPE  EQU   ISTDYPAB                                                 02099000
PABNODQ  EQU   PABFLAGS                                                 02100000
PABINHBT EQU   PABFLAGS                                                 02101000
PABERLOK EQU   PABERRLK                                                 02102000
PABSSN   EQU   PABFLAGS                                                 02103000
PABDYNAM EQU   PABFLAGS                                                 02104000
PABXTND  EQU   PABFLAGS                                                 02105000
PABPRIOR EQU   PABFLAGS                                                 02106000
PABDVTA  EQU   ISTPAB+9                                                 02107000
PABOFFST EQU   ISTPAB+8                                                 02108000
PABRSV02 EQU   PABCHAIN                                                 02109000
PABDELAY EQU   PABCHAIN                                                 02110000
PABQUED  EQU   PABRUNNG                                                 02111000
PABRESET EQU   PABCHAIN                                                 02112000
PABUNCON EQU   PABCHAIN                                                 02113000
PABCDP   EQU   PABCHAIN                                                 02114000
PABRESCH EQU   PABCHAIN                                                 02115000
PABCHNG  EQU   PABCHAIN                                                 02116000
PABWEQP  EQU   PABWEQA+1                                                02117000
PABRSV01 EQU   PABWEQA                                                  02118000
PABWEQG  EQU   PABWEQA                                                  02119000
LOKXCL   EQU   @NM00090                                                 02120000
LOKPRY   EQU   @NM00090                                                 02121000
@NM00091 EQU   @NM00090                                                 02122000
@NM00089 EQU   LOKCHNG                                                  02123000
LOKCT    EQU   ISTLOK                                                   02124000
CRAID    EQU   CRAIDS+4                                                 02125000
CRAASID  EQU   CRAIDS+2                                                 02126000
@NM00086 EQU   CRAIDS                                                   02127000
CRABFTBA EQU   CRABUFA                                                  02128000
CRAMASK  EQU   CRASVC+64                                                02129000
CRAHSIZ  EQU   CRASVC+60                                                02130000
CRAASCRR EQU   CRASVC                                                   02131000
@NM00085 EQU   CRAPROCR                                                 02132000
CRALAPTR EQU   CRABASIC+48                                              02133000
CRAL9PTR EQU   CRABASIC+44                                              02134000
CRAL8PTR EQU   CRABASIC+40                                              02135000
CRAL7PTR EQU   CRABASIC+36                                              02136000
CRAL6PTR EQU   CRABASIC+32                                              02137000
CRAL5PTR EQU   CRABASIC+28                                              02138000
CRAL4PTR EQU   CRABASIC+24                                              02139000
CRAL3PTR EQU   CRABASIC+20                                              02140000
CRAL2PTR EQU   CRABASIC+16                                              02141000
CRAL1PTR EQU   CRABASIC+12                                              02142000
CRALEV01 EQU   CRALKACT+3                                               02143000
CRALEV02 EQU   CRALKACT+3                                               02144000
CRALEV03 EQU   CRALKACT+3                                               02145000
CRALEV04 EQU   CRALKACT+3                                               02146000
CRALEV05 EQU   CRALKACT+3                                               02147000
CRALEV06 EQU   CRALKACT+3                                               02148000
CRALEV07 EQU   CRALKACT+3                                               02149000
CRALEV08 EQU   CRALKACT+3                                               02150000
CRALEV09 EQU   CRALKACT+2                                               02151000
CRALEV10 EQU   CRALKACT+2                                               02152000
CRALEV11 EQU   CRALKACT+2                                               02153000
CRALEV12 EQU   CRALKACT+2                                               02154000
CRALEV13 EQU   CRALKACT+2                                               02155000
CRALEV14 EQU   CRALKACT+2                                               02156000
CRALEV15 EQU   CRALKACT+2                                               02157000
CRALEV16 EQU   CRALKACT+2                                               02158000
CRALEV17 EQU   CRALKACT+1                                               02159000
CRALEV18 EQU   CRALKACT+1                                               02160000
CRALEV19 EQU   CRALKACT+1                                               02161000
CRALEV20 EQU   CRALKACT+1                                               02162000
CRALEV21 EQU   CRALKACT+1                                               02163000
CRALEV22 EQU   CRALKACT+1                                               02164000
CRALEV23 EQU   CRALKACT+1                                               02165000
CRALEV24 EQU   CRALKACT+1                                               02166000
CRALEV25 EQU   CRALKACT                                                 02167000
CRALEV26 EQU   CRALKACT                                                 02168000
CRALEV27 EQU   CRALKACT                                                 02169000
CRALEV28 EQU   CRALKACT                                                 02170000
CRALEV29 EQU   CRALKACT                                                 02171000
CRALEV30 EQU   CRALKACT                                                 02172000
CRALEV31 EQU   CRALKACT                                                 02173000
CRALEV32 EQU   CRALKACT                                                 02174000
CRAFRR   EQU   CRAHDR+4                                                 02175000
RPHUPSTA EQU   ISTRPH+104                                               02176000
RPHSAV16 EQU   RPHWORK+60                                               02177000
RPHSAV15 EQU   RPHWORK+56                                               02178000
RPHSAV14 EQU   RPHWORK+52                                               02179000
RPHSAV13 EQU   RPHWORK+48                                               02180000
RPHSAV12 EQU   RPHWORK+44                                               02181000
RPHSAV11 EQU   RPHWORK+40                                               02182000
RPHSAV10 EQU   RPHWORK+36                                               02183000
RPHSAVE9 EQU   RPHWORK+32                                               02184000
RPHSAVE8 EQU   RPHWORK+28                                               02185000
RPHSAVE7 EQU   RPHWORK+24                                               02186000
RPHSAVE6 EQU   RPHWORK+20                                               02187000
RPHSAVE5 EQU   RPHWORK+16                                               02188000
RPHSAVE4 EQU   RPHWORK+12                                               02189000
RPHSAVE3 EQU   RPHWORK+8                                                02190000
RPHSAVE2 EQU   RPHWORK+4                                                02191000
RPHSHALF EQU   RPHSAVE1+2                                               02192000
RPHSBIT8 EQU   RPHSBITS                                                 02193000
RPHSBIT7 EQU   RPHSBITS                                                 02194000
RPHSBIT6 EQU   RPHSBITS                                                 02195000
RPHSBIT5 EQU   RPHSBITS                                                 02196000
RPHSBIT4 EQU   RPHSBITS                                                 02197000
RPHSBIT3 EQU   RPHSBITS                                                 02198000
RPHSBIT2 EQU   RPHSBITS                                                 02199000
RPHSBIT1 EQU   RPHSBITS                                                 02200000
RPHSBYTE EQU   RPHSAVE1                                                 02201000
RPHPABQP EQU   RPHPABQA+1                                               02202000
RPHPABFG EQU   RPHPABQA                                                 02203000
RPHSRP34 EQU   RPHSRPRM+2                                               02204000
RPHSRP12 EQU   RPHSRPRM                                                 02205000
RPHWEGT  EQU   RPHCSPA                                                  02206000
RPHMAJCB EQU   ISTRPH+21                                                02207000
RPHPABOF EQU   ISTRPH+20                                                02208000
RPHRESUM EQU   RPHRESMA+1                                               02209000
@NM00084 EQU   RPHWPFLG                                                 02210000
RPHPURGE EQU   RPHWPFLG                                                 02211000
RPHPT    EQU   RPHWPFLG                                                 02212000
RPHWT    EQU   RPHWPFLG                                                 02213000
RPHRSKEY EQU   RPHWPFLG                                                 02214000
RPHDVTA  EQU   ISTRPH+12                                                02215000
RPHTIK   EQU   RPHTSKID+3                                               02216000
@NM00083 EQU   RPHTSKID                                                 02217000
RPHRPHAP EQU   RPHRPHA+1                                                02218000
@NM00082 EQU   RPHRPHA                                                  02219000
RPHGATE  EQU   RPHRPHA                                                  02220000
RPHABEND EQU   RPHFLGB                                                  02221000
RPHUWAIT EQU   RPHFLGB                                                  02222000
RPHRLCRA EQU   RPHFLGB                                                  02223000
@NM00081 EQU   RPHFLGB                                                  02224000
RPHPGCMP EQU   RPHFLGB                                                  02225000
RPHFBAPS EQU   RPHFLGB                                                  02226000
RPHBSSP  EQU   RPHFLGB                                                  02227000
RPHLOCK  EQU   RPHFLGB                                                  02228000
RPHFNFLG EQU   RPHFSTLC                                                 02229000
RPHMLTCP EQU   RPHFLAGS                                                 02230000
RPHSMCLR EQU   RPHFLAGS                                                 02231000
RPHSMTYP EQU   RPHFLAGS                                                 02232000
RPHSMQ   EQU   RPHFLAGS                                                 02233000
RPHAPTYP EQU   RPHFLAGS                                                 02234000
RPHSPGIN EQU   RPHFLAGS                                                 02235000
RPHOGIND EQU   RPHFLAGS                                                 02236000
RPHLNGTH EQU   RPHCNTL+1                                                02237000
RPHTYPE  EQU   RPHCNTL                                                  02238000
@NM00080 EQU   ISTAPCRR+144                                             02239000
APCSVRB  EQU   ISTAPCRR+140                                             02240000
@NM00079 EQU   ISTAPCRR+137                                             02241000
@NM00078 EQU   APC57FLG                                                 02242000
APCNREL  EQU   APC57FLG                                                 02243000
APCRECRA EQU   APC57FLG                                                 02244000
@NM00077 EQU   APC54FLG                                                 02245000
APCRLST  EQU   APC54FLG                                                 02246000
APCPR153 EQU   APC53FLG                                                 02247000
@NM00076 EQU   APC52FLG                                                 02248000
APCWKF   EQU   APC52FLG                                                 02249000
APCNWF   EQU   APC52FLG                                                 02250000
APCRDQ   EQU   APC52FLG                                                 02251000
APCQENQ  EQU   APC52FLG                                                 02252000
APCCKRQ  EQU   APC52FLG                                                 02253000
@NM00075 EQU   APC31FLG                                                 02254000
APCSORT  EQU   APC31FLG                                                 02255000
APCRESCH EQU   APC31FLG                                                 02256000
APCTPXIT EQU   APC31FLG                                                 02257000
APCSAV2  EQU   ISTAPCRR+124                                             02258000
APCSAV1  EQU   ISTAPCRR+120                                             02259000
APCRETCD EQU   APCCOMF+2                                                02260000
@NM00074 EQU   APCCOMF1+1                                               02261000
APCTSO   EQU   APCCOMF1+1                                               02262000
APCAUTHE EQU   APCCOMF1+1                                               02263000
APCZLBER EQU   APCCOMF1                                                 02264000
APCIRB2  EQU   APCCOMF1                                                 02265000
APCSSTSK EQU   APCCOMF1                                                 02266000
APCFRRPM EQU   ISTAPCRR+40                                              02267000
APCQWFO  EQU   ISTAPCRR+36                                              02268000
APCPABSV EQU   ISTAPCRR+32                                              02269000
APCRTRNA EQU   APCRTRN+1                                                02270000
@NM00073 EQU   APCAUT                                                   02271000
APCAUTEX EQU   APCAUT                                                   02272000
@NM00072 EQU   APCRFLG+1                                                02273000
APC31R   EQU   APCRFLG                                                  02274000
APC58R   EQU   APCRFLG                                                  02275000
APC57R   EQU   APCRFLG                                                  02276000
APC56R   EQU   APCRFLG                                                  02277000
APC54R   EQU   APCRFLG                                                  02278000
APC53R   EQU   APCRFLG                                                  02279000
APC51R   EQU   APCRFLG                                                  02280000
@NM00071 EQU   APCATFLG+1                                               02281000
APC31E   EQU   APCATFLG                                                 02282000
APC58E   EQU   APCATFLG                                                 02283000
APC57E   EQU   APCATFLG                                                 02284000
APC56E   EQU   APCATFLG                                                 02285000
APC54E   EQU   APCATFLG                                                 02286000
APC53E   EQU   APCATFLG                                                 02287000
APC51E   EQU   APCATFLG                                                 02288000
ASCPSREG EQU   ISTASCRR+44                                              02289000
ASCUSR01 EQU   ASCUSRGS+12                                              02290000
ASCUSR00 EQU   ASCUSRGS+8                                               02291000
ASCUSR15 EQU   ASCUSRGS+4                                               02292000
ASCUSR14 EQU   ASCUSRGS                                                 02293000
ASCETRYA EQU   ISTASCRR+24                                              02294000
ASCKEY   EQU   ISTASCRR+23                                              02295000
ASCAUDIT EQU   ASCFLG3                                                  02296000
ASCFBDUD EQU   ASCFLG3                                                  02297000
ASCLLKF  EQU   ASCFLG3                                                  02298000
ASCKEYF  EQU   ASCFLG3                                                  02299000
ASCFBDAL EQU   ASCFLG3                                                  02300000
ASCFSRGT EQU   ASCFLG3                                                  02301000
ASCICR   EQU   ASCFLG2                                                  02302000
ASCFSRIC EQU   ASCFLG2                                                  02303000
ASCFBDIC EQU   ASCFLG2                                                  02304000
ASCFBAIC EQU   ASCFLG2                                                  02305000
ASCPASTR EQU   ASCFLG1                                                  02306000
ASCFSR   EQU   ASCFLG1                                                  02307000
ASCFBD   EQU   ASCFLG1                                                  02308000
ASCFBA   EQU   ASCFLG1                                                  02309000
ASCPFCRR EQU   ISTASCRR                                                 02310000
CRRRVPT5 EQU   CRRSAREA+316                                             02311000
CRRRVPT4 EQU   CRRSAREA+312                                             02312000
CRRRVPT3 EQU   CRRSAREA+308                                             02313000
CRRRVPT2 EQU   CRRSAREA+304                                             02314000
CRRRVPT1 EQU   CRRSAREA+300                                             02315000
CRRRVCR2 EQU   CRRSAREA+296                                             02316000
CRRCID   EQU   CRRSAREA+292                                             02317000
CRRRVCR1 EQU   CRRSAREA+291                                             02318000
CRRXFNCD EQU   CRRSAREA+290                                             02319000
CRRLDOCT EQU   CRRSAREA+288                                             02320000
CRRBTLEN EQU   CRRSAREA+284                                             02321000
CRRBLEN  EQU   CRRSAREA+282                                             02322000
CRRBRTCD EQU   CRRSAREA+281                                             02323000
@NM00070 EQU   CRRBFLGS                                                 02324000
CRRBFLG1 EQU   CRRBFLGS                                                 02325000
CRRBLDAD EQU   CRRSAREA+276                                             02326000
CRRBARAD EQU   CRRSAREA+272                                             02327000
CRRRTN12 EQU   CRRSAREA+268                                             02328000
CRRRTN11 EQU   CRRSAREA+264                                             02329000
CRRRTN10 EQU   CRRSAREA+260                                             02330000
CRRRTN9  EQU   CRRSAREA+256                                             02331000
CRRRTN8  EQU   CRRSAREA+252                                             02332000
CRRRTN7  EQU   CRRSAREA+248                                             02333000
CRRRTN6  EQU   CRRSAREA+244                                             02334000
CRRRTN5  EQU   CRRSAREA+240                                             02335000
CRRRTN4  EQU   CRRSAREA+236                                             02336000
CRRRTN3  EQU   CRRSAREA+232                                             02337000
CRRRTN2  EQU   CRRSAREA+228                                             02338000
CRRRTN1  EQU   CRRSAREA+224                                             02339000
CRRRES1  EQU   CRRSAREA+222                                             02340000
CRRLCNT  EQU   CRRSAREA+220                                             02341000
CRRATCVT EQU   CRRSAREA+216                                             02342000
CRRVALCK EQU   CRRSAREA+212                                             02343000
CRRARPL  EQU   CRRTRBUF+4                                               02344000
CRRBIND  EQU   CRRTRBUF+3                                               02345000
CRRTRRES EQU   CRRTRBUF                                                 02346000
CRRCLDO  EQU   CRRSAREA+200                                             02347000
CRRUECB  EQU   CRRSAREA+196                                             02348000
CRRLCPB  EQU   CRRSAREA+192                                             02349000
CRRCMDAD EQU   CRRSAREA+188                                             02350000
CRRFMCB  EQU   CRRSAREA+184                                             02351000
CRRCLCCW EQU   CRRSAREA+180                                             02352000
CRRESR2  EQU   CRRESR+1                                                 02353000
CRRESR1  EQU   CRRESR                                                   02354000
CRRDSB2  EQU   CRRDSB+1                                                 02355000
CRRDSB1  EQU   CRRDSB                                                   02356000
CRRDTACT EQU   CRRSAREA+174                                             02357000
CRRRSV99 EQU   CRRSAREA+173                                             02358000
CRRRDSOH EQU   CRRFDB3                                                  02359000
CRRRLG   EQU   CRRFDB3                                                  02360000
CRRLGFRC EQU   CRRFDB3                                                  02361000
CRRRDEOT EQU   CRRFDB3                                                  02362000
CRRRDEOM EQU   CRRFDB3                                                  02363000
CRRRDEOB EQU   CRRFDB3                                                  02364000
CRRUNUSD EQU   CRRFDB3                                                  02365000
CRRUINPT EQU   CRRFDB3                                                  02366000
CRRSTSAV EQU   CRRFDB2                                                  02367000
CRRCUERR EQU   CRRFDB2                                                  02368000
CRRDLGFL EQU   CRRFDB2                                                  02369000
CRRIOERR EQU   CRRFDB2                                                  02370000
CRRDVUNS EQU   CRRFDB2                                                  02371000
CRRATND  EQU   CRRFDB2                                                  02372000
CRRRVID  EQU   CRRFDB2                                                  02373000
CRRERLK  EQU   CRRFDB2                                                  02374000
CRRRTNCD EQU   CRRFDBK1                                                 02375000
CRRNSNA  EQU   CRRRTYPE                                                 02376000
CRRDFSYN EQU   CRRRTYPE                                                 02377000
CRRRESP  EQU   CRRRTYPE                                                 02378000
CRRDFASY EQU   CRRRTYPE                                                 02379000
CRRDBLCK EQU   CRRRFLG1                                                 02380000
CRRRPSBD EQU   CRRRFLG1                                                 02381000
CRRRPLOQ EQU   CRRRFLG1                                                 02382000
CRRRPLS  EQU   CRRRFLG1                                                 02383000
CRRSW7   EQU   CRRFLGS                                                  02384000
CRRSW6   EQU   CRRFLGS                                                  02385000
CRRSW5   EQU   CRRFLGS                                                  02386000
CRRSW4   EQU   CRRFLGS                                                  02387000
CRRSW3   EQU   CRRFLGS                                                  02388000
CRRSW2   EQU   CRRFLGS                                                  02389000
CRRSW1   EQU   CRRFLGS                                                  02390000
CRRSW0   EQU   CRRFLGS                                                  02391000
CRRRSV04 EQU   CRRFLGS4                                                 02392000
CRRFMCLK EQU   CRRFLGS4                                                 02393000
CRRDLCCW EQU   CRRFLGS3                                                 02394000
CRRRESET EQU   CRRFLGS3                                                 02395000
CRRSUBBK EQU   CRRFLGS3                                                 02396000
CRRRSV08 EQU   CRRFLGS3                                                 02397000
CRRDEBQ  EQU   CRRFLGS3                                                 02398000
CRRSTSPR EQU   CRRFLGS3                                                 02399000
CRRDREQ  EQU   CRRFLGS3                                                 02400000
CRRDFDBK EQU   CRRFLGS3                                                 02401000
CRRDFSB  EQU   CRRFLGS2                                                 02402000
CRRDPROC EQU   CRRFLGS2                                                 02403000
CRREXTS  EQU   CRRFLGS2                                                 02404000
CRRELSRI EQU   CRRFLGS2                                                 02405000
CRRPOST  EQU   CRRFLGS2                                                 02406000
CRRENDLW EQU   CRRFLGS2                                                 02407000
CRRPRGIP EQU   CRRFLGS2                                                 02408000
CRRDEXP  EQU   CRRFLGS2                                                 02409000
CRRSOLRQ EQU   CRRFLGS1                                                 02410000
CRRREQP  EQU   CRRFLGS1                                                 02411000
CRRCPROC EQU   CRRFLGS1                                                 02412000
CRRFINI  EQU   CRRFLGS1                                                 02413000
CRRPREIO EQU   CRRFLGS1                                                 02414000
CRRINIO  EQU   CRRFLGS1                                                 02415000
CRRFLDOS EQU   CRRFLGS1                                                 02416000
CRRDOCUR EQU   CRRFLGS1                                                 02417000
CRRRATS4 EQU   CRRATS+7                                                 02418000
CRRASC31 EQU   CRRSATS                                                  02419000
CRRASC11 EQU   CRRSATS                                                  02420000
CRRASC51 EQU   CRRSATS                                                  02421000
CRRASC40 EQU   CRRSATS                                                  02422000
CRRASC30 EQU   CRRSATS                                                  02423000
CRRASC21 EQU   CRRSATS                                                  02424000
CRRASC10 EQU   CRRSATS                                                  02425000
CRRASC01 EQU   CRRSATS                                                  02426000
CRRSCBND EQU   CRRRATS2                                                 02427000
CRRPLIC  EQU   CRRRATS2                                                 02428000
CRRRC81  EQU   CRRRATS2                                                 02429000
CRRRC80  EQU   CRRRATS2                                                 02430000
CRRRC65  EQU   CRRRATS2                                                 02431000
CRRRC63  EQU   CRRRATS2                                                 02432000
CRRRC55  EQU   CRRRATS2                                                 02433000
CRRRC54  EQU   CRRRATS2                                                 02434000
CRRRC53  EQU   CRRRATS1                                                 02435000
CRRRC52  EQU   CRRRATS1                                                 02436000
CRRRC51  EQU   CRRRATS1                                                 02437000
CRRRC30  EQU   CRRRATS1                                                 02438000
CRRRC26  EQU   CRRRATS1                                                 02439000
CRRRC23  EQU   CRRRATS1                                                 02440000
CRRRC22  EQU   CRRRATS1                                                 02441000
CRRRC21  EQU   CRRRATS1                                                 02442000
@NM00069 EQU   CRRATS4                                                  02443000
CRRC3X   EQU   CRRATS4                                                  02444000
CRRC85   EQU   CRRATS4                                                  02445000
CRRC83   EQU   CRRATS4                                                  02446000
CRRC82   EQU   CRRATS4                                                  02447000
CRRC61   EQU   CRRATS4                                                  02448000
CRRC60   EQU   CRRATS4                                                  02449000
CRRC81   EQU   CRRATS3                                                  02450000
CRRC80   EQU   CRRATS3                                                  02451000
CRRC75   EQU   CRRATS3                                                  02452000
CRRC51   EQU   CRRATS3                                                  02453000
CRRC50   EQU   CRRATS3                                                  02454000
CRRC42   EQU   CRRATS3                                                  02455000
CRRC41   EQU   CRRATS3                                                  02456000
CRRC40   EQU   CRRATS3                                                  02457000
CRRC32   EQU   CRRATS2                                                  02458000
CRRC31   EQU   CRRATS2                                                  02459000
CRRC30   EQU   CRRATS2                                                  02460000
CRRC25   EQU   CRRATS2                                                  02461000
CRRC24   EQU   CRRATS2                                                  02462000
CRRC23   EQU   CRRATS2                                                  02463000
CRRC22   EQU   CRRATS2                                                  02464000
CRRC21   EQU   CRRATS2                                                  02465000
CRRC20   EQU   CRRATS1                                                  02466000
CRRC13   EQU   CRRATS1                                                  02467000
CRRC12   EQU   CRRATS1                                                  02468000
CRRC11   EQU   CRRATS1                                                  02469000
CRRC10   EQU   CRRATS1                                                  02470000
CRRC02   EQU   CRRATS1                                                  02471000
CRRC01   EQU   CRRATS1                                                  02472000
CRRC00   EQU   CRRATS1                                                  02473000
CRRRMAS4 EQU   CRRMAS+7                                                 02474000
CRRMSC31 EQU   CRRSMAS                                                  02475000
CRRMSC11 EQU   CRRSMAS                                                  02476000
CRRMSC51 EQU   CRRSMAS                                                  02477000
CRRMSC40 EQU   CRRSMAS                                                  02478000
CRRMSC30 EQU   CRRSMAS                                                  02479000
CRRMSC21 EQU   CRRSMAS                                                  02480000
CRRMSC10 EQU   CRRSMAS                                                  02481000
CRRMSC01 EQU   CRRSMAS                                                  02482000
@NM00068 EQU   CRRRMAS2                                                 02483000
CRRRM81  EQU   CRRRMAS2                                                 02484000
CRRRM80  EQU   CRRRMAS2                                                 02485000
CRRRM65  EQU   CRRRMAS2                                                 02486000
CRRRM63  EQU   CRRRMAS2                                                 02487000
CRRRM55  EQU   CRRRMAS2                                                 02488000
CRRRM54  EQU   CRRRMAS2                                                 02489000
CRRRM53  EQU   CRRRMAS1                                                 02490000
CRRRM52  EQU   CRRRMAS1                                                 02491000
CRRRM51  EQU   CRRRMAS1                                                 02492000
CRRRM30  EQU   CRRRMAS1                                                 02493000
CRRRM26  EQU   CRRRMAS1                                                 02494000
CRRRM23  EQU   CRRRMAS1                                                 02495000
CRRRM22  EQU   CRRRMAS1                                                 02496000
CRRRM21  EQU   CRRRMAS1                                                 02497000
@NM00067 EQU   CRRMAS4                                                  02498000
CRRM3X   EQU   CRRMAS4                                                  02499000
CRRM85   EQU   CRRMAS4                                                  02500000
CRRM83   EQU   CRRMAS4                                                  02501000
CRRM82   EQU   CRRMAS4                                                  02502000
CRRM61   EQU   CRRMAS4                                                  02503000
CRRM60   EQU   CRRMAS4                                                  02504000
CRRM81   EQU   CRRMAS3                                                  02505000
CRRM80   EQU   CRRMAS3                                                  02506000
CRRM75   EQU   CRRMAS3                                                  02507000
CRRM51   EQU   CRRMAS3                                                  02508000
CRRM50   EQU   CRRMAS3                                                  02509000
CRRM42   EQU   CRRMAS3                                                  02510000
CRRM41   EQU   CRRMAS3                                                  02511000
CRRM40   EQU   CRRMAS3                                                  02512000
CRRM32   EQU   CRRMAS2                                                  02513000
CRRM31   EQU   CRRMAS2                                                  02514000
CRRM30   EQU   CRRMAS2                                                  02515000
CRRM25   EQU   CRRMAS2                                                  02516000
CRRM24   EQU   CRRMAS2                                                  02517000
CRRM23   EQU   CRRMAS2                                                  02518000
CRRM22   EQU   CRRMAS2                                                  02519000
CRRM21   EQU   CRRMAS2                                                  02520000
CRRM20   EQU   CRRMAS1                                                  02521000
CRRM13   EQU   CRRMAS1                                                  02522000
CRRM12   EQU   CRRMAS1                                                  02523000
CRRM11   EQU   CRRMAS1                                                  02524000
CRRM10   EQU   CRRMAS1                                                  02525000
CRRM02   EQU   CRRMAS1                                                  02526000
CRRM01   EQU   CRRMAS1                                                  02527000
CRRM00   EQU   CRRMAS1                                                  02528000
CRRFSB   EQU   CRRSAREA+144                                             02529000
CRRSAVE1 EQU   CRRSAREA+72                                              02530000
CRRSAVE  EQU   CRRSAREA                                                 02531000
CRRRSV22 EQU   ISTDCCRR+4                                               02532000
CRRCRR   EQU   ISTDCCRR                                                 02533000
CCFRSVD1 EQU   CFCCRT                                                   02534000
CCFCR2   EQU   CFCCRT                                                   02535000
CCFCRP   EQU   CFCCRT                                                   02536000
CCFCR1   EQU   CFCCRT                                                   02537000
CCFCS2   EQU   CFCCRT                                                   02538000
CCFCS1   EQU   CFCCRT                                                   02539000
NCFRSVD  EQU   CFCNTRD                                                  02540000
NCFCR2   EQU   CFCNTRD                                                  02541000
NCFCRP   EQU   CFCNTRD                                                  02542000
NCFCR1   EQU   CFCNTRD                                                  02543000
NCFCS2   EQU   CFCNTRD                                                  02544000
NCFCS1   EQU   CFCNTRD                                                  02545000
PFCRSV01 EQU   ISTPFCRR+13                                              02546000
PFCFTA   EQU   ISTPFCRR+12                                              02547000
CRRFRR   EQU   PFCFRRO                                                  02548000
CRRCHAIN EQU   PFCCRRO                                                  02549000
CRRLEN   EQU   PFCCRRLN                                                 02550000
PFCRSV10 EQU   PFCCRR+1                                                 02551000
CRRID    EQU   PFCCRRID                                                 02552000
@NM00066 EQU   SRBSECT+40                                               02553000
@NM00065 EQU   SRBSECT+38                                               02554000
SRBPRIOR EQU   SRBSECT+37                                               02555000
SRBPKF   EQU   SRBSECT+36                                               02556000
SRBSAVE  EQU   SRBSECT+32                                               02557000
SRBPARM  EQU   SRBSECT+28                                               02558000
SRBRMTR  EQU   SRBSECT+24                                               02559000
SRBEP    EQU   SRBSECT+20                                               02560000
SRBPTCB  EQU   SRBFLC+4                                                 02561000
SRBPASID EQU   SRBFLC+2                                                 02562000
SRBCPAFF EQU   SRBFLC                                                   02563000
SRBASCB  EQU   SRBSECT+8                                                02564000
SRBFLNK  EQU   SRBSECT+4                                                02565000
SRBID    EQU   SRBSECT                                                  02566000
CVTLEVL  EQU   CVTRELNO+2                                               02567000
CVTNUMB  EQU   CVTRELNO                                                 02568000
CVTMDL   EQU   CVTFIX+250                                               02569000
@NM00064 EQU   CVTFIX+248                                               02570000
@NM00063 EQU   CVTFIX                                                   02571000
CVTRV482 EQU   CVTXTNT2+128                                             02572000
CVTRV481 EQU   CVTXTNT2+124                                             02573000
CVTRV480 EQU   CVTXTNT2+120                                             02574000
CVTRV479 EQU   CVTXTNT2+118                                             02575000
CVTRV478 EQU   CVTXTNT2+117                                             02576000
CVTRV477 EQU   CVTXTNT2+116                                             02577000
CVTRV476 EQU   CVTXTNT2+115                                             02578000
CVTRV475 EQU   CVTXTNT2+114                                             02579000
CVTRV474 EQU   CVTRV466                                                 02580000
CVTRV473 EQU   CVTRV466                                                 02581000
CVTRV472 EQU   CVTRV466                                                 02582000
CVTRV471 EQU   CVTRV466                                                 02583000
CVTRV470 EQU   CVTRV466                                                 02584000
CVTRV469 EQU   CVTRV466                                                 02585000
CVTRV468 EQU   CVTRV466                                                 02586000
CVTRV467 EQU   CVTRV466                                                 02587000
CVTRV465 EQU   CVTRV457                                                 02588000
CVTRV464 EQU   CVTRV457                                                 02589000
CVTRV463 EQU   CVTRV457                                                 02590000
CVTRV462 EQU   CVTRV457                                                 02591000
CVTRV461 EQU   CVTRV457                                                 02592000
CVTRV460 EQU   CVTRV457                                                 02593000
CVTRV459 EQU   CVTRV457                                                 02594000
CVTRV458 EQU   CVTRV457                                                 02595000
CVTRV456 EQU   CVTXTNT2+108                                             02596000
CVTRV455 EQU   CVTXTNT2+104                                             02597000
CVTRV454 EQU   CVTXTNT2+100                                             02598000
CVTRV453 EQU   CVTXTNT2+96                                              02599000
CVTRV452 EQU   CVTXTNT2+94                                              02600000
CVTRV451 EQU   CVTXTNT2+92                                              02601000
CVTRV450 EQU   CVTXTNT2+90                                              02602000
CVTRV449 EQU   CVTXTNT2+88                                              02603000
CVTRV448 EQU   CVTXTNT2+87                                              02604000
CVTRV447 EQU   CVTXTNT2+86                                              02605000
CVTRV446 EQU   CVTRV438                                                 02606000
CVTRV445 EQU   CVTRV438                                                 02607000
CVTRV444 EQU   CVTRV438                                                 02608000
CVTRV443 EQU   CVTRV438                                                 02609000
CVTRV442 EQU   CVTRV438                                                 02610000
CVTRV441 EQU   CVTRV438                                                 02611000
CVTRV440 EQU   CVTRV438                                                 02612000
CVTRV439 EQU   CVTRV438                                                 02613000
CVTRV437 EQU   CVTRV429                                                 02614000
CVTRV436 EQU   CVTRV429                                                 02615000
CVTRV435 EQU   CVTRV429                                                 02616000
CVTRV434 EQU   CVTRV429                                                 02617000
CVTRV433 EQU   CVTRV429                                                 02618000
CVTRV432 EQU   CVTRV429                                                 02619000
CVTRV431 EQU   CVTRV429                                                 02620000
CVTRV430 EQU   CVTRV429                                                 02621000
CVTRV428 EQU   CVTXTNT2+80                                              02622000
CVTRV427 EQU   CVTXTNT2+76                                              02623000
CVTRV426 EQU   CVTXTNT2+72                                              02624000
CVTRV425 EQU   CVTXTNT2+68                                              02625000
CVTATACT EQU   CVTATCVT                                                 02626000
CVTRV423 EQU   CVTXTNT2+62                                              02627000
CVTRV422 EQU   CVTXTNT2+60                                              02628000
CVTRV421 EQU   CVTXTNT2+58                                              02629000
CVTRV420 EQU   CVTXTNT2+56                                              02630000
CVTRV419 EQU   CVTXTNT2+55                                              02631000
CVTRV418 EQU   CVTXTNT2+54                                              02632000
CVTRV417 EQU   CVTRV409                                                 02633000
CVTRV416 EQU   CVTRV409                                                 02634000
CVTRV415 EQU   CVTRV409                                                 02635000
CVTRV414 EQU   CVTRV409                                                 02636000
CVTRV413 EQU   CVTRV409                                                 02637000
CVTRV412 EQU   CVTRV409                                                 02638000
CVTRV411 EQU   CVTRV409                                                 02639000
CVTRV410 EQU   CVTRV409                                                 02640000
CVTRV408 EQU   CVTRV400                                                 02641000
CVTRV407 EQU   CVTRV400                                                 02642000
CVTRV406 EQU   CVTRV400                                                 02643000
CVTRV405 EQU   CVTRV400                                                 02644000
CVTRV404 EQU   CVTRV400                                                 02645000
CVTRV403 EQU   CVTRV400                                                 02646000
CVTRV402 EQU   CVTRV400                                                 02647000
CVTRV401 EQU   CVTRV400                                                 02648000
CVTICB   EQU   CVTXTNT2+48                                              02649000
CVTSKTA  EQU   CVTXTNT2+44                                              02650000
CVTCCVT  EQU   CVTXTNT2+40                                              02651000
CVTRSV98 EQU   CVTXTNT2+36                                              02652000
CVTRSV97 EQU   CVTXTNT2+34                                              02653000
CVTRSV96 EQU   CVTXTNT2+32                                              02654000
CVTOLTEP EQU   CVTXTNT2+28                                              02655000
CVTQIDA  EQU   CVTQID+1                                                 02656000
CVTRSV95 EQU   CVTQID                                                   02657000
CVTRSV94 EQU   CVTXTNT2+20                                              02658000
CVTRSV93 EQU   CVTXTNT2+16                                              02659000
CVTRSV92 EQU   CVTXTNT2+12                                              02660000
CVTDEBVR EQU   CVTXTNT2+8                                               02661000
CVTRSV91 EQU   CVTXTNT2+6                                               02662000
CVTRSV9H EQU   CVTFLGBT                                                 02663000
CVTRSV9G EQU   CVTFLGBT                                                 02664000
CVTRSV9F EQU   CVTFLGBT                                                 02665000
CVTRSV9E EQU   CVTFLGBT                                                 02666000
CVTRSV9D EQU   CVTFLGBT                                                 02667000
CVTBAH   EQU   CVTFLGBT                                                 02668000
CVTVME   EQU   CVTFLGBT                                                 02669000
CVTNPE   EQU   CVTFLGBT                                                 02670000
CVTNUCLS EQU   CVTXTNT2+4                                               02671000
CVTDSSVA EQU   CVTDSSV+1                                                02672000
CVTRSV89 EQU   CVTDSSV                                                  02673000
CVTRSV88 EQU   CVTXTNT1+8                                               02674000
CVTRSV87 EQU   CVTXTNT1+4                                               02675000
CVTFACHN EQU   CVTXTNT1                                                 02676000
CVTRV488 EQU   CVTMAP+412                                               02677000
CVTRV487 EQU   CVTMAP+408                                               02678000
CVTRV486 EQU   CVTMAP+404                                               02679000
CVTRV485 EQU   CVTMAP+400                                               02680000
CVTACTAP EQU   CVTMAP+396                                               02681000
CVTAUTH  EQU   CVTMAP+392                                               02682000
CVTRV490 EQU   CVTMAP+388                                               02683000
CVTSU    EQU   CVTMAP+384                                               02684000
CVTVOLT1 EQU   CVTVOLM1+1                                               02685000
CVTVOLI1 EQU   CVTVOLF1                                                 02686000
CVTSTOA  EQU   CVTMAP+376                                               02687000
CVTRSV58 EQU   CVTMAP+374                                               02688000
CVTRSV57 EQU   CVTMAP+372                                               02689000
CVTDDCE  EQU   CVTMAP+368                                               02690000
CVTPNWFR EQU   CVTMAP+364                                               02691000
CVTSMF   EQU   CVTMAP+360                                               02692000
CVTSULK  EQU   CVTMAP+358                                               02693000
CVTSLKO  EQU   CVTSYSK                                                  02694000
CVTSLKP  EQU   CVTSYSK                                                  02695000
CVTSLKQ  EQU   CVTSYSK                                                  02696000
CVTSLKR  EQU   CVTSYSK                                                  02697000
CVTRSV56 EQU   CVTSYSK                                                  02698000
CVTRSV55 EQU   CVTSYSK                                                  02699000
CVTRSV54 EQU   CVTSYSK                                                  02700000
CVTRSV53 EQU   CVTSYSK                                                  02701000
CVTRSV52 EQU   CVTA1F1                                                  02702000
CVTRSV51 EQU   CVTA1F1                                                  02703000
CVTRSV50 EQU   CVTA1F1                                                  02704000
CVTRSV49 EQU   CVTA1F1                                                  02705000
CVTRSV48 EQU   CVTA1F1                                                  02706000
CVTRSV47 EQU   CVTA1F1                                                  02707000
CVTSRSW  EQU   CVTA1F1                                                  02708000
CVTPFSW  EQU   CVTA1F1                                                  02709000
CVTPCVT  EQU   CVTMAP+352                                               02710000
CVTRSV46 EQU   CVTMAP+344                                               02711000
CVTRSV45 EQU   CVTMAP+340                                               02712000
CVTRSV44 EQU   CVTMAP+338                                               02713000
CVTRSV43 EQU   CVTMAP+336                                               02714000
CVTHJESA EQU   CVTHJES+1                                                02715000
CVTRSV42 EQU   CVTHJES                                                  02716000
CVTEXT2A EQU   CVTEXT2+1                                                02717000
CVTRSV41 EQU   CVTEXT2                                                  02718000
CVTAPFA  EQU   CVTAPF+1                                                 02719000
CVTRSV40 EQU   CVTAPF                                                   02720000
CVTRV518 EQU   CVTINTLA                                                 02721000
CVTRV517 EQU   CVTERPV                                                  02722000
CVTEORM  EQU   CVTMAP+312                                               02723000
CVTMCHPR EQU   CVTMAP+308                                               02724000
CVTTZ    EQU   CVTMAP+304                                               02725000
CVTJEPS  EQU   CVTMAP+300                                               02726000
CVTJESCT EQU   CVTMAP+296                                               02727000
CVTMODE  EQU   CVTMAP+292                                               02728000
CVTPTRV  EQU   CVTMAP+288                                               02729000
CVTREAL  EQU   CVTMAP+284                                               02730000
CVTRSV39 EQU   CVTMAP+280                                               02731000
CVTRSV38 EQU   CVTMAP+276                                               02732000
CVTDMSRA EQU   CVTDMSR+1                                                02733000
CVTRV634 EQU   CVTDMSRF                                                 02734000
CVTRV633 EQU   CVTDMSRF                                                 02735000
CVTRV632 EQU   CVTDMSRF                                                 02736000
CVTRV631 EQU   CVTDMSRF                                                 02737000
CVTRV630 EQU   CVTDMSRF                                                 02738000
CVTRV629 EQU   CVTDMSRF                                                 02739000
CVTUDUMP EQU   CVTDMSRF                                                 02740000
CVTSDUMP EQU   CVTDMSRF                                                 02741000
CVTQMSGA EQU   CVTQMSG+1                                                02742000
CVTRSV36 EQU   CVTQMSG                                                  02743000
CVTAMFF  EQU   CVTMAP+264                                               02744000
CVTPURGA EQU   CVTPURG+1                                                02745000
CVTRSV35 EQU   CVTPURG                                                  02746000
CVTCBSP  EQU   CVTMAP+256                                               02747000
CVTATERA EQU   CVTATER+1                                                02748000
CVTSYST  EQU   CVTATER                                                  02749000
CVTVOLT2 EQU   CVTTAT                                                   02750000
CVTVOLI2 EQU   CVTVOLF2                                                 02751000
CVTAQAVB EQU   CVTAQAVT+1                                               02752000
CVTRSV34 EQU   CVTTCMFG                                                 02753000
CVTRSV33 EQU   CVTTCMFG                                                 02754000
CVTRSV32 EQU   CVTTCMFG                                                 02755000
CVTRSV31 EQU   CVTTCMFG                                                 02756000
CVTRSV30 EQU   CVTTCMFG                                                 02757000
CVTRSV29 EQU   CVTTCMFG                                                 02758000
CVTLDEV  EQU   CVTTCMFG                                                 02759000
CVTTCRDY EQU   CVTTCMFG                                                 02760000
CVTGTFA  EQU   CVTGTF+1                                                 02761000
CVTRSV27 EQU   CVTGTFST                                                 02762000
CVTRNIO  EQU   CVTGTFST                                                 02763000
CVTUSR   EQU   CVTGTFST                                                 02764000
CVTRV318 EQU   CVTFORM                                                  02765000
CVTRV317 EQU   CVTTMODE                                                 02766000
CVTRV316 EQU   CVTSTATE                                                 02767000
CVTRV315 EQU   CVTGTFS                                                  02768000
CVTGTFAV EQU   CVTGTFS                                                  02769000
CVT0SCR1 EQU   CVTMAP+232                                               02770000
CVTRV515 EQU   CVTMAP+228                                               02771000
CVTRMS   EQU   CVTMAP+224                                               02772000
CVTPATCH EQU   CVTMAP+220                                               02773000
CVTTSCE  EQU   CVTMAP+216                                               02774000
CVTLNKSC EQU   CVTMAP+214                                               02775000
CVTQABST EQU   CVTMAP+212                                               02776000
CVTMDLDS EQU   CVTMAP+208                                               02777000
CVTUSER  EQU   CVTMAP+204                                               02778000
CVTABEND EQU   CVTMAP+200                                               02779000
CVTSMCA  EQU   CVTMAP+196                                               02780000
CVTRSV18 EQU   CVTMAP+192                                               02781000
CVTQLPAQ EQU   CVTMAP+188                                               02782000
CVTQCDSR EQU   CVTMAP+184                                               02783000
CVTVS1B  EQU   CVTOPTB                                                  02784000
CVTVS1A  EQU   CVTOPTB                                                  02785000
CVTFP    EQU   CVTOPTB                                                  02786000
CVTAPTHR EQU   CVTOPTB                                                  02787000
CVTNLOG  EQU   CVTOPTB                                                  02788000
CVTTOD   EQU   CVTOPTB                                                  02789000
CVTCTIMS EQU   CVTOPTB                                                  02790000
CVTPROT  EQU   CVTOPTB                                                  02791000
CVTXPFP  EQU   CVTOPTA                                                  02792000
CVTASCII EQU   CVTOPTA                                                  02793000
CVTRSV13 EQU   CVTOPTA                                                  02794000
CVTRSV12 EQU   CVTOPTA                                                  02795000
CVTNIP   EQU   CVTOPTA                                                  02796000
CVTDDR   EQU   CVTOPTA                                                  02797000
CVTAPR   EQU   CVTOPTA                                                  02798000
CVTCCH   EQU   CVTOPTA                                                  02799000
CVTSNCTR EQU   CVTMAP+180                                               02800000
CVTQMWR  EQU   CVTMAP+176                                               02801000
CVTQOCR  EQU   CVTMAP+172                                               02802000
CVT1EF00 EQU   CVTMAP+168                                               02803000
CVTMZ00  EQU   CVTMAP+164                                               02804000
CVTHEAD  EQU   CVTMAP+160                                               02805000
CVTRSV11 EQU   CVTMAP+156                                               02806000
CVT0PT01 EQU   CVTMAP+152                                               02807000
CVTMSER  EQU   CVTMAP+148                                               02808000
CVTRV516 EQU   CVTIERLC                                                 02809000
CVTILCH  EQU   CVTMAP+140                                               02810000
CVT0DS   EQU   CVTMAP+136                                               02811000
CVTFBOSV EQU   CVTMAP+132                                               02812000
CVTNUCB  EQU   CVTMAP+128                                               02813000
CVTIXAVL EQU   CVTMAP+124                                               02814000
CVTIOQET EQU   CVTMAP+120                                               02815000
CVTDCBA  EQU   CVTMAP+117                                               02816000
CVTMVS2  EQU   CVTDCB                                                   02817000
CVT6DAT  EQU   CVTDCB                                                   02818000
CVT4MPS  EQU   CVTDCB                                                   02819000
CVTRSV09 EQU   CVTDCB                                                   02820000
CVT4MS1  EQU   CVTDCB                                                   02821000
CVT2SPS  EQU   CVTDCB                                                   02822000
CVT1SSS  EQU   CVTDCB                                                   02823000
CVTRSV08 EQU   CVTDCB                                                   02824000
CVTSTB   EQU   CVTMAP+112                                               02825000
CVTQTD00 EQU   CVTMAP+108                                               02826000
CVTQTE00 EQU   CVTMAP+104                                               02827000
CVTCUCB  EQU   CVTMAP+100                                               02828000
CVTSJQ   EQU   CVTMAP+96                                                02829000
CVTPBLDL EQU   CVTMAP+92                                                02830000
CVTTPC   EQU   CVTMAP+88                                                02831000
CVTSVDCB EQU   CVTMAP+84                                                02832000
CVTBRET  EQU   CVTMAP+82                                                02833000
CVTEXIT  EQU   CVTMAP+80                                                02834000
CVT0FN00 EQU   CVTMAP+76                                                02835000
CVTDARA  EQU   CVTDAR+1                                                 02836000
CVTRSV07 EQU   CVTFLGS1                                                 02837000
CVTRSV06 EQU   CVTFLGS1                                                 02838000
CVTRSV05 EQU   CVTFLGS1                                                 02839000
CVTRSV04 EQU   CVTFLGS1                                                 02840000
CVTRSV03 EQU   CVTFLGS1                                                 02841000
CVTRSV02 EQU   CVTFLGS1                                                 02842000
CVTRSV01 EQU   CVTFLGS1                                                 02843000
CVTDMPLK EQU   CVTFLGS1                                                 02844000
CVTXITP  EQU   CVTMAP+68                                                02845000
CVTZDTAB EQU   CVTMAP+64                                                02846000
CVTMSLT  EQU   CVTMAP+60                                                02847000
CVTDATE  EQU   CVTMAP+56                                                02848000
CVTBTERM EQU   CVTMAP+52                                                02849000
CVTSYSAD EQU   CVTMAP+48                                                02850000
CVTXTLER EQU   CVTMAP+44                                                02851000
CVTILK2  EQU   CVTMAP+40                                                02852000
CVTILK1  EQU   CVTMAP+36                                                02853000
CVTPRLTV EQU   CVTMAP+32                                                02854000
CVTPCNVT EQU   CVTMAP+28                                                02855000
CVT0VL00 EQU   CVTMAP+24                                                02856000
CVTXAPG  EQU   CVTMAP+20                                                02857000
CVTBUF   EQU   CVTMAP+16                                                02858000
CVTJOB   EQU   CVTMAP+12                                                02859000
CVTLINK  EQU   CVTMAP+8                                                 02860000
CVT0EF00 EQU   CVTMAP+4                                                 02861000
CVTTCBP  EQU   CVTMAP                                                   02862000
CVT      EQU   CVTMAP                                                   02863000
@NM00062 EQU   TCBXTNT2+32                                              02864000
TCBRV181 EQU   TCBRV173                                                 02865000
TCBRV180 EQU   TCBRV173                                                 02866000
TCBRV179 EQU   TCBRV173                                                 02867000
TCBRV178 EQU   TCBRV173                                                 02868000
TCBRV177 EQU   TCBRV173                                                 02869000
TCBRV176 EQU   TCBRV173                                                 02870000
TCBRV175 EQU   TCBRV173                                                 02871000
TCBRV174 EQU   TCBRV173                                                 02872000
TCBRV172 EQU   TCBRV164                                                 02873000
TCBRV171 EQU   TCBRV164                                                 02874000
TCBRV170 EQU   TCBRV164                                                 02875000
TCBRV169 EQU   TCBRV164                                                 02876000
TCBRV168 EQU   TCBRV164                                                 02877000
TCBRV167 EQU   TCBRV164                                                 02878000
TCBRV166 EQU   TCBRV164                                                 02879000
TCBRV165 EQU   TCBRV164                                                 02880000
TCBRV163 EQU   TCBRV155                                                 02881000
TCBRV162 EQU   TCBRV155                                                 02882000
TCBRV161 EQU   TCBRV155                                                 02883000
TCBRV160 EQU   TCBRV155                                                 02884000
TCBRV159 EQU   TCBRV155                                                 02885000
TCBRV158 EQU   TCBRV155                                                 02886000
TCBRV157 EQU   TCBRV155                                                 02887000
TCBRV156 EQU   TCBRV155                                                 02888000
TCBRV154 EQU   TCBRV146                                                 02889000
TCBRV153 EQU   TCBRV146                                                 02890000
TCBRV152 EQU   TCBRV146                                                 02891000
TCBRV151 EQU   TCBRV146                                                 02892000
TCBRV150 EQU   TCBRV146                                                 02893000
TCBRV149 EQU   TCBRV146                                                 02894000
TCBRV148 EQU   TCBRV146                                                 02895000
TCBRV147 EQU   TCBRV146                                                 02896000
TCBRV145 EQU   TCBXTNT2+26                                              02897000
TCBRV144 EQU   TCBXTNT2+24                                              02898000
TCBRV143 EQU   TCBXTNT2+20                                              02899000
TCBRV142 EQU   TCBXTNT2+16                                              02900000
TCBRSV49 EQU   TCBXTNT2+12                                              02901000
TCBEVENT EQU   TCBXTNT2+8                                               02902000
TCBRCMP  EQU   TCBXTNT2+5                                               02903000
TCBRSVAB EQU   TCBXTNT2+4                                               02904000
TCBGTFA  EQU   TCBGTF+1                                                 02905000
TCBRSV47 EQU   TCBTFLG                                                  02906000
TCBRSV46 EQU   TCBTFLG                                                  02907000
TCBRSV45 EQU   TCBTFLG                                                  02908000
TCBRSV44 EQU   TCBTFLG                                                  02909000
TCBRSV43 EQU   TCBTFLG                                                  02910000
TCBDSPIT EQU   TCBTFLG                                                  02911000
TCBERRTN EQU   TCBTFLG                                                  02912000
TCBASYNC EQU   TCBTFLG                                                  02913000
@NM00061 EQU   TCB+296                                                  02914000
TCBSVCA2 EQU   TCB+292                                                  02915000
TCBSWASA EQU   TCB+288                                                  02916000
TCBDBTB  EQU   TCB+284                                                  02917000
TCBRPT   EQU   TCB+280                                                  02918000
TCBRV141 EQU   TCBRV133                                                 02919000
TCBRV140 EQU   TCBRV133                                                 02920000
TCBRV139 EQU   TCBRV133                                                 02921000
TCBRV138 EQU   TCBRV133                                                 02922000
TCBRV137 EQU   TCBRV133                                                 02923000
TCBRV136 EQU   TCBRV133                                                 02924000
TCBRV135 EQU   TCBRV133                                                 02925000
TCBRV134 EQU   TCBRV133                                                 02926000
TCBRV132 EQU   TCBRV124                                                 02927000
TCBRV131 EQU   TCBRV124                                                 02928000
TCBRV130 EQU   TCBRV124                                                 02929000
TCBRV129 EQU   TCBRV124                                                 02930000
TCBRV128 EQU   TCBRV124                                                 02931000
TCBRV127 EQU   TCBRV124                                                 02932000
TCBRV126 EQU   TCBRV124                                                 02933000
TCBRV125 EQU   TCBRV124                                                 02934000
TCBRV123 EQU   TCBFBYT2                                                 02935000
TCBRV122 EQU   TCBFBYT2                                                 02936000
TCBECBNV EQU   TCBFBYT2                                                 02937000
TCBSSSYN EQU   TCBFBYT2                                                 02938000
TCBFPRAP EQU   TCBFBYT2                                                 02939000
TCBFDW   EQU   TCBFBYT2                                                 02940000
TCBFMW   EQU   TCBFBYT2                                                 02941000
TCBCNCB  EQU   TCBFBYT2                                                 02942000
TCBLLH   EQU   TCBFBYT1                                                 02943000
TCBRV113 EQU   TCBFBYT1                                                 02944000
TCBEOT   EQU   TCBFBYT1                                                 02945000
TCBRTM2  EQU   TCBFBYT1                                                 02946000
TCBPGNLY EQU   TCBFBYT1                                                 02947000
TCBNDIOS EQU   TCBFBYT1                                                 02948000
TCBACTIV EQU   TCBFBYT1                                                 02949000
TCBEOTFM EQU   TCBFBYT1                                                 02950000
TCBAFFN  EQU   TCB+274                                                  02951000
TCBCCPVI EQU   TCB+272                                                  02952000
TCBUKYSP EQU   TCB+268                                                  02953000
TCBMODE  EQU   TCBESTAE+3                                               02954000
TCBERTYP EQU   TCBESTAE+2                                               02955000
TCBRV314 EQU   TCBESTRM                                                 02956000
TCBRV313 EQU   TCBESTRM                                                 02957000
TCBRV312 EQU   TCBESTRM                                                 02958000
TCBRV311 EQU   TCBESTRM                                                 02959000
TCBRV310 EQU   TCBESTRM                                                 02960000
TCBRV309 EQU   TCBESTRM                                                 02961000
TCBRV308 EQU   TCBESTRM                                                 02962000
TCBETERM EQU   TCBESTRM                                                 02963000
TCBSCBKY EQU   TCBESTAE                                                 02964000
TCBRTM12 EQU   TCB+260                                                  02965000
TCBTCBID EQU   TCB+256                                                  02966000
TCBRSV96 EQU   TCB+252                                                  02967000
TCBSWA   EQU   TCB+248                                                  02968000
TCBFOEA  EQU   TCBFOE+1                                                 02969000
TCBRSV42 EQU   TCBFOE                                                   02970000
TCBRV306 EQU   TCB+240                                                  02971000
TCBRSV41 EQU   TCB+239                                                  02972000
TCBTID   EQU   TCB+238                                                  02973000
TCBRSVAA EQU   TCB+237                                                  02974000
TCBABCUR EQU   TCB+236                                                  02975000
TCBTMSAV EQU   TCB+232                                                  02976000
TCBIOTIM EQU   TCB+228                                                  02977000
TCBRTWA  EQU   TCB+224                                                  02978000
TCBBACK  EQU   TCB+220                                                  02979000
TCBTIRB  EQU   TCB+216                                                  02980000
TCBAECB  EQU   TCB+212                                                  02981000
TCBEXT2A EQU   TCBEXT2+1                                                02982000
TCBRSV39 EQU   TCBEXT2                                                  02983000
TCBSTMCT EQU   TCB+207                                                  02984000
TCBSYSCT EQU   TCB+206                                                  02985000
TCBRSV37 EQU   TCB+205                                                  02986000
TCBEXSVC EQU   TCBDAR                                                   02987000
TCBDARMS EQU   TCBDAR                                                   02988000
TCBDARWT EQU   TCBDAR                                                   02989000
TCBDARO  EQU   TCBDAR                                                   02990000
TCBDARMC EQU   TCBDARC                                                  02991000
TCBDARD  EQU   TCBDAR                                                   02992000
TCBDARS  EQU   TCBDAR                                                   02993000
TCBDARP  EQU   TCBDAR                                                   02994000
TCBGTOFM EQU   TCBFLGS7                                                 02995000
TCBADMP  EQU   TCBFLGS7                                                 02996000
TCBRSTSK EQU   TCBFLGS7                                                 02997000
TCBSVCS  EQU   TCBFLGS7                                                 02998000
TCBSTACK EQU   TCBFLGS7                                                 02999000
TCBRSV34 EQU   TCBFLGS7                                                 03000000
TCBRSV33 EQU   TCBFLGS7                                                 03001000
TCBGPECB EQU   TCBFLGS7                                                 03002000
TCBNTJS  EQU   TCBFLGS6                                                 03003000
TCBAPG   EQU   TCBFLGS6                                                 03004000
TCBMIGR  EQU   TCBFLGS6                                                 03005000
TCBRV303 EQU   TCBFLGS6                                                 03006000
TCBSPVLK EQU   TCBFLGS6                                                 03007000
TCBCPU   EQU   TCBFLGS6                                                 03008000
TCBPIE17 EQU   TCBFLGS6                                                 03009000
TCBRV    EQU   TCBFLGS6                                                 03010000
TCBRSV79 EQU   TCBNDSP5                                                 03011000
TCBRSV78 EQU   TCBNDSP5                                                 03012000
TCBRSV77 EQU   TCBNDSP5                                                 03013000
TCBRSV76 EQU   TCBNDSP5                                                 03014000
TCBRSV75 EQU   TCBNDSP5                                                 03015000
TCBRSV74 EQU   TCBNDSP5                                                 03016000
TCBRSV95 EQU   TCBNDSP5                                                 03017000
TCBRSV94 EQU   TCBNDSP5                                                 03018000
TCBRSV93 EQU   TCBNDSP4                                                 03019000
TCBRSV92 EQU   TCBNDSP4                                                 03020000
TCBRSV91 EQU   TCBNDSP4                                                 03021000
TCBRSV90 EQU   TCBNDSP4                                                 03022000
TCBRSV89 EQU   TCBNDSP4                                                 03023000
TCBRSV88 EQU   TCBNDSP4                                                 03024000
TCBRSV87 EQU   TCBNDSP4                                                 03025000
TCBRSV86 EQU   TCBNDSP4                                                 03026000
TCBEXT1A EQU   TCBEXT1+1                                                03027000
TCBRSV32 EQU   TCBEXT1                                                  03028000
TCBEXCPD EQU   TCB+192                                                  03029000
TCBIOBRC EQU   TCB+188                                                  03030000
TCBDDWTC EQU   TCB+186                                                  03031000
TCBDDEXC EQU   TCB+184                                                  03032000
TCBJSCBB EQU   TCBJSCB+1                                                03033000
@NM00060 EQU   TCBRECDE                                                 03034000
TCBREC   EQU   TCBRECDE                                                 03035000
TCBMDIDS EQU   TCB+176                                                  03036000
TCBNDINT EQU   TCBNDSP3                                                 03037000
TCBRSV27 EQU   TCBNDSP3                                                 03038000
TCBRSV26 EQU   TCBNDSP3                                                 03039000
TCBRSV25 EQU   TCBNDSP3                                                 03040000
TCBRSV24 EQU   TCBNDSP3                                                 03041000
TCBSRBND EQU   TCBNDSP3                                                 03042000
TCBRV302 EQU   TCBNDSP3                                                 03043000
TCBLJSND EQU   TCBNDSP3                                                 03044000
TCBABE   EQU   TCBNDSP2                                                 03045000
TCBDSS   EQU   TCBNDSP2                                                 03046000
TCBOWAIT EQU   TCBNDSP2                                                 03047000
TCBIWAIT EQU   TCBNDSP2                                                 03048000
TCBNDTS  EQU   TCBNDSP2                                                 03049000
TCBNDSVC EQU   TCBNDSP2                                                 03050000
TCBSTPP  EQU   TCBNDSP2                                                 03051000
TCBABD   EQU   TCBNDSP2                                                 03052000
TCBRSV22 EQU   TCBNDSP1                                                 03053000
TCBPIEND EQU   TCBNDSP1                                                 03054000
TCBTPSP  EQU   TCBNDSP1                                                 03055000
TCBDDRND EQU   TCBNDSP1                                                 03056000
TCBRSPND EQU   TCBNDSP1                                                 03057000
TCBRSTND EQU   TCBNDSP1                                                 03058000
TCBDARPN EQU   TCBNDSP1                                                 03059000
TCBDARTN EQU   TCBNDSP1                                                 03060000
TCBNDSP0 EQU   TCBNDSP                                                  03061000
TCBUSER  EQU   TCB+168                                                  03062000
TCBTCTB  EQU   TCBTCT+1                                                 03063000
TCBRSV9C EQU   TCBTCTGF                                                 03064000
TCBRSV9B EQU   TCBTCTGF                                                 03065000
TCBRSV9A EQU   TCBTCTGF                                                 03066000
TCBRSV99 EQU   TCBTCTGF                                                 03067000
TCBRSV98 EQU   TCBTCTGF                                                 03068000
TCBRSV97 EQU   TCBTCTGF                                                 03069000
TCBRSV20 EQU   TCBTCTGF                                                 03070000
TCBSMFGF EQU   TCBTCTGF                                                 03071000
TCBSTABB EQU   TCBSTAB+1                                                03072000
TCBSTCUR EQU   TCBNSTAE                                                 03073000
TCBRV301 EQU   TCBNSTAE                                                 03074000
TCBSYNCH EQU   TCBNSTAE                                                 03075000
TCBHALT  EQU   TCBNSTAE                                                 03076000
TCBPPSUP EQU   TCBNSTAE                                                 03077000
TCB33E   EQU   TCBNSTAE                                                 03078000
TCBQUIES EQU   TCBNSTAE                                                 03079000
TCBSTABE EQU   TCBNSTAE                                                 03080000
TCBAQE   EQU   TCB+156                                                  03081000
TCBPQE   EQU   TCB+152                                                  03082000
TCBTSDP  EQU   TCB+151                                                  03083000
TCBTSLP  EQU   TCB+150                                                  03084000
TCBSTPCT EQU   TCB+149                                                  03085000
TCBCPUBN EQU   TCBTSFLG                                                 03086000
TCBDYDSP EQU   TCBTSFLG                                                 03087000
TCBRSV18 EQU   TCBTSFLG                                                 03088000
TCBRSV17 EQU   TCBTSFLG                                                 03089000
TCBTIOTG EQU   TCBTSFLG                                                 03090000
TCBATT   EQU   TCBTSFLG                                                 03091000
TCBSTPPR EQU   TCBTSFLG                                                 03092000
TCBRV300 EQU   TCBTSTSK                                                 03093000
TCBECB   EQU   TCB+144                                                  03094000
TCBIQE   EQU   TCB+140                                                  03095000
TCBLTC   EQU   TCB+136                                                  03096000
TCBOTC   EQU   TCB+132                                                  03097000
TCBNTC   EQU   TCB+128                                                  03098000
TCBJSTCA EQU   TCBJSTCB+1                                               03099000
TCBRSV16 EQU   TCBJSTCB                                                 03100000
TCBTQET  EQU   TCBTME                                                   03101000
TCBTCB   EQU   TCB+116                                                  03102000
TCBFSAB  EQU   TCBFSA+1                                                 03103000
TCBQEL   EQU   TCBFSA                                                   03104000
TCBGRS15 EQU   TCBGRS+60                                                03105000
TCBGRS14 EQU   TCBGRS+56                                                03106000
TCBGRS13 EQU   TCBGRS+52                                                03107000
TCBGRS12 EQU   TCBGRS+48                                                03108000
TCBGRS11 EQU   TCBGRS+44                                                03109000
TCBGRS10 EQU   TCBGRS+40                                                03110000
TCBGRS9  EQU   TCBGRS+36                                                03111000
TCBGRS8  EQU   TCBGRS+32                                                03112000
TCBGRS7  EQU   TCBGRS+28                                                03113000
TCBGRS6  EQU   TCBGRS+24                                                03114000
TCBGRS5  EQU   TCBGRS+20                                                03115000
TCBGRS4  EQU   TCBGRS+16                                                03116000
TCBGRS3  EQU   TCBGRS+12                                                03117000
TCBGRS2  EQU   TCBGRS+8                                                 03118000
TCBGRS1  EQU   TCBGRS+4                                                 03119000
TCBGRS0  EQU   TCBGRS                                                   03120000
TCBJPQB  EQU   TCBJPQ+1                                                 03121000
TCBRSV15 EQU   TCBPURGE                                                 03122000
TCBRSV14 EQU   TCBPURGE                                                 03123000
TCBRSV13 EQU   TCBPURGE                                                 03124000
TCBRSV12 EQU   TCBPURGE                                                 03125000
TCBRSV11 EQU   TCBPURGE                                                 03126000
TCBRSV10 EQU   TCBPURGE                                                 03127000
TCBRSV09 EQU   TCBPURGE                                                 03128000
TCBJPQF  EQU   TCBPURGE                                                 03129000
TCBJLB   EQU   TCB+40                                                   03130000
TCBLLS   EQU   TCB+36                                                   03131000
TCBDSP   EQU   TCB+35                                                   03132000
TCBLMP   EQU   TCB+34                                                   03133000
TCBPNDSP EQU   TCBFLGS5                                                 03134000
TCBFCD1  EQU   TCBFLGS5                                                 03135000
TCBSTP   EQU   TCBFLGS5                                                 03136000
TCBSYS   EQU   TCBFLGS5                                                 03137000
TCBANDSP EQU   TCBFLGS5                                                 03138000
TCBPAGE  EQU   TCBFLGS5                                                 03139000
TCBUXNDF EQU   TCBABWF                                                  03140000
TCBFC    EQU   TCBFLGS5                                                 03141000
TCBONDSP EQU   TCBFLGS4                                                 03142000
TCBMPCND EQU   TCBFLGS4                                                 03143000
TCBMPCVQ EQU   TCBFLGS4                                                 03144000
TCBUXNDV EQU   TCBFLGS4                                                 03145000
TCBHNDSP EQU   TCBFLGS4                                                 03146000
TCBRQENA EQU   TCBFLGS4                                                 03147000
TCBSER   EQU   TCBFLGS4                                                 03148000
TCBNDUMP EQU   TCBFLGS4                                                 03149000
TCBDWSTA EQU   TCBFLGS3                                                 03150000
TCBRSV08 EQU   TCBFLGS3                                                 03151000
TCBRSV07 EQU   TCBFLGS3                                                 03152000
TCBRSV06 EQU   TCBFLGS3                                                 03153000
TCBABGM  EQU   TCBFLGS3                                                 03154000
TCBABTRM EQU   TCBFLGS3                                                 03155000
TCBADINP EQU   TCBFLGS3                                                 03156000
TCBFSM   EQU   TCBFLGS3                                                 03157000
TCBFTS   EQU   TCBFLGS2                                                 03158000
TCBFETXR EQU   TCBFLGS2                                                 03159000
TCBFDSOP EQU   TCBFLGS2                                                 03160000
TCBFJMC  EQU   TCBFLGS2                                                 03161000
TCBFSMC  EQU   TCBFLGS2                                                 03162000
TCBFABOP EQU   TCBFLGS2                                                 03163000
TCBFSTI  EQU   TCBFLGS2                                                 03164000
TCBFOINP EQU   TCBFLGS2                                                 03165000
TCBFX    EQU   TCBFLGS1                                                 03166000
TCBFS    EQU   TCBFLGS1                                                 03167000
TCBFT    EQU   TCBFLGS1                                                 03168000
TCBPDUMP EQU   TCBFLGS1                                                 03169000
TCBNONPR EQU   TCBFLGS1                                                 03170000
TCBFERA  EQU   TCBFLGS1                                                 03171000
TCBFE    EQU   TCBFLGS1                                                 03172000
TCBFA    EQU   TCBFLGS1                                                 03173000
TCBZERO  EQU   TCBPKF                                                   03174000
TCBFLAG  EQU   TCBPKF                                                   03175000
TCBMSSB  EQU   TCBMSS+1                                                 03176000
TCBRSV03 EQU   TCBMSS                                                   03177000
TCBTRNB  EQU   TCBTRN+1                                                 03178000
TCBRSV02 EQU   TCBABF                                                   03179000
TCBOLTEP EQU   TCBABF                                                   03180000
TCBTCP   EQU   TCBABF                                                   03181000
TCBTCPP  EQU   TCBABF                                                   03182000
TCBRSV01 EQU   TCBABF                                                   03183000
TCBGRPH  EQU   TCBABF                                                   03184000
TCBNOCHK EQU   TCBABF                                                   03185000
TCBMOD91 EQU   TCBABF                                                   03186000
TCBCMPC  EQU   TCBCMP+1                                                 03187000
TCBRV318 EQU   TCBCMSG                                                  03188000
TCBRV317 EQU   TCBCIND                                                  03189000
TCBRV316 EQU   TCBCWTO                                                  03190000
TCBCASID EQU   TCBCDBL                                                  03191000
TCBNOCC  EQU   TCBSTCC                                                  03192000
TCBDMPO  EQU   TCBCPP                                                   03193000
TCBCSTEP EQU   TCBCMPF                                                  03194000
TCBCREQ  EQU   TCBCMPF                                                  03195000
TCBTIO   EQU   TCB+12                                                   03196000
TCBDEB   EQU   TCB+8                                                    03197000
TCBPIEA  EQU   TCBPIE+1                                                 03198000
TCBPM    EQU   TCBPMASK                                                 03199000
@NM00059 EQU   TCBPMASK                                                 03200000
TCBRBP   EQU   TCB                                                      03201000
TCBFRS6  EQU   TCBFRS+24                                                03202000
TCBFRS4  EQU   TCBFRS+16                                                03203000
TCBFRS2  EQU   TCBFRS+8                                                 03204000
TCBFRS0  EQU   TCBFRS                                                   03205000
IQEOUTLM EQU   IQESECT+20                                               03206000
IQEDCB   EQU   IQESECT+16                                               03207000
IQETCBA  EQU   IQETCB+1                                                 03208000
IQESTAT2 EQU   IQETCB                                                   03209000
IQEIRBA  EQU   IQEIRB+1                                                 03210000
@NM00058 EQU   IQEFLAGS                                                 03211000
@NM00057 EQU   IQEFLAGS                                                 03212000
@NM00056 EQU   IQEFLAGS                                                 03213000
@NM00055 EQU   IQEFLAGS                                                 03214000
@NM00054 EQU   IQEFLAGS                                                 03215000
@NM00053 EQU   IQEFLAGS                                                 03216000
@NM00052 EQU   IQEFLAGS                                                 03217000
IQEPURGE EQU   IQEFLAGS                                                 03218000
IQEPARAM EQU   IQESECT+4                                                03219000
IQELNKA  EQU   IQELNK+1                                                 03220000
IQESTAT1 EQU   IQELNK                                                   03221000
SVRBEND  EQU   RBSECT+192                                               03222000
RBFEPARM EQU   RBSECT+168                                               03223000
SIRBEND  EQU   RBSECT+168                                               03224000
RBRSV158 EQU   RBRSV150                                                 03225000
RBRSV157 EQU   RBRSV150                                                 03226000
RBRSV156 EQU   RBRSV150                                                 03227000
RBRSV155 EQU   RBRSV150                                                 03228000
RBRSV154 EQU   RBRSV150                                                 03229000
RBRSV153 EQU   RBRSV150                                                 03230000
RBRSV152 EQU   RBRSV150                                                 03231000
RBRSV151 EQU   RBRSV150                                                 03232000
RBRSV149 EQU   RBSECT+166                                               03233000
RBRSV148 EQU   RBSECT+164                                               03234000
RBRSV169 EQU   RBSDATA+3                                                03235000
RBSID    EQU   RBSDATA+2                                                03236000
RBSPKEY  EQU   RBSDATA+1                                                03237000
RBRSV168 EQU   RBSFLG3                                                  03238000
RBSTERMO EQU   RBSFLG3                                                  03239000
RBSBRNTR EQU   RBSFLG3                                                  03240000
RBSPRNTR EQU   RBSFLG3                                                  03241000
RBSCNCEL EQU   RBSFLG3                                                  03242000
RBSRECRD EQU   RBSFLG3                                                  03243000
RBSTERMI EQU   RBSFLG3                                                  03244000
RBRSV167 EQU   RBSFLG3                                                  03245000
RBSOWNRA EQU   RBSOWNR+1                                                03246000
RBSSUPER EQU   RBSFLGS2                                                 03247000
RBSKEY0  EQU   RBSFLGS2                                                 03248000
RBRSV166 EQU   RBSFLGS2                                                 03249000
RBRSV165 EQU   RBSFLGS2                                                 03250000
RBSINUSE EQU   RBSFLGS2                                                 03251000
RBRSV164 EQU   RBSFLGS2                                                 03252000
RBSXCTL2 EQU   RBSFLGS2                                                 03253000
RBRSV163 EQU   RBSFLGS2                                                 03254000
RBSPARMA EQU   RBSPARM+1                                                03255000
RBSHALT  EQU   RBSIOPRC                                                 03256000
RBSNOIOP EQU   RBSIOPRC                                                 03257000
RBSASYNC EQU   RBSFLGS1                                                 03258000
RBRSV162 EQU   RBSFLGS1                                                 03259000
RBSESTAE EQU   RBSFLGS1                                                 03260000
RBSDUMMY EQU   RBSFLGS1                                                 03261000
RBSSTAR  EQU   RBSFLGS1                                                 03262000
RBSSTAI  EQU   RBSFLGS1                                                 03263000
RBSEXIT  EQU   RBSCBB+4                                                 03264000
RBSCHAIN EQU   RBSCBB                                                   03265000
TIRBEND  EQU   @NM00050+8                                               03266000
PRBEND   EQU   @NM00050+8                                               03267000
RBRSV146 EQU   RBRSV138                                                 03268000
RBRSV145 EQU   RBRSV138                                                 03269000
RBRSV144 EQU   RBRSV138                                                 03270000
RBRSV143 EQU   RBRSV138                                                 03271000
RBRSV142 EQU   RBRSV138                                                 03272000
RBRSV141 EQU   RBRSV138                                                 03273000
RBRSV140 EQU   RBRSV138                                                 03274000
RBRSV139 EQU   RBRSV138                                                 03275000
RBRSV137 EQU   @NM00050+6                                               03276000
RBRSV136 EQU   @NM00050+4                                               03277000
RBRSV135 EQU   @NM00050                                                 03278000
@NM00049 EQU   RBSECT+32                                                03279000
@NM00048 EQU   @NM00046+1                                               03280000
RBSCF    EQU   @NM00047                                                 03281000
RBPGMQ1  EQU   RBPGMQ+1                                                 03282000
@NM00045 EQU   RBPGMQ                                                   03283000
@NM00044 EQU   RBSECT+16                                                03284000
@NM00043 EQU   @NM00039                                                 03285000
@NM00042 EQU   @NM00039                                                 03286000
RBIQETP  EQU   @NM00039                                                 03287000
RBUSIQE  EQU   RBETXR                                                   03288000
RBATTN   EQU   @NM00039                                                 03289000
@NM00041 EQU   @NM00039                                                 03290000
@NM00040 EQU   @NM00039                                                 03291000
RBPMSVRB EQU   @NM00037                                                 03292000
RBATNXIT EQU   @NM00037                                                 03293000
@NM00038 EQU   @NM00037                                                 03294000
RBWAITP  EQU   @NM00037                                                 03295000
RBFNSVRB EQU   RBTRSVRB                                                 03296000
RBFTP    EQU   @NM00037                                                 03297000
RBSIZE   EQU   RBSECT+8                                                 03298000
RBABOPSW EQU   RBSECT+4                                                 03299000
RBPPSAV1 EQU   RBPPSAV+1                                                03300000
@NM00035 EQU   RBPPSAV                                                  03301000
RBPRFXND EQU   RBPREFIX+64                                              03302000
RBINTCOD EQU   RBINTCDA+1                                               03303000
RBINLNTH EQU   RBINTCDA                                                 03304000
RBWCSA   EQU   RBPREFIX+60                                              03305000
RBRSV004 EQU   RBPREFIX+57                                              03306000
RBSSSYN  EQU   RBFLAGS1                                                 03307000
RBSCB    EQU   RBFLAGS1                                                 03308000
RBLONGWT EQU   RBFLAGS1                                                 03309000
RBASIR   EQU   RBFLAGS1                                                 03310000
RBRSV159 EQU   RBFLAGS1                                                 03311000
RBABEND  EQU   RBFLAGS1                                                 03312000
RBXWAIT  EQU   RBFLAGS1                                                 03313000
RBSLOCK  EQU   RBFLAGS1                                                 03314000
RBRTRAN  EQU   RBRTPSW2+4                                               03315000
RBRTINCD EQU   RBRTICIL+2                                               03316000
RBRTILC  EQU   RBRTICIL+1                                               03317000
RBRSV160 EQU   RBRTICIL                                                 03318000
RBRTPSW1 EQU   RBRTOPSW                                                 03319000
RBRSV062 EQU   RBRSV054                                                 03320000
RBRSV061 EQU   RBRSV054                                                 03321000
RBRSV060 EQU   RBRSV054                                                 03322000
RBRSV059 EQU   RBRSV054                                                 03323000
RBRSV058 EQU   RBRSV054                                                 03324000
RBRSV057 EQU   RBRSV054                                                 03325000
RBRSV056 EQU   RBRSV054                                                 03326000
RBRSV055 EQU   RBRSV054                                                 03327000
RBRSV053 EQU   RBPREFIX+38                                              03328000
RBRSV052 EQU   RBPREFIX+36                                              03329000
RBRSV051 EQU   RBPREFIX+32                                              03330000
RBPRFXST EQU   RBPREFIX+32                                              03331000
RBRSV050 EQU   RBPREFIX+28                                              03332000
RBRSV049 EQU   RBRSV041                                                 03333000
RBRSV048 EQU   RBRSV041                                                 03334000
RBRSV047 EQU   RBRSV041                                                 03335000
RBRSV046 EQU   RBRSV041                                                 03336000
RBRSV045 EQU   RBRSV041                                                 03337000
RBRSV044 EQU   RBRSV041                                                 03338000
RBRSV043 EQU   RBRSV041                                                 03339000
RBRSV042 EQU   RBRSV041                                                 03340000
RBRSV040 EQU   RBPREFIX+26                                              03341000
RBRSV039 EQU   RBPREFIX+24                                              03342000
RBRSV038 EQU   RBPREFIX+20                                              03343000
RBRSV037 EQU   RBPREFIX+16                                              03344000
RBRSV036 EQU   RBRSV028                                                 03345000
RBRSV035 EQU   RBRSV028                                                 03346000
RBRSV034 EQU   RBRSV028                                                 03347000
RBRSV033 EQU   RBRSV028                                                 03348000
RBRSV032 EQU   RBRSV028                                                 03349000
RBRSV031 EQU   RBRSV028                                                 03350000
RBRSV030 EQU   RBRSV028                                                 03351000
RBRSV029 EQU   RBRSV028                                                 03352000
RBRSV027 EQU   RBRSV019                                                 03353000
RBRSV026 EQU   RBRSV019                                                 03354000
RBRSV025 EQU   RBRSV019                                                 03355000
RBRSV024 EQU   RBRSV019                                                 03356000
RBRSV023 EQU   RBRSV019                                                 03357000
RBRSV022 EQU   RBRSV019                                                 03358000
RBRSV021 EQU   RBRSV019                                                 03359000
RBRSV020 EQU   RBRSV019                                                 03360000
RBRSV018 EQU   RBPREFIX+13                                              03361000
RBRSV017 EQU   RBPREFIX+12                                              03362000
RBSRV016 EQU   RBPREFIX+11                                              03363000
RBRSV015 EQU   RBPREFIX+10                                              03364000
RBRSV014 EQU   RBPREFIX+8                                               03365000
RBRSV013 EQU   RBPREFIX+4                                               03366000
RBRSV012 EQU   RBPREFIX                                                 03367000
RBEXSAVE EQU   XRBESA                                                   03368000
XRBREG15 EQU   RBGRS15                                                  03369000
XRBREG14 EQU   RBGRS14                                                  03370000
XRBREG13 EQU   RBGRS13                                                  03371000
XRBREG12 EQU   RBGRS12                                                  03372000
XRBREG11 EQU   RBGRS11                                                  03373000
XRBREG10 EQU   RBGRS10                                                  03374000
XRBREG9  EQU   RBGRS9                                                   03375000
XRBREG8  EQU   RBGRS8                                                   03376000
XRBREG7  EQU   RBGRS7                                                   03377000
XRBREG6  EQU   RBGRS6                                                   03378000
XRBREG5  EQU   RBGRS5                                                   03379000
XRBREG4  EQU   RBGRS4                                                   03380000
XRBREG3  EQU   RBGRS3                                                   03381000
XRBREG2  EQU   RBGRS2                                                   03382000
XRBREG1  EQU   RBGRS1                                                   03383000
XRBREG0  EQU   RBGRS0                                                   03384000
XRBLNKA  EQU   RBLINKB                                                  03385000
XRBWT    EQU   RBWCF                                                    03386000
@NM00034 EQU   RBBASIC+24                                               03387000
RBOPSWPS EQU   RBOPSWB2                                                 03388000
@NM00033 EQU   RBOPSWB2                                                 03389000
@NM00032 EQU   XRBPSW                                                   03390000
@NM00031 EQU   RBBASIC+12                                               03391000
XRBWAIT  EQU   RBECBWT                                                  03392000
XRBFRRB  EQU   RBFDYN                                                   03393000
@NM00030 EQU   XSTAB2                                                   03394000
XRBACTV  EQU   RBFACTV                                                  03395000
XRBTCBP  EQU   RBTCBNXT                                                 03396000
@NM00029 EQU   XSTAB1                                                   03397000
XRBCKPT  EQU   RBFTCKPT                                                 03398000
@NM00028 EQU   XSTAB1                                                   03399000
@NM00027 EQU   RBBASIC+8                                                03400000
@NM00026 EQU   RBEXRTNM+1                                               03401000
RBTMIND3 EQU   RBTMFLD                                                  03402000
RBTMIND2 EQU   RBTMFLD                                                  03403000
RBTMCMP  EQU   RBTMFLD                                                  03404000
RBWLIM   EQU   RBTMFLD                                                  03405000
RBRSV005 EQU   RBTMFLD                                                  03406000
RBTMTOD  EQU   RBTMFLD                                                  03407000
RBTMQUE  EQU   RBTMFLD                                                  03408000
@NM00025 EQU   RBPRFX                                                   03409000
ASXBEND  EQU   ASXB+232                                                 03410000
ASXBRV25 EQU   ASXB+228                                                 03411000
ASXBRV24 EQU   ASXB+224                                                 03412000
ASXBPT0E EQU   ASXB+220                                                 03413000
ASXBCRB4 EQU   ASXBCASW+3                                               03414000
ASXBCRB3 EQU   ASXBCASW+2                                               03415000
ASXBCRB2 EQU   ASXBCASW+1                                               03416000
ASXBCR06 EQU   ASXBCRB1                                                 03417000
ASXBCR05 EQU   ASXBCRB1                                                 03418000
ASXBCR04 EQU   ASXBCRB1                                                 03419000
ASXBCR03 EQU   ASXBCRB1                                                 03420000
ASXBCR02 EQU   ASXBCRB1                                                 03421000
ASXBCR01 EQU   ASXBCRB1                                                 03422000
ASXBTFD  EQU   ASXBCRB1                                                 03423000
ASXBPIP  EQU   ASXBCRB1                                                 03424000
ASXBCTDC EQU   ASXB+212                                                 03425000
ASXBTDCB EQU   ASXB+208                                                 03426000
ASXBRV19 EQU   ASXB+204                                                 03427000
ASXBRV18 EQU   ASXB+200                                                 03428000
ASXBRV17 EQU   ASXB+196                                                 03429000
ASXBRV16 EQU   ASXB+192                                                 03430000
ASXBLSRB EQU   ASXBAEQ+20                                               03431000
ASXBFSRB EQU   ASXBAEQ+16                                               03432000
ASXBLRQE EQU   ASXBAEQ+12                                               03433000
ASXBFRQE EQU   ASXBAEQ+8                                                03434000
ASXBLIQE EQU   ASXBAEQ+4                                                03435000
ASXBFIQE EQU   ASXBAEQ                                                  03436000
ASXBETSK EQU   ASXB+164                                                 03437000
ASXBSIRB EQU   ASXB+160                                                 03438000
ASXBPSWD EQU   ASXB+152                                                 03439000
ASXBPRG  EQU   ASXB+136                                                 03440000
ASXBRV26 EQU   ASXB+132                                                 03441000
ASXBOUSB EQU   ASXB+128                                                 03442000
ASXBDDR  EQU   ASXB+124                                                 03443000
ASXBRCTD EQU   ASXB+120                                                 03444000
ASXBRSMD EQU   ASXB+116                                                 03445000
ASXBSPSA EQU   ASXB+112                                                 03446000
ASXBFRWA EQU   ASXB+108                                                 03447000
ASXBFLSA EQU   ASXB+36                                                  03448000
ASXBIHSA EQU   ASXB+32                                                  03449000
ASXBRV15 EQU   ASXB+28                                                  03450000
ASXBRV14 EQU   ASXB+24                                                  03451000
ASXBLWA  EQU   ASXB+20                                                  03452000
ASXBMPST EQU   ASXB+16                                                  03453000
ASXBRS00 EQU   ASXB+14                                                  03454000
ASXBTCBS EQU   ASXB+12                                                  03455000
ASXBLTCB EQU   ASXB+8                                                   03456000
ASXBFTCB EQU   ASXB+4                                                   03457000
ASXBASXB EQU   ASXB                                                     03458000
ASXBEGIN EQU   ASXB                                                     03459000
ASCBEND  EQU   ASCB+208                                                 03460000
ASCBSRBT EQU   ASCB+200                                                 03461000
ASCBSWTL EQU   ASCB+196                                                 03462000
ASCBRS14 EQU   ASCB+195                                                 03463000
ASCBSMCT EQU   ASCB+194                                                 03464000
ASCBRS12 EQU   ASCB+192                                                 03465000
ASCBPCTT EQU   ASCB+188                                                 03466000
ASCBVGTT EQU   ASCB+184                                                 03467000
ASCBRV43 EQU   ASCBSRQ4                                                 03468000
ASCBRV42 EQU   ASCBSRQ4                                                 03469000
ASCBRV41 EQU   ASCBSRQ4                                                 03470000
ASCBRV40 EQU   ASCBSRQ4                                                 03471000
ASCBRV39 EQU   ASCBSRQ4                                                 03472000
ASCBRV38 EQU   ASCBSRQ4                                                 03473000
ASCBRV37 EQU   ASCBSRQ4                                                 03474000
ASCBRV36 EQU   ASCBSRQ4                                                 03475000
ASCBRV35 EQU   ASCBSRQ3                                                 03476000
ASCBRV34 EQU   ASCBSRQ3                                                 03477000
ASCBRV33 EQU   ASCBSRQ3                                                 03478000
ASCBRV32 EQU   ASCBSRQ3                                                 03479000
ASCBRV31 EQU   ASCBSRQ3                                                 03480000
ASCBRV30 EQU   ASCBSRQ3                                                 03481000
ASCBRV29 EQU   ASCBSRQ3                                                 03482000
ASCBRV28 EQU   ASCBSRQ3                                                 03483000
ASCBRV27 EQU   ASCBSRQ2                                                 03484000
ASCBRV26 EQU   ASCBSRQ2                                                 03485000
ASCBRV25 EQU   ASCBSRQ2                                                 03486000
ASCBRV24 EQU   ASCBSRQ2                                                 03487000
ASCBRV23 EQU   ASCBSRQ2                                                 03488000
ASCBRV22 EQU   ASCBSRQ2                                                 03489000
ASCBRV21 EQU   ASCBSRQ2                                                 03490000
ASCBRV20 EQU   ASCBSRQ2                                                 03491000
ASCBRV19 EQU   ASCBSRQ1                                                 03492000
ASCBRV18 EQU   ASCBSRQ1                                                 03493000
ASCBRV17 EQU   ASCBSRQ1                                                 03494000
ASCBRV16 EQU   ASCBSRQ1                                                 03495000
ASCBRV15 EQU   ASCBSRQ1                                                 03496000
ASCBRV14 EQU   ASCBSRQ1                                                 03497000
ASCBRV13 EQU   ASCBSRQ1                                                 03498000
ASCBSTA  EQU   ASCBSRQ1                                                 03499000
ASCBJBNS EQU   ASCB+176                                                 03500000
ASCBJBNI EQU   ASCB+172                                                 03501000
ASCBMCC  EQU   ASCB+168                                                 03502000
ASCBRTWA EQU   ASCB+164                                                 03503000
ASCBIQEA EQU   ASCB+160                                                 03504000
ASCBXMPQ EQU   ASCB+156                                                 03505000
ASCBRS01 EQU   ASCB+154                                                 03506000
ASCBFMCT EQU   ASCB+152                                                 03507000
ASCBOUXB EQU   ASCB+148                                                 03508000
ASCBOUCB EQU   ASCB+144                                                 03509000
ASCBMECB EQU   ASCB+140                                                 03510000
ASCBQECB EQU   ASCB+136                                                 03511000
ASCBLSQH EQU   ASCBLKGP+4                                               03512000
ASCBLOCK EQU   ASCBLKGP                                                 03513000
ASCBTCBS EQU   ASCB+124                                                 03514000
ASCBNVSC EQU   ASCB+122                                                 03515000
ASCBVSC  EQU   ASCB+120                                                 03516000
ASCBSRBS EQU   ASCB+118                                                 03517000
ASCBSSRB EQU   ASCB+116                                                 03518000
ASCBRV06 EQU   ASCBFLG2                                                 03519000
ASCBRV05 EQU   ASCBFLG2                                                 03520000
ASCBRV04 EQU   ASCBFLG2                                                 03521000
ASCBSNQS EQU   ASCBFLG2                                                 03522000
ASCBS2S  EQU   ASCBFLG2                                                 03523000
ASCBCEXT EQU   ASCBFLG2                                                 03524000
ASCBPXMT EQU   ASCBFLG2                                                 03525000
ASCBXMPT EQU   ASCBFLG2                                                 03526000
ASCBRF07 EQU   ASCBDSP1                                                 03527000
ASCBRF06 EQU   ASCBDSP1                                                 03528000
ASCBRF05 EQU   ASCBDSP1                                                 03529000
ASCBRF04 EQU   ASCBDSP1                                                 03530000
ASCBRF03 EQU   ASCBDSP1                                                 03531000
ASCBRF02 EQU   ASCBDSP1                                                 03532000
ASCBFAIL EQU   ASCBDSP1                                                 03533000
ASCBNOQ  EQU   ASCBDSP1                                                 03534000
ASCBSWCT EQU   ASCB+112                                                 03535000
ASCBASXB EQU   ASCB+108                                                 03536000
ASCBTMCH EQU   ASCB+104                                                 03537000
ASCBNSWP EQU   ASCBFLG1                                                 03538000
ASCBTYP1 EQU   ASCBFLG1                                                 03539000
ASCBSTND EQU   ASCBFLG1                                                 03540000
ASCBABNT EQU   ASCBFLG1                                                 03541000
ASCBTERM EQU   ASCBFLG1                                                 03542000
ASCBS3S  EQU   ASCBFLG1                                                 03543000
ASCBCMSH EQU   ASCBFLG1                                                 03544000
ASCBTOFF EQU   ASCBFLG1                                                 03545000
ASCBRF01 EQU   ASCBRCTF                                                 03546000
ASCBTMLW EQU   ASCBRCTF                                                 03547000
ASCBOUT  EQU   ASCBRCTF                                                 03548000
ASCBWAIT EQU   ASCBRCTF                                                 03549000
ASCBRV08 EQU   ASCBRCTF                                                 03550000
ASCBFQU  EQU   ASCBRCTF                                                 03551000
ASCBFRS  EQU   ASCBRCTF                                                 03552000
ASCBTMNO EQU   ASCBRCTF                                                 03553000
ASCBAFFN EQU   ASCBFW1                                                  03554000
ASCBDUMP EQU   ASCB+96                                                  03555000
ASCBQSVC EQU   ASCB+92                                                  03556000
ASCBUBET EQU   ASCB+88                                                  03557000
ASCBECB  EQU   ASCB+84                                                  03558000
ASCBJSTL EQU   ASCB+80                                                  03559000
ASCBEWST EQU   ASCB+72                                                  03560000
ASCBEJST EQU   ASCB+64                                                  03561000
ASCBTSB  EQU   ASCB+60                                                  03562000
ASCBCSCB EQU   ASCB+56                                                  03563000
ASCBRSM  EQU   ASCB+52                                                  03564000
ASCBLDA  EQU   ASCB+48                                                  03565000
ASCBSTOR EQU   ASCB+44                                                  03566000
ASCBDP   EQU   ASCB+43                                                  03567000
ASCBRV07 EQU   ASCB+42                                                  03568000
ASCBIOSM EQU   ASCB+40                                                  03569000
ASCBSEQN EQU   ASCB+38                                                  03570000
ASCBASID EQU   ASCB+36                                                  03571000
ASCBCPUS EQU   ASCB+32                                                  03572000
ASCBSPL  EQU   ASCB+28                                                  03573000
ASCBIOSP EQU   ASCB+24                                                  03574000
ASCBSYNC EQU   ASCBSUPC+4                                               03575000
ASCBSVRB EQU   ASCBSUPC                                                 03576000
ASCBCMSF EQU   ASCB+12                                                  03577000
ASCBBWDP EQU   ASCB+8                                                   03578000
ASCBFWDP EQU   ASCB+4                                                   03579000
ASCBASCB EQU   ASCB                                                     03580000
ASCBEGIN EQU   ASCB                                                     03581000
@NM00024 EQU   PSA+3668                                                 03582000
PSASTAK  EQU   PSA+3072                                                 03583000
@NM00023 EQU   PSA+1048                                                 03584000
PSAUSEND EQU   PSA+1048                                                 03585000
PSARV062 EQU   PSA+1044                                                 03586000
PSACDAL  EQU   PSA+1040                                                 03587000
PSAWTCOD EQU   PSA+1036                                                 03588000
PSAATCVT EQU   PSA+1032                                                 03589000
PSAPCPSW EQU   PSA+1024                                                 03590000
PSAPIR2  EQU   PSA+1020                                                 03591000
PSARV059 EQU   PSA+1018                                                 03592000
PSASVC13 EQU   PSA+1016                                                 03593000
PSALSFCC EQU   PSA+1012                                                 03594000
PSASFACC EQU   PSA+1008                                                 03595000
PSASTOP  EQU   PSA+992                                                  03596000
PSASTART EQU   PSA+976                                                  03597000
PSARSPSW EQU   PSA+968                                                  03598000
PSASRPSW EQU   PSA+960                                                  03599000
PSARV045 EQU   PSA+892                                                  03600000
PSARV044 EQU   PSA+888                                                  03601000
PSARV043 EQU   PSA+884                                                  03602000
PSARV042 EQU   PSA+880                                                  03603000
PSARV041 EQU   PSA+876                                                  03604000
PSARV040 EQU   PSA+872                                                  03605000
PSARV025 EQU   PSA+868                                                  03606000
PSADSSED EQU   PSA+868                                                  03607000
PSADSSPR EQU   PSA+864                                                  03608000
PSADSSFW EQU   PSA+860                                                  03609000
PSADSS14 EQU   PSA+856                                                  03610000
PSADSSPP EQU   PSA+848                                                  03611000
PSADSSRP EQU   PSA+840                                                  03612000
PSADSS05 EQU   PSADSSF4                                                 03613000
PSADSS10 EQU   PSADSSF4                                                 03614000
PSADSSVE EQU   PSADSSF4                                                 03615000
PSADSSDE EQU   PSADSSF4                                                 03616000
PSADSSC0 EQU   PSADSSF4                                                 03617000
PSADSSIE EQU   PSADSSF4                                                 03618000
PSADSS12 EQU   PSADSSF4                                                 03619000
PSADSSRC EQU   PSADSSF4                                                 03620000
PSARV057 EQU   PSADSSF3                                                 03621000
PSARV056 EQU   PSADSSF3                                                 03622000
PSARV055 EQU   PSADSSF3                                                 03623000
PSADSSMC EQU   PSADSSF3                                                 03624000
PSADSSRW EQU   PSADSSF3                                                 03625000
PSADSSNM EQU   PSADSSF3                                                 03626000
PSADSSES EQU   PSADSSF3                                                 03627000
PSADSSGP EQU   PSADSSF3                                                 03628000
PSADSSF2 EQU   PSADSSFL+1                                               03629000
PSADSSPI EQU   PSADSSF1                                                 03630000
PSADSSOI EQU   PSADSSF1                                                 03631000
PSADSSSP EQU   PSADSSF1                                                 03632000
PSADSSTP EQU   PSADSSF1                                                 03633000
PSADSSDW EQU   PSADSSF1                                                 03634000
PSADSSDD EQU   PSADSSF1                                                 03635000
PSADSSDM EQU   PSADSSF1                                                 03636000
PSADSSMV EQU   PSADSSF1                                                 03637000
PSADSSTS EQU   PSA+816                                                  03638000
PSADSSWK EQU   PSA+812                                                  03639000
PSADSSR3 EQU   PSA+808                                                  03640000
PSADSSR2 EQU   PSA+804                                                  03641000
PSADSSRS EQU   PSA+800                                                  03642000
PSASTOR  EQU   PSA+796                                                  03643000
PSACPUSA EQU   PSA+794                                                  03644000
PSAVSTAP EQU   PSA+792                                                  03645000
PSAWKVAP EQU   PSA+788                                                  03646000
PSAWKRAP EQU   PSA+784                                                  03647000
PSAMCHIC EQU   PSA+783                                                  03648000
PSARV061 EQU   PSA+782                                                  03649000
PSASYMSK EQU   PSA+781                                                  03650000
PSAMCHFL EQU   PSA+780                                                  03651000
PSACR0   EQU   PSA+776                                                  03652000
PSAPSWSV EQU   PSA+768                                                  03653000
PSALITA  EQU   PSA+764                                                  03654000
PSACLHS  EQU   PSAHLHI                                                  03655000
PSALKR15 EQU   PSALKSA+60                                               03656000
PSALKR14 EQU   PSALKSA+56                                               03657000
PSALKR13 EQU   PSALKSA+52                                               03658000
PSALKR12 EQU   PSALKSA+48                                               03659000
PSALKR11 EQU   PSALKSA+44                                               03660000
PSALKR10 EQU   PSALKSA+40                                               03661000
PSALKR9  EQU   PSALKSA+36                                               03662000
PSALKR8  EQU   PSALKSA+32                                               03663000
PSALKR7  EQU   PSALKSA+28                                               03664000
PSALKR6  EQU   PSALKSA+24                                               03665000
PSALKR5  EQU   PSALKSA+20                                               03666000
PSALKR4  EQU   PSALKSA+16                                               03667000
PSALKR3  EQU   PSALKSA+12                                               03668000
PSALKR2  EQU   PSALKSA+8                                                03669000
PSALKR1  EQU   PSALKSA+4                                                03670000
PSALKR0  EQU   PSALKSA                                                  03671000
PSARV023 EQU   PSACLHT+52                                               03672000
PSALOCAL EQU   PSACLHT+48                                               03673000
PSACMSL  EQU   PSACLHT+44                                               03674000
PSAOPTL  EQU   PSACLHT+40                                               03675000
PSATPACL EQU   PSACLHT+36                                               03676000
PSATPDNL EQU   PSACLHT+32                                               03677000
PSATPNCL EQU   PSACLHT+28                                               03678000
PSAIOSLL EQU   PSACLHT+24                                               03679000
PSAIOSUL EQU   PSACLHT+20                                               03680000
PSAIOSCL EQU   PSACLHT+16                                               03681000
PSAIOSSL EQU   PSACLHT+12                                               03682000
PSASALCL EQU   PSACLHT+8                                                03683000
PSAASML  EQU   PSACLHT+4                                                03684000
PSADISPL EQU   PSACLHT                                                  03685000
PSASRSA  EQU   PSA+636                                                  03686000
PSARV050 EQU   PSA+634                                                  03687000
PSADSSGO EQU   PSA+633                                                  03688000
PSARECUR EQU   PSA+632                                                  03689000
PSAHLHIS EQU   PSA+628                                                  03690000
PSAIPCSA EQU   PSA+624                                                  03691000
@NM00022 EQU   PSA+621                                                  03692000
PSAIPCDM EQU   PSA+620                                                  03693000
PSAIPCD  EQU   PSA+616                                                  03694000
@NM00021 EQU   PSA+613                                                  03695000
PSAIPCRM EQU   PSA+612                                                  03696000
PSAIPCR  EQU   PSA+608                                                  03697000
PSAMCHEX EQU   PSA+600                                                  03698000
PSAMPSW  EQU   PSA+592                                                  03699000
PSAEXPS2 EQU   PSA+584                                                  03700000
PSAEXPS1 EQU   PSA+576                                                  03701000
PSAPIREG EQU   PSA+572                                                  03702000
PSARSREG EQU   PSA+568                                                  03703000
PSAGPREG EQU   PSA+556                                                  03704000
PSARV022 EQU   PSASUP4                                                  03705000
PSARV021 EQU   PSASUP4                                                  03706000
PSARV020 EQU   PSASUP4                                                  03707000
PSARV019 EQU   PSASUP4                                                  03708000
PSARV018 EQU   PSASUP4                                                  03709000
PSARV017 EQU   PSASUP4                                                  03710000
PSARV016 EQU   PSASUP4                                                  03711000
PSARV015 EQU   PSASUP4                                                  03712000
PSARV014 EQU   PSASUP3                                                  03713000
PSARV013 EQU   PSASUP3                                                  03714000
PSARV012 EQU   PSASUP3                                                  03715000
PSARV011 EQU   PSASUP3                                                  03716000
PSASPR   EQU   PSASUP3                                                  03717000
PSAPSREG EQU   PSASUP3                                                  03718000
PSAPI2   EQU   PSASUP3                                                  03719000
PSAIOSUP EQU   PSASUP3                                                  03720000
PSALCR   EQU   PSASUP2                                                  03721000
PSARTM   EQU   PSASUP2                                                  03722000
PSAACR   EQU   PSASUP2                                                  03723000
PSAIPCE2 EQU   PSASUP2                                                  03724000
PSAIPCES EQU   PSASUP2                                                  03725000
PSAIPCEC EQU   PSASUP2                                                  03726000
PSAGTF   EQU   PSASUP2                                                  03727000
PSAIPCRI EQU   PSASUP2                                                  03728000
PSARV063 EQU   PSASUP1                                                  03729000
PSATCTL  EQU   PSASUP1                                                  03730000
PSADISP  EQU   PSASUP1                                                  03731000
PSALOCK  EQU   PSASUP1                                                  03732000
PSAPI    EQU   PSASUP1                                                  03733000
PSAEXT   EQU   PSASUP1                                                  03734000
PSASVC   EQU   PSASUP1                                                  03735000
PSAIO    EQU   PSASUP1                                                  03736000
PSAAOLD  EQU   PSA+548                                                  03737000
PSAANEW  EQU   PSA+544                                                  03738000
PSATOLD  EQU   PSA+540                                                  03739000
PSATNEW  EQU   PSA+536                                                  03740000
PSALCCAR EQU   PSA+532                                                  03741000
PSALCCAV EQU   PSA+528                                                  03742000
PSAPCCAR EQU   PSA+524                                                  03743000
PSAPCCAV EQU   PSA+520                                                  03744000
PSACPULA EQU   PSA+518                                                  03745000
PSACPUPA EQU   PSA+516                                                  03746000
PSAPSA   EQU   PSA+512                                                  03747000
FLCHDEND EQU   PSA+512                                                  03748000
FLCCRSAV EQU   FLCMCLA+280                                              03749000
FLCGRSAV EQU   FLCMCLA+216                                              03750000
FLCFPSAV EQU   FLCMCLA+184                                              03751000
FLCFLA   EQU   FLCMCLA+88                                               03752000
FLCRGNCD EQU   FLCMCLA+84                                               03753000
FLCFSAA  EQU   FLCFSA+1                                                 03754000
@NM00020 EQU   FLCFSA                                                   03755000
@NM00019 EQU   FLCMCLA+72                                               03756000
FLCMCIC  EQU   FLCMCLA+64                                               03757000
@NM00018 EQU   FLCMCLA+20                                               03758000
FLCIOAA  EQU   FLCIOA+1                                                 03759000
@NM00017 EQU   FLCIOA                                                   03760000
@NM00016 EQU   FLCMCLA+15                                               03761000
@NM00015 EQU   FLCMCLA+14                                               03762000
@NM00014 EQU   FLCMCLA+12                                               03763000
FLCLCL   EQU   FLCMCLA+8                                                03764000
FLCIOELA EQU   FLCIOEL+1                                                03765000
@NM00013 EQU   FLCIOEL                                                  03766000
FLCCHNID EQU   FLCMCLA                                                  03767000
@NM00012 EQU   PSA+160                                                  03768000
FLCMTRCD EQU   PSA+157                                                  03769000
@NM00011 EQU   PSA+156                                                  03770000
FLCPERA  EQU   FLCPER+1                                                 03771000
@NM00010 EQU   FLCPER                                                   03772000
@NM00009 EQU   PSA+151                                                  03773000
FLCPERCD EQU   PSA+150                                                  03774000
FLCMCNUM EQU   PSA+149                                                  03775000
@NM00008 EQU   PSA+148                                                  03776000
FLCTEAA  EQU   FLCTEA+1                                                 03777000
@NM00007 EQU   FLCTEA                                                   03778000
PSAPIPC  EQU   PSAPICOD                                                 03779000
PSAPIMC  EQU   PSAPICOD                                                 03780000
PSAPIPER EQU   PSAPICOD                                                 03781000
PSARV049 EQU   FLCPICOD                                                 03782000
FLCPILCB EQU   FLCPIILC                                                 03783000
@NM00006 EQU   FLCPIILC                                                 03784000
@NM00005 EQU   PSAEPPSW                                                 03785000
FLCSVCN  EQU   PSAESPSW+2                                               03786000
FLCSILCB EQU   FLCSVILC                                                 03787000
@NM00004 EQU   FLCSVILC                                                 03788000
@NM00003 EQU   PSAESPSW                                                 03789000
FLCEICOD EQU   PSAEEPSW+2                                               03790000
PSASPAD  EQU   PSAEEPSW                                                 03791000
@NM00002 EQU   PSA+128                                                  03792000
FLCINPSW EQU   PSA+120                                                  03793000
FLCMNPSW EQU   PSA+112                                                  03794000
FLCPNPSW EQU   PSA+104                                                  03795000
FLCSNPSW EQU   PSA+96                                                   03796000
FLCENPSW EQU   PSA+88                                                   03797000
FLCTRACE EQU   PSA+84                                                   03798000
FLCTIMER EQU   PSA+80                                                   03799000
FLCCVT2  EQU   PSA+76                                                   03800000
FLCCAW   EQU   PSA+72                                                   03801000
FLCCSW   EQU   PSA+64                                                   03802000
FLCIOPSW EQU   PSA+56                                                   03803000
FLCMOPSW EQU   PSA+48                                                   03804000
FLCPOPSW EQU   PSA+40                                                   03805000
FLCSOPSW EQU   PSA+32                                                   03806000
FLCEOPSW EQU   PSA+24                                                   03807000
@NM00001 EQU   FLCICCW2+4                                               03808000
FLCCVT   EQU   FLCICCW2                                                 03809000
FLCICCW1 EQU   FLCROPSW                                                 03810000
FLCIPPSW EQU   FLCRNPSW                                                 03811000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03812000
@RT00300 EQU   DEQENQ                                                   03813000
@RF00300 EQU   SCNRDYQ                                                  03814000
@RT00364 EQU   DSPOSTD                                                  03815000
@RT00369 EQU   DSPNORM                                                  03816000
@RT00378 EQU   SSCHECK                                                  03817000
@RT00382 EQU   DEQDSP                                                   03818000
@RT00387 EQU   DEQDSP                                                   03819000
@RT00390 EQU   DSPUSR                                                   03820000
@RT00474 EQU   RUNUSR                                                   03821000
@RF00464 EQU   SSCHECK                                                  03822000
@ENDDATA EQU   *                                                        03823000
         END   ISTAPC52,(C'PLS2227',0702,79172)                         03824000
