         TITLE 'ISTAPM11-PSS INITALIZATION PROCEDURE-VS2'               00001000
* 5735-RC2 COPYRIGHT IBM CORP 1977                                      00002000
* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                           00003000
* REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083                 00004000
ISTAPC11 CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'ISTAPC11  79.094'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00012000
         BALR  @12,0                                               0002 00013000
@PSTART  DS    0H                                                  0002 00014000
         USING @PSTART,@12                                         0002 00015000
RBPRFXLN EQU 64                                                         00016000
RBPRFLNA EQU 32                                                         00017000
PRBLEN   EQU 136                                                        00018000
SIRBLEN  EQU 200                                                        00019000
TIRBLEN  EQU 136                                                        00020000
IRBLEN   EQU 128                                                        00021000
SVRBLEN  EQU 224                                                        00022000
         PRINT OFF                                                      00023000
         PRINT ON                                                       00024000
*   REG12=REG12&BYTOFF;             /* RESET HI ORDER BYTE   @ZM32949*/ 00025000
         N     REG12,@CF03577                                      0299 00026000
*   REG2=REG12;                     /* SAVE BASE REG                 */ 00027000
         LR    REG2,REG12                                          0300 00028000
*   REG3=REG13;                     /* SAVE SAVEAREA PTR             */ 00029000
*                                                                  0301 00030000
         LR    REG3,REG13                                          0301 00031000
*   /*****************************************************************/ 00032000
*   /*                                                               */ 00033000
*   /* REGS 11,12,13,14 ARE CORRUPTED BY SETLOCK                     */ 00034000
*   /*                                                               */ 00035000
*   /*****************************************************************/ 00036000
*                                                                  0302 00037000
*LKLBL:                                                            0302 00038000
*   GEN CODE REFS(PSALITA,FLC,UNLKLBL);                            0302 00039000
LKLBL    DS    0H                                                  0302 00040000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        *00041000
               RELATED=(LOCAL,ISTAPC11(UNLKLBL))                        00042000
*L0:                                                               0303 00043000
*   REG12=REG2;                     /* RESTOR BASEREG                */ 00044000
L0       LR    REG12,REG2                                          0303 00045000
*   REG13=REG3;                     /* RESTOR SAVEAREA PTR           */ 00046000
         LR    REG13,REG3                                          0304 00047000
*   RFY                                                            0305 00048000
*    (REG2,                                                        0305 00049000
*     REG3) UNRSTD;                                                0305 00050000
*   COMPCODE=0;                     /* SET COMPLETION CODE=0         */ 00051000
*                                                                  0306 00052000
         SLR   @11,@11                                             0306 00053000
         ST    @11,COMPCODE(,SAVEAPTR)                             0306 00054000
*   /*****************************************************************/ 00055000
*   /*                                                               */ 00056000
*   /* * CHECK FOR EXISTENCE OF MPST.IF MPST DOES NOT EXIST, *       */ 00057000
*   /* ALLOCATE AND INITIALIZE STORAGE FOR IT AND ITS * ASSOCIATED   */ 00058000
*   /* CONTROL BLOCKS                                                */ 00059000
*   /*                                                               */ 00060000
*   /*****************************************************************/ 00061000
*                                                                  0307 00062000
*L1:                                                               0307 00063000
*   IF ASXBMPST^=0 THEN             /* MPST ALREADY EXISTS           */ 00064000
L1       L     @11,CVTPTR                                          0307 00065000
         L     @11,CVTTCBP(,@11)                                   0307 00066000
         L     @11,ASCBPTR(,@11)                                   0307 00067000
         L     @11,ASXBPTR(,@11)                                   0307 00068000
         L     @11,ASXBMPST(,@11)                                  0307 00069000
         LTR   @11,@11                                             0307 00070000
         BZ    @RF00307                                            0307 00071000
*     DO;                           /* MPST VALIDATION       @ZA34216*/ 00072000
*       RFY                                                        0309 00073000
*        (INDEXR9,                                                 0309 00074000
*         MPLTREG3) RSTD;           /* NEED SOME REGS        @ZA34216*/ 00075000
*       RFY                                                        0310 00076000
*         ISTMPLT BASED(MPLTREG3);  /* MPLT BASING           @ZA34216*/ 00077000
*       MPLTREG3=ATCMPLTA;          /* PT TO FIRST MPLT      @ZA34216*/ 00078000
         L     @08,ATCLCPTR                                        0311 00079000
         L     MPLTREG3,ATCMPLTA(,@08)                             0311 00080000
*       DO WHILE(MPLTREG3^=0);      /* SEARCH MPLT QUEUE     @ZA34216*/ 00081000
         B     @DE00312                                            0312 00082000
@DL00312 DS    0H                                                  0313 00083000
*         DO INDEXR9=1 TO MPLECNT   /* LOOK FOR MATCHING     @ZA34216*/ 00084000
*               WHILE(MPLADDR(INDEXR9)^=ASXBMPST);/* MPST    @ZA34216*/ 00085000
         LA    INDEXR9,1                                           0313 00086000
         B     @DE00313                                            0313 00087000
@DL00313 LR    @08,INDEXR9                                         0313 00088000
         SLA   @08,3                                               0313 00089000
         L     @02,CVTPTR                                          0313 00090000
         L     @02,CVTTCBP(,@02)                                   0313 00091000
         L     @02,ASCBPTR(,@02)                                   0313 00092000
         L     @02,ASXBPTR(,@02)                                   0313 00093000
         L     @08,MPLADDR-8(@08,MPLTREG3)                         0313 00094000
         C     @08,ASXBMPST(,@02)                                  0313 00095000
         BE    @DC00313                                            0313 00096000
*         END;                      /* END SEARCH FOR MPST   @ZA34216*/ 00097000
         AL    INDEXR9,@CF00038                                    0314 00098000
@DE00313 CH    INDEXR9,MPLECNT(,MPLTREG3)                          0314 00099000
         BNH   @DL00313                                            0314 00100000
@DC00313 DS    0H                                                  0315 00101000
*         IF INDEXR9<=MPLECNT THEN  /* WAS MATCHING MPST FOUND ?   0315 00102000
*                                                            @ZA34216*/ 00103000
         CH    INDEXR9,MPLECNT(,MPLTREG3)                          0315 00104000
         BH    @RF00315                                            0315 00105000
*           IF MPLASID(INDEXR9)=ASCBASID THEN/* DO MPSTS HAVE THE  0316 00106000
*                                      SAME ASIDS ?          @ZA34216*/ 00107000
         LR    @08,INDEXR9                                         0316 00108000
         SLA   @08,3                                               0316 00109000
         L     @02,CVTPTR                                          0316 00110000
         L     @02,CVTTCBP(,@02)                                   0316 00111000
         L     @02,ASCBPTR(,@02)                                   0316 00112000
         LH    @02,ASCBASID(,@02)                                  0316 00113000
         N     @02,@CF03915                                        0316 00114000
         CH    @02,MPLASID-8(@08,MPLTREG3)                         0316 00115000
         BE    @RT00316                                            0316 00116000
*             GO TO L5;             /* YES, MATCHING ASIDS   @ZA34216*/ 00117000
*           ELSE                    /* NO, ASIDS DO NOT MATCH@ZA34216*/ 00118000
*             GO TO L2;             /* MUST CLEAR ASXBMPST   @ZA34216*/ 00119000
         B     L2                                                  0318 00120000
*         MPLTREG3=MPLCHN;          /* NEXT MPLT IN QUEUE    @ZA34216*/ 00121000
@RF00315 L     MPLTREG3,MPLCHN(,MPLTREG3)                          0319 00122000
*       END;                        /* END SEARCH MPLT QUEUE @ZA34216*/ 00123000
@DE00312 LTR   MPLTREG3,MPLTREG3                                   0320 00124000
         BNZ   @DL00312                                            0320 00125000
*L2:                                                               0321 00126000
*       ASXBMPST=0;                 /* INDICATE INPUT MPST WAS     0321 00127000
*                                      INVALID               @ZA34216*/ 00128000
L2       L     @08,CVTPTR                                          0321 00129000
         L     @08,CVTTCBP(,@08)                                   0321 00130000
         L     @08,ASCBPTR(,@08)                                   0321 00131000
         L     @08,ASXBPTR(,@08)                                   0321 00132000
         SLR   @02,@02                                             0321 00133000
         ST    @02,ASXBMPST(,@08)                                  0321 00134000
*       RFY                                                        0322 00135000
*         ISTMPLT BASED;            /* UNBASE MPLT           @ZA34216*/ 00136000
*       RFY                                                        0323 00137000
*        (INDEXR9,                                                 0323 00138000
*         MPLTREG3) UNRSTD;         /*                       @ZA34216*/ 00139000
*     END;                          /* END MPST VALIDATION   @ZA34216*/ 00140000
*   IF ASXBMPST=0 THEN              /* NO MPST EXISTS        @ZA34216*/ 00141000
@RF00307 L     @11,CVTPTR                                          0325 00142000
         L     @11,CVTTCBP(,@11)                                   0325 00143000
         L     @11,ASCBPTR(,@11)                                   0325 00144000
         L     @11,ASXBPTR(,@11)                                   0325 00145000
         L     @11,ASXBMPST(,@11)                                  0325 00146000
         LTR   @11,@11                                             0325 00147000
         BNZ   @RF00325                                            0325 00148000
*     DO;                           /* GET STORAGE FOR NEW MPST      */ 00149000
*                                                                  0326 00150000
*       /*************************************************************/ 00151000
*       /*                                                           */ 00152000
*       /* GETSTOR DESTROYS ALL REGS EXCP 1,11,12,13         @Y30APGC*/ 00153000
*       /*                                                           */ 00154000
*       /*************************************************************/ 00155000
*                                                                  0327 00156000
*       DO;                         /* GETSTOR SIZE(LENGTH(ISTMPST))C   00157000
*                                      LEAR(YES)SAVE(NO)TYPE(FIXED)AD   00158000
*                                      SPACE(COMMON)KEY(VTAM)FETCHP(Y   00159000
*                                      ES)                           */ 00160000
*                                                                  0328 00161000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 00162000
*/* END OF ATBUILD                                                   */ 00163000
*                                                                  0328 00164000
*         DO;                                                      0328 00165000
*         END;                                                     0329 00166000
*         DO;                                                      0330 00167000
*           RFY                                                    0331 00168000
*            (GPR00P,                                              0331 00169000
*             GPR01P,                                              0331 00170000
*             GPR02P,                                              0331 00171000
*             GPR03P) RSTD;                                        0331 00172000
*         END;                                                     0332 00173000
*         GPR00F=LENGTH(ISTMPST);   /* SIZE IN REG0                  */ 00174000
         LA    GPR00F,216                                          0333 00175000
*         DCL                                                      0334 00176000
*           1 CMZA0007 FIXED(31) STATIC LOCAL,                     0334 00177000
*            2 * FIXED(8) INIT(32), /* OPTION FLAGS                  */ 00178000
*            2 * FIXED(8) INIT(96), /* STORAGE KEY                   */ 00179000
*            2 * FIXED(8) INIT(227),/* SUBPOOL NUMBER                */ 00180000
*            2 * FIXED(8) INIT('00'X);/* REQUEST TYPE                */ 00181000
*         GPR03F=CMZA0007;                                         0335 00182000
         L     GPR03F,CMZA0007                                     0335 00183000
*         DO;                       /* LISATCVT                    0336 00184000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 00185000
*           GPR02P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 00186000
         L     GPR02P,ATCLCPTR                                     0337 00187000
*         END;                      /* LISATCVT                      */ 00188000
*         CALL GPR02P->ATCGTSTR;    /* CALL ISTORFSR                 */ 00189000
         L     @15,ATCGTSTR(,GPR02P)                               0339 00190000
         BALR  @14,@15                                             0339 00191000
*         DO;                                                      0340 00192000
*           RFY                                                    0341 00193000
*            (GPR00P,                                              0341 00194000
*             GPR01P,                                              0341 00195000
*             GPR02P,                                              0341 00196000
*             GPR03P) UNRSTD;                                      0341 00197000
*         END;                                                     0342 00198000
*       END;                        /* GETSTOR                       */ 00199000
*L3:                                                               0344 00200000
*       IF RC=0 THEN                /* STORE AVAILABLE?      @Y30APGC*/ 00201000
L3       LTR   RC,RC                                               0344 00202000
         BNZ   @RF00344                                            0344 00203000
*         DO;                       /* YES, INITIALIZE THE MPST      */ 00204000
*L4:                                /* SEGMENT(INITMPS)REQUEST       */ 00205000
*           DO;                                                    0346 00206000
L4       DS    0H                                                  0347 00207000
*             GOTO INITMPS;                                        0347 00208000
         B     INITMPS                                             0347 00209000
*INITMPS#:                                                         0348 00210000
*           END;                                                   0348 00211000
INITMPS# DS    0H                                                  0349 00212000
*           IF COMPCODE=0 THEN      /*                       @OZ03515*/ 00213000
*                                                                  0349 00214000
         L     @11,COMPCODE(,SAVEAPTR)                             0349 00215000
         LTR   @11,@11                                             0349 00216000
         BNZ   @RF00349                                            0349 00217000
*             /*******************************************************/ 00218000
*             /*                                                     */ 00219000
*             /* SEGMENT(INITMPL)REQUEST                             */ 00220000
*             /*                                                     */ 00221000
*             /*******************************************************/ 00222000
*                                                                  0350 00223000
*             DO;                                                  0350 00224000
*               GOTO INITMPL;                                      0351 00225000
         B     INITMPL                                             0351 00226000
*INITMPL#:                                                         0352 00227000
*             END;                  /*                       @OZ03515*/ 00228000
*           ELSE                                                   0353 00229000
*             ;                     /*                       @OZ03515*/ 00230000
@RF00349 DS    0H                                                  0354 00231000
*         END;                                                     0354 00232000
*       ELSE                                                       0355 00233000
*         COMPCODE=4;               /* NO, SET COMP. CODE            */ 00234000
         B     @RC00344                                            0355 00235000
@RF00344 MVC   COMPCODE(4,SAVEAPTR),@CF00071                       0355 00236000
*     END;                                                         0356 00237000
@RC00344 DS    0H                                                  0357 00238000
*L5:                                                               0357 00239000
*   IF COMPCODE^=0 THEN                                            0357 00240000
@RF00325 DS    0H                                                  0357 00241000
L5       L     @11,COMPCODE(,SAVEAPTR)                             0357 00242000
         LTR   @11,@11                                             0357 00243000
         BNZ   @RT00357                                            0357 00244000
*     ;                                                            0358 00245000
*   ELSE                                                           0359 00246000
*                                                                  0359 00247000
*     /***************************************************************/ 00248000
*     /*                                                             */ 00249000
*     /* *SEARCH FOR A ACDEB IN THIS ADDRESS SPACE. IF ONE *EXISTS   */ 00250000
*     /* WHICH IS ASSOCIATED WITH THE CURRENT TASK,THEN *FIND THE PST*/ 00251000
*     /* VIA THE ACDTSKID FIELD OF THE ACDEB AND *INCREMENT THE PST  */ 00252000
*     /* FIELD 'PSTACBCT' BY 1. *IF NO VTAM DEB EXISTS,THEN ALLOCATE */ 00253000
*     /* AND INIT STORAGE *FOR A PST AND THE ASSOCIATED CRAS AND     */ 00254000
*     /* IQES. THE PST *COUNT IN THE MPST. IS ALSO INCREMENTED       */ 00255000
*     /*                                                             */ 00256000
*     /***************************************************************/ 00257000
*                                                                  0359 00258000
*L6:                                                               0359 00259000
*     DO;                                                          0359 00260000
L6       DS    0H                                                  0360 00261000
*       RFY                                                        0360 00262000
*        (FOUNDSW,                                                 0360 00263000
*         DEBPTR) RSTD;                                            0360 00264000
*                                                                  0360 00265000
*       /*************************************************************/ 00266000
*       /*                                                           */ 00267000
*       /* SEGMENT(DEBSRCH)REQUEST                                   */ 00268000
*       /*                                                           */ 00269000
*       /*************************************************************/ 00270000
*                                                                  0361 00271000
*       DO;                                                        0361 00272000
*         GOTO DEBSRCH;                                            0362 00273000
         B     DEBSRCH                                             0362 00274000
*DEBSRCH#:                                                         0363 00275000
*       END;                                                       0363 00276000
*                                                                  0363 00277000
DEBSRCH# DS    0H                                                  0364 00278000
*/*  SEARCH DEB ENTRY LIST                                           */ 00279000
*                                                                  0364 00280000
*       /*************************************************************/ 00281000
*       /*                                                           */ 00282000
*       /* ON RTN,IF ACDEB FOR THIS TASK FOUND,THEN DEBPTR->DEB      */ 00283000
*       /*                                                           */ 00284000
*       /*************************************************************/ 00285000
*                                                                  0364 00286000
*       IF FOUNDSW=1 THEN           /* WAS ACDEB FOUND ?     @ZA34216*/ 00287000
         C     FOUNDSW,@CF00038                                    0364 00288000
         BNE   @RF00364                                            0364 00289000
*         DO;                       /* YES, ACDEB EXISTS     @ZA34216*/ 00290000
*           RFY                                                    0366 00291000
*             PSTPTR RSTD;          /* USED TO POINT TO PST  @ZA34216*/ 00292000
*           PSTPTR=DEBPTR->ACDTSKID;/* SET PST ADDR          @ZA34216*/ 00293000
         L     PSTPTR,ACDTSKID(,DEBPTR)                            0367 00294000
*           IF PSTPTR->PSTABINP=ON THEN/* IS PST ABEND IN PROGRESS ?    00295000
*                                                            @ZA34216*/ 00296000
         TM    PSTABINP(PSTPTR),B'00000001'                        0368 00297000
         BNO   @RF00368                                            0368 00298000
*             DO;                   /* YES, PST IS ABENDING  @ZA34216*/ 00299000
*               COMPCODE=12;        /* INDICATE BAD RETCODE  @ZA34216*/ 00300000
         MVC   COMPCODE(4,SAVEAPTR),@CF00032                       0370 00301000
*               GO TO L18;          /* GO TO CLEANUP         @ZA34216*/ 00302000
         B     L18                                                 0371 00303000
*             END;                  /* END PST IS ABENDING   @ZA34216*/ 00304000
*           RFY                                                    0373 00305000
*             PSTPTR UNRSTD;        /*                       @ZA34216*/ 00306000
@RF00368 DS    0H                                                  0374 00307000
*         END;                      /* END ACDEB EXISTS      @ZA34216*/ 00308000
*                                                                  0374 00309000
*       /*************************************************************/ 00310000
*       /*                                                           */ 00311000
*       /* FOUNDSW AND DEBPTR MUST BE SAVED ACROSS BLDDCE     SEGMENT*/ 00312000
*       /*                                                           */ 00313000
*       /*************************************************************/ 00314000
*                                                                  0375 00315000
*L7:                                /* SEGMENT(BLDDCE)REQUEST        */ 00316000
*       DO;                                                        0375 00317000
@RF00364 DS    0H                                                  0375 00318000
L7       DS    0H                                                  0376 00319000
*         GOTO BLDDCE;                                             0376 00320000
         B     BLDDCE                                              0376 00321000
*BLDDCE#:                                                          0377 00322000
*       END;                                                       0377 00323000
*                                                                  0377 00324000
BLDDCE#  DS    0H                                                  0378 00325000
*/*GET STOR AND BUILD DEB                                            */ 00326000
*                                                                  0378 00327000
*     END;                          /* ENTRY FOR CURRENT ACDEB       */ 00328000
*L8:                                                               0379 00329000
*   IF COMPCODE^=0 THEN                                            0379 00330000
@RT00357 DS    0H                                                  0379 00331000
L8       L     @09,COMPCODE(,SAVEAPTR)                             0379 00332000
         LTR   @09,@09                                             0379 00333000
         BNZ   @RT00379                                            0379 00334000
*     ;                             /* GO CLEANUP IF OPER FAIL       */ 00335000
*   ELSE                                                           0381 00336000
*     DO;                                                          0381 00337000
*L9:                                                               0382 00338000
*       IF FOUNDSW^=1               /* NO ACDEB FOUND FOR THIS TASK  */ 00339000
*         THEN                      /* GET STORAGE FOR PST           */ 00340000
L9       C     FOUNDSW,@CF00038                                    0382 00341000
         BE    @RF00382                                            0382 00342000
*L10:                                                              0383 00343000
*         DO;                                                      0383 00344000
*                                                                  0383 00345000
L10      DS    0H                                                  0384 00346000
*           /*********************************************************/ 00347000
*           /*                                                       */ 00348000
*           /* GETSTOR DESTROYS ALL REGS EXCP 1,11,12,13             */ 00349000
*           /*                                                       */ 00350000
*           /*********************************************************/ 00351000
*                                                                  0384 00352000
*                                   /*                       @Y30APGC*/ 00353000
*           DO;                     /* GETSTOR SIZE(LENGTH(ISTPST))CL   00354000
*                                      EAR(YES)SAVE(NO)TYPE(FIXED)ADS   00355000
*                                      PACE(COMMON)KEY(VTAM)FETCHP(YE   00356000
*                                      S)                            */ 00357000
*                                                                  0385 00358000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 00359000
*/* END OF ATBUILD                                                   */ 00360000
*                                                                  0385 00361000
*             DO;                                                  0385 00362000
*             END;                                                 0386 00363000
*             DO;                                                  0387 00364000
*               RFY                                                0388 00365000
*                (GPR00P,                                          0388 00366000
*                 GPR01P,                                          0388 00367000
*                 GPR02P,                                          0388 00368000
*                 GPR03P) RSTD;                                    0388 00369000
*             END;                                                 0389 00370000
*             GPR00F=LENGTH(ISTPST);/* SIZE IN REG0                  */ 00371000
         LA    GPR00F,136                                          0390 00372000
*             DCL                                                  0391 00373000
*               1 CMZA0035 FIXED(31) STATIC LOCAL,                 0391 00374000
*                2 * FIXED(8) INIT(32),/* OPTION FLAGS               */ 00375000
*                2 * FIXED(8) INIT(96),/* STORAGE KEY                */ 00376000
*                2 * FIXED(8) INIT(227),/* SUBPOOL NUMBER            */ 00377000
*                2 * FIXED(8) INIT('00'X);/* REQUEST TYPE            */ 00378000
*             GPR03F=CMZA0035;                                     0392 00379000
         L     GPR03F,CMZA0035                                     0392 00380000
*             DO;                   /* LISATCVT                    0393 00381000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 00382000
*               GPR02P=ATCLCPTR;    /* SET UP ATCVT POINTER          */ 00383000
         L     GPR02P,ATCLCPTR                                     0394 00384000
*             END;                  /* LISATCVT                      */ 00385000
*             CALL GPR02P->ATCGTSTR;/* CALL ISTORFSR                 */ 00386000
         L     @15,ATCGTSTR(,GPR02P)                               0396 00387000
         BALR  @14,@15                                             0396 00388000
*             DO;                                                  0397 00389000
*               RFY                                                0398 00390000
*                (GPR00P,                                          0398 00391000
*                 GPR01P,                                          0398 00392000
*                 GPR02P,                                          0398 00393000
*                 GPR03P) UNRSTD;                                  0398 00394000
*             END;                                                 0399 00395000
*           END;                    /* GETSTOR                       */ 00396000
*L11:                                                              0401 00397000
*           IF RC=0                 /* STORE AVAILABLE?      @Y30APGC*/ 00398000
*             THEN                  /* YES,R3->ALLOCATED STORAGE     */ 00399000
L11      LTR   RC,RC                                               0401 00400000
         BNZ   @RF00401                                            0401 00401000
*             DO;                   /*                       @Z40GKD1*/ 00402000
*               RFY                                                0403 00403000
*                 REG3 RSTD;                                       0403 00404000
*                                                                  0403 00405000
*               /*****************************************************/ 00406000
*               /*                                                   */ 00407000
*               /* INCR. MPST PST COUNT BEFORE INIT. PST     @Z40GKD1*/ 00408000
*               /*                                                   */ 00409000
*               /*****************************************************/ 00410000
*                                                                  0404 00411000
*               ASXBMPST->MPSPSTCT=ASXBMPST->MPSPSTCT+1;           0404 00412000
         L     @09,CVTPTR                                          0404 00413000
         L     @09,CVTTCBP(,@09)                                   0404 00414000
         L     @09,ASCBPTR(,@09)                                   0404 00415000
         L     @09,ASXBPTR(,@09)                                   0404 00416000
         L     @09,ASXBMPST(,@09)                                  0404 00417000
         LA    @11,1                                               0404 00418000
         AL    @11,MPSPSTCT(,@09)                                  0404 00419000
         ST    @11,MPSPSTCT(,@09)                                  0404 00420000
*L12:                               /* SEGMENT(INITPST)REQUEST       */ 00421000
*               DO;                                                0405 00422000
L12      DS    0H                                                  0406 00423000
*                 GOTO INITPST;                                    0406 00424000
         B     INITPST                                             0406 00425000
*INITPST#:                                                         0407 00426000
*               END;                /* INITIALIZE PST                */ 00427000
INITPST# DS    0H                                                  0408 00428000
*               RFY                                                0408 00429000
*                 REG3 UNRSTD;                                     0408 00430000
*             END;                  /* END OF STORAGE AVAILABLE    0409 00431000
*                                                            @Z40GKD1*/ 00432000
*           ELSE                    /* ELSE NO STORAGE FOR PST     0410 00433000
*                                                            @ZA08912*/ 00434000
*             DO;                   /*                       @ZA08912*/ 00435000
         B     @RC00401                                            0410 00436000
@RF00401 DS    0H                                                  0411 00437000
*               COMPCODE=4;         /* SET RETURN CODE       @ZA08912*/ 00438000
         MVC   COMPCODE(4,SAVEAPTR),@CF00071                       0411 00439000
*             END;                  /*                       @ZA08912*/ 00440000
*L13:                                                              0413 00441000
*           IF COMPCODE^=0          /* UNSUCCESSFUL INIT OR STORAGE     00442000
*                                      UNAVAILABLE           @Z40GKD1*/ 00443000
*             THEN                                                 0413 00444000
@RC00401 DS    0H                                                  0413 00445000
L13      L     @09,COMPCODE(,SAVEAPTR)                             0413 00446000
         LTR   @09,@09                                             0413 00447000
         BZ    @RF00413                                            0413 00448000
*             IF ATCABEN=ON THEN    /* VTAM CANCEL IN PROGRESS     0414 00449000
*                                                            @G35RKD9*/ 00450000
         L     @09,ATCLCPTR                                        0414 00451000
         TM    ATCABEN(@09),B'00100000'                            0414 00452000
         BNO   @RF00414                                            0414 00453000
*               DO;                 /*                       @G35RKD9*/ 00454000
*                 ACDEBPTR->ACDTPEND=ON;/* SET TPEND FLAG IN DEB   0416 00455000
*                                                            @G35RKD9*/ 00456000
         L     @09,ACDEBPTR(,SAVEAPTR)                             0416 00457000
         OI    ACDTPEND(@09),B'00000010'                           0416 00458000
*                 COMPCODE=8;       /* SET RETURN CODE       @G35RKD9*/ 00459000
         MVC   COMPCODE(4,SAVEAPTR),@CF00064                       0417 00460000
*               END;                /*                       @G35RKD9*/ 00461000
*             ELSE                  /* FREE DCE              @G35RKD9*/ 00462000
*               DO;                                                0419 00463000
*                                                                  0419 00464000
         B     @RC00414                                            0419 00465000
@RF00414 DS    0H                                                  0420 00466000
*                 /***************************************************/ 00467000
*                 /*                                                 */ 00468000
*                 /* SEGMENT(FREEDCE)REQUEST                         */ 00469000
*                 /*                                                 */ 00470000
*                 /***************************************************/ 00471000
*                                                                  0420 00472000
*                 DO;                                              0420 00473000
*                   GOTO FREEDCE;                                  0421 00474000
         B     FREEDCE                                             0421 00475000
*FREEDCE#:                                                         0422 00476000
*                 END;              /*                       @Z40GKD1*/ 00477000
FREEDCE# DS    0H                                                  0423 00478000
*               END;                /* NO STOR FOR PST,              */ 00479000
*           ELSE                    /* INIT. SUCCESSFUL      @Z40GKD1*/ 00480000
*L16:                                                              0424 00481000
*             DO;                   /* SEGMENT(CKAUTH)REQUEST        */ 00482000
         B     @RC00413                                            0424 00483000
@RF00413 DS    0H                                                  0424 00484000
L16      DS    0H                                                  0425 00485000
*               DO;                                                0425 00486000
*                 GOTO CKAUTH;                                     0426 00487000
         B     CKAUTH                                              0426 00488000
*CKAUTH#:                                                          0427 00489000
*               END;                                               0427 00490000
CKAUTH#  DS    0H                                                  0428 00491000
*             END;                                                 0428 00492000
*         END;                      /* END OF NO ACDEB BRANCH        */ 00493000
*       ELSE                        /* ACDEB ALREADY EXIST           */ 00494000
*L14:                                                              0430 00495000
*         DO;                                                      0430 00496000
         B     @RC00382                                            0430 00497000
@RF00382 DS    0H                                                  0430 00498000
L14      DS    0H                                                  0431 00499000
*           RFY                                                    0431 00500000
*            (DEBPTR,                                              0431 00501000
*             RPST) RSTD;           /* DEBPTR->ACDEB FOUND           */ 00502000
*           RPST=DEBPTR->ACDTSKID;  /* LOCATE PST VIA ACDTSKID       */ 00503000
         L     RPST,ACDTSKID(,DEBPTR)                              0432 00504000
*           ACDEBPTR->ACDTSKID=RPST;/* PLACE PST ADDR IN ACDTSKID  0433 00505000
*                                      FIELD OF ACEDB PASSED ON ENTRY*/ 00506000
         L     @03,ACDEBPTR(,SAVEAPTR)                             0433 00507000
         ST    RPST,ACDTSKID(,@03)                                 0433 00508000
*           RPST->PSTACBCT=RPST->PSTACBCT+1;/* INCREMENT             */ 00509000
         LA    @03,1                                               0434 00510000
         AL    @03,PSTACBCT(,RPST)                                 0434 00511000
         ST    @03,PSTACBCT(,RPST)                                 0434 00512000
*         END;                      /* PST ACDEB COUNT               */ 00513000
*       RFY                                                        0436 00514000
*        (RPST,                                                    0436 00515000
*         DEBPTR,                                                  0436 00516000
*         FOUNDSW) UNRSTD;                                         0436 00517000
@RC00382 DS    0H                                                  0437 00518000
*     END;                                                         0437 00519000
*L18:                               /* SEGMENT(CLEANUP)REQUEST       */ 00520000
*   DO;                                                            0438 00521000
@RT00379 DS    0H                                                  0438 00522000
L18      DS    0H                                                  0439 00523000
*     GOTO CLEANUP;                                                0439 00524000
         B     CLEANUP                                             0439 00525000
*CLEANUP#:                                                         0440 00526000
*   END;                                                           0440 00527000
*                                                                  0440 00528000
*/*  CLEANUP                                                         */ 00529000
*                                                                  0441 00530000
*L19:                                                              0441 00531000
*   RETURN;                                                        0441 00532000
@EL00001 DS    0H                                                  0441 00533000
@EF00001 DS    0H                                                  0441 00534000
@ER00001 LM    @14,@12,12(@13)                                     0441 00535000
         BR    @14                                                 0441 00536000
*   GEN(EJECT);                                                    0442 00537000
*                                                                  0442 00538000
         EJECT                                                          00539000
*/* SEGMENT(CLEANUP)START                                            */ 00540000
*                                                                  0443 00541000
*   DO;                                                            0443 00542000
*     GOTO CLEANUP@;                                               0444 00543000
         B     CLEANUP@                                            0444 00544000
*CLEANUP:                                                          0445 00545000
*   END;                                                           0445 00546000
*                                                                  0445 00547000
CLEANUP  DS    0H                                                  0446 00548000
*   /*****************************************************************/ 00549000
*   /*                                                               */ 00550000
*   /* *IF THE COMPCODE AND THE ASXBMPST IS NOT ZERO, THEN ALL       */ 00551000
*   /* *STORAGE WHICH IS *STILL ALLOCATED IS DEALLOCATED AND THE     */ 00552000
*   /* LOCAL MEMORY LOCK *RELEASED *IF THE COMPCODE AND ASXBMPST IS  */ 00553000
*   /* ZERO,NO OPERATION IS *PERFORMED.                              */ 00554000
*   /*                                                               */ 00555000
*   /*****************************************************************/ 00556000
*                                                                  0446 00557000
*   RFY                                                            0446 00558000
*    (REG11,                                                       0446 00559000
*     REG3,                                                        0446 00560000
*     REG2) RSTD;                                                  0446 00561000
*   RFY                                                            0447 00562000
*     ISTMPST BASED(REG11);         /*                       @OZ03515*/ 00563000
*   IF COMPCODE=8|COMPCODE=12 THEN                                 0448 00564000
         L     @10,COMPCODE(,SAVEAPTR)                             0448 00565000
         C     @10,@CF00064                                        0448 00566000
         BE    @RT00448                                            0448 00567000
         C     @10,@CF00032                                        0448 00568000
         BE    @RT00448                                            0448 00569000
*     ;                             /* IS VTAM CANCEL OR TASK ABEND     00570000
*                                      IN PROGRESS ?         @ZA34216*/ 00571000
*   ELSE                                                           0450 00572000
*     DO;                           /* NO- DO REGULAR CLEANUP      0450 00573000
*                                                            @G35RKD9*/ 00574000
*       REG11=ASXBMPST;             /*                       @OZ03515*/ 00575000
         L     @10,CVTPTR                                          0451 00576000
         L     @10,CVTTCBP(,@10)                                   0451 00577000
         L     @10,ASCBPTR(,@10)                                   0451 00578000
         L     @10,ASXBPTR(,@10)                                   0451 00579000
         L     REG11,ASXBMPST(,@10)                                0451 00580000
*       IF MPLTSW<0                 /* IS MPLT SW ON?        @OZ03515*/ 00581000
*         THEN                                                     0452 00582000
         SLR   @10,@10                                             0452 00583000
         CR    MPLTSW,@10                                          0452 00584000
         BNL   @RF00452                                            0452 00585000
*         DO;                       /* YES, CHECK COMPCODE   @OZ03515*/ 00586000
*           IF COMPCODE=0 THEN                                     0454 00587000
         C     @10,COMPCODE(,SAVEAPTR)                             0454 00588000
         BNE   @RF00454                                            0454 00589000
*             MPSSAVE(1:4)=0;       /* ZERO SAVED POINTER TO MPLT  0455 00590000
*                                      ENTRY                 @OZ03515*/ 00591000
         STCM  @10,15,MPSSAVE(REG11)                               0455 00592000
*           ELSE                                                   0456 00593000
*             DO;                   /*                       @OZ03515*/ 00594000
         B     @RC00454                                            0456 00595000
@RF00454 DS    0H                                                  0457 00596000
*               REG3=0;             /*                       @OZ03515*/ 00597000
         SLR   REG3,REG3                                           0457 00598000
*               REG2=MPSSAVE(1:4);  /* GET SAVED PTR TO MPLT ENTRY 0458 00599000
*                                                            @OZ03515*/ 00600000
         ICM   REG2,15,MPSSAVE(REG11)                              0458 00601000
*               REG2->MPLCDS(REG3)=ZERO2;/* ZERO MPLT ENTRY  @OZ03515*/ 00602000
         LR    @10,REG3                                            0459 00603000
         SLA   @10,3                                               0459 00604000
         ALR   @10,REG2                                            0459 00605000
         MVC   MPLCDS-8(8,@10),@CB03581                            0459 00606000
*               MPSSAVE(1:4)=0;     /* ZERO SAVED PTR TO MPLT ENTRY     00607000
*                                                            @OZ03515*/ 00608000
         SLR   @10,@10                                             0460 00609000
         STCM  @10,15,MPSSAVE(REG11)                               0460 00610000
*             END;                                                 0461 00611000
*         END;                      /*                       @OZ03515*/ 00612000
*       ELSE                                                       0463 00613000
*         ;                         /*                       @OZ03515*/ 00614000
@RF00452 DS    0H                                                  0464 00615000
*L20:                                                              0464 00616000
*       IF(COMPCODE^=0)             /* BAD COMPLETION?       @ZM32949*/ 00617000
*         THEN                                                     0464 00618000
@RC00452 DS    0H                                                  0464 00619000
L20      SLR   @10,@10                                             0464 00620000
         C     @10,COMPCODE(,SAVEAPTR)                             0464 00621000
         BE    @RF00464                                            0464 00622000
*         DO;                                                      0465 00623000
*           IF ASXBMPST^=0          /* YES-MPST SETUP?       @ZM32949*/ 00624000
*             THEN                                                 0466 00625000
         L     @09,CVTPTR                                          0466 00626000
         L     @09,CVTTCBP(,@09)                                   0466 00627000
         L     @09,ASCBPTR(,@09)                                   0466 00628000
         L     @09,ASXBPTR(,@09)                                   0466 00629000
         C     @10,ASXBMPST(,@09)                                  0466 00630000
         BE    @RF00466                                            0466 00631000
*             DO;                                                  0467 00632000
*               IF MPSPSTCT=0       /* PST COUNT =0?                 */ 00633000
*                 THEN              /* YES                           */ 00634000
         C     @10,MPSPSTCT(,REG11)                                0468 00635000
         BNE   @RF00468                                            0468 00636000
*                 DO;               /* CRA ALLOCATED?                */ 00637000
*                   RFY                                            0470 00638000
*                     ISTRPH BASED(MPSSMRPH);/*              @Z40GKD1*/ 00639000
*                   IF MPSSMRPH^=0 THEN/* YES                @ZM41496*/ 00640000
         L     @09,MPSSMRPH(,REG11)                                0471 00641000
         CR    @09,@10                                             0471 00642000
         BE    @RF00471                                            0471 00643000
*                     DO;           /* DEALLOC.CRA           @Z40GKD1*/ 00644000
*                       REG3=RPHCRR;/*                       @Z40GKD1*/ 00645000
         L     REG3,RPHCRR(,@09)                                   0473 00646000
*L21:                                                              0474 00647000
*                       DO;         /* RELSTORE BUFADDR(REG3)SAVE(NO)*/ 00648000
L21      DS    0H                                                  0475 00649000
*                                   /* RELSTORE BUFADDR(REG3)SAVE(NO)*/ 00650000
*                         DO;                                      0475 00651000
*                                                                  0475 00652000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00653000
*/* END OF ATBUILD                                                   */ 00654000
*                                                                  0476 00655000
*                           DO;                                    0476 00656000
*                           END;                                   0477 00657000
*                           DO;                                    0478 00658000
*                             RFY                                  0479 00659000
*                              (GPR02P,                            0479 00660000
*                               GPR03P,                            0479 00661000
*                               GPR04P,                            0479 00662000
*                               GPR15P) RSTD;                      0479 00663000
*                           END;                                   0480 00664000
*                           GPR04P=REG3;                           0481 00665000
         LR    GPR04P,REG3                                         0481 00666000
*                           DCL                                    0482 00667000
*                             1 FMZA0064 FIXED(31) STATIC LOCAL,   0482 00668000
*                              2 * FIXED(8) INIT(0),               0482 00669000
*                              2 * PTR(24) INIT(0);                0482 00670000
*                           GPR03F=FMZA0064;                       0483 00671000
         L     GPR03F,FMZA0064                                     0483 00672000
*                           DO;     /* LISATCVT                    0484 00673000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00674000
*                             GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER*/ 00675000
         L     GPR15P,ATCLCPTR                                     0485 00676000
*                           END;    /* LISATCVT                      */ 00677000
*                           GPR02P=GPR15P->ATCBPDA;                0487 00678000
         L     GPR02P,ATCBPDA(,GPR15P)                             0487 00679000
*                           GPR15P=GPR15P->ATCSMRS;                0488 00680000
         L     GPR15P,ATCSMRS(,GPR15P)                             0488 00681000
*                           DCL                                    0489 00682000
*                             FMZL0064 BASED(GPR15P) LABEL VALUERANGE(* 00683000
*                                 );                               0489 00684000
*                           CALL FMZL0064;                         0490 00685000
         BALR  @14,@15                                             0490 00686000
*                           DO;                                    0491 00687000
*                             RFY                                  0492 00688000
*                              (GPR02P,                            0492 00689000
*                               GPR03P,                            0492 00690000
*                               GPR04P,                            0492 00691000
*                               GPR15P) UNRSTD;                    0492 00692000
*                           END;                                   0493 00693000
*                         END;                                     0494 00694000
*                       END;        /* RELSTORE                      */ 00695000
*                     END;                                         0496 00696000
*L26:                                                              0497 00697000
*                   IF MPSSRB55^=0 THEN/* ISTAPC55 SRB ALLOCATED     */ 00698000
@RF00471 DS    0H                                                  0497 00699000
L26      L     @10,MPSSRB55(,REG11)                                0497 00700000
         LTR   @10,@10                                             0497 00701000
         BZ    @RF00497                                            0497 00702000
*                     DO;           /* DEALLOC. SRB                  */ 00703000
*                       REG3=MPSSRB55;                             0499 00704000
         LR    REG3,@10                                            0499 00705000
*L27:                                                              0500 00706000
*                       DO;         /* RELSTORE BUFADDR(REG3)SAVE(NO)*/ 00707000
L27      DS    0H                                                  0501 00708000
*                                   /* RELSTORE BUFADDR(REG3)SAVE(NO)*/ 00709000
*                         DO;                                      0501 00710000
*                                                                  0501 00711000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00712000
*/* END OF ATBUILD                                                   */ 00713000
*                                                                  0502 00714000
*                           DO;                                    0502 00715000
*                           END;                                   0503 00716000
*                           DO;                                    0504 00717000
*                             RFY                                  0505 00718000
*                              (GPR02P,                            0505 00719000
*                               GPR03P,                            0505 00720000
*                               GPR04P,                            0505 00721000
*                               GPR15P) RSTD;                      0505 00722000
*                           END;                                   0506 00723000
*                           GPR04P=REG3;                           0507 00724000
         LR    GPR04P,REG3                                         0507 00725000
*                           DCL                                    0508 00726000
*                             1 FMZA0087 FIXED(31) STATIC LOCAL,   0508 00727000
*                              2 * FIXED(8) INIT(0),               0508 00728000
*                              2 * PTR(24) INIT(0);                0508 00729000
*                           GPR03F=FMZA0087;                       0509 00730000
         L     GPR03F,FMZA0087                                     0509 00731000
*                           DO;     /* LISATCVT                    0510 00732000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00733000
*                             GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER*/ 00734000
         L     GPR15P,ATCLCPTR                                     0511 00735000
*                           END;    /* LISATCVT                      */ 00736000
*                           GPR02P=GPR15P->ATCBPDA;                0513 00737000
         L     GPR02P,ATCBPDA(,GPR15P)                             0513 00738000
*                           GPR15P=GPR15P->ATCSMRS;                0514 00739000
         L     GPR15P,ATCSMRS(,GPR15P)                             0514 00740000
*                           DCL                                    0515 00741000
*                             FMZL0087 BASED(GPR15P) LABEL VALUERANGE(* 00742000
*                                 );                               0515 00743000
*                           CALL FMZL0087;                         0516 00744000
         BALR  @14,@15                                             0516 00745000
*                           DO;                                    0517 00746000
*                             RFY                                  0518 00747000
*                              (GPR02P,                            0518 00748000
*                               GPR03P,                            0518 00749000
*                               GPR04P,                            0518 00750000
*                               GPR15P) UNRSTD;                    0518 00751000
*                           END;                                   0519 00752000
*                         END;                                     0520 00753000
*                       END;        /* RELSTORE                      */ 00754000
*                     END;          /* DEALLOCATE MPST               */ 00755000
*L28:                                                              0523 00756000
*                   ASXBMPST=0;     /* ZERO MPST PTR IN ASXB @Z40GKD1*/ 00757000
*                                                                  0523 00758000
@RF00497 DS    0H                                                  0523 00759000
L28      L     @10,CVTPTR                                          0523 00760000
         L     @10,CVTTCBP(,@10)                                   0523 00761000
         L     @10,ASCBPTR(,@10)                                   0523 00762000
         L     @10,ASXBPTR(,@10)                                   0523 00763000
         SLR   @09,@09                                             0523 00764000
         ST    @09,ASXBMPST(,@10)                                  0523 00765000
*                   /*************************************************/ 00766000
*                   /*                                               */ 00767000
*                   /* FREESTOR DESTROYS ALL REGS EXCP 1,11,12,13    */ 00768000
*                   /*                                               */ 00769000
*                   /*************************************************/ 00770000
*                                                                  0524 00771000
*                                   /*                       @Y30APGC*/ 00772000
*                   DO;             /* FREESTOR AREA(REG11)SIZE(LENGT   00773000
*                                      H(ISTMPST))CLEAR(NO)SAVE(NO)TY   00774000
*                                      PE(FIXED)ADSPACE(COMMON)KEY(VT   00775000
*                                      AM)FETCHP(YES)                */ 00776000
*                                                                  0525 00777000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 00778000
*/* END OF ATBUILD                                                   */ 00779000
*                                                                  0525 00780000
*                     DO;                                          0525 00781000
*                     END;                                         0526 00782000
*                     DO;                                          0527 00783000
*                       RFY                                        0528 00784000
*                        (GPR00P,                                  0528 00785000
*                         GPR01P,                                  0528 00786000
*                         GPR02P,                                  0528 00787000
*                         GPR03P) RSTD;                            0528 00788000
*                     END;                                         0529 00789000
*                     GPR00F=LENGTH(ISTMPST);/* SIZE IN REG0         */ 00790000
         LA    GPR00F,216                                          0530 00791000
*                     DCL                                          0531 00792000
*                       1 CMZA0110 FIXED(31) STATIC LOCAL,         0531 00793000
*                        2 * FIXED(8) INIT(0),/* OPTION FLAGS        */ 00794000
*                        2 * FIXED(8) INIT(96),/* STORAGE KEY        */ 00795000
*                        2 * FIXED(8) INIT(227),/* SUBPOOL NUMBER    */ 00796000
*                        2 * FIXED(8) INIT('01'X);/* REQUEST TYPE    */ 00797000
*                     GPR03F=CMZA0110;                             0532 00798000
         L     GPR03F,CMZA0110                                     0532 00799000
*                     DO;                                          0533 00800000
*                       RFY                                        0534 00801000
*                        (GPR04P) RSTD;                            0534 00802000
*                     END;                                         0535 00803000
*                     GPR04P=REG11; /* PUT FREEMAIN ADDR IN REG4     */ 00804000
         LR    GPR04P,REG11                                        0536 00805000
*                     DO;           /* LISATCVT                    0537 00806000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 00807000
*                       GPR02P=ATCLCPTR;/* SET UP ATCVT POINTER      */ 00808000
         L     GPR02P,ATCLCPTR                                     0538 00809000
*                     END;          /* LISATCVT                      */ 00810000
*                     CALL GPR02P->ATCGTSTR;/* CALL ISTORFSR         */ 00811000
         L     @15,ATCGTSTR(,GPR02P)                               0540 00812000
         BALR  @14,@15                                             0540 00813000
*                     DO;                                          0541 00814000
*                       RFY                                        0542 00815000
*                        (GPR00P,                                  0542 00816000
*                         GPR01P,                                  0542 00817000
*                         GPR02P,                                  0542 00818000
*                         GPR03P,                                  0542 00819000
*                         GPR04P) UNRSTD;                          0542 00820000
*                     END;                                         0543 00821000
*                   END;            /* FREESTOR                      */ 00822000
*                 END;                                             0545 00823000
*             END;                                                 0546 00824000
*           ELSE                                                   0547 00825000
*             ;                                                    0547 00826000
@RF00466 DS    0H                                                  0548 00827000
*         END;                                                     0548 00828000
*       ELSE                                                       0549 00829000
*         ;                                                        0549 00830000
@RF00464 DS    0H                                                  0550 00831000
*       IF ATCABEN=ON THEN          /* VTAM CANCEL IN PROGRESS     0550 00832000
*                                                            @G35RKD9*/ 00833000
@RC00464 L     @10,ATCLCPTR                                        0550 00834000
         TM    ATCABEN(@10),B'00100000'                            0550 00835000
         BNO   @RF00550                                            0550 00836000
*         DO;                       /*                       @G35RKD9*/ 00837000
*           ACDEBPTR->ACDTPEND=ON;  /* SET TPEND ON IN DEV   @G35RKD9*/ 00838000
         L     @10,ACDEBPTR(,SAVEAPTR)                             0552 00839000
         OI    ACDTPEND(@10),B'00000010'                           0552 00840000
*           COMPCODE=8;             /* SET RETURN CODE       @G35RKD9*/ 00841000
         MVC   COMPCODE(4,SAVEAPTR),@CF00064                       0553 00842000
*         END;                      /*                       @G35RKD9*/ 00843000
*     END;                          /* END REGULAR CLEANUP   @G35RKD9*/ 00844000
@RF00550 DS    0H                                                  0556 00845000
*   RFY                                                            0556 00846000
*    (REG1,                                                        0556 00847000
*     REG3) RSTD;                   /*                       @Z40GKD1*/ 00848000
@RT00448 DS    0H                                                  0557 00849000
*   REG1=REG12;                     /* SAVE BASE REG         @Z40GKD1*/ 00850000
         LR    REG1,REG12                                          0557 00851000
*   REG3=REG13;                     /* SAVE SAVE AREA POINTER      0558 00852000
*                                                            @Z40GKD1*/ 00853000
         LR    REG3,REG13                                          0558 00854000
*UNLKLBL:                                                          0559 00855000
*   GEN CODE REFS(PSALITA,FLC,LKLBL);                              0559 00856000
UNLKLBL  DS    0H                                                  0559 00857000
*                                         /*RELEASE MEMORY LOCK      */ 00858000
         SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCAL,ISTAPC11(LKLBL))     00859000
*   REG12=REG1;                     /* RESTORE BASE REG      @Z40GKD1*/ 00860000
         LR    REG12,REG1                                          0560 00861000
*   REG13=REG3;                     /* RESTORE SAVE AREA PTR @Z40GKD1*/ 00862000
         LR    REG13,REG3                                          0561 00863000
*   RFY                                                            0562 00864000
*    (REG1,                                                        0562 00865000
*     REG3,                                                        0562 00866000
*     REG11,                                                       0562 00867000
*     REG2) UNRSTD;                 /*                       @Z40GKD1*/ 00868000
*/* SEGMENT(CLEANUP)FINISH                                           */ 00869000
*                                                                  0563 00870000
*   DO;                                                            0563 00871000
*     GOTO CLEANUP#;                                               0564 00872000
         B     CLEANUP#                                            0564 00873000
*CLEANUP@:                                                         0565 00874000
*   END;                                                           0565 00875000
CLEANUP@ DS    0H                                                  0566 00876000
*   GEN(EJECT);                                                    0566 00877000
         EJECT                                                          00878000
*                                                                  0567 00879000
*/* SEGMENT(CKAUTH)START                                             */ 00880000
*                                                                  0567 00881000
*   DO;                                                            0567 00882000
*     GOTO CKAUTH@;                                                0568 00883000
         B     CKAUTH@                                             0568 00884000
*CKAUTH:                                                           0569 00885000
*   END;                                                           0569 00886000
*                                                                  0569 00887000
CKAUTH   DS    0H                                                  0570 00888000
*   /*****************************************************************/ 00889000
*   /*                                                               */ 00890000
*   /* *********** CKAUTH SEGMENT                                    */ 00891000
*   /*                                                               */ 00892000
*   /*****************************************************************/ 00893000
*                                                                  0570 00894000
*   RFY                                                            0570 00895000
*    (RMPST) RSTD;                                                 0570 00896000
*L29:                                                              0571 00897000
*   RMPST=ASXBMPST;                 /* REEST. MPST POINTER           */ 00898000
L29      L     @11,CVTPTR                                          0571 00899000
         L     @11,CVTTCBP(,@11)                                   0571 00900000
         L     @11,ASCBPTR(,@11)                                   0571 00901000
         L     @11,ASXBPTR(,@11)                                   0571 00902000
         L     RMPST,ASXBMPST(,@11)                                0571 00903000
*   RFY                                                            0572 00904000
*     ISTMPST BASED(RMPST);                                        0572 00905000
*   IF MPSAUTH=ON                   /* AUTHORIZED PREVIOUSLY?        */ 00906000
*     THEN                                                         0573 00907000
         TM    MPSAUTH(RMPST),B'00100000'                          0573 00908000
         BO    @RT00573                                            0573 00909000
*     ;                             /* YES,CONTINUE                  */ 00910000
*   ELSE                            /* NO,CHECK AUTHORIZATION        */ 00911000
*     DO;                                                          0575 00912000
*L30:                                                              0576 00913000
*       GEN CODE REFS(CVT,CVTAPF);                                 0576 00914000
L30      DS    0H                                                  0576 00915000
*                                                            @ZA29455*/ 00916000
              TESTAUTH FCTN=1,RBLEVEL=2,BRANCH=YES,KEY=YES              00917000
*L31:                                                              0577 00918000
*       IF RC^=0                    /* AUTHORIZED?                   */ 00919000
*         THEN                                                     0577 00920000
L31      LTR   RC,RC                                               0577 00921000
         BNZ   @RT00577                                            0577 00922000
*         GOTO SEGEND;              /* NO,RETURN                     */ 00923000
*       ELSE                                                       0579 00924000
*         MPSAUTH=ON;               /* INDIC. AUTH IN MPST           */ 00925000
         OI    MPSAUTH(RMPST),B'00100000'                          0579 00926000
*     END;                                                         0580 00927000
*   ACDEBPTR->ACDTSKID->PSTAUTH=ON; /* INDIC. AUTH. IN PST           */ 00928000
@RT00573 L     @11,ACDEBPTR(,SAVEAPTR)                             0581 00929000
         L     @11,ACDTSKID(,@11)                                  0581 00930000
         OI    PSTAUTH(@11),B'00000010'                            0581 00931000
*   RFY                                                            0582 00932000
*    (RMPST) UNRSTD;                                               0582 00933000
*SEGEND:                            /* SEGMENT(CKAUTH)FINISH         */ 00934000
*   DO;                                                            0583 00935000
SEGEND   DS    0H                                                  0584 00936000
*     GOTO CKAUTH#;                                                0584 00937000
         B     CKAUTH#                                             0584 00938000
*CKAUTH@:                                                          0585 00939000
*   END;                                                           0585 00940000
CKAUTH@  DS    0H                                                  0586 00941000
*   GEN(EJECT);                                                    0586 00942000
         EJECT                                                          00943000
*                                                                  0587 00944000
*/* SEGMENT(INITMPS)START                                            */ 00945000
*                                                                  0587 00946000
*   DO;                                                            0587 00947000
*     GOTO INITMPS@;                                               0588 00948000
         B     INITMPS@                                            0588 00949000
*INITMPS:                                                          0589 00950000
*   END;                                                           0589 00951000
*                                                                  0589 00952000
INITMPS  DS    0H                                                  0590 00953000
*/****************************************************************** */ 00954000
*/***************INITMPST SEGMENT                       ************ */ 00955000
*/***************ON ENTRY R13->SAVE AREA                ************ */ 00956000
*/*                       R3->STORAGE AREA FOR MPST     ************ */ 00957000
*/*              ON EXIT ALL REGS CORRPUTED EXCEPT 12,13             */ 00958000
*/****************************************************************** */ 00959000
*                                                                  0590 00960000
*   RFY                                                            0590 00961000
*     REG3 RSTD;                                                   0590 00962000
*L32:                                                              0591 00963000
*   ASXBMPST=REG3;                  /* STORE MPST PTR IN ASXB        */ 00964000
L32      L     @02,CVTPTR                                          0591 00965000
         L     @11,CVTTCBP(,@02)                                   0591 00966000
         L     @11,ASCBPTR(,@11)                                   0591 00967000
         L     @10,ASXBPTR(,@11)                                   0591 00968000
         ST    REG3,ASXBMPST(,@10)                                 0591 00969000
*   REG3->MPSASID=ASCBASID;         /* INIT. MPSASID                 */ 00970000
         MVC   MPSASID(2,REG3),ASCBASID(@11)                       0592 00971000
*   REG3->MPSASCB=ASCBPTR;          /* INIT. MPSASCB                 */ 00972000
         ST    @11,MPSASCB(,REG3)                                  0593 00973000
*   REG3->MPSMPSTP=REG3;            /* INIT. MPSMPSTP                */ 00974000
         ST    REG3,MPSMPSTP(,REG3)                                0594 00975000
*   REG3->MPSID=MPSMPST;            /* MOVE CHARACTER CONTROL BLOCK     00976000
*                                      ID TO MPST EBCDIC ACRONYM   0595 00977000
*                                                            @Y30APGC*/ 00978000
         MVC   MPSID(4,REG3),@CC02684                              0595 00979000
*   REG3->MPSCRPLQ=0;               /* INITIALYZE POINTER TO QUEUE OF   00980000
*                                      AVAILABLE CRPLS       @Z30APGC*/ 00981000
         SLR   @11,@11                                             0596 00982000
         ST    @11,MPSCRPLQ(,REG3)                                 0596 00983000
*   REG3->MPSRPLCT=0;               /* INITIALIZE COUNT OF CRPLS ON     00984000
*                                      AVAILABE QUEUE        @Z30APGC*/ 00985000
         ST    @11,MPSRPLCT(,REG3)                                 0597 00986000
*   REG3->MPSSYSRT=CVTSRBRT;        /* INITIALIZE SRB DISPATCHER   0598 00987000
*                                      RETURN ADDR           @Z30APGG*/ 00988000
         L     @02,CVTSRBRT(,@02)                                  0598 00989000
         ST    @02,MPSSYSRT(,REG3)                                 0598 00990000
*   RFY                                                            0599 00991000
*     REG3 UNRSTD;                                                 0599 00992000
*                                                                  0599 00993000
*   /*****************************************************************/ 00994000
*   /*                                                               */ 00995000
*   /* ********ALLOCATE AND INITIALIZE 1 SRB AND ********LINK TO MPST*/ 00996000
*   /*                                                               */ 00997000
*   /*****************************************************************/ 00998000
*                                                                  0600 00999000
*   RFY                                                            0600 01000000
*    (RMPST,                                                       0600 01001000
*     REG3,                                                        0600 01002000
*     REG1) RSTD;                                                  0600 01003000
*   RFY                                                            0601 01004000
*     ISTMPST BASED(RMPST);                                        0601 01005000
*   RFY                                                            0602 01006000
*     SRBSECT BASED(REG3);                                         0602 01007000
*L33:                                                              0603 01008000
*   DO;                             /* LISATCVT                    0603 01009000
*                                      CVTBASE(PAGEABLE,(REG1))      */ 01010000
L33      DS    0H                                                  0604 01011000
*     REG1=ATCLCPTR;                /* SET UP ATCVT POINTER          */ 01012000
         L     REG1,ATCLCPTR                                       0604 01013000
*   END;                            /* LISATCVT GET PTR TO ATCVT   0605 01014000
*                                      OBTAIN STORAGE FOR SRB        */ 01015000
*L35:                                                              0606 01016000
*   DO;                             /* REQSTORE                    0606 01017000
*                                      CBID(SRB)CLEAR(YES)SAVE(NO)   */ 01018000
L35      DS    0H                                                  0607 01019000
*                                                                  0607 01020000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 01021000
*/* END OF ATBUILD                                                   */ 01022000
*                                                                  0607 01023000
*     DO;                                                          0607 01024000
*     END;                                                         0608 01025000
*     DO;                                                          0609 01026000
*       RFY                                                        0610 01027000
*        (GPR02P,                                                  0610 01028000
*         GPR03P,                                                  0610 01029000
*         GPR04P,                                                  0610 01030000
*         GPR15P) RSTD;                                            0610 01031000
*     END;                                                         0611 01032000
*     DO;                           /* LISATCVT                    0612 01033000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01034000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 01035000
         L     GPR15P,ATCLCPTR                                     0613 01036000
*     END;                          /* LISATCVT                      */ 01037000
*     GPR02P=GPR15P->ATCBPDA|'80000000'X;                          0615 01038000
         L     GPR02P,ATCBPDA(,GPR15P)                             0615 01039000
         O     GPR02P,@CF01991                                     0615 01040000
*     DCL                                                          0616 01041000
*       1 FMZA0146 FIXED(31) STATIC LOCAL,                         0616 01042000
*        2 * FIXED(8) INIT(144),                                   0616 01043000
*        2 * PTR(24) INIT(0);                                      0616 01044000
*     GPR03F=FMZA0146;                                             0617 01045000
         L     GPR03F,FMZA0146                                     0617 01046000
*     GPR04F=16;                                                   0618 01047000
         LA    GPR04F,16                                           0618 01048000
*     GPR15P=GPR15P->ATCSMRQ;                                      0619 01049000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0619 01050000
*     DCL                                                          0620 01051000
*       FMZL0146 BASED(GPR15P) LABEL VALUERANGE(*);                0620 01052000
*     CALL FMZL0146;                                               0621 01053000
         BALR  @14,@15                                             0621 01054000
*     DO;                                                          0622 01055000
*       RFY                                                        0623 01056000
*        (GPR02P,                                                  0623 01057000
*         GPR03P,                                                  0623 01058000
*         GPR04P,                                                  0623 01059000
*         GPR15P) UNRSTD;                                          0623 01060000
*     END;                                                         0624 01061000
*   END;                            /* REQSTORE                      */ 01062000
*                                                                  0625 01063000
*   /*****************************************************************/ 01064000
*   /*                                                               */ 01065000
*   /* ALL REGS DESTROYED EXCEPT 1,11,12,13                          */ 01066000
*   /*                                                               */ 01067000
*   /*****************************************************************/ 01068000
*                                                                  0626 01069000
*L36:                                                              0626 01070000
*   IF RC<8                         /* STORE AVAILABLE ?             */ 01071000
*     THEN                          /* YES,REG3->STORAGE             */ 01072000
L36      C     RC,@CF00064                                         0626 01073000
         BNL   @RF00626                                            0626 01074000
*     DO;                                                          0627 01075000
*       RMPST=ASXBMPST;             /* REESTAB. MPST BASE            */ 01076000
         L     @02,CVTPTR                                          0628 01077000
         L     @02,CVTTCBP(,@02)                                   0628 01078000
         L     @02,ASCBPTR(,@02)                                   0628 01079000
         L     @02,ASXBPTR(,@02)                                   0628 01080000
         L     RMPST,ASXBMPST(,@02)                                0628 01081000
*       SRBASCB=MPSASCB;            /* INIT COMMON SRB FIELDS        */ 01082000
         L     @11,MPSASCB(,RMPST)                                 0629 01083000
         ST    @11,SRBASCB(,REG3)                                  0629 01084000
*       SRBPASID=MPSASID;                                          0630 01085000
         MVC   SRBPASID(2,REG3),MPSASID(RMPST)                     0630 01086000
*       SRBPARM=RMPST;                                             0631 01087000
         ST    RMPST,SRBPARM(,REG3)                                0631 01088000
*       SRBRMTR=REG1->ATCAP84;      /* INIT SRB TYPE DEPENDENT FIELDS*/ 01089000
         L     @11,ATCAP84(,REG1)                                  0632 01090000
         ST    @11,SRBRMTR(,REG3)                                  0632 01091000
*       SRBID='PS55';                                              0633 01092000
         MVC   SRBID(4,REG3),@CC03768                              0633 01093000
*       SRBEP=REG1->ATCAP55;                                       0634 01094000
         L     @11,ATCAP55(,REG1)                                  0634 01095000
         ST    @11,SRBEP(,REG3)                                    0634 01096000
*       MPSSRB55=REG3;                                             0635 01097000
         ST    REG3,MPSSRB55(,RMPST)                               0635 01098000
*     END;                                                         0636 01099000
*   ELSE                                                           0637 01100000
*     COMPCODE=4;                   /* NO STORAGE,SET COMPCODE       */ 01101000
         B     @RC00626                                            0637 01102000
@RF00626 MVC   COMPCODE(4,SAVEAPTR),@CF00071                       0637 01103000
*   RFY                                                            0638 01104000
*    (RMPST,                                                       0638 01105000
*     REG3) UNRSTD;                                                0638 01106000
@RC00626 DS    0H                                                  0639 01107000
*   IF COMPCODE=0                                                  0639 01108000
*                                                                  0639 01109000
*   /*****************************************************************/ 01110000
*   /*                                                               */ 01111000
*   /* ***********ALLOC. AND INIT. STORAGE MGMT CRA                  */ 01112000
*   /* ***********STORAGE MGMT PAB AND TP PAB*********       @Z40GKD1*/ 01113000
*   /*                                                               */ 01114000
*   /*****************************************************************/ 01115000
*                                                                  0639 01116000
*     THEN                          /* GET STORAGE FOR CRA           */ 01117000
         L     @11,COMPCODE(,SAVEAPTR)                             0639 01118000
         LTR   @11,@11                                             0639 01119000
         BNZ   @RF00639                                            0639 01120000
*L37:                                                              0640 01121000
*     DO;                                                          0640 01122000
L37      DS    0H                                                  0641 01123000
*       DO;                         /* REQSTORE                    0641 01124000
*                                      CBID(CRA)SAVE(NO)CLEAR(YES)   */ 01125000
*                                                                  0642 01126000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 01127000
*/* END OF ATBUILD                                                   */ 01128000
*                                                                  0642 01129000
*         DO;                                                      0642 01130000
*         END;                                                     0643 01131000
*         DO;                                                      0644 01132000
*           RFY                                                    0645 01133000
*            (GPR02P,                                              0645 01134000
*             GPR03P,                                              0645 01135000
*             GPR04P,                                              0645 01136000
*             GPR15P) RSTD;                                        0645 01137000
*         END;                                                     0646 01138000
*         DO;                       /* LISATCVT                    0647 01139000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01140000
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 01141000
         L     GPR15P,ATCLCPTR                                     0648 01142000
*         END;                      /* LISATCVT                      */ 01143000
*         GPR02P=GPR15P->ATCBPDA|'80000000'X;                      0650 01144000
         L     GPR02P,ATCBPDA(,GPR15P)                             0650 01145000
         O     GPR02P,@CF01991                                     0650 01146000
*         DCL                                                      0651 01147000
*           1 FMZA0167 FIXED(31) STATIC LOCAL,                     0651 01148000
*            2 * FIXED(8) INIT(144),                               0651 01149000
*            2 * PTR(24) INIT(0);                                  0651 01150000
*         GPR03F=FMZA0167;                                         0652 01151000
         L     GPR03F,FMZA0167                                     0652 01152000
*         GPR04F=23;                                               0653 01153000
         LA    GPR04F,23                                           0653 01154000
*         GPR15P=GPR15P->ATCSMRQ;                                  0654 01155000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0654 01156000
*         DCL                                                      0655 01157000
*           FMZL0167 BASED(GPR15P) LABEL VALUERANGE(*);            0655 01158000
*         CALL FMZL0167;                                           0656 01159000
         BALR  @14,@15                                             0656 01160000
*         DO;                                                      0657 01161000
*           RFY                                                    0658 01162000
*            (GPR02P,                                              0658 01163000
*             GPR03P,                                              0658 01164000
*             GPR04P,                                              0658 01165000
*             GPR15P) UNRSTD;                                      0658 01166000
*         END;                                                     0659 01167000
*       END;                        /* REQSTORE              @Z40GKD1*/ 01168000
*L38:                                                              0661 01169000
*       IF RC<8                     /* STORAGE AVAILABLE?            */ 01170000
*         THEN                      /* YES                           */ 01171000
L38      C     RC,@CF00064                                         0661 01172000
         BNL   @RF00661                                            0661 01173000
*         DO;                       /* REG 3 -> CRA AREA             */ 01174000
*           RFY                                                    0663 01175000
*             ISTCRA BASED(REG3);   /*                       @Z40GKD1*/ 01176000
*           RFY                                                    0664 01177000
*             ISTRPH BASED(ADDR(CRARPH));/*                  @Z40GKD1*/ 01178000
*           RFY                                                    0665 01179000
*             ISTMPST BASED(RMPST);                                0665 01180000
*           RFY                                                    0666 01181000
*             ISTDYPAB BASED(RDYP);                                0666 01182000
*           RFY                                                    0667 01183000
*             ISTPAB BASED(RPAB);                                  0667 01184000
*           RFY                                                    0668 01185000
*            (RPAB,                                                0668 01186000
*             RDYP,                                                0668 01187000
*             REG3,                                                0668 01188000
*             RMPST) RSTD;                                         0668 01189000
*           RMPST=ASXBMPST;         /* INIT MPST PTR                 */ 01190000
         L     @07,CVTPTR                                          0669 01191000
         L     @07,CVTTCBP(,@07)                                   0669 01192000
         L     @07,ASCBPTR(,@07)                                   0669 01193000
         L     @07,ASXBPTR(,@07)                                   0669 01194000
         L     RMPST,ASXBMPST(,@07)                                0669 01195000
*           RDYP=ADDR(MPSSMPAB);    /* INIT DYPAB & PAB              */ 01196000
         LA    RDYP,MPSSMPAB(,RMPST)                               0670 01197000
*           RPAB=ADDR(DYPPAB);      /* PTRS FOR SM PAB               */ 01198000
         LA    RPAB,DYPPAB(,RDYP)                                  0671 01199000
*           MPSSMRPH=ADDR(CRARPH);  /* STORE RPHPTR IN MPST  @Z40GKD1*/ 01200000
*                                                                  0672 01201000
         LA    @11,CRARPH(,REG3)                                   0672 01202000
         ST    @11,MPSSMRPH(,RMPST)                                0672 01203000
*           /*********************************************************/ 01204000
*           /*                                                       */ 01205000
*           /* ***************INIT RPH                               */ 01206000
*           /*                                                       */ 01207000
*           /*********************************************************/ 01208000
*                                                                  0673 01209000
*           RPHTYPE=RPTYPE;                                        0673 01210000
         LA    @07,52                                              0673 01211000
         ALR   @07,REG3                                            0673 01212000
         MVI   RPHTYPE(@07),X'01'                                  0673 01213000
*           RPHLNGTH=LENGTH(ISTRPH);                               0674 01214000
         MVI   RPHLNGTH(@07),X'6C'                                 0674 01215000
*           RPHPABOF=RPAB-RDYP;                                    0675 01216000
         LR    @04,RPAB                                            0675 01217000
         SLR   @04,RDYP                                            0675 01218000
         STC   @04,RPHPABOF(,@07)                                  0675 01219000
*           RPHMAJCB=RDYP;                                         0676 01220000
         STCM  RDYP,7,RPHMAJCB(@07)                                0676 01221000
*           RPHRESUM='FFFFFF'X;                                    0677 01222000
         MVC   RPHRESUM(3,@07),@CF03783+1                          0677 01223000
*           RPHTSKID=RMPST;                                        0678 01224000
         ST    RMPST,RPHTSKID(,@07)                                0678 01225000
*           RPHCRR=REG3;            /*                       @Z40GKD1*/ 01226000
*                                                                  0679 01227000
         ST    REG3,RPHCRR(,@07)                                   0679 01228000
*           /*********************************************************/ 01229000
*           /*                                                       */ 01230000
*           /* *********INITIALIZE STORAGE MGMT PAB                  */ 01231000
*           /*                                                       */ 01232000
*           /*********************************************************/ 01233000
*                                                                  0680 01234000
*           DYPTYPE=DYTYP;          /* INIT PAB HEADER               */ 01235000
         MVI   DYPTYPE(RDYP),X'11'                                 0680 01236000
*           DYPLNGTH=LENGTH(ISTDYPAB);                             0681 01237000
         MVI   DYPLNGTH(RDYP),X'20'                                0681 01238000
*           DYPTSKID=RMPST;                                        0682 01239000
         ST    RMPST,DYPTSKID(,RDYP)                               0682 01240000
*           PABWEQA=PABWEQG1;                                      0683 01241000
         L     @07,@CF01991                                        0683 01242000
         ST    @07,PABWEQA(,RPAB)                                  0683 01243000
*           PABCHAIN=PABCHNG1;                                     0684 01244000
         ST    @07,PABCHAIN(,RPAB)                                 0684 01245000
*           PABRPHA=MPSSMRPH;                                      0685 01246000
         STCM  @11,7,PABRPHA(RPAB)                                 0685 01247000
*           PABOFFST=RPAB-RDYP;                                    0686 01248000
*                                                                  0686 01249000
         STC   @04,PABOFFST(,RPAB)                                 0686 01250000
*           /*********************************************************/ 01251000
*           /*                                                       */ 01252000
*           /* *********INITALIZE TP PAB                             */ 01253000
*           /*                                                       */ 01254000
*           /*********************************************************/ 01255000
*                                                                  0687 01256000
*           RDYP=ADDR(MPSTPPAB);    /* INIT DYPAB & PAB PTR          */ 01257000
         LA    RDYP,MPSTPPAB(,RMPST)                               0687 01258000
*           RPAB=ADDR(DYPPAB);      /* TO TPPAB                      */ 01259000
         LA    RPAB,DYPPAB(,RDYP)                                  0688 01260000
*           DYPTYPE=DYTYP;                                         0689 01261000
         MVI   DYPTYPE(RDYP),X'11'                                 0689 01262000
*           DYPLNGTH=LENGTH(ISTDYPAB);                             0690 01263000
         MVI   DYPLNGTH(RDYP),X'20'                                0690 01264000
*           DYPTSKID=RMPST;                                        0691 01265000
         ST    RMPST,DYPTSKID(,RDYP)                               0691 01266000
*           PABOFFST=RPAB-RDYP;                                    0692 01267000
         LR    @11,RPAB                                            0692 01268000
         SLR   @11,RDYP                                            0692 01269000
         STC   @11,PABOFFST(,RPAB)                                 0692 01270000
*           PABDVTA=ADDR(REG1->ATCAP23);/*                   @Y30APGC*/ 01271000
         LA    @11,ATCAP23(,REG1)                                  0693 01272000
         STCM  @11,7,PABDVTA(RPAB)                                 0693 01273000
*           RFY                                                    0694 01274000
*            (RPAB,                                                0694 01275000
*             RDYP,                                                0694 01276000
*             REG1,                                                0694 01277000
*             REG3,                                                0694 01278000
*             RMPST) UNRSTD;                                       0694 01279000
*         END;                                                     0695 01280000
*       ELSE                                                       0696 01281000
*         COMPCODE=4;               /* NO STORAGE FOR RPH            */ 01282000
         B     @RC00661                                            0696 01283000
@RF00661 MVC   COMPCODE(4,SAVEAPTR),@CF00071                       0696 01284000
*     END;                                                         0697 01285000
*                                                                  0697 01286000
@RC00661 DS    0H                                                  0698 01287000
*/* SEGMENT(INITMPS)FINISH                                           */ 01288000
*                                                                  0698 01289000
*   DO;                                                            0698 01290000
@RF00639 DS    0H                                                  0699 01291000
*     GOTO INITMPS#;                                               0699 01292000
         B     INITMPS#                                            0699 01293000
*INITMPS@:                                                         0700 01294000
*   END;                                                           0700 01295000
INITMPS@ DS    0H                                                  0701 01296000
*   GEN(EJECT);                                                    0701 01297000
         EJECT                                                          01298000
*                                                                  0702 01299000
*/* SEGMENT(INITMPL)START                                            */ 01300000
*                                                                  0702 01301000
*   DO;                                                            0702 01302000
*     GOTO INITMPL@;                                               0703 01303000
         B     INITMPL@                                            0703 01304000
*INITMPL:                                                          0704 01305000
*   END;                                                           0704 01306000
*                                                                  0704 01307000
INITMPL  DS    0H                                                  0705 01308000
*/********************************************************************/ 01309000
*/*    OBTAINS AND INITIALIZES A MPLT FOR THIS MPST                  */ 01310000
*/********************************************************************/ 01311000
*                                                                  0705 01312000
*   RFY                                                            0705 01313000
*    (BFSIZER8,                                                    0705 01314000
*     INDEXR9,                                                     0705 01315000
*     MPLTREG3) RSTD;               /*                       @Z30APGC*/ 01316000
*/*PICK UP POINTER TO ATCVT IN REGISTER 1 (ATCVTR1)                  */ 01317000
*                                                                  0706 01318000
*   DO;                             /* LISATCVT                    0706 01319000
*                                      CVTBASE(PAGEABLE,(ATCVTR1))   */ 01320000
*     ATCVTR1=ATCLCPTR;             /* SET UP ATCVT POINTER          */ 01321000
         L     @02,ATCLCPTR                                        0707 01322000
         LR    ATCVTR1,@02                                         0707 01323000
*   END;                            /* LISATCVT                      */ 01324000
*   IF ATCVTR1->ATCMPLTA=0          /* POINTER TO 1ST MPLT ON THE  0709 01325000
*                                      CHAIN 0?                      */ 01326000
*     THEN                                                         0709 01327000
         L     @11,ATCMPLTA(,ATCVTR1)                              0709 01328000
         LTR   @11,@11                                             0709 01329000
         BNZ   @RF00709                                            0709 01330000
*     DO;                           /*                       @Z30APGC*/ 01331000
*/********************************************************************/ 01332000
*/* THIS 'DO' LEVEL AND 'DO' LEVELS CONTAINED WITHIN, FINDS THE      */ 01333000
*/*  CORRECT BUFFER SIZE PERTAINING TO THE                           */ 01334000
*/*  SMALL FIXED BUFFER POOL, OBTAINS STORAGE FOR AN MPLT, AND       */ 01335000
*/*   INITIALIZED THE MPLT COUNT IN THE MPLT CONTROL BLOCK           */ 01336000
*/********************************************************************/ 01337000
*                                                                  0711 01338000
*       /*************************************************************/ 01339000
*       /*                                                           */ 01340000
*       /* OBTAIN STORAGE FOR MPLT                                   */ 01341000
*       /*                                                           */ 01342000
*       /*************************************************************/ 01343000
*                                                                  0711 01344000
*/*  REQSTORE DESTROYS ALL REGS EXCEPT 1,11,12,13                    */ 01345000
*/*   @ OF STORAGE RETURNED IN REGISTER 3                            */ 01346000
*                                                                  0711 01347000
*       DO;                         /* REQSTORE                    0711 01348000
*                                      CBID(MPLT)CLEAR(YES)SAVE(NO)  */ 01349000
*                                                                  0712 01350000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 01351000
*/* END OF ATBUILD                                                   */ 01352000
*                                                                  0712 01353000
*         DO;                                                      0712 01354000
*         END;                                                     0713 01355000
*         DO;                                                      0714 01356000
*           RFY                                                    0715 01357000
*            (GPR02P,                                              0715 01358000
*             GPR03P,                                              0715 01359000
*             GPR04P,                                              0715 01360000
*             GPR15P) RSTD;                                        0715 01361000
*         END;                                                     0716 01362000
*         DO;                       /* LISATCVT                    0717 01363000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01364000
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 01365000
         L     @05,ATCLCPTR                                        0718 01366000
         LR    GPR15P,@05                                          0718 01367000
*         END;                      /* LISATCVT                      */ 01368000
*         GPR02P=GPR15P->ATCBPDA|'80000000'X;                      0720 01369000
         L     GPR02P,ATCBPDA(,GPR15P)                             0720 01370000
         O     GPR02P,@CF01991                                     0720 01371000
*         DCL                                                      0721 01372000
*           1 FMZA0195 FIXED(31) STATIC LOCAL,                     0721 01373000
*            2 * FIXED(8) INIT(144),                               0721 01374000
*            2 * PTR(24) INIT(0);                                  0721 01375000
*         GPR03F=FMZA0195;                                         0722 01376000
         L     GPR03F,FMZA0195                                     0722 01377000
*         GPR04F=37;                                               0723 01378000
         LA    GPR04F,37                                           0723 01379000
*         GPR15P=GPR15P->ATCSMRQ;                                  0724 01380000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0724 01381000
*         DCL                                                      0725 01382000
*           FMZL0195 BASED(GPR15P) LABEL VALUERANGE(*);            0725 01383000
*         CALL FMZL0195;                                           0726 01384000
         BALR  @14,@15                                             0726 01385000
*         DO;                                                      0727 01386000
*           RFY                                                    0728 01387000
*            (GPR02P,                                              0728 01388000
*             GPR03P,                                              0728 01389000
*             GPR04P,                                              0728 01390000
*             GPR15P) UNRSTD;                                      0728 01391000
*         END;                                                     0729 01392000
*       END;                        /* REQSTORE                      */ 01393000
*       IF RC^<8                    /* CHECK RETURN CODE IN R15    0731 01394000
*                                                            @Z30APGC*/ 01395000
*         THEN                                                     0731 01396000
         C     RC,@CF00064                                         0731 01397000
         BL    @RF00731                                            0731 01398000
*         COMPCODE=4;               /* NO STORAGE AVAILABLE  @Z30APGC*/ 01399000
         MVC   COMPCODE(4,SAVEAPTR),@CF00071                       0732 01400000
*       ELSE                        /*                       @Z30APGC*/ 01401000
*         DO;                       /*                       @Z30APGC*/ 01402000
         B     @RC00731                                            0733 01403000
@RF00731 DS    0H                                                  0734 01404000
*           BFSIZER8=0;             /* INITIALIZE BUFFER SIZE      0734 01405000
*                                      VARIABLE              @Z30APGC*/ 01406000
         SLR   BFSIZER8,BFSIZER8                                   0734 01407000
*           DO INDEXR9=1 BY 1 TO ATCVTR1->ATCBPDA/* POINTER TO BUFFER   01408000
*                                      POOL DIRECTORY                */ 01409000
*                 ->BPDBPENT        /* CURRENT NUMBER OF BUFFER POOL    01410000
*                                      ENTRIES                       */ 01411000
*                 WHILE BFSIZER8=0; /*                       @Z30APGC*/ 01412000
         LA    INDEXR9,1                                           0735 01413000
         B     @DE00735                                            0735 01414000
@DL00735 LTR   BFSIZER8,BFSIZER8                                   0735 01415000
         BNZ   @DC00735                                            0735 01416000
*             IF(ATCVTR1->ATCBPDA   /* POINTER TO BUFFER POOL      0736 01417000
*                                      DIRECTORY                     */ 01418000
*                 ->BPDFBPE         /* POINTER TO 1ST BUFFER POOL  0736 01419000
*                                      ENTRY                         */ 01420000
*                 +((INDEXR9-1)*LENGTH(ISTBPENT)))/* INDEX INTO    0736 01421000
*                                      BUFFER POOL ENTRIES           */ 01422000
*                 ->BPEPID          /* BUFFER POOL ID        @Z30APGC*/ 01423000
*                 ^='SF00'          /*                       @Z30APGC*/ 01424000
*               THEN                                               0736 01425000
         L     @02,ATCBPDA(,ATCVTR1)                               0736 01426000
         LR    @11,INDEXR9                                         0736 01427000
         BCTR  @11,0                                               0736 01428000
         SLA   @11,4                                               0736 01429000
         AL    @11,BPDFBPE(,@02)                                   0736 01430000
         CLC   BPEPID(4,@11),@CC03791                              0736 01431000
         BNE   @RT00736                                            0736 01432000
*               ;                   /* CONTINUE SEARCH FOR CORRECT 0737 01433000
*                                      BUFFER POOL           @Z30APGC*/ 01434000
*             ELSE                  /*                       @Z30APGC*/ 01435000
*               BFSIZER8=(ATCVTR1->ATCBPDA/* POINTER TO BUFFER POOL     01436000
*                                      DIRECTORY                     */ 01437000
*                   ->BPDFBPE       /* POINTER TO 1ST BUFFER POOL  0738 01438000
*                                      ENTRY                         */ 01439000
*                   +((INDEXR9-1)*LENGTH(ISTBPENT)))/* INDEX INTO  0738 01440000
*                                      BUFFER POOL ENTRIES   @Z30APGC*/ 01441000
*                   ->BPEBFSIZ;     /* BUFFER SIZE IN BYTES  @Z30APGC*/ 01442000
         L     @02,ATCBPDA(,ATCVTR1)                               0738 01443000
         LR    @11,INDEXR9                                         0738 01444000
         BCTR  @11,0                                               0738 01445000
         SLA   @11,4                                               0738 01446000
         AL    @11,BPDFBPE(,@02)                                   0738 01447000
         LH    BFSIZER8,BPEBFSIZ(,@11)                             0738 01448000
*           END;                    /*                       @Z30APGC*/ 01449000
@RT00736 AL    INDEXR9,@CF00038                                    0739 01450000
@DE00735 L     @02,ATCBPDA(,ATCVTR1)                               0739 01451000
         CH    INDEXR9,BPDBPENT(,@02)                              0739 01452000
         BNH   @DL00735                                            0739 01453000
@DC00735 DS    0H                                                  0740 01454000
*           ATCVTR1->ATCMPLTA=MPLTREG3;/* MOVE @ OF MPLT IN R3 MPST     01455000
*                                      LIST TABLE            @Z30APGC*/ 01456000
         ST    MPLTREG3,ATCMPLTA(,ATCVTR1)                         0740 01457000
*           MPLTREG3->MPLECNT=(BFSIZER8-LENGTH(ISTMPLT))/LENGTH(MPLCDS) 01458000
*               ;                   /* SET NUMBER OF ENTRIES INTO  0741 01459000
*                                      MPLECNT               @Z30APGC*/ 01460000
         LR    @04,BFSIZER8                                        0741 01461000
         SL    @04,@CF00152                                        0741 01462000
         SRDA  @04,32                                              0741 01463000
         D     @04,@CF00064                                        0741 01464000
         STH   @05,MPLECNT(,MPLTREG3)                              0741 01465000
*           MPLTREG3->MPLID=MPLCON; /* SET IDENTIFIER INTO MPLID   0742 01466000
*                                                            @Z30APGC*/ 01467000
         MVC   MPLID(4,MPLTREG3),@CC02634                          0742 01468000
*         END;                      /*                       @Z30APGC*/ 01469000
*     END;                          /*                       @Z30APGC*/ 01470000
*   ELSE                            /*                       @Z30APGC*/ 01471000
*     MPLTREG3=ATCVTR1->ATCMPLTA;   /* MOVE POINTER TO 1ST MPLT ON 0745 01472000
*                                      CHAIN TO R3           @Z30APGC*/ 01473000
         B     @RC00709                                            0745 01474000
@RF00709 L     MPLTREG3,ATCMPLTA(,ATCVTR1)                         0745 01475000
*   RFY                                                            0746 01476000
*    (BFSIZER8,                                                    0746 01477000
*     INDEXR9) UNRSTD;              /*                       @Z30APGC*/ 01478000
@RC00709 DS    0H                                                  0747 01479000
*   DO INDEXR1=1 BY 1 WHILE COMPCODE=0;/*                    @Z30APGC*/ 01480000
         LA    INDEXR1,1                                           0747 01481000
         B     @DE00747                                            0747 01482000
@DL00747 DS    0H                                                  0748 01483000
*/********************************************************************/ 01484000
*/*THIS 'DO' LEVEL AND 'DO' LEVELS CONTAINED WITHIN                  */ 01485000
*/*                  SEARCHES FOR AN MPLT ENTRY WITH A ZERO MPST @.  */ 01486000
*/*   IF AN MPLT ENTRY WITH A ZERO MPST @ CANNOT BE FOUND, AN MPLT IS*/ 01487000
*/*  REQSTORE'ED. IN EITHER CASE THE MPLT IS THEN INITIALIZED        */ 01488000
*/********************************************************************/ 01489000
*                                                                  0748 01490000
*     IF MPLTREG3->MPLADDR(INDEXR1) /* INDEX INTO MPLT ENTRIES     0748 01491000
*                                      (MPLCDS) INORDER TO CHECK THE    01492000
*                                      MPST @                @Z30APGC*/ 01493000
*         ^=0                       /*                       @Z30APGC*/ 01494000
*       THEN                                                       0748 01495000
         LR    @02,INDEXR1                                         0748 01496000
         SLA   @02,3                                               0748 01497000
         L     @02,MPLADDR-8(@02,MPLTREG3)                         0748 01498000
         LTR   @02,@02                                             0748 01499000
         BNZ   @RT00748                                            0748 01500000
*       ;                           /* CONTINUE WITH SEARCH FOR A  0749 01501000
*                                      ZERO MPST @ IN A MPLT ENTRY   */ 01502000
*     ELSE                          /*                       @Z30APGC*/ 01503000
*       DO;                         /*                       @Z30APGC*/ 01504000
*/*  SETUP FOR CDS INSTRUCTION  TO MOVE THE @ OF THIS MPST WITH    0751 01505000
*      ASSOCIATED ASID INTO THIS MPLT ENTRY                          */ 01506000
*                                                                  0751 01507000
*         RFY                                                      0751 01508000
*          (REG6,                                                  0751 01509000
*           REG7,                                                  0751 01510000
*           REG4,                                                  0751 01511000
*           REG5) RSTD;             /*                       @Z30APGC*/ 01512000
*         REG6=0;                   /*                       @Z30APGC*/ 01513000
         SLR   REG6,REG6                                           0752 01514000
*         REG7=0;                   /*                       @Z30APGC*/ 01515000
         SLR   REG7,REG7                                           0753 01516000
*         MPSTREG4=ASXBMPST;        /* POINTER TO MPST       @Z30APGC*/ 01517000
         L     @02,CVTPTR                                          0754 01518000
         L     @02,CVTTCBP(,@02)                                   0754 01519000
         L     @02,ASCBPTR(,@02)                                   0754 01520000
         L     @11,ASXBPTR(,@02)                                   0754 01521000
         L     MPSTREG4,ASXBMPST(,@11)                             0754 01522000
*         CBIDREG5=ASCBASID;        /* @ SPACE IDENTIFIER FOR THE  0755 01523000
*                                      ASCB                  @Z30APGC*/ 01524000
         LH    CBIDREG5,ASCBASID(,@02)                             0755 01525000
         N     CBIDREG5,@CF03915                                   0755 01526000
*         SLL(CBIDREG5,16);         /* SHIFT LEFT 16 BITS SO THE @ 0756 01527000
*                                      SPACE ID FOR THE ASCB WILL BE    01528000
*                                      STORED IN THE MPLASID FIELD OF   01529000
*                                      THE MPLT UPON EXECUTION OF THE   01530000
*                                      CDS INSTRUCTION               */ 01531000
         SLL   CBIDREG5,16                                         0756 01532000
*         CDS(REG6,MPSTREG4,MPLTREG3->MPLCDS(INDEXR1));/*    @Z30APGC*/ 01533000
         LR    @02,INDEXR1                                         0757 01534000
         SLA   @02,3                                               0757 01535000
         ALR   @02,MPLTREG3                                        0757 01536000
         CDS   REG6,MPSTREG4,MPLCDS-8(@02)                         0757 01537000
*         BC(7,SWAPFAIL);           /*                       @ZM33534*/ 01538000
         BC    7,SWAPFAIL                                          0758 01539000
*         INDEXR1=INDEXR1-1;        /* POINT IT ONE ABOVE ACTUAL MPLT   01540000
*                                      ENTRY                 @OZ03515*/ 01541000
         BCTR  INDEXR1,0                                           0759 01542000
*         MPSTREG4->MPSSAVE(1:4)=ADDR(MPLTREG3->MPLCDS(INDEXR1));  0760 01543000
*                                                                  0760 01544000
         LR    @02,INDEXR1                                         0760 01545000
         SLA   @02,3                                               0760 01546000
         LA    @02,MPLCDS-8(@02,MPLTREG3)                          0760 01547000
         STCM  @02,15,MPSSAVE(MPSTREG4)                            0760 01548000
*         /***********************************************************/ 01549000
*         /*                                                         */ 01550000
*         /* SAVE PTR TO MPLT ENTRY IN MPST                  @OZ03515*/ 01551000
*         /*                                                         */ 01552000
*         /***********************************************************/ 01553000
*                                                                  0761 01554000
*         MPLTSW=MPLTSW|SWON;       /* SET MPLT SW           @OZ03515*/ 01555000
         O     MPLTSW,@CF01991                                     0761 01556000
*         GO TO GETOUT;             /* FINISHED              @ZM33534*/ 01557000
         B     GETOUT                                              0762 01558000
*         RFY                                                      0763 01559000
*          (REG6,                                                  0763 01560000
*           REG7,                                                  0763 01561000
*           REG4,                                                  0763 01562000
*           REG5) UNRSTD;           /*                       @Z30APGC*/ 01563000
*       END;                        /*                       @Z30APGC*/ 01564000
*SWAPFAIL:                                                         0765 01565000
*     ;                             /* LABEL FOR FAILING CDS @ZM33534*/ 01566000
@RT00748 DS    0H                                                  0765 01567000
SWAPFAIL DS    0H                                                  0766 01568000
*     IF INDEXR1^=MPLTREG3->MPLECNT /* COUNT OF MPLCDS ENTRIES     0766 01569000
*                                                            @Z30APGC*/ 01570000
*       THEN                                                       0766 01571000
         CH    INDEXR1,MPLECNT(,MPLTREG3)                          0766 01572000
         BNE   @RT00766                                            0766 01573000
*       ;                           /* CONTINUE WITH SEARCH FOR A  0767 01574000
*                                      ZERO MPST @ IN A MPLT ENTRY   */ 01575000
*     ELSE                          /*                       @Z30APGC*/ 01576000
*       IF MPLTREG3->MPLCHN^=0      /* POINTER TO NEXT MPLT NOT 0? 0768 01577000
*                                                            @Z30APGC*/ 01578000
*         THEN                      /*                       @Z30APGC*/ 01579000
         L     @02,MPLCHN(,MPLTREG3)                               0768 01580000
         LTR   @02,@02                                             0768 01581000
         BZ    @RF00768                                            0768 01582000
*         DO;                       /*                       @Z30APGC*/ 01583000
*           MPLTREG3=MPLTREG3->MPLCHN;/* MOVE POINTER TO NEXT MPLT TO   01584000
*                                      R3                    @Z30APGC*/ 01585000
         LR    MPLTREG3,@02                                        0770 01586000
*           INDEXR1=0;              /* RESET INDEX VALUE     @Z30APGC*/ 01587000
         SLR   INDEXR1,INDEXR1                                     0771 01588000
*         END;                      /*                       @Z30APGC*/ 01589000
*       ELSE                                                       0773 01590000
*         DO;                       /*                       @Z30APGC*/ 01591000
         B     @RC00768                                            0773 01592000
@RF00768 DS    0H                                                  0774 01593000
*           RFY                                                    0774 01594000
*             OLDMPL11 RSTD;        /*                       @Z30APGC*/ 01595000
*           OLDMPL11=MPLTREG3;      /* SAVE MPLT@ IN R11     @Z30APGC*/ 01596000
         LR    OLDMPL11,MPLTREG3                                   0775 01597000
*/*  OBTAIN STORAGE FOR ANOTHER MPLT                                 */ 01598000
*/*   REQSTORE DESTROYS ALL REGS EXCEPT 1,11,12, AND 13              */ 01599000
*                                                                  0776 01600000
*           DO;                     /* REQSTORE                    0776 01601000
*                                      CBID(MPLT)CLEAR(YES)SAVE(NO)  */ 01602000
*                                                                  0777 01603000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 01604000
*/* END OF ATBUILD                                                   */ 01605000
*                                                                  0777 01606000
*             DO;                                                  0777 01607000
*             END;                                                 0778 01608000
*             DO;                                                  0779 01609000
*               RFY                                                0780 01610000
*                (GPR02P,                                          0780 01611000
*                 GPR03P,                                          0780 01612000
*                 GPR04P,                                          0780 01613000
*                 GPR15P) RSTD;                                    0780 01614000
*             END;                                                 0781 01615000
*             DO;                   /* LISATCVT                    0782 01616000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01617000
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */ 01618000
         L     GPR15P,ATCLCPTR                                     0783 01619000
*             END;                  /* LISATCVT                      */ 01620000
*             GPR02P=GPR15P->ATCBPDA|'80000000'X;                  0785 01621000
         L     GPR02P,ATCBPDA(,GPR15P)                             0785 01622000
         O     GPR02P,@CF01991                                     0785 01623000
*             DCL                                                  0786 01624000
*               1 FMZA0216 FIXED(31) STATIC LOCAL,                 0786 01625000
*                2 * FIXED(8) INIT(144),                           0786 01626000
*                2 * PTR(24) INIT(0);                              0786 01627000
*             GPR03F=FMZA0216;                                     0787 01628000
         L     GPR03F,FMZA0216                                     0787 01629000
*             GPR04F=37;                                           0788 01630000
         LA    GPR04F,37                                           0788 01631000
*             GPR15P=GPR15P->ATCSMRQ;                              0789 01632000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0789 01633000
*             DCL                                                  0790 01634000
*               FMZL0216 BASED(GPR15P) LABEL VALUERANGE(*);        0790 01635000
*             CALL FMZL0216;                                       0791 01636000
         BALR  @14,@15                                             0791 01637000
*             DO;                                                  0792 01638000
*               RFY                                                0793 01639000
*                (GPR02P,                                          0793 01640000
*                 GPR03P,                                          0793 01641000
*                 GPR04P,                                          0793 01642000
*                 GPR15P) UNRSTD;                                  0793 01643000
*             END;                                                 0794 01644000
*           END;                    /* REQSTORE                      */ 01645000
*           IF RC^<8                /* CHECK RETURN CODE IN R15    0796 01646000
*                                                            @Z30APGC*/ 01647000
*             THEN                                                 0796 01648000
         C     RC,@CF00064                                         0796 01649000
         BL    @RF00796                                            0796 01650000
*             COMPCODE=4;           /* SET A BAD RETURN CODE @Z30APGC*/ 01651000
         MVC   COMPCODE(4,SAVEAPTR),@CF00071                       0797 01652000
*           ELSE                                                   0798 01653000
*             DO;                   /*                       @Z30APGC*/ 01654000
         B     @RC00796                                            0798 01655000
@RF00796 DS    0H                                                  0799 01656000
*               MPLTREG3->MPLECNT=OLDMPL11->MPLECNT;/* SET MPLECNT IN   01657000
*                                      NEW MPLT FROM PREVIOUS MPLT 0799 01658000
*                                                            @Z30APGC*/ 01659000
         LH    @10,MPLECNT(,OLDMPL11)                              0799 01660000
         STH   @10,MPLECNT(,MPLTREG3)                              0799 01661000
*               MPLTREG3->MPLID=MPLCON;/* SET IDENTIFIER INTO MPLID     01662000
*                                                            @Z30APGC*/ 01663000
*                                                                  0800 01664000
         MVC   MPLID(4,MPLTREG3),@CC02634                          0800 01665000
*               /*****************************************************/ 01666000
*               /*                                                   */ 01667000
*               /* SETUP FOR CS INSTRUCTION TO PUT NEW MPLT ON THE   */ 01668000
*               /* CHAIN                                             */ 01669000
*               /*                                                   */ 01670000
*               /*****************************************************/ 01671000
*                                                                  0801 01672000
*               REG0=0;             /*                       @Z30APGC*/ 01673000
         SLR   REG0,REG0                                           0801 01674000
*               INDEXR1=0;          /* RESET INDEX VALUE     @Z30APGC*/ 01675000
         SLR   INDEXR1,INDEXR1                                     0802 01676000
*               CS(REG0,MPLTREG3,OLDMPL11->MPLCHN);/*        @Z30APGC*/ 01677000
         CS    REG0,@03,MPLCHN(OLDMPL11)                           0803 01678000
*               BC(8,MPLTGOT);      /*                       @Z30APGC*/ 01679000
*                                                                  0804 01680000
         BC    8,MPLTGOT                                           0804 01681000
*               /*****************************************************/ 01682000
*               /*                                                   */ 01683000
*               /* RELEASE MPLT JUST GOT SINCE SOMEONE JUST PUT A NEW*/ 01684000
*               /* MPLT ON THE CHAIN RELSTORE DESTROYS ALL REGS      */ 01685000
*               /* EXCEPT 1,11,12 AND 13                             */ 01686000
*               /*                                                   */ 01687000
*               /*****************************************************/ 01688000
*                                                                  0805 01689000
*               DO;                 /* RELSTORE                    0805 01690000
*                                      BUFADDR(MPLTREG3)SAVE(NO)     */ 01691000
*                                                                  0806 01692000
*                 /***************************************************/ 01693000
*                 /*                                                 */ 01694000
*                 /* RELSTORE BUFADDR(MPLTREG3)SAVE(NO)              */ 01695000
*                 /*                                                 */ 01696000
*                 /***************************************************/ 01697000
*                                                                  0806 01698000
*                 DO;                                              0806 01699000
*                                                                  0806 01700000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 01701000
*/* END OF ATBUILD                                                   */ 01702000
*                                                                  0807 01703000
*                   DO;                                            0807 01704000
*                   END;                                           0808 01705000
*                   DO;                                            0809 01706000
*                     RFY                                          0810 01707000
*                      (GPR02P,                                    0810 01708000
*                       GPR03P,                                    0810 01709000
*                       GPR04P,                                    0810 01710000
*                       GPR15P) RSTD;                              0810 01711000
*                   END;                                           0811 01712000
*                   GPR04P=MPLTREG3;                               0812 01713000
         LR    GPR04P,MPLTREG3                                     0812 01714000
*                   DCL                                            0813 01715000
*                     1 FMZA0237 FIXED(31) STATIC LOCAL,           0813 01716000
*                      2 * FIXED(8) INIT(0),                       0813 01717000
*                      2 * PTR(24) INIT(0);                        0813 01718000
*                   GPR03F=FMZA0237;                               0814 01719000
         L     GPR03F,FMZA0237                                     0814 01720000
*                   DO;             /* LISATCVT                    0815 01721000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01722000
*                     GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER        */ 01723000
         L     GPR15P,ATCLCPTR                                     0816 01724000
*                   END;            /* LISATCVT                      */ 01725000
*                   GPR02P=GPR15P->ATCBPDA;                        0818 01726000
         L     GPR02P,ATCBPDA(,GPR15P)                             0818 01727000
*                   GPR15P=GPR15P->ATCSMRS;                        0819 01728000
         L     GPR15P,ATCSMRS(,GPR15P)                             0819 01729000
*                   DCL                                            0820 01730000
*                     FMZL0237 BASED(GPR15P) LABEL VALUERANGE(*);  0820 01731000
*                   CALL FMZL0237;                                 0821 01732000
         BALR  @14,@15                                             0821 01733000
*                   DO;                                            0822 01734000
*                     RFY                                          0823 01735000
*                      (GPR02P,                                    0823 01736000
*                       GPR03P,                                    0823 01737000
*                       GPR04P,                                    0823 01738000
*                       GPR15P) UNRSTD;                            0823 01739000
*                   END;                                           0824 01740000
*                 END;                                             0825 01741000
*               END;                /* RELSTORE                      */ 01742000
*               MPLTREG3=OLDMPL11->MPLCHN;/* GET POINTER TO NEXT MPLT   01743000
*                                                            @Z30APGC*/ 01744000
         L     MPLTREG3,MPLCHN(,OLDMPL11)                          0827 01745000
*MPLTGOT:                                                          0828 01746000
*               ;                   /*                       @Z30APGC*/ 01747000
MPLTGOT  DS    0H                                                  0829 01748000
*             END;                  /*                       @Z30APGC*/ 01749000
*           RFY                                                    0830 01750000
*             OLDMPL11 UNRSTD;      /*                       @Z30APGC*/ 01751000
@RC00796 DS    0H                                                  0831 01752000
*         END;                      /*                       @Z30APGC*/ 01753000
*   END;                            /*                       @Z30APGC*/ 01754000
@RC00768 DS    0H                                                  0832 01755000
@RT00766 AL    INDEXR1,@CF00038                                    0832 01756000
@DE00747 L     @02,COMPCODE(,SAVEAPTR)                             0832 01757000
         LTR   @02,@02                                             0832 01758000
         BZ    @DL00747                                            0832 01759000
*   RFY                                                            0833 01760000
*     MPLTREG3 UNRSTD;              /*                       @Z30APGC*/ 01761000
*GETOUT:                                                           0834 01762000
*   ;                               /*                       @Z30APGC*/ 01763000
GETOUT   DS    0H                                                  0835 01764000
*/* SEGMENT(INITMPL)FINISH                                           */ 01765000
*                                                                  0835 01766000
*   DO;                                                            0835 01767000
*     GOTO INITMPL#;                                               0836 01768000
         B     INITMPL#                                            0836 01769000
*INITMPL@:                                                         0837 01770000
*   END;                                                           0837 01771000
INITMPL@ DS    0H                                                  0838 01772000
*   GEN(EJECT);                                                    0838 01773000
         EJECT                                                          01774000
*                                                                  0839 01775000
*/* SEGMENT(DEBSRCH)START                                            */ 01776000
*                                                                  0839 01777000
*   DO;                                                            0839 01778000
*     GOTO DEBSRCH@;                                               0840 01779000
         B     DEBSRCH@                                            0840 01780000
*DEBSRCH:                                                          0841 01781000
*   END;                                                           0841 01782000
*                                                                  0841 01783000
DEBSRCH  DS    0H                                                  0842 01784000
*   /*****************************************************************/ 01785000
*   /*                                                               */ 01786000
*   /* ****************DEBSRCH ROUTINE ****INPUT REG1 IN SAVE AREA   */ 01787000
*   /* ****OUTPUT 1) IF DEB FOUND *** FOUNDSW=1 *** DEBPTR->VTAM DEB */ 01788000
*   /* FOUND *** IF DEB NOT FOUND *** FOUNDSW=0 *** 2) ACDTCB FIELD  */ 01789000
*   /* OF VTAM DEB ON ENTRY IS                                 SET****/ 01790000
*   /*                                                               */ 01791000
*   /*****************************************************************/ 01792000
*                                                                  0842 01793000
*   RFY                                                            0842 01794000
*    (RTBL,                                                        0842 01795000
*     RTCB,                                                        0842 01796000
*     DEBPTR,                                                      0842 01797000
*     FOUNDSW) RSTD;                                               0842 01798000
*   RFY                                                            0843 01799000
*     ISTDCE BASED(RTBL);                                          0843 01800000
*   RFY                                                            0844 01801000
*     ISTACDEB BASED(DEBPTR);                                      0844 01802000
*L39:                                                              0845 01803000
*   RTBL=ASXBMPST->MPSDBTBL;        /* RTBL->BEG. OF DEB ENTRY LIST  */ 01804000
L39      L     @09,CVTPTR                                          0845 01805000
         L     @09,CVTTCBP(,@09)                                   0845 01806000
         L     @04,ASCBPTR(,@09)                                   0845 01807000
         L     @04,ASXBPTR(,@04)                                   0845 01808000
         L     @04,ASXBMPST(,@04)                                  0845 01809000
         L     RTBL,MPSDBTBL(,@04)                                 0845 01810000
*   RTCB=TCBPTR;                                                   0846 01811000
         L     RTCB,TCBPTR-1(,@09)                                 0846 01812000
         LA    RTCB,0(,RTCB)                                       0846 01813000
*   FOUNDSW=0;                                                     0847 01814000
         SLR   FOUNDSW,FOUNDSW                                     0847 01815000
*   DO WHILE((RTBL^=0)&(FOUNDSW^=1));                              0848 01816000
         B     @DE00848                                            0848 01817000
@DL00848 DS    0H                                                  0849 01818000
*     DEBPTR=DCEDBPTR;              /* ACDEB BELONG TO THIS TASK?    */ 01819000
         L     DEBPTR,DCEDBPTR(,RTBL)                              0849 01820000
*     IF ACDTCB^=RTCB               /* TCB @ IN DEB NOT EQUAL THE  0850 01821000
*                                      ACTIVE TASK?                  */ 01822000
*       THEN                                                       0850 01823000
         C     RTCB,ACDTCB(,DEBPTR)                                0850 01824000
         BE    @RF00850                                            0850 01825000
*       RTBL=DCECHN;                /* GO TO NXT ENTRY               */ 01826000
         L     RTBL,DCECHN(,RTBL)                                  0851 01827000
*     ELSE                                                         0852 01828000
*       FOUNDSW=1;                  /* FOUND VTAM DEB                */ 01829000
         B     @RC00850                                            0852 01830000
@RF00850 LA    FOUNDSW,1                                           0852 01831000
*   END;                                                           0853 01832000
@RC00850 DS    0H                                                  0853 01833000
@DE00848 LTR   RTBL,RTBL                                           0853 01834000
         BZ    @DC00848                                            0853 01835000
         C     FOUNDSW,@CF00038                                    0853 01836000
         BNE   @DL00848                                            0853 01837000
@DC00848 DS    0H                                                  0854 01838000
*   ACDEBPTR->ACDTCB=RTCB;          /* SET ACDTCB FIELD IN ACDEB   0854 01839000
*                                      PASSED ON ENTRY               */ 01840000
         L     @09,ACDEBPTR(,SAVEAPTR)                             0854 01841000
         ST    RTCB,ACDTCB(,@09)                                   0854 01842000
*   RFY                                                            0855 01843000
*    (RTBL,                                                        0855 01844000
*     DEBPTR,                                                      0855 01845000
*     RTCB,                                                        0855 01846000
*     FOUNDSW) UNRSTD;                                             0855 01847000
*                                                                  0855 01848000
*/* SEGMENT(DEBSRCH)FINISH                                           */ 01849000
*                                                                  0856 01850000
*   DO;                                                            0856 01851000
*     GOTO DEBSRCH#;                                               0857 01852000
         B     DEBSRCH#                                            0857 01853000
*DEBSRCH@:                                                         0858 01854000
*   END;                                                           0858 01855000
DEBSRCH@ DS    0H                                                  0859 01856000
*   GEN(EJECT);                                                    0859 01857000
         EJECT                                                          01858000
*                                                                  0860 01859000
*/* SEGMENT(INITPST)START                                            */ 01860000
*                                                                  0860 01861000
*   DO;                                                            0860 01862000
*     GOTO INITPST@;                                               0861 01863000
         B     INITPST@                                            0861 01864000
*INITPST:                                                          0862 01865000
*   END;                                                           0862 01866000
*                                                                  0862 01867000
INITPST  DS    0H                                                  0863 01868000
*   /*****************************************************************/ 01869000
*   /*                                                               */ 01870000
*   /* ************INPUT:REG3-> PST AREA ************ REG13-> SAVE   */ 01871000
*   /* AREA                                                          */ 01872000
*   /*                                                               */ 01873000
*   /*****************************************************************/ 01874000
*                                                                  0863 01875000
*   RFY                                                            0863 01876000
*     ISTPST BASED(PSTPTR);         /*                       @Z40GKF6*/ 01877000
*   RFY                                                            0864 01878000
*     PSTPTR RSTD;                  /* GLOBAL RESTRICT IN THIS SUBRTN*/ 01879000
*   RFY                                                            0865 01880000
*     RDEB RSTD;                    /* GLOBAL RESTRICT IN THIS SUBRTN*/ 01881000
*   RFY                                                            0866 01882000
*    (REG3) RSTD;                   /*                       @Z40GKF6*/ 01883000
*L40:                                                              0867 01884000
*   PSTPTR=REG3;                    /* ESTAB. PST BASE               */ 01885000
L40      LR    PSTPTR,REG3                                         0867 01886000
*   RFY                                                            0868 01887000
*     ISTACDEB BASED(RDEB);         /*                       @Z40GKD1*/ 01888000
*   RDEB=ACDEBPTR;                  /* SET ACDEB BASE        @Z40GKD1*/ 01889000
         L     RDEB,ACDEBPTR(,SAVEAPTR)                            0869 01890000
*   PSTACBCT=1;                     /* INCREMENT PST OPEN ACB COUNT     01891000
*                                                            @Z40GKD1*/ 01892000
         MVC   PSTACBCT(4,PSTPTR),@CF00038                         0870 01893000
*   ACDTSKID=PSTPTR;                /* SET DEB TSKID         @Z40GKD1*/ 01894000
*                                                                  0871 01895000
         ST    PSTPTR,ACDTSKID(,RDEB)                              0871 01896000
*   /*****************************************************************/ 01897000
*   /*                                                               */ 01898000
*   /* ALLOCATE STORAGE FOR SMS CRA                          @Z40GKF6*/ 01899000
*   /*                                                               */ 01900000
*   /*****************************************************************/ 01901000
*                                                                  0872 01902000
*L41:                                                              0872 01903000
*   DO;                             /* REQSTORE                    0872 01904000
*                                      CBID(CRA)CLEAR(YES)SAVE(NO)   */ 01905000
L41      DS    0H                                                  0873 01906000
*                                                                  0873 01907000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 01908000
*/* END OF ATBUILD                                                   */ 01909000
*                                                                  0873 01910000
*     DO;                                                          0873 01911000
*     END;                                                         0874 01912000
*     DO;                                                          0875 01913000
*       RFY                                                        0876 01914000
*        (GPR02P,                                                  0876 01915000
*         GPR03P,                                                  0876 01916000
*         GPR04P,                                                  0876 01917000
*         GPR15P) RSTD;                                            0876 01918000
*     END;                                                         0877 01919000
*     DO;                           /* LISATCVT                    0878 01920000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01921000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 01922000
         L     GPR15P,ATCLCPTR                                     0879 01923000
*     END;                          /* LISATCVT                      */ 01924000
*     GPR02P=GPR15P->ATCBPDA|'80000000'X;                          0881 01925000
         L     GPR02P,ATCBPDA(,GPR15P)                             0881 01926000
         O     GPR02P,@CF01991                                     0881 01927000
*     DCL                                                          0882 01928000
*       1 FMZA0264 FIXED(31) STATIC LOCAL,                         0882 01929000
*        2 * FIXED(8) INIT(144),                                   0882 01930000
*        2 * PTR(24) INIT(0);                                      0882 01931000
*     GPR03F=FMZA0264;                                             0883 01932000
         L     GPR03F,FMZA0264                                     0883 01933000
*     GPR04F=23;                                                   0884 01934000
         LA    GPR04F,23                                           0884 01935000
*     GPR15P=GPR15P->ATCSMRQ;                                      0885 01936000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0885 01937000
*     DCL                                                          0886 01938000
*       FMZL0264 BASED(GPR15P) LABEL VALUERANGE(*);                0886 01939000
*     CALL FMZL0264;                                               0887 01940000
         BALR  @14,@15                                             0887 01941000
*     DO;                                                          0888 01942000
*       RFY                                                        0889 01943000
*        (GPR02P,                                                  0889 01944000
*         GPR03P,                                                  0889 01945000
*         GPR04P,                                                  0889 01946000
*         GPR15P) UNRSTD;                                          0889 01947000
*     END;                                                         0890 01948000
*   END;                            /* REQSTORE                      */ 01949000
*                                                                  0891 01950000
*   /*****************************************************************/ 01951000
*   /*                                                               */ 01952000
*   /* ALL REGS DESTROYED EXCP 1,11,12,13                            */ 01953000
*   /*                                                               */ 01954000
*   /*****************************************************************/ 01955000
*                                                                  0892 01956000
*L42:                                                              0892 01957000
*   IF RC<8                         /* IF STORAGE AVAIL              */ 01958000
*     THEN                                                         0892 01959000
L42      LA    @10,8                                               0892 01960000
         CR    RC,@10                                              0892 01961000
         BNL   @RF00892                                            0892 01962000
*     DO;                           /*                       @Z40GKD1*/ 01963000
*       PSTCRRS=REG3;               /* STORE CRAPTR IN PST   @Z40GKF6*/ 01964000
         ST    REG3,PSTCRRS(,PSTPTR)                               0894 01965000
*       DO;                         /* SMSID                       0895 01966000
*                                      BUFF(PSTCRRS)TSKID(PSTPTR)    */ 01967000
*         DCL                                                      0896 01968000
*           1 CMZ0285A PTR(31) BASED((PSTCRRS)-8),                 0896 01969000
*            2 * BIT(8),                                           0896 01970000
*            2 CMZ0285 PTR(24);                                    0896 01971000
*         CMZ0285=(PSTPTR);                                        0897 01972000
         L     @05,PSTCRRS(,PSTPTR)                                0897 01973000
         SLR   @05,@10                                             0897 01974000
         STCM  PSTPTR,7,CMZ0285(@05)                               0897 01975000
*       END;                        /* SMSID ASSOCIATE EACH CRA WITH    01976000
*                                      THE PST               @Z40GKF6*/ 01977000
*     END;                          /*                       @Z40GKD1*/ 01978000
*   ELSE                            /* OTHERWISE,RLSE PREV.          */ 01979000
*     DO;                           /* ALLOC. STORAGE,SET            */ 01980000
         B     @RC00892                                            0900 01981000
@RF00892 DS    0H                                                  0901 01982000
*L45:                                                              0901 01983000
*       RFY                                                        0901 01984000
*         ISTACDEB BASED(RDEB);                                    0901 01985000
L45      DS    0H                                                  0902 01986000
*       RDEB=ACDEBPTR;              /* SET ACDEB BASE        @Z40GKD1*/ 01987000
         L     RDEB,ACDEBPTR(,SAVEAPTR)                            0902 01988000
*       ACDTSKID=0;                 /* THEN RESET DEB TSKID  @Z40GKD1*/ 01989000
         SLR   @10,@10                                             0903 01990000
         ST    @10,ACDTSKID(,RDEB)                                 0903 01991000
*       ASXBMPST->MPSPSTCT=ASXBMPST->MPSPSTCT-1;/* DECR. PST CNT   0904 01992000
*                                                            @ZA08912*/ 01993000
*                                                                  0904 01994000
         L     @10,CVTPTR                                          0904 01995000
         L     @10,CVTTCBP(,@10)                                   0904 01996000
         L     @10,ASCBPTR(,@10)                                   0904 01997000
         L     @10,ASXBPTR(,@10)                                   0904 01998000
         L     @10,ASXBMPST(,@10)                                  0904 01999000
         L     @05,MPSPSTCT(,@10)                                  0904 02000000
         BCTR  @05,0                                               0904 02001000
         ST    @05,MPSPSTCT(,@10)                                  0904 02002000
*       /*************************************************************/ 02003000
*       /*                                                           */ 02004000
*       /* FREESTOR DESTROYS ALL REGS EXCP 1,11,12,13                */ 02005000
*       /*                                                           */ 02006000
*       /*************************************************************/ 02007000
*                                                                  0905 02008000
*                                   /*                       @Y30APGC*/ 02009000
*       DO;                         /* FREESTOR AREA(REG11)SIZE(LENGT   02010000
*                                      H(ISTPST))CLEAR(NO)SAVE(NO)TYP   02011000
*                                      E(FIXED)ADSPACE(COMMON)KEY(VTA   02012000
*                                      M)FETCHP(YES)                 */ 02013000
*                                                                  0906 02014000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 02015000
*/* END OF ATBUILD                                                   */ 02016000
*                                                                  0906 02017000
*         DO;                                                      0906 02018000
*         END;                                                     0907 02019000
*         DO;                                                      0908 02020000
*           RFY                                                    0909 02021000
*            (GPR00P,                                              0909 02022000
*             GPR01P,                                              0909 02023000
*             GPR02P,                                              0909 02024000
*             GPR03P) RSTD;                                        0909 02025000
*         END;                                                     0910 02026000
*         GPR00F=LENGTH(ISTPST);    /* SIZE IN REG0                  */ 02027000
         LA    GPR00F,136                                          0911 02028000
*         DCL                                                      0912 02029000
*           1 CMZA0288 FIXED(31) STATIC LOCAL,                     0912 02030000
*            2 * FIXED(8) INIT(0),  /* OPTION FLAGS                  */ 02031000
*            2 * FIXED(8) INIT(96), /* STORAGE KEY                   */ 02032000
*            2 * FIXED(8) INIT(227),/* SUBPOOL NUMBER                */ 02033000
*            2 * FIXED(8) INIT('01'X);/* REQUEST TYPE                */ 02034000
*         GPR03F=CMZA0288;                                         0913 02035000
         L     GPR03F,CMZA0288                                     0913 02036000
*         DO;                                                      0914 02037000
*           RFY                                                    0915 02038000
*            (GPR04P) RSTD;                                        0915 02039000
*         END;                                                     0916 02040000
*         GPR04P=REG11;             /* PUT FREEMAIN ADDR IN REG4     */ 02041000
         LR    GPR04P,REG11                                        0917 02042000
*         DO;                       /* LISATCVT                    0918 02043000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 02044000
*           GPR02P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 02045000
         L     GPR02P,ATCLCPTR                                     0919 02046000
*         END;                      /* LISATCVT                      */ 02047000
*         CALL GPR02P->ATCGTSTR;    /* CALL ISTORFSR                 */ 02048000
         L     @15,ATCGTSTR(,GPR02P)                               0921 02049000
         BALR  @14,@15                                             0921 02050000
*         DO;                                                      0922 02051000
*           RFY                                                    0923 02052000
*            (GPR00P,                                              0923 02053000
*             GPR01P,                                              0923 02054000
*             GPR02P,                                              0923 02055000
*             GPR03P,                                              0923 02056000
*             GPR04P) UNRSTD;                                      0923 02057000
*         END;                                                     0924 02058000
*       END;                        /* FREESTOR                      */ 02059000
*L46:                                                              0926 02060000
*       COMPCODE=4;                 /* SET COMP.CODE                 */ 02061000
L46      MVC   COMPCODE(4,SAVEAPTR),@CF00071                       0926 02062000
*     END;                                                         0927 02063000
*   IF COMPCODE=0                   /*                       @Z40GKD1*/ 02064000
*     THEN                                                         0928 02065000
@RC00892 L     @10,COMPCODE(,SAVEAPTR)                             0928 02066000
         LTR   @10,@10                                             0928 02067000
         BNZ   @RF00928                                            0928 02068000
*     DO;                           /*                       @Z40GKD1*/ 02069000
*       RDEB=ACDEBPTR;              /* RESET ACDEB BASE      @Z40GKD1*/ 02070000
         L     RDEB,ACDEBPTR(,SAVEAPTR)                            0930 02071000
*       PSTTCBA=ACDTCB;                                            0931 02072000
         L     @10,ACDTCB(,RDEB)                                   0931 02073000
         ST    @10,PSTTCBA(,PSTPTR)                                0931 02074000
*       PSTMPSTP=ASXBMPST;                                         0932 02075000
*                                                                  0932 02076000
         L     @10,CVTPTR                                          0932 02077000
         L     @10,CVTTCBP(,@10)                                   0932 02078000
         L     @10,ASCBPTR(,@10)                                   0932 02079000
         L     @10,ASXBPTR(,@10)                                   0932 02080000
         L     @10,ASXBMPST(,@10)                                  0932 02081000
         ST    @10,PSTMPSTP(,PSTPTR)                               0932 02082000
*       /*************************************************************/ 02083000
*       /*                                                           */ 02084000
*       /* *ALLOC STORAGE FOR 2 IRB'S RELEASE MEMORY LOCK AROUND CIRB*/ 02085000
*       /* MACRO. NOTE--MPST SAVE AREA CANNOT BE USED WHILE MEM.LOCK */ 02086000
*       /* NOT IN EFFECT                                     @Z40GKD1*/ 02087000
*       /*                                                           */ 02088000
*       /*************************************************************/ 02089000
*                                                                  0933 02090000
*UNLKLBL1:                                                         0933 02091000
*       GEN CODE REFS(PSALITA,FLC,LKLBL1);                         0933 02092000
UNLKLBL1 DS    0H                                                  0933 02093000
          SETLOCK RELEASE,TYPE=LOCAL,RELATED=(LOCAL,ISTAPC11,(LKLBL1)),X02094000
               REGS=USE                                                 02095000
*       RFY                                                        0934 02096000
*        (ATCVTBAS,                                                0934 02097000
*         REG3) RSTD;                                              0934 02098000
*L47:                                                              0935 02099000
*       DO;                         /* LISATCVT                    0935 02100000
*                                      CVTBASE(PAGEABLE,(ATCVTBAS))  */ 02101000
L47      DS    0H                                                  0936 02102000
*         ATCVTBAS=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 02103000
         L     ATCVTBAS,ATCLCPTR                                   0936 02104000
*       END;                        /* LISATCVT                      */ 02105000
*L48:                                                              0938 02106000
*       REG3=ATCVTBAS->ATCAP51;     /* GET ATCAP51 ADDR FROM ATCVT   */ 02107000
L48      L     REG3,ATCAP51(,ATCVTBAS)                             0938 02108000
*       RFY                                                        0939 02109000
*         ATCVTBAS UNRSTD;                                         0939 02110000
*       RFY                                                        0940 02111000
*        (COUNT,                                                   0940 02112000
*         RBSECPTR,                                                0940 02113000
*         IQE1PTR,                                                 0940 02114000
*         IQE2PTR) RSTD;                                           0940 02115000
*       RFY                                                        0941 02116000
*         RBSECT BASED(RBSECPTR);                                  0941 02117000
*       DO COUNT=0 BY 1 TO 1;                                      0942 02118000
         SLR   COUNT,COUNT                                         0942 02119000
@DL00942 DS    0H                                                  0943 02120000
*L49:                                                              0943 02121000
*         GEN CODE REFS(REG3);                                     0943 02122000
*                                                                  0943 02123000
L49      DS    0H                                                  0943 02124000
*                                                       /* ZA08912*/    02125000
         CIRB  EP=(REG3),KEY=SUPR,MODE=SUPR,                          X*02126000
               RETIQE=NO,WKAREA=5,ENABLE=YES                            02127000
*         /***********************************************************/ 02128000
*         /*                                                         */ 02129000
*         /* ON RTN FROM CIRB,RBSECPTR-> IRB AREA                    */ 02130000
*         /*                                                         */ 02131000
*         /***********************************************************/ 02132000
*                                                                  0944 02133000
*         RFY                                                      0944 02134000
*           IQESECT BASED(IQE1PTR);                                0944 02135000
*L50:                                                              0945 02136000
*         IQE1PTR=ADDR(IRBEND)+8;   /* SET IQE POINTER       @ZA08912*/ 02137000
L50      LA    IQE1PTR,IRBEND(,RBSECPTR)                           0945 02138000
         AL    IQE1PTR,@CF00064                                    0945 02139000
*         IQESECT(1:IQESZBYT)=IQESECT(1:IQESZBYT)&&/* ZERO IQE       */ 02140000
*             IQESECT(1:IQESZBYT);                                 0946 02141000
         XC    IQESECT(16,IQE1PTR),IQESECT(IQE1PTR)                0946 02142000
*         IQEPARAM=PSTPTR;                                         0947 02143000
         ST    PSTPTR,IQEPARAM(,IQE1PTR)                           0947 02144000
*         IQEIRB=RBSECPTR;                                         0948 02145000
         ST    RBSECPTR,IQEIRB(,IQE1PTR)                           0948 02146000
*         IQETCB=ACDTCB;                                           0949 02147000
         L     @09,ACDTCB(,RDEB)                                   0949 02148000
         ST    @09,IQETCB(,IQE1PTR)                                0949 02149000
*         RFY                                                      0950 02150000
*           IQESECT BASED(IQE2PTR);                                0950 02151000
*         IQE2PTR=IQE1PTR+IQESZBYT; /* SET IQE PTR                   */ 02152000
         LA    IQE2PTR,16                                          0951 02153000
         ALR   IQE2PTR,IQE1PTR                                     0951 02154000
*         IQE2PTR->IQESECT(1:IQESZBYT)=/* COPY IQE                   */ 02155000
*             IQE1PTR->IQESECT(1:IQESZBYT);                        0952 02156000
         MVC   IQESECT(16,IQE2PTR),IQESECT(IQE1PTR)                0952 02157000
*         IF COUNT=0 THEN                                          0953 02158000
         LTR   COUNT,COUNT                                         0953 02159000
         BNZ   @RF00953                                            0953 02160000
*           DO;                     /* STORE IQE PTRS IN PST         */ 02161000
*             PSTIQE11=IQE1PTR;                                    0955 02162000
         ST    IQE1PTR,PSTIQE11(,PSTPTR)                           0955 02163000
*             PSTIQE12=IQE2PTR;                                    0956 02164000
         ST    IQE2PTR,PSTIQE12(,PSTPTR)                           0956 02165000
*           END;                                                   0957 02166000
*         ELSE                                                     0958 02167000
*           DO;                     /* STORE IQE PTRS IN PST         */ 02168000
         B     @RC00953                                            0958 02169000
@RF00953 DS    0H                                                  0959 02170000
*             PSTIQE21=IQE1PTR;                                    0959 02171000
         ST    IQE1PTR,PSTIQE21(,PSTPTR)                           0959 02172000
*             PSTIQE22=IQE2PTR;                                    0960 02173000
         ST    IQE2PTR,PSTIQE22(,PSTPTR)                           0960 02174000
*           END;                                                   0961 02175000
*       END;                                                       0962 02176000
@RC00953 AL    COUNT,@CF00038                                      0962 02177000
         C     COUNT,@CF00038                                      0962 02178000
         BNH   @DL00942                                            0962 02179000
*       RFY                                                        0963 02180000
*        (COUNT,                                                   0963 02181000
*         REG3,                                                    0963 02182000
*         RBSECPTR,                                                0963 02183000
*         IQE1PTR,                                                 0963 02184000
*         IQE2PTR) UNRSTD;                                         0963 02185000
*LKLBL1:                                                           0964 02186000
*       GEN CODE REFS(PSALITA,FLC,UNLKLBL1);                       0964 02187000
*                                                                  0964 02188000
LKLBL1   DS    0H                                                  0964 02189000
       SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,                 X02190000
               RELATED=(LOCAL,ISTAPC11,(UNLKLBL1))                      02191000
*       /*************************************************************/ 02192000
*       /*                                                           */ 02193000
*       /* INIT PST FIELDS**                                         */ 02194000
*       /*                                                           */ 02195000
*       /*************************************************************/ 02196000
*                                                                  0965 02197000
*       RFY                                                        0965 02198000
*        (RPAB,                                                    0965 02199000
*         RDYP,                                                    0965 02200000
*         XRPHPTR) RSTD;                                           0965 02201000
*       PSTTYPE=PSTYPE;             /* INIT PST AS A WORK ELEM     0966 02202000
*                                                            @Z40GKD1*/ 02203000
         MVI   PSTTYPE(PSTPTR),X'61'                               0966 02204000
*       PSTLNGTH=LENGTH(ISTPST);    /*                       @Z40GKD1*/ 02205000
         MVI   PSTLNGTH(PSTPTR),X'88'                              0967 02206000
*       PSTRQUE=0;                  /*                       @Y30APGC*/ 02207000
         SLR   @07,@07                                             0968 02208000
         ST    @07,PSTRQUE(,PSTPTR)                                0968 02209000
*       PSTFLGA=0;                                                 0969 02210000
         ST    @07,PSTFLGA(,PSTPTR)                                0969 02211000
*       PSTPSSQ=ZERO;               /* PASSED ON ENTRY       @ZM40787*/ 02212000
         SLR   @07,@07                                             0970 02213000
         ST    @07,PSTPSSQ(,PSTPTR)                                0970 02214000
*       PSTNSSQ=ZERO;               /*                       @ZM40787*/ 02215000
         ST    @07,PSTNSSQ(,PSTPTR)                                0971 02216000
*       PSTUEQ=ZERO;                /*                       @ZM40787*/ 02217000
*                                                                  0972 02218000
         ST    @07,PSTUEQ(,PSTPTR)                                 0972 02219000
*       /*************************************************************/ 02220000
*       /*                                                           */ 02221000
*       /* *INIT. RPH IN CRA*                                        */ 02222000
*       /*                                                           */ 02223000
*       /*************************************************************/ 02224000
*                                                                  0973 02225000
*       RFY                                                        0973 02226000
*         ISTCRA BASED(PSTCRRS);    /* SETUP BASE FOR CRA            */ 02227000
*       RFY                                                        0974 02228000
*         ISTRPH BASED(XRPHPTR);    /* SETUP BASE FOR RPH            */ 02229000
*       RFY                                                        0975 02230000
*         ISTPAB BASED(RPAB);                                      0975 02231000
*       RFY                                                        0976 02232000
*         ISTDYPAB BASED(RDYP);                                    0976 02233000
*       RDYP=ADDR(PSTSMDYP);                                       0977 02234000
         LA    RDYP,PSTSMDYP(,PSTPTR)                              0977 02235000
*       RPAB=ADDR(DYPPAB);                                         0978 02236000
         LA    RPAB,DYPPAB(,RDYP)                                  0978 02237000
*       XRPHPTR=ADDR(CRARPH);                                      0979 02238000
         L     @07,PSTCRRS(,PSTPTR)                                0979 02239000
         LA    XRPHPTR,CRARPH(,@07)                                0979 02240000
*       CRARPH=CRARPH&&CRARPH;      /* ZERO RPH                      */ 02241000
         XC    CRARPH(108,@07),CRARPH(@07)                         0980 02242000
*       RPHTYPE=RPTYPE;                                            0981 02243000
         MVI   RPHTYPE(XRPHPTR),X'01'                              0981 02244000
*       RPHLNGTH=LENGTH(ISTRPH);                                   0982 02245000
         MVI   RPHLNGTH(XRPHPTR),X'6C'                             0982 02246000
*       RPHTSKID=PSTPTR;                                           0983 02247000
         ST    PSTPTR,RPHTSKID(,XRPHPTR)                           0983 02248000
*       RPHPABOF=RPAB-RDYP;                                        0984 02249000
         LR    @07,RPAB                                            0984 02250000
         SLR   @07,RDYP                                            0984 02251000
         STC   @07,RPHPABOF(,XRPHPTR)                              0984 02252000
*       RPHMAJCB=RDYP;                                             0985 02253000
         STCM  RDYP,7,RPHMAJCB(XRPHPTR)                            0985 02254000
*       RPHRESUM='FFFFFF'X;                                        0986 02255000
         MVC   RPHRESUM(3,XRPHPTR),@CF03783+1                      0986 02256000
*       RPHCRR=PSTCRRS;                                            0987 02257000
*                                                                  0987 02258000
         L     @09,PSTCRRS(,PSTPTR)                                0987 02259000
         ST    @09,RPHCRR(,XRPHPTR)                                0987 02260000
*       /*************************************************************/ 02261000
*       /*                                                           */ 02262000
*       /* INIT. STORAGE MGMT PAB IN PST                             */ 02263000
*       /*                                                           */ 02264000
*       /*************************************************************/ 02265000
*                                                                  0988 02266000
*       PSTSMDYP=PSTSMDYP&&PSTSMDYP;/* ZERO PAB                      */ 02267000
         XC    PSTSMDYP(32,PSTPTR),PSTSMDYP(PSTPTR)                0988 02268000
*       DYPTYPE=DYTYP;              /* INIT. PAB HEADER              */ 02269000
         MVI   DYPTYPE(RDYP),X'11'                                 0989 02270000
*       DYPLNGTH=LENGTH(ISTDYPAB);                                 0990 02271000
         MVI   DYPLNGTH(RDYP),X'20'                                0990 02272000
*       DYPTSKID=PSTPTR;                                           0991 02273000
         ST    PSTPTR,DYPTSKID(,RDYP)                              0991 02274000
*       PABOFFST=RPHPABOF;                                         0992 02275000
         STC   @07,PABOFFST(,RPAB)                                 0992 02276000
*       PABRPHA=XRPHPTR;                                           0993 02277000
         STCM  XRPHPTR,7,PABRPHA(RPAB)                             0993 02278000
*       PABSSN=ON;                  /* SET SYS SERV FLAG Z30APGG     */ 02279000
         OI    PABSSN(RPAB),B'00001000'                            0994 02280000
*     END;                                                         0995 02281000
*   RFY                                                            0996 02282000
*    (RPAB,                                                        0996 02283000
*     RDYP,                                                        0996 02284000
*     PSTPTR,                                                      0996 02285000
*     RDEB,                                                        0996 02286000
*     XRPHPTR) UNRSTD;                                             0996 02287000
*                                                                  0996 02288000
@RF00928 DS    0H                                                  0997 02289000
*/* SEGMENT(INITPST)FINISH                                           */ 02290000
*                                                                  0997 02291000
*   DO;                                                            0997 02292000
*     GOTO INITPST#;                                               0998 02293000
         B     INITPST#                                            0998 02294000
*INITPST@:                                                         0999 02295000
*   END;                                                           0999 02296000
INITPST@ DS    0H                                                  1000 02297000
*   GEN(EJECT);                                                    1000 02298000
         EJECT                                                          02299000
*                                                                  1001 02300000
*/* SEGMENT(BLDDCE)START                                             */ 02301000
*                                                                  1001 02302000
*   DO;                                                            1001 02303000
*     GOTO BLDDCE@;                                                1002 02304000
         B     BLDDCE@                                             1002 02305000
*BLDDCE:                                                           1003 02306000
*   END;                                                           1003 02307000
*                                                                  1003 02308000
BLDDCE   DS    0H                                                  1004 02309000
*   /*****************************************************************/ 02310000
*   /*                                                               */ 02311000
*   /* ******************** BLDDCE SEGMENT *** THIS SEGMENT ISSUES A */ 02312000
*   /* GETMAIN FOR STORAGE TO *** BUILD A DEB ENTRY. IF THE GETMAIN  */ 02313000
*   /* IS SUCCESSFUL THEN* *** THE DEB ENTRY IS INIT. AND QUEUED TO  */ 02314000
*   /* THE HEAD OF THE* *** DEB ENTRY LIST. IF GETMAIN FAILS,A       */ 02315000
*   /* COMPCODE IS SET                                               */ 02316000
*   /*                                                               */ 02317000
*   /*****************************************************************/ 02318000
*                                                                  1004 02319000
*   RFY                                                            1004 02320000
*    (REG11,                                                       1004 02321000
*     FOUNDSW,                                                     1004 02322000
*     DEBPTR) RSTD;                 /*                       @ZM31840*/ 02323000
*   REG1=FOUNDSW;                   /* SAVE ACROSS BLDDCE    @ZM31840*/ 02324000
         LR    REG1,FOUNDSW                                        1005 02325000
*   REG11=DEBPTR;                   /* SAVE ACROSS BLDDCE    @ZM31840*/ 02326000
         LR    REG11,DEBPTR                                        1006 02327000
*   RFY                                                            1007 02328000
*    (RDCE,                                                        1007 02329000
*     RMPST) RSTD;                  /*                       @Y30APGC*/ 02330000
*   RFY                                                            1008 02331000
*     ISTDCE BASED(RDCE);                                          1008 02332000
*                                                                  1008 02333000
*   /*****************************************************************/ 02334000
*   /*                                                               */ 02335000
*   /* GETSTOR DESTROYS ALL REGS EXCP 1,11,12,13                     */ 02336000
*   /*                                                               */ 02337000
*   /*****************************************************************/ 02338000
*                                                                  1009 02339000
*                                   /*                       @Y30APGC*/ 02340000
*   DO;                             /* GETSTOR SIZE(LENGTH(ISTDCE))CL   02341000
*                                      EAR(YES)SAVE(NO)TYPE(FIXED)ADS   02342000
*                                      PACE(COMMON)KEY(VTAM)FETCHP(YE   02343000
*                                      S)                            */ 02344000
*                                                                  1010 02345000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 02346000
*/* END OF ATBUILD                                                   */ 02347000
*                                                                  1010 02348000
*     DO;                                                          1010 02349000
*     END;                                                         1011 02350000
*     DO;                                                          1012 02351000
*       RFY                                                        1013 02352000
*        (GPR00P,                                                  1013 02353000
*         GPR01P,                                                  1013 02354000
*         GPR02P,                                                  1013 02355000
*         GPR03P) RSTD;                                            1013 02356000
*     END;                                                         1014 02357000
*     GPR00F=LENGTH(ISTDCE);        /* SIZE IN REG0                  */ 02358000
         LA    GPR00F,16                                           1015 02359000
*     DCL                                                          1016 02360000
*       1 CMZA0322 FIXED(31) STATIC LOCAL,                         1016 02361000
*        2 * FIXED(8) INIT(32),     /* OPTION FLAGS                  */ 02362000
*        2 * FIXED(8) INIT(96),     /* STORAGE KEY                   */ 02363000
*        2 * FIXED(8) INIT(227),    /* SUBPOOL NUMBER                */ 02364000
*        2 * FIXED(8) INIT('00'X);  /* REQUEST TYPE                  */ 02365000
*     GPR03F=CMZA0322;                                             1017 02366000
         L     GPR03F,CMZA0322                                     1017 02367000
*     DO;                           /* LISATCVT                    1018 02368000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 02369000
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 02370000
         L     GPR02P,ATCLCPTR                                     1019 02371000
*     END;                          /* LISATCVT                      */ 02372000
*     CALL GPR02P->ATCGTSTR;        /* CALL ISTORFSR                 */ 02373000
         L     @15,ATCGTSTR(,GPR02P)                               1021 02374000
         BALR  @14,@15                                             1021 02375000
*     DO;                                                          1022 02376000
*       RFY                                                        1023 02377000
*        (GPR00P,                                                  1023 02378000
*         GPR01P,                                                  1023 02379000
*         GPR02P,                                                  1023 02380000
*         GPR03P) UNRSTD;                                          1023 02381000
*     END;                                                         1024 02382000
*   END;                            /* GETSTOR                       */ 02383000
*L53:                                                              1026 02384000
*   IF RC=0                         /* STORE AVAIL.?                 */ 02385000
*     THEN                          /* YES,RDCE->STOR                */ 02386000
L53      LTR   RC,RC                                               1026 02387000
         BNZ   @RF01026                                            1026 02388000
*     IF ATCABEN=ON THEN            /* VTAM CANCEL IN PROGRESS     1027 02389000
*                                                            @G35RKD9*/ 02390000
         L     @09,ATCLCPTR                                        1027 02391000
         TM    ATCABEN(@09),B'00100000'                            1027 02392000
         BNO   @RF01027                                            1027 02393000
*       DO;                         /* DONT ADD DCE TO QUEUE @G35RKD9*/ 02394000
*         COMPCODE=8;               /* SET RETURN CODE       @G35RKD9*/ 02395000
         MVC   COMPCODE(4,SAVEAPTR),@CF00064                       1029 02396000
*       END;                        /*                       @G35RKD9*/ 02397000
*     ELSE                          /* ADD DCE TO QUEUE      @G35RKD9*/ 02398000
*       DO;                         /*                       @G35RKD9*/ 02399000
         B     @RC01027                                            1031 02400000
@RF01027 DS    0H                                                  1032 02401000
*         DCEDBPTR=ACDEBPTR;        /* SET DCE FIELD                 */ 02402000
         L     @09,ACDEBPTR(,SAVEAPTR)                             1032 02403000
         ST    @09,DCEDBPTR(,RDCE)                                 1032 02404000
*         RMPST=ASXBMPST;           /* QUE DEB ENTRY TO              */ 02405000
         L     @09,CVTPTR                                          1033 02406000
         L     @09,CVTTCBP(,@09)                                   1033 02407000
         L     @09,ASCBPTR(,@09)                                   1033 02408000
         L     @09,ASXBPTR(,@09)                                   1033 02409000
         L     RMPST,ASXBMPST(,@09)                                1033 02410000
*         DCECHN=RMPST->MPSDBTBL;   /* HEAD OF DEB                   */ 02411000
         L     @09,MPSDBTBL(,RMPST)                                1034 02412000
         ST    @09,DCECHN(,RDCE)                                   1034 02413000
*         RMPST->MPSDBTBL=RDCE;     /* CHAIN OFF MPST                */ 02414000
         ST    RDCE,MPSDBTBL(,RMPST)                               1035 02415000
*       END;                                                       1036 02416000
*   ELSE                                                           1037 02417000
*     COMPCODE=4;                   /* NO STORE                      */ 02418000
         B     @RC01026                                            1037 02419000
@RF01026 MVC   COMPCODE(4,SAVEAPTR),@CF00071                       1037 02420000
*   RFY                                                            1038 02421000
*    (RDCE,                                                        1038 02422000
*     RMPST) UNRSTD;                /*                       @Y30APGC*/ 02423000
@RC01026 DS    0H                                                  1039 02424000
*   FOUNDSW=REG1;                   /* RESTORE FOUNDSW SAVED ACROSS     02425000
*                                      BLDDCE                @ZM31840*/ 02426000
         LR    FOUNDSW,REG1                                        1039 02427000
*   DEBPTR=REG11;                   /* RESTORE DEBPTR SAVED ACROSS 1040 02428000
*                                      BLDDCE                @ZM31840*/ 02429000
         LR    DEBPTR,REG11                                        1040 02430000
*   RFY                                                            1041 02431000
*    (REG11,                                                       1041 02432000
*     DEBPTR,                                                      1041 02433000
*     FOUNDSW) UNRSTD;              /*                       @ZM31840*/ 02434000
*/* SEGMENT(BLDDCE)FINISH                                            */ 02435000
*                                                                  1042 02436000
*   DO;                                                            1042 02437000
*     GOTO BLDDCE#;                                                1043 02438000
         B     BLDDCE#                                             1043 02439000
*BLDDCE@:                                                          1044 02440000
*   END;                                                           1044 02441000
BLDDCE@  DS    0H                                                  1045 02442000
*   GEN(EJECT);                                                    1045 02443000
         EJECT                                                          02444000
*                                                                  1046 02445000
*/* SEGMENT(FREEDCE)START                                            */ 02446000
*                                                                  1046 02447000
*   DO;                                                            1046 02448000
*     GOTO FREEDCE@;                                               1047 02449000
         B     FREEDCE@                                            1047 02450000
*FREEDCE:                                                          1048 02451000
*   END;                                                           1048 02452000
*                                                                  1048 02453000
FREEDCE  DS    0H                                                  1049 02454000
*   /*****************************************************************/ 02455000
*   /*                                                               */ 02456000
*   /* ************* FREEDCE SEGMENT * THIS SEGMENT FINDS AND        */ 02457000
*   /* DEQUEUES THE ENTRY FROM THE DEB* * ENTRY LIST AND FREES THE   */ 02458000
*   /* STORAGE FOR IT. REG13 MUST * POINT TO THE SAVEAREA AT THIS    */ 02459000
*   /* TIME,AS PTR ACDEBPTR IS * KEPT IN THE R1 SLOT OF THE SAVE     */ 02460000
*   /* AREA.                                                         */ 02461000
*   /*                                                               */ 02462000
*   /*****************************************************************/ 02463000
*                                                                  1049 02464000
*   RFY                                                            1049 02465000
*    (REG1,                                                        1049 02466000
*     RMPST,                                                       1049 02467000
*     REG3) RSTD;                   /*                       @Y30APGC*/ 02468000
*   RFY                                                            1050 02469000
*     ISTMPST BASED(RMPST);                                        1050 02470000
*L54:                                                              1051 02471000
*   RMPST=ASXBMPST;                 /* GET PTR TO MPST               */ 02472000
L54      L     @02,CVTPTR                                          1051 02473000
         L     @02,CVTTCBP(,@02)                                   1051 02474000
         L     @02,ASCBPTR(,@02)                                   1051 02475000
         L     @02,ASXBPTR(,@02)                                   1051 02476000
         L     RMPST,ASXBMPST(,@02)                                1051 02477000
*   REG1=MPSDBTBL;                  /* DEQUE TOP DEB ENTRY           */ 02478000
         L     REG1,MPSDBTBL(,RMPST)                               1052 02479000
*   REG3=0;                         /*                       @Z40GKD1*/ 02480000
         SLR   REG3,REG3                                           1053 02481000
*   DO WHILE REG1->DCEDBPTR^=ACDEBPTR;/*                     @Z40GKD1*/ 02482000
         B     @DE01054                                            1054 02483000
@DL01054 DS    0H                                                  1055 02484000
*     REG3=REG1;                    /*                       @Z40GKD1*/ 02485000
         LR    REG3,REG1                                           1055 02486000
*     REG1=REG1->DCECHN;            /*                       @Z40GKD1*/ 02487000
         L     REG1,DCECHN(,REG1)                                  1056 02488000
*   END;                            /* END DO WHILE          @Z40GKD1*/ 02489000
@DE01054 CLC   DCEDBPTR(4,REG1),ACDEBPTR(SAVEAPTR)                 1057 02490000
         BNE   @DL01054                                            1057 02491000
*   IF REG3=0 THEN                                                 1058 02492000
         LTR   REG3,REG3                                           1058 02493000
         BNZ   @RF01058                                            1058 02494000
*     MPSDBTBL=REG1->DCECHN;        /*                       @Z40GKD1*/ 02495000
         L     @11,DCECHN(,REG1)                                   1059 02496000
         ST    @11,MPSDBTBL(,RMPST)                                1059 02497000
*   ELSE                                                           1060 02498000
*     REG3->DCECHN=REG1->DCECHN;    /*                       @Z40GKD1*/ 02499000
         B     @RC01058                                            1060 02500000
@RF01058 L     @11,DCECHN(,REG1)                                   1060 02501000
         ST    @11,DCECHN(,REG3)                                   1060 02502000
*/*FREESTOR DESTROYS ALL REGS EXCP 1,11,12,13                        */ 02503000
*                                                                  1061 02504000
*                                   /*                       @Y30APGC*/ 02505000
*   DO;                             /* FREESTOR AREA(REG1)SIZE(LENGTH   02506000
*                                      (ISTDCE))CLEAR(NO)SAVE(NO)TYPE   02507000
*                                      (FIXED)ADSPACE(COMMON)KEY(VTAM   02508000
*                                      )FETCHP(YES)                  */ 02509000
@RC01058 DS    0H                                                  1062 02510000
*                                                                  1062 02511000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 02512000
*/* END OF ATBUILD                                                   */ 02513000
*                                                                  1062 02514000
*     DO;                                                          1062 02515000
*     END;                                                         1063 02516000
*     DO;                                                          1064 02517000
*       RFY                                                        1065 02518000
*        (GPR00P,                                                  1065 02519000
*         GPR01P,                                                  1065 02520000
*         GPR02P,                                                  1065 02521000
*         GPR03P) RSTD;                                            1065 02522000
*     END;                                                         1066 02523000
*     GPR00F=LENGTH(ISTDCE);        /* SIZE IN REG0                  */ 02524000
         LA    GPR00F,16                                           1067 02525000
*     DCL                                                          1068 02526000
*       1 CMZA0348 FIXED(31) STATIC LOCAL,                         1068 02527000
*        2 * FIXED(8) INIT(0),      /* OPTION FLAGS                  */ 02528000
*        2 * FIXED(8) INIT(96),     /* STORAGE KEY                   */ 02529000
*        2 * FIXED(8) INIT(227),    /* SUBPOOL NUMBER                */ 02530000
*        2 * FIXED(8) INIT('01'X);  /* REQUEST TYPE                  */ 02531000
*     GPR03F=CMZA0348;                                             1069 02532000
         L     GPR03F,CMZA0348                                     1069 02533000
*     DO;                                                          1070 02534000
*       RFY                                                        1071 02535000
*        (GPR04P) RSTD;                                            1071 02536000
*     END;                                                         1072 02537000
*     GPR04P=REG1;                  /* PUT FREEMAIN ADDR IN REG4     */ 02538000
         LR    GPR04P,REG1                                         1073 02539000
*     DO;                           /* LISATCVT                    1074 02540000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 02541000
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 02542000
         L     GPR02P,ATCLCPTR                                     1075 02543000
*     END;                          /* LISATCVT                      */ 02544000
*     CALL GPR02P->ATCGTSTR;        /* CALL ISTORFSR                 */ 02545000
         L     @15,ATCGTSTR(,GPR02P)                               1077 02546000
         BALR  @14,@15                                             1077 02547000
*     DO;                                                          1078 02548000
*       RFY                                                        1079 02549000
*        (GPR00P,                                                  1079 02550000
*         GPR01P,                                                  1079 02551000
*         GPR02P,                                                  1079 02552000
*         GPR03P,                                                  1079 02553000
*         GPR04P) UNRSTD;                                          1079 02554000
*     END;                                                         1080 02555000
*   END;                            /* FREESTOR                      */ 02556000
*   RFY                                                            1082 02557000
*    (REG1,                                                        1082 02558000
*     RMPST,                                                       1082 02559000
*     REG3) UNRSTD;                                                1082 02560000
*L57:                               /* SEGMENT(FREEDCE)FINISH        */ 02561000
*   DO;                                                            1083 02562000
L57      DS    0H                                                  1084 02563000
*     GOTO FREEDCE#;                                               1084 02564000
         B     FREEDCE#                                            1084 02565000
*FREEDCE@:                                                         1085 02566000
*   END;                                                           1085 02567000
FREEDCE@ DS    0H                                                  1086 02568000
*   DO;                             /* TPEPILOG                      */ 02569000
*     GEN(PRINT OFF);                                              1087 02570000
         PRINT OFF                                                      02571000
*     DO;                                                          1088 02572000
*       DCL                                                        1089 02573000
*         GPR00F FIXED(31) REG(00),                                1089 02574000
*         GPR00P PTR(31) REG(00),                                  1089 02575000
*         GPR01F FIXED(31) REG(01),                                1089 02576000
*         GPR01P PTR(31) REG(01),                                  1089 02577000
*         GPR02F FIXED(31) REG(02),                                1089 02578000
*         GPR02P PTR(31) REG(02),                                  1089 02579000
*         GPR03F FIXED(31) REG(03),                                1089 02580000
*         GPR03P PTR(31) REG(03),                                  1089 02581000
*         GPR04F FIXED(31) REG(04),                                1089 02582000
*         GPR04P PTR(31) REG(04),                                  1089 02583000
*         GPR05F FIXED(31) REG(05),                                1089 02584000
*         GPR05P PTR(31) REG(05),                                  1089 02585000
*         GPR06F FIXED(31) REG(06),                                1089 02586000
*         GPR06P PTR(31) REG(06),                                  1089 02587000
*         GPR07F FIXED(31) REG(07),                                1089 02588000
*         GPR07P PTR(31) REG(07),                                  1089 02589000
*         GPR08F FIXED(31) REG(08),                                1089 02590000
*         GPR08P PTR(31) REG(08),                                  1089 02591000
*         GPR09F FIXED(31) REG(09),                                1089 02592000
*         GPR09P PTR(31) REG(09),                                  1089 02593000
*         GPR10F FIXED(31) REG(10),                                1089 02594000
*         GPR10P PTR(31) REG(10),                                  1089 02595000
*         GPR11F FIXED(31) REG(11),                                1089 02596000
*         GPR11P PTR(31) REG(11),                                  1089 02597000
*         GPR12F FIXED(31) REG(12),                                1089 02598000
*         GPR12P PTR(31) REG(12),                                  1089 02599000
*         GPR13F FIXED(31) REG(13),                                1089 02600000
*         GPR13P PTR(31) REG(13),                                  1089 02601000
*         GPR14F FIXED(31) REG(14),                                1089 02602000
*         GPR14P PTR(31) REG(14),                                  1089 02603000
*         GPR15F FIXED(31) REG(15),                                1089 02604000
*         GPR15P PTR(31) REG(15);                                  1089 02605000
*     END;                                                         1090 02606000
*     GEN(PRINT ON);                                               1091 02607000
         PRINT ON                                                       02608000
*   END;                            /* TPEPILOG                      */ 02609000
*   END ISTAPC11                                                   1093 02610000
*                                                                  1093 02611000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02612000
*/*%INCLUDE SYSLIB  (IHAIQE  )                                       */ 02613000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02614000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 02615000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 02616000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 02617000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 02618000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02619000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 02620000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 02621000
*                                                                  1093 02622000
*       ;                                                          1093 02623000
         B     @EL00001                                            1093 02624000
@DATA    DS    0H                                                       02625000
@DATD    DSECT                                                          02626000
         DS    0F                                                       02627000
ISTAPC11 CSECT                                                          02628000
         DS    0F                                                       02629000
@CF00038 DC    F'1'                                                     02630000
@CF00071 DC    F'4'                                                     02631000
@CF00064 DC    F'8'                                                     02632000
@CF00032 DC    F'12'                                                    02633000
@CF00152 DC    F'16'                                                    02634000
@CF01991 DC    XL4'80000000'                                            02635000
@CF03577 DC    XL4'00FFFFFF'                                            02636000
@CF03915 DC    XL4'0000FFFF'                                            02637000
@CF03783 DC    XL4'FFFFFF'                                              02638000
@DATD    DSECT                                                          02639000
         DS    0D                                                       02640000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02641000
@ENDDATD EQU   *                                                        02642000
ISTAPC11 CSECT                                                          02643000
         DS    0F                                                       02644000
@SIZDATD DC    AL1(0)                                                   02645000
         DC    AL3(@ENDDATD-@DATD)                                      02646000
         DS    0D                                                       02647000
CMZA0007 DS    FL4                                                      02648000
         ORG   CMZA0007                                                 02649000
@NM00151 DC    AL1(32)                                                  02650000
@NM00152 DC    AL1(96)                                                  02651000
@NM00153 DC    AL1(227)                                                 02652000
@NM00154 DC    XL1'00'                                                  02653000
         ORG   CMZA0007+4                                               02654000
CMZA0035 DS    FL4                                                      02655000
         ORG   CMZA0035                                                 02656000
@NM00155 DC    AL1(32)                                                  02657000
@NM00156 DC    AL1(96)                                                  02658000
@NM00157 DC    AL1(227)                                                 02659000
@NM00158 DC    XL1'00'                                                  02660000
         ORG   CMZA0035+4                                               02661000
FMZA0064 DS    FL4                                                      02662000
         ORG   FMZA0064                                                 02663000
@NM00159 DC    AL1(0)                                                   02664000
@NM00160 DC    AL3(0)                                                   02665000
         ORG   FMZA0064+4                                               02666000
FMZA0087 DS    FL4                                                      02667000
         ORG   FMZA0087                                                 02668000
@NM00161 DC    AL1(0)                                                   02669000
@NM00162 DC    AL3(0)                                                   02670000
         ORG   FMZA0087+4                                               02671000
CMZA0110 DS    FL4                                                      02672000
         ORG   CMZA0110                                                 02673000
@NM00163 DC    AL1(0)                                                   02674000
@NM00164 DC    AL1(96)                                                  02675000
@NM00165 DC    AL1(227)                                                 02676000
@NM00166 DC    XL1'01'                                                  02677000
         ORG   CMZA0110+4                                               02678000
FMZA0146 DS    FL4                                                      02679000
         ORG   FMZA0146                                                 02680000
@NM00167 DC    AL1(144)                                                 02681000
@NM00168 DC    AL3(0)                                                   02682000
         ORG   FMZA0146+4                                               02683000
FMZA0167 DS    FL4                                                      02684000
         ORG   FMZA0167                                                 02685000
@NM00169 DC    AL1(144)                                                 02686000
@NM00170 DC    AL3(0)                                                   02687000
         ORG   FMZA0167+4                                               02688000
FMZA0195 DS    FL4                                                      02689000
         ORG   FMZA0195                                                 02690000
@NM00171 DC    AL1(144)                                                 02691000
@NM00172 DC    AL3(0)                                                   02692000
         ORG   FMZA0195+4                                               02693000
FMZA0216 DS    FL4                                                      02694000
         ORG   FMZA0216                                                 02695000
@NM00173 DC    AL1(144)                                                 02696000
@NM00174 DC    AL3(0)                                                   02697000
         ORG   FMZA0216+4                                               02698000
FMZA0237 DS    FL4                                                      02699000
         ORG   FMZA0237                                                 02700000
@NM00175 DC    AL1(0)                                                   02701000
@NM00176 DC    AL3(0)                                                   02702000
         ORG   FMZA0237+4                                               02703000
FMZA0264 DS    FL4                                                      02704000
         ORG   FMZA0264                                                 02705000
@NM00177 DC    AL1(144)                                                 02706000
@NM00178 DC    AL3(0)                                                   02707000
         ORG   FMZA0264+4                                               02708000
CMZA0288 DS    FL4                                                      02709000
         ORG   CMZA0288                                                 02710000
@NM00180 DC    AL1(0)                                                   02711000
@NM00181 DC    AL1(96)                                                  02712000
@NM00182 DC    AL1(227)                                                 02713000
@NM00183 DC    XL1'01'                                                  02714000
         ORG   CMZA0288+4                                               02715000
CMZA0322 DS    FL4                                                      02716000
         ORG   CMZA0322                                                 02717000
@NM00184 DC    AL1(32)                                                  02718000
@NM00185 DC    AL1(96)                                                  02719000
@NM00186 DC    AL1(227)                                                 02720000
@NM00187 DC    XL1'00'                                                  02721000
         ORG   CMZA0322+4                                               02722000
CMZA0348 DS    FL4                                                      02723000
         ORG   CMZA0348                                                 02724000
@NM00188 DC    AL1(0)                                                   02725000
@NM00189 DC    AL1(96)                                                  02726000
@NM00190 DC    AL1(227)                                                 02727000
@NM00191 DC    XL1'01'                                                  02728000
         ORG   CMZA0348+4                                               02729000
@CC02634 DC    C'MPLT'                                                  02730000
@CC02684 DC    C'MPST'                                                  02731000
@CC03768 DC    C'PS55'                                                  02732000
@CC03791 DC    C'SF00'                                                  02733000
@CB03581 DC    X'0000000000000000'                                      02734000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02735000
@01      EQU   01                                                       02736000
@02      EQU   02                                                       02737000
@03      EQU   03                                                       02738000
@04      EQU   04                                                       02739000
@05      EQU   05                                                       02740000
@06      EQU   06                                                       02741000
@07      EQU   07                                                       02742000
@08      EQU   08                                                       02743000
@09      EQU   09                                                       02744000
@10      EQU   10                                                       02745000
@11      EQU   11                                                       02746000
@12      EQU   12                                                       02747000
@13      EQU   13                                                       02748000
@14      EQU   14                                                       02749000
@15      EQU   15                                                       02750000
RBSECPTR EQU   @01                                                      02751000
SRBPTR   EQU   @03                                                      02752000
RPHPTR   EQU   @01                                                      02753000
SAVEAPTR EQU   @13                                                      02754000
REG0     EQU   @00                                                      02755000
REG1     EQU   @01                                                      02756000
ATCVTR1  EQU   @01                                                      02757000
INDEXR1  EQU   @01                                                      02758000
REG2     EQU   @02                                                      02759000
FOUNDSW  EQU   @02                                                      02760000
ATCVTBAS EQU   @02                                                      02761000
REG3     EQU   @03                                                      02762000
RDCE     EQU   @03                                                      02763000
MPLTREG3 EQU   @03                                                      02764000
REG4     EQU   @04                                                      02765000
RDEB     EQU   @04                                                      02766000
MPSTREG4 EQU   @04                                                      02767000
RPAB     EQU   @05                                                      02768000
RTCB     EQU   @05                                                      02769000
CBIDREG5 EQU   @05                                                      02770000
REG5     EQU   @05                                                      02771000
RTBL     EQU   @06                                                      02772000
RDYP     EQU   @06                                                      02773000
REG6     EQU   @06                                                      02774000
REG7     EQU   @07                                                      02775000
IQE1PTR  EQU   @07                                                      02776000
IQE2PTR  EQU   @08                                                      02777000
DEBPTR   EQU   @08                                                      02778000
BFSIZER8 EQU   @08                                                      02779000
RPST     EQU   @09                                                      02780000
INDEXR9  EQU   @09                                                      02781000
XRPHPTR  EQU   @10                                                      02782000
RMPST    EQU   @10                                                      02783000
COUNT    EQU   @10                                                      02784000
REG11    EQU   @11                                                      02785000
PSTPTR   EQU   @11                                                      02786000
OLDMPL11 EQU   @11                                                      02787000
BASEREG  EQU   @12                                                      02788000
REG12    EQU   @12                                                      02789000
MPLTSW   EQU   @12                                                      02790000
REG13    EQU   @13                                                      02791000
REG14    EQU   @14                                                      02792000
RC       EQU   @15                                                      02793000
GPR00P   EQU   @00                                                      02794000
GPR01P   EQU   @01                                                      02795000
GPR02P   EQU   @02                                                      02796000
GPR03P   EQU   @03                                                      02797000
GPR00F   EQU   @00                                                      02798000
GPR03F   EQU   @03                                                      02799000
GPR04P   EQU   @04                                                      02800000
GPR15P   EQU   @15                                                      02801000
GPR04F   EQU   @04                                                      02802000
GPR01F   EQU   @01                                                      02803000
GPR02F   EQU   @02                                                      02804000
GPR05F   EQU   @05                                                      02805000
GPR05P   EQU   @05                                                      02806000
GPR06F   EQU   @06                                                      02807000
GPR06P   EQU   @06                                                      02808000
GPR07F   EQU   @07                                                      02809000
GPR07P   EQU   @07                                                      02810000
GPR08F   EQU   @08                                                      02811000
GPR08P   EQU   @08                                                      02812000
GPR09F   EQU   @09                                                      02813000
GPR09P   EQU   @09                                                      02814000
GPR10F   EQU   @10                                                      02815000
GPR10P   EQU   @10                                                      02816000
GPR11F   EQU   @11                                                      02817000
GPR11P   EQU   @11                                                      02818000
GPR12F   EQU   @12                                                      02819000
GPR12P   EQU   @12                                                      02820000
GPR13F   EQU   @13                                                      02821000
GPR13P   EQU   @13                                                      02822000
GPR14F   EQU   @14                                                      02823000
GPR14P   EQU   @14                                                      02824000
GPR15F   EQU   @15                                                      02825000
IDX      EQU   @01                                                      02826000
PIDX     EQU   @01                                                      02827000
PSA      EQU   0                                                        02828000
FLCRNPSW EQU   PSA                                                      02829000
FLCROPSW EQU   PSA+8                                                    02830000
FLCICCW2 EQU   PSA+16                                                   02831000
PSAEEPSW EQU   PSA+132                                                  02832000
PSAESPSW EQU   PSA+136                                                  02833000
FLCSVILC EQU   PSAESPSW+1                                               02834000
PSAEPPSW EQU   PSA+140                                                  02835000
FLCPIILC EQU   PSAEPPSW+1                                               02836000
FLCPICOD EQU   PSAEPPSW+2                                               02837000
PSAPICOD EQU   FLCPICOD+1                                               02838000
FLCTEA   EQU   PSAEPPSW+4                                               02839000
FLCPER   EQU   PSA+152                                                  02840000
FLCMCLA  EQU   PSA+168                                                  02841000
FLCIOEL  EQU   FLCMCLA+4                                                02842000
FLCIOA   EQU   FLCMCLA+16                                               02843000
FLCFSA   EQU   FLCMCLA+80                                               02844000
PSASUPER EQU   PSA+552                                                  02845000
PSASUP1  EQU   PSASUPER                                                 02846000
PSASUP2  EQU   PSASUPER+1                                               02847000
PSASUP3  EQU   PSASUPER+2                                               02848000
PSASUP4  EQU   PSASUPER+3                                               02849000
PSACLHT  EQU   PSA+640                                                  02850000
PSALKSA  EQU   PSA+696                                                  02851000
PSAHLHI  EQU   PSA+760                                                  02852000
PSALITA  EQU   PSA+764                                                  02853000
PSADSSFL EQU   PSA+836                                                  02854000
PSADSSF1 EQU   PSADSSFL                                                 02855000
PSADSSF3 EQU   PSADSSFL+2                                               02856000
PSADSSF4 EQU   PSADSSFL+3                                               02857000
PSARSVT  EQU   PSA+896                                                  02858000
CVTPTR   EQU   16                                                       02859000
ATCLCPTR EQU   1032                                                     02860000
IQESECT  EQU   0                                                        02861000
IQELNK   EQU   IQESECT                                                  02862000
IQEPARAM EQU   IQESECT+4                                                02863000
IQEIRB   EQU   IQESECT+8                                                02864000
IQEFLAGS EQU   IQEIRB                                                   02865000
IQETCB   EQU   IQESECT+12                                               02866000
IQEPTR   EQU   0                                                        02867000
RBPRFX   EQU   0                                                        02868000
RBBASIC  EQU   0                                                        02869000
RBEXRTNM EQU   RBBASIC                                                  02870000
RBTMFLD  EQU   RBEXRTNM                                                 02871000
RBSTAB   EQU   RBBASIC+10                                               02872000
XSTAB    EQU   RBSTAB                                                   02873000
RBSTAB1  EQU   XSTAB                                                    02874000
XSTAB1   EQU   RBSTAB1                                                  02875000
RBFTCKPT EQU   XSTAB1                                                   02876000
RBSTAB2  EQU   XSTAB+1                                                  02877000
XSTAB2   EQU   RBSTAB2                                                  02878000
RBTCBNXT EQU   XSTAB2                                                   02879000
RBFACTV  EQU   XSTAB2                                                   02880000
RBFDYN   EQU   XSTAB2                                                   02881000
RBECBWT  EQU   XSTAB2                                                   02882000
RBOPSW   EQU   RBBASIC+16                                               02883000
XRBPSW   EQU   RBOPSW                                                   02884000
RBOPSWB2 EQU   XRBPSW+1                                                 02885000
RBLINK   EQU   RBBASIC+28                                               02886000
XRBLNK   EQU   RBLINK                                                   02887000
RBWCF    EQU   XRBLNK                                                   02888000
RBLINKB  EQU   XRBLNK+1                                                 02889000
RBGRSAVE EQU   RBBASIC+32                                               02890000
XRBREG   EQU   RBGRSAVE                                                 02891000
RBGRS0   EQU   XRBREG                                                   02892000
RBGRS1   EQU   XRBREG+4                                                 02893000
RBGRS2   EQU   XRBREG+8                                                 02894000
RBGRS3   EQU   XRBREG+12                                                02895000
RBGRS4   EQU   XRBREG+16                                                02896000
RBGRS5   EQU   XRBREG+20                                                02897000
RBGRS6   EQU   XRBREG+24                                                02898000
RBGRS7   EQU   XRBREG+28                                                02899000
RBGRS8   EQU   XRBREG+32                                                02900000
RBGRS9   EQU   XRBREG+36                                                02901000
RBGRS10  EQU   XRBREG+40                                                02902000
RBGRS11  EQU   XRBREG+44                                                02903000
RBGRS12  EQU   XRBREG+48                                                02904000
RBGRS13  EQU   XRBREG+52                                                02905000
RBGRS14  EQU   XRBREG+56                                                02906000
RBGRS15  EQU   XRBREG+60                                                02907000
XRBESA   EQU   RBBASIC+96                                               02908000
RBPREFIX EQU   0                                                        02909000
RBRSV019 EQU   RBPREFIX+14                                              02910000
RBRSV028 EQU   RBPREFIX+15                                              02911000
RBRSV041 EQU   RBPREFIX+27                                              02912000
RBRSV054 EQU   RBPREFIX+39                                              02913000
RBRTOPSW EQU   RBPREFIX+40                                              02914000
RBRTPSW2 EQU   RBRTOPSW+8                                               02915000
RBRTICIL EQU   RBRTPSW2                                                 02916000
RBFLAGS1 EQU   RBPREFIX+56                                              02917000
RBINTCDA EQU   RBPREFIX+61                                              02918000
RBSECT   EQU   0                                                        02919000
RBPPSAV  EQU   RBSECT                                                   02920000
@NM00043 EQU   RBSECT+10                                                02921000
@NM00044 EQU   @NM00043                                                 02922000
RBTRSVRB EQU   @NM00044                                                 02923000
@NM00046 EQU   @NM00043+1                                               02924000
RBETXR   EQU   @NM00046                                                 02925000
RBEP     EQU   RBSECT+12                                                02926000
RBPGMQ   EQU   RBSECT+24                                                02927000
@NM00053 EQU   RBSECT+28                                                02928000
@NM00054 EQU   @NM00053                                                 02929000
IRBEND   EQU   RBSECT+96                                                02930000
@NM00057 EQU   RBSECT+96                                                02931000
RBRSV138 EQU   @NM00057+7                                               02932000
RBSCBB   EQU   RBSECT+144                                               02933000
RBSPARM  EQU   RBSCBB+8                                                 02934000
RBSFLGS1 EQU   RBSPARM                                                  02935000
RBSIOPRC EQU   RBSFLGS1                                                 02936000
RBSOWNR  EQU   RBSCBB+12                                                02937000
RBSFLGS2 EQU   RBSOWNR                                                  02938000
RBSDATA  EQU   RBSCBB+16                                                02939000
RBSFLG3  EQU   RBSDATA                                                  02940000
RBRSV150 EQU   RBSECT+167                                               02941000
SRBSECT  EQU   0                                                        02942000
SRBID    EQU   SRBSECT                                                  02943000
SRBASCB  EQU   SRBSECT+8                                                02944000
SRBFLC   EQU   SRBSECT+12                                               02945000
SRBPASID EQU   SRBFLC+2                                                 02946000
SRBEP    EQU   SRBSECT+20                                               02947000
SRBRMTR  EQU   SRBSECT+24                                               02948000
SRBPARM  EQU   SRBSECT+28                                               02949000
TCBFIX   EQU   0                                                        02950000
TCBFRS   EQU   TCBFIX                                                   02951000
TCB      EQU   0                                                        02952000
TCBPIE   EQU   TCB+4                                                    02953000
TCBPMASK EQU   TCBPIE                                                   02954000
TCBCMP   EQU   TCB+16                                                   02955000
TCBCMPF  EQU   TCBCMP                                                   02956000
TCBCPP   EQU   TCBCMPF                                                  02957000
TCBSTCC  EQU   TCBCMPF                                                  02958000
TCBCDBL  EQU   TCBCMPF                                                  02959000
TCBCWTO  EQU   TCBCMPF                                                  02960000
TCBCIND  EQU   TCBCMPF                                                  02961000
TCBCMSG  EQU   TCBCMPF                                                  02962000
TCBTRN   EQU   TCB+20                                                   02963000
TCBABF   EQU   TCBTRN                                                   02964000
TCBMSS   EQU   TCB+24                                                   02965000
TCBPKF   EQU   TCB+28                                                   02966000
TCBFLGS  EQU   TCB+29                                                   02967000
TCBFLGS1 EQU   TCBFLGS                                                  02968000
TCBFLGS2 EQU   TCBFLGS+1                                                02969000
TCBFLGS3 EQU   TCBFLGS+2                                                02970000
TCBFLGS4 EQU   TCBFLGS+3                                                02971000
TCBFLGS5 EQU   TCBFLGS+4                                                02972000
TCBABWF  EQU   TCBFLGS5                                                 02973000
TCBJPQ   EQU   TCB+44                                                   02974000
TCBPURGE EQU   TCBJPQ                                                   02975000
TCBGRS   EQU   TCB+48                                                   02976000
TCBFSA   EQU   TCB+112                                                  02977000
TCBTME   EQU   TCB+120                                                  02978000
TCBJSTCB EQU   TCB+124                                                  02979000
TCBTSFLG EQU   TCB+148                                                  02980000
TCBTSTSK EQU   TCBTSFLG                                                 02981000
TCBSTAB  EQU   TCB+160                                                  02982000
TCBNSTAE EQU   TCBSTAB                                                  02983000
TCBTCT   EQU   TCB+164                                                  02984000
TCBTCTGF EQU   TCBTCT                                                   02985000
TCBSCNDY EQU   TCB+172                                                  02986000
TCBNDSP  EQU   TCBSCNDY                                                 02987000
TCBNDSP1 EQU   TCBNDSP+1                                                02988000
TCBNDSP2 EQU   TCBNDSP+2                                                02989000
TCBNDSP3 EQU   TCBNDSP+3                                                02990000
TCBJSCB  EQU   TCB+180                                                  02991000
TCBRECDE EQU   TCBJSCB                                                  02992000
TCBEXT1  EQU   TCB+196                                                  02993000
TCBBITS  EQU   TCB+200                                                  02994000
TCBNDSP4 EQU   TCBBITS                                                  02995000
TCBNDSP5 EQU   TCBBITS+1                                                02996000
TCBFLGS6 EQU   TCBBITS+2                                                02997000
TCBFLGS7 EQU   TCBBITS+3                                                02998000
TCBDAR   EQU   TCB+204                                                  02999000
TCBDARC  EQU   TCBDAR                                                   03000000
TCBEXT2  EQU   TCB+208                                                  03001000
TCBFOE   EQU   TCB+244                                                  03002000
TCBESTAE EQU   TCB+264                                                  03003000
TCBESTRM EQU   TCBESTAE+1                                               03004000
TCBFBYT1 EQU   TCB+276                                                  03005000
TCBFBYT2 EQU   TCB+277                                                  03006000
TCBRV124 EQU   TCB+278                                                  03007000
TCBRV133 EQU   TCB+279                                                  03008000
TCBXTNT2 EQU   0                                                        03009000
TCBGTF   EQU   TCBXTNT2                                                 03010000
TCBTFLG  EQU   TCBGTF                                                   03011000
TCBRV146 EQU   TCBXTNT2+28                                              03012000
TCBRV155 EQU   TCBXTNT2+29                                              03013000
TCBRV164 EQU   TCBXTNT2+30                                              03014000
TCBRV173 EQU   TCBXTNT2+31                                              03015000
CVTMAP   EQU   0                                                        03016000
CVT      EQU   CVTMAP                                                   03017000
CVTTCBP  EQU   CVTMAP                                                   03018000
CVTDAR   EQU   CVTMAP+72                                                03019000
CVTFLGS1 EQU   CVTDAR                                                   03020000
CVTDCB   EQU   CVTMAP+116                                               03021000
CVTIERLC EQU   CVTMAP+144                                               03022000
CVTOPTA  EQU   CVTMAP+182                                               03023000
CVTOPTB  EQU   CVTMAP+183                                               03024000
CVTGTF   EQU   CVTMAP+236                                               03025000
CVTGTFST EQU   CVTGTF                                                   03026000
CVTGTFS  EQU   CVTGTFST                                                 03027000
CVTSTATE EQU   CVTGTFST                                                 03028000
CVTTMODE EQU   CVTGTFST                                                 03029000
CVTFORM  EQU   CVTGTFST                                                 03030000
CVTAQAVT EQU   CVTMAP+240                                               03031000
CVTTCMFG EQU   CVTAQAVT                                                 03032000
CVTVOLM2 EQU   CVTMAP+244                                               03033000
CVTTATA  EQU   CVTVOLM2                                                 03034000
CVTTSKS  EQU   CVTTATA                                                  03035000
CVTVOLF2 EQU   CVTTSKS                                                  03036000
CVTTAT   EQU   CVTTATA+1                                                03037000
CVTATER  EQU   CVTMAP+248                                               03038000
CVTEXT1  EQU   CVTMAP+252                                               03039000
CVTPURG  EQU   CVTMAP+260                                               03040000
CVTQMSG  EQU   CVTMAP+268                                               03041000
CVTDMSR  EQU   CVTMAP+272                                               03042000
CVTRSV37 EQU   CVTDMSR                                                  03043000
CVTDMSRF EQU   CVTRSV37                                                 03044000
CVTERPV  EQU   CVTMAP+316                                               03045000
CVTINTLA EQU   CVTMAP+320                                               03046000
CVTAPF   EQU   CVTMAP+324                                               03047000
CVTEXT2  EQU   CVTMAP+328                                               03048000
CVTHJES  EQU   CVTMAP+332                                               03049000
CVTPGSIA EQU   CVTMAP+348                                               03050000
CVTA1F1  EQU   CVTMAP+356                                               03051000
CVTSYSK  EQU   CVTMAP+357                                               03052000
CVTVOLM1 EQU   CVTMAP+380                                               03053000
CVTVOLF1 EQU   CVTVOLM1                                                 03054000
CVTXTNT1 EQU   0                                                        03055000
CVTXTNT2 EQU   0                                                        03056000
CVTDSSV  EQU   CVTXTNT2                                                 03057000
CVTFLGBT EQU   CVTXTNT2+5                                               03058000
CVTQID   EQU   CVTXTNT2+24                                              03059000
CVTRV400 EQU   CVTXTNT2+52                                              03060000
CVTRV409 EQU   CVTXTNT2+53                                              03061000
CVTATCVT EQU   CVTXTNT2+64                                              03062000
CVTRV429 EQU   CVTXTNT2+84                                              03063000
CVTRV438 EQU   CVTXTNT2+85                                              03064000
CVTRV457 EQU   CVTXTNT2+112                                             03065000
CVTRV466 EQU   CVTXTNT2+113                                             03066000
CVTFIX   EQU   0                                                        03067000
CVTRELNO EQU   CVTFIX+252                                               03068000
ASCB     EQU   0                                                        03069000
ASCBSUPC EQU   ASCB+16                                                  03070000
ASCBASID EQU   ASCB+36                                                  03071000
ASCBFW1  EQU   ASCB+100                                                 03072000
ASCBRCTF EQU   ASCBFW1+2                                                03073000
ASCBFLG1 EQU   ASCBFW1+3                                                03074000
ASCBASXB EQU   ASCB+108                                                 03075000
ASCBDSP1 EQU   ASCB+114                                                 03076000
ASCBFLG2 EQU   ASCB+115                                                 03077000
ASCBLKGP EQU   ASCB+128                                                 03078000
ASCBSRQ  EQU   ASCB+180                                                 03079000
ASCBSRQ1 EQU   ASCBSRQ                                                  03080000
ASCBSRQ2 EQU   ASCBSRQ+1                                                03081000
ASCBSRQ3 EQU   ASCBSRQ+2                                                03082000
ASCBSRQ4 EQU   ASCBSRQ+3                                                03083000
ASXB     EQU   0                                                        03084000
ASXBMPST EQU   ASXB+16                                                  03085000
ASXBAEQ  EQU   ASXB+168                                                 03086000
ASXBCASW EQU   ASXB+216                                                 03087000
ASXBCRB1 EQU   ASXBCASW                                                 03088000
ISTLOK   EQU   0                                                        03089000
LOKCHN   EQU   ISTLOK+1                                                 03090000
LOKCHNG  EQU   LOKCHN                                                   03091000
@NM00068 EQU   LOKCHNG+2                                                03092000
ISTPAB   EQU   0                                                        03093000
PABWQCHN EQU   ISTPAB                                                   03094000
PABWEQA  EQU   PABWQCHN                                                 03095000
PABCHAIN EQU   PABWQCHN+4                                               03096000
PABRUNNG EQU   PABCHAIN                                                 03097000
PABOFFST EQU   ISTPAB+8                                                 03098000
PABDVTA  EQU   ISTPAB+9                                                 03099000
PABRPHFG EQU   ISTPAB+12                                                03100000
PABFLAGS EQU   PABRPHFG                                                 03101000
PABSSN   EQU   PABFLAGS                                                 03102000
PABERLCK EQU   PABFLAGS                                                 03103000
PABERRLK EQU   PABERLCK                                                 03104000
PABRPHA  EQU   PABRPHFG+1                                               03105000
PABEND   EQU   ISTPAB+16                                                03106000
ISTACDEB EQU   0                                                        03107000
ACDTSKID EQU   ISTACDEB+8                                               03108000
ACDANYQ  EQU   ISTACDEB+48                                              03109000
ACDTCB   EQU   ISTACDEB+56                                              03110000
ACDLUFLG EQU   ISTACDEB+102                                             03111000
ACDTPEND EQU   ACDLUFLG                                                 03112000
ISTDYPAB EQU   0                                                        03113000
DYPTYPE  EQU   ISTDYPAB                                                 03114000
DYPLNGTH EQU   ISTDYPAB+1                                               03115000
DYPCHAIN EQU   ISTDYPAB+4                                               03116000
DYPTSKID EQU   ISTDYPAB+8                                               03117000
DYPPACMD EQU   ISTDYPAB+12                                              03118000
DYPPAB   EQU   ISTDYPAB+16                                              03119000
ISTRPH   EQU   0                                                        03120000
RPHCNTL  EQU   ISTRPH                                                   03121000
RPHTYPE  EQU   RPHCNTL                                                  03122000
RPHLNGTH EQU   RPHCNTL+1                                                03123000
RPHFLAGS EQU   RPHCNTL+2                                                03124000
RPHFSTLC EQU   RPHFLAGS                                                 03125000
RPHFLGB  EQU   RPHCNTL+3                                                03126000
RPHRPHA  EQU   ISTRPH+4                                                 03127000
RPHTSKID EQU   ISTRPH+8                                                 03128000
RPHRESMA EQU   ISTRPH+16                                                03129000
RPHWPFLG EQU   RPHRESMA                                                 03130000
RPHRESUM EQU   RPHRESMA+1                                               03131000
RPHPABOF EQU   ISTRPH+20                                                03132000
RPHMAJCB EQU   ISTRPH+21                                                03133000
RPHWEA   EQU   ISTRPH+24                                                03134000
RPHCSPA  EQU   RPHWEA                                                   03135000
RPHSRPRM EQU   ISTRPH+28                                                03136000
RPHCRR   EQU   ISTRPH+32                                                03137000
RPHPABQA EQU   ISTRPH+36                                                03138000
RPHWORK  EQU   ISTRPH+40                                                03139000
RPHSAVE1 EQU   RPHWORK                                                  03140000
RPHSBITS EQU   RPHSAVE1+1                                               03141000
ISTATCVT EQU   0                                                        03142000
ATCRPTCH EQU   ISTATCVT                                                 03143000
ATCITFLD EQU   ISTATCVT+8                                               03144000
ATCITCDS EQU   ATCITFLD+8                                               03145000
ATCITFLG EQU   ATCITCDS+4                                               03146000
ATCITRA1 EQU   ATCITFLG+2                                               03147000
ATCSMPAB EQU   ISTATCVT+88                                              03148000
ATCVDPAB EQU   ISTATCVT+152                                             03149000
ATCLDTIL EQU   ISTATCVT+408                                             03150000
ATCGTSTR EQU   ISTATCVT+608                                             03151000
ATCSMRQ  EQU   ISTATCVT+620                                             03152000
ATCSMRS  EQU   ISTATCVT+624                                             03153000
ATCLUDVT EQU   ISTATCVT+768                                             03154000
ATCANYDT EQU   ISTATCVT+776                                             03155000
@NM00080 EQU   ISTATCVT+780                                             03156000
ATCPODVT EQU   ISTATCVT+804                                             03157000
ATCBPDA  EQU   ISTATCVT+856                                             03158000
ATCSTAT  EQU   ISTATCVT+936                                             03159000
ATCSTAT1 EQU   ATCSTAT                                                  03160000
ATCPOFLG EQU   ATCSTAT+2                                                03161000
ATCSTAT4 EQU   ATCSTAT+3                                                03162000
ATCBITAN EQU   ISTATCVT+940                                             03163000
ATCFLAG2 EQU   ATCBITAN+1                                               03164000
ATCONID  EQU   ISTATCVT+944                                             03165000
ATCSSCPA EQU   ISTATCVT+948                                             03166000
ATCHPGM  EQU   ISTATCVT+1012                                            03167000
ATCVLCNT EQU   ISTATCVT+1016                                            03168000
ATCRNO   EQU   ISTATCVT+1020                                            03169000
@NM00103 EQU   ISTATCVT+1028                                            03170000
ATCSHRFG EQU   @NM00103+8                                               03171000
ATCCPDVT EQU   ISTATCVT+1096                                            03172000
ATCSMSDQ EQU   ISTATCVT+1140                                            03173000
ATCRID   EQU   ISTATCVT+1152                                            03174000
ATCLDAPP EQU   ISTATCVT+1288                                            03175000
ATCSQAFR EQU   ISTATCVT+1312                                            03176000
ATCORTCB EQU   ATCSQAFR+4                                               03177000
ATCORSRB EQU   ATCORTCB                                                 03178000
ATCICAPP EQU   ISTATCVT+1320                                            03179000
ATCDAPVT EQU   ISTATCVT+1340                                            03180000
ATCAP51  EQU   ISTATCVT+1392                                            03181000
ATCGSRBQ EQU   ISTATCVT+1472                                            03182000
ATCGSRBG EQU   ATCGSRBQ                                                 03183000
ATCENFLG EQU   ISTATCVT+1512                                            03184000
ATCABEN  EQU   ATCENFLG                                                 03185000
@NM00118 EQU   ISTATCVT+1575                                            03186000
ATCVTFLG EQU   ISTATCVT+1576                                            03187000
ATCAP23  EQU   ISTATCVT+1620                                            03188000
ATCAP55  EQU   ISTATCVT+1632                                            03189000
ATCAP84  EQU   ISTATCVT+1664                                            03190000
ATCMPLTA EQU   ISTATCVT+1680                                            03191000
ATCZFLAG EQU   ISTATCVT+1696                                            03192000
ATCCRA   EQU   ISTATCVT+1720                                            03193000
ATCCRACN EQU   ATCCRA+4                                                 03194000
ATCSRB   EQU   ISTATCVT+1728                                            03195000
ATCSRBCN EQU   ATCSRB+4                                                 03196000
ATCCRPL  EQU   ISTATCVT+1736                                            03197000
ATCRPLCN EQU   ATCCRPL+4                                                03198000
ISTMPLT  EQU   0                                                        03199000
MPLCHN   EQU   ISTMPLT                                                  03200000
MPLID    EQU   ISTMPLT+4                                                03201000
MPLECNT  EQU   ISTMPLT+8                                                03202000
MPLCDS   EQU   ISTMPLT+16                                               03203000
MPLADDR  EQU   MPLCDS                                                   03204000
MPLASID  EQU   MPLCDS+4                                                 03205000
MPLFLGS1 EQU   MPLCDS+6                                                 03206000
ISTMPST  EQU   0                                                        03207000
MPSID    EQU   ISTMPST                                                  03208000
MPSRSV07 EQU   ISTMPST+4                                                03209000
MPSRQFGA EQU   ISTMPST+8                                                03210000
MPSRQUE  EQU   MPSRQFGA                                                 03211000
MPSFLGA  EQU   MPSRQFGA+4                                               03212000
MPSFLGAA EQU   MPSFLGA                                                  03213000
MPSAUTH  EQU   MPSFLGAA                                                 03214000
MPSFLGAB EQU   MPSFLGA+1                                                03215000
MPSASID  EQU   MPSFLGA+2                                                03216000
MPSPSTCT EQU   ISTMPST+16                                               03217000
MPSMPSTP EQU   ISTMPST+20                                               03218000
MPSCRA   EQU   ISTMPST+24                                               03219000
MPSCRACT EQU   MPSCRA+4                                                 03220000
MPSSRB   EQU   ISTMPST+32                                               03221000
MPSSRBCT EQU   MPSSRB+4                                                 03222000
MPSCRPL  EQU   ISTMPST+40                                               03223000
MPSCRPLQ EQU   MPSCRPL                                                  03224000
MPSRPLCT EQU   MPSCRPL+4                                                03225000
MPSSRB55 EQU   ISTMPST+48                                               03226000
MPSSMRPH EQU   ISTMPST+52                                               03227000
MPSSMPAB EQU   ISTMPST+56                                               03228000
MPSTPPAB EQU   ISTMPST+88                                               03229000
MPSASCB  EQU   ISTMPST+120                                              03230000
MPSDBTBL EQU   ISTMPST+124                                              03231000
MPSSYSRT EQU   ISTMPST+132                                              03232000
MPSSAVE  EQU   ISTMPST+140                                              03233000
ISTPST   EQU   0                                                        03234000
PSTTYPE  EQU   ISTPST                                                   03235000
PSTLNGTH EQU   ISTPST+1                                                 03236000
PSTRQFGA EQU   ISTPST+8                                                 03237000
PSTRQUE  EQU   PSTRQFGA                                                 03238000
PSTFLGA  EQU   PSTRQFGA+4                                               03239000
PSTAUTH  EQU   PSTFLGA                                                  03240000
PSTABINP EQU   PSTFLGA                                                  03241000
PSTTCBA  EQU   ISTPST+16                                                03242000
PSTMPSTP EQU   ISTPST+20                                                03243000
PSTACBCT EQU   ISTPST+24                                                03244000
PSTPSSQ  EQU   ISTPST+28                                                03245000
PSTNSSQ  EQU   ISTPST+32                                                03246000
PSTUEQ   EQU   ISTPST+36                                                03247000
PSTIQE11 EQU   ISTPST+40                                                03248000
PSTIQE12 EQU   ISTPST+44                                                03249000
PSTIQE21 EQU   ISTPST+48                                                03250000
PSTIQE22 EQU   ISTPST+52                                                03251000
PSTCRRS  EQU   ISTPST+60                                                03252000
PSTSMDYP EQU   ISTPST+64                                                03253000
PSTDMPS  EQU   ISTPST+132                                               03254000
ISTPFCRR EQU   0                                                        03255000
PFCCRR   EQU   ISTPFCRR                                                 03256000
PFCCRRID EQU   PFCCRR                                                   03257000
PFCCRRLN EQU   PFCCRR+2                                                 03258000
PFCHDR   EQU   ISTPFCRR+4                                               03259000
PFCCRRO  EQU   PFCHDR                                                   03260000
PFCFRRO  EQU   PFCHDR+4                                                 03261000
ISTCFCRR EQU   0                                                        03262000
CFCAUDIT EQU   ISTCFCRR                                                 03263000
CFCNTRD  EQU   CFCAUDIT                                                 03264000
CFCCRT   EQU   CFCAUDIT+1                                               03265000
ISTDCCRR EQU   0                                                        03266000
CRRSPACE EQU   ISTDCCRR+12                                              03267000
CRRSAREA EQU   0                                                        03268000
CRRMAS   EQU   CRRSAREA+148                                             03269000
CRRMAS1  EQU   CRRMAS                                                   03270000
CRRMAS2  EQU   CRRMAS+1                                                 03271000
CRRMAS3  EQU   CRRMAS+2                                                 03272000
CRRMAS4  EQU   CRRMAS+3                                                 03273000
CRRRMAS1 EQU   CRRMAS+4                                                 03274000
CRRRMAS2 EQU   CRRMAS+5                                                 03275000
CRRRMAS3 EQU   CRRMAS+6                                                 03276000
CRRSMAS  EQU   CRRRMAS3                                                 03277000
CRRATS   EQU   CRRSAREA+156                                             03278000
CRRATS1  EQU   CRRATS                                                   03279000
CRRATS2  EQU   CRRATS+1                                                 03280000
CRRATS3  EQU   CRRATS+2                                                 03281000
CRRATS4  EQU   CRRATS+3                                                 03282000
CRRRATS1 EQU   CRRATS+4                                                 03283000
CRRRATS2 EQU   CRRATS+5                                                 03284000
CRRRATS3 EQU   CRRATS+6                                                 03285000
CRRSATS  EQU   CRRRATS3                                                 03286000
CRRFLGS1 EQU   CRRSAREA+164                                             03287000
CRRFLGS2 EQU   CRRSAREA+165                                             03288000
CRRFLGS3 EQU   CRRSAREA+166                                             03289000
CRRFLGS4 EQU   CRRSAREA+167                                             03290000
CRRFLGS  EQU   CRRSAREA+168                                             03291000
CRRRFLG1 EQU   CRRSAREA+169                                             03292000
CRRRTYPE EQU   CRRRFLG1                                                 03293000
CRRFDBK1 EQU   CRRSAREA+170                                             03294000
CRRFDB2  EQU   CRRFDBK1+1                                               03295000
CRRFDB3  EQU   CRRFDBK1+2                                               03296000
CRRFDBK2 EQU   CRRSAREA+176                                             03297000
CRRDSB   EQU   CRRFDBK2                                                 03298000
CRRESR   EQU   CRRFDBK2+2                                               03299000
CRRTRBUF EQU   CRRSAREA+204                                             03300000
CRRBFLGS EQU   CRRSAREA+280                                             03301000
ISTASCRR EQU   0                                                        03302000
ASCFLAGS EQU   ISTASCRR+16                                              03303000
ASCFLG1  EQU   ASCFLAGS                                                 03304000
ASCFLG2  EQU   ASCFLAGS+2                                               03305000
ASCFLG3  EQU   ASCFLAGS+4                                               03306000
ASCUSRGS EQU   ISTASCRR+28                                              03307000
ISTAPCRR EQU   0                                                        03308000
APCATFLG EQU   ISTAPCRR+16                                              03309000
APCRFLG  EQU   ISTAPCRR+18                                              03310000
APCRTRN  EQU   ISTAPCRR+28                                              03311000
APCAUT   EQU   APCRTRN                                                  03312000
APCSAVE  EQU   ISTAPCRR+44                                              03313000
APCCOMF  EQU   ISTAPCRR+116                                             03314000
APCCOMF1 EQU   APCCOMF                                                  03315000
APC31FLG EQU   ISTAPCRR+132                                             03316000
APC52FLG EQU   ISTAPCRR+133                                             03317000
APC53FLG EQU   ISTAPCRR+134                                             03318000
APC54FLG EQU   ISTAPCRR+135                                             03319000
APC57FLG EQU   ISTAPCRR+136                                             03320000
ISTCRA   EQU   0                                                        03321000
CRABASIC EQU   ISTCRA                                                   03322000
CRAHDR   EQU   CRABASIC                                                 03323000
CRALKACT EQU   CRABASIC+8                                               03324000
CRARPH   EQU   ISTCRA+52                                                03325000
CRAPSS   EQU   ISTCRA+160                                               03326000
CRAPROCR EQU   ISTCRA+312                                               03327000
CRASVC   EQU   ISTCRA+924                                               03328000
CRABUFA  EQU   CRASVC+68                                                03329000
CRARSV01 EQU   ISTCRA+996                                               03330000
CRARSV02 EQU   ISTCRA+1000                                              03331000
CRAIDS   EQU   ISTCRA+1004                                              03332000
CRACHAIN EQU   ISTCRA+1012                                              03333000
ISTDCE   EQU   0                                                        03334000
DCEDBPTR EQU   ISTDCE                                                   03335000
DCECHN   EQU   ISTDCE+4                                                 03336000
ISTBPENT EQU   0                                                        03337000
BPEPID   EQU   ISTBPENT                                                 03338000
BPEFLAGS EQU   ISTBPENT+4                                               03339000
BPEBFSIZ EQU   ISTBPENT+6                                               03340000
BPEPTR   EQU   0                                                        03341000
ISTBPDTY EQU   0                                                        03342000
BPDHDR   EQU   ISTBPDTY                                                 03343000
BPDBPENT EQU   BPDHDR                                                   03344000
BPDFBPE  EQU   BPDHDR+32                                                03345000
BPDFLAG  EQU   BPDHDR+40                                                03346000
BPDPARM  EQU   BPDHDR+48                                                03347000
BPDTRACE EQU   BPDHDR+56                                                03348000
BPDPTR   EQU   0                                                        03349000
PTRTBL   EQU   0                                                        03350000
XTCBPTR  EQU   PTRTBL+4                                                 03351000
TCBPTR   EQU   XTCBPTR+1                                                03352000
ASCBPTR  EQU   PTRTBL+12                                                03353000
COMPCODE EQU   16                                                       03354000
ACDEBPTR EQU   24                                                       03355000
FMZL0064 EQU   0                                                        03356000
FMZL0087 EQU   0                                                        03357000
FMZL0146 EQU   0                                                        03358000
FMZL0167 EQU   0                                                        03359000
FMZL0195 EQU   0                                                        03360000
FMZL0216 EQU   0                                                        03361000
FMZL0237 EQU   0                                                        03362000
FMZL0264 EQU   0                                                        03363000
CMZ0285A EQU   0                                                        03364000
CMZ0285  EQU   CMZ0285A+1                                               03365000
IQEEND   EQU   0                                                        03366000
ISTXDYP  EQU   0                                                        03367000
ISTXPAB  EQU   0                                                        03368000
FLC      EQU   PSA                                                      03369000
PSARSVTE EQU   PSARSVT                                                  03370000
RBSECS03 EQU   RBEP                                                     03371000
RBCDE    EQU   RBSECS03                                                 03372000
RBCDFLGS EQU   RBCDE                                                    03373000
RBSECS05 EQU   RBPGMQ                                                   03374000
RBSQE    EQU   RBSECS05                                                 03375000
RBSECS06 EQU   RBPGMQ                                                   03376000
RBIQE    EQU   RBSECS06                                                 03377000
RBSECS07 EQU   RBPGMQ                                                   03378000
RBIQE2   EQU   RBSECS07                                                 03379000
RBSECS08 EQU   IRBEND                                                   03380000
RBSECS09 EQU   IRBEND                                                   03381000
CVTS01   EQU   CVTPGSIA                                                 03382000
CVTLPDIA EQU   CVTS01+12                                                03383000
CVTDIRST EQU   CVTLPDIA                                                 03384000
CVTSLIDA EQU   CVTS01+24                                                03385000
CVTCTLFG EQU   CVTS01+50                                                03386000
CVTSRBRT EQU   CVTS01+100                                               03387000
CVTRV210 EQU   CVTS01+424                                               03388000
CVTRV219 EQU   CVTS01+425                                               03389000
CVTRV228 EQU   CVTS01+426                                               03390000
CVTRV237 EQU   CVTS01+427                                               03391000
CVTMFRTR EQU   CVTS01+452                                               03392000
CVTRV262 EQU   CVTS01+468                                               03393000
CVTRV271 EQU   CVTS01+469                                               03394000
CVTRV280 EQU   CVTS01+470                                               03395000
CVTRV289 EQU   CVTS01+471                                               03396000
CVTGSDA  EQU   CVTS01+600                                               03397000
ASXBPTR  EQU   ASCBASXB                                                 03398000
PABXTNSN EQU   PABEND                                                   03399000
@NM00146 EQU   CRAPROCR                                                 03400000
CRACFCRR EQU   CRAPROCR                                                 03401000
SRB      EQU   SRBSECT                                                  03402000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03403000
CRACRRSA EQU   @NM00146+12                                              03404000
@NM00147 EQU   @NM00146                                                 03405000
@NM00070 EQU   PABXTNSN+12                                              03406000
PABNPSSQ EQU   PABXTNSN+8                                               03407000
PABLOCK  EQU   PABXTNSN+4                                               03408000
PABLAST  EQU   PABXTNSN                                                 03409000
CVTRV628 EQU   CVTS01+728                                               03410000
CVTRV627 EQU   CVTS01+724                                               03411000
CVTRV626 EQU   CVTS01+720                                               03412000
CVTRV625 EQU   CVTS01+716                                               03413000
CVTRV624 EQU   CVTS01+712                                               03414000
CVTRV623 EQU   CVTS01+708                                               03415000
CVTRV622 EQU   CVTS01+704                                               03416000
CVTRV621 EQU   CVTS01+700                                               03417000
CVTIHASU EQU   CVTS01+696                                               03418000
CVTSUSP  EQU   CVTS01+692                                               03419000
CVTT6SVC EQU   CVTS01+688                                               03420000
CVTCDAL  EQU   CVTS01+684                                               03421000
CVTTCTL  EQU   CVTS01+680                                               03422000
CVTRSUME EQU   CVTS01+676                                               03423000
CVTJTERM EQU   CVTS01+672                                               03424000
CVTASMRM EQU   CVTS01+668                                               03425000
CVTTCASP EQU   CVTS01+664                                               03426000
CVT0PT03 EQU   CVTS01+660                                               03427000
CVT0PT0E EQU   CVTS01+656                                               03428000
CVTRV609 EQU   CVTS01+652                                               03429000
CVTCGK   EQU   CVTS01+648                                               03430000
CVTRAC   EQU   CVTS01+644                                               03431000
CVTRV606 EQU   CVTS01+640                                               03432000
CVTRV605 EQU   CVTS01+636                                               03433000
CVTRV604 EQU   CVTS01+632                                               03434000
CVTEFF02 EQU   CVTS01+628                                               03435000
CVTCBBR  EQU   CVTS01+624                                               03436000
CVTSSCR  EQU   CVTS01+620                                               03437000
CVTEVENT EQU   CVTS01+616                                               03438000
CVTCRCA  EQU   CVTS01+612                                               03439000
CVTTPIO  EQU   CVTS01+608                                               03440000
CVTADV   EQU   CVTS01+604                                               03441000
CVTGSDAB EQU   CVTGSDA                                                  03442000
CVTQV3   EQU   CVTS01+596                                               03443000
CVTQV2   EQU   CVTS01+592                                               03444000
CVTQV1   EQU   CVTS01+588                                               03445000
CVTRPT   EQU   CVTS01+584                                               03446000
CVTSSRB  EQU   CVTS01+580                                               03447000
CVTCSDRL EQU   CVTS01+576                                               03448000
CVTEXP1  EQU   CVTS01+572                                               03449000
CVTRMPMT EQU   CVTS01+568                                               03450000
CVTRMPTT EQU   CVTS01+564                                               03451000
CVTVPSA  EQU   CVTS01+560                                               03452000
CVTVSTOP EQU   CVTS01+556                                               03453000
CVTGTFR8 EQU   CVTS01+552                                               03454000
CVTQUIT  EQU   CVTS01+548                                               03455000
CVTVACR  EQU   CVTS01+544                                               03456000
CVTWTCB  EQU   CVTS01+540                                               03457000
CVTSTPRS EQU   CVTS01+536                                               03458000
CVT0PT02 EQU   CVTS01+532                                               03459000
CVTDARCM EQU   CVTS01+528                                               03460000
CVTIRECM EQU   CVTS01+524                                               03461000
CVTJRECM EQU   CVTS01+520                                               03462000
CVTVEMS0 EQU   CVTS01+516                                               03463000
CVTSPFRR EQU   CVTS01+512                                               03464000
CVTRLSTG EQU   CVTS01+508                                               03465000
CVT0TC0A EQU   CVTS01+504                                               03466000
CVTGMBR  EQU   CVTS01+500                                               03467000
CVTLFRM  EQU   CVTS01+496                                               03468000
CVTRMBR  EQU   CVTS01+492                                               03469000
CVTVIOP  EQU   CVTS01+488                                               03470000
CVTRV307 EQU   CVTS01+486                                               03471000
CVTRV306 EQU   CVTS01+484                                               03472000
CVTRV305 EQU   CVTS01+482                                               03473000
CVTRV304 EQU   CVTS01+480                                               03474000
CVTRV303 EQU   CVTS01+478                                               03475000
CVTRV302 EQU   CVTS01+476                                               03476000
CVTTRCA  EQU   CVTS01+472                                               03477000
CVTRV297 EQU   CVTRV289                                                 03478000
CVTRV296 EQU   CVTRV289                                                 03479000
CVTRV295 EQU   CVTRV289                                                 03480000
CVTRV294 EQU   CVTRV289                                                 03481000
CVTRV293 EQU   CVTRV289                                                 03482000
CVTRV292 EQU   CVTRV289                                                 03483000
CVTRV291 EQU   CVTRV289                                                 03484000
CVTRV290 EQU   CVTRV289                                                 03485000
CVTRV288 EQU   CVTRV280                                                 03486000
CVTRV287 EQU   CVTRV280                                                 03487000
CVTRV286 EQU   CVTRV280                                                 03488000
CVTRV285 EQU   CVTRV280                                                 03489000
CVTRV284 EQU   CVTRV280                                                 03490000
CVTRV283 EQU   CVTRV280                                                 03491000
CVTRV282 EQU   CVTRV280                                                 03492000
CVTRV281 EQU   CVTRV280                                                 03493000
CVTRV279 EQU   CVTRV271                                                 03494000
CVTRV278 EQU   CVTRV271                                                 03495000
CVTRV277 EQU   CVTRV271                                                 03496000
CVTRV276 EQU   CVTRV271                                                 03497000
CVTRV275 EQU   CVTRV271                                                 03498000
CVTRV274 EQU   CVTRV271                                                 03499000
CVTRV273 EQU   CVTRV271                                                 03500000
CVTRV272 EQU   CVTRV271                                                 03501000
CVTRV270 EQU   CVTRV262                                                 03502000
CVTRV269 EQU   CVTRV262                                                 03503000
CVTRV268 EQU   CVTRV262                                                 03504000
CVTRV267 EQU   CVTRV262                                                 03505000
CVTRV266 EQU   CVTRV262                                                 03506000
CVTRV265 EQU   CVTRV262                                                 03507000
CVTRV264 EQU   CVTRV262                                                 03508000
CVTRV263 EQU   CVTRV262                                                 03509000
CVTVFP   EQU   CVTS01+464                                               03510000
CVTVSI   EQU   CVTS01+460                                               03511000
CVTVPSIB EQU   CVTS01+456                                               03512000
CVTMFACT EQU   CVTMFRTR                                                 03513000
CVTMFCTL EQU   CVTS01+448                                               03514000
CVTPVBP  EQU   CVTS01+444                                               03515000
CVTPWI   EQU   CVTS01+440                                               03516000
CVTRV254 EQU   CVTS01+438                                               03517000
CVTRV253 EQU   CVTS01+436                                               03518000
CVTRV252 EQU   CVTS01+434                                               03519000
CVTRV251 EQU   CVTS01+433                                               03520000
CVTRV250 EQU   CVTS01+432                                               03521000
CVTRV249 EQU   CVTS01+431                                               03522000
CVTRV248 EQU   CVTS01+430                                               03523000
CVTRV247 EQU   CVTS01+429                                               03524000
CVTRV246 EQU   CVTS01+428                                               03525000
CVTRV245 EQU   CVTRV237                                                 03526000
CVTRV244 EQU   CVTRV237                                                 03527000
CVTRV243 EQU   CVTRV237                                                 03528000
CVTRV242 EQU   CVTRV237                                                 03529000
CVTRV241 EQU   CVTRV237                                                 03530000
CVTRV240 EQU   CVTRV237                                                 03531000
CVTRV239 EQU   CVTRV237                                                 03532000
CVTRV238 EQU   CVTRV237                                                 03533000
CVTRV236 EQU   CVTRV228                                                 03534000
CVTRV235 EQU   CVTRV228                                                 03535000
CVTRV234 EQU   CVTRV228                                                 03536000
CVTRV233 EQU   CVTRV228                                                 03537000
CVTRV232 EQU   CVTRV228                                                 03538000
CVTRV231 EQU   CVTRV228                                                 03539000
CVTRV230 EQU   CVTRV228                                                 03540000
CVTRV229 EQU   CVTRV228                                                 03541000
CVTRV227 EQU   CVTRV219                                                 03542000
CVTRV226 EQU   CVTRV219                                                 03543000
CVTRV225 EQU   CVTRV219                                                 03544000
CVTRV224 EQU   CVTRV219                                                 03545000
CVTRV223 EQU   CVTRV219                                                 03546000
CVTRV222 EQU   CVTRV219                                                 03547000
CVTRV221 EQU   CVTRV219                                                 03548000
CVTRV220 EQU   CVTRV219                                                 03549000
CVTRV218 EQU   CVTRV210                                                 03550000
CVTRV217 EQU   CVTRV210                                                 03551000
CVTRV216 EQU   CVTRV210                                                 03552000
CVTRV215 EQU   CVTRV210                                                 03553000
CVTRV214 EQU   CVTRV210                                                 03554000
CVTRV213 EQU   CVTRV210                                                 03555000
CVTRV212 EQU   CVTRV210                                                 03556000
CVTRV211 EQU   CVTRV210                                                 03557000
CVTLCCAT EQU   CVTS01+420                                               03558000
CVTPCCAT EQU   CVTS01+416                                               03559000
CVTIPCRP EQU   CVTS01+412                                               03560000
CVTIPCRI EQU   CVTS01+408                                               03561000
CVTIPCDS EQU   CVTS01+404                                               03562000
CVTAIDVT EQU   CVTS01+400                                               03563000
CVTSSAP  EQU   CVTS01+396                                               03564000
CVTEHCIR EQU   CVTS01+392                                               03565000
CVTEHDEF EQU   CVTS01+388                                               03566000
CVTDAIR  EQU   CVTS01+384                                               03567000
CVTPERFM EQU   CVTS01+380                                               03568000
CVT044R2 EQU   CVTS01+376                                               03569000
CVTFETCH EQU   CVTS01+372                                               03570000
CVTRSTWD EQU   CVTS01+368                                               03571000
CVTSPOST EQU   CVTS01+364                                               03572000
CVTIOBP  EQU   CVTS01+360                                               03573000
CVTASMVT EQU   CVTS01+356                                               03574000
CVTRECRQ EQU   CVTS01+352                                               03575000
CVTWSAC  EQU   CVTS01+348                                               03576000
CVTRV149 EQU   CVTS01+344                                               03577000
CVTWSAL  EQU   CVTS01+340                                               03578000
CVTSPSA  EQU   CVTS01+336                                               03579000
CVTGLMN  EQU   CVTS01+332                                               03580000
CVTVEAC0 EQU   CVTS01+328                                               03581000
CVT062R1 EQU   CVTS01+324                                               03582000
CVTRPOST EQU   CVTS01+320                                               03583000
CVTDQIQE EQU   CVTS01+316                                               03584000
CVTCSD   EQU   CVTS01+312                                               03585000
CVTLKRMA EQU   CVTS01+308                                               03586000
CVTRSPIE EQU   CVTS01+304                                               03587000
CVTRENQ  EQU   CVTS01+300                                               03588000
CVTLQCB  EQU   CVTS01+296                                               03589000
CVTFQCB  EQU   CVTS01+292                                               03590000
CVTQCS01 EQU   CVTS01+288                                               03591000
CVTAPFT  EQU   CVTS01+284                                               03592000
CVTPARRL EQU   CVTS01+280                                               03593000
CVTVWAIT EQU   CVTS01+276                                               03594000
CVTGSPL  EQU   CVTS01+272                                               03595000
CVTLSMQ  EQU   CVTS01+268                                               03596000
CVTGSMQ  EQU   CVTS01+264                                               03597000
CVTEXPRO EQU   CVTS01+260                                               03598000
CVTOPCTP EQU   CVTS01+256                                               03599000
CVTSIC   EQU   CVTS01+252                                               03600000
CVTTPIOS EQU   CVTS01+248                                               03601000
CVTRTMS  EQU   CVTS01+244                                               03602000
CVTSDBF  EQU   CVTS01+240                                               03603000
CVTSCBP  EQU   CVTS01+236                                               03604000
CVTSDMP  EQU   CVTS01+232                                               03605000
CVTSV60  EQU   CVTS01+228                                               03606000
CVTRTMCT EQU   CVTS01+224                                               03607000
CVTASCBL EQU   CVTS01+220                                               03608000
CVTASCBH EQU   CVTS01+216                                               03609000
CVTGDA   EQU   CVTS01+212                                               03610000
CVTASVT  EQU   CVTS01+208                                               03611000
CVTVVMDI EQU   CVTS01+204                                               03612000
CVTAQTOP EQU   CVTS01+200                                               03613000
CVTIOSCS EQU   CVTS01+196                                               03614000
CVTSDRM  EQU   CVTS01+192                                               03615000
CVTOPTE  EQU   CVTS01+188                                               03616000
CVTSTXU  EQU   CVTS01+184                                               03617000
CVTQUIS  EQU   CVTS01+180                                               03618000
CVTPARS  EQU   CVTS01+176                                               03619000
CVTS1EE  EQU   CVTS01+172                                               03620000
CVTFRAS  EQU   CVTS01+168                                               03621000
CVTQSAS  EQU   CVTS01+164                                               03622000
CVTCRAS  EQU   CVTS01+160                                               03623000
CVTCRMN  EQU   CVTS01+156                                               03624000
CVTDELCP EQU   CVTS01+152                                               03625000
CVTFRECL EQU   CVTS01+148                                               03626000
CVTGETCL EQU   CVTS01+144                                               03627000
CVTBLDCP EQU   CVTS01+140                                               03628000
CVTAUTHL EQU   CVTS01+136                                               03629000
CVTSCAN  EQU   CVTS01+132                                               03630000
CVTRV144 EQU   CVTS01+130                                               03631000
CVTMAXMP EQU   CVTS01+128                                               03632000
CVTSTCK  EQU   CVTS01+124                                               03633000
CVTRV139 EQU   CVTS01+123                                               03634000
CVTDSSAC EQU   CVTS01+122                                               03635000
CVTRV513 EQU   CVTS01+121                                               03636000
CVTIOSPL EQU   CVTS01+120                                               03637000
CVTPTGT  EQU   CVTS01+116                                               03638000
CVTCSPIE EQU   CVTS01+112                                               03639000
CVTSMFEX EQU   CVTS01+108                                               03640000
CVTOLT0A EQU   CVTS01+104                                               03641000
CVTPUTL  EQU   CVTS01+96                                                03642000
CVTASCRL EQU   CVTS01+92                                                03643000
CVTASCRF EQU   CVTS01+88                                                03644000
CVTRV326 EQU   CVTS01+84                                                03645000
CVTRV325 EQU   CVTS01+80                                                03646000
CVTRV324 EQU   CVTS01+76                                                03647000
CVT0VL01 EQU   CVTS01+72                                                03648000
CVTSHRVM EQU   CVTS01+68                                                03649000
CVTRV332 EQU   CVTS01+64                                                03650000
CVTTAS   EQU   CVTS01+60                                                03651000
CVTRSCN  EQU   CVTS01+56                                                03652000
CVTTRAC2 EQU   CVTS01+54                                                03653000
CVTTRACE EQU   CVTS01+52                                                03654000
CVTAPG   EQU   CVTS01+51                                                03655000
CVTSDTRC EQU   CVTCTLFG                                                 03656000
CVTGTRCE EQU   CVTCTLFG                                                 03657000
CVTNOMP  EQU   CVTCTLFG                                                 03658000
CVTRSV79 EQU   CVTCTLFG                                                 03659000
CVTDSTAT EQU   CVTCTLFG                                                 03660000
CVTRSV78 EQU   CVTCTLFG                                                 03661000
CVTRV333 EQU   CVTCTLFG                                                 03662000
CVTRV323 EQU   CVTCTLFG                                                 03663000
CVTSPVLK EQU   CVTS01+49                                                03664000
CVTRSV77 EQU   CVTS01+48                                                03665000
CVTRV331 EQU   CVTS01+44                                                03666000
CVTRV330 EQU   CVTS01+40                                                03667000
CVTRV329 EQU   CVTS01+36                                                03668000
CVTRV328 EQU   CVTS01+32                                                03669000
CVTRV322 EQU   CVTS01+28                                                03670000
CVTSLID  EQU   CVTSLIDA+1                                               03671000
CVTSYLK  EQU   CVTSLIDA                                                 03672000
CVTRV321 EQU   CVTS01+20                                                03673000
CVTRV320 EQU   CVTS01+16                                                03674000
CVTLPDIR EQU   CVTLPDIA+1                                               03675000
CVTRSV69 EQU   CVTDIRST                                                 03676000
CVTRSV68 EQU   CVTDIRST                                                 03677000
CVTRSV67 EQU   CVTDIRST                                                 03678000
CVTRSV66 EQU   CVTDIRST                                                 03679000
CVTRSV65 EQU   CVTDIRST                                                 03680000
CVTRSV64 EQU   CVTDIRST                                                 03681000
CVTRSV63 EQU   CVTDIRST                                                 03682000
CVTDICOM EQU   CVTDIRST                                                 03683000
CVTPVTP  EQU   CVTS01+8                                                 03684000
CVTLPDSR EQU   CVTS01+4                                                 03685000
CVTGETL  EQU   CVTS01                                                   03686000
RBRSV161 EQU   RBSECS09+64                                              03687000
RBSIRBWA EQU   RBSECS09                                                 03688000
RBIQEWRK EQU   RBSECS08+4                                               03689000
RBNEXAV  EQU   RBSECS08                                                 03690000
RBIQEA   EQU   RBIQE2                                                   03691000
RBIQE1   EQU   RBIQE+1                                                  03692000
RBUSE    EQU   RBIQE                                                    03693000
RBSQEA   EQU   RBSQE+1                                                  03694000
@NM00058 EQU   RBSQE                                                    03695000
RBCDE1   EQU   RBCDE+1                                                  03696000
RBCDLOAD EQU   RBCDFLGS                                                 03697000
RBCDXCTL EQU   RBCDFLGS                                                 03698000
RBCDSYNC EQU   RBCDFLGS                                                 03699000
RBCDNODE EQU   RBCDFLGS                                                 03700000
RBRSV010 EQU   RBCDFLGS                                                 03701000
RBCDATCH EQU   RBCDFLGS                                                 03702000
RBRSV009 EQU   RBCDFLGS                                                 03703000
RBNOCELL EQU   RBCDFLGS                                                 03704000
PSARSAV  EQU   PSARSVTE+60                                              03705000
PSARSTK  EQU   PSARSVTE+56                                              03706000
PSAESAV3 EQU   PSARSVTE+52                                              03707000
PSAESTK3 EQU   PSARSVTE+48                                              03708000
PSAESAV2 EQU   PSARSVTE+44                                              03709000
PSAESTK2 EQU   PSARSVTE+40                                              03710000
PSAESAV1 EQU   PSARSVTE+36                                              03711000
PSAESTK1 EQU   PSARSVTE+32                                              03712000
PSAPSAV  EQU   PSARSVTE+28                                              03713000
PSAPSTK  EQU   PSARSVTE+24                                              03714000
PSAMSAV  EQU   PSARSVTE+20                                              03715000
PSAMSTK  EQU   PSARSVTE+16                                              03716000
PSASSAV  EQU   PSARSVTE+12                                              03717000
PSASSTK  EQU   PSARSVTE+8                                               03718000
PSANSTK  EQU   PSARSVTE+4                                               03719000
PSACSTK  EQU   PSARSVTE                                                 03720000
@NM00179 EQU   CMZ0285A                                                 03721000
NASCBPTR EQU   PTRTBL+8                                                 03722000
@NM00150 EQU   XTCBPTR                                                  03723000
NTCBPTR  EQU   PTRTBL                                                   03724000
BPDCBID  EQU   ISTBPDTY+384                                             03725000
BPDENTRY EQU   ISTBPDTY+192                                             03726000
@NM00149 EQU   BPDHDR+188                                               03727000
BPDCRBF  EQU   BPDTRACE+10                                              03728000
BPDMXBF  EQU   BPDTRACE+8                                               03729000
BPDTEXP  EQU   BPDTRACE+6                                               03730000
BPDAVNO  EQU   BPDTRACE+4                                               03731000
BPDMQUE  EQU   BPDTRACE+2                                               03732000
BPDMUSE  EQU   BPDTRACE                                                 03733000
BPDTRADR EQU   BPDPARM+4                                                03734000
BPDTRID  EQU   BPDPARM+3                                                03735000
@NM00148 EQU   BPDPARM+2                                                03736000
BPDTRLEN EQU   BPDPARM                                                  03737000
BPDREQMX EQU   BPDHDR+46                                                03738000
BPDREQCT EQU   BPDHDR+44                                                03739000
BPDRSV01 EQU   BPDFLAG                                                  03740000
BPDGTR   EQU   BPDFLAG                                                  03741000
BPDATCVT EQU   BPDHDR+36                                                03742000
BPDSMPCB EQU   BPDHDR+28                                                03743000
BPDFEXT  EQU   BPDHDR+24                                                03744000
BPDADRS2 EQU   BPDHDR+20                                                03745000
BPDADRS1 EQU   BPDHDR+16                                                03746000
BPDPGPCB EQU   BPDHDR+12                                                03747000
BPDCHPCB EQU   BPDHDR+8                                                 03748000
BPDCHBSZ EQU   BPDHDR+6                                                 03749000
BPDCHBNO EQU   BPDHDR+4                                                 03750000
BPDBPMAX EQU   BPDHDR+2                                                 03751000
BPERSV03 EQU   ISTBPENT+12                                              03752000
BPEBPCB  EQU   ISTBPENT+8                                               03753000
BPERSV02 EQU   BPEFLAGS+1                                               03754000
BPEUSRF  EQU   BPEFLAGS+1                                               03755000
BPERSV01 EQU   BPEFLAGS                                                 03756000
BPENWS   EQU   BPEFLAGS                                                 03757000
BPECBID  EQU   BPEFLAGS                                                 03758000
BPEAL48  EQU   BPEFLAGS                                                 03759000
BPENFCHP EQU   BPEFLAGS                                                 03760000
BPEFIXED EQU   BPEFLAGS                                                 03761000
BPEDISP  EQU   BPEFLAGS                                                 03762000
BPEFM    EQU   BPEFLAGS                                                 03763000
DCERSV01 EQU   ISTDCE+12                                                03764000
DCETERM  EQU   ISTDCE+8                                                 03765000
CRAID    EQU   CRAIDS+4                                                 03766000
CRAASID  EQU   CRAIDS+2                                                 03767000
@NM00145 EQU   CRAIDS                                                   03768000
CRABFTBA EQU   CRABUFA                                                  03769000
CRAMASK  EQU   CRASVC+64                                                03770000
CRAHSIZ  EQU   CRASVC+60                                                03771000
CRAASCRR EQU   CRASVC                                                   03772000
@NM00144 EQU   CRAPROCR                                                 03773000
CRALAPTR EQU   CRABASIC+48                                              03774000
CRAL9PTR EQU   CRABASIC+44                                              03775000
CRAL8PTR EQU   CRABASIC+40                                              03776000
CRAL7PTR EQU   CRABASIC+36                                              03777000
CRAL6PTR EQU   CRABASIC+32                                              03778000
CRAL5PTR EQU   CRABASIC+28                                              03779000
CRAL4PTR EQU   CRABASIC+24                                              03780000
CRAL3PTR EQU   CRABASIC+20                                              03781000
CRAL2PTR EQU   CRABASIC+16                                              03782000
CRAL1PTR EQU   CRABASIC+12                                              03783000
CRALEV01 EQU   CRALKACT+3                                               03784000
CRALEV02 EQU   CRALKACT+3                                               03785000
CRALEV03 EQU   CRALKACT+3                                               03786000
CRALEV04 EQU   CRALKACT+3                                               03787000
CRALEV05 EQU   CRALKACT+3                                               03788000
CRALEV06 EQU   CRALKACT+3                                               03789000
CRALEV07 EQU   CRALKACT+3                                               03790000
CRALEV08 EQU   CRALKACT+3                                               03791000
CRALEV09 EQU   CRALKACT+2                                               03792000
CRALEV10 EQU   CRALKACT+2                                               03793000
CRALEV11 EQU   CRALKACT+2                                               03794000
CRALEV12 EQU   CRALKACT+2                                               03795000
CRALEV13 EQU   CRALKACT+2                                               03796000
CRALEV14 EQU   CRALKACT+2                                               03797000
CRALEV15 EQU   CRALKACT+2                                               03798000
CRALEV16 EQU   CRALKACT+2                                               03799000
CRALEV17 EQU   CRALKACT+1                                               03800000
CRALEV18 EQU   CRALKACT+1                                               03801000
CRALEV19 EQU   CRALKACT+1                                               03802000
CRALEV20 EQU   CRALKACT+1                                               03803000
CRALEV21 EQU   CRALKACT+1                                               03804000
CRALEV22 EQU   CRALKACT+1                                               03805000
CRALEV23 EQU   CRALKACT+1                                               03806000
CRALEV24 EQU   CRALKACT+1                                               03807000
CRALEV25 EQU   CRALKACT                                                 03808000
CRALEV26 EQU   CRALKACT                                                 03809000
CRALEV27 EQU   CRALKACT                                                 03810000
CRALEV28 EQU   CRALKACT                                                 03811000
CRALEV29 EQU   CRALKACT                                                 03812000
CRALEV30 EQU   CRALKACT                                                 03813000
CRALEV31 EQU   CRALKACT                                                 03814000
CRALEV32 EQU   CRALKACT                                                 03815000
CRAFRR   EQU   CRAHDR+4                                                 03816000
CRACRR   EQU   CRAHDR                                                   03817000
@NM00143 EQU   ISTAPCRR+144                                             03818000
APCSVRB  EQU   ISTAPCRR+140                                             03819000
@NM00142 EQU   ISTAPCRR+137                                             03820000
@NM00141 EQU   APC57FLG                                                 03821000
APCNREL  EQU   APC57FLG                                                 03822000
APCRECRA EQU   APC57FLG                                                 03823000
@NM00140 EQU   APC54FLG                                                 03824000
APCRLST  EQU   APC54FLG                                                 03825000
APCPR153 EQU   APC53FLG                                                 03826000
@NM00139 EQU   APC52FLG                                                 03827000
APCWKF   EQU   APC52FLG                                                 03828000
APCNWF   EQU   APC52FLG                                                 03829000
APCRDQ   EQU   APC52FLG                                                 03830000
APCQENQ  EQU   APC52FLG                                                 03831000
APCSMSR  EQU   APC52FLG                                                 03832000
APCCKRQ  EQU   APC52FLG                                                 03833000
@NM00138 EQU   APC31FLG                                                 03834000
APCSORT  EQU   APC31FLG                                                 03835000
APCRESCH EQU   APC31FLG                                                 03836000
APCTPXIT EQU   APC31FLG                                                 03837000
APCSWTWD EQU   ISTAPCRR+128                                             03838000
APCSAV2  EQU   ISTAPCRR+124                                             03839000
APCSAV1  EQU   ISTAPCRR+120                                             03840000
APCRETCD EQU   APCCOMF+2                                                03841000
@NM00137 EQU   APCCOMF1+1                                               03842000
APCTSO   EQU   APCCOMF1+1                                               03843000
APCAUTHE EQU   APCCOMF1+1                                               03844000
APCZLBER EQU   APCCOMF1                                                 03845000
APCEXIT  EQU   APCCOMF1                                                 03846000
APCRELR  EQU   APCCOMF1                                                 03847000
APCIRB2  EQU   APCCOMF1                                                 03848000
APCIRB1  EQU   APCCOMF1                                                 03849000
APCSMCR  EQU   APCCOMF1                                                 03850000
APCUETSK EQU   APCCOMF1                                                 03851000
APCSSTSK EQU   APCCOMF1                                                 03852000
APCESTAL EQU   APCSAVE                                                  03853000
APCFRRPM EQU   ISTAPCRR+40                                              03854000
APCQWFO  EQU   ISTAPCRR+36                                              03855000
APCPABSV EQU   ISTAPCRR+32                                              03856000
APCRTRNA EQU   APCRTRN+1                                                03857000
@NM00136 EQU   APCAUT                                                   03858000
APCAUTEX EQU   APCAUT                                                   03859000
APCTCBA  EQU   ISTAPCRR+24                                              03860000
APCPSTA  EQU   ISTAPCRR+20                                              03861000
@NM00135 EQU   APCRFLG+1                                                03862000
APC31R   EQU   APCRFLG                                                  03863000
APC58R   EQU   APCRFLG                                                  03864000
APC57R   EQU   APCRFLG                                                  03865000
APC56R   EQU   APCRFLG                                                  03866000
APC54R   EQU   APCRFLG                                                  03867000
APC53R   EQU   APCRFLG                                                  03868000
APC52R   EQU   APCRFLG                                                  03869000
APC51R   EQU   APCRFLG                                                  03870000
@NM00134 EQU   APCATFLG+1                                               03871000
APC31E   EQU   APCATFLG                                                 03872000
APC58E   EQU   APCATFLG                                                 03873000
APC57E   EQU   APCATFLG                                                 03874000
APC56E   EQU   APCATFLG                                                 03875000
APC54E   EQU   APCATFLG                                                 03876000
APC53E   EQU   APCATFLG                                                 03877000
APC52E   EQU   APCATFLG                                                 03878000
APC51E   EQU   APCATFLG                                                 03879000
APCHDRSV EQU   ISTAPCRR                                                 03880000
ASCPSREG EQU   ISTASCRR+44                                              03881000
ASCUSR01 EQU   ASCUSRGS+12                                              03882000
ASCUSR00 EQU   ASCUSRGS+8                                               03883000
ASCUSR15 EQU   ASCUSRGS+4                                               03884000
ASCUSR14 EQU   ASCUSRGS                                                 03885000
ASCETRYA EQU   ISTASCRR+24                                              03886000
ASCKEY   EQU   ISTASCRR+23                                              03887000
ASCAUDIT EQU   ASCFLG3                                                  03888000
ASCFBDUD EQU   ASCFLG3                                                  03889000
ASCLLKF  EQU   ASCFLG3                                                  03890000
ASCKEYF  EQU   ASCFLG3                                                  03891000
ASCFBDAL EQU   ASCFLG3                                                  03892000
ASCFSRGT EQU   ASCFLG3                                                  03893000
ASCICR   EQU   ASCFLG2                                                  03894000
ASCFSRIC EQU   ASCFLG2                                                  03895000
ASCFBDIC EQU   ASCFLG2                                                  03896000
ASCFBAIC EQU   ASCFLG2                                                  03897000
ASCPASTR EQU   ASCFLG1                                                  03898000
ASCFSR   EQU   ASCFLG1                                                  03899000
ASCFBD   EQU   ASCFLG1                                                  03900000
ASCFBA   EQU   ASCFLG1                                                  03901000
ASCPFCRR EQU   ISTASCRR                                                 03902000
CRRRVPT5 EQU   CRRSAREA+316                                             03903000
CRRRVPT4 EQU   CRRSAREA+312                                             03904000
CRRRVPT3 EQU   CRRSAREA+308                                             03905000
CRRRVPT2 EQU   CRRSAREA+304                                             03906000
CRRRVPT1 EQU   CRRSAREA+300                                             03907000
CRRRVCR2 EQU   CRRSAREA+296                                             03908000
CRRCID   EQU   CRRSAREA+292                                             03909000
CRRRVCR1 EQU   CRRSAREA+291                                             03910000
CRRXFNCD EQU   CRRSAREA+290                                             03911000
CRRLDOCT EQU   CRRSAREA+288                                             03912000
CRRBTLEN EQU   CRRSAREA+284                                             03913000
CRRBLEN  EQU   CRRSAREA+282                                             03914000
CRRBRTCD EQU   CRRSAREA+281                                             03915000
@NM00133 EQU   CRRBFLGS                                                 03916000
CRRBFLG1 EQU   CRRBFLGS                                                 03917000
CRRBLDAD EQU   CRRSAREA+276                                             03918000
CRRBARAD EQU   CRRSAREA+272                                             03919000
CRRRTN12 EQU   CRRSAREA+268                                             03920000
CRRRTN11 EQU   CRRSAREA+264                                             03921000
CRRRTN10 EQU   CRRSAREA+260                                             03922000
CRRRTN9  EQU   CRRSAREA+256                                             03923000
CRRRTN8  EQU   CRRSAREA+252                                             03924000
CRRRTN7  EQU   CRRSAREA+248                                             03925000
CRRRTN6  EQU   CRRSAREA+244                                             03926000
CRRRTN5  EQU   CRRSAREA+240                                             03927000
CRRRTN4  EQU   CRRSAREA+236                                             03928000
CRRRTN3  EQU   CRRSAREA+232                                             03929000
CRRRTN2  EQU   CRRSAREA+228                                             03930000
CRRRTN1  EQU   CRRSAREA+224                                             03931000
CRRRES1  EQU   CRRSAREA+222                                             03932000
CRRLCNT  EQU   CRRSAREA+220                                             03933000
CRRATCVT EQU   CRRSAREA+216                                             03934000
CRRVALCK EQU   CRRSAREA+212                                             03935000
CRRARPL  EQU   CRRTRBUF+4                                               03936000
CRRBIND  EQU   CRRTRBUF+3                                               03937000
CRRTRRES EQU   CRRTRBUF                                                 03938000
CRRCLDO  EQU   CRRSAREA+200                                             03939000
CRRUECB  EQU   CRRSAREA+196                                             03940000
CRRLCPB  EQU   CRRSAREA+192                                             03941000
CRRCMDAD EQU   CRRSAREA+188                                             03942000
CRRFMCB  EQU   CRRSAREA+184                                             03943000
CRRCLCCW EQU   CRRSAREA+180                                             03944000
CRRESR2  EQU   CRRESR+1                                                 03945000
CRRESR1  EQU   CRRESR                                                   03946000
CRRDSB2  EQU   CRRDSB+1                                                 03947000
CRRDSB1  EQU   CRRDSB                                                   03948000
CRRDTACT EQU   CRRSAREA+174                                             03949000
CRRRSV99 EQU   CRRSAREA+173                                             03950000
CRRRDSOH EQU   CRRFDB3                                                  03951000
CRRRLG   EQU   CRRFDB3                                                  03952000
CRRLGFRC EQU   CRRFDB3                                                  03953000
CRRRDEOT EQU   CRRFDB3                                                  03954000
CRRRDEOM EQU   CRRFDB3                                                  03955000
CRRRDEOB EQU   CRRFDB3                                                  03956000
CRRUNUSD EQU   CRRFDB3                                                  03957000
CRRUINPT EQU   CRRFDB3                                                  03958000
CRRSTSAV EQU   CRRFDB2                                                  03959000
CRRCUERR EQU   CRRFDB2                                                  03960000
CRRDLGFL EQU   CRRFDB2                                                  03961000
CRRIOERR EQU   CRRFDB2                                                  03962000
CRRDVUNS EQU   CRRFDB2                                                  03963000
CRRATND  EQU   CRRFDB2                                                  03964000
CRRRVID  EQU   CRRFDB2                                                  03965000
CRRERLK  EQU   CRRFDB2                                                  03966000
CRRRTNCD EQU   CRRFDBK1                                                 03967000
CRRNSNA  EQU   CRRRTYPE                                                 03968000
CRRDFSYN EQU   CRRRTYPE                                                 03969000
CRRRESP  EQU   CRRRTYPE                                                 03970000
CRRDFASY EQU   CRRRTYPE                                                 03971000
CRRDBLCK EQU   CRRRFLG1                                                 03972000
CRRRPSBD EQU   CRRRFLG1                                                 03973000
CRRRPLOQ EQU   CRRRFLG1                                                 03974000
CRRRPLS  EQU   CRRRFLG1                                                 03975000
CRRSW7   EQU   CRRFLGS                                                  03976000
CRRSW6   EQU   CRRFLGS                                                  03977000
CRRSW5   EQU   CRRFLGS                                                  03978000
CRRSW4   EQU   CRRFLGS                                                  03979000
CRRSW3   EQU   CRRFLGS                                                  03980000
CRRSW2   EQU   CRRFLGS                                                  03981000
CRRSW1   EQU   CRRFLGS                                                  03982000
CRRSW0   EQU   CRRFLGS                                                  03983000
CRRRSV04 EQU   CRRFLGS4                                                 03984000
CRRFMCLK EQU   CRRFLGS4                                                 03985000
CRRDLCCW EQU   CRRFLGS3                                                 03986000
CRRRESET EQU   CRRFLGS3                                                 03987000
CRRSUBBK EQU   CRRFLGS3                                                 03988000
CRRRSV08 EQU   CRRFLGS3                                                 03989000
CRRDEBQ  EQU   CRRFLGS3                                                 03990000
CRRSTSPR EQU   CRRFLGS3                                                 03991000
CRRDREQ  EQU   CRRFLGS3                                                 03992000
CRRDFDBK EQU   CRRFLGS3                                                 03993000
CRRDFSB  EQU   CRRFLGS2                                                 03994000
CRRDPROC EQU   CRRFLGS2                                                 03995000
CRREXTS  EQU   CRRFLGS2                                                 03996000
CRRELSRI EQU   CRRFLGS2                                                 03997000
CRRPOST  EQU   CRRFLGS2                                                 03998000
CRRENDLW EQU   CRRFLGS2                                                 03999000
CRRPRGIP EQU   CRRFLGS2                                                 04000000
CRRDEXP  EQU   CRRFLGS2                                                 04001000
CRRSOLRQ EQU   CRRFLGS1                                                 04002000
CRRREQP  EQU   CRRFLGS1                                                 04003000
CRRCPROC EQU   CRRFLGS1                                                 04004000
CRRFINI  EQU   CRRFLGS1                                                 04005000
CRRPREIO EQU   CRRFLGS1                                                 04006000
CRRINIO  EQU   CRRFLGS1                                                 04007000
CRRFLDOS EQU   CRRFLGS1                                                 04008000
CRRDOCUR EQU   CRRFLGS1                                                 04009000
CRRRATS4 EQU   CRRATS+7                                                 04010000
CRRASC31 EQU   CRRSATS                                                  04011000
CRRASC11 EQU   CRRSATS                                                  04012000
CRRASC51 EQU   CRRSATS                                                  04013000
CRRASC40 EQU   CRRSATS                                                  04014000
CRRASC30 EQU   CRRSATS                                                  04015000
CRRASC21 EQU   CRRSATS                                                  04016000
CRRASC10 EQU   CRRSATS                                                  04017000
CRRASC01 EQU   CRRSATS                                                  04018000
CRRSCBND EQU   CRRRATS2                                                 04019000
CRRPLIC  EQU   CRRRATS2                                                 04020000
CRRRC81  EQU   CRRRATS2                                                 04021000
CRRRC80  EQU   CRRRATS2                                                 04022000
CRRRC65  EQU   CRRRATS2                                                 04023000
CRRRC63  EQU   CRRRATS2                                                 04024000
CRRRC55  EQU   CRRRATS2                                                 04025000
CRRRC54  EQU   CRRRATS2                                                 04026000
CRRRC53  EQU   CRRRATS1                                                 04027000
CRRRC52  EQU   CRRRATS1                                                 04028000
CRRRC51  EQU   CRRRATS1                                                 04029000
CRRRC30  EQU   CRRRATS1                                                 04030000
CRRRC26  EQU   CRRRATS1                                                 04031000
CRRRC23  EQU   CRRRATS1                                                 04032000
CRRRC22  EQU   CRRRATS1                                                 04033000
CRRRC21  EQU   CRRRATS1                                                 04034000
@NM00132 EQU   CRRATS4                                                  04035000
CRRC3X   EQU   CRRATS4                                                  04036000
CRRC85   EQU   CRRATS4                                                  04037000
CRRC83   EQU   CRRATS4                                                  04038000
CRRC82   EQU   CRRATS4                                                  04039000
CRRC61   EQU   CRRATS4                                                  04040000
CRRC60   EQU   CRRATS4                                                  04041000
CRRC81   EQU   CRRATS3                                                  04042000
CRRC80   EQU   CRRATS3                                                  04043000
CRRC75   EQU   CRRATS3                                                  04044000
CRRC51   EQU   CRRATS3                                                  04045000
CRRC50   EQU   CRRATS3                                                  04046000
CRRC42   EQU   CRRATS3                                                  04047000
CRRC41   EQU   CRRATS3                                                  04048000
CRRC40   EQU   CRRATS3                                                  04049000
CRRC32   EQU   CRRATS2                                                  04050000
CRRC31   EQU   CRRATS2                                                  04051000
CRRC30   EQU   CRRATS2                                                  04052000
CRRC25   EQU   CRRATS2                                                  04053000
CRRC24   EQU   CRRATS2                                                  04054000
CRRC23   EQU   CRRATS2                                                  04055000
CRRC22   EQU   CRRATS2                                                  04056000
CRRC21   EQU   CRRATS2                                                  04057000
CRRC20   EQU   CRRATS1                                                  04058000
CRRC13   EQU   CRRATS1                                                  04059000
CRRC12   EQU   CRRATS1                                                  04060000
CRRC11   EQU   CRRATS1                                                  04061000
CRRC10   EQU   CRRATS1                                                  04062000
CRRC02   EQU   CRRATS1                                                  04063000
CRRC01   EQU   CRRATS1                                                  04064000
CRRC00   EQU   CRRATS1                                                  04065000
CRRRMAS4 EQU   CRRMAS+7                                                 04066000
CRRMSC31 EQU   CRRSMAS                                                  04067000
CRRMSC11 EQU   CRRSMAS                                                  04068000
CRRMSC51 EQU   CRRSMAS                                                  04069000
CRRMSC40 EQU   CRRSMAS                                                  04070000
CRRMSC30 EQU   CRRSMAS                                                  04071000
CRRMSC21 EQU   CRRSMAS                                                  04072000
CRRMSC10 EQU   CRRSMAS                                                  04073000
CRRMSC01 EQU   CRRSMAS                                                  04074000
@NM00131 EQU   CRRRMAS2                                                 04075000
CRRRM81  EQU   CRRRMAS2                                                 04076000
CRRRM80  EQU   CRRRMAS2                                                 04077000
CRRRM65  EQU   CRRRMAS2                                                 04078000
CRRRM63  EQU   CRRRMAS2                                                 04079000
CRRRM55  EQU   CRRRMAS2                                                 04080000
CRRRM54  EQU   CRRRMAS2                                                 04081000
CRRRM53  EQU   CRRRMAS1                                                 04082000
CRRRM52  EQU   CRRRMAS1                                                 04083000
CRRRM51  EQU   CRRRMAS1                                                 04084000
CRRRM30  EQU   CRRRMAS1                                                 04085000
CRRRM26  EQU   CRRRMAS1                                                 04086000
CRRRM23  EQU   CRRRMAS1                                                 04087000
CRRRM22  EQU   CRRRMAS1                                                 04088000
CRRRM21  EQU   CRRRMAS1                                                 04089000
@NM00130 EQU   CRRMAS4                                                  04090000
CRRM3X   EQU   CRRMAS4                                                  04091000
CRRM85   EQU   CRRMAS4                                                  04092000
CRRM83   EQU   CRRMAS4                                                  04093000
CRRM82   EQU   CRRMAS4                                                  04094000
CRRM61   EQU   CRRMAS4                                                  04095000
CRRM60   EQU   CRRMAS4                                                  04096000
CRRM81   EQU   CRRMAS3                                                  04097000
CRRM80   EQU   CRRMAS3                                                  04098000
CRRM75   EQU   CRRMAS3                                                  04099000
CRRM51   EQU   CRRMAS3                                                  04100000
CRRM50   EQU   CRRMAS3                                                  04101000
CRRM42   EQU   CRRMAS3                                                  04102000
CRRM41   EQU   CRRMAS3                                                  04103000
CRRM40   EQU   CRRMAS3                                                  04104000
CRRM32   EQU   CRRMAS2                                                  04105000
CRRM31   EQU   CRRMAS2                                                  04106000
CRRM30   EQU   CRRMAS2                                                  04107000
CRRM25   EQU   CRRMAS2                                                  04108000
CRRM24   EQU   CRRMAS2                                                  04109000
CRRM23   EQU   CRRMAS2                                                  04110000
CRRM22   EQU   CRRMAS2                                                  04111000
CRRM21   EQU   CRRMAS2                                                  04112000
CRRM20   EQU   CRRMAS1                                                  04113000
CRRM13   EQU   CRRMAS1                                                  04114000
CRRM12   EQU   CRRMAS1                                                  04115000
CRRM11   EQU   CRRMAS1                                                  04116000
CRRM10   EQU   CRRMAS1                                                  04117000
CRRM02   EQU   CRRMAS1                                                  04118000
CRRM01   EQU   CRRMAS1                                                  04119000
CRRM00   EQU   CRRMAS1                                                  04120000
CRRFSB   EQU   CRRSAREA+144                                             04121000
CRRSAVE1 EQU   CRRSAREA+72                                              04122000
CRRSAVE  EQU   CRRSAREA                                                 04123000
CRRRSV22 EQU   ISTDCCRR+4                                               04124000
CRRCRR   EQU   ISTDCCRR                                                 04125000
CCFRSVD1 EQU   CFCCRT                                                   04126000
CCFCR2   EQU   CFCCRT                                                   04127000
CCFCRP   EQU   CFCCRT                                                   04128000
CCFCR1   EQU   CFCCRT                                                   04129000
CCFCS2   EQU   CFCCRT                                                   04130000
CCFCS1   EQU   CFCCRT                                                   04131000
NCFRSVD  EQU   CFCNTRD                                                  04132000
NCFCR2   EQU   CFCNTRD                                                  04133000
NCFCRP   EQU   CFCNTRD                                                  04134000
NCFCR1   EQU   CFCNTRD                                                  04135000
NCFCS2   EQU   CFCNTRD                                                  04136000
NCFCS1   EQU   CFCNTRD                                                  04137000
PFCRSV01 EQU   ISTPFCRR+13                                              04138000
PFCFTA   EQU   ISTPFCRR+12                                              04139000
CRRFRR   EQU   PFCFRRO                                                  04140000
CRRCHAIN EQU   PFCCRRO                                                  04141000
CRRLEN   EQU   PFCCRRLN                                                 04142000
PFCRSV10 EQU   PFCCRR+1                                                 04143000
CRRID    EQU   PFCCRRID                                                 04144000
PSTDRDYQ EQU   PSTDMPS+1                                                04145000
@NM00129 EQU   PSTDMPS                                                  04146000
PSTDGATE EQU   PSTDMPS                                                  04147000
PSTDEBP  EQU   ISTPST+128                                               04148000
PSTSAVE  EQU   ISTPST+96                                                04149000
PSTCRR1  EQU   ISTPST+56                                                04150000
PSTRSV08 EQU   PSTFLGA+1                                                04151000
PSTPEND  EQU   PSTFLGA+1                                                04152000
PSTDMPC  EQU   PSTFLGA+1                                                04153000
PSTABEND EQU   PSTABINP                                                 04154000
PSTSMCU  EQU   PSTFLGA                                                  04155000
PSTSMQR  EQU   PSTFLGA                                                  04156000
PSTIRBU2 EQU   PSTFLGA                                                  04157000
PSTIRBU1 EQU   PSTFLGA                                                  04158000
PSTUERN  EQU   PSTFLGA                                                  04159000
PSTSSRN  EQU   PSTFLGA                                                  04160000
PSTRQUEA EQU   PSTRQUE+1                                                04161000
PSTRSV07 EQU   PSTRQUE                                                  04162000
PSTRSV06 EQU   PSTRQUE                                                  04163000
PSTRSV05 EQU   PSTRQUE                                                  04164000
PSTRSV04 EQU   PSTRQUE                                                  04165000
PSTRSV03 EQU   PSTRQUE                                                  04166000
PSTRSV02 EQU   PSTRQUE                                                  04167000
PSTRSV01 EQU   PSTRQUE                                                  04168000
PSTRQFLG EQU   PSTRQUE                                                  04169000
PSTCHAIN EQU   ISTPST+4                                                 04170000
@NM00128 EQU   ISTPST+2                                                 04171000
MPSSRB1  EQU   ISTMPST+172                                              04172000
MPSMQLBP EQU   ISTMPST+136                                              04173000
MPSQEL   EQU   ISTMPST+128                                              04174000
MPSRPLAC EQU   MPSRPLCT+2                                               04175000
MPSRPLRC EQU   MPSRPLCT                                                 04176000
MPSSRBAC EQU   MPSSRBCT+2                                               04177000
MPSSRBRC EQU   MPSSRBCT                                                 04178000
MPSSRBQ  EQU   MPSSRB                                                   04179000
MPSCRAAC EQU   MPSCRACT+2                                               04180000
MPSCRARC EQU   MPSCRACT                                                 04181000
MPSCRAQ  EQU   MPSCRA                                                   04182000
MPSRMGOC EQU   MPSFLGAB                                                 04183000
MPSPSTAB EQU   MPSFLGAA                                                 04184000
MPSRSV01 EQU   MPSFLGAA                                                 04185000
MPSTPBU  EQU   MPSFLGAA                                                 04186000
MPMEMTRM EQU   MPSFLGAA                                                 04187000
MPSCRAO  EQU   MPSFLGAA                                                 04188000
MPSSRBO  EQU   MPSFLGAA                                                 04189000
MPSRQUEG EQU   MPSRQUE                                                  04190000
MPSTSOIR EQU   MPSRSV07                                                 04191000
MPSTSOIW EQU   MPSRSV07                                                 04192000
MPLRSVD5 EQU   MPLCDS+7                                                 04193000
MPLRSVD4 EQU   MPLFLGS1                                                 04194000
MPLRSVD2 EQU   ISTMPLT+12                                               04195000
MPLRSVD1 EQU   ISTMPLT+10                                               04196000
ATCAOS   EQU   ISTATCVT+1868                                            04197000
@NM00127 EQU   ISTATCVT+1860                                            04198000
@NM00126 EQU   ISTATCVT+1852                                            04199000
@NM00125 EQU   ISTATCVT+1844                                            04200000
@NM00124 EQU   ISTATCVT+1836                                            04201000
@NM00123 EQU   ISTATCVT+1828                                            04202000
@NM00122 EQU   ISTATCVT+1820                                            04203000
ATCHWCSA EQU   ISTATCVT+1816                                            04204000
ATCCACSA EQU   ISTATCVT+1812                                            04205000
ATCMXCSA EQU   ISTATCVT+1808                                            04206000
ATCTPMPB EQU   ISTATCVT+1776                                            04207000
ATCTRMPB EQU   ISTATCVT+1744                                            04208000
ATCRPLAC EQU   ATCRPLCN+2                                               04209000
ATCRPLRC EQU   ATCRPLCN                                                 04210000
ATCCRPLQ EQU   ATCCRPL                                                  04211000
ATCSRBAC EQU   ATCSRBCN+2                                               04212000
ATCSRBRC EQU   ATCSRBCN                                                 04213000
ATCSRBQ  EQU   ATCSRB                                                   04214000
ATCCRAAC EQU   ATCCRACN+2                                               04215000
ATCCRARC EQU   ATCCRACN                                                 04216000
ATCCRAQ  EQU   ATCCRA                                                   04217000
ATCLUFFD EQU   ISTATCVT+1716                                            04218000
ATCVIOPM EQU   ISTATCVT+1712                                            04219000
ATCTPMMI EQU   ISTATCVT+1708                                            04220000
ATCPXSRB EQU   ISTATCVT+1704                                            04221000
ATCRPLCT EQU   ISTATCVT+1702                                            04222000
ATCCRACT EQU   ISTATCVT+1700                                            04223000
ATCSRBCT EQU   ISTATCVT+1698                                            04224000
ATCSTNSM EQU   ISTATCVT+1697                                            04225000
@NM00121 EQU   ATCZFLAG                                                 04226000
ATCZF001 EQU   ATCZFLAG                                                 04227000
ATCTPCP1 EQU   ISTATCVT+1692                                            04228000
ATCTPCP0 EQU   ISTATCVT+1688                                            04229000
ATCZR01  EQU   ISTATCVT+1684                                            04230000
ATCASCB  EQU   ISTATCVT+1676                                            04231000
ATCAP86  EQU   ISTATCVT+1672                                            04232000
ATCAP85  EQU   ISTATCVT+1668                                            04233000
ATCAP83  EQU   ISTATCVT+1660                                            04234000
ATCAP82  EQU   ISTATCVT+1656                                            04235000
ATCAP69  EQU   ISTATCVT+1652                                            04236000
ATCAP66  EQU   ISTATCVT+1648                                            04237000
ATCAP62  EQU   ISTATCVT+1644                                            04238000
ATCAPC59 EQU   ISTATCVT+1640                                            04239000
ATCAP56  EQU   ISTATCVT+1636                                            04240000
ATCAP41  EQU   ISTATCVT+1628                                            04241000
ATCAPC25 EQU   ISTATCVT+1624                                            04242000
ATCAPBE  EQU   ISTATCVT+1616                                            04243000
ATCPSTA  EQU   ISTATCVT+1612                                            04244000
ATCSMABF EQU   ISTATCVT+1608                                            04245000
ATCSMAPR EQU   ISTATCVT+1604                                            04246000
ATCTPWQA EQU   ISTATCVT+1600                                            04247000
ATCSMAID EQU   ISTATCVT+1596                                            04248000
ATCSMARA EQU   ISTATCVT+1592                                            04249000
ATCCACXA EQU   ISTATCVT+1588                                            04250000
ATCATA10 EQU   ISTATCVT+1584                                            04251000
ATCHLTCB EQU   ISTATCVT+1580                                            04252000
@NM00120 EQU   ATCVTFLG                                                 04253000
ATCVTACT EQU   ATCVTFLG                                                 04254000
@NM00119 EQU   @NM00118                                                 04255000
ATCVTMAB EQU   @NM00118                                                 04256000
ATCVTBAM EQU   ISTATCVT+1572                                            04257000
@NM00117 EQU   ISTATCVT+1568                                            04258000
@NM00116 EQU   ISTATCVT+1520                                            04259000
ATCCCOOC EQU   ISTATCVT+1516                                            04260000
@NM00115 EQU   ISTATCVT+1513                                            04261000
ATCSNUF  EQU   ATCENFLG                                                 04262000
ATCOPKL  EQU   ATCENFLG                                                 04263000
ATCSRDN  EQU   ATCENFLG                                                 04264000
ATCDLDN  EQU   ATCENFLG                                                 04265000
ATCTIMER EQU   ISTATCVT+1508                                            04266000
ATCAIWT  EQU   ISTATCVT+1504                                            04267000
ATCOROBT EQU   ISTATCVT+1500                                            04268000
ATCDMAPP EQU   ISTATCVT+1496                                            04269000
ATCZDVTX EQU   ISTATCVT+1492                                            04270000
ATCPXCRA EQU   ISTATCVT+1488                                            04271000
ATCICNCB EQU   ISTATCVT+1484                                            04272000
ATCCMTCB EQU   ISTATCVT+1480                                            04273000
ATCPRPH  EQU   ISTATCVT+1476                                            04274000
ATCGSRBF EQU   ATCGSRBG                                                 04275000
ATCSRBRT EQU   ISTATCVT+1468                                            04276000
ATCTSCPC EQU   ISTATCVT+1464                                            04277000
@NM00114 EQU   ISTATCVT+1460                                            04278000
ATCCDTCB EQU   ISTATCVT+1456                                            04279000
ATCORFRL EQU   ISTATCVT+1452                                            04280000
ATCORFPX EQU   ISTATCVT+1448                                            04281000
ATCORFMG EQU   ISTATCVT+1444                                            04282000
ATCSMBQ  EQU   ISTATCVT+1440                                            04283000
ATCINFDD EQU   ISTATCVT+1436                                            04284000
ATCAP67  EQU   ISTATCVT+1432                                            04285000
ATCAP65  EQU   ISTATCVT+1428                                            04286000
ATCAP64  EQU   ISTATCVT+1424                                            04287000
ATCAP63  EQU   ISTATCVT+1420                                            04288000
ATCAP61  EQU   ISTATCVT+1416                                            04289000
ATCAP58  EQU   ISTATCVT+1412                                            04290000
ATCAP57  EQU   ISTATCVT+1408                                            04291000
ATCAP54  EQU   ISTATCVT+1404                                            04292000
ATCAP53  EQU   ISTATCVT+1400                                            04293000
ATCAP52  EQU   ISTATCVT+1396                                            04294000
ATCAP38  EQU   ISTATCVT+1388                                            04295000
ATCAP37  EQU   ISTATCVT+1384                                            04296000
ATCAP34  EQU   ISTATCVT+1380                                            04297000
ATCAP32  EQU   ISTATCVT+1376                                            04298000
ATCAP31  EQU   ISTATCVT+1372                                            04299000
ATCAP12  EQU   ISTATCVT+1368                                            04300000
ATCAP11  EQU   ISTATCVT+1364                                            04301000
ATCDAPDG EQU   ATCDAPVT+20                                              04302000
ATCDXCEA EQU   ATCDAPVT+16                                              04303000
ATCDCEA  EQU   ATCDAPVT+12                                              04304000
ATCDPCIA EQU   ATCDAPVT+8                                               04305000
ATCDSIOA EQU   ATCDAPVT+4                                               04306000
ATCDEOEA EQU   ATCDAPVT                                                 04307000
ATCZAEA  EQU   ATCICAPP+16                                              04308000
ATCZCEA  EQU   ATCICAPP+12                                              04309000
ATCZCPCI EQU   ATCICAPP+8                                               04310000
ATCZSIOA EQU   ATCICAPP+4                                               04311000
ATCCDRPH EQU   ATCICAPP                                                 04312000
ATCORQG  EQU   ATCORSRB                                                 04313000
ATCORTBF EQU   ATCSQAFR                                                 04314000
@NM00113 EQU   ISTATCVT+1308                                            04315000
ATCZLAEA EQU   ATCLDAPP+16                                              04316000
ATCZLCEA EQU   ATCLDAPP+12                                              04317000
ATCZLPCI EQU   ATCLDAPP+8                                               04318000
ATCSMFRR EQU   ATCLDAPP+4                                               04319000
ATCCDTID EQU   ATCLDAPP                                                 04320000
@NM00112 EQU   ISTATCVT+1256                                            04321000
ATCZPAB2 EQU   ISTATCVT+1224                                            04322000
@NM00111 EQU   ISTATCVT+1224                                            04323000
@NM00110 EQU   ISTATCVT+1164                                            04324000
ATCCPCFE EQU   ISTATCVT+1160                                            04325000
@NM00109 EQU   ATCRID+2                                                 04326000
ATCCDRMA EQU   ATCRID                                                   04327000
@NM00108 EQU   ATCSMSDQ+8                                               04328000
@NM00107 EQU   ATCSMSDQ+4                                               04329000
@NM00106 EQU   ATCSMSDQ                                                 04330000
ATCSEQNO EQU   ISTATCVT+1136                                            04331000
ATCSMPMD EQU   ISTATCVT+1132                                            04332000
ATCPAREA EQU   ISTATCVT+1128                                            04333000
ATCCPCSM EQU   ISTATCVT+1124                                            04334000
ATCQLOCK EQU   ISTATCVT+1120                                            04335000
ATCITQLE EQU   ISTATCVT+1116                                            04336000
ATCSQCDS EQU   ISTATCVT+1112                                            04337000
ATCUSSVT EQU   ISTATCVT+1108                                            04338000
ATCNOSQ  EQU   ISTATCVT+1104                                            04339000
ATCINCIP EQU   ATCCPDVT+4                                               04340000
ATCTSCNI EQU   ATCCPDVT                                                 04341000
ATCMGCRT EQU   ISTATCVT+1092                                            04342000
ATCMACRT EQU   ISTATCVT+1088                                            04343000
ATCCSMT  EQU   ISTATCVT+1084                                            04344000
ATCDRUSL EQU   ISTATCVT+1080                                            04345000
ATCDRULL EQU   ISTATCVT+1076                                            04346000
ATCCFCDR EQU   ISTATCVT+1072                                            04347000
@NM00105 EQU   ISTATCVT+1069                                            04348000
ATCMROUT EQU   ISTATCVT+1060                                            04349000
ATCONFIG EQU   ISTATCVT+1052                                            04350000
ATCNODEL EQU   ISTATCVT+1044                                            04351000
@NM00104 EQU   @NM00103+9                                               04352000
ATCLAST  EQU   ATCSHRFG                                                 04353000
ATCSHRTN EQU   @NM00103                                                 04354000
@NM00102 EQU   ISTATCVT+1026                                            04355000
ATCNMCTR EQU   ISTATCVT+1024                                            04356000
ATCPOIA  EQU   ATCRNO+1                                                 04357000
@NM00101 EQU   ATCRNO                                                   04358000
ATCLCLCT EQU   ATCVLCNT+2                                               04359000
ATCRNCNT EQU   ATCVLCNT                                                 04360000
ATCHBSIZ EQU   ATCHPGM+2                                                04361000
ATCHBFNO EQU   ATCHPGM                                                  04362000
@NM00100 EQU   ISTATCVT+1011                                            04363000
ATCXRANG EQU   ISTATCVT+1010                                            04364000
ATCMAXID EQU   ISTATCVT+1009                                            04365000
ATCMSGSP EQU   ISTATCVT+1008                                            04366000
ATCCIDM  EQU   ISTATCVT+1006                                            04367000
ATCACTRM EQU   ISTATCVT+1004                                            04368000
ATCECTLP EQU   ISTATCVT+1000                                            04369000
ATCECNET EQU   ISTATCVT+996                                             04370000
ATCECOPC EQU   ISTATCVT+992                                             04371000
ATCECSES EQU   ISTATCVT+988                                             04372000
ATCECDSP EQU   ISTATCVT+984                                             04373000
ATCECVRY EQU   ISTATCVT+980                                             04374000
ATCECHLT EQU   ISTATCVT+976                                             04375000
ATCECMOD EQU   ISTATCVT+972                                             04376000
ATCVDLOK EQU   ISTATCVT+968                                             04377000
ATCRDTLK EQU   ISTATCVT+964                                             04378000
ATCVOCLK EQU   ISTATCVT+960                                             04379000
ATCITLIM EQU   ISTATCVT+958                                             04380000
ATCTMINV EQU   ISTATCVT+956                                             04381000
ATCHOSTA EQU   ISTATCVT+954                                             04382000
ATCPUNSA EQU   ISTATCVT+952                                             04383000
ATCSAF   EQU   ISTATCVT+950                                             04384000
ATCVTMID EQU   ATCSSCPA                                                 04385000
ATCHCNID EQU   ATCONID+2                                                04386000
ATCSCNID EQU   ATCONID                                                  04387000
@NM00099 EQU   ATCBITAN+3                                               04388000
@NM00098 EQU   ATCBITAN+2                                               04389000
@NM00097 EQU   ATCFLAG2                                                 04390000
@NM00096 EQU   ATCFLAG2                                                 04391000
@NM00095 EQU   ATCFLAG2                                                 04392000
ATCCRYPF EQU   ATCFLAG2                                                 04393000
ATCTUNCL EQU   ATCFLAG2                                                 04394000
ATCTUNRQ EQU   ATCFLAG2                                                 04395000
ATCTUNAC EQU   ATCFLAG2                                                 04396000
ATCCDLRA EQU   ATCFLAG2                                                 04397000
@NM00094 EQU   ATCBITAN                                                 04398000
@NM00093 EQU   ATCSTAT4                                                 04399000
@NM00092 EQU   ATCSTAT4                                                 04400000
@NM00091 EQU   ATCSTAT4                                                 04401000
@NM00090 EQU   ATCSTAT4                                                 04402000
@NM00089 EQU   ATCSTAT4                                                 04403000
ATCPRTAT EQU   ATCSTAT4                                                 04404000
ATCNCSD  EQU   ATCSTAT4                                                 04405000
ATCMTST  EQU   ATCSTAT4                                                 04406000
@NM00088 EQU   ATCPOFLG                                                 04407000
@NM00087 EQU   ATCPOFLG                                                 04408000
@NM00086 EQU   ATCPOFLG                                                 04409000
@NM00085 EQU   ATCPOFLG                                                 04410000
@NM00084 EQU   ATCPOFLG                                                 04411000
@NM00083 EQU   ATCPOFLG                                                 04412000
@NM00082 EQU   ATCPOFLG                                                 04413000
ATCPOUNS EQU   ATCPOFLG                                                 04414000
@NM00081 EQU   ATCSTAT+1                                                04415000
ATCHIP   EQU   ATCSTAT1                                                 04416000
ATCMDHLT EQU   ATCSTAT1                                                 04417000
ATCINHLT EQU   ATCSTAT1                                                 04418000
ATCNETSL EQU   ATCSTAT1                                                 04419000
ATCQKHLT EQU   ATCSTAT1                                                 04420000
ATCSNHLT EQU   ATCSTAT1                                                 04421000
ATCACTIV EQU   ATCSTAT1                                                 04422000
ATCSTART EQU   ATCSTAT1                                                 04423000
ATCNOP00 EQU   ISTATCVT+932                                             04424000
ATCTSBUF EQU   ISTATCVT+928                                             04425000
ATCFEPT  EQU   ISTATCVT+924                                             04426000
ATCFDVT  EQU   ISTATCVT+920                                             04427000
ATCCONFT EQU   ISTATCVT+916                                             04428000
ATCRDTH  EQU   ISTATCVT+912                                             04429000
ATCSIBQ  EQU   ISTATCVT+908                                             04430000
ATCHLTMS EQU   ISTATCVT+904                                             04431000
ATCECPRM EQU   ISTATCVT+900                                             04432000
ATCVPARM EQU   ISTATCVT+896                                             04433000
ATCOCHA  EQU   ISTATCVT+892                                             04434000
ATCDSPLQ EQU   ISTATCVT+888                                             04435000
ATCVARYQ EQU   ISTATCVT+884                                             04436000
ATCHALTQ EQU   ISTATCVT+880                                             04437000
ATCMODQ  EQU   ISTATCVT+876                                             04438000
ATCSRT   EQU   ISTATCVT+872                                             04439000
ATCRDT   EQU   ISTATCVT+868                                             04440000
ATCSDVT  EQU   ISTATCVT+864                                             04441000
ATCDLRPT EQU   ISTATCVT+860                                             04442000
ATCACDA  EQU   ISTATCVT+852                                             04443000
ATCMNT   EQU   ISTATCVT+848                                             04444000
ATCUEP   EQU   ISTATCVT+844                                             04445000
ATCNODDS EQU   ISTATCVT+840                                             04446000
ATCITRT  EQU   ISTATCVT+836                                             04447000
ATCTODVT EQU   ISTATCVT+832                                             04448000
ATCTRCPT EQU   ISTATCVT+828                                             04449000
ATCMODTB EQU   ISTATCVT+824                                             04450000
ATCUSSPT EQU   ISTATCVT+820                                             04451000
ATCTUBUF EQU   ISTATCVT+816                                             04452000
ATCTACB  EQU   ISTATCVT+812                                             04453000
ATCDWA   EQU   ISTATCVT+808                                             04454000
ATCCFCR2 EQU   ATCPODVT                                                 04455000
ATCEPA   EQU   ISTATCVT+800                                             04456000
ATCPULQB EQU   @NM00080+16                                              04457000
ATCMCQAB EQU   @NM00080+12                                              04458000
ATCLUSMQ EQU   @NM00080+8                                               04459000
ATCLUIOQ EQU   @NM00080+4                                               04460000
ATCIOLQB EQU   @NM00080                                                 04461000
ATCTSCAP EQU   ATCANYDT                                                 04462000
ATCTSCCO EQU   ATCLUDVT+4                                               04463000
ATCTSCSR EQU   ATCLUDVT                                                 04464000
ATCVTLOD EQU   ISTATCVT+764                                             04465000
ATCTSCLF EQU   ISTATCVT+760                                             04466000
ATCTSCLE EQU   ISTATCVT+756                                             04467000
ATCTSCLB EQU   ISTATCVT+752                                             04468000
ATCTSCLS EQU   ISTATCVT+748                                             04469000
ATCTSCCF EQU   ISTATCVT+744                                             04470000
ATCTSCFV EQU   ISTATCVT+740                                             04471000
ATCTSCCE EQU   ISTATCVT+736                                             04472000
ATCTSCCB EQU   ISTATCVT+732                                             04473000
ATCTSCWS EQU   ISTATCVT+728                                             04474000
ATCTSCEM EQU   ISTATCVT+724                                             04475000
ATCTSCNS EQU   ISTATCVT+720                                             04476000
ATCTSCER EQU   ISTATCVT+716                                             04477000
ATCTSCPR EQU   ISTATCVT+712                                             04478000
ATCTSCGR EQU   ISTATCVT+708                                             04479000
ATCTSCCI EQU   ISTATCVT+704                                             04480000
ATCTSVT  EQU   ISTATCVT+700                                             04481000
ATCDVLOD EQU   ISTATCVT+696                                             04482000
ATCCDCNR EQU   ISTATCVT+692                                             04483000
ATCCDCNF EQU   ISTATCVT+688                                             04484000
ATCCDCND EQU   ISTATCVT+684                                             04485000
ATCCDCNA EQU   ISTATCVT+680                                             04486000
ATCCDCCP EQU   ISTATCVT+676                                             04487000
ATCCDFDN EQU   ISTATCVT+672                                             04488000
ATCCDFIN EQU   ISTATCVT+668                                             04489000
ATCCDFND EQU   ISTATCVT+664                                             04490000
ATCCDDEL EQU   ISTATCVT+660                                             04491000
ATCCDADD EQU   ISTATCVT+656                                             04492000
ATCTCLIM EQU   ISTATCVT+652                                             04493000
ATCRACTR EQU   ISTATCVT+648                                             04494000
ATCRACTI EQU   ISTATCVT+644                                             04495000
ATCREMOV EQU   ISTATCVT+640                                             04496000
ATCRACIO EQU   ISTATCVT+636                                             04497000
ATCADD   EQU   ISTATCVT+632                                             04498000
ATCPUCRT EQU   ISTATCVT+628                                             04499000
ATCORCPX EQU   ISTATCVT+616                                             04500000
ATCORCAF EQU   ISTATCVT+612                                             04501000
ATCFRSTR EQU   ATCGTSTR                                                 04502000
ATCSTMA  EQU   ISTATCVT+604                                             04503000
ATCSRTAD EQU   ISTATCVT+600                                             04504000
ATCOCRT  EQU   ISTATCVT+596                                             04505000
ATCOCCFS EQU   ISTATCVT+592                                             04506000
ATCOCCFP EQU   ISTATCVT+588                                             04507000
ATCSRTDF EQU   ISTATCVT+584                                             04508000
ATCLUCRT EQU   ISTATCVT+580                                             04509000
ATCINCY5 EQU   ISTATCVT+576                                             04510000
ATCINCW3 EQU   ISTATCVT+572                                             04511000
ATCINCU6 EQU   ISTATCVT+568                                             04512000
ATCINCTQ EQU   ISTATCVT+564                                             04513000
ATCINCS1 EQU   ISTATCVT+560                                             04514000
ATCSRTAB EQU   ISTATCVT+556                                             04515000
ATCINCRD EQU   ISTATCVT+552                                             04516000
ATCINCPH EQU   ISTATCVT+548                                             04517000
ATCINCLQ EQU   ISTATCVT+544                                             04518000
ATCNOCRT EQU   ISTATCVT+540                                             04519000
ATCINCF1 EQU   ISTATCVT+536                                             04520000
ATCINCCI EQU   ISTATCVT+532                                             04521000
ATCINCCO EQU   ISTATCVT+528                                             04522000
ATCBLDLA EQU   ISTATCVT+524                                             04523000
ATCALOAD EQU   ISTATCVT+520                                             04524000
ATCADEL  EQU   ISTATCVT+516                                             04525000
ATCESC02 EQU   ISTATCVT+512                                             04526000
ATCESC01 EQU   ISTATCVT+508                                             04527000
ATCDEC01 EQU   ISTATCVT+504                                             04528000
ATCDEC00 EQU   ISTATCVT+500                                             04529000
ATCCPCRT EQU   ISTATCVT+496                                             04530000
ATCMSGM  EQU   ISTATCVT+492                                             04531000
ATCCPCFR EQU   ISTATCVT+488                                             04532000
ATCCPCGR EQU   ISTATCVT+484                                             04533000
ATCCPCPP EQU   ISTATCVT+480                                             04534000
ATCMSGP  EQU   ISTATCVT+476                                             04535000
ATCCPCNT EQU   ISTATCVT+472                                             04536000
ATCAUTHA EQU   ISTATCVT+468                                             04537000
ATCACCTA EQU   ISTATCVT+464                                             04538000
ATCAP39  EQU   ISTATCVT+460                                             04539000
ATCAP36  EQU   ISTATCVT+456                                             04540000
ATCAP35  EQU   ISTATCVT+452                                             04541000
ATCAP33  EQU   ISTATCVT+448                                             04542000
ATCAPCR5 EQU   ISTATCVT+444                                             04543000
ATCAICPT EQU   ISTATCVT+440                                             04544000
ATCAPI   EQU   ISTATCVT+436                                             04545000
ATCAICTN EQU   ISTATCVT+432                                             04546000
ATCACC01 EQU   ISTATCVT+428                                             04547000
ATCACC00 EQU   ISTATCVT+424                                             04548000
ATCLDECB EQU   ATCLDTIL+12                                              04549000
ATCLDLCK EQU   ATCLDTIL+8                                               04550000
ATCLDLST EQU   ATCLDTIL+4                                               04551000
ATCLDNCS EQU   ATCLDTIL                                                 04552000
ATCNOSPB EQU   ISTATCVT+376                                             04553000
ATCNSPAB EQU   ISTATCVT+344                                             04554000
ATCLUSRT EQU   ISTATCVT+312                                             04555000
ATCPUIOP EQU   ISTATCVT+280                                             04556000
ATCPUPAB EQU   ISTATCVT+248                                             04557000
ATCPXPAB EQU   ISTATCVT+216                                             04558000
ATCPOPAB EQU   ISTATCVT+184                                             04559000
@NM00079 EQU   ATCVDPAB+16                                              04560000
ATCFEPAB EQU   ATCVDPAB                                                 04561000
ATCTCIPB EQU   ISTATCVT+120                                             04562000
ATCCSPAB EQU   ATCSMPAB+16                                              04563000
@NM00078 EQU   ATCSMPAB                                                 04564000
ATCTMRPB EQU   ISTATCVT+56                                              04565000
ATCITPAB EQU   ISTATCVT+24                                              04566000
@NM00077 EQU   ATCITRA1                                                 04567000
ATCITSCP EQU   ATCITRA1                                                 04568000
ATCITMSG EQU   ATCITRA1                                                 04569000
ATCITPIU EQU   ATCITRA1                                                 04570000
ATCITSMS EQU   ATCITRA1                                                 04571000
ATCITPSS EQU   ATCITRA1                                                 04572000
ATCITLCK EQU   ATCITRA1                                                 04573000
ATCITAPI EQU   ATCITRA1                                                 04574000
ATCITCNT EQU   ATCITFLG                                                 04575000
ATCITRPH EQU   ATCITCDS                                                 04576000
ATCITTBL EQU   ATCITFLD+4                                               04577000
ATCITPRM EQU   ATCITFLD                                                 04578000
ATCPTCHA EQU   ATCRPTCH+4                                               04579000
ATCVTLVL EQU   ATCRPTCH                                                 04580000
RPHUPSTA EQU   ISTRPH+104                                               04581000
RPHSAV16 EQU   RPHWORK+60                                               04582000
RPHSAV15 EQU   RPHWORK+56                                               04583000
RPHSAV14 EQU   RPHWORK+52                                               04584000
RPHSAV13 EQU   RPHWORK+48                                               04585000
RPHSAV12 EQU   RPHWORK+44                                               04586000
RPHSAV11 EQU   RPHWORK+40                                               04587000
RPHSAV10 EQU   RPHWORK+36                                               04588000
RPHSAVE9 EQU   RPHWORK+32                                               04589000
RPHSAVE8 EQU   RPHWORK+28                                               04590000
RPHSAVE7 EQU   RPHWORK+24                                               04591000
RPHSAVE6 EQU   RPHWORK+20                                               04592000
RPHSAVE5 EQU   RPHWORK+16                                               04593000
RPHSAVE4 EQU   RPHWORK+12                                               04594000
RPHSAVE3 EQU   RPHWORK+8                                                04595000
RPHSAVE2 EQU   RPHWORK+4                                                04596000
RPHSHALF EQU   RPHSAVE1+2                                               04597000
RPHSBIT8 EQU   RPHSBITS                                                 04598000
RPHSBIT7 EQU   RPHSBITS                                                 04599000
RPHSBIT6 EQU   RPHSBITS                                                 04600000
RPHSBIT5 EQU   RPHSBITS                                                 04601000
RPHSBIT4 EQU   RPHSBITS                                                 04602000
RPHSBIT3 EQU   RPHSBITS                                                 04603000
RPHSBIT2 EQU   RPHSBITS                                                 04604000
RPHSBIT1 EQU   RPHSBITS                                                 04605000
RPHSBYTE EQU   RPHSAVE1                                                 04606000
RPHPABQP EQU   RPHPABQA+1                                               04607000
RPHPABFG EQU   RPHPABQA                                                 04608000
RPHSRP34 EQU   RPHSRPRM+2                                               04609000
RPHSRP12 EQU   RPHSRPRM                                                 04610000
RPHWEGT  EQU   RPHCSPA                                                  04611000
@NM00076 EQU   RPHWPFLG                                                 04612000
RPHPURGE EQU   RPHWPFLG                                                 04613000
RPHPT    EQU   RPHWPFLG                                                 04614000
RPHWT    EQU   RPHWPFLG                                                 04615000
RPHRSKEY EQU   RPHWPFLG                                                 04616000
RPHDVTA  EQU   ISTRPH+12                                                04617000
RPHTIK   EQU   RPHTSKID+3                                               04618000
@NM00075 EQU   RPHTSKID                                                 04619000
RPHRPHAP EQU   RPHRPHA+1                                                04620000
@NM00074 EQU   RPHRPHA                                                  04621000
RPHGATE  EQU   RPHRPHA                                                  04622000
RPHABEND EQU   RPHFLGB                                                  04623000
RPHUWAIT EQU   RPHFLGB                                                  04624000
RPHRLCRA EQU   RPHFLGB                                                  04625000
@NM00073 EQU   RPHFLGB                                                  04626000
RPHPGCMP EQU   RPHFLGB                                                  04627000
RPHFBAPS EQU   RPHFLGB                                                  04628000
RPHBSSP  EQU   RPHFLGB                                                  04629000
RPHLOCK  EQU   RPHFLGB                                                  04630000
RPHFNFLG EQU   RPHFSTLC                                                 04631000
RPHMLTCP EQU   RPHFLAGS                                                 04632000
RPHSMCLR EQU   RPHFLAGS                                                 04633000
RPHSMTYP EQU   RPHFLAGS                                                 04634000
RPHSMQ   EQU   RPHFLAGS                                                 04635000
RPHAPTYP EQU   RPHFLAGS                                                 04636000
RPHSPGIN EQU   RPHFLAGS                                                 04637000
RPHOGIND EQU   RPHFLAGS                                                 04638000
DYPOCRPH EQU   DYPPACMD                                                 04639000
DYPPACTB EQU   DYPCHAIN                                                 04640000
DYPFLGS  EQU   ISTDYPAB+2                                               04641000
@NM00072 EQU   ISTACDEB+120                                             04642000
ACDNIB   EQU   ISTACDEB+116                                             04643000
ACDEAS   EQU   ISTACDEB+112                                             04644000
ACDUNTNM EQU   ISTACDEB+104                                             04645000
@NM00071 EQU   ACDLUFLG+1                                               04646000
ACDAACQ  EQU   ACDLUFLG+1                                               04647000
ACDAPASS EQU   ACDLUFLG+1                                               04648000
ACDCSM   EQU   ACDLUFLG+1                                               04649000
ACDPARS  EQU   ACDLUFLG+1                                               04650000
ACDTSO   EQU   ACDLUFLG+1                                               04651000
ACDSCIP  EQU   ACDLUFLG+1                                               04652000
ACDNSEXT EQU   ACDLUFLG+1                                               04653000
ACDAUTHE EQU   ACDLUFLG                                                 04654000
ACDABEND EQU   ACDLUFLG                                                 04655000
ACDCLOSE EQU   ACDLUFLG                                                 04656000
ACDQUIES EQU   ACDLUFLG                                                 04657000
ACDNSESS EQU   ACDLUFLG                                                 04658000
ACDREADY EQU   ACDLUFLG                                                 04659000
ACDACTIV EQU   ACDLUFLG                                                 04660000
ACDRQID  EQU   ISTACDEB+100                                             04661000
ACDSMCNT EQU   ISTACDEB+96                                              04662000
ACDPACNT EQU   ISTACDEB+92                                              04663000
ACDASCNT EQU   ISTACDEB+88                                              04664000
ACDSMQ   EQU   ISTACDEB+84                                              04665000
ACDSSCNT EQU   ISTACDEB+80                                              04666000
ACDECB   EQU   ISTACDEB+76                                              04667000
ACDLUCBA EQU   ISTACDEB+72                                              04668000
ACDLOCK  EQU   ISTACDEB+68                                              04669000
ACDACB   EQU   ISTACDEB+64                                              04670000
ACDDEB   EQU   ISTACDEB+60                                              04671000
ACDRARQ  EQU   ACDANYQ+4                                                04672000
ACDRAFQ  EQU   ACDANYQ                                                  04673000
ACDSSPAB EQU   ISTACDEB+32                                              04674000
ACDNEPAB EQU   ISTACDEB+16                                              04675000
ACDRDTE  EQU   ISTACDEB+12                                              04676000
ACDCHN   EQU   ISTACDEB+4                                               04677000
ACDSAF   EQU   ISTACDEB+2                                               04678000
ACDLNGTH EQU   ISTACDEB+1                                               04679000
ACDTYPE  EQU   ISTACDEB                                                 04680000
PABNODQ  EQU   PABFLAGS                                                 04681000
PABINHBT EQU   PABFLAGS                                                 04682000
PABERLOK EQU   PABERRLK                                                 04683000
PABDYNAM EQU   PABFLAGS                                                 04684000
PABXTND  EQU   PABFLAGS                                                 04685000
PABPRIOR EQU   PABFLAGS                                                 04686000
PABAPYP  EQU   PABFLAGS                                                 04687000
PABCHNGP EQU   PABCHAIN+1                                               04688000
PABRSV02 EQU   PABCHAIN                                                 04689000
PABDELAY EQU   PABCHAIN                                                 04690000
PABQUED  EQU   PABRUNNG                                                 04691000
PABRESET EQU   PABCHAIN                                                 04692000
PABUNCON EQU   PABCHAIN                                                 04693000
PABCDP   EQU   PABCHAIN                                                 04694000
PABRESCH EQU   PABCHAIN                                                 04695000
PABCHNG  EQU   PABCHAIN                                                 04696000
PABWEQP  EQU   PABWEQA+1                                                04697000
PABRSV01 EQU   PABWEQA                                                  04698000
PABWEQG  EQU   PABWEQA                                                  04699000
LOKXCL   EQU   @NM00068                                                 04700000
LOKPRY   EQU   @NM00068                                                 04701000
@NM00069 EQU   @NM00068                                                 04702000
@NM00067 EQU   LOKCHNG                                                  04703000
LOKCT    EQU   ISTLOK                                                   04704000
ASXBEND  EQU   ASXB+232                                                 04705000
ASXBRV25 EQU   ASXB+228                                                 04706000
ASXBRV24 EQU   ASXB+224                                                 04707000
ASXBPT0E EQU   ASXB+220                                                 04708000
ASXBCRB4 EQU   ASXBCASW+3                                               04709000
ASXBCRB3 EQU   ASXBCASW+2                                               04710000
ASXBCRB2 EQU   ASXBCASW+1                                               04711000
ASXBCR06 EQU   ASXBCRB1                                                 04712000
ASXBCR05 EQU   ASXBCRB1                                                 04713000
ASXBCR04 EQU   ASXBCRB1                                                 04714000
ASXBCR03 EQU   ASXBCRB1                                                 04715000
ASXBCR02 EQU   ASXBCRB1                                                 04716000
ASXBCR01 EQU   ASXBCRB1                                                 04717000
ASXBTFD  EQU   ASXBCRB1                                                 04718000
ASXBPIP  EQU   ASXBCRB1                                                 04719000
ASXBCTDC EQU   ASXB+212                                                 04720000
ASXBTDCB EQU   ASXB+208                                                 04721000
ASXBRV19 EQU   ASXB+204                                                 04722000
ASXBRV18 EQU   ASXB+200                                                 04723000
ASXBRV17 EQU   ASXB+196                                                 04724000
ASXBRV16 EQU   ASXB+192                                                 04725000
ASXBLSRB EQU   ASXBAEQ+20                                               04726000
ASXBFSRB EQU   ASXBAEQ+16                                               04727000
ASXBLRQE EQU   ASXBAEQ+12                                               04728000
ASXBFRQE EQU   ASXBAEQ+8                                                04729000
ASXBLIQE EQU   ASXBAEQ+4                                                04730000
ASXBFIQE EQU   ASXBAEQ                                                  04731000
ASXBETSK EQU   ASXB+164                                                 04732000
ASXBSIRB EQU   ASXB+160                                                 04733000
ASXBPSWD EQU   ASXB+152                                                 04734000
ASXBPRG  EQU   ASXB+136                                                 04735000
ASXBRV26 EQU   ASXB+132                                                 04736000
ASXBOUSB EQU   ASXB+128                                                 04737000
ASXBDDR  EQU   ASXB+124                                                 04738000
ASXBRCTD EQU   ASXB+120                                                 04739000
ASXBRSMD EQU   ASXB+116                                                 04740000
ASXBSPSA EQU   ASXB+112                                                 04741000
ASXBFRWA EQU   ASXB+108                                                 04742000
ASXBFLSA EQU   ASXB+36                                                  04743000
ASXBIHSA EQU   ASXB+32                                                  04744000
ASXBRV15 EQU   ASXB+28                                                  04745000
ASXBRV14 EQU   ASXB+24                                                  04746000
ASXBLWA  EQU   ASXB+20                                                  04747000
ASXBRS00 EQU   ASXB+14                                                  04748000
ASXBTCBS EQU   ASXB+12                                                  04749000
ASXBLTCB EQU   ASXB+8                                                   04750000
ASXBFTCB EQU   ASXB+4                                                   04751000
ASXBASXB EQU   ASXB                                                     04752000
ASXBEGIN EQU   ASXB                                                     04753000
ASCBEND  EQU   ASCB+208                                                 04754000
ASCBSRBT EQU   ASCB+200                                                 04755000
ASCBSWTL EQU   ASCB+196                                                 04756000
ASCBRS14 EQU   ASCB+195                                                 04757000
ASCBSMCT EQU   ASCB+194                                                 04758000
ASCBRS12 EQU   ASCB+192                                                 04759000
ASCBPCTT EQU   ASCB+188                                                 04760000
ASCBVGTT EQU   ASCB+184                                                 04761000
ASCBRV43 EQU   ASCBSRQ4                                                 04762000
ASCBRV42 EQU   ASCBSRQ4                                                 04763000
ASCBRV41 EQU   ASCBSRQ4                                                 04764000
ASCBRV40 EQU   ASCBSRQ4                                                 04765000
ASCBRV39 EQU   ASCBSRQ4                                                 04766000
ASCBRV38 EQU   ASCBSRQ4                                                 04767000
ASCBRV37 EQU   ASCBSRQ4                                                 04768000
ASCBRV36 EQU   ASCBSRQ4                                                 04769000
ASCBRV35 EQU   ASCBSRQ3                                                 04770000
ASCBRV34 EQU   ASCBSRQ3                                                 04771000
ASCBRV33 EQU   ASCBSRQ3                                                 04772000
ASCBRV32 EQU   ASCBSRQ3                                                 04773000
ASCBRV31 EQU   ASCBSRQ3                                                 04774000
ASCBRV30 EQU   ASCBSRQ3                                                 04775000
ASCBRV29 EQU   ASCBSRQ3                                                 04776000
ASCBRV28 EQU   ASCBSRQ3                                                 04777000
ASCBRV27 EQU   ASCBSRQ2                                                 04778000
ASCBRV26 EQU   ASCBSRQ2                                                 04779000
ASCBRV25 EQU   ASCBSRQ2                                                 04780000
ASCBRV24 EQU   ASCBSRQ2                                                 04781000
ASCBRV23 EQU   ASCBSRQ2                                                 04782000
ASCBRV22 EQU   ASCBSRQ2                                                 04783000
ASCBRV21 EQU   ASCBSRQ2                                                 04784000
ASCBRV20 EQU   ASCBSRQ2                                                 04785000
ASCBRV19 EQU   ASCBSRQ1                                                 04786000
ASCBRV18 EQU   ASCBSRQ1                                                 04787000
ASCBRV17 EQU   ASCBSRQ1                                                 04788000
ASCBRV16 EQU   ASCBSRQ1                                                 04789000
ASCBRV15 EQU   ASCBSRQ1                                                 04790000
ASCBRV14 EQU   ASCBSRQ1                                                 04791000
ASCBRV13 EQU   ASCBSRQ1                                                 04792000
ASCBSTA  EQU   ASCBSRQ1                                                 04793000
ASCBJBNS EQU   ASCB+176                                                 04794000
ASCBJBNI EQU   ASCB+172                                                 04795000
ASCBMCC  EQU   ASCB+168                                                 04796000
ASCBRTWA EQU   ASCB+164                                                 04797000
ASCBIQEA EQU   ASCB+160                                                 04798000
ASCBXMPQ EQU   ASCB+156                                                 04799000
ASCBRS01 EQU   ASCB+154                                                 04800000
ASCBFMCT EQU   ASCB+152                                                 04801000
ASCBOUXB EQU   ASCB+148                                                 04802000
ASCBOUCB EQU   ASCB+144                                                 04803000
ASCBMECB EQU   ASCB+140                                                 04804000
ASCBQECB EQU   ASCB+136                                                 04805000
ASCBLSQH EQU   ASCBLKGP+4                                               04806000
ASCBLOCK EQU   ASCBLKGP                                                 04807000
ASCBTCBS EQU   ASCB+124                                                 04808000
ASCBNVSC EQU   ASCB+122                                                 04809000
ASCBVSC  EQU   ASCB+120                                                 04810000
ASCBSRBS EQU   ASCB+118                                                 04811000
ASCBSSRB EQU   ASCB+116                                                 04812000
ASCBRV06 EQU   ASCBFLG2                                                 04813000
ASCBRV05 EQU   ASCBFLG2                                                 04814000
ASCBRV04 EQU   ASCBFLG2                                                 04815000
ASCBSNQS EQU   ASCBFLG2                                                 04816000
ASCBS2S  EQU   ASCBFLG2                                                 04817000
ASCBCEXT EQU   ASCBFLG2                                                 04818000
ASCBPXMT EQU   ASCBFLG2                                                 04819000
ASCBXMPT EQU   ASCBFLG2                                                 04820000
ASCBRF07 EQU   ASCBDSP1                                                 04821000
ASCBRF06 EQU   ASCBDSP1                                                 04822000
ASCBRF05 EQU   ASCBDSP1                                                 04823000
ASCBRF04 EQU   ASCBDSP1                                                 04824000
ASCBRF03 EQU   ASCBDSP1                                                 04825000
ASCBRF02 EQU   ASCBDSP1                                                 04826000
ASCBFAIL EQU   ASCBDSP1                                                 04827000
ASCBNOQ  EQU   ASCBDSP1                                                 04828000
ASCBSWCT EQU   ASCB+112                                                 04829000
ASCBTMCH EQU   ASCB+104                                                 04830000
ASCBNSWP EQU   ASCBFLG1                                                 04831000
ASCBTYP1 EQU   ASCBFLG1                                                 04832000
ASCBSTND EQU   ASCBFLG1                                                 04833000
ASCBABNT EQU   ASCBFLG1                                                 04834000
ASCBTERM EQU   ASCBFLG1                                                 04835000
ASCBS3S  EQU   ASCBFLG1                                                 04836000
ASCBCMSH EQU   ASCBFLG1                                                 04837000
ASCBTOFF EQU   ASCBFLG1                                                 04838000
ASCBRF01 EQU   ASCBRCTF                                                 04839000
ASCBTMLW EQU   ASCBRCTF                                                 04840000
ASCBOUT  EQU   ASCBRCTF                                                 04841000
ASCBWAIT EQU   ASCBRCTF                                                 04842000
ASCBRV08 EQU   ASCBRCTF                                                 04843000
ASCBFQU  EQU   ASCBRCTF                                                 04844000
ASCBFRS  EQU   ASCBRCTF                                                 04845000
ASCBTMNO EQU   ASCBRCTF                                                 04846000
ASCBAFFN EQU   ASCBFW1                                                  04847000
ASCBDUMP EQU   ASCB+96                                                  04848000
ASCBQSVC EQU   ASCB+92                                                  04849000
ASCBUBET EQU   ASCB+88                                                  04850000
ASCBECB  EQU   ASCB+84                                                  04851000
ASCBJSTL EQU   ASCB+80                                                  04852000
ASCBEWST EQU   ASCB+72                                                  04853000
ASCBEJST EQU   ASCB+64                                                  04854000
ASCBTSB  EQU   ASCB+60                                                  04855000
ASCBCSCB EQU   ASCB+56                                                  04856000
ASCBRSM  EQU   ASCB+52                                                  04857000
ASCBLDA  EQU   ASCB+48                                                  04858000
ASCBSTOR EQU   ASCB+44                                                  04859000
ASCBDP   EQU   ASCB+43                                                  04860000
ASCBRV07 EQU   ASCB+42                                                  04861000
ASCBIOSM EQU   ASCB+40                                                  04862000
ASCBSEQN EQU   ASCB+38                                                  04863000
ASCBCPUS EQU   ASCB+32                                                  04864000
ASCBSPL  EQU   ASCB+28                                                  04865000
ASCBIOSP EQU   ASCB+24                                                  04866000
ASCBSYNC EQU   ASCBSUPC+4                                               04867000
ASCBSVRB EQU   ASCBSUPC                                                 04868000
ASCBCMSF EQU   ASCB+12                                                  04869000
ASCBBWDP EQU   ASCB+8                                                   04870000
ASCBFWDP EQU   ASCB+4                                                   04871000
ASCBASCB EQU   ASCB                                                     04872000
ASCBEGIN EQU   ASCB                                                     04873000
CVTLEVL  EQU   CVTRELNO+2                                               04874000
CVTNUMB  EQU   CVTRELNO                                                 04875000
CVTMDL   EQU   CVTFIX+250                                               04876000
@NM00066 EQU   CVTFIX+248                                               04877000
@NM00065 EQU   CVTFIX                                                   04878000
CVTRV482 EQU   CVTXTNT2+128                                             04879000
CVTRV481 EQU   CVTXTNT2+124                                             04880000
CVTRV480 EQU   CVTXTNT2+120                                             04881000
CVTRV479 EQU   CVTXTNT2+118                                             04882000
CVTRV478 EQU   CVTXTNT2+117                                             04883000
CVTRV477 EQU   CVTXTNT2+116                                             04884000
CVTRV476 EQU   CVTXTNT2+115                                             04885000
CVTRV475 EQU   CVTXTNT2+114                                             04886000
CVTRV474 EQU   CVTRV466                                                 04887000
CVTRV473 EQU   CVTRV466                                                 04888000
CVTRV472 EQU   CVTRV466                                                 04889000
CVTRV471 EQU   CVTRV466                                                 04890000
CVTRV470 EQU   CVTRV466                                                 04891000
CVTRV469 EQU   CVTRV466                                                 04892000
CVTRV468 EQU   CVTRV466                                                 04893000
CVTRV467 EQU   CVTRV466                                                 04894000
CVTRV465 EQU   CVTRV457                                                 04895000
CVTRV464 EQU   CVTRV457                                                 04896000
CVTRV463 EQU   CVTRV457                                                 04897000
CVTRV462 EQU   CVTRV457                                                 04898000
CVTRV461 EQU   CVTRV457                                                 04899000
CVTRV460 EQU   CVTRV457                                                 04900000
CVTRV459 EQU   CVTRV457                                                 04901000
CVTRV458 EQU   CVTRV457                                                 04902000
CVTRV456 EQU   CVTXTNT2+108                                             04903000
CVTRV455 EQU   CVTXTNT2+104                                             04904000
CVTRV454 EQU   CVTXTNT2+100                                             04905000
CVTRV453 EQU   CVTXTNT2+96                                              04906000
CVTRV452 EQU   CVTXTNT2+94                                              04907000
CVTRV451 EQU   CVTXTNT2+92                                              04908000
CVTRV450 EQU   CVTXTNT2+90                                              04909000
CVTRV449 EQU   CVTXTNT2+88                                              04910000
CVTRV448 EQU   CVTXTNT2+87                                              04911000
CVTRV447 EQU   CVTXTNT2+86                                              04912000
CVTRV446 EQU   CVTRV438                                                 04913000
CVTRV445 EQU   CVTRV438                                                 04914000
CVTRV444 EQU   CVTRV438                                                 04915000
CVTRV443 EQU   CVTRV438                                                 04916000
CVTRV442 EQU   CVTRV438                                                 04917000
CVTRV441 EQU   CVTRV438                                                 04918000
CVTRV440 EQU   CVTRV438                                                 04919000
CVTRV439 EQU   CVTRV438                                                 04920000
CVTRV437 EQU   CVTRV429                                                 04921000
CVTRV436 EQU   CVTRV429                                                 04922000
CVTRV435 EQU   CVTRV429                                                 04923000
CVTRV434 EQU   CVTRV429                                                 04924000
CVTRV433 EQU   CVTRV429                                                 04925000
CVTRV432 EQU   CVTRV429                                                 04926000
CVTRV431 EQU   CVTRV429                                                 04927000
CVTRV430 EQU   CVTRV429                                                 04928000
CVTRV428 EQU   CVTXTNT2+80                                              04929000
CVTRV427 EQU   CVTXTNT2+76                                              04930000
CVTRV426 EQU   CVTXTNT2+72                                              04931000
CVTRV425 EQU   CVTXTNT2+68                                              04932000
CVTATACT EQU   CVTATCVT                                                 04933000
CVTRV423 EQU   CVTXTNT2+62                                              04934000
CVTRV422 EQU   CVTXTNT2+60                                              04935000
CVTRV421 EQU   CVTXTNT2+58                                              04936000
CVTRV420 EQU   CVTXTNT2+56                                              04937000
CVTRV419 EQU   CVTXTNT2+55                                              04938000
CVTRV418 EQU   CVTXTNT2+54                                              04939000
CVTRV417 EQU   CVTRV409                                                 04940000
CVTRV416 EQU   CVTRV409                                                 04941000
CVTRV415 EQU   CVTRV409                                                 04942000
CVTRV414 EQU   CVTRV409                                                 04943000
CVTRV413 EQU   CVTRV409                                                 04944000
CVTRV412 EQU   CVTRV409                                                 04945000
CVTRV411 EQU   CVTRV409                                                 04946000
CVTRV410 EQU   CVTRV409                                                 04947000
CVTRV408 EQU   CVTRV400                                                 04948000
CVTRV407 EQU   CVTRV400                                                 04949000
CVTRV406 EQU   CVTRV400                                                 04950000
CVTRV405 EQU   CVTRV400                                                 04951000
CVTRV404 EQU   CVTRV400                                                 04952000
CVTRV403 EQU   CVTRV400                                                 04953000
CVTRV402 EQU   CVTRV400                                                 04954000
CVTRV401 EQU   CVTRV400                                                 04955000
CVTICB   EQU   CVTXTNT2+48                                              04956000
CVTSKTA  EQU   CVTXTNT2+44                                              04957000
CVTCCVT  EQU   CVTXTNT2+40                                              04958000
CVTRSV98 EQU   CVTXTNT2+36                                              04959000
CVTRSV97 EQU   CVTXTNT2+34                                              04960000
CVTRSV96 EQU   CVTXTNT2+32                                              04961000
CVTOLTEP EQU   CVTXTNT2+28                                              04962000
CVTQIDA  EQU   CVTQID+1                                                 04963000
CVTRSV95 EQU   CVTQID                                                   04964000
CVTRSV94 EQU   CVTXTNT2+20                                              04965000
CVTRSV93 EQU   CVTXTNT2+16                                              04966000
CVTRSV92 EQU   CVTXTNT2+12                                              04967000
CVTDEBVR EQU   CVTXTNT2+8                                               04968000
CVTRSV91 EQU   CVTXTNT2+6                                               04969000
CVTRSV9H EQU   CVTFLGBT                                                 04970000
CVTRSV9G EQU   CVTFLGBT                                                 04971000
CVTRSV9F EQU   CVTFLGBT                                                 04972000
CVTRSV9E EQU   CVTFLGBT                                                 04973000
CVTRSV9D EQU   CVTFLGBT                                                 04974000
CVTBAH   EQU   CVTFLGBT                                                 04975000
CVTVME   EQU   CVTFLGBT                                                 04976000
CVTNPE   EQU   CVTFLGBT                                                 04977000
CVTNUCLS EQU   CVTXTNT2+4                                               04978000
CVTDSSVA EQU   CVTDSSV+1                                                04979000
CVTRSV89 EQU   CVTDSSV                                                  04980000
CVTRSV88 EQU   CVTXTNT1+8                                               04981000
CVTRSV87 EQU   CVTXTNT1+4                                               04982000
CVTFACHN EQU   CVTXTNT1                                                 04983000
CVTRV488 EQU   CVTMAP+412                                               04984000
CVTRV487 EQU   CVTMAP+408                                               04985000
CVTRV486 EQU   CVTMAP+404                                               04986000
CVTRV485 EQU   CVTMAP+400                                               04987000
CVTACTAP EQU   CVTMAP+396                                               04988000
CVTAUTH  EQU   CVTMAP+392                                               04989000
CVTRV490 EQU   CVTMAP+388                                               04990000
CVTSU    EQU   CVTMAP+384                                               04991000
CVTVOLT1 EQU   CVTVOLM1+1                                               04992000
CVTVOLI1 EQU   CVTVOLF1                                                 04993000
CVTSTOA  EQU   CVTMAP+376                                               04994000
CVTRSV58 EQU   CVTMAP+374                                               04995000
CVTRSV57 EQU   CVTMAP+372                                               04996000
CVTDDCE  EQU   CVTMAP+368                                               04997000
CVTPNWFR EQU   CVTMAP+364                                               04998000
CVTSMF   EQU   CVTMAP+360                                               04999000
CVTSULK  EQU   CVTMAP+358                                               05000000
CVTSLKO  EQU   CVTSYSK                                                  05001000
CVTSLKP  EQU   CVTSYSK                                                  05002000
CVTSLKQ  EQU   CVTSYSK                                                  05003000
CVTSLKR  EQU   CVTSYSK                                                  05004000
CVTRSV56 EQU   CVTSYSK                                                  05005000
CVTRSV55 EQU   CVTSYSK                                                  05006000
CVTRSV54 EQU   CVTSYSK                                                  05007000
CVTRSV53 EQU   CVTSYSK                                                  05008000
CVTRSV52 EQU   CVTA1F1                                                  05009000
CVTRSV51 EQU   CVTA1F1                                                  05010000
CVTRSV50 EQU   CVTA1F1                                                  05011000
CVTRSV49 EQU   CVTA1F1                                                  05012000
CVTRSV48 EQU   CVTA1F1                                                  05013000
CVTRSV47 EQU   CVTA1F1                                                  05014000
CVTSRSW  EQU   CVTA1F1                                                  05015000
CVTPFSW  EQU   CVTA1F1                                                  05016000
CVTPCVT  EQU   CVTMAP+352                                               05017000
CVTRSV46 EQU   CVTMAP+344                                               05018000
CVTRSV45 EQU   CVTMAP+340                                               05019000
CVTRSV44 EQU   CVTMAP+338                                               05020000
CVTRSV43 EQU   CVTMAP+336                                               05021000
CVTHJESA EQU   CVTHJES+1                                                05022000
CVTRSV42 EQU   CVTHJES                                                  05023000
CVTEXT2A EQU   CVTEXT2+1                                                05024000
CVTRSV41 EQU   CVTEXT2                                                  05025000
CVTAPFA  EQU   CVTAPF+1                                                 05026000
CVTRSV40 EQU   CVTAPF                                                   05027000
CVTRV518 EQU   CVTINTLA                                                 05028000
CVTRV517 EQU   CVTERPV                                                  05029000
CVTEORM  EQU   CVTMAP+312                                               05030000
CVTMCHPR EQU   CVTMAP+308                                               05031000
CVTTZ    EQU   CVTMAP+304                                               05032000
CVTJEPS  EQU   CVTMAP+300                                               05033000
CVTJESCT EQU   CVTMAP+296                                               05034000
CVTMODE  EQU   CVTMAP+292                                               05035000
CVTPTRV  EQU   CVTMAP+288                                               05036000
CVTREAL  EQU   CVTMAP+284                                               05037000
CVTRSV39 EQU   CVTMAP+280                                               05038000
CVTRSV38 EQU   CVTMAP+276                                               05039000
CVTDMSRA EQU   CVTDMSR+1                                                05040000
CVTRV634 EQU   CVTDMSRF                                                 05041000
CVTRV633 EQU   CVTDMSRF                                                 05042000
CVTRV632 EQU   CVTDMSRF                                                 05043000
CVTRV631 EQU   CVTDMSRF                                                 05044000
CVTRV630 EQU   CVTDMSRF                                                 05045000
CVTRV629 EQU   CVTDMSRF                                                 05046000
CVTUDUMP EQU   CVTDMSRF                                                 05047000
CVTSDUMP EQU   CVTDMSRF                                                 05048000
CVTQMSGA EQU   CVTQMSG+1                                                05049000
CVTRSV36 EQU   CVTQMSG                                                  05050000
CVTAMFF  EQU   CVTMAP+264                                               05051000
CVTPURGA EQU   CVTPURG+1                                                05052000
CVTRSV35 EQU   CVTPURG                                                  05053000
CVTCBSP  EQU   CVTMAP+256                                               05054000
CVTATERA EQU   CVTATER+1                                                05055000
CVTSYST  EQU   CVTATER                                                  05056000
CVTVOLT2 EQU   CVTTAT                                                   05057000
CVTVOLI2 EQU   CVTVOLF2                                                 05058000
CVTAQAVB EQU   CVTAQAVT+1                                               05059000
CVTRSV34 EQU   CVTTCMFG                                                 05060000
CVTRSV33 EQU   CVTTCMFG                                                 05061000
CVTRSV32 EQU   CVTTCMFG                                                 05062000
CVTRSV31 EQU   CVTTCMFG                                                 05063000
CVTRSV30 EQU   CVTTCMFG                                                 05064000
CVTRSV29 EQU   CVTTCMFG                                                 05065000
CVTLDEV  EQU   CVTTCMFG                                                 05066000
CVTTCRDY EQU   CVTTCMFG                                                 05067000
CVTGTFA  EQU   CVTGTF+1                                                 05068000
CVTRSV27 EQU   CVTGTFST                                                 05069000
CVTRNIO  EQU   CVTGTFST                                                 05070000
CVTUSR   EQU   CVTGTFST                                                 05071000
CVTRV318 EQU   CVTFORM                                                  05072000
CVTRV317 EQU   CVTTMODE                                                 05073000
CVTRV316 EQU   CVTSTATE                                                 05074000
CVTRV315 EQU   CVTGTFS                                                  05075000
CVTGTFAV EQU   CVTGTFS                                                  05076000
CVT0SCR1 EQU   CVTMAP+232                                               05077000
CVTRV515 EQU   CVTMAP+228                                               05078000
CVTRMS   EQU   CVTMAP+224                                               05079000
CVTPATCH EQU   CVTMAP+220                                               05080000
CVTTSCE  EQU   CVTMAP+216                                               05081000
CVTLNKSC EQU   CVTMAP+214                                               05082000
CVTQABST EQU   CVTMAP+212                                               05083000
CVTMDLDS EQU   CVTMAP+208                                               05084000
CVTUSER  EQU   CVTMAP+204                                               05085000
CVTABEND EQU   CVTMAP+200                                               05086000
CVTSMCA  EQU   CVTMAP+196                                               05087000
CVTRSV18 EQU   CVTMAP+192                                               05088000
CVTQLPAQ EQU   CVTMAP+188                                               05089000
CVTQCDSR EQU   CVTMAP+184                                               05090000
CVTVS1B  EQU   CVTOPTB                                                  05091000
CVTVS1A  EQU   CVTOPTB                                                  05092000
CVTFP    EQU   CVTOPTB                                                  05093000
CVTAPTHR EQU   CVTOPTB                                                  05094000
CVTNLOG  EQU   CVTOPTB                                                  05095000
CVTTOD   EQU   CVTOPTB                                                  05096000
CVTCTIMS EQU   CVTOPTB                                                  05097000
CVTPROT  EQU   CVTOPTB                                                  05098000
CVTXPFP  EQU   CVTOPTA                                                  05099000
CVTASCII EQU   CVTOPTA                                                  05100000
CVTRSV13 EQU   CVTOPTA                                                  05101000
CVTRSV12 EQU   CVTOPTA                                                  05102000
CVTNIP   EQU   CVTOPTA                                                  05103000
CVTDDR   EQU   CVTOPTA                                                  05104000
CVTAPR   EQU   CVTOPTA                                                  05105000
CVTCCH   EQU   CVTOPTA                                                  05106000
CVTSNCTR EQU   CVTMAP+180                                               05107000
CVTQMWR  EQU   CVTMAP+176                                               05108000
CVTQOCR  EQU   CVTMAP+172                                               05109000
CVT1EF00 EQU   CVTMAP+168                                               05110000
CVTMZ00  EQU   CVTMAP+164                                               05111000
CVTHEAD  EQU   CVTMAP+160                                               05112000
CVTRSV11 EQU   CVTMAP+156                                               05113000
CVT0PT01 EQU   CVTMAP+152                                               05114000
CVTMSER  EQU   CVTMAP+148                                               05115000
CVTRV516 EQU   CVTIERLC                                                 05116000
CVTILCH  EQU   CVTMAP+140                                               05117000
CVT0DS   EQU   CVTMAP+136                                               05118000
CVTFBOSV EQU   CVTMAP+132                                               05119000
CVTNUCB  EQU   CVTMAP+128                                               05120000
CVTIXAVL EQU   CVTMAP+124                                               05121000
CVTIOQET EQU   CVTMAP+120                                               05122000
CVTDCBA  EQU   CVTMAP+117                                               05123000
CVTMVS2  EQU   CVTDCB                                                   05124000
CVT6DAT  EQU   CVTDCB                                                   05125000
CVT4MPS  EQU   CVTDCB                                                   05126000
CVTRSV09 EQU   CVTDCB                                                   05127000
CVT4MS1  EQU   CVTDCB                                                   05128000
CVT2SPS  EQU   CVTDCB                                                   05129000
CVT1SSS  EQU   CVTDCB                                                   05130000
CVTRSV08 EQU   CVTDCB                                                   05131000
CVTSTB   EQU   CVTMAP+112                                               05132000
CVTQTD00 EQU   CVTMAP+108                                               05133000
CVTQTE00 EQU   CVTMAP+104                                               05134000
CVTCUCB  EQU   CVTMAP+100                                               05135000
CVTSJQ   EQU   CVTMAP+96                                                05136000
CVTPBLDL EQU   CVTMAP+92                                                05137000
CVTTPC   EQU   CVTMAP+88                                                05138000
CVTSVDCB EQU   CVTMAP+84                                                05139000
CVTBRET  EQU   CVTMAP+82                                                05140000
CVTEXIT  EQU   CVTMAP+80                                                05141000
CVT0FN00 EQU   CVTMAP+76                                                05142000
CVTDARA  EQU   CVTDAR+1                                                 05143000
CVTRSV07 EQU   CVTFLGS1                                                 05144000
CVTRSV06 EQU   CVTFLGS1                                                 05145000
CVTRSV05 EQU   CVTFLGS1                                                 05146000
CVTRSV04 EQU   CVTFLGS1                                                 05147000
CVTRSV03 EQU   CVTFLGS1                                                 05148000
CVTRSV02 EQU   CVTFLGS1                                                 05149000
CVTRSV01 EQU   CVTFLGS1                                                 05150000
CVTDMPLK EQU   CVTFLGS1                                                 05151000
CVTXITP  EQU   CVTMAP+68                                                05152000
CVTZDTAB EQU   CVTMAP+64                                                05153000
CVTMSLT  EQU   CVTMAP+60                                                05154000
CVTDATE  EQU   CVTMAP+56                                                05155000
CVTBTERM EQU   CVTMAP+52                                                05156000
CVTSYSAD EQU   CVTMAP+48                                                05157000
CVTXTLER EQU   CVTMAP+44                                                05158000
CVTILK2  EQU   CVTMAP+40                                                05159000
CVTILK1  EQU   CVTMAP+36                                                05160000
CVTPRLTV EQU   CVTMAP+32                                                05161000
CVTPCNVT EQU   CVTMAP+28                                                05162000
CVT0VL00 EQU   CVTMAP+24                                                05163000
CVTXAPG  EQU   CVTMAP+20                                                05164000
CVTBUF   EQU   CVTMAP+16                                                05165000
CVTJOB   EQU   CVTMAP+12                                                05166000
CVTLINK  EQU   CVTMAP+8                                                 05167000
CVT0EF00 EQU   CVTMAP+4                                                 05168000
@NM00064 EQU   TCBXTNT2+32                                              05169000
TCBRV181 EQU   TCBRV173                                                 05170000
TCBRV180 EQU   TCBRV173                                                 05171000
TCBRV179 EQU   TCBRV173                                                 05172000
TCBRV178 EQU   TCBRV173                                                 05173000
TCBRV177 EQU   TCBRV173                                                 05174000
TCBRV176 EQU   TCBRV173                                                 05175000
TCBRV175 EQU   TCBRV173                                                 05176000
TCBRV174 EQU   TCBRV173                                                 05177000
TCBRV172 EQU   TCBRV164                                                 05178000
TCBRV171 EQU   TCBRV164                                                 05179000
TCBRV170 EQU   TCBRV164                                                 05180000
TCBRV169 EQU   TCBRV164                                                 05181000
TCBRV168 EQU   TCBRV164                                                 05182000
TCBRV167 EQU   TCBRV164                                                 05183000
TCBRV166 EQU   TCBRV164                                                 05184000
TCBRV165 EQU   TCBRV164                                                 05185000
TCBRV163 EQU   TCBRV155                                                 05186000
TCBRV162 EQU   TCBRV155                                                 05187000
TCBRV161 EQU   TCBRV155                                                 05188000
TCBRV160 EQU   TCBRV155                                                 05189000
TCBRV159 EQU   TCBRV155                                                 05190000
TCBRV158 EQU   TCBRV155                                                 05191000
TCBRV157 EQU   TCBRV155                                                 05192000
TCBRV156 EQU   TCBRV155                                                 05193000
TCBRV154 EQU   TCBRV146                                                 05194000
TCBRV153 EQU   TCBRV146                                                 05195000
TCBRV152 EQU   TCBRV146                                                 05196000
TCBRV151 EQU   TCBRV146                                                 05197000
TCBRV150 EQU   TCBRV146                                                 05198000
TCBRV149 EQU   TCBRV146                                                 05199000
TCBRV148 EQU   TCBRV146                                                 05200000
TCBRV147 EQU   TCBRV146                                                 05201000
TCBRV145 EQU   TCBXTNT2+26                                              05202000
TCBRV144 EQU   TCBXTNT2+24                                              05203000
TCBRV143 EQU   TCBXTNT2+20                                              05204000
TCBRV142 EQU   TCBXTNT2+16                                              05205000
TCBRSV49 EQU   TCBXTNT2+12                                              05206000
TCBEVENT EQU   TCBXTNT2+8                                               05207000
TCBRCMP  EQU   TCBXTNT2+5                                               05208000
TCBRSVAB EQU   TCBXTNT2+4                                               05209000
TCBGTFA  EQU   TCBGTF+1                                                 05210000
TCBRSV47 EQU   TCBTFLG                                                  05211000
TCBRSV46 EQU   TCBTFLG                                                  05212000
TCBRSV45 EQU   TCBTFLG                                                  05213000
TCBRSV44 EQU   TCBTFLG                                                  05214000
TCBRSV43 EQU   TCBTFLG                                                  05215000
TCBDSPIT EQU   TCBTFLG                                                  05216000
TCBERRTN EQU   TCBTFLG                                                  05217000
TCBASYNC EQU   TCBTFLG                                                  05218000
@NM00063 EQU   TCB+296                                                  05219000
TCBSVCA2 EQU   TCB+292                                                  05220000
TCBSWASA EQU   TCB+288                                                  05221000
TCBDBTB  EQU   TCB+284                                                  05222000
TCBRPT   EQU   TCB+280                                                  05223000
TCBRV141 EQU   TCBRV133                                                 05224000
TCBRV140 EQU   TCBRV133                                                 05225000
TCBRV139 EQU   TCBRV133                                                 05226000
TCBRV138 EQU   TCBRV133                                                 05227000
TCBRV137 EQU   TCBRV133                                                 05228000
TCBRV136 EQU   TCBRV133                                                 05229000
TCBRV135 EQU   TCBRV133                                                 05230000
TCBRV134 EQU   TCBRV133                                                 05231000
TCBRV132 EQU   TCBRV124                                                 05232000
TCBRV131 EQU   TCBRV124                                                 05233000
TCBRV130 EQU   TCBRV124                                                 05234000
TCBRV129 EQU   TCBRV124                                                 05235000
TCBRV128 EQU   TCBRV124                                                 05236000
TCBRV127 EQU   TCBRV124                                                 05237000
TCBRV126 EQU   TCBRV124                                                 05238000
TCBRV125 EQU   TCBRV124                                                 05239000
TCBRV123 EQU   TCBFBYT2                                                 05240000
TCBRV122 EQU   TCBFBYT2                                                 05241000
TCBECBNV EQU   TCBFBYT2                                                 05242000
TCBSSSYN EQU   TCBFBYT2                                                 05243000
TCBFPRAP EQU   TCBFBYT2                                                 05244000
TCBFDW   EQU   TCBFBYT2                                                 05245000
TCBFMW   EQU   TCBFBYT2                                                 05246000
TCBCNCB  EQU   TCBFBYT2                                                 05247000
TCBLLH   EQU   TCBFBYT1                                                 05248000
TCBRV113 EQU   TCBFBYT1                                                 05249000
TCBEOT   EQU   TCBFBYT1                                                 05250000
TCBRTM2  EQU   TCBFBYT1                                                 05251000
TCBPGNLY EQU   TCBFBYT1                                                 05252000
TCBNDIOS EQU   TCBFBYT1                                                 05253000
TCBACTIV EQU   TCBFBYT1                                                 05254000
TCBEOTFM EQU   TCBFBYT1                                                 05255000
TCBAFFN  EQU   TCB+274                                                  05256000
TCBCCPVI EQU   TCB+272                                                  05257000
TCBUKYSP EQU   TCB+268                                                  05258000
TCBMODE  EQU   TCBESTAE+3                                               05259000
TCBERTYP EQU   TCBESTAE+2                                               05260000
TCBRV314 EQU   TCBESTRM                                                 05261000
TCBRV313 EQU   TCBESTRM                                                 05262000
TCBRV312 EQU   TCBESTRM                                                 05263000
TCBRV311 EQU   TCBESTRM                                                 05264000
TCBRV310 EQU   TCBESTRM                                                 05265000
TCBRV309 EQU   TCBESTRM                                                 05266000
TCBRV308 EQU   TCBESTRM                                                 05267000
TCBETERM EQU   TCBESTRM                                                 05268000
TCBSCBKY EQU   TCBESTAE                                                 05269000
TCBRTM12 EQU   TCB+260                                                  05270000
TCBTCBID EQU   TCB+256                                                  05271000
TCBRSV96 EQU   TCB+252                                                  05272000
TCBSWA   EQU   TCB+248                                                  05273000
TCBFOEA  EQU   TCBFOE+1                                                 05274000
TCBRSV42 EQU   TCBFOE                                                   05275000
TCBRV306 EQU   TCB+240                                                  05276000
TCBRSV41 EQU   TCB+239                                                  05277000
TCBTID   EQU   TCB+238                                                  05278000
TCBRSVAA EQU   TCB+237                                                  05279000
TCBABCUR EQU   TCB+236                                                  05280000
TCBTMSAV EQU   TCB+232                                                  05281000
TCBIOTIM EQU   TCB+228                                                  05282000
TCBRTWA  EQU   TCB+224                                                  05283000
TCBBACK  EQU   TCB+220                                                  05284000
TCBTIRB  EQU   TCB+216                                                  05285000
TCBAECB  EQU   TCB+212                                                  05286000
TCBEXT2A EQU   TCBEXT2+1                                                05287000
TCBRSV39 EQU   TCBEXT2                                                  05288000
TCBSTMCT EQU   TCB+207                                                  05289000
TCBSYSCT EQU   TCB+206                                                  05290000
TCBRSV37 EQU   TCB+205                                                  05291000
TCBEXSVC EQU   TCBDAR                                                   05292000
TCBDARMS EQU   TCBDAR                                                   05293000
TCBDARWT EQU   TCBDAR                                                   05294000
TCBDARO  EQU   TCBDAR                                                   05295000
TCBDARMC EQU   TCBDARC                                                  05296000
TCBDARD  EQU   TCBDAR                                                   05297000
TCBDARS  EQU   TCBDAR                                                   05298000
TCBDARP  EQU   TCBDAR                                                   05299000
TCBGTOFM EQU   TCBFLGS7                                                 05300000
TCBADMP  EQU   TCBFLGS7                                                 05301000
TCBRSTSK EQU   TCBFLGS7                                                 05302000
TCBSVCS  EQU   TCBFLGS7                                                 05303000
TCBSTACK EQU   TCBFLGS7                                                 05304000
TCBRSV34 EQU   TCBFLGS7                                                 05305000
TCBRSV33 EQU   TCBFLGS7                                                 05306000
TCBGPECB EQU   TCBFLGS7                                                 05307000
TCBNTJS  EQU   TCBFLGS6                                                 05308000
TCBAPG   EQU   TCBFLGS6                                                 05309000
TCBMIGR  EQU   TCBFLGS6                                                 05310000
TCBRV303 EQU   TCBFLGS6                                                 05311000
TCBSPVLK EQU   TCBFLGS6                                                 05312000
TCBCPU   EQU   TCBFLGS6                                                 05313000
TCBPIE17 EQU   TCBFLGS6                                                 05314000
TCBRV    EQU   TCBFLGS6                                                 05315000
TCBRSV79 EQU   TCBNDSP5                                                 05316000
TCBRSV78 EQU   TCBNDSP5                                                 05317000
TCBRSV77 EQU   TCBNDSP5                                                 05318000
TCBRSV76 EQU   TCBNDSP5                                                 05319000
TCBRSV75 EQU   TCBNDSP5                                                 05320000
TCBRSV74 EQU   TCBNDSP5                                                 05321000
TCBRSV95 EQU   TCBNDSP5                                                 05322000
TCBRSV94 EQU   TCBNDSP5                                                 05323000
TCBRSV93 EQU   TCBNDSP4                                                 05324000
TCBRSV92 EQU   TCBNDSP4                                                 05325000
TCBRSV91 EQU   TCBNDSP4                                                 05326000
TCBRSV90 EQU   TCBNDSP4                                                 05327000
TCBRSV89 EQU   TCBNDSP4                                                 05328000
TCBRSV88 EQU   TCBNDSP4                                                 05329000
TCBRSV87 EQU   TCBNDSP4                                                 05330000
TCBRSV86 EQU   TCBNDSP4                                                 05331000
TCBEXT1A EQU   TCBEXT1+1                                                05332000
TCBRSV32 EQU   TCBEXT1                                                  05333000
TCBEXCPD EQU   TCB+192                                                  05334000
TCBIOBRC EQU   TCB+188                                                  05335000
TCBDDWTC EQU   TCB+186                                                  05336000
TCBDDEXC EQU   TCB+184                                                  05337000
TCBJSCBB EQU   TCBJSCB+1                                                05338000
@NM00062 EQU   TCBRECDE                                                 05339000
TCBREC   EQU   TCBRECDE                                                 05340000
TCBMDIDS EQU   TCB+176                                                  05341000
TCBNDINT EQU   TCBNDSP3                                                 05342000
TCBRSV27 EQU   TCBNDSP3                                                 05343000
TCBRSV26 EQU   TCBNDSP3                                                 05344000
TCBRSV25 EQU   TCBNDSP3                                                 05345000
TCBRSV24 EQU   TCBNDSP3                                                 05346000
TCBSRBND EQU   TCBNDSP3                                                 05347000
TCBRV302 EQU   TCBNDSP3                                                 05348000
TCBLJSND EQU   TCBNDSP3                                                 05349000
TCBABE   EQU   TCBNDSP2                                                 05350000
TCBDSS   EQU   TCBNDSP2                                                 05351000
TCBOWAIT EQU   TCBNDSP2                                                 05352000
TCBIWAIT EQU   TCBNDSP2                                                 05353000
TCBNDTS  EQU   TCBNDSP2                                                 05354000
TCBNDSVC EQU   TCBNDSP2                                                 05355000
TCBSTPP  EQU   TCBNDSP2                                                 05356000
TCBABD   EQU   TCBNDSP2                                                 05357000
TCBRSV22 EQU   TCBNDSP1                                                 05358000
TCBPIEND EQU   TCBNDSP1                                                 05359000
TCBTPSP  EQU   TCBNDSP1                                                 05360000
TCBDDRND EQU   TCBNDSP1                                                 05361000
TCBRSPND EQU   TCBNDSP1                                                 05362000
TCBRSTND EQU   TCBNDSP1                                                 05363000
TCBDARPN EQU   TCBNDSP1                                                 05364000
TCBDARTN EQU   TCBNDSP1                                                 05365000
TCBNDSP0 EQU   TCBNDSP                                                  05366000
TCBUSER  EQU   TCB+168                                                  05367000
TCBTCTB  EQU   TCBTCT+1                                                 05368000
TCBRSV9C EQU   TCBTCTGF                                                 05369000
TCBRSV9B EQU   TCBTCTGF                                                 05370000
TCBRSV9A EQU   TCBTCTGF                                                 05371000
TCBRSV99 EQU   TCBTCTGF                                                 05372000
TCBRSV98 EQU   TCBTCTGF                                                 05373000
TCBRSV97 EQU   TCBTCTGF                                                 05374000
TCBRSV20 EQU   TCBTCTGF                                                 05375000
TCBSMFGF EQU   TCBTCTGF                                                 05376000
TCBSTABB EQU   TCBSTAB+1                                                05377000
TCBSTCUR EQU   TCBNSTAE                                                 05378000
TCBRV301 EQU   TCBNSTAE                                                 05379000
TCBSYNCH EQU   TCBNSTAE                                                 05380000
TCBHALT  EQU   TCBNSTAE                                                 05381000
TCBPPSUP EQU   TCBNSTAE                                                 05382000
TCB33E   EQU   TCBNSTAE                                                 05383000
TCBQUIES EQU   TCBNSTAE                                                 05384000
TCBSTABE EQU   TCBNSTAE                                                 05385000
TCBAQE   EQU   TCB+156                                                  05386000
TCBPQE   EQU   TCB+152                                                  05387000
TCBTSDP  EQU   TCB+151                                                  05388000
TCBTSLP  EQU   TCB+150                                                  05389000
TCBSTPCT EQU   TCB+149                                                  05390000
TCBCPUBN EQU   TCBTSFLG                                                 05391000
TCBDYDSP EQU   TCBTSFLG                                                 05392000
TCBRSV18 EQU   TCBTSFLG                                                 05393000
TCBRSV17 EQU   TCBTSFLG                                                 05394000
TCBTIOTG EQU   TCBTSFLG                                                 05395000
TCBATT   EQU   TCBTSFLG                                                 05396000
TCBSTPPR EQU   TCBTSFLG                                                 05397000
TCBRV300 EQU   TCBTSTSK                                                 05398000
TCBECB   EQU   TCB+144                                                  05399000
TCBIQE   EQU   TCB+140                                                  05400000
TCBLTC   EQU   TCB+136                                                  05401000
TCBOTC   EQU   TCB+132                                                  05402000
TCBNTC   EQU   TCB+128                                                  05403000
TCBJSTCA EQU   TCBJSTCB+1                                               05404000
TCBRSV16 EQU   TCBJSTCB                                                 05405000
TCBTQET  EQU   TCBTME                                                   05406000
TCBTCB   EQU   TCB+116                                                  05407000
TCBFSAB  EQU   TCBFSA+1                                                 05408000
TCBQEL   EQU   TCBFSA                                                   05409000
TCBGRS15 EQU   TCBGRS+60                                                05410000
TCBGRS14 EQU   TCBGRS+56                                                05411000
TCBGRS13 EQU   TCBGRS+52                                                05412000
TCBGRS12 EQU   TCBGRS+48                                                05413000
TCBGRS11 EQU   TCBGRS+44                                                05414000
TCBGRS10 EQU   TCBGRS+40                                                05415000
TCBGRS9  EQU   TCBGRS+36                                                05416000
TCBGRS8  EQU   TCBGRS+32                                                05417000
TCBGRS7  EQU   TCBGRS+28                                                05418000
TCBGRS6  EQU   TCBGRS+24                                                05419000
TCBGRS5  EQU   TCBGRS+20                                                05420000
TCBGRS4  EQU   TCBGRS+16                                                05421000
TCBGRS3  EQU   TCBGRS+12                                                05422000
TCBGRS2  EQU   TCBGRS+8                                                 05423000
TCBGRS1  EQU   TCBGRS+4                                                 05424000
TCBGRS0  EQU   TCBGRS                                                   05425000
TCBJPQB  EQU   TCBJPQ+1                                                 05426000
TCBRSV15 EQU   TCBPURGE                                                 05427000
TCBRSV14 EQU   TCBPURGE                                                 05428000
TCBRSV13 EQU   TCBPURGE                                                 05429000
TCBRSV12 EQU   TCBPURGE                                                 05430000
TCBRSV11 EQU   TCBPURGE                                                 05431000
TCBRSV10 EQU   TCBPURGE                                                 05432000
TCBRSV09 EQU   TCBPURGE                                                 05433000
TCBJPQF  EQU   TCBPURGE                                                 05434000
TCBJLB   EQU   TCB+40                                                   05435000
TCBLLS   EQU   TCB+36                                                   05436000
TCBDSP   EQU   TCB+35                                                   05437000
TCBLMP   EQU   TCB+34                                                   05438000
TCBPNDSP EQU   TCBFLGS5                                                 05439000
TCBFCD1  EQU   TCBFLGS5                                                 05440000
TCBSTP   EQU   TCBFLGS5                                                 05441000
TCBSYS   EQU   TCBFLGS5                                                 05442000
TCBANDSP EQU   TCBFLGS5                                                 05443000
TCBPAGE  EQU   TCBFLGS5                                                 05444000
TCBUXNDF EQU   TCBABWF                                                  05445000
TCBFC    EQU   TCBFLGS5                                                 05446000
TCBONDSP EQU   TCBFLGS4                                                 05447000
TCBMPCND EQU   TCBFLGS4                                                 05448000
TCBMPCVQ EQU   TCBFLGS4                                                 05449000
TCBUXNDV EQU   TCBFLGS4                                                 05450000
TCBHNDSP EQU   TCBFLGS4                                                 05451000
TCBRQENA EQU   TCBFLGS4                                                 05452000
TCBSER   EQU   TCBFLGS4                                                 05453000
TCBNDUMP EQU   TCBFLGS4                                                 05454000
TCBDWSTA EQU   TCBFLGS3                                                 05455000
TCBRSV08 EQU   TCBFLGS3                                                 05456000
TCBRSV07 EQU   TCBFLGS3                                                 05457000
TCBRSV06 EQU   TCBFLGS3                                                 05458000
TCBABGM  EQU   TCBFLGS3                                                 05459000
TCBABTRM EQU   TCBFLGS3                                                 05460000
TCBADINP EQU   TCBFLGS3                                                 05461000
TCBFSM   EQU   TCBFLGS3                                                 05462000
TCBFTS   EQU   TCBFLGS2                                                 05463000
TCBFETXR EQU   TCBFLGS2                                                 05464000
TCBFDSOP EQU   TCBFLGS2                                                 05465000
TCBFJMC  EQU   TCBFLGS2                                                 05466000
TCBFSMC  EQU   TCBFLGS2                                                 05467000
TCBFABOP EQU   TCBFLGS2                                                 05468000
TCBFSTI  EQU   TCBFLGS2                                                 05469000
TCBFOINP EQU   TCBFLGS2                                                 05470000
TCBFX    EQU   TCBFLGS1                                                 05471000
TCBFS    EQU   TCBFLGS1                                                 05472000
TCBFT    EQU   TCBFLGS1                                                 05473000
TCBPDUMP EQU   TCBFLGS1                                                 05474000
TCBNONPR EQU   TCBFLGS1                                                 05475000
TCBFERA  EQU   TCBFLGS1                                                 05476000
TCBFE    EQU   TCBFLGS1                                                 05477000
TCBFA    EQU   TCBFLGS1                                                 05478000
TCBZERO  EQU   TCBPKF                                                   05479000
TCBFLAG  EQU   TCBPKF                                                   05480000
TCBMSSB  EQU   TCBMSS+1                                                 05481000
TCBRSV03 EQU   TCBMSS                                                   05482000
TCBTRNB  EQU   TCBTRN+1                                                 05483000
TCBRSV02 EQU   TCBABF                                                   05484000
TCBOLTEP EQU   TCBABF                                                   05485000
TCBTCP   EQU   TCBABF                                                   05486000
TCBTCPP  EQU   TCBABF                                                   05487000
TCBRSV01 EQU   TCBABF                                                   05488000
TCBGRPH  EQU   TCBABF                                                   05489000
TCBNOCHK EQU   TCBABF                                                   05490000
TCBMOD91 EQU   TCBABF                                                   05491000
TCBCMPC  EQU   TCBCMP+1                                                 05492000
TCBRV318 EQU   TCBCMSG                                                  05493000
TCBRV317 EQU   TCBCIND                                                  05494000
TCBRV316 EQU   TCBCWTO                                                  05495000
TCBCASID EQU   TCBCDBL                                                  05496000
TCBNOCC  EQU   TCBSTCC                                                  05497000
TCBDMPO  EQU   TCBCPP                                                   05498000
TCBCSTEP EQU   TCBCMPF                                                  05499000
TCBCREQ  EQU   TCBCMPF                                                  05500000
TCBTIO   EQU   TCB+12                                                   05501000
TCBDEB   EQU   TCB+8                                                    05502000
TCBPIEA  EQU   TCBPIE+1                                                 05503000
TCBPM    EQU   TCBPMASK                                                 05504000
@NM00061 EQU   TCBPMASK                                                 05505000
TCBRBP   EQU   TCB                                                      05506000
TCBFRS6  EQU   TCBFRS+24                                                05507000
TCBFRS4  EQU   TCBFRS+16                                                05508000
TCBFRS2  EQU   TCBFRS+8                                                 05509000
TCBFRS0  EQU   TCBFRS                                                   05510000
@NM00060 EQU   SRBSECT+40                                               05511000
@NM00059 EQU   SRBSECT+38                                               05512000
SRBPRIOR EQU   SRBSECT+37                                               05513000
SRBPKF   EQU   SRBSECT+36                                               05514000
SRBSAVE  EQU   SRBSECT+32                                               05515000
SRBPTCB  EQU   SRBFLC+4                                                 05516000
SRBCPAFF EQU   SRBFLC                                                   05517000
SRBFLNK  EQU   SRBSECT+4                                                05518000
SVRBEND  EQU   RBSECT+192                                               05519000
RBFEPARM EQU   RBSECT+168                                               05520000
SIRBEND  EQU   RBSECT+168                                               05521000
RBRSV158 EQU   RBRSV150                                                 05522000
RBRSV157 EQU   RBRSV150                                                 05523000
RBRSV156 EQU   RBRSV150                                                 05524000
RBRSV155 EQU   RBRSV150                                                 05525000
RBRSV154 EQU   RBRSV150                                                 05526000
RBRSV153 EQU   RBRSV150                                                 05527000
RBRSV152 EQU   RBRSV150                                                 05528000
RBRSV151 EQU   RBRSV150                                                 05529000
RBRSV149 EQU   RBSECT+166                                               05530000
RBRSV148 EQU   RBSECT+164                                               05531000
RBRSV169 EQU   RBSDATA+3                                                05532000
RBSID    EQU   RBSDATA+2                                                05533000
RBSPKEY  EQU   RBSDATA+1                                                05534000
RBRSV168 EQU   RBSFLG3                                                  05535000
RBSTERMO EQU   RBSFLG3                                                  05536000
RBSBRNTR EQU   RBSFLG3                                                  05537000
RBSPRNTR EQU   RBSFLG3                                                  05538000
RBSCNCEL EQU   RBSFLG3                                                  05539000
RBSRECRD EQU   RBSFLG3                                                  05540000
RBSTERMI EQU   RBSFLG3                                                  05541000
RBRSV167 EQU   RBSFLG3                                                  05542000
RBSOWNRA EQU   RBSOWNR+1                                                05543000
RBSSUPER EQU   RBSFLGS2                                                 05544000
RBSKEY0  EQU   RBSFLGS2                                                 05545000
RBRSV166 EQU   RBSFLGS2                                                 05546000
RBRSV165 EQU   RBSFLGS2                                                 05547000
RBSINUSE EQU   RBSFLGS2                                                 05548000
RBRSV164 EQU   RBSFLGS2                                                 05549000
RBSXCTL2 EQU   RBSFLGS2                                                 05550000
RBRSV163 EQU   RBSFLGS2                                                 05551000
RBSPARMA EQU   RBSPARM+1                                                05552000
RBSHALT  EQU   RBSIOPRC                                                 05553000
RBSNOIOP EQU   RBSIOPRC                                                 05554000
RBSASYNC EQU   RBSFLGS1                                                 05555000
RBRSV162 EQU   RBSFLGS1                                                 05556000
RBSESTAE EQU   RBSFLGS1                                                 05557000
RBSDUMMY EQU   RBSFLGS1                                                 05558000
RBSSTAR  EQU   RBSFLGS1                                                 05559000
RBSSTAI  EQU   RBSFLGS1                                                 05560000
RBSEXIT  EQU   RBSCBB+4                                                 05561000
RBSCHAIN EQU   RBSCBB                                                   05562000
TIRBEND  EQU   @NM00057+8                                               05563000
PRBEND   EQU   @NM00057+8                                               05564000
RBRSV146 EQU   RBRSV138                                                 05565000
RBRSV145 EQU   RBRSV138                                                 05566000
RBRSV144 EQU   RBRSV138                                                 05567000
RBRSV143 EQU   RBRSV138                                                 05568000
RBRSV142 EQU   RBRSV138                                                 05569000
RBRSV141 EQU   RBRSV138                                                 05570000
RBRSV140 EQU   RBRSV138                                                 05571000
RBRSV139 EQU   RBRSV138                                                 05572000
RBRSV137 EQU   @NM00057+6                                               05573000
RBRSV136 EQU   @NM00057+4                                               05574000
RBRSV135 EQU   @NM00057                                                 05575000
@NM00056 EQU   RBSECT+32                                                05576000
@NM00055 EQU   @NM00053+1                                               05577000
RBSCF    EQU   @NM00054                                                 05578000
RBPGMQ1  EQU   RBPGMQ+1                                                 05579000
@NM00052 EQU   RBPGMQ                                                   05580000
@NM00051 EQU   RBSECT+16                                                05581000
@NM00050 EQU   @NM00046                                                 05582000
@NM00049 EQU   @NM00046                                                 05583000
RBIQETP  EQU   @NM00046                                                 05584000
RBUSIQE  EQU   RBETXR                                                   05585000
RBATTN   EQU   @NM00046                                                 05586000
@NM00048 EQU   @NM00046                                                 05587000
@NM00047 EQU   @NM00046                                                 05588000
RBPMSVRB EQU   @NM00044                                                 05589000
RBATNXIT EQU   @NM00044                                                 05590000
@NM00045 EQU   @NM00044                                                 05591000
RBWAITP  EQU   @NM00044                                                 05592000
RBFNSVRB EQU   RBTRSVRB                                                 05593000
RBFTP    EQU   @NM00044                                                 05594000
RBSIZE   EQU   RBSECT+8                                                 05595000
RBABOPSW EQU   RBSECT+4                                                 05596000
RBPPSAV1 EQU   RBPPSAV+1                                                05597000
@NM00042 EQU   RBPPSAV                                                  05598000
RBPRFXND EQU   RBPREFIX+64                                              05599000
RBINTCOD EQU   RBINTCDA+1                                               05600000
RBINLNTH EQU   RBINTCDA                                                 05601000
RBWCSA   EQU   RBPREFIX+60                                              05602000
RBRSV004 EQU   RBPREFIX+57                                              05603000
RBSSSYN  EQU   RBFLAGS1                                                 05604000
RBSCB    EQU   RBFLAGS1                                                 05605000
RBLONGWT EQU   RBFLAGS1                                                 05606000
RBASIR   EQU   RBFLAGS1                                                 05607000
RBRSV159 EQU   RBFLAGS1                                                 05608000
RBABEND  EQU   RBFLAGS1                                                 05609000
RBXWAIT  EQU   RBFLAGS1                                                 05610000
RBSLOCK  EQU   RBFLAGS1                                                 05611000
RBRTRAN  EQU   RBRTPSW2+4                                               05612000
RBRTINCD EQU   RBRTICIL+2                                               05613000
RBRTILC  EQU   RBRTICIL+1                                               05614000
RBRSV160 EQU   RBRTICIL                                                 05615000
RBRTPSW1 EQU   RBRTOPSW                                                 05616000
RBRSV062 EQU   RBRSV054                                                 05617000
RBRSV061 EQU   RBRSV054                                                 05618000
RBRSV060 EQU   RBRSV054                                                 05619000
RBRSV059 EQU   RBRSV054                                                 05620000
RBRSV058 EQU   RBRSV054                                                 05621000
RBRSV057 EQU   RBRSV054                                                 05622000
RBRSV056 EQU   RBRSV054                                                 05623000
RBRSV055 EQU   RBRSV054                                                 05624000
RBRSV053 EQU   RBPREFIX+38                                              05625000
RBRSV052 EQU   RBPREFIX+36                                              05626000
RBRSV051 EQU   RBPREFIX+32                                              05627000
RBPRFXST EQU   RBPREFIX+32                                              05628000
RBRSV050 EQU   RBPREFIX+28                                              05629000
RBRSV049 EQU   RBRSV041                                                 05630000
RBRSV048 EQU   RBRSV041                                                 05631000
RBRSV047 EQU   RBRSV041                                                 05632000
RBRSV046 EQU   RBRSV041                                                 05633000
RBRSV045 EQU   RBRSV041                                                 05634000
RBRSV044 EQU   RBRSV041                                                 05635000
RBRSV043 EQU   RBRSV041                                                 05636000
RBRSV042 EQU   RBRSV041                                                 05637000
RBRSV040 EQU   RBPREFIX+26                                              05638000
RBRSV039 EQU   RBPREFIX+24                                              05639000
RBRSV038 EQU   RBPREFIX+20                                              05640000
RBRSV037 EQU   RBPREFIX+16                                              05641000
RBRSV036 EQU   RBRSV028                                                 05642000
RBRSV035 EQU   RBRSV028                                                 05643000
RBRSV034 EQU   RBRSV028                                                 05644000
RBRSV033 EQU   RBRSV028                                                 05645000
RBRSV032 EQU   RBRSV028                                                 05646000
RBRSV031 EQU   RBRSV028                                                 05647000
RBRSV030 EQU   RBRSV028                                                 05648000
RBRSV029 EQU   RBRSV028                                                 05649000
RBRSV027 EQU   RBRSV019                                                 05650000
RBRSV026 EQU   RBRSV019                                                 05651000
RBRSV025 EQU   RBRSV019                                                 05652000
RBRSV024 EQU   RBRSV019                                                 05653000
RBRSV023 EQU   RBRSV019                                                 05654000
RBRSV022 EQU   RBRSV019                                                 05655000
RBRSV021 EQU   RBRSV019                                                 05656000
RBRSV020 EQU   RBRSV019                                                 05657000
RBRSV018 EQU   RBPREFIX+13                                              05658000
RBRSV017 EQU   RBPREFIX+12                                              05659000
RBSRV016 EQU   RBPREFIX+11                                              05660000
RBRSV015 EQU   RBPREFIX+10                                              05661000
RBRSV014 EQU   RBPREFIX+8                                               05662000
RBRSV013 EQU   RBPREFIX+4                                               05663000
RBRSV012 EQU   RBPREFIX                                                 05664000
RBEXSAVE EQU   XRBESA                                                   05665000
XRBREG15 EQU   RBGRS15                                                  05666000
XRBREG14 EQU   RBGRS14                                                  05667000
XRBREG13 EQU   RBGRS13                                                  05668000
XRBREG12 EQU   RBGRS12                                                  05669000
XRBREG11 EQU   RBGRS11                                                  05670000
XRBREG10 EQU   RBGRS10                                                  05671000
XRBREG9  EQU   RBGRS9                                                   05672000
XRBREG8  EQU   RBGRS8                                                   05673000
XRBREG7  EQU   RBGRS7                                                   05674000
XRBREG6  EQU   RBGRS6                                                   05675000
XRBREG5  EQU   RBGRS5                                                   05676000
XRBREG4  EQU   RBGRS4                                                   05677000
XRBREG3  EQU   RBGRS3                                                   05678000
XRBREG2  EQU   RBGRS2                                                   05679000
XRBREG1  EQU   RBGRS1                                                   05680000
XRBREG0  EQU   RBGRS0                                                   05681000
XRBLNKA  EQU   RBLINKB                                                  05682000
XRBWT    EQU   RBWCF                                                    05683000
@NM00041 EQU   RBBASIC+24                                               05684000
RBOPSWPS EQU   RBOPSWB2                                                 05685000
@NM00040 EQU   RBOPSWB2                                                 05686000
@NM00039 EQU   XRBPSW                                                   05687000
@NM00038 EQU   RBBASIC+12                                               05688000
XRBWAIT  EQU   RBECBWT                                                  05689000
XRBFRRB  EQU   RBFDYN                                                   05690000
@NM00037 EQU   XSTAB2                                                   05691000
XRBACTV  EQU   RBFACTV                                                  05692000
XRBTCBP  EQU   RBTCBNXT                                                 05693000
@NM00036 EQU   XSTAB1                                                   05694000
XRBCKPT  EQU   RBFTCKPT                                                 05695000
@NM00035 EQU   XSTAB1                                                   05696000
@NM00034 EQU   RBBASIC+8                                                05697000
@NM00033 EQU   RBEXRTNM+1                                               05698000
RBTMIND3 EQU   RBTMFLD                                                  05699000
RBTMIND2 EQU   RBTMFLD                                                  05700000
RBTMCMP  EQU   RBTMFLD                                                  05701000
RBWLIM   EQU   RBTMFLD                                                  05702000
RBRSV005 EQU   RBTMFLD                                                  05703000
RBTMTOD  EQU   RBTMFLD                                                  05704000
RBTMQUE  EQU   RBTMFLD                                                  05705000
@NM00032 EQU   RBPRFX                                                   05706000
IQEOUTLM EQU   IQESECT+20                                               05707000
IQEDCB   EQU   IQESECT+16                                               05708000
IQETCBA  EQU   IQETCB+1                                                 05709000
IQESTAT2 EQU   IQETCB                                                   05710000
IQEIRBA  EQU   IQEIRB+1                                                 05711000
@NM00007 EQU   IQEFLAGS                                                 05712000
@NM00006 EQU   IQEFLAGS                                                 05713000
@NM00005 EQU   IQEFLAGS                                                 05714000
@NM00004 EQU   IQEFLAGS                                                 05715000
@NM00003 EQU   IQEFLAGS                                                 05716000
@NM00002 EQU   IQEFLAGS                                                 05717000
@NM00001 EQU   IQEFLAGS                                                 05718000
IQEPURGE EQU   IQEFLAGS                                                 05719000
IQELNKA  EQU   IQELNK+1                                                 05720000
IQESTAT1 EQU   IQELNK                                                   05721000
@NM00031 EQU   PSA+3668                                                 05722000
PSASTAK  EQU   PSA+3072                                                 05723000
@NM00030 EQU   PSA+1048                                                 05724000
PSAUSEND EQU   PSA+1048                                                 05725000
PSARV062 EQU   PSA+1044                                                 05726000
PSACDAL  EQU   PSA+1040                                                 05727000
PSAWTCOD EQU   PSA+1036                                                 05728000
PSAATCVT EQU   PSA+1032                                                 05729000
PSAPCPSW EQU   PSA+1024                                                 05730000
PSAPIR2  EQU   PSA+1020                                                 05731000
PSARV059 EQU   PSA+1018                                                 05732000
PSASVC13 EQU   PSA+1016                                                 05733000
PSALSFCC EQU   PSA+1012                                                 05734000
PSASFACC EQU   PSA+1008                                                 05735000
PSASTOP  EQU   PSA+992                                                  05736000
PSASTART EQU   PSA+976                                                  05737000
PSARSPSW EQU   PSA+968                                                  05738000
PSASRPSW EQU   PSA+960                                                  05739000
PSARV045 EQU   PSA+892                                                  05740000
PSARV044 EQU   PSA+888                                                  05741000
PSARV043 EQU   PSA+884                                                  05742000
PSARV042 EQU   PSA+880                                                  05743000
PSARV041 EQU   PSA+876                                                  05744000
PSARV040 EQU   PSA+872                                                  05745000
PSARV025 EQU   PSA+868                                                  05746000
PSADSSED EQU   PSA+868                                                  05747000
PSADSSPR EQU   PSA+864                                                  05748000
PSADSSFW EQU   PSA+860                                                  05749000
PSADSS14 EQU   PSA+856                                                  05750000
PSADSSPP EQU   PSA+848                                                  05751000
PSADSSRP EQU   PSA+840                                                  05752000
PSADSS05 EQU   PSADSSF4                                                 05753000
PSADSS10 EQU   PSADSSF4                                                 05754000
PSADSSVE EQU   PSADSSF4                                                 05755000
PSADSSDE EQU   PSADSSF4                                                 05756000
PSADSSC0 EQU   PSADSSF4                                                 05757000
PSADSSIE EQU   PSADSSF4                                                 05758000
PSADSS12 EQU   PSADSSF4                                                 05759000
PSADSSRC EQU   PSADSSF4                                                 05760000
PSARV057 EQU   PSADSSF3                                                 05761000
PSARV056 EQU   PSADSSF3                                                 05762000
PSARV055 EQU   PSADSSF3                                                 05763000
PSADSSMC EQU   PSADSSF3                                                 05764000
PSADSSRW EQU   PSADSSF3                                                 05765000
PSADSSNM EQU   PSADSSF3                                                 05766000
PSADSSES EQU   PSADSSF3                                                 05767000
PSADSSGP EQU   PSADSSF3                                                 05768000
PSADSSF2 EQU   PSADSSFL+1                                               05769000
PSADSSPI EQU   PSADSSF1                                                 05770000
PSADSSOI EQU   PSADSSF1                                                 05771000
PSADSSSP EQU   PSADSSF1                                                 05772000
PSADSSTP EQU   PSADSSF1                                                 05773000
PSADSSDW EQU   PSADSSF1                                                 05774000
PSADSSDD EQU   PSADSSF1                                                 05775000
PSADSSDM EQU   PSADSSF1                                                 05776000
PSADSSMV EQU   PSADSSF1                                                 05777000
PSADSSTS EQU   PSA+816                                                  05778000
PSADSSWK EQU   PSA+812                                                  05779000
PSADSSR3 EQU   PSA+808                                                  05780000
PSADSSR2 EQU   PSA+804                                                  05781000
PSADSSRS EQU   PSA+800                                                  05782000
PSASTOR  EQU   PSA+796                                                  05783000
PSACPUSA EQU   PSA+794                                                  05784000
PSAVSTAP EQU   PSA+792                                                  05785000
PSAWKVAP EQU   PSA+788                                                  05786000
PSAWKRAP EQU   PSA+784                                                  05787000
PSAMCHIC EQU   PSA+783                                                  05788000
PSARV061 EQU   PSA+782                                                  05789000
PSASYMSK EQU   PSA+781                                                  05790000
PSAMCHFL EQU   PSA+780                                                  05791000
PSACR0   EQU   PSA+776                                                  05792000
PSAPSWSV EQU   PSA+768                                                  05793000
PSACLHS  EQU   PSAHLHI                                                  05794000
PSALKR15 EQU   PSALKSA+60                                               05795000
PSALKR14 EQU   PSALKSA+56                                               05796000
PSALKR13 EQU   PSALKSA+52                                               05797000
PSALKR12 EQU   PSALKSA+48                                               05798000
PSALKR11 EQU   PSALKSA+44                                               05799000
PSALKR10 EQU   PSALKSA+40                                               05800000
PSALKR9  EQU   PSALKSA+36                                               05801000
PSALKR8  EQU   PSALKSA+32                                               05802000
PSALKR7  EQU   PSALKSA+28                                               05803000
PSALKR6  EQU   PSALKSA+24                                               05804000
PSALKR5  EQU   PSALKSA+20                                               05805000
PSALKR4  EQU   PSALKSA+16                                               05806000
PSALKR3  EQU   PSALKSA+12                                               05807000
PSALKR2  EQU   PSALKSA+8                                                05808000
PSALKR1  EQU   PSALKSA+4                                                05809000
PSALKR0  EQU   PSALKSA                                                  05810000
PSARV023 EQU   PSACLHT+52                                               05811000
PSALOCAL EQU   PSACLHT+48                                               05812000
PSACMSL  EQU   PSACLHT+44                                               05813000
PSAOPTL  EQU   PSACLHT+40                                               05814000
PSATPACL EQU   PSACLHT+36                                               05815000
PSATPDNL EQU   PSACLHT+32                                               05816000
PSATPNCL EQU   PSACLHT+28                                               05817000
PSAIOSLL EQU   PSACLHT+24                                               05818000
PSAIOSUL EQU   PSACLHT+20                                               05819000
PSAIOSCL EQU   PSACLHT+16                                               05820000
PSAIOSSL EQU   PSACLHT+12                                               05821000
PSASALCL EQU   PSACLHT+8                                                05822000
PSAASML  EQU   PSACLHT+4                                                05823000
PSADISPL EQU   PSACLHT                                                  05824000
PSASRSA  EQU   PSA+636                                                  05825000
PSARV050 EQU   PSA+634                                                  05826000
PSADSSGO EQU   PSA+633                                                  05827000
PSARECUR EQU   PSA+632                                                  05828000
PSAHLHIS EQU   PSA+628                                                  05829000
PSAIPCSA EQU   PSA+624                                                  05830000
@NM00029 EQU   PSA+621                                                  05831000
PSAIPCDM EQU   PSA+620                                                  05832000
PSAIPCD  EQU   PSA+616                                                  05833000
@NM00028 EQU   PSA+613                                                  05834000
PSAIPCRM EQU   PSA+612                                                  05835000
PSAIPCR  EQU   PSA+608                                                  05836000
PSAMCHEX EQU   PSA+600                                                  05837000
PSAMPSW  EQU   PSA+592                                                  05838000
PSAEXPS2 EQU   PSA+584                                                  05839000
PSAEXPS1 EQU   PSA+576                                                  05840000
PSAPIREG EQU   PSA+572                                                  05841000
PSARSREG EQU   PSA+568                                                  05842000
PSAGPREG EQU   PSA+556                                                  05843000
PSARV022 EQU   PSASUP4                                                  05844000
PSARV021 EQU   PSASUP4                                                  05845000
PSARV020 EQU   PSASUP4                                                  05846000
PSARV019 EQU   PSASUP4                                                  05847000
PSARV018 EQU   PSASUP4                                                  05848000
PSARV017 EQU   PSASUP4                                                  05849000
PSARV016 EQU   PSASUP4                                                  05850000
PSARV015 EQU   PSASUP4                                                  05851000
PSARV014 EQU   PSASUP3                                                  05852000
PSARV013 EQU   PSASUP3                                                  05853000
PSARV012 EQU   PSASUP3                                                  05854000
PSARV011 EQU   PSASUP3                                                  05855000
PSASPR   EQU   PSASUP3                                                  05856000
PSAPSREG EQU   PSASUP3                                                  05857000
PSAPI2   EQU   PSASUP3                                                  05858000
PSAIOSUP EQU   PSASUP3                                                  05859000
PSALCR   EQU   PSASUP2                                                  05860000
PSARTM   EQU   PSASUP2                                                  05861000
PSAACR   EQU   PSASUP2                                                  05862000
PSAIPCE2 EQU   PSASUP2                                                  05863000
PSAIPCES EQU   PSASUP2                                                  05864000
PSAIPCEC EQU   PSASUP2                                                  05865000
PSAGTF   EQU   PSASUP2                                                  05866000
PSAIPCRI EQU   PSASUP2                                                  05867000
PSARV063 EQU   PSASUP1                                                  05868000
PSATCTL  EQU   PSASUP1                                                  05869000
PSADISP  EQU   PSASUP1                                                  05870000
PSALOCK  EQU   PSASUP1                                                  05871000
PSAPI    EQU   PSASUP1                                                  05872000
PSAEXT   EQU   PSASUP1                                                  05873000
PSASVC   EQU   PSASUP1                                                  05874000
PSAIO    EQU   PSASUP1                                                  05875000
PSAAOLD  EQU   PSA+548                                                  05876000
PSAANEW  EQU   PSA+544                                                  05877000
PSATOLD  EQU   PSA+540                                                  05878000
PSATNEW  EQU   PSA+536                                                  05879000
PSALCCAR EQU   PSA+532                                                  05880000
PSALCCAV EQU   PSA+528                                                  05881000
PSAPCCAR EQU   PSA+524                                                  05882000
PSAPCCAV EQU   PSA+520                                                  05883000
PSACPULA EQU   PSA+518                                                  05884000
PSACPUPA EQU   PSA+516                                                  05885000
PSAPSA   EQU   PSA+512                                                  05886000
FLCHDEND EQU   PSA+512                                                  05887000
FLCCRSAV EQU   FLCMCLA+280                                              05888000
FLCGRSAV EQU   FLCMCLA+216                                              05889000
FLCFPSAV EQU   FLCMCLA+184                                              05890000
FLCFLA   EQU   FLCMCLA+88                                               05891000
FLCRGNCD EQU   FLCMCLA+84                                               05892000
FLCFSAA  EQU   FLCFSA+1                                                 05893000
@NM00027 EQU   FLCFSA                                                   05894000
@NM00026 EQU   FLCMCLA+72                                               05895000
FLCMCIC  EQU   FLCMCLA+64                                               05896000
@NM00025 EQU   FLCMCLA+20                                               05897000
FLCIOAA  EQU   FLCIOA+1                                                 05898000
@NM00024 EQU   FLCIOA                                                   05899000
@NM00023 EQU   FLCMCLA+15                                               05900000
@NM00022 EQU   FLCMCLA+14                                               05901000
@NM00021 EQU   FLCMCLA+12                                               05902000
FLCLCL   EQU   FLCMCLA+8                                                05903000
FLCIOELA EQU   FLCIOEL+1                                                05904000
@NM00020 EQU   FLCIOEL                                                  05905000
FLCCHNID EQU   FLCMCLA                                                  05906000
@NM00019 EQU   PSA+160                                                  05907000
FLCMTRCD EQU   PSA+157                                                  05908000
@NM00018 EQU   PSA+156                                                  05909000
FLCPERA  EQU   FLCPER+1                                                 05910000
@NM00017 EQU   FLCPER                                                   05911000
@NM00016 EQU   PSA+151                                                  05912000
FLCPERCD EQU   PSA+150                                                  05913000
FLCMCNUM EQU   PSA+149                                                  05914000
@NM00015 EQU   PSA+148                                                  05915000
FLCTEAA  EQU   FLCTEA+1                                                 05916000
@NM00014 EQU   FLCTEA                                                   05917000
PSAPIPC  EQU   PSAPICOD                                                 05918000
PSAPIMC  EQU   PSAPICOD                                                 05919000
PSAPIPER EQU   PSAPICOD                                                 05920000
PSARV049 EQU   FLCPICOD                                                 05921000
FLCPILCB EQU   FLCPIILC                                                 05922000
@NM00013 EQU   FLCPIILC                                                 05923000
@NM00012 EQU   PSAEPPSW                                                 05924000
FLCSVCN  EQU   PSAESPSW+2                                               05925000
FLCSILCB EQU   FLCSVILC                                                 05926000
@NM00011 EQU   FLCSVILC                                                 05927000
@NM00010 EQU   PSAESPSW                                                 05928000
FLCEICOD EQU   PSAEEPSW+2                                               05929000
PSASPAD  EQU   PSAEEPSW                                                 05930000
@NM00009 EQU   PSA+128                                                  05931000
FLCINPSW EQU   PSA+120                                                  05932000
FLCMNPSW EQU   PSA+112                                                  05933000
FLCPNPSW EQU   PSA+104                                                  05934000
FLCSNPSW EQU   PSA+96                                                   05935000
FLCENPSW EQU   PSA+88                                                   05936000
FLCTRACE EQU   PSA+84                                                   05937000
FLCTIMER EQU   PSA+80                                                   05938000
FLCCVT2  EQU   PSA+76                                                   05939000
FLCCAW   EQU   PSA+72                                                   05940000
FLCCSW   EQU   PSA+64                                                   05941000
FLCIOPSW EQU   PSA+56                                                   05942000
FLCMOPSW EQU   PSA+48                                                   05943000
FLCPOPSW EQU   PSA+40                                                   05944000
FLCSOPSW EQU   PSA+32                                                   05945000
FLCEOPSW EQU   PSA+24                                                   05946000
@NM00008 EQU   FLCICCW2+4                                               05947000
FLCCVT   EQU   FLCICCW2                                                 05948000
FLCICCW1 EQU   FLCROPSW                                                 05949000
FLCIPPSW EQU   FLCRNPSW                                                 05950000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05951000
@RT00316 EQU   L5                                                       05952000
@RF00316 EQU   L2                                                       05953000
@RC00349 EQU   @RC00344                                                 05954000
@RC00413 EQU   @RC00382                                                 05955000
L19      EQU   @EL00001                                                 05956000
CLEANUP# EQU   @EL00001                                                 05957000
@RC00454 EQU   @RC00452                                                 05958000
@RC00466 EQU   @RC00464                                                 05959000
@RT00577 EQU   SEGEND                                                   05960000
@RC00731 EQU   @RC00709                                                 05961000
@RC01027 EQU   @RC01026                                                 05962000
INITMPL# EQU   @RC00349                                                 05963000
@RC00414 EQU   @RC00413                                                 05964000
@RF00468 EQU   @RC00466                                                 05965000
@ENDDATA EQU   *                                                        05966000
         END   ISTAPC11,(C'PLS0002',0702,79094)                         05967000
