         TITLE 'ISTAPC63 - PSS CLEANUP ROUTINE'                         00001000
ISTAPC63 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTAPC63  79.045'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @05,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@05                                         0001 00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
         PRINT OFF                                                      00014000
         PRINT ON                                                       00015000
*                                                                  0215 00016000
*/* END OF ATBUILD                                                   */ 00017000
*                                                                  0215 00018000
*   DO;                             /* ISTREG (0,1,2,3,4,5,6,7,8,9,10   00019000
*                                      ,11,12,13,14,15)              */ 00020000
*   END;                            /* ISTREG                        */ 00021000
*                                                                  0217 00022000
*   /*****************************************************************/ 00023000
*   /*                                                               */ 00024000
*   /* * REGISTER AND CONTROL BLOCK POINTER DECLARES                 */ 00025000
*   /*                                                               */ 00026000
*   /*****************************************************************/ 00027000
*                                                                  0217 00028000
*   DCL                                                            0217 00029000
*     R0 PTR(31) REGISTER(0),                                      0217 00030000
*     R1 PTR(31) REGISTER(1),                                      0217 00031000
*     R2 PTR(31) REGISTER(2),                                      0217 00032000
*     R3 PTR(31) REGISTER(3),                                      0217 00033000
*     R4 PTR(31) REGISTER(4),                                      0217 00034000
*     R5 PTR(31) REGISTER(5),                                      0217 00035000
*     R6 PTR(31) REGISTER(6),                                      0217 00036000
*     R7 PTR(31) REGISTER(7),                                      0217 00037000
*     R8 PTR(31) REGISTER(8),                                      0217 00038000
*     R9 PTR(31) REGISTER(9),                                      0217 00039000
*     R10 PTR(31) REGISTER(10),                                    0217 00040000
*     R11 PTR(31) REGISTER(11),                                    0217 00041000
*     R12 PTR(31) REGISTER(12),                                    0217 00042000
*     R13 PTR(31) REGISTER(13),                                    0217 00043000
*     R14 PTR(31) REGISTER(14),                                    0217 00044000
*     R15 PTR(31) REGISTER(15);                                    0217 00045000
*   DCL                                                            0218 00046000
*     SRBPTR PTR(31) REGISTER(0);   /* BASE FOR SRB MAPPING          */ 00047000
*   DCL                                                            0219 00048000
*     PABPTR PTR(31) REGISTER(2);   /* PTR TO PAB                    */ 00049000
*   DCL                                                            0220 00050000
*     PSTPTR PTR(31) REGISTER(3);   /* PTR TO PST                    */ 00051000
*   DCL                                                            0221 00052000
*     BACK PTR(31) REGISTER(3);     /* USED TO DEQUEUE PABS FROM RPH */ 00053000
*   DCL                                                            0222 00054000
*     CRAPTR PTR(31) REGISTER(4) RSTD;/* PTR TO CRA                  */ 00055000
*   DCL                                                            0223 00056000
*     APCRTNS PTR(31) REGISTER(8);  /* USED TO CALL OTHER APC      0223 00057000
*                                      ROUTINES                      */ 00058000
*   DCL                                                            0224 00059000
*     MPSTPTR PTR(31) REGISTER(9);  /* BASE FOR MPST MAPPING         */ 00060000
*   DCL                                                            0225 00061000
*     R11TST FIXED(31) REG(11);     /* TEST MPST GATE        @ZM32656*/ 00062000
*   DCL                                                            0226 00063000
*     ATCVTPTR PTR(31) REGISTER(13);/* BASE FOR ATCVT MAPPING        */ 00064000
*   DCL                                                            0227 00065000
*     ASCBPTR PTR(31) DEFINED(PSAAOLD);/* BASE FOR ASCB MAPPING      */ 00066000
*   DCL                                                            0228 00067000
*     ASXBPTR PTR(31) DEFINED(ASCBASXB);/* BASE FOR ASXB MAPPING     */ 00068000
*   DCL                                                            0229 00069000
*     CVTPTR PTR(31) LOCATION(16);  /* BASE FOR CVT MAPPING          */ 00070000
*   DCL                                                            0230 00071000
*     LCPBPTR PTR(31) BASED;                                       0230 00072000
*   DCL                                                            0231 00073000
*     ISTAPC64 ENTRY BASED(APCRTNS) VALRG(0);/*              @OZ04697*/ 00074000
*   DCL                                                            0232 00075000
*     RCOVPAB CHAR(LENGTH(ISTDYPAB)) DEFINED(CRAPROCR);            0232 00076000
*   DCL                                                            0233 00077000
*     ON BIT(1) CONSTANT('1'B);     /* WHEN ITS ON ITS ON            */ 00078000
*   DCL                                                            0234 00079000
*     OFF BIT(1) CONSTANT('0'B);    /* WHEN ITS OFF ITS OFF          */ 00080000
*   RESPECIFY                                                      0235 00081000
*     ISTAPCRR BASED(ADDR(CRAPSS));                                0235 00082000
*   RESPECIFY                                                      0236 00083000
*     ISTATCVT BASED(ATCVTPTR);                                    0236 00084000
*   RESPECIFY                                                      0237 00085000
*     ISTCRA BASED(CRAPTR);                                        0237 00086000
*   RESPECIFY                                                      0238 00087000
*     ISTMPST BASED(ASXBMPST);                                     0238 00088000
*   RESPECIFY                                                      0239 00089000
*     ISTPAB BASED(PABPTR);                                        0239 00090000
*   RESPECIFY                                                      0240 00091000
*     ISTPFCRR BASED(ADDR(APCHDRSV));                              0240 00092000
*   RESPECIFY                                                      0241 00093000
*     ISTPST BASED(APCPSTA);                                       0241 00094000
*   RESPECIFY                                                      0242 00095000
*     ISTRPH BASED(ADDR(CRARPH));                                  0242 00096000
*   RESPECIFY                                                      0243 00097000
*     RPHPTR UNRESTRICTED;                                         0243 00098000
*                                                                  0244 00099000
*   /*****************************************************************/ 00100000
*   /*                                                               */ 00101000
*   /* * MAINLINE CODE BEGINS HERE                                   */ 00102000
*   /*                                                               */ 00103000
*   /*****************************************************************/ 00104000
*                                                                  0244 00105000
*   RESPECIFY                                                      0244 00106000
*    (R1,                                                          0244 00107000
*     R3,                                                          0244 00108000
*     R6,                                                          0244 00109000
*     R8,                                                          0244 00110000
*     R9,                                                          0244 00111000
*     R10,                                                         0244 00112000
*     R11,                                                         0244 00113000
*     R12,                                                         0244 00114000
*     ATCVTPTR,                                                    0244 00115000
*     R14) RESTRICTED;                                             0244 00116000
*                                                                  0244 00117000
*/*  SAVE CALLER'S REGS IN PSS CRA AREA, FOLLOWING DYPAB STRUCTURE.     00118000
*    RESTORE REGS BEFORE ISSUING RELSTORE FOR CRA PASSED BY CALLER.     00119000
*    SAVE R14 OVER RELSTORE, AS IT IS DESTOYED               @Z40GKD1*/ 00120000
*                                                                  0245 00121000
*   CRAPTR=R1;                      /* GET ADDR OF CALLER'S CRA    0245 00122000
*                                                            @Z40GKD1*/ 00123000
         LR    CRAPTR,R1                                           0245 00124000
*   R3=ADDR(CRAPROCR)+LENGTH(ISTDYPAB);/* SAVE CALLER'S R11-14     0246 00125000
*                                                            @Z40GKD1*/ 00126000
         LA    R3,CRAPROCR(,CRAPTR)                                0246 00127000
         AL    R3,@CF00066                                         0246 00128000
*   GEN REFS(R11,R14,R3)(STM R11,R14,0(R3));/*               @Z40GKD1*/ 00129000
         STM R11,R14,0(R3)                                              00130000
*   RFY                                                            0248 00131000
*    (R1,                                                          0248 00132000
*     R3,                                                          0248 00133000
*     R6,                                                          0248 00134000
*     R8,                                                          0248 00135000
*     R9,                                                          0248 00136000
*     R10,                                                         0248 00137000
*     R11,                                                         0248 00138000
*     R12,                                                         0248 00139000
*     R14) UNRSTD;                  /*                       @OZ04697*/ 00140000
*   RFY                                                            0249 00141000
*    (PABPTR,                                                      0249 00142000
*     BACK,                                                        0249 00143000
*     MPSTPTR) RSTD;                /*                       @Z40GKD1*/ 00144000
*   DO WHILE RPHPABQP^=0;           /* RPH PAB QUEUE IS NOT EMPTY    */ 00145000
         B     @DE00250                                            0250 00146000
@DL00250 DS    0H                                                  0251 00147000
*     BACK=0;                                                      0251 00148000
         SLR   BACK,BACK                                           0251 00149000
*     PABPTR=RPHPABQP;              /* PTR TO FIRST PAB ON QUEUE     */ 00150000
         L     PABPTR,RPHPABQP+51(,CRAPTR)                         0252 00151000
         LA    PABPTR,0(,PABPTR)                                   0252 00152000
*     DO WHILE PABPTR->PABCHNGP^=0; /* PTR TO NEXT PAB ON QUEUE      */ 00153000
         B     @DE00253                                            0253 00154000
@DL00253 DS    0H                                                  0254 00155000
*       BACK=PABPTR;                /* ADDR OF PREVIOUS PAB          */ 00156000
         LR    BACK,PABPTR                                         0254 00157000
*       PABPTR=PABPTR->PABCHNGP;    /* ADDR OF NEXT PAB ON QUEUE     */ 00158000
         L     @12,PABCHNGP-1(,PABPTR)                             0255 00159000
         LA    @12,0(,@12)                                         0255 00160000
         LR    PABPTR,@12                                          0255 00161000
*     END;                                                         0256 00162000
@DE00253 L     @12,PABCHNGP-1(,PABPTR)                             0256 00163000
         LA    @12,0(,@12)                                         0256 00164000
         LTR   @12,@12                                             0256 00165000
         BNZ   @DL00253                                            0256 00166000
*     IF BACK=0 THEN                /* WAS ONLY ONE PAB ON QUEUE     */ 00167000
         SLR   @12,@12                                             0257 00168000
         CR    BACK,@12                                            0257 00169000
         BNE   @RF00257                                            0257 00170000
*       RPHPABQP=0;                 /* YES - ZERO QUEUE HEAD PTR     */ 00171000
         STCM  @12,7,RPHPABQP+52(CRAPTR)                           0258 00172000
*     ELSE                                                         0259 00173000
*       BACK->PABCHNGP=0;           /* NO - ZERO LINK FIELD IN LAST     00174000
*                                      PAB                           */ 00175000
         B     @RC00257                                            0259 00176000
@RF00257 SLR   @12,@12                                             0259 00177000
         STCM  @12,7,PABCHNGP(BACK)                                0259 00178000
*     IF PABRPHA=0                  /* IS THERE AN RPH FOR THIS PAB?    00179000
*                                                            @Z40GKD1*/ 00180000
*       THEN                                                       0260 00181000
@RC00257 L     @12,PABRPHA-1(,PABPTR)                              0260 00182000
         LA    @12,0(,@12)                                         0260 00183000
         LTR   @12,@12                                             0260 00184000
         BZ    @RT00260                                            0260 00185000
*       ;                           /* NO, DEQUEUE THE NEXT ONE    0261 00186000
*                                                            @Z40GKD1*/ 00187000
*     ELSE                                                         0262 00188000
*       DO;                         /* ELSE PABRPHA NOT ZERO @Z40GKD1*/ 00189000
*         IF PABRPHA->RPHPGCMP=ON THEN/* IF RPH PURGE COMPLETED    0263 00190000
*                                                            @Z40GKD1*/ 00191000
         L     @12,PABRPHA-1(,PABPTR)                              0263 00192000
         LA    @12,0(,@12)                                         0263 00193000
         TM    RPHPGCMP(@12),B'00010000'                           0263 00194000
         BNO   @RF00263                                            0263 00195000
*           DO;                                                    0264 00196000
*             RFY                                                  0265 00197000
*              (R5,                                                0265 00198000
*               R13,                                               0265 00199000
*               R12) RSTD;          /*                       @Z40GKD1*/ 00200000
*             R12=R5;               /* SAVE BASE REG ACROSS RELSTORE    00201000
*                                                            @Z40GKD1*/ 00202000
         LR    R12,R5                                              0266 00203000
*             R13=CRAPTR;           /* SAVE PTR TO CALLER'S CRA    0267 00204000
*                                                            @Z40GKD1*/ 00205000
         LR    R13,CRAPTR                                          0267 00206000
*             CRAPTR=PABRPHA->RPHCRR;/* GET PTR TO RPH'S CRA @Z40GKD1*/ 00207000
         L     @08,PABRPHA-1(,PABPTR)                              0268 00208000
         LA    @08,0(,@08)                                         0268 00209000
         L     CRAPTR,RPHCRR(,@08)                                 0268 00210000
*             DO;                   /* RELSTORE                    0269 00211000
*                                      BUFADDR(CRAPTR)SAVE(NO)       */ 00212000
*                                                                  0270 00213000
*               /*****************************************************/ 00214000
*               /*                                                   */ 00215000
*               /* RELSTORE BUFADDR(CRAPTR)SAVE(NO)                  */ 00216000
*               /*                                                   */ 00217000
*               /*****************************************************/ 00218000
*                                                                  0270 00219000
*               DO;                                                0270 00220000
*                                                                  0270 00221000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00222000
*/* END OF ATBUILD                                                   */ 00223000
*                                                                  0271 00224000
*                 DO;                                              0271 00225000
*                 END;                                             0272 00226000
*                 DO;                                              0273 00227000
*                   RFY                                            0274 00228000
*                    (GPR02P,                                      0274 00229000
*                     GPR03P,                                      0274 00230000
*                     GPR04P,                                      0274 00231000
*                     GPR15P) RSTD;                                0274 00232000
*                 END;                                             0275 00233000
*                 GPR04P=CRAPTR;                                   0276 00234000
*                 DCL                                              0277 00235000
*                   1 FMZA0006 FIXED(31) STATIC LOCAL,             0277 00236000
*                    2 * FIXED(8) INIT(0),                         0277 00237000
*                    2 * PTR(24) INIT(0);                          0277 00238000
*                 GPR03F=FMZA0006;                                 0278 00239000
         L     GPR03F,FMZA0006                                     0278 00240000
*                 DO;               /* LISATCVT                    0279 00241000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00242000
*                   GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER          */ 00243000
         L     GPR15P,ATCLCPTR                                     0280 00244000
*                 END;              /* LISATCVT                      */ 00245000
*                 GPR02P=GPR15P->ATCBPDA;                          0282 00246000
         L     GPR02P,ATCBPDA(,GPR15P)                             0282 00247000
*                 GPR15P=GPR15P->ATCSMRS;                          0283 00248000
         L     GPR15P,ATCSMRS(,GPR15P)                             0283 00249000
*                 DCL                                              0284 00250000
*                   FMZL0006 BASED(GPR15P) LABEL VALUERANGE(*);    0284 00251000
*                 CALL FMZL0006;                                   0285 00252000
         BALR  @14,@15                                             0285 00253000
*                 DO;                                              0286 00254000
*                   RFY                                            0287 00255000
*                    (GPR02P,                                      0287 00256000
*                     GPR03P,                                      0287 00257000
*                     GPR04P,                                      0287 00258000
*                     GPR15P) UNRSTD;                              0287 00259000
*                 END;                                             0288 00260000
*               END;                                               0289 00261000
*             END;                  /* RELSTORE RELEASE THE CRA    0290 00262000
*                                                            @Z40GKD1*/ 00263000
*             R5=R12;               /* RESTORE BASE REGISTER @Z40GKD1*/ 00264000
         LR    R5,R12                                              0291 00265000
*             CRAPTR=R13;           /* RESTORE PTR TO CALLER'S CRA 0292 00266000
*                                                            @Z40GKD1*/ 00267000
         LR    CRAPTR,R13                                          0292 00268000
*             RFY                                                  0293 00269000
*              (R5,                                                0293 00270000
*               R12,                                               0293 00271000
*               R13) UNRSTD;        /*                       @Z40GKD1*/ 00272000
*           END;                    /* END RPH PURGE COMPLETE      0294 00273000
*                                                            @Z40GKD1*/ 00274000
*         ELSE                                                     0295 00275000
*           PABRPHA->RPHRLCRA=ON;   /* INDICATE CRA SHLD BE RELEASED    00276000
*                                                            @Z40GKD1*/ 00277000
         B     @RC00263                                            0295 00278000
@RF00263 L     @12,PABRPHA-1(,PABPTR)                              0295 00279000
         OI    RPHRLCRA(@12),B'00000100'                           0295 00280000
*       END;                        /* END PABRPHA NOT ZERO  @Z40GKD1*/ 00281000
@RC00263 DS    0H                                                  0297 00282000
*   END;                            /* END DOWHILE RPH PAB QUE NOT 0297 00283000
*                                      EMPTY                         */ 00284000
@RT00260 DS    0H                                                  0297 00285000
@DE00250 LA    @12,52                                              0297 00286000
         ALR   @12,CRAPTR                                          0297 00287000
         L     @08,RPHPABQP-1(,@12)                                0297 00288000
         LA    @08,0(,@08)                                         0297 00289000
         LTR   @08,@08                                             0297 00290000
         BNZ   @DL00250                                            0297 00291000
*   RESPECIFY                                                      0298 00292000
*    (BACK,                                                        0298 00293000
*     MPSTPTR) UNRSTD;              /*                       @Z40GKD1*/ 00294000
*   PABPTR=RPHMAJCB+RPHPABOF;       /* GET CURRENT PAB FROM RPH    0299 00295000
*                                                            @OZ04697*/ 00296000
         L     PABPTR,RPHMAJCB-1(,@12)                             0299 00297000
         LA    PABPTR,0(,PABPTR)                                   0299 00298000
         SLR   @03,@03                                             0299 00299000
         IC    @03,RPHPABOF(,@12)                                  0299 00300000
         ALR   PABPTR,@03                                          0299 00301000
*   IF(APCUETSK^='0'B)|             /* IF RUNNING USER EXITS @OZ04697*/ 00302000
*       (PABPTR=0)|                 /* OR NO PAB             @OZ04697*/ 00303000
*       (CRACRR=ADDR(CRAPSS))       /* OR PSS IN CONTROL     @OZ04697*/ 00304000
*     THEN                                                         0300 00305000
         TM    APCUETSK+160(CRAPTR),B'01000000'                    0300 00306000
         BNZ   @RT00300                                            0300 00307000
         LTR   PABPTR,PABPTR                                       0300 00308000
         BZ    @RT00300                                            0300 00309000
         LA    @12,CRAPSS(,CRAPTR)                                 0300 00310000
         C     @12,CRACRR(,CRAPTR)                                 0300 00311000
         BNE   @RF00300                                            0300 00312000
@RT00300 DS    0H                                                  0301 00313000
*     RPHRLCRA=ON;                  /* THEN RPH CANNOT BE WAITING FOR   00314000
*                                      TPPOST, SO SET RELEASE      0301 00315000
*                                      INDICATOR ON TO ENSURE APC64     00316000
*                                      WILL FREE THE CRA     @OZ04697*/ 00317000
         OI    RPHRLCRA+52(CRAPTR),B'00000100'                     0301 00318000
*   ELSE                                                           0302 00319000
*     DO;                           /* ELSE PAB@ SHOULD BE VALID,  0302 00320000
*                                      STRIP IT              @Z40GKD1*/ 00321000
         B     @RC00300                                            0302 00322000
@RF00300 DS    0H                                                  0303 00323000
*STRIPCUR:                          /* INSERT DYPAB AND CLEAN UP CUR    00324000
*                                      PAB                   @Y30APGA*/ 00325000
*                                                                  0303 00326000
*       /*************************************************************/ 00327000
*       /*                                                           */ 00328000
*       /* IF POSTED AFTER THE FOLLOWING CLEANUP, THE RPH AND        */ 00329000
*       /* INSERTED DYPAB WILL RUN VIA SRB IN VTAMS MEMORY           */ 00330000
*       /*                                                           */ 00331000
*       /*************************************************************/ 00332000
*                                                                  0303 00333000
*       RFY                                                        0303 00334000
*        (R10,                                                     0303 00335000
*         R11) RSTD;                                               0303 00336000
STRIPCUR DS    0H                                                  0304 00337000
*       R10=ADDR(RCOVPAB);          /* POINT TO RECOVERY DYPAB     0304 00338000
*                                                            @Y30APGA*/ 00339000
         LA    R10,RCOVPAB(,CRAPTR)                                0304 00340000
*       R11=ADDR(R10->DYPPAB);      /* POINT TO RECOVERY PAB @Y30APGA*/ 00341000
         LA    R11,DYPPAB(,R10)                                    0305 00342000
*       R10->ISTDYPAB(1:LENGTH(ISTDYPAB))/* COPY INTO RCOV DYPAB     */ 00343000
*           =PSTSMDYP(1:LENGTH(ISTDYPAB));/* FROM THE PST SMS PAB  0306 00344000
*                                                            @Y30APGA*/ 00345000
         L     @12,APCPSTA+160(,CRAPTR)                            0306 00346000
         MVC   ISTDYPAB(32,R10),PSTSMDYP(@12)                      0306 00347000
*       R11->PABRPHA=ADDR(CRARPH);  /* CHANGE RCOV PAB RPH@  @Y30APGA*/ 00348000
         LA    @12,CRARPH(,CRAPTR)                                 0307 00349000
         STCM  @12,7,PABRPHA(R11)                                  0307 00350000
*       R11->PABFLAGS='00'X;        /* SET ALL FLGS OFF      @0Z04697*/ 00351000
         MVI   PABFLAGS(R11),X'00'                                 0308 00352000
*       R11->PABDYNAM=ON;           /* SET ONLY DYNAM FLAG ON      0309 00353000
*                                                            @OZ04697*/ 00354000
         OI    PABDYNAM(R11),B'00010000'                           0309 00355000
*       RPHPABOF=R11->PABOFFST;     /* CHANGE RPH PAB OFFSET @Y30APGA*/ 00356000
         LA    @12,52                                              0310 00357000
         ALR   @12,CRAPTR                                          0310 00358000
         IC    @03,PABOFFST(,R11)                                  0310 00359000
         STC   @03,RPHPABOF(,@12)                                  0310 00360000
*       RPHMAJCB=R10;               /* CHANGE RPH MAJCB PTR  @Y30APGA*/ 00361000
         STCM  R10,7,RPHMAJCB(@12)                                 0311 00362000
*       DO;                         /* LISATCVT                    0312 00363000
*                                      CVTBASE(PAGEABLE,(R11))       */ 00364000
*         R11=ATCLCPTR;             /* SET UP ATCVT POINTER          */ 00365000
         L     R11,ATCLCPTR                                        0313 00366000
*       END;                        /* LISATCVT GET ATCVT PTR      0314 00367000
*                                                            @ZM32226*/ 00368000
*       GEN(PRINT OFF);             /*                       @ZA36827*/ 00369000
         PRINT OFF                                                      00370000
*/* RPHTSKID=R11->ATCASCB->ASCBASXB->ASXBMPST     POINT RPHTSKID     */ 00371000
*/*             TO VTAM'S MPST IN CASE OF CROSS MEMORY POST OF THE   */ 00372000
*/*             RPH AFTER TASK TERM COMPLETES                @ZA35083*/ 00373000
*/* R10->DYPTSKID=R11->ATCASCB->ASCBASXB->ASXBMPST    POINT PAB TO   */ 00374000
*/*             VTAM'S MPST IN CASE IT GETS POSTED AFTER TASK TERM   */ 00375000
*/*             COMPLETES                                  @OZ04697  */ 00376000
*                                                                  0316 00377000
*       GEN(PRINT ON);              /*                       @ZA36827*/ 00378000
         PRINT ON                                                       00379000
*       R10->DYPTSKID=R11->ATCCDTID->PSTMPSTP;/* POINT PAB TO VTAM'S    00380000
*                                      MPST IN CASE IT GETS POSTED 0317 00381000
*                                      AFTER TASK TERMINATION      0317 00382000
*                                      COMPLETES             @ZA36827*/ 00383000
         L     @12,ATCCDTID(,R11)                                  0317 00384000
         L     @12,PSTMPSTP(,@12)                                  0317 00385000
         ST    @12,DYPTSKID(,R10)                                  0317 00386000
*       RPHTSKID=R11->ATCCDTID->PSTMPSTP;/* POINT RPHTSKID TO VTAM'S    00387000
*                                      MPST IN CASE OF CROSS MEMORY     00388000
*                                      POST OF THE RPH AFTER TASK  0318 00389000
*                                      TERMINATION COMPLETES @ZA36827*/ 00390000
         ST    @12,RPHTSKID+52(,CRAPTR)                            0318 00391000
*       APCRTRN=CVTSRBRT;           /* INSURE SRB RETURN ADDR      0319 00392000
*                                                            @ZM32661*/ 00393000
         LA    @12,160                                             0319 00394000
         ALR   @12,CRAPTR                                          0319 00395000
         L     @03,CVTPTR                                          0319 00396000
         L     @03,CVTSRBRT(,@03)                                  0319 00397000
         ST    @03,APCRTRN(,@12)                                   0319 00398000
*       APCSSTSK='0'B;              /* IDENTIFY AS SRB       @Z40GKD1*/ 00399000
         NI    APCSSTSK(@12),B'01111111'                           0320 00400000
*     END;                          /* END RPH NOT TPWAITING @OZ04697*/ 00401000
*   RFY                                                            0322 00402000
*     R3 RSTD;                      /*                       @Z40GKD1*/ 00403000
@RC00300 DS    0H                                                  0323 00404000
*   R3=ADDR(CRAPROCR)+LENGTH(ISTDYPAB);/* GET SAVEAREA @     @Z40GKD1*/ 00405000
         LA    R3,CRAPROCR(,CRAPTR)                                0323 00406000
         AL    R3,@CF00066                                         0323 00407000
*   GEN REFS(R11,R14,R3) SETS(R11,R12,R13,R14)(LM R11,R14,0(R3));/*     00408000
*                                      RESTORE CALLERS REGS  @Z40GKD1*/ 00409000
         LM R11,R14,0(R3)                                               00410000
*   RFY                                                            0325 00411000
*     R3 UNRSTD;                    /*                       @Z40GKD1*/ 00412000
*   RFY                                                            0326 00413000
*    (R11,                                                         0326 00414000
*     R12,                                                         0326 00415000
*     R13,                                                         0326 00416000
*     R14,                                                         0326 00417000
*     R1) RSTD;                     /*                       @Z40GKD1*/ 00418000
*                                                                  0326 00419000
*   /*****************************************************************/ 00420000
*   /*                                                               */ 00421000
*   /* SET UP FOR CALL TO APC64 TO FREE LOCKS HELD BY CRA    @OZ04697*/ 00422000
*   /*                                                               */ 00423000
*   /*****************************************************************/ 00424000
*                                                                  0327 00425000
*   RFY                                                            0327 00426000
*    (R9,                                                          0327 00427000
*     R10,                                                         0327 00428000
*     APCRTNS,                                                     0327 00429000
*     R6,                                                          0327 00430000
*     R5) RSTD;                                                    0327 00431000
*   R9=R5;                          /* SAVE BASE REGISTER ACROSS CALL   00432000
*                                                            @OZ04697*/ 00433000
         LR    R9,R5                                               0328 00434000
*   R10=R14;                        /* SAVE USER'S RETURN ADDR     0329 00435000
*                                      ACCROSS CALL          @OZ04697*/ 00436000
         LR    R10,R14                                             0329 00437000
*   R1=CRAPTR;                      /* SET UP CRA @ IN PARAMETER REG    00438000
*                                                            @OZ04697*/ 00439000
*                                                                  0330 00440000
         LR    R1,CRAPTR                                           0330 00441000
*   /*****************************************************************/ 00442000
*   /*                                                               */ 00443000
*   /* REGS 9-14 UNCHANGED ACROSS CALL TO APC64              @OZ04697*/ 00444000
*   /*                                                               */ 00445000
*   /*****************************************************************/ 00446000
*                                                                  0331 00447000
*   DO;                             /* LISATCVT                    0331 00448000
*                                      CVTBASE(PAGEABLE,(R6))        */ 00449000
*     R6=ATCLCPTR;                  /* SET UP ATCVT POINTER          */ 00450000
         L     R6,ATCLCPTR                                         0332 00451000
*   END;                            /* LISATCVT GET PTR TO ATCVT   0333 00452000
*                                                            @OZ04697*/ 00453000
*   APCRTNS=R6->ATCAP64;            /* GET ADDR OF APC64     @OZ04697*/ 00454000
         L     APCRTNS,ATCAP64(,R6)                                0334 00455000
*   CALL ISTAPC64;                  /* APC64 WILL SET RPH PURGE    0335 00456000
*                                      COMPLETE IF RPH TPWAITING,  0335 00457000
*                                      ELSE WILL RELSTORE THE CRA  0335 00458000
*                                                            @OZ04697*/ 00459000
         LR    @15,APCRTNS                                         0335 00460000
         BALR  @14,@15                                             0335 00461000
*   R5=R9;                          /* RESTORE BASE REGISTER @OZ04697*/ 00462000
         LR    R5,R9                                               0336 00463000
*   R14=R10;                        /* RESTORE RETURN ADDRESS      0337 00464000
*                                                            @OZ04697*/ 00465000
         LR    R14,R10                                             0337 00466000
*   RFY                                                            0338 00467000
*    (R1,                                                          0338 00468000
*     R9,                                                          0338 00469000
*     R10,                                                         0338 00470000
*     APCRTNS,                                                     0338 00471000
*     R6) UNRSTD;                                                  0338 00472000
*   DO;                             /* TPEPILOG                      */ 00473000
*     GEN(PRINT OFF);                                              0340 00474000
         PRINT OFF                                                      00475000
*     DO;                                                          0341 00476000
*       DCL                                                        0342 00477000
*         GPR00F FIXED(31) REG(00),                                0342 00478000
*         GPR00P PTR(31) REG(00),                                  0342 00479000
*         GPR01F FIXED(31) REG(01),                                0342 00480000
*         GPR01P PTR(31) REG(01),                                  0342 00481000
*         GPR02F FIXED(31) REG(02),                                0342 00482000
*         GPR02P PTR(31) REG(02),                                  0342 00483000
*         GPR03F FIXED(31) REG(03),                                0342 00484000
*         GPR03P PTR(31) REG(03),                                  0342 00485000
*         GPR04F FIXED(31) REG(04),                                0342 00486000
*         GPR04P PTR(31) REG(04),                                  0342 00487000
*         GPR05F FIXED(31) REG(05),                                0342 00488000
*         GPR05P PTR(31) REG(05),                                  0342 00489000
*         GPR06F FIXED(31) REG(06),                                0342 00490000
*         GPR06P PTR(31) REG(06),                                  0342 00491000
*         GPR07F FIXED(31) REG(07),                                0342 00492000
*         GPR07P PTR(31) REG(07),                                  0342 00493000
*         GPR08F FIXED(31) REG(08),                                0342 00494000
*         GPR08P PTR(31) REG(08),                                  0342 00495000
*         GPR09F FIXED(31) REG(09),                                0342 00496000
*         GPR09P PTR(31) REG(09),                                  0342 00497000
*         GPR10F FIXED(31) REG(10),                                0342 00498000
*         GPR10P PTR(31) REG(10),                                  0342 00499000
*         GPR11F FIXED(31) REG(11),                                0342 00500000
*         GPR11P PTR(31) REG(11),                                  0342 00501000
*         GPR12F FIXED(31) REG(12),                                0342 00502000
*         GPR12P PTR(31) REG(12),                                  0342 00503000
*         GPR13F FIXED(31) REG(13),                                0342 00504000
*         GPR13P PTR(31) REG(13),                                  0342 00505000
*         GPR14F FIXED(31) REG(14),                                0342 00506000
*         GPR14P PTR(31) REG(14),                                  0342 00507000
*         GPR15F FIXED(31) REG(15),                                0342 00508000
*         GPR15P PTR(31) REG(15);                                  0342 00509000
*     END;                                                         0343 00510000
*     GEN(PRINT ON);                                               0344 00511000
         PRINT ON                                                       00512000
*   END;                            /* TPEPILOG                      */ 00513000
*   END ISTAPC63                                                   0346 00514000
*                                                                  0346 00515000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00516000
*/*%INCLUDE SYSUT5  (MAPPINGS)                                       */ 00517000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00518000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 00519000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00520000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00521000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00522000
*/*%INCLUDE SYSUT5  (DCLS    )                                       */ 00523000
*/*%INCLUDE SYSUT5  (SUBRTN  )                                       */ 00524000
*                                                                  0346 00525000
*       ;                                                          0346 00526000
@EL00001 DS    0H                                                  0346 00527000
@EF00001 DS    0H                                                  0346 00528000
@ER00001 BR    @14                                                 0346 00529000
@DATA    DS    0H                                                       00530000
@DATD    DSECT                                                          00531000
         DS    0F                                                       00532000
ISTAPC63 CSECT                                                          00533000
         DS    0F                                                       00534000
@CF00066 DC    F'32'                                                    00535000
@DATD    DSECT                                                          00536000
         DS    0D                                                       00537000
@ENDDATD EQU   *                                                        00538000
ISTAPC63 CSECT                                                          00539000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00540000
         DS    0F                                                       00541000
@SIZDATD DC    AL1(0)                                                   00542000
         DC    AL3(@ENDDATD-@DATD)                                      00543000
         DS    0D                                                       00544000
FMZA0006 DS    FL4                                                      00545000
         ORG   FMZA0006                                                 00546000
@NM00108 DC    AL1(0)                                                   00547000
@NM00109 DC    AL3(0)                                                   00548000
         ORG   FMZA0006+4                                               00549000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00550000
@01      EQU   01                                                       00551000
@02      EQU   02                                                       00552000
@03      EQU   03                                                       00553000
@04      EQU   04                                                       00554000
@05      EQU   05                                                       00555000
@06      EQU   06                                                       00556000
@07      EQU   07                                                       00557000
@08      EQU   08                                                       00558000
@09      EQU   09                                                       00559000
@10      EQU   10                                                       00560000
@11      EQU   11                                                       00561000
@12      EQU   12                                                       00562000
@13      EQU   13                                                       00563000
@14      EQU   14                                                       00564000
@15      EQU   15                                                       00565000
SRBPTR   EQU   @00                                                      00566000
RPHPTR   EQU   @01                                                      00567000
R1       EQU   @01                                                      00568000
R3       EQU   @03                                                      00569000
R5       EQU   @05                                                      00570000
R6       EQU   @06                                                      00571000
R8       EQU   @08                                                      00572000
R9       EQU   @09                                                      00573000
R10      EQU   @10                                                      00574000
R11      EQU   @11                                                      00575000
R12      EQU   @12                                                      00576000
R13      EQU   @13                                                      00577000
R14      EQU   @14                                                      00578000
PABPTR   EQU   @02                                                      00579000
BACK     EQU   @03                                                      00580000
CRAPTR   EQU   @04                                                      00581000
APCRTNS  EQU   @08                                                      00582000
MPSTPTR  EQU   @09                                                      00583000
ATCVTPTR EQU   @13                                                      00584000
GPR02P   EQU   @02                                                      00585000
GPR03P   EQU   @03                                                      00586000
GPR04P   EQU   @04                                                      00587000
GPR15P   EQU   @15                                                      00588000
GPR03F   EQU   @03                                                      00589000
GPR00F   EQU   @00                                                      00590000
GPR00P   EQU   @00                                                      00591000
GPR01F   EQU   @01                                                      00592000
GPR01P   EQU   @01                                                      00593000
GPR02F   EQU   @02                                                      00594000
GPR04F   EQU   @04                                                      00595000
GPR05F   EQU   @05                                                      00596000
GPR05P   EQU   @05                                                      00597000
GPR06F   EQU   @06                                                      00598000
GPR06P   EQU   @06                                                      00599000
GPR07F   EQU   @07                                                      00600000
GPR07P   EQU   @07                                                      00601000
GPR08F   EQU   @08                                                      00602000
GPR08P   EQU   @08                                                      00603000
GPR09F   EQU   @09                                                      00604000
GPR09P   EQU   @09                                                      00605000
GPR10F   EQU   @10                                                      00606000
GPR10P   EQU   @10                                                      00607000
GPR11F   EQU   @11                                                      00608000
GPR11P   EQU   @11                                                      00609000
GPR12F   EQU   @12                                                      00610000
GPR12P   EQU   @12                                                      00611000
GPR13F   EQU   @13                                                      00612000
GPR13P   EQU   @13                                                      00613000
GPR14F   EQU   @14                                                      00614000
GPR14P   EQU   @14                                                      00615000
GPR15F   EQU   @15                                                      00616000
PSTPTR   EQU   @03                                                      00617000
R0       EQU   @00                                                      00618000
R11TST   EQU   @11                                                      00619000
R15      EQU   @15                                                      00620000
R2       EQU   @02                                                      00621000
R4       EQU   @04                                                      00622000
R7       EQU   @07                                                      00623000
PSA      EQU   0                                                        00624000
FLCRNPSW EQU   PSA                                                      00625000
FLCROPSW EQU   PSA+8                                                    00626000
FLCICCW2 EQU   PSA+16                                                   00627000
PSAEEPSW EQU   PSA+132                                                  00628000
PSAESPSW EQU   PSA+136                                                  00629000
FLCSVILC EQU   PSAESPSW+1                                               00630000
PSAEPPSW EQU   PSA+140                                                  00631000
FLCPIILC EQU   PSAEPPSW+1                                               00632000
FLCPICOD EQU   PSAEPPSW+2                                               00633000
PSAPICOD EQU   FLCPICOD+1                                               00634000
FLCTEA   EQU   PSAEPPSW+4                                               00635000
FLCPER   EQU   PSA+152                                                  00636000
FLCMCLA  EQU   PSA+168                                                  00637000
FLCIOEL  EQU   FLCMCLA+4                                                00638000
FLCIOA   EQU   FLCMCLA+16                                               00639000
FLCFSA   EQU   FLCMCLA+80                                               00640000
PSAAOLD  EQU   PSA+548                                                  00641000
PSASUPER EQU   PSA+552                                                  00642000
PSASUP1  EQU   PSASUPER                                                 00643000
PSASUP2  EQU   PSASUPER+1                                               00644000
PSASUP3  EQU   PSASUPER+2                                               00645000
PSASUP4  EQU   PSASUPER+3                                               00646000
PSACLHT  EQU   PSA+640                                                  00647000
PSALKSA  EQU   PSA+696                                                  00648000
PSAHLHI  EQU   PSA+760                                                  00649000
PSADSSFL EQU   PSA+836                                                  00650000
PSADSSF1 EQU   PSADSSFL                                                 00651000
PSADSSF3 EQU   PSADSSFL+2                                               00652000
PSADSSF4 EQU   PSADSSFL+3                                               00653000
PSARSVT  EQU   PSA+896                                                  00654000
CVTPTR   EQU   16                                                       00655000
ATCLCPTR EQU   1032                                                     00656000
ASCB     EQU   0                                                        00657000
ASCBSUPC EQU   ASCB+16                                                  00658000
ASCBFW1  EQU   ASCB+100                                                 00659000
ASCBRCTF EQU   ASCBFW1+2                                                00660000
ASCBFLG1 EQU   ASCBFW1+3                                                00661000
ASCBASXB EQU   ASCB+108                                                 00662000
ASCBDSP1 EQU   ASCB+114                                                 00663000
ASCBFLG2 EQU   ASCB+115                                                 00664000
ASCBLKGP EQU   ASCB+128                                                 00665000
ASCBSRQ  EQU   ASCB+180                                                 00666000
ASCBSRQ1 EQU   ASCBSRQ                                                  00667000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00668000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00669000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00670000
ASXB     EQU   0                                                        00671000
ASXBMPST EQU   ASXB+16                                                  00672000
ASXBAEQ  EQU   ASXB+168                                                 00673000
ASXBCASW EQU   ASXB+216                                                 00674000
ASXBCRB1 EQU   ASXBCASW                                                 00675000
SRBSECT  EQU   0                                                        00676000
SRBFLC   EQU   SRBSECT+12                                               00677000
CVTMAP   EQU   0                                                        00678000
CVTDAR   EQU   CVTMAP+72                                                00679000
CVTFLGS1 EQU   CVTDAR                                                   00680000
CVTDCB   EQU   CVTMAP+116                                               00681000
CVTIERLC EQU   CVTMAP+144                                               00682000
CVTOPTA  EQU   CVTMAP+182                                               00683000
CVTOPTB  EQU   CVTMAP+183                                               00684000
CVTGTF   EQU   CVTMAP+236                                               00685000
CVTGTFST EQU   CVTGTF                                                   00686000
CVTGTFS  EQU   CVTGTFST                                                 00687000
CVTSTATE EQU   CVTGTFST                                                 00688000
CVTTMODE EQU   CVTGTFST                                                 00689000
CVTFORM  EQU   CVTGTFST                                                 00690000
CVTAQAVT EQU   CVTMAP+240                                               00691000
CVTTCMFG EQU   CVTAQAVT                                                 00692000
CVTVOLM2 EQU   CVTMAP+244                                               00693000
CVTTATA  EQU   CVTVOLM2                                                 00694000
CVTTSKS  EQU   CVTTATA                                                  00695000
CVTVOLF2 EQU   CVTTSKS                                                  00696000
CVTTAT   EQU   CVTTATA+1                                                00697000
CVTATER  EQU   CVTMAP+248                                               00698000
CVTEXT1  EQU   CVTMAP+252                                               00699000
CVTPURG  EQU   CVTMAP+260                                               00700000
CVTQMSG  EQU   CVTMAP+268                                               00701000
CVTDMSR  EQU   CVTMAP+272                                               00702000
CVTRSV37 EQU   CVTDMSR                                                  00703000
CVTDMSRF EQU   CVTRSV37                                                 00704000
CVTERPV  EQU   CVTMAP+316                                               00705000
CVTINTLA EQU   CVTMAP+320                                               00706000
CVTAPF   EQU   CVTMAP+324                                               00707000
CVTEXT2  EQU   CVTMAP+328                                               00708000
CVTHJES  EQU   CVTMAP+332                                               00709000
CVTPGSIA EQU   CVTMAP+348                                               00710000
CVTA1F1  EQU   CVTMAP+356                                               00711000
CVTSYSK  EQU   CVTMAP+357                                               00712000
CVTVOLM1 EQU   CVTMAP+380                                               00713000
CVTVOLF1 EQU   CVTVOLM1                                                 00714000
CVTXTNT1 EQU   0                                                        00715000
CVTXTNT2 EQU   0                                                        00716000
CVTDSSV  EQU   CVTXTNT2                                                 00717000
CVTFLGBT EQU   CVTXTNT2+5                                               00718000
CVTQID   EQU   CVTXTNT2+24                                              00719000
CVTRV400 EQU   CVTXTNT2+52                                              00720000
CVTRV409 EQU   CVTXTNT2+53                                              00721000
CVTATCVT EQU   CVTXTNT2+64                                              00722000
CVTRV429 EQU   CVTXTNT2+84                                              00723000
CVTRV438 EQU   CVTXTNT2+85                                              00724000
CVTRV457 EQU   CVTXTNT2+112                                             00725000
CVTRV466 EQU   CVTXTNT2+113                                             00726000
CVTFIX   EQU   0                                                        00727000
CVTRELNO EQU   CVTFIX+252                                               00728000
ISTLOK   EQU   0                                                        00729000
LOKCHN   EQU   ISTLOK+1                                                 00730000
LOKCHNG  EQU   LOKCHN                                                   00731000
@NM00030 EQU   LOKCHNG+2                                                00732000
ISTPAB   EQU   0                                                        00733000
PABWQCHN EQU   ISTPAB                                                   00734000
PABWEQA  EQU   PABWQCHN                                                 00735000
PABCHAIN EQU   PABWQCHN+4                                               00736000
PABRUNNG EQU   PABCHAIN                                                 00737000
PABCHNGP EQU   PABCHAIN+1                                               00738000
PABOFFST EQU   ISTPAB+8                                                 00739000
PABRPHFG EQU   ISTPAB+12                                                00740000
PABFLAGS EQU   PABRPHFG                                                 00741000
PABDYNAM EQU   PABFLAGS                                                 00742000
PABERLCK EQU   PABFLAGS                                                 00743000
PABERRLK EQU   PABERLCK                                                 00744000
PABRPHA  EQU   PABRPHFG+1                                               00745000
PABEND   EQU   ISTPAB+16                                                00746000
ISTDYPAB EQU   0                                                        00747000
DYPCHAIN EQU   ISTDYPAB+4                                               00748000
DYPTSKID EQU   ISTDYPAB+8                                               00749000
DYPPACMD EQU   ISTDYPAB+12                                              00750000
DYPPAB   EQU   ISTDYPAB+16                                              00751000
ISTRPH   EQU   0                                                        00752000
RPHCNTL  EQU   ISTRPH                                                   00753000
RPHFLAGS EQU   RPHCNTL+2                                                00754000
RPHFSTLC EQU   RPHFLAGS                                                 00755000
RPHFLGB  EQU   RPHCNTL+3                                                00756000
RPHPGCMP EQU   RPHFLGB                                                  00757000
RPHRLCRA EQU   RPHFLGB                                                  00758000
RPHRPHA  EQU   ISTRPH+4                                                 00759000
RPHTSKID EQU   ISTRPH+8                                                 00760000
RPHRESMA EQU   ISTRPH+16                                                00761000
RPHWPFLG EQU   RPHRESMA                                                 00762000
RPHPABOF EQU   ISTRPH+20                                                00763000
RPHMAJCB EQU   ISTRPH+21                                                00764000
RPHWEA   EQU   ISTRPH+24                                                00765000
RPHCSPA  EQU   RPHWEA                                                   00766000
RPHSRPRM EQU   ISTRPH+28                                                00767000
RPHCRR   EQU   ISTRPH+32                                                00768000
RPHPABQA EQU   ISTRPH+36                                                00769000
RPHPABQP EQU   RPHPABQA+1                                               00770000
RPHWORK  EQU   ISTRPH+40                                                00771000
RPHSAVE1 EQU   RPHWORK                                                  00772000
RPHSBITS EQU   RPHSAVE1+1                                               00773000
ISTATCVT EQU   0                                                        00774000
ATCRPTCH EQU   ISTATCVT                                                 00775000
ATCITFLD EQU   ISTATCVT+8                                               00776000
ATCITCDS EQU   ATCITFLD+8                                               00777000
ATCITFLG EQU   ATCITCDS+4                                               00778000
ATCITRA1 EQU   ATCITFLG+2                                               00779000
ATCSMPAB EQU   ISTATCVT+88                                              00780000
ATCVDPAB EQU   ISTATCVT+152                                             00781000
ATCLDTIL EQU   ISTATCVT+408                                             00782000
ATCGTSTR EQU   ISTATCVT+608                                             00783000
ATCSMRS  EQU   ISTATCVT+624                                             00784000
ATCLUDVT EQU   ISTATCVT+768                                             00785000
ATCANYDT EQU   ISTATCVT+776                                             00786000
@NM00040 EQU   ISTATCVT+780                                             00787000
ATCPODVT EQU   ISTATCVT+804                                             00788000
ATCBPDA  EQU   ISTATCVT+856                                             00789000
ATCSTAT  EQU   ISTATCVT+936                                             00790000
ATCSTAT1 EQU   ATCSTAT                                                  00791000
ATCPOFLG EQU   ATCSTAT+2                                                00792000
ATCSTAT4 EQU   ATCSTAT+3                                                00793000
ATCBITAN EQU   ISTATCVT+940                                             00794000
ATCFLAG2 EQU   ATCBITAN+1                                               00795000
ATCONID  EQU   ISTATCVT+944                                             00796000
ATCSSCPA EQU   ISTATCVT+948                                             00797000
ATCHPGM  EQU   ISTATCVT+1012                                            00798000
ATCVLCNT EQU   ISTATCVT+1016                                            00799000
ATCRNO   EQU   ISTATCVT+1020                                            00800000
@NM00063 EQU   ISTATCVT+1028                                            00801000
ATCSHRFG EQU   @NM00063+8                                               00802000
ATCCPDVT EQU   ISTATCVT+1096                                            00803000
ATCSMSDQ EQU   ISTATCVT+1140                                            00804000
ATCRID   EQU   ISTATCVT+1152                                            00805000
ATCLDAPP EQU   ISTATCVT+1288                                            00806000
ATCCDTID EQU   ATCLDAPP                                                 00807000
ATCSQAFR EQU   ISTATCVT+1312                                            00808000
ATCORTCB EQU   ATCSQAFR+4                                               00809000
ATCORSRB EQU   ATCORTCB                                                 00810000
ATCICAPP EQU   ISTATCVT+1320                                            00811000
ATCDAPVT EQU   ISTATCVT+1340                                            00812000
ATCAP64  EQU   ISTATCVT+1424                                            00813000
ATCGSRBQ EQU   ISTATCVT+1472                                            00814000
ATCGSRBG EQU   ATCGSRBQ                                                 00815000
ATCENFLG EQU   ISTATCVT+1512                                            00816000
@NM00078 EQU   ISTATCVT+1575                                            00817000
ATCVTFLG EQU   ISTATCVT+1576                                            00818000
ATCZFLAG EQU   ISTATCVT+1696                                            00819000
ATCCRA   EQU   ISTATCVT+1720                                            00820000
ATCCRACN EQU   ATCCRA+4                                                 00821000
ATCSRB   EQU   ISTATCVT+1728                                            00822000
ATCSRBCN EQU   ATCSRB+4                                                 00823000
ATCCRPL  EQU   ISTATCVT+1736                                            00824000
ATCRPLCN EQU   ATCCRPL+4                                                00825000
ISTPFCRR EQU   0                                                        00826000
PFCCRR   EQU   ISTPFCRR                                                 00827000
PFCCRRID EQU   PFCCRR                                                   00828000
PFCCRRLN EQU   PFCCRR+2                                                 00829000
PFCHDR   EQU   ISTPFCRR+4                                               00830000
PFCCRRO  EQU   PFCHDR                                                   00831000
PFCFRRO  EQU   PFCHDR+4                                                 00832000
ISTAPCRR EQU   0                                                        00833000
APCHDRSV EQU   ISTAPCRR                                                 00834000
APCATFLG EQU   ISTAPCRR+16                                              00835000
APCRFLG  EQU   ISTAPCRR+18                                              00836000
APCPSTA  EQU   ISTAPCRR+20                                              00837000
APCRTRN  EQU   ISTAPCRR+28                                              00838000
APCAUT   EQU   APCRTRN                                                  00839000
APCSAVE  EQU   ISTAPCRR+44                                              00840000
APCCOMF  EQU   ISTAPCRR+116                                             00841000
APCCOMF1 EQU   APCCOMF                                                  00842000
APCSSTSK EQU   APCCOMF1                                                 00843000
APCUETSK EQU   APCCOMF1                                                 00844000
APC31FLG EQU   ISTAPCRR+132                                             00845000
APC52FLG EQU   ISTAPCRR+133                                             00846000
APC53FLG EQU   ISTAPCRR+134                                             00847000
APC54FLG EQU   ISTAPCRR+135                                             00848000
APC57FLG EQU   ISTAPCRR+136                                             00849000
ISTPST   EQU   0                                                        00850000
PSTRQFGA EQU   ISTPST+8                                                 00851000
PSTRQUE  EQU   PSTRQFGA                                                 00852000
PSTFLGA  EQU   PSTRQFGA+4                                               00853000
PSTABINP EQU   PSTFLGA                                                  00854000
PSTMPSTP EQU   ISTPST+20                                                00855000
PSTSMDYP EQU   ISTPST+64                                                00856000
PSTDMPS  EQU   ISTPST+132                                               00857000
ISTAVT   EQU   0                                                        00858000
ISTRETRG EQU   ISTAVT+44                                                00859000
ISTCFCRR EQU   0                                                        00860000
CFCAUDIT EQU   ISTCFCRR                                                 00861000
CFCNTRD  EQU   CFCAUDIT                                                 00862000
CFCCRT   EQU   CFCAUDIT+1                                               00863000
ISTDCCRR EQU   0                                                        00864000
CRRSPACE EQU   ISTDCCRR+12                                              00865000
CRRSAREA EQU   0                                                        00866000
CRRMAS   EQU   CRRSAREA+148                                             00867000
CRRMAS1  EQU   CRRMAS                                                   00868000
CRRMAS2  EQU   CRRMAS+1                                                 00869000
CRRMAS3  EQU   CRRMAS+2                                                 00870000
CRRMAS4  EQU   CRRMAS+3                                                 00871000
CRRRMAS1 EQU   CRRMAS+4                                                 00872000
CRRRMAS2 EQU   CRRMAS+5                                                 00873000
CRRRMAS3 EQU   CRRMAS+6                                                 00874000
CRRSMAS  EQU   CRRRMAS3                                                 00875000
CRRATS   EQU   CRRSAREA+156                                             00876000
CRRATS1  EQU   CRRATS                                                   00877000
CRRATS2  EQU   CRRATS+1                                                 00878000
CRRATS3  EQU   CRRATS+2                                                 00879000
CRRATS4  EQU   CRRATS+3                                                 00880000
CRRRATS1 EQU   CRRATS+4                                                 00881000
CRRRATS2 EQU   CRRATS+5                                                 00882000
CRRRATS3 EQU   CRRATS+6                                                 00883000
CRRSATS  EQU   CRRRATS3                                                 00884000
CRRFLGS1 EQU   CRRSAREA+164                                             00885000
CRRFLGS2 EQU   CRRSAREA+165                                             00886000
CRRFLGS3 EQU   CRRSAREA+166                                             00887000
CRRFLGS4 EQU   CRRSAREA+167                                             00888000
CRRFLGS  EQU   CRRSAREA+168                                             00889000
CRRRFLG1 EQU   CRRSAREA+169                                             00890000
CRRRTYPE EQU   CRRRFLG1                                                 00891000
CRRFDBK1 EQU   CRRSAREA+170                                             00892000
CRRFDB2  EQU   CRRFDBK1+1                                               00893000
CRRFDB3  EQU   CRRFDBK1+2                                               00894000
CRRFDBK2 EQU   CRRSAREA+176                                             00895000
CRRDSB   EQU   CRRFDBK2                                                 00896000
CRRESR   EQU   CRRFDBK2+2                                               00897000
CRRTRBUF EQU   CRRSAREA+204                                             00898000
CRRBFLGS EQU   CRRSAREA+280                                             00899000
ISTASCRR EQU   0                                                        00900000
ASCFLAGS EQU   ISTASCRR+16                                              00901000
ASCFLG1  EQU   ASCFLAGS                                                 00902000
ASCFLG2  EQU   ASCFLAGS+2                                               00903000
ASCFLG3  EQU   ASCFLAGS+4                                               00904000
ASCUSRGS EQU   ISTASCRR+28                                              00905000
ISTCRA   EQU   0                                                        00906000
CRABASIC EQU   ISTCRA                                                   00907000
CRAHDR   EQU   CRABASIC                                                 00908000
CRACRR   EQU   CRAHDR                                                   00909000
CRALKACT EQU   CRABASIC+8                                               00910000
CRARPH   EQU   ISTCRA+52                                                00911000
CRAPSS   EQU   ISTCRA+160                                               00912000
CRAPROCR EQU   ISTCRA+312                                               00913000
CRASVC   EQU   ISTCRA+924                                               00914000
CRABUFA  EQU   CRASVC+68                                                00915000
CRARSV01 EQU   ISTCRA+996                                               00916000
CRARSV02 EQU   ISTCRA+1000                                              00917000
CRAIDS   EQU   ISTCRA+1004                                              00918000
CRACHAIN EQU   ISTCRA+1012                                              00919000
ISTMPST  EQU   0                                                        00920000
MPSRSV07 EQU   ISTMPST+4                                                00921000
MPSRQFGA EQU   ISTMPST+8                                                00922000
MPSRQUE  EQU   MPSRQFGA                                                 00923000
MPSFLGA  EQU   MPSRQFGA+4                                               00924000
MPSFLGAA EQU   MPSFLGA                                                  00925000
MPSFLGAB EQU   MPSFLGA+1                                                00926000
MPSCRA   EQU   ISTMPST+24                                               00927000
MPSCRACT EQU   MPSCRA+4                                                 00928000
MPSSRB   EQU   ISTMPST+32                                               00929000
MPSSRBCT EQU   MPSSRB+4                                                 00930000
MPSCRPL  EQU   ISTMPST+40                                               00931000
MPSRPLCT EQU   MPSCRPL+4                                                00932000
ISTMPLT  EQU   0                                                        00933000
MPLCDS   EQU   ISTMPLT+16                                               00934000
MPLFLGS1 EQU   MPLCDS+6                                                 00935000
ISTAPC64 EQU   0                                                        00936000
FMZL0006 EQU   0                                                        00937000
ISTXDYP  EQU   0                                                        00938000
ISTXPAB  EQU   0                                                        00939000
LCPBPTR  EQU   0                                                        00940000
ASCBPTR  EQU   PSAAOLD                                                  00941000
ASXBPTR  EQU   ASCBASXB                                                 00942000
PSARSVTE EQU   PSARSVT                                                  00943000
CVTS01   EQU   CVTPGSIA                                                 00944000
CVTLPDIA EQU   CVTS01+12                                                00945000
CVTDIRST EQU   CVTLPDIA                                                 00946000
CVTSLIDA EQU   CVTS01+24                                                00947000
CVTCTLFG EQU   CVTS01+50                                                00948000
CVTSRBRT EQU   CVTS01+100                                               00949000
CVTRV210 EQU   CVTS01+424                                               00950000
CVTRV219 EQU   CVTS01+425                                               00951000
CVTRV228 EQU   CVTS01+426                                               00952000
CVTRV237 EQU   CVTS01+427                                               00953000
CVTMFRTR EQU   CVTS01+452                                               00954000
CVTRV262 EQU   CVTS01+468                                               00955000
CVTRV271 EQU   CVTS01+469                                               00956000
CVTRV280 EQU   CVTS01+470                                               00957000
CVTRV289 EQU   CVTS01+471                                               00958000
CVTGSDA  EQU   CVTS01+600                                               00959000
PABXTNSN EQU   PABEND                                                   00960000
@NM00106 EQU   CRAPROCR                                                 00961000
RCOVPAB  EQU   CRAPROCR                                                 00962000
CRACFCRR EQU   CRAPROCR                                                 00963000
FLC      EQU   PSA                                                      00964000
SRB      EQU   SRBSECT                                                  00965000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00966000
CRACRRSA EQU   @NM00106+12                                              00967000
@NM00107 EQU   @NM00106                                                 00968000
@NM00032 EQU   PABXTNSN+12                                              00969000
PABNPSSQ EQU   PABXTNSN+8                                               00970000
PABLOCK  EQU   PABXTNSN+4                                               00971000
PABLAST  EQU   PABXTNSN                                                 00972000
CVTRV628 EQU   CVTS01+728                                               00973000
CVTRV627 EQU   CVTS01+724                                               00974000
CVTRV626 EQU   CVTS01+720                                               00975000
CVTRV625 EQU   CVTS01+716                                               00976000
CVTRV624 EQU   CVTS01+712                                               00977000
CVTRV623 EQU   CVTS01+708                                               00978000
CVTRV622 EQU   CVTS01+704                                               00979000
CVTRV621 EQU   CVTS01+700                                               00980000
CVTIHASU EQU   CVTS01+696                                               00981000
CVTSUSP  EQU   CVTS01+692                                               00982000
CVTT6SVC EQU   CVTS01+688                                               00983000
CVTCDAL  EQU   CVTS01+684                                               00984000
CVTTCTL  EQU   CVTS01+680                                               00985000
CVTRSUME EQU   CVTS01+676                                               00986000
CVTJTERM EQU   CVTS01+672                                               00987000
CVTASMRM EQU   CVTS01+668                                               00988000
CVTTCASP EQU   CVTS01+664                                               00989000
CVT0PT03 EQU   CVTS01+660                                               00990000
CVT0PT0E EQU   CVTS01+656                                               00991000
CVTRV609 EQU   CVTS01+652                                               00992000
CVTCGK   EQU   CVTS01+648                                               00993000
CVTRAC   EQU   CVTS01+644                                               00994000
CVTRV606 EQU   CVTS01+640                                               00995000
CVTRV605 EQU   CVTS01+636                                               00996000
CVTRV604 EQU   CVTS01+632                                               00997000
CVTEFF02 EQU   CVTS01+628                                               00998000
CVTCBBR  EQU   CVTS01+624                                               00999000
CVTSSCR  EQU   CVTS01+620                                               01000000
CVTEVENT EQU   CVTS01+616                                               01001000
CVTCRCA  EQU   CVTS01+612                                               01002000
CVTTPIO  EQU   CVTS01+608                                               01003000
CVTADV   EQU   CVTS01+604                                               01004000
CVTGSDAB EQU   CVTGSDA                                                  01005000
CVTQV3   EQU   CVTS01+596                                               01006000
CVTQV2   EQU   CVTS01+592                                               01007000
CVTQV1   EQU   CVTS01+588                                               01008000
CVTRPT   EQU   CVTS01+584                                               01009000
CVTSSRB  EQU   CVTS01+580                                               01010000
CVTCSDRL EQU   CVTS01+576                                               01011000
CVTEXP1  EQU   CVTS01+572                                               01012000
CVTRMPMT EQU   CVTS01+568                                               01013000
CVTRMPTT EQU   CVTS01+564                                               01014000
CVTVPSA  EQU   CVTS01+560                                               01015000
CVTVSTOP EQU   CVTS01+556                                               01016000
CVTGTFR8 EQU   CVTS01+552                                               01017000
CVTQUIT  EQU   CVTS01+548                                               01018000
CVTVACR  EQU   CVTS01+544                                               01019000
CVTWTCB  EQU   CVTS01+540                                               01020000
CVTSTPRS EQU   CVTS01+536                                               01021000
CVT0PT02 EQU   CVTS01+532                                               01022000
CVTDARCM EQU   CVTS01+528                                               01023000
CVTIRECM EQU   CVTS01+524                                               01024000
CVTJRECM EQU   CVTS01+520                                               01025000
CVTVEMS0 EQU   CVTS01+516                                               01026000
CVTSPFRR EQU   CVTS01+512                                               01027000
CVTRLSTG EQU   CVTS01+508                                               01028000
CVT0TC0A EQU   CVTS01+504                                               01029000
CVTGMBR  EQU   CVTS01+500                                               01030000
CVTLFRM  EQU   CVTS01+496                                               01031000
CVTRMBR  EQU   CVTS01+492                                               01032000
CVTVIOP  EQU   CVTS01+488                                               01033000
CVTRV307 EQU   CVTS01+486                                               01034000
CVTRV306 EQU   CVTS01+484                                               01035000
CVTRV305 EQU   CVTS01+482                                               01036000
CVTRV304 EQU   CVTS01+480                                               01037000
CVTRV303 EQU   CVTS01+478                                               01038000
CVTRV302 EQU   CVTS01+476                                               01039000
CVTTRCA  EQU   CVTS01+472                                               01040000
CVTRV297 EQU   CVTRV289                                                 01041000
CVTRV296 EQU   CVTRV289                                                 01042000
CVTRV295 EQU   CVTRV289                                                 01043000
CVTRV294 EQU   CVTRV289                                                 01044000
CVTRV293 EQU   CVTRV289                                                 01045000
CVTRV292 EQU   CVTRV289                                                 01046000
CVTRV291 EQU   CVTRV289                                                 01047000
CVTRV290 EQU   CVTRV289                                                 01048000
CVTRV288 EQU   CVTRV280                                                 01049000
CVTRV287 EQU   CVTRV280                                                 01050000
CVTRV286 EQU   CVTRV280                                                 01051000
CVTRV285 EQU   CVTRV280                                                 01052000
CVTRV284 EQU   CVTRV280                                                 01053000
CVTRV283 EQU   CVTRV280                                                 01054000
CVTRV282 EQU   CVTRV280                                                 01055000
CVTRV281 EQU   CVTRV280                                                 01056000
CVTRV279 EQU   CVTRV271                                                 01057000
CVTRV278 EQU   CVTRV271                                                 01058000
CVTRV277 EQU   CVTRV271                                                 01059000
CVTRV276 EQU   CVTRV271                                                 01060000
CVTRV275 EQU   CVTRV271                                                 01061000
CVTRV274 EQU   CVTRV271                                                 01062000
CVTRV273 EQU   CVTRV271                                                 01063000
CVTRV272 EQU   CVTRV271                                                 01064000
CVTRV270 EQU   CVTRV262                                                 01065000
CVTRV269 EQU   CVTRV262                                                 01066000
CVTRV268 EQU   CVTRV262                                                 01067000
CVTRV267 EQU   CVTRV262                                                 01068000
CVTRV266 EQU   CVTRV262                                                 01069000
CVTRV265 EQU   CVTRV262                                                 01070000
CVTRV264 EQU   CVTRV262                                                 01071000
CVTRV263 EQU   CVTRV262                                                 01072000
CVTVFP   EQU   CVTS01+464                                               01073000
CVTVSI   EQU   CVTS01+460                                               01074000
CVTVPSIB EQU   CVTS01+456                                               01075000
CVTMFACT EQU   CVTMFRTR                                                 01076000
CVTMFCTL EQU   CVTS01+448                                               01077000
CVTPVBP  EQU   CVTS01+444                                               01078000
CVTPWI   EQU   CVTS01+440                                               01079000
CVTRV254 EQU   CVTS01+438                                               01080000
CVTRV253 EQU   CVTS01+436                                               01081000
CVTRV252 EQU   CVTS01+434                                               01082000
CVTRV251 EQU   CVTS01+433                                               01083000
CVTRV250 EQU   CVTS01+432                                               01084000
CVTRV249 EQU   CVTS01+431                                               01085000
CVTRV248 EQU   CVTS01+430                                               01086000
CVTRV247 EQU   CVTS01+429                                               01087000
CVTRV246 EQU   CVTS01+428                                               01088000
CVTRV245 EQU   CVTRV237                                                 01089000
CVTRV244 EQU   CVTRV237                                                 01090000
CVTRV243 EQU   CVTRV237                                                 01091000
CVTRV242 EQU   CVTRV237                                                 01092000
CVTRV241 EQU   CVTRV237                                                 01093000
CVTRV240 EQU   CVTRV237                                                 01094000
CVTRV239 EQU   CVTRV237                                                 01095000
CVTRV238 EQU   CVTRV237                                                 01096000
CVTRV236 EQU   CVTRV228                                                 01097000
CVTRV235 EQU   CVTRV228                                                 01098000
CVTRV234 EQU   CVTRV228                                                 01099000
CVTRV233 EQU   CVTRV228                                                 01100000
CVTRV232 EQU   CVTRV228                                                 01101000
CVTRV231 EQU   CVTRV228                                                 01102000
CVTRV230 EQU   CVTRV228                                                 01103000
CVTRV229 EQU   CVTRV228                                                 01104000
CVTRV227 EQU   CVTRV219                                                 01105000
CVTRV226 EQU   CVTRV219                                                 01106000
CVTRV225 EQU   CVTRV219                                                 01107000
CVTRV224 EQU   CVTRV219                                                 01108000
CVTRV223 EQU   CVTRV219                                                 01109000
CVTRV222 EQU   CVTRV219                                                 01110000
CVTRV221 EQU   CVTRV219                                                 01111000
CVTRV220 EQU   CVTRV219                                                 01112000
CVTRV218 EQU   CVTRV210                                                 01113000
CVTRV217 EQU   CVTRV210                                                 01114000
CVTRV216 EQU   CVTRV210                                                 01115000
CVTRV215 EQU   CVTRV210                                                 01116000
CVTRV214 EQU   CVTRV210                                                 01117000
CVTRV213 EQU   CVTRV210                                                 01118000
CVTRV212 EQU   CVTRV210                                                 01119000
CVTRV211 EQU   CVTRV210                                                 01120000
CVTLCCAT EQU   CVTS01+420                                               01121000
CVTPCCAT EQU   CVTS01+416                                               01122000
CVTIPCRP EQU   CVTS01+412                                               01123000
CVTIPCRI EQU   CVTS01+408                                               01124000
CVTIPCDS EQU   CVTS01+404                                               01125000
CVTAIDVT EQU   CVTS01+400                                               01126000
CVTSSAP  EQU   CVTS01+396                                               01127000
CVTEHCIR EQU   CVTS01+392                                               01128000
CVTEHDEF EQU   CVTS01+388                                               01129000
CVTDAIR  EQU   CVTS01+384                                               01130000
CVTPERFM EQU   CVTS01+380                                               01131000
CVT044R2 EQU   CVTS01+376                                               01132000
CVTFETCH EQU   CVTS01+372                                               01133000
CVTRSTWD EQU   CVTS01+368                                               01134000
CVTSPOST EQU   CVTS01+364                                               01135000
CVTIOBP  EQU   CVTS01+360                                               01136000
CVTASMVT EQU   CVTS01+356                                               01137000
CVTRECRQ EQU   CVTS01+352                                               01138000
CVTWSAC  EQU   CVTS01+348                                               01139000
CVTRV149 EQU   CVTS01+344                                               01140000
CVTWSAL  EQU   CVTS01+340                                               01141000
CVTSPSA  EQU   CVTS01+336                                               01142000
CVTGLMN  EQU   CVTS01+332                                               01143000
CVTVEAC0 EQU   CVTS01+328                                               01144000
CVT062R1 EQU   CVTS01+324                                               01145000
CVTRPOST EQU   CVTS01+320                                               01146000
CVTDQIQE EQU   CVTS01+316                                               01147000
CVTCSD   EQU   CVTS01+312                                               01148000
CVTLKRMA EQU   CVTS01+308                                               01149000
CVTRSPIE EQU   CVTS01+304                                               01150000
CVTRENQ  EQU   CVTS01+300                                               01151000
CVTLQCB  EQU   CVTS01+296                                               01152000
CVTFQCB  EQU   CVTS01+292                                               01153000
CVTQCS01 EQU   CVTS01+288                                               01154000
CVTAPFT  EQU   CVTS01+284                                               01155000
CVTPARRL EQU   CVTS01+280                                               01156000
CVTVWAIT EQU   CVTS01+276                                               01157000
CVTGSPL  EQU   CVTS01+272                                               01158000
CVTLSMQ  EQU   CVTS01+268                                               01159000
CVTGSMQ  EQU   CVTS01+264                                               01160000
CVTEXPRO EQU   CVTS01+260                                               01161000
CVTOPCTP EQU   CVTS01+256                                               01162000
CVTSIC   EQU   CVTS01+252                                               01163000
CVTTPIOS EQU   CVTS01+248                                               01164000
CVTRTMS  EQU   CVTS01+244                                               01165000
CVTSDBF  EQU   CVTS01+240                                               01166000
CVTSCBP  EQU   CVTS01+236                                               01167000
CVTSDMP  EQU   CVTS01+232                                               01168000
CVTSV60  EQU   CVTS01+228                                               01169000
CVTRTMCT EQU   CVTS01+224                                               01170000
CVTASCBL EQU   CVTS01+220                                               01171000
CVTASCBH EQU   CVTS01+216                                               01172000
CVTGDA   EQU   CVTS01+212                                               01173000
CVTASVT  EQU   CVTS01+208                                               01174000
CVTVVMDI EQU   CVTS01+204                                               01175000
CVTAQTOP EQU   CVTS01+200                                               01176000
CVTIOSCS EQU   CVTS01+196                                               01177000
CVTSDRM  EQU   CVTS01+192                                               01178000
CVTOPTE  EQU   CVTS01+188                                               01179000
CVTSTXU  EQU   CVTS01+184                                               01180000
CVTQUIS  EQU   CVTS01+180                                               01181000
CVTPARS  EQU   CVTS01+176                                               01182000
CVTS1EE  EQU   CVTS01+172                                               01183000
CVTFRAS  EQU   CVTS01+168                                               01184000
CVTQSAS  EQU   CVTS01+164                                               01185000
CVTCRAS  EQU   CVTS01+160                                               01186000
CVTCRMN  EQU   CVTS01+156                                               01187000
CVTDELCP EQU   CVTS01+152                                               01188000
CVTFRECL EQU   CVTS01+148                                               01189000
CVTGETCL EQU   CVTS01+144                                               01190000
CVTBLDCP EQU   CVTS01+140                                               01191000
CVTAUTHL EQU   CVTS01+136                                               01192000
CVTSCAN  EQU   CVTS01+132                                               01193000
CVTRV144 EQU   CVTS01+130                                               01194000
CVTMAXMP EQU   CVTS01+128                                               01195000
CVTSTCK  EQU   CVTS01+124                                               01196000
CVTRV139 EQU   CVTS01+123                                               01197000
CVTDSSAC EQU   CVTS01+122                                               01198000
CVTRV513 EQU   CVTS01+121                                               01199000
CVTIOSPL EQU   CVTS01+120                                               01200000
CVTPTGT  EQU   CVTS01+116                                               01201000
CVTCSPIE EQU   CVTS01+112                                               01202000
CVTSMFEX EQU   CVTS01+108                                               01203000
CVTOLT0A EQU   CVTS01+104                                               01204000
CVTPUTL  EQU   CVTS01+96                                                01205000
CVTASCRL EQU   CVTS01+92                                                01206000
CVTASCRF EQU   CVTS01+88                                                01207000
CVTRV326 EQU   CVTS01+84                                                01208000
CVTRV325 EQU   CVTS01+80                                                01209000
CVTRV324 EQU   CVTS01+76                                                01210000
CVT0VL01 EQU   CVTS01+72                                                01211000
CVTSHRVM EQU   CVTS01+68                                                01212000
CVTRV332 EQU   CVTS01+64                                                01213000
CVTTAS   EQU   CVTS01+60                                                01214000
CVTRSCN  EQU   CVTS01+56                                                01215000
CVTTRAC2 EQU   CVTS01+54                                                01216000
CVTTRACE EQU   CVTS01+52                                                01217000
CVTAPG   EQU   CVTS01+51                                                01218000
CVTSDTRC EQU   CVTCTLFG                                                 01219000
CVTGTRCE EQU   CVTCTLFG                                                 01220000
CVTNOMP  EQU   CVTCTLFG                                                 01221000
CVTRSV79 EQU   CVTCTLFG                                                 01222000
CVTDSTAT EQU   CVTCTLFG                                                 01223000
CVTRSV78 EQU   CVTCTLFG                                                 01224000
CVTRV333 EQU   CVTCTLFG                                                 01225000
CVTRV323 EQU   CVTCTLFG                                                 01226000
CVTSPVLK EQU   CVTS01+49                                                01227000
CVTRSV77 EQU   CVTS01+48                                                01228000
CVTRV331 EQU   CVTS01+44                                                01229000
CVTRV330 EQU   CVTS01+40                                                01230000
CVTRV329 EQU   CVTS01+36                                                01231000
CVTRV328 EQU   CVTS01+32                                                01232000
CVTRV322 EQU   CVTS01+28                                                01233000
CVTSLID  EQU   CVTSLIDA+1                                               01234000
CVTSYLK  EQU   CVTSLIDA                                                 01235000
CVTRV321 EQU   CVTS01+20                                                01236000
CVTRV320 EQU   CVTS01+16                                                01237000
CVTLPDIR EQU   CVTLPDIA+1                                               01238000
CVTRSV69 EQU   CVTDIRST                                                 01239000
CVTRSV68 EQU   CVTDIRST                                                 01240000
CVTRSV67 EQU   CVTDIRST                                                 01241000
CVTRSV66 EQU   CVTDIRST                                                 01242000
CVTRSV65 EQU   CVTDIRST                                                 01243000
CVTRSV64 EQU   CVTDIRST                                                 01244000
CVTRSV63 EQU   CVTDIRST                                                 01245000
CVTDICOM EQU   CVTDIRST                                                 01246000
CVTPVTP  EQU   CVTS01+8                                                 01247000
CVTLPDSR EQU   CVTS01+4                                                 01248000
CVTGETL  EQU   CVTS01                                                   01249000
PSARSAV  EQU   PSARSVTE+60                                              01250000
PSARSTK  EQU   PSARSVTE+56                                              01251000
PSAESAV3 EQU   PSARSVTE+52                                              01252000
PSAESTK3 EQU   PSARSVTE+48                                              01253000
PSAESAV2 EQU   PSARSVTE+44                                              01254000
PSAESTK2 EQU   PSARSVTE+40                                              01255000
PSAESAV1 EQU   PSARSVTE+36                                              01256000
PSAESTK1 EQU   PSARSVTE+32                                              01257000
PSAPSAV  EQU   PSARSVTE+28                                              01258000
PSAPSTK  EQU   PSARSVTE+24                                              01259000
PSAMSAV  EQU   PSARSVTE+20                                              01260000
PSAMSTK  EQU   PSARSVTE+16                                              01261000
PSASSAV  EQU   PSARSVTE+12                                              01262000
PSASSTK  EQU   PSARSVTE+8                                               01263000
PSANSTK  EQU   PSARSVTE+4                                               01264000
PSACSTK  EQU   PSARSVTE                                                 01265000
MPLRSVD5 EQU   MPLCDS+7                                                 01266000
MPLRSVD4 EQU   MPLFLGS1                                                 01267000
MPLASID  EQU   MPLCDS+4                                                 01268000
MPLADDR  EQU   MPLCDS                                                   01269000
MPLRSVD2 EQU   ISTMPLT+12                                               01270000
MPLRSVD1 EQU   ISTMPLT+10                                               01271000
MPLECNT  EQU   ISTMPLT+8                                                01272000
MPLID    EQU   ISTMPLT+4                                                01273000
MPLCHN   EQU   ISTMPLT                                                  01274000
MPSSRB1  EQU   ISTMPST+172                                              01275000
MPSSAVE  EQU   ISTMPST+140                                              01276000
MPSMQLBP EQU   ISTMPST+136                                              01277000
MPSSYSRT EQU   ISTMPST+132                                              01278000
MPSQEL   EQU   ISTMPST+128                                              01279000
MPSDBTBL EQU   ISTMPST+124                                              01280000
MPSASCB  EQU   ISTMPST+120                                              01281000
MPSTPPAB EQU   ISTMPST+88                                               01282000
MPSSMPAB EQU   ISTMPST+56                                               01283000
MPSSMRPH EQU   ISTMPST+52                                               01284000
MPSSRB55 EQU   ISTMPST+48                                               01285000
MPSRPLAC EQU   MPSRPLCT+2                                               01286000
MPSRPLRC EQU   MPSRPLCT                                                 01287000
MPSCRPLQ EQU   MPSCRPL                                                  01288000
MPSSRBAC EQU   MPSSRBCT+2                                               01289000
MPSSRBRC EQU   MPSSRBCT                                                 01290000
MPSSRBQ  EQU   MPSSRB                                                   01291000
MPSCRAAC EQU   MPSCRACT+2                                               01292000
MPSCRARC EQU   MPSCRACT                                                 01293000
MPSCRAQ  EQU   MPSCRA                                                   01294000
MPSMPSTP EQU   ISTMPST+20                                               01295000
MPSPSTCT EQU   ISTMPST+16                                               01296000
MPSASID  EQU   MPSFLGA+2                                                01297000
MPSRMGOC EQU   MPSFLGAB                                                 01298000
MPSPSTAB EQU   MPSFLGAA                                                 01299000
MPSRSV01 EQU   MPSFLGAA                                                 01300000
MPSTPBU  EQU   MPSFLGAA                                                 01301000
MPMEMTRM EQU   MPSFLGAA                                                 01302000
MPSAUTH  EQU   MPSFLGAA                                                 01303000
MPSCRAO  EQU   MPSFLGAA                                                 01304000
MPSSRBO  EQU   MPSFLGAA                                                 01305000
MPSRQUEG EQU   MPSRQUE                                                  01306000
MPSTSOIR EQU   MPSRSV07                                                 01307000
MPSTSOIW EQU   MPSRSV07                                                 01308000
MPSID    EQU   ISTMPST                                                  01309000
CRAID    EQU   CRAIDS+4                                                 01310000
CRAASID  EQU   CRAIDS+2                                                 01311000
@NM00105 EQU   CRAIDS                                                   01312000
CRABFTBA EQU   CRABUFA                                                  01313000
CRAMASK  EQU   CRASVC+64                                                01314000
CRAHSIZ  EQU   CRASVC+60                                                01315000
CRAASCRR EQU   CRASVC                                                   01316000
@NM00104 EQU   CRAPROCR                                                 01317000
CRALAPTR EQU   CRABASIC+48                                              01318000
CRAL9PTR EQU   CRABASIC+44                                              01319000
CRAL8PTR EQU   CRABASIC+40                                              01320000
CRAL7PTR EQU   CRABASIC+36                                              01321000
CRAL6PTR EQU   CRABASIC+32                                              01322000
CRAL5PTR EQU   CRABASIC+28                                              01323000
CRAL4PTR EQU   CRABASIC+24                                              01324000
CRAL3PTR EQU   CRABASIC+20                                              01325000
CRAL2PTR EQU   CRABASIC+16                                              01326000
CRAL1PTR EQU   CRABASIC+12                                              01327000
CRALEV01 EQU   CRALKACT+3                                               01328000
CRALEV02 EQU   CRALKACT+3                                               01329000
CRALEV03 EQU   CRALKACT+3                                               01330000
CRALEV04 EQU   CRALKACT+3                                               01331000
CRALEV05 EQU   CRALKACT+3                                               01332000
CRALEV06 EQU   CRALKACT+3                                               01333000
CRALEV07 EQU   CRALKACT+3                                               01334000
CRALEV08 EQU   CRALKACT+3                                               01335000
CRALEV09 EQU   CRALKACT+2                                               01336000
CRALEV10 EQU   CRALKACT+2                                               01337000
CRALEV11 EQU   CRALKACT+2                                               01338000
CRALEV12 EQU   CRALKACT+2                                               01339000
CRALEV13 EQU   CRALKACT+2                                               01340000
CRALEV14 EQU   CRALKACT+2                                               01341000
CRALEV15 EQU   CRALKACT+2                                               01342000
CRALEV16 EQU   CRALKACT+2                                               01343000
CRALEV17 EQU   CRALKACT+1                                               01344000
CRALEV18 EQU   CRALKACT+1                                               01345000
CRALEV19 EQU   CRALKACT+1                                               01346000
CRALEV20 EQU   CRALKACT+1                                               01347000
CRALEV21 EQU   CRALKACT+1                                               01348000
CRALEV22 EQU   CRALKACT+1                                               01349000
CRALEV23 EQU   CRALKACT+1                                               01350000
CRALEV24 EQU   CRALKACT+1                                               01351000
CRALEV25 EQU   CRALKACT                                                 01352000
CRALEV26 EQU   CRALKACT                                                 01353000
CRALEV27 EQU   CRALKACT                                                 01354000
CRALEV28 EQU   CRALKACT                                                 01355000
CRALEV29 EQU   CRALKACT                                                 01356000
CRALEV30 EQU   CRALKACT                                                 01357000
CRALEV31 EQU   CRALKACT                                                 01358000
CRALEV32 EQU   CRALKACT                                                 01359000
CRAFRR   EQU   CRAHDR+4                                                 01360000
ASCPSREG EQU   ISTASCRR+44                                              01361000
ASCUSR01 EQU   ASCUSRGS+12                                              01362000
ASCUSR00 EQU   ASCUSRGS+8                                               01363000
ASCUSR15 EQU   ASCUSRGS+4                                               01364000
ASCUSR14 EQU   ASCUSRGS                                                 01365000
ASCETRYA EQU   ISTASCRR+24                                              01366000
ASCKEY   EQU   ISTASCRR+23                                              01367000
ASCAUDIT EQU   ASCFLG3                                                  01368000
ASCFBDUD EQU   ASCFLG3                                                  01369000
ASCLLKF  EQU   ASCFLG3                                                  01370000
ASCKEYF  EQU   ASCFLG3                                                  01371000
ASCFBDAL EQU   ASCFLG3                                                  01372000
ASCFSRGT EQU   ASCFLG3                                                  01373000
ASCICR   EQU   ASCFLG2                                                  01374000
ASCFSRIC EQU   ASCFLG2                                                  01375000
ASCFBDIC EQU   ASCFLG2                                                  01376000
ASCFBAIC EQU   ASCFLG2                                                  01377000
ASCPASTR EQU   ASCFLG1                                                  01378000
ASCFSR   EQU   ASCFLG1                                                  01379000
ASCFBD   EQU   ASCFLG1                                                  01380000
ASCFBA   EQU   ASCFLG1                                                  01381000
ASCPFCRR EQU   ISTASCRR                                                 01382000
CRRRVPT5 EQU   CRRSAREA+316                                             01383000
CRRRVPT4 EQU   CRRSAREA+312                                             01384000
CRRRVPT3 EQU   CRRSAREA+308                                             01385000
CRRRVPT2 EQU   CRRSAREA+304                                             01386000
CRRRVPT1 EQU   CRRSAREA+300                                             01387000
CRRRVCR2 EQU   CRRSAREA+296                                             01388000
CRRCID   EQU   CRRSAREA+292                                             01389000
CRRRVCR1 EQU   CRRSAREA+291                                             01390000
CRRXFNCD EQU   CRRSAREA+290                                             01391000
CRRLDOCT EQU   CRRSAREA+288                                             01392000
CRRBTLEN EQU   CRRSAREA+284                                             01393000
CRRBLEN  EQU   CRRSAREA+282                                             01394000
CRRBRTCD EQU   CRRSAREA+281                                             01395000
@NM00103 EQU   CRRBFLGS                                                 01396000
CRRBFLG1 EQU   CRRBFLGS                                                 01397000
CRRBLDAD EQU   CRRSAREA+276                                             01398000
CRRBARAD EQU   CRRSAREA+272                                             01399000
CRRRTN12 EQU   CRRSAREA+268                                             01400000
CRRRTN11 EQU   CRRSAREA+264                                             01401000
CRRRTN10 EQU   CRRSAREA+260                                             01402000
CRRRTN9  EQU   CRRSAREA+256                                             01403000
CRRRTN8  EQU   CRRSAREA+252                                             01404000
CRRRTN7  EQU   CRRSAREA+248                                             01405000
CRRRTN6  EQU   CRRSAREA+244                                             01406000
CRRRTN5  EQU   CRRSAREA+240                                             01407000
CRRRTN4  EQU   CRRSAREA+236                                             01408000
CRRRTN3  EQU   CRRSAREA+232                                             01409000
CRRRTN2  EQU   CRRSAREA+228                                             01410000
CRRRTN1  EQU   CRRSAREA+224                                             01411000
CRRRES1  EQU   CRRSAREA+222                                             01412000
CRRLCNT  EQU   CRRSAREA+220                                             01413000
CRRATCVT EQU   CRRSAREA+216                                             01414000
CRRVALCK EQU   CRRSAREA+212                                             01415000
CRRARPL  EQU   CRRTRBUF+4                                               01416000
CRRBIND  EQU   CRRTRBUF+3                                               01417000
CRRTRRES EQU   CRRTRBUF                                                 01418000
CRRCLDO  EQU   CRRSAREA+200                                             01419000
CRRUECB  EQU   CRRSAREA+196                                             01420000
CRRLCPB  EQU   CRRSAREA+192                                             01421000
CRRCMDAD EQU   CRRSAREA+188                                             01422000
CRRFMCB  EQU   CRRSAREA+184                                             01423000
CRRCLCCW EQU   CRRSAREA+180                                             01424000
CRRESR2  EQU   CRRESR+1                                                 01425000
CRRESR1  EQU   CRRESR                                                   01426000
CRRDSB2  EQU   CRRDSB+1                                                 01427000
CRRDSB1  EQU   CRRDSB                                                   01428000
CRRDTACT EQU   CRRSAREA+174                                             01429000
CRRRSV99 EQU   CRRSAREA+173                                             01430000
CRRRDSOH EQU   CRRFDB3                                                  01431000
CRRRLG   EQU   CRRFDB3                                                  01432000
CRRLGFRC EQU   CRRFDB3                                                  01433000
CRRRDEOT EQU   CRRFDB3                                                  01434000
CRRRDEOM EQU   CRRFDB3                                                  01435000
CRRRDEOB EQU   CRRFDB3                                                  01436000
CRRUNUSD EQU   CRRFDB3                                                  01437000
CRRUINPT EQU   CRRFDB3                                                  01438000
CRRSTSAV EQU   CRRFDB2                                                  01439000
CRRCUERR EQU   CRRFDB2                                                  01440000
CRRDLGFL EQU   CRRFDB2                                                  01441000
CRRIOERR EQU   CRRFDB2                                                  01442000
CRRDVUNS EQU   CRRFDB2                                                  01443000
CRRATND  EQU   CRRFDB2                                                  01444000
CRRRVID  EQU   CRRFDB2                                                  01445000
CRRERLK  EQU   CRRFDB2                                                  01446000
CRRRTNCD EQU   CRRFDBK1                                                 01447000
CRRNSNA  EQU   CRRRTYPE                                                 01448000
CRRDFSYN EQU   CRRRTYPE                                                 01449000
CRRRESP  EQU   CRRRTYPE                                                 01450000
CRRDFASY EQU   CRRRTYPE                                                 01451000
CRRDBLCK EQU   CRRRFLG1                                                 01452000
CRRRPSBD EQU   CRRRFLG1                                                 01453000
CRRRPLOQ EQU   CRRRFLG1                                                 01454000
CRRRPLS  EQU   CRRRFLG1                                                 01455000
CRRSW7   EQU   CRRFLGS                                                  01456000
CRRSW6   EQU   CRRFLGS                                                  01457000
CRRSW5   EQU   CRRFLGS                                                  01458000
CRRSW4   EQU   CRRFLGS                                                  01459000
CRRSW3   EQU   CRRFLGS                                                  01460000
CRRSW2   EQU   CRRFLGS                                                  01461000
CRRSW1   EQU   CRRFLGS                                                  01462000
CRRSW0   EQU   CRRFLGS                                                  01463000
CRRRSV04 EQU   CRRFLGS4                                                 01464000
CRRFMCLK EQU   CRRFLGS4                                                 01465000
CRRDLCCW EQU   CRRFLGS3                                                 01466000
CRRRESET EQU   CRRFLGS3                                                 01467000
CRRSUBBK EQU   CRRFLGS3                                                 01468000
CRRRSV08 EQU   CRRFLGS3                                                 01469000
CRRDEBQ  EQU   CRRFLGS3                                                 01470000
CRRSTSPR EQU   CRRFLGS3                                                 01471000
CRRDREQ  EQU   CRRFLGS3                                                 01472000
CRRDFDBK EQU   CRRFLGS3                                                 01473000
CRRDFSB  EQU   CRRFLGS2                                                 01474000
CRRDPROC EQU   CRRFLGS2                                                 01475000
CRREXTS  EQU   CRRFLGS2                                                 01476000
CRRELSRI EQU   CRRFLGS2                                                 01477000
CRRPOST  EQU   CRRFLGS2                                                 01478000
CRRENDLW EQU   CRRFLGS2                                                 01479000
CRRPRGIP EQU   CRRFLGS2                                                 01480000
CRRDEXP  EQU   CRRFLGS2                                                 01481000
CRRSOLRQ EQU   CRRFLGS1                                                 01482000
CRRREQP  EQU   CRRFLGS1                                                 01483000
CRRCPROC EQU   CRRFLGS1                                                 01484000
CRRFINI  EQU   CRRFLGS1                                                 01485000
CRRPREIO EQU   CRRFLGS1                                                 01486000
CRRINIO  EQU   CRRFLGS1                                                 01487000
CRRFLDOS EQU   CRRFLGS1                                                 01488000
CRRDOCUR EQU   CRRFLGS1                                                 01489000
CRRRATS4 EQU   CRRATS+7                                                 01490000
CRRASC31 EQU   CRRSATS                                                  01491000
CRRASC11 EQU   CRRSATS                                                  01492000
CRRASC51 EQU   CRRSATS                                                  01493000
CRRASC40 EQU   CRRSATS                                                  01494000
CRRASC30 EQU   CRRSATS                                                  01495000
CRRASC21 EQU   CRRSATS                                                  01496000
CRRASC10 EQU   CRRSATS                                                  01497000
CRRASC01 EQU   CRRSATS                                                  01498000
CRRSCBND EQU   CRRRATS2                                                 01499000
CRRPLIC  EQU   CRRRATS2                                                 01500000
CRRRC81  EQU   CRRRATS2                                                 01501000
CRRRC80  EQU   CRRRATS2                                                 01502000
CRRRC65  EQU   CRRRATS2                                                 01503000
CRRRC63  EQU   CRRRATS2                                                 01504000
CRRRC55  EQU   CRRRATS2                                                 01505000
CRRRC54  EQU   CRRRATS2                                                 01506000
CRRRC53  EQU   CRRRATS1                                                 01507000
CRRRC52  EQU   CRRRATS1                                                 01508000
CRRRC51  EQU   CRRRATS1                                                 01509000
CRRRC30  EQU   CRRRATS1                                                 01510000
CRRRC26  EQU   CRRRATS1                                                 01511000
CRRRC23  EQU   CRRRATS1                                                 01512000
CRRRC22  EQU   CRRRATS1                                                 01513000
CRRRC21  EQU   CRRRATS1                                                 01514000
@NM00102 EQU   CRRATS4                                                  01515000
CRRC3X   EQU   CRRATS4                                                  01516000
CRRC85   EQU   CRRATS4                                                  01517000
CRRC83   EQU   CRRATS4                                                  01518000
CRRC82   EQU   CRRATS4                                                  01519000
CRRC61   EQU   CRRATS4                                                  01520000
CRRC60   EQU   CRRATS4                                                  01521000
CRRC81   EQU   CRRATS3                                                  01522000
CRRC80   EQU   CRRATS3                                                  01523000
CRRC75   EQU   CRRATS3                                                  01524000
CRRC51   EQU   CRRATS3                                                  01525000
CRRC50   EQU   CRRATS3                                                  01526000
CRRC42   EQU   CRRATS3                                                  01527000
CRRC41   EQU   CRRATS3                                                  01528000
CRRC40   EQU   CRRATS3                                                  01529000
CRRC32   EQU   CRRATS2                                                  01530000
CRRC31   EQU   CRRATS2                                                  01531000
CRRC30   EQU   CRRATS2                                                  01532000
CRRC25   EQU   CRRATS2                                                  01533000
CRRC24   EQU   CRRATS2                                                  01534000
CRRC23   EQU   CRRATS2                                                  01535000
CRRC22   EQU   CRRATS2                                                  01536000
CRRC21   EQU   CRRATS2                                                  01537000
CRRC20   EQU   CRRATS1                                                  01538000
CRRC13   EQU   CRRATS1                                                  01539000
CRRC12   EQU   CRRATS1                                                  01540000
CRRC11   EQU   CRRATS1                                                  01541000
CRRC10   EQU   CRRATS1                                                  01542000
CRRC02   EQU   CRRATS1                                                  01543000
CRRC01   EQU   CRRATS1                                                  01544000
CRRC00   EQU   CRRATS1                                                  01545000
CRRRMAS4 EQU   CRRMAS+7                                                 01546000
CRRMSC31 EQU   CRRSMAS                                                  01547000
CRRMSC11 EQU   CRRSMAS                                                  01548000
CRRMSC51 EQU   CRRSMAS                                                  01549000
CRRMSC40 EQU   CRRSMAS                                                  01550000
CRRMSC30 EQU   CRRSMAS                                                  01551000
CRRMSC21 EQU   CRRSMAS                                                  01552000
CRRMSC10 EQU   CRRSMAS                                                  01553000
CRRMSC01 EQU   CRRSMAS                                                  01554000
@NM00101 EQU   CRRRMAS2                                                 01555000
CRRRM81  EQU   CRRRMAS2                                                 01556000
CRRRM80  EQU   CRRRMAS2                                                 01557000
CRRRM65  EQU   CRRRMAS2                                                 01558000
CRRRM63  EQU   CRRRMAS2                                                 01559000
CRRRM55  EQU   CRRRMAS2                                                 01560000
CRRRM54  EQU   CRRRMAS2                                                 01561000
CRRRM53  EQU   CRRRMAS1                                                 01562000
CRRRM52  EQU   CRRRMAS1                                                 01563000
CRRRM51  EQU   CRRRMAS1                                                 01564000
CRRRM30  EQU   CRRRMAS1                                                 01565000
CRRRM26  EQU   CRRRMAS1                                                 01566000
CRRRM23  EQU   CRRRMAS1                                                 01567000
CRRRM22  EQU   CRRRMAS1                                                 01568000
CRRRM21  EQU   CRRRMAS1                                                 01569000
@NM00100 EQU   CRRMAS4                                                  01570000
CRRM3X   EQU   CRRMAS4                                                  01571000
CRRM85   EQU   CRRMAS4                                                  01572000
CRRM83   EQU   CRRMAS4                                                  01573000
CRRM82   EQU   CRRMAS4                                                  01574000
CRRM61   EQU   CRRMAS4                                                  01575000
CRRM60   EQU   CRRMAS4                                                  01576000
CRRM81   EQU   CRRMAS3                                                  01577000
CRRM80   EQU   CRRMAS3                                                  01578000
CRRM75   EQU   CRRMAS3                                                  01579000
CRRM51   EQU   CRRMAS3                                                  01580000
CRRM50   EQU   CRRMAS3                                                  01581000
CRRM42   EQU   CRRMAS3                                                  01582000
CRRM41   EQU   CRRMAS3                                                  01583000
CRRM40   EQU   CRRMAS3                                                  01584000
CRRM32   EQU   CRRMAS2                                                  01585000
CRRM31   EQU   CRRMAS2                                                  01586000
CRRM30   EQU   CRRMAS2                                                  01587000
CRRM25   EQU   CRRMAS2                                                  01588000
CRRM24   EQU   CRRMAS2                                                  01589000
CRRM23   EQU   CRRMAS2                                                  01590000
CRRM22   EQU   CRRMAS2                                                  01591000
CRRM21   EQU   CRRMAS2                                                  01592000
CRRM20   EQU   CRRMAS1                                                  01593000
CRRM13   EQU   CRRMAS1                                                  01594000
CRRM12   EQU   CRRMAS1                                                  01595000
CRRM11   EQU   CRRMAS1                                                  01596000
CRRM10   EQU   CRRMAS1                                                  01597000
CRRM02   EQU   CRRMAS1                                                  01598000
CRRM01   EQU   CRRMAS1                                                  01599000
CRRM00   EQU   CRRMAS1                                                  01600000
CRRFSB   EQU   CRRSAREA+144                                             01601000
CRRSAVE1 EQU   CRRSAREA+72                                              01602000
CRRSAVE  EQU   CRRSAREA                                                 01603000
CRRRSV22 EQU   ISTDCCRR+4                                               01604000
CRRCRR   EQU   ISTDCCRR                                                 01605000
CCFRSVD1 EQU   CFCCRT                                                   01606000
CCFCR2   EQU   CFCCRT                                                   01607000
CCFCRP   EQU   CFCCRT                                                   01608000
CCFCR1   EQU   CFCCRT                                                   01609000
CCFCS2   EQU   CFCCRT                                                   01610000
CCFCS1   EQU   CFCCRT                                                   01611000
NCFRSVD  EQU   CFCNTRD                                                  01612000
NCFCR2   EQU   CFCNTRD                                                  01613000
NCFCRP   EQU   CFCNTRD                                                  01614000
NCFCR1   EQU   CFCNTRD                                                  01615000
NCFCS2   EQU   CFCNTRD                                                  01616000
NCFCS1   EQU   CFCNTRD                                                  01617000
ISTRETR7 EQU   ISTRETRG+4                                               01618000
ISTRETR6 EQU   ISTRETRG                                                 01619000
ISTRSV01 EQU   ISTAVT+42                                                01620000
ISTPDAVP EQU   ISTAVT+38                                                01621000
ISTVTTP  EQU   ISTAVT+36                                                01622000
ISTAGTWT EQU   ISTAVT+34                                                01623000
ISTATRT  EQU   ISTAVT+32                                                01624000
ISTARID  EQU   ISTAVT+30                                                01625000
ISTX1    EQU   ISTAVT+29                                                01626000
ISTPHNM  EQU   ISTAVT+24                                                01627000
ISTAPSEX EQU   ISTAVT+20                                                01628000
ISTVTTIK EQU   ISTAVT+18                                                01629000
AVTASID  EQU   ISTAVT+16                                                01630000
ISTAPSTA EQU   ISTAVT+12                                                01631000
ISTAS53  EQU   ISTAVT+8                                                 01632000
ISTAS49  EQU   ISTAVT+4                                                 01633000
ISTACVT  EQU   ISTAVT                                                   01634000
PSTDRDYQ EQU   PSTDMPS+1                                                01635000
@NM00099 EQU   PSTDMPS                                                  01636000
PSTDGATE EQU   PSTDMPS                                                  01637000
PSTDEBP  EQU   ISTPST+128                                               01638000
PSTSAVE  EQU   ISTPST+96                                                01639000
PSTCRRS  EQU   ISTPST+60                                                01640000
PSTCRR1  EQU   ISTPST+56                                                01641000
PSTIQE22 EQU   ISTPST+52                                                01642000
PSTIQE21 EQU   ISTPST+48                                                01643000
PSTIQE12 EQU   ISTPST+44                                                01644000
PSTIQE11 EQU   ISTPST+40                                                01645000
PSTUEQ   EQU   ISTPST+36                                                01646000
PSTNSSQ  EQU   ISTPST+32                                                01647000
PSTPSSQ  EQU   ISTPST+28                                                01648000
PSTACBCT EQU   ISTPST+24                                                01649000
PSTTCBA  EQU   ISTPST+16                                                01650000
PSTRSV08 EQU   PSTFLGA+1                                                01651000
PSTPEND  EQU   PSTFLGA+1                                                01652000
PSTDMPC  EQU   PSTFLGA+1                                                01653000
PSTABEND EQU   PSTABINP                                                 01654000
PSTAUTH  EQU   PSTFLGA                                                  01655000
PSTSMCU  EQU   PSTFLGA                                                  01656000
PSTSMQR  EQU   PSTFLGA                                                  01657000
PSTIRBU2 EQU   PSTFLGA                                                  01658000
PSTIRBU1 EQU   PSTFLGA                                                  01659000
PSTUERN  EQU   PSTFLGA                                                  01660000
PSTSSRN  EQU   PSTFLGA                                                  01661000
PSTRQUEA EQU   PSTRQUE+1                                                01662000
PSTRSV07 EQU   PSTRQUE                                                  01663000
PSTRSV06 EQU   PSTRQUE                                                  01664000
PSTRSV05 EQU   PSTRQUE                                                  01665000
PSTRSV04 EQU   PSTRQUE                                                  01666000
PSTRSV03 EQU   PSTRQUE                                                  01667000
PSTRSV02 EQU   PSTRQUE                                                  01668000
PSTRSV01 EQU   PSTRQUE                                                  01669000
PSTRQFLG EQU   PSTRQUE                                                  01670000
PSTCHAIN EQU   ISTPST+4                                                 01671000
@NM00098 EQU   ISTPST+2                                                 01672000
PSTLNGTH EQU   ISTPST+1                                                 01673000
PSTTYPE  EQU   ISTPST                                                   01674000
@NM00097 EQU   ISTAPCRR+144                                             01675000
APCSVRB  EQU   ISTAPCRR+140                                             01676000
@NM00096 EQU   ISTAPCRR+137                                             01677000
@NM00095 EQU   APC57FLG                                                 01678000
APCNREL  EQU   APC57FLG                                                 01679000
APCRECRA EQU   APC57FLG                                                 01680000
@NM00094 EQU   APC54FLG                                                 01681000
APCRLST  EQU   APC54FLG                                                 01682000
APCPR153 EQU   APC53FLG                                                 01683000
@NM00093 EQU   APC52FLG                                                 01684000
APCWKF   EQU   APC52FLG                                                 01685000
APCNWF   EQU   APC52FLG                                                 01686000
APCRDQ   EQU   APC52FLG                                                 01687000
APCQENQ  EQU   APC52FLG                                                 01688000
APCSMSR  EQU   APC52FLG                                                 01689000
APCCKRQ  EQU   APC52FLG                                                 01690000
@NM00092 EQU   APC31FLG                                                 01691000
APCSORT  EQU   APC31FLG                                                 01692000
APCRESCH EQU   APC31FLG                                                 01693000
APCTPXIT EQU   APC31FLG                                                 01694000
APCSWTWD EQU   ISTAPCRR+128                                             01695000
APCSAV2  EQU   ISTAPCRR+124                                             01696000
APCSAV1  EQU   ISTAPCRR+120                                             01697000
APCRETCD EQU   APCCOMF+2                                                01698000
@NM00091 EQU   APCCOMF1+1                                               01699000
APCTSO   EQU   APCCOMF1+1                                               01700000
APCAUTHE EQU   APCCOMF1+1                                               01701000
APCZLBER EQU   APCCOMF1                                                 01702000
APCEXIT  EQU   APCCOMF1                                                 01703000
APCRELR  EQU   APCCOMF1                                                 01704000
APCIRB2  EQU   APCCOMF1                                                 01705000
APCIRB1  EQU   APCCOMF1                                                 01706000
APCSMCR  EQU   APCCOMF1                                                 01707000
APCESTAL EQU   APCSAVE                                                  01708000
APCFRRPM EQU   ISTAPCRR+40                                              01709000
APCQWFO  EQU   ISTAPCRR+36                                              01710000
APCPABSV EQU   ISTAPCRR+32                                              01711000
APCRTRNA EQU   APCRTRN+1                                                01712000
@NM00090 EQU   APCAUT                                                   01713000
APCAUTEX EQU   APCAUT                                                   01714000
APCTCBA  EQU   ISTAPCRR+24                                              01715000
@NM00089 EQU   APCRFLG+1                                                01716000
APC31R   EQU   APCRFLG                                                  01717000
APC58R   EQU   APCRFLG                                                  01718000
APC57R   EQU   APCRFLG                                                  01719000
APC56R   EQU   APCRFLG                                                  01720000
APC54R   EQU   APCRFLG                                                  01721000
APC53R   EQU   APCRFLG                                                  01722000
APC52R   EQU   APCRFLG                                                  01723000
APC51R   EQU   APCRFLG                                                  01724000
@NM00088 EQU   APCATFLG+1                                               01725000
APC31E   EQU   APCATFLG                                                 01726000
APC58E   EQU   APCATFLG                                                 01727000
APC57E   EQU   APCATFLG                                                 01728000
APC56E   EQU   APCATFLG                                                 01729000
APC54E   EQU   APCATFLG                                                 01730000
APC53E   EQU   APCATFLG                                                 01731000
APC52E   EQU   APCATFLG                                                 01732000
APC51E   EQU   APCATFLG                                                 01733000
PFCRSV01 EQU   ISTPFCRR+13                                              01734000
PFCFTA   EQU   ISTPFCRR+12                                              01735000
CRRFRR   EQU   PFCFRRO                                                  01736000
CRRCHAIN EQU   PFCCRRO                                                  01737000
CRRLEN   EQU   PFCCRRLN                                                 01738000
PFCRSV10 EQU   PFCCRR+1                                                 01739000
CRRID    EQU   PFCCRRID                                                 01740000
ATCAOS   EQU   ISTATCVT+1868                                            01741000
@NM00087 EQU   ISTATCVT+1860                                            01742000
@NM00086 EQU   ISTATCVT+1852                                            01743000
@NM00085 EQU   ISTATCVT+1844                                            01744000
@NM00084 EQU   ISTATCVT+1836                                            01745000
@NM00083 EQU   ISTATCVT+1828                                            01746000
@NM00082 EQU   ISTATCVT+1820                                            01747000
ATCHWCSA EQU   ISTATCVT+1816                                            01748000
ATCCACSA EQU   ISTATCVT+1812                                            01749000
ATCMXCSA EQU   ISTATCVT+1808                                            01750000
ATCTPMPB EQU   ISTATCVT+1776                                            01751000
ATCTRMPB EQU   ISTATCVT+1744                                            01752000
ATCRPLAC EQU   ATCRPLCN+2                                               01753000
ATCRPLRC EQU   ATCRPLCN                                                 01754000
ATCCRPLQ EQU   ATCCRPL                                                  01755000
ATCSRBAC EQU   ATCSRBCN+2                                               01756000
ATCSRBRC EQU   ATCSRBCN                                                 01757000
ATCSRBQ  EQU   ATCSRB                                                   01758000
ATCCRAAC EQU   ATCCRACN+2                                               01759000
ATCCRARC EQU   ATCCRACN                                                 01760000
ATCCRAQ  EQU   ATCCRA                                                   01761000
ATCLUFFD EQU   ISTATCVT+1716                                            01762000
ATCVIOPM EQU   ISTATCVT+1712                                            01763000
ATCTPMMI EQU   ISTATCVT+1708                                            01764000
ATCPXSRB EQU   ISTATCVT+1704                                            01765000
ATCRPLCT EQU   ISTATCVT+1702                                            01766000
ATCCRACT EQU   ISTATCVT+1700                                            01767000
ATCSRBCT EQU   ISTATCVT+1698                                            01768000
ATCSTNSM EQU   ISTATCVT+1697                                            01769000
@NM00081 EQU   ATCZFLAG                                                 01770000
ATCZF001 EQU   ATCZFLAG                                                 01771000
ATCTPCP1 EQU   ISTATCVT+1692                                            01772000
ATCTPCP0 EQU   ISTATCVT+1688                                            01773000
ATCZR01  EQU   ISTATCVT+1684                                            01774000
ATCMPLTA EQU   ISTATCVT+1680                                            01775000
ATCASCB  EQU   ISTATCVT+1676                                            01776000
ATCAP86  EQU   ISTATCVT+1672                                            01777000
ATCAP85  EQU   ISTATCVT+1668                                            01778000
ATCAP84  EQU   ISTATCVT+1664                                            01779000
ATCAP83  EQU   ISTATCVT+1660                                            01780000
ATCAP82  EQU   ISTATCVT+1656                                            01781000
ATCAP69  EQU   ISTATCVT+1652                                            01782000
ATCAP66  EQU   ISTATCVT+1648                                            01783000
ATCAP62  EQU   ISTATCVT+1644                                            01784000
ATCAPC59 EQU   ISTATCVT+1640                                            01785000
ATCAP56  EQU   ISTATCVT+1636                                            01786000
ATCAP55  EQU   ISTATCVT+1632                                            01787000
ATCAP41  EQU   ISTATCVT+1628                                            01788000
ATCAPC25 EQU   ISTATCVT+1624                                            01789000
ATCAP23  EQU   ISTATCVT+1620                                            01790000
ATCAPBE  EQU   ISTATCVT+1616                                            01791000
ATCPSTA  EQU   ISTATCVT+1612                                            01792000
ATCSMABF EQU   ISTATCVT+1608                                            01793000
ATCSMAPR EQU   ISTATCVT+1604                                            01794000
ATCTPWQA EQU   ISTATCVT+1600                                            01795000
ATCSMAID EQU   ISTATCVT+1596                                            01796000
ATCSMARA EQU   ISTATCVT+1592                                            01797000
ATCCACXA EQU   ISTATCVT+1588                                            01798000
ATCATA10 EQU   ISTATCVT+1584                                            01799000
ATCHLTCB EQU   ISTATCVT+1580                                            01800000
@NM00080 EQU   ATCVTFLG                                                 01801000
ATCVTACT EQU   ATCVTFLG                                                 01802000
@NM00079 EQU   @NM00078                                                 01803000
ATCVTMAB EQU   @NM00078                                                 01804000
ATCVTBAM EQU   ISTATCVT+1572                                            01805000
@NM00077 EQU   ISTATCVT+1568                                            01806000
@NM00076 EQU   ISTATCVT+1520                                            01807000
ATCCCOOC EQU   ISTATCVT+1516                                            01808000
@NM00075 EQU   ISTATCVT+1513                                            01809000
ATCSNUF  EQU   ATCENFLG                                                 01810000
ATCOPKL  EQU   ATCENFLG                                                 01811000
ATCABEN  EQU   ATCENFLG                                                 01812000
ATCSRDN  EQU   ATCENFLG                                                 01813000
ATCDLDN  EQU   ATCENFLG                                                 01814000
ATCTIMER EQU   ISTATCVT+1508                                            01815000
ATCAIWT  EQU   ISTATCVT+1504                                            01816000
ATCOROBT EQU   ISTATCVT+1500                                            01817000
ATCDMAPP EQU   ISTATCVT+1496                                            01818000
ATCZDVTX EQU   ISTATCVT+1492                                            01819000
ATCPXCRA EQU   ISTATCVT+1488                                            01820000
ATCICNCB EQU   ISTATCVT+1484                                            01821000
ATCCMTCB EQU   ISTATCVT+1480                                            01822000
ATCPRPH  EQU   ISTATCVT+1476                                            01823000
ATCGSRBF EQU   ATCGSRBG                                                 01824000
ATCSRBRT EQU   ISTATCVT+1468                                            01825000
ATCTSCPC EQU   ISTATCVT+1464                                            01826000
@NM00074 EQU   ISTATCVT+1460                                            01827000
ATCCDTCB EQU   ISTATCVT+1456                                            01828000
ATCORFRL EQU   ISTATCVT+1452                                            01829000
ATCORFPX EQU   ISTATCVT+1448                                            01830000
ATCORFMG EQU   ISTATCVT+1444                                            01831000
ATCSMBQ  EQU   ISTATCVT+1440                                            01832000
ATCINFDD EQU   ISTATCVT+1436                                            01833000
ATCAP67  EQU   ISTATCVT+1432                                            01834000
ATCAP65  EQU   ISTATCVT+1428                                            01835000
ATCAP63  EQU   ISTATCVT+1420                                            01836000
ATCAP61  EQU   ISTATCVT+1416                                            01837000
ATCAP58  EQU   ISTATCVT+1412                                            01838000
ATCAP57  EQU   ISTATCVT+1408                                            01839000
ATCAP54  EQU   ISTATCVT+1404                                            01840000
ATCAP53  EQU   ISTATCVT+1400                                            01841000
ATCAP52  EQU   ISTATCVT+1396                                            01842000
ATCAP51  EQU   ISTATCVT+1392                                            01843000
ATCAP38  EQU   ISTATCVT+1388                                            01844000
ATCAP37  EQU   ISTATCVT+1384                                            01845000
ATCAP34  EQU   ISTATCVT+1380                                            01846000
ATCAP32  EQU   ISTATCVT+1376                                            01847000
ATCAP31  EQU   ISTATCVT+1372                                            01848000
ATCAP12  EQU   ISTATCVT+1368                                            01849000
ATCAP11  EQU   ISTATCVT+1364                                            01850000
ATCDAPDG EQU   ATCDAPVT+20                                              01851000
ATCDXCEA EQU   ATCDAPVT+16                                              01852000
ATCDCEA  EQU   ATCDAPVT+12                                              01853000
ATCDPCIA EQU   ATCDAPVT+8                                               01854000
ATCDSIOA EQU   ATCDAPVT+4                                               01855000
ATCDEOEA EQU   ATCDAPVT                                                 01856000
ATCZAEA  EQU   ATCICAPP+16                                              01857000
ATCZCEA  EQU   ATCICAPP+12                                              01858000
ATCZCPCI EQU   ATCICAPP+8                                               01859000
ATCZSIOA EQU   ATCICAPP+4                                               01860000
ATCCDRPH EQU   ATCICAPP                                                 01861000
ATCORQG  EQU   ATCORSRB                                                 01862000
ATCORTBF EQU   ATCSQAFR                                                 01863000
@NM00073 EQU   ISTATCVT+1308                                            01864000
ATCZLAEA EQU   ATCLDAPP+16                                              01865000
ATCZLCEA EQU   ATCLDAPP+12                                              01866000
ATCZLPCI EQU   ATCLDAPP+8                                               01867000
ATCSMFRR EQU   ATCLDAPP+4                                               01868000
@NM00072 EQU   ISTATCVT+1256                                            01869000
ATCZPAB2 EQU   ISTATCVT+1224                                            01870000
@NM00071 EQU   ISTATCVT+1224                                            01871000
@NM00070 EQU   ISTATCVT+1164                                            01872000
ATCCPCFE EQU   ISTATCVT+1160                                            01873000
@NM00069 EQU   ATCRID+2                                                 01874000
ATCCDRMA EQU   ATCRID                                                   01875000
@NM00068 EQU   ATCSMSDQ+8                                               01876000
@NM00067 EQU   ATCSMSDQ+4                                               01877000
@NM00066 EQU   ATCSMSDQ                                                 01878000
ATCSEQNO EQU   ISTATCVT+1136                                            01879000
ATCSMPMD EQU   ISTATCVT+1132                                            01880000
ATCPAREA EQU   ISTATCVT+1128                                            01881000
ATCCPCSM EQU   ISTATCVT+1124                                            01882000
ATCQLOCK EQU   ISTATCVT+1120                                            01883000
ATCITQLE EQU   ISTATCVT+1116                                            01884000
ATCSQCDS EQU   ISTATCVT+1112                                            01885000
ATCUSSVT EQU   ISTATCVT+1108                                            01886000
ATCNOSQ  EQU   ISTATCVT+1104                                            01887000
ATCINCIP EQU   ATCCPDVT+4                                               01888000
ATCTSCNI EQU   ATCCPDVT                                                 01889000
ATCMGCRT EQU   ISTATCVT+1092                                            01890000
ATCMACRT EQU   ISTATCVT+1088                                            01891000
ATCCSMT  EQU   ISTATCVT+1084                                            01892000
ATCDRUSL EQU   ISTATCVT+1080                                            01893000
ATCDRULL EQU   ISTATCVT+1076                                            01894000
ATCCFCDR EQU   ISTATCVT+1072                                            01895000
@NM00065 EQU   ISTATCVT+1069                                            01896000
ATCMROUT EQU   ISTATCVT+1060                                            01897000
ATCONFIG EQU   ISTATCVT+1052                                            01898000
ATCNODEL EQU   ISTATCVT+1044                                            01899000
@NM00064 EQU   @NM00063+9                                               01900000
ATCLAST  EQU   ATCSHRFG                                                 01901000
ATCSHRTN EQU   @NM00063                                                 01902000
@NM00062 EQU   ISTATCVT+1026                                            01903000
ATCNMCTR EQU   ISTATCVT+1024                                            01904000
ATCPOIA  EQU   ATCRNO+1                                                 01905000
@NM00061 EQU   ATCRNO                                                   01906000
ATCLCLCT EQU   ATCVLCNT+2                                               01907000
ATCRNCNT EQU   ATCVLCNT                                                 01908000
ATCHBSIZ EQU   ATCHPGM+2                                                01909000
ATCHBFNO EQU   ATCHPGM                                                  01910000
@NM00060 EQU   ISTATCVT+1011                                            01911000
ATCXRANG EQU   ISTATCVT+1010                                            01912000
ATCMAXID EQU   ISTATCVT+1009                                            01913000
ATCMSGSP EQU   ISTATCVT+1008                                            01914000
ATCCIDM  EQU   ISTATCVT+1006                                            01915000
ATCACTRM EQU   ISTATCVT+1004                                            01916000
ATCECTLP EQU   ISTATCVT+1000                                            01917000
ATCECNET EQU   ISTATCVT+996                                             01918000
ATCECOPC EQU   ISTATCVT+992                                             01919000
ATCECSES EQU   ISTATCVT+988                                             01920000
ATCECDSP EQU   ISTATCVT+984                                             01921000
ATCECVRY EQU   ISTATCVT+980                                             01922000
ATCECHLT EQU   ISTATCVT+976                                             01923000
ATCECMOD EQU   ISTATCVT+972                                             01924000
ATCVDLOK EQU   ISTATCVT+968                                             01925000
ATCRDTLK EQU   ISTATCVT+964                                             01926000
ATCVOCLK EQU   ISTATCVT+960                                             01927000
ATCITLIM EQU   ISTATCVT+958                                             01928000
ATCTMINV EQU   ISTATCVT+956                                             01929000
ATCHOSTA EQU   ISTATCVT+954                                             01930000
ATCPUNSA EQU   ISTATCVT+952                                             01931000
ATCSAF   EQU   ISTATCVT+950                                             01932000
ATCVTMID EQU   ATCSSCPA                                                 01933000
ATCHCNID EQU   ATCONID+2                                                01934000
ATCSCNID EQU   ATCONID                                                  01935000
@NM00059 EQU   ATCBITAN+3                                               01936000
@NM00058 EQU   ATCBITAN+2                                               01937000
@NM00057 EQU   ATCFLAG2                                                 01938000
@NM00056 EQU   ATCFLAG2                                                 01939000
@NM00055 EQU   ATCFLAG2                                                 01940000
ATCCRYPF EQU   ATCFLAG2                                                 01941000
ATCTUNCL EQU   ATCFLAG2                                                 01942000
ATCTUNRQ EQU   ATCFLAG2                                                 01943000
ATCTUNAC EQU   ATCFLAG2                                                 01944000
ATCCDLRA EQU   ATCFLAG2                                                 01945000
@NM00054 EQU   ATCBITAN                                                 01946000
@NM00053 EQU   ATCSTAT4                                                 01947000
@NM00052 EQU   ATCSTAT4                                                 01948000
@NM00051 EQU   ATCSTAT4                                                 01949000
@NM00050 EQU   ATCSTAT4                                                 01950000
@NM00049 EQU   ATCSTAT4                                                 01951000
ATCPRTAT EQU   ATCSTAT4                                                 01952000
ATCNCSD  EQU   ATCSTAT4                                                 01953000
ATCMTST  EQU   ATCSTAT4                                                 01954000
@NM00048 EQU   ATCPOFLG                                                 01955000
@NM00047 EQU   ATCPOFLG                                                 01956000
@NM00046 EQU   ATCPOFLG                                                 01957000
@NM00045 EQU   ATCPOFLG                                                 01958000
@NM00044 EQU   ATCPOFLG                                                 01959000
@NM00043 EQU   ATCPOFLG                                                 01960000
@NM00042 EQU   ATCPOFLG                                                 01961000
ATCPOUNS EQU   ATCPOFLG                                                 01962000
@NM00041 EQU   ATCSTAT+1                                                01963000
ATCHIP   EQU   ATCSTAT1                                                 01964000
ATCMDHLT EQU   ATCSTAT1                                                 01965000
ATCINHLT EQU   ATCSTAT1                                                 01966000
ATCNETSL EQU   ATCSTAT1                                                 01967000
ATCQKHLT EQU   ATCSTAT1                                                 01968000
ATCSNHLT EQU   ATCSTAT1                                                 01969000
ATCACTIV EQU   ATCSTAT1                                                 01970000
ATCSTART EQU   ATCSTAT1                                                 01971000
ATCNOP00 EQU   ISTATCVT+932                                             01972000
ATCTSBUF EQU   ISTATCVT+928                                             01973000
ATCFEPT  EQU   ISTATCVT+924                                             01974000
ATCFDVT  EQU   ISTATCVT+920                                             01975000
ATCCONFT EQU   ISTATCVT+916                                             01976000
ATCRDTH  EQU   ISTATCVT+912                                             01977000
ATCSIBQ  EQU   ISTATCVT+908                                             01978000
ATCHLTMS EQU   ISTATCVT+904                                             01979000
ATCECPRM EQU   ISTATCVT+900                                             01980000
ATCVPARM EQU   ISTATCVT+896                                             01981000
ATCOCHA  EQU   ISTATCVT+892                                             01982000
ATCDSPLQ EQU   ISTATCVT+888                                             01983000
ATCVARYQ EQU   ISTATCVT+884                                             01984000
ATCHALTQ EQU   ISTATCVT+880                                             01985000
ATCMODQ  EQU   ISTATCVT+876                                             01986000
ATCSRT   EQU   ISTATCVT+872                                             01987000
ATCRDT   EQU   ISTATCVT+868                                             01988000
ATCSDVT  EQU   ISTATCVT+864                                             01989000
ATCDLRPT EQU   ISTATCVT+860                                             01990000
ATCACDA  EQU   ISTATCVT+852                                             01991000
ATCMNT   EQU   ISTATCVT+848                                             01992000
ATCUEP   EQU   ISTATCVT+844                                             01993000
ATCNODDS EQU   ISTATCVT+840                                             01994000
ATCITRT  EQU   ISTATCVT+836                                             01995000
ATCTODVT EQU   ISTATCVT+832                                             01996000
ATCTRCPT EQU   ISTATCVT+828                                             01997000
ATCMODTB EQU   ISTATCVT+824                                             01998000
ATCUSSPT EQU   ISTATCVT+820                                             01999000
ATCTUBUF EQU   ISTATCVT+816                                             02000000
ATCTACB  EQU   ISTATCVT+812                                             02001000
ATCDWA   EQU   ISTATCVT+808                                             02002000
ATCCFCR2 EQU   ATCPODVT                                                 02003000
ATCEPA   EQU   ISTATCVT+800                                             02004000
ATCPULQB EQU   @NM00040+16                                              02005000
ATCMCQAB EQU   @NM00040+12                                              02006000
ATCLUSMQ EQU   @NM00040+8                                               02007000
ATCLUIOQ EQU   @NM00040+4                                               02008000
ATCIOLQB EQU   @NM00040                                                 02009000
ATCTSCAP EQU   ATCANYDT                                                 02010000
ATCTSCCO EQU   ATCLUDVT+4                                               02011000
ATCTSCSR EQU   ATCLUDVT                                                 02012000
ATCVTLOD EQU   ISTATCVT+764                                             02013000
ATCTSCLF EQU   ISTATCVT+760                                             02014000
ATCTSCLE EQU   ISTATCVT+756                                             02015000
ATCTSCLB EQU   ISTATCVT+752                                             02016000
ATCTSCLS EQU   ISTATCVT+748                                             02017000
ATCTSCCF EQU   ISTATCVT+744                                             02018000
ATCTSCFV EQU   ISTATCVT+740                                             02019000
ATCTSCCE EQU   ISTATCVT+736                                             02020000
ATCTSCCB EQU   ISTATCVT+732                                             02021000
ATCTSCWS EQU   ISTATCVT+728                                             02022000
ATCTSCEM EQU   ISTATCVT+724                                             02023000
ATCTSCNS EQU   ISTATCVT+720                                             02024000
ATCTSCER EQU   ISTATCVT+716                                             02025000
ATCTSCPR EQU   ISTATCVT+712                                             02026000
ATCTSCGR EQU   ISTATCVT+708                                             02027000
ATCTSCCI EQU   ISTATCVT+704                                             02028000
ATCTSVT  EQU   ISTATCVT+700                                             02029000
ATCDVLOD EQU   ISTATCVT+696                                             02030000
ATCCDCNR EQU   ISTATCVT+692                                             02031000
ATCCDCNF EQU   ISTATCVT+688                                             02032000
ATCCDCND EQU   ISTATCVT+684                                             02033000
ATCCDCNA EQU   ISTATCVT+680                                             02034000
ATCCDCCP EQU   ISTATCVT+676                                             02035000
ATCCDFDN EQU   ISTATCVT+672                                             02036000
ATCCDFIN EQU   ISTATCVT+668                                             02037000
ATCCDFND EQU   ISTATCVT+664                                             02038000
ATCCDDEL EQU   ISTATCVT+660                                             02039000
ATCCDADD EQU   ISTATCVT+656                                             02040000
ATCTCLIM EQU   ISTATCVT+652                                             02041000
ATCRACTR EQU   ISTATCVT+648                                             02042000
ATCRACTI EQU   ISTATCVT+644                                             02043000
ATCREMOV EQU   ISTATCVT+640                                             02044000
ATCRACIO EQU   ISTATCVT+636                                             02045000
ATCADD   EQU   ISTATCVT+632                                             02046000
ATCPUCRT EQU   ISTATCVT+628                                             02047000
ATCSMRQ  EQU   ISTATCVT+620                                             02048000
ATCORCPX EQU   ISTATCVT+616                                             02049000
ATCORCAF EQU   ISTATCVT+612                                             02050000
ATCFRSTR EQU   ATCGTSTR                                                 02051000
ATCSTMA  EQU   ISTATCVT+604                                             02052000
ATCSRTAD EQU   ISTATCVT+600                                             02053000
ATCOCRT  EQU   ISTATCVT+596                                             02054000
ATCOCCFS EQU   ISTATCVT+592                                             02055000
ATCOCCFP EQU   ISTATCVT+588                                             02056000
ATCSRTDF EQU   ISTATCVT+584                                             02057000
ATCLUCRT EQU   ISTATCVT+580                                             02058000
ATCINCY5 EQU   ISTATCVT+576                                             02059000
ATCINCW3 EQU   ISTATCVT+572                                             02060000
ATCINCU6 EQU   ISTATCVT+568                                             02061000
ATCINCTQ EQU   ISTATCVT+564                                             02062000
ATCINCS1 EQU   ISTATCVT+560                                             02063000
ATCSRTAB EQU   ISTATCVT+556                                             02064000
ATCINCRD EQU   ISTATCVT+552                                             02065000
ATCINCPH EQU   ISTATCVT+548                                             02066000
ATCINCLQ EQU   ISTATCVT+544                                             02067000
ATCNOCRT EQU   ISTATCVT+540                                             02068000
ATCINCF1 EQU   ISTATCVT+536                                             02069000
ATCINCCI EQU   ISTATCVT+532                                             02070000
ATCINCCO EQU   ISTATCVT+528                                             02071000
ATCBLDLA EQU   ISTATCVT+524                                             02072000
ATCALOAD EQU   ISTATCVT+520                                             02073000
ATCADEL  EQU   ISTATCVT+516                                             02074000
ATCESC02 EQU   ISTATCVT+512                                             02075000
ATCESC01 EQU   ISTATCVT+508                                             02076000
ATCDEC01 EQU   ISTATCVT+504                                             02077000
ATCDEC00 EQU   ISTATCVT+500                                             02078000
ATCCPCRT EQU   ISTATCVT+496                                             02079000
ATCMSGM  EQU   ISTATCVT+492                                             02080000
ATCCPCFR EQU   ISTATCVT+488                                             02081000
ATCCPCGR EQU   ISTATCVT+484                                             02082000
ATCCPCPP EQU   ISTATCVT+480                                             02083000
ATCMSGP  EQU   ISTATCVT+476                                             02084000
ATCCPCNT EQU   ISTATCVT+472                                             02085000
ATCAUTHA EQU   ISTATCVT+468                                             02086000
ATCACCTA EQU   ISTATCVT+464                                             02087000
ATCAP39  EQU   ISTATCVT+460                                             02088000
ATCAP36  EQU   ISTATCVT+456                                             02089000
ATCAP35  EQU   ISTATCVT+452                                             02090000
ATCAP33  EQU   ISTATCVT+448                                             02091000
ATCAPCR5 EQU   ISTATCVT+444                                             02092000
ATCAICPT EQU   ISTATCVT+440                                             02093000
ATCAPI   EQU   ISTATCVT+436                                             02094000
ATCAICTN EQU   ISTATCVT+432                                             02095000
ATCACC01 EQU   ISTATCVT+428                                             02096000
ATCACC00 EQU   ISTATCVT+424                                             02097000
ATCLDECB EQU   ATCLDTIL+12                                              02098000
ATCLDLCK EQU   ATCLDTIL+8                                               02099000
ATCLDLST EQU   ATCLDTIL+4                                               02100000
ATCLDNCS EQU   ATCLDTIL                                                 02101000
ATCNOSPB EQU   ISTATCVT+376                                             02102000
ATCNSPAB EQU   ISTATCVT+344                                             02103000
ATCLUSRT EQU   ISTATCVT+312                                             02104000
ATCPUIOP EQU   ISTATCVT+280                                             02105000
ATCPUPAB EQU   ISTATCVT+248                                             02106000
ATCPXPAB EQU   ISTATCVT+216                                             02107000
ATCPOPAB EQU   ISTATCVT+184                                             02108000
@NM00039 EQU   ATCVDPAB+16                                              02109000
ATCFEPAB EQU   ATCVDPAB                                                 02110000
ATCTCIPB EQU   ISTATCVT+120                                             02111000
ATCCSPAB EQU   ATCSMPAB+16                                              02112000
@NM00038 EQU   ATCSMPAB                                                 02113000
ATCTMRPB EQU   ISTATCVT+56                                              02114000
ATCITPAB EQU   ISTATCVT+24                                              02115000
@NM00037 EQU   ATCITRA1                                                 02116000
ATCITSCP EQU   ATCITRA1                                                 02117000
ATCITMSG EQU   ATCITRA1                                                 02118000
ATCITPIU EQU   ATCITRA1                                                 02119000
ATCITSMS EQU   ATCITRA1                                                 02120000
ATCITPSS EQU   ATCITRA1                                                 02121000
ATCITLCK EQU   ATCITRA1                                                 02122000
ATCITAPI EQU   ATCITRA1                                                 02123000
ATCITCNT EQU   ATCITFLG                                                 02124000
ATCITRPH EQU   ATCITCDS                                                 02125000
ATCITTBL EQU   ATCITFLD+4                                               02126000
ATCITPRM EQU   ATCITFLD                                                 02127000
ATCPTCHA EQU   ATCRPTCH+4                                               02128000
ATCVTLVL EQU   ATCRPTCH                                                 02129000
RPHUPSTA EQU   ISTRPH+104                                               02130000
RPHSAV16 EQU   RPHWORK+60                                               02131000
RPHSAV15 EQU   RPHWORK+56                                               02132000
RPHSAV14 EQU   RPHWORK+52                                               02133000
RPHSAV13 EQU   RPHWORK+48                                               02134000
RPHSAV12 EQU   RPHWORK+44                                               02135000
RPHSAV11 EQU   RPHWORK+40                                               02136000
RPHSAV10 EQU   RPHWORK+36                                               02137000
RPHSAVE9 EQU   RPHWORK+32                                               02138000
RPHSAVE8 EQU   RPHWORK+28                                               02139000
RPHSAVE7 EQU   RPHWORK+24                                               02140000
RPHSAVE6 EQU   RPHWORK+20                                               02141000
RPHSAVE5 EQU   RPHWORK+16                                               02142000
RPHSAVE4 EQU   RPHWORK+12                                               02143000
RPHSAVE3 EQU   RPHWORK+8                                                02144000
RPHSAVE2 EQU   RPHWORK+4                                                02145000
RPHSHALF EQU   RPHSAVE1+2                                               02146000
RPHSBIT8 EQU   RPHSBITS                                                 02147000
RPHSBIT7 EQU   RPHSBITS                                                 02148000
RPHSBIT6 EQU   RPHSBITS                                                 02149000
RPHSBIT5 EQU   RPHSBITS                                                 02150000
RPHSBIT4 EQU   RPHSBITS                                                 02151000
RPHSBIT3 EQU   RPHSBITS                                                 02152000
RPHSBIT2 EQU   RPHSBITS                                                 02153000
RPHSBIT1 EQU   RPHSBITS                                                 02154000
RPHSBYTE EQU   RPHSAVE1                                                 02155000
RPHPABFG EQU   RPHPABQA                                                 02156000
RPHSRP34 EQU   RPHSRPRM+2                                               02157000
RPHSRP12 EQU   RPHSRPRM                                                 02158000
RPHWEGT  EQU   RPHCSPA                                                  02159000
RPHRESUM EQU   RPHRESMA+1                                               02160000
@NM00036 EQU   RPHWPFLG                                                 02161000
RPHPURGE EQU   RPHWPFLG                                                 02162000
RPHPT    EQU   RPHWPFLG                                                 02163000
RPHWT    EQU   RPHWPFLG                                                 02164000
RPHRSKEY EQU   RPHWPFLG                                                 02165000
RPHDVTA  EQU   ISTRPH+12                                                02166000
RPHTIK   EQU   RPHTSKID+3                                               02167000
@NM00035 EQU   RPHTSKID                                                 02168000
RPHRPHAP EQU   RPHRPHA+1                                                02169000
@NM00034 EQU   RPHRPHA                                                  02170000
RPHGATE  EQU   RPHRPHA                                                  02171000
RPHABEND EQU   RPHFLGB                                                  02172000
RPHUWAIT EQU   RPHFLGB                                                  02173000
@NM00033 EQU   RPHFLGB                                                  02174000
RPHFBAPS EQU   RPHFLGB                                                  02175000
RPHBSSP  EQU   RPHFLGB                                                  02176000
RPHLOCK  EQU   RPHFLGB                                                  02177000
RPHFNFLG EQU   RPHFSTLC                                                 02178000
RPHMLTCP EQU   RPHFLAGS                                                 02179000
RPHSMCLR EQU   RPHFLAGS                                                 02180000
RPHSMTYP EQU   RPHFLAGS                                                 02181000
RPHSMQ   EQU   RPHFLAGS                                                 02182000
RPHAPTYP EQU   RPHFLAGS                                                 02183000
RPHSPGIN EQU   RPHFLAGS                                                 02184000
RPHOGIND EQU   RPHFLAGS                                                 02185000
RPHLNGTH EQU   RPHCNTL+1                                                02186000
RPHTYPE  EQU   RPHCNTL                                                  02187000
DYPOCRPH EQU   DYPPACMD                                                 02188000
DYPPACTB EQU   DYPCHAIN                                                 02189000
DYPFLGS  EQU   ISTDYPAB+2                                               02190000
DYPLNGTH EQU   ISTDYPAB+1                                               02191000
DYPTYPE  EQU   ISTDYPAB                                                 02192000
PABNODQ  EQU   PABFLAGS                                                 02193000
PABINHBT EQU   PABFLAGS                                                 02194000
PABERLOK EQU   PABERRLK                                                 02195000
PABSSN   EQU   PABFLAGS                                                 02196000
PABXTND  EQU   PABFLAGS                                                 02197000
PABPRIOR EQU   PABFLAGS                                                 02198000
PABAPYP  EQU   PABFLAGS                                                 02199000
PABDVTA  EQU   ISTPAB+9                                                 02200000
PABRSV02 EQU   PABCHAIN                                                 02201000
PABDELAY EQU   PABCHAIN                                                 02202000
PABQUED  EQU   PABRUNNG                                                 02203000
PABRESET EQU   PABCHAIN                                                 02204000
PABUNCON EQU   PABCHAIN                                                 02205000
PABCDP   EQU   PABCHAIN                                                 02206000
PABRESCH EQU   PABCHAIN                                                 02207000
PABCHNG  EQU   PABCHAIN                                                 02208000
PABWEQP  EQU   PABWEQA+1                                                02209000
PABRSV01 EQU   PABWEQA                                                  02210000
PABWEQG  EQU   PABWEQA                                                  02211000
LOKXCL   EQU   @NM00030                                                 02212000
LOKPRY   EQU   @NM00030                                                 02213000
@NM00031 EQU   @NM00030                                                 02214000
@NM00029 EQU   LOKCHNG                                                  02215000
LOKCT    EQU   ISTLOK                                                   02216000
CVTLEVL  EQU   CVTRELNO+2                                               02217000
CVTNUMB  EQU   CVTRELNO                                                 02218000
CVTMDL   EQU   CVTFIX+250                                               02219000
@NM00028 EQU   CVTFIX+248                                               02220000
@NM00027 EQU   CVTFIX                                                   02221000
CVTRV482 EQU   CVTXTNT2+128                                             02222000
CVTRV481 EQU   CVTXTNT2+124                                             02223000
CVTRV480 EQU   CVTXTNT2+120                                             02224000
CVTRV479 EQU   CVTXTNT2+118                                             02225000
CVTRV478 EQU   CVTXTNT2+117                                             02226000
CVTRV477 EQU   CVTXTNT2+116                                             02227000
CVTRV476 EQU   CVTXTNT2+115                                             02228000
CVTRV475 EQU   CVTXTNT2+114                                             02229000
CVTRV474 EQU   CVTRV466                                                 02230000
CVTRV473 EQU   CVTRV466                                                 02231000
CVTRV472 EQU   CVTRV466                                                 02232000
CVTRV471 EQU   CVTRV466                                                 02233000
CVTRV470 EQU   CVTRV466                                                 02234000
CVTRV469 EQU   CVTRV466                                                 02235000
CVTRV468 EQU   CVTRV466                                                 02236000
CVTRV467 EQU   CVTRV466                                                 02237000
CVTRV465 EQU   CVTRV457                                                 02238000
CVTRV464 EQU   CVTRV457                                                 02239000
CVTRV463 EQU   CVTRV457                                                 02240000
CVTRV462 EQU   CVTRV457                                                 02241000
CVTRV461 EQU   CVTRV457                                                 02242000
CVTRV460 EQU   CVTRV457                                                 02243000
CVTRV459 EQU   CVTRV457                                                 02244000
CVTRV458 EQU   CVTRV457                                                 02245000
CVTRV456 EQU   CVTXTNT2+108                                             02246000
CVTRV455 EQU   CVTXTNT2+104                                             02247000
CVTRV454 EQU   CVTXTNT2+100                                             02248000
CVTRV453 EQU   CVTXTNT2+96                                              02249000
CVTRV452 EQU   CVTXTNT2+94                                              02250000
CVTRV451 EQU   CVTXTNT2+92                                              02251000
CVTRV450 EQU   CVTXTNT2+90                                              02252000
CVTRV449 EQU   CVTXTNT2+88                                              02253000
CVTRV448 EQU   CVTXTNT2+87                                              02254000
CVTRV447 EQU   CVTXTNT2+86                                              02255000
CVTRV446 EQU   CVTRV438                                                 02256000
CVTRV445 EQU   CVTRV438                                                 02257000
CVTRV444 EQU   CVTRV438                                                 02258000
CVTRV443 EQU   CVTRV438                                                 02259000
CVTRV442 EQU   CVTRV438                                                 02260000
CVTRV441 EQU   CVTRV438                                                 02261000
CVTRV440 EQU   CVTRV438                                                 02262000
CVTRV439 EQU   CVTRV438                                                 02263000
CVTRV437 EQU   CVTRV429                                                 02264000
CVTRV436 EQU   CVTRV429                                                 02265000
CVTRV435 EQU   CVTRV429                                                 02266000
CVTRV434 EQU   CVTRV429                                                 02267000
CVTRV433 EQU   CVTRV429                                                 02268000
CVTRV432 EQU   CVTRV429                                                 02269000
CVTRV431 EQU   CVTRV429                                                 02270000
CVTRV430 EQU   CVTRV429                                                 02271000
CVTRV428 EQU   CVTXTNT2+80                                              02272000
CVTRV427 EQU   CVTXTNT2+76                                              02273000
CVTRV426 EQU   CVTXTNT2+72                                              02274000
CVTRV425 EQU   CVTXTNT2+68                                              02275000
CVTATACT EQU   CVTATCVT                                                 02276000
CVTRV423 EQU   CVTXTNT2+62                                              02277000
CVTRV422 EQU   CVTXTNT2+60                                              02278000
CVTRV421 EQU   CVTXTNT2+58                                              02279000
CVTRV420 EQU   CVTXTNT2+56                                              02280000
CVTRV419 EQU   CVTXTNT2+55                                              02281000
CVTRV418 EQU   CVTXTNT2+54                                              02282000
CVTRV417 EQU   CVTRV409                                                 02283000
CVTRV416 EQU   CVTRV409                                                 02284000
CVTRV415 EQU   CVTRV409                                                 02285000
CVTRV414 EQU   CVTRV409                                                 02286000
CVTRV413 EQU   CVTRV409                                                 02287000
CVTRV412 EQU   CVTRV409                                                 02288000
CVTRV411 EQU   CVTRV409                                                 02289000
CVTRV410 EQU   CVTRV409                                                 02290000
CVTRV408 EQU   CVTRV400                                                 02291000
CVTRV407 EQU   CVTRV400                                                 02292000
CVTRV406 EQU   CVTRV400                                                 02293000
CVTRV405 EQU   CVTRV400                                                 02294000
CVTRV404 EQU   CVTRV400                                                 02295000
CVTRV403 EQU   CVTRV400                                                 02296000
CVTRV402 EQU   CVTRV400                                                 02297000
CVTRV401 EQU   CVTRV400                                                 02298000
CVTICB   EQU   CVTXTNT2+48                                              02299000
CVTSKTA  EQU   CVTXTNT2+44                                              02300000
CVTCCVT  EQU   CVTXTNT2+40                                              02301000
CVTRSV98 EQU   CVTXTNT2+36                                              02302000
CVTRSV97 EQU   CVTXTNT2+34                                              02303000
CVTRSV96 EQU   CVTXTNT2+32                                              02304000
CVTOLTEP EQU   CVTXTNT2+28                                              02305000
CVTQIDA  EQU   CVTQID+1                                                 02306000
CVTRSV95 EQU   CVTQID                                                   02307000
CVTRSV94 EQU   CVTXTNT2+20                                              02308000
CVTRSV93 EQU   CVTXTNT2+16                                              02309000
CVTRSV92 EQU   CVTXTNT2+12                                              02310000
CVTDEBVR EQU   CVTXTNT2+8                                               02311000
CVTRSV91 EQU   CVTXTNT2+6                                               02312000
CVTRSV9H EQU   CVTFLGBT                                                 02313000
CVTRSV9G EQU   CVTFLGBT                                                 02314000
CVTRSV9F EQU   CVTFLGBT                                                 02315000
CVTRSV9E EQU   CVTFLGBT                                                 02316000
CVTRSV9D EQU   CVTFLGBT                                                 02317000
CVTBAH   EQU   CVTFLGBT                                                 02318000
CVTVME   EQU   CVTFLGBT                                                 02319000
CVTNPE   EQU   CVTFLGBT                                                 02320000
CVTNUCLS EQU   CVTXTNT2+4                                               02321000
CVTDSSVA EQU   CVTDSSV+1                                                02322000
CVTRSV89 EQU   CVTDSSV                                                  02323000
CVTRSV88 EQU   CVTXTNT1+8                                               02324000
CVTRSV87 EQU   CVTXTNT1+4                                               02325000
CVTFACHN EQU   CVTXTNT1                                                 02326000
CVTRV488 EQU   CVTMAP+412                                               02327000
CVTRV487 EQU   CVTMAP+408                                               02328000
CVTRV486 EQU   CVTMAP+404                                               02329000
CVTRV485 EQU   CVTMAP+400                                               02330000
CVTACTAP EQU   CVTMAP+396                                               02331000
CVTAUTH  EQU   CVTMAP+392                                               02332000
CVTRV490 EQU   CVTMAP+388                                               02333000
CVTSU    EQU   CVTMAP+384                                               02334000
CVTVOLT1 EQU   CVTVOLM1+1                                               02335000
CVTVOLI1 EQU   CVTVOLF1                                                 02336000
CVTSTOA  EQU   CVTMAP+376                                               02337000
CVTRSV58 EQU   CVTMAP+374                                               02338000
CVTRSV57 EQU   CVTMAP+372                                               02339000
CVTDDCE  EQU   CVTMAP+368                                               02340000
CVTPNWFR EQU   CVTMAP+364                                               02341000
CVTSMF   EQU   CVTMAP+360                                               02342000
CVTSULK  EQU   CVTMAP+358                                               02343000
CVTSLKO  EQU   CVTSYSK                                                  02344000
CVTSLKP  EQU   CVTSYSK                                                  02345000
CVTSLKQ  EQU   CVTSYSK                                                  02346000
CVTSLKR  EQU   CVTSYSK                                                  02347000
CVTRSV56 EQU   CVTSYSK                                                  02348000
CVTRSV55 EQU   CVTSYSK                                                  02349000
CVTRSV54 EQU   CVTSYSK                                                  02350000
CVTRSV53 EQU   CVTSYSK                                                  02351000
CVTRSV52 EQU   CVTA1F1                                                  02352000
CVTRSV51 EQU   CVTA1F1                                                  02353000
CVTRSV50 EQU   CVTA1F1                                                  02354000
CVTRSV49 EQU   CVTA1F1                                                  02355000
CVTRSV48 EQU   CVTA1F1                                                  02356000
CVTRSV47 EQU   CVTA1F1                                                  02357000
CVTSRSW  EQU   CVTA1F1                                                  02358000
CVTPFSW  EQU   CVTA1F1                                                  02359000
CVTPCVT  EQU   CVTMAP+352                                               02360000
CVTRSV46 EQU   CVTMAP+344                                               02361000
CVTRSV45 EQU   CVTMAP+340                                               02362000
CVTRSV44 EQU   CVTMAP+338                                               02363000
CVTRSV43 EQU   CVTMAP+336                                               02364000
CVTHJESA EQU   CVTHJES+1                                                02365000
CVTRSV42 EQU   CVTHJES                                                  02366000
CVTEXT2A EQU   CVTEXT2+1                                                02367000
CVTRSV41 EQU   CVTEXT2                                                  02368000
CVTAPFA  EQU   CVTAPF+1                                                 02369000
CVTRSV40 EQU   CVTAPF                                                   02370000
CVTRV518 EQU   CVTINTLA                                                 02371000
CVTRV517 EQU   CVTERPV                                                  02372000
CVTEORM  EQU   CVTMAP+312                                               02373000
CVTMCHPR EQU   CVTMAP+308                                               02374000
CVTTZ    EQU   CVTMAP+304                                               02375000
CVTJEPS  EQU   CVTMAP+300                                               02376000
CVTJESCT EQU   CVTMAP+296                                               02377000
CVTMODE  EQU   CVTMAP+292                                               02378000
CVTPTRV  EQU   CVTMAP+288                                               02379000
CVTREAL  EQU   CVTMAP+284                                               02380000
CVTRSV39 EQU   CVTMAP+280                                               02381000
CVTRSV38 EQU   CVTMAP+276                                               02382000
CVTDMSRA EQU   CVTDMSR+1                                                02383000
CVTRV634 EQU   CVTDMSRF                                                 02384000
CVTRV633 EQU   CVTDMSRF                                                 02385000
CVTRV632 EQU   CVTDMSRF                                                 02386000
CVTRV631 EQU   CVTDMSRF                                                 02387000
CVTRV630 EQU   CVTDMSRF                                                 02388000
CVTRV629 EQU   CVTDMSRF                                                 02389000
CVTUDUMP EQU   CVTDMSRF                                                 02390000
CVTSDUMP EQU   CVTDMSRF                                                 02391000
CVTQMSGA EQU   CVTQMSG+1                                                02392000
CVTRSV36 EQU   CVTQMSG                                                  02393000
CVTAMFF  EQU   CVTMAP+264                                               02394000
CVTPURGA EQU   CVTPURG+1                                                02395000
CVTRSV35 EQU   CVTPURG                                                  02396000
CVTCBSP  EQU   CVTMAP+256                                               02397000
CVTATERA EQU   CVTATER+1                                                02398000
CVTSYST  EQU   CVTATER                                                  02399000
CVTVOLT2 EQU   CVTTAT                                                   02400000
CVTVOLI2 EQU   CVTVOLF2                                                 02401000
CVTAQAVB EQU   CVTAQAVT+1                                               02402000
CVTRSV34 EQU   CVTTCMFG                                                 02403000
CVTRSV33 EQU   CVTTCMFG                                                 02404000
CVTRSV32 EQU   CVTTCMFG                                                 02405000
CVTRSV31 EQU   CVTTCMFG                                                 02406000
CVTRSV30 EQU   CVTTCMFG                                                 02407000
CVTRSV29 EQU   CVTTCMFG                                                 02408000
CVTLDEV  EQU   CVTTCMFG                                                 02409000
CVTTCRDY EQU   CVTTCMFG                                                 02410000
CVTGTFA  EQU   CVTGTF+1                                                 02411000
CVTRSV27 EQU   CVTGTFST                                                 02412000
CVTRNIO  EQU   CVTGTFST                                                 02413000
CVTUSR   EQU   CVTGTFST                                                 02414000
CVTRV318 EQU   CVTFORM                                                  02415000
CVTRV317 EQU   CVTTMODE                                                 02416000
CVTRV316 EQU   CVTSTATE                                                 02417000
CVTRV315 EQU   CVTGTFS                                                  02418000
CVTGTFAV EQU   CVTGTFS                                                  02419000
CVT0SCR1 EQU   CVTMAP+232                                               02420000
CVTRV515 EQU   CVTMAP+228                                               02421000
CVTRMS   EQU   CVTMAP+224                                               02422000
CVTPATCH EQU   CVTMAP+220                                               02423000
CVTTSCE  EQU   CVTMAP+216                                               02424000
CVTLNKSC EQU   CVTMAP+214                                               02425000
CVTQABST EQU   CVTMAP+212                                               02426000
CVTMDLDS EQU   CVTMAP+208                                               02427000
CVTUSER  EQU   CVTMAP+204                                               02428000
CVTABEND EQU   CVTMAP+200                                               02429000
CVTSMCA  EQU   CVTMAP+196                                               02430000
CVTRSV18 EQU   CVTMAP+192                                               02431000
CVTQLPAQ EQU   CVTMAP+188                                               02432000
CVTQCDSR EQU   CVTMAP+184                                               02433000
CVTVS1B  EQU   CVTOPTB                                                  02434000
CVTVS1A  EQU   CVTOPTB                                                  02435000
CVTFP    EQU   CVTOPTB                                                  02436000
CVTAPTHR EQU   CVTOPTB                                                  02437000
CVTNLOG  EQU   CVTOPTB                                                  02438000
CVTTOD   EQU   CVTOPTB                                                  02439000
CVTCTIMS EQU   CVTOPTB                                                  02440000
CVTPROT  EQU   CVTOPTB                                                  02441000
CVTXPFP  EQU   CVTOPTA                                                  02442000
CVTASCII EQU   CVTOPTA                                                  02443000
CVTRSV13 EQU   CVTOPTA                                                  02444000
CVTRSV12 EQU   CVTOPTA                                                  02445000
CVTNIP   EQU   CVTOPTA                                                  02446000
CVTDDR   EQU   CVTOPTA                                                  02447000
CVTAPR   EQU   CVTOPTA                                                  02448000
CVTCCH   EQU   CVTOPTA                                                  02449000
CVTSNCTR EQU   CVTMAP+180                                               02450000
CVTQMWR  EQU   CVTMAP+176                                               02451000
CVTQOCR  EQU   CVTMAP+172                                               02452000
CVT1EF00 EQU   CVTMAP+168                                               02453000
CVTMZ00  EQU   CVTMAP+164                                               02454000
CVTHEAD  EQU   CVTMAP+160                                               02455000
CVTRSV11 EQU   CVTMAP+156                                               02456000
CVT0PT01 EQU   CVTMAP+152                                               02457000
CVTMSER  EQU   CVTMAP+148                                               02458000
CVTRV516 EQU   CVTIERLC                                                 02459000
CVTILCH  EQU   CVTMAP+140                                               02460000
CVT0DS   EQU   CVTMAP+136                                               02461000
CVTFBOSV EQU   CVTMAP+132                                               02462000
CVTNUCB  EQU   CVTMAP+128                                               02463000
CVTIXAVL EQU   CVTMAP+124                                               02464000
CVTIOQET EQU   CVTMAP+120                                               02465000
CVTDCBA  EQU   CVTMAP+117                                               02466000
CVTMVS2  EQU   CVTDCB                                                   02467000
CVT6DAT  EQU   CVTDCB                                                   02468000
CVT4MPS  EQU   CVTDCB                                                   02469000
CVTRSV09 EQU   CVTDCB                                                   02470000
CVT4MS1  EQU   CVTDCB                                                   02471000
CVT2SPS  EQU   CVTDCB                                                   02472000
CVT1SSS  EQU   CVTDCB                                                   02473000
CVTRSV08 EQU   CVTDCB                                                   02474000
CVTSTB   EQU   CVTMAP+112                                               02475000
CVTQTD00 EQU   CVTMAP+108                                               02476000
CVTQTE00 EQU   CVTMAP+104                                               02477000
CVTCUCB  EQU   CVTMAP+100                                               02478000
CVTSJQ   EQU   CVTMAP+96                                                02479000
CVTPBLDL EQU   CVTMAP+92                                                02480000
CVTTPC   EQU   CVTMAP+88                                                02481000
CVTSVDCB EQU   CVTMAP+84                                                02482000
CVTBRET  EQU   CVTMAP+82                                                02483000
CVTEXIT  EQU   CVTMAP+80                                                02484000
CVT0FN00 EQU   CVTMAP+76                                                02485000
CVTDARA  EQU   CVTDAR+1                                                 02486000
CVTRSV07 EQU   CVTFLGS1                                                 02487000
CVTRSV06 EQU   CVTFLGS1                                                 02488000
CVTRSV05 EQU   CVTFLGS1                                                 02489000
CVTRSV04 EQU   CVTFLGS1                                                 02490000
CVTRSV03 EQU   CVTFLGS1                                                 02491000
CVTRSV02 EQU   CVTFLGS1                                                 02492000
CVTRSV01 EQU   CVTFLGS1                                                 02493000
CVTDMPLK EQU   CVTFLGS1                                                 02494000
CVTXITP  EQU   CVTMAP+68                                                02495000
CVTZDTAB EQU   CVTMAP+64                                                02496000
CVTMSLT  EQU   CVTMAP+60                                                02497000
CVTDATE  EQU   CVTMAP+56                                                02498000
CVTBTERM EQU   CVTMAP+52                                                02499000
CVTSYSAD EQU   CVTMAP+48                                                02500000
CVTXTLER EQU   CVTMAP+44                                                02501000
CVTILK2  EQU   CVTMAP+40                                                02502000
CVTILK1  EQU   CVTMAP+36                                                02503000
CVTPRLTV EQU   CVTMAP+32                                                02504000
CVTPCNVT EQU   CVTMAP+28                                                02505000
CVT0VL00 EQU   CVTMAP+24                                                02506000
CVTXAPG  EQU   CVTMAP+20                                                02507000
CVTBUF   EQU   CVTMAP+16                                                02508000
CVTJOB   EQU   CVTMAP+12                                                02509000
CVTLINK  EQU   CVTMAP+8                                                 02510000
CVT0EF00 EQU   CVTMAP+4                                                 02511000
CVTTCBP  EQU   CVTMAP                                                   02512000
CVT      EQU   CVTMAP                                                   02513000
@NM00002 EQU   SRBSECT+40                                               02514000
@NM00001 EQU   SRBSECT+38                                               02515000
SRBPRIOR EQU   SRBSECT+37                                               02516000
SRBPKF   EQU   SRBSECT+36                                               02517000
SRBSAVE  EQU   SRBSECT+32                                               02518000
SRBPARM  EQU   SRBSECT+28                                               02519000
SRBRMTR  EQU   SRBSECT+24                                               02520000
SRBEP    EQU   SRBSECT+20                                               02521000
SRBPTCB  EQU   SRBFLC+4                                                 02522000
SRBPASID EQU   SRBFLC+2                                                 02523000
SRBCPAFF EQU   SRBFLC                                                   02524000
SRBASCB  EQU   SRBSECT+8                                                02525000
SRBFLNK  EQU   SRBSECT+4                                                02526000
SRBID    EQU   SRBSECT                                                  02527000
ASXBEND  EQU   ASXB+232                                                 02528000
ASXBRV25 EQU   ASXB+228                                                 02529000
ASXBRV24 EQU   ASXB+224                                                 02530000
ASXBPT0E EQU   ASXB+220                                                 02531000
ASXBCRB4 EQU   ASXBCASW+3                                               02532000
ASXBCRB3 EQU   ASXBCASW+2                                               02533000
ASXBCRB2 EQU   ASXBCASW+1                                               02534000
ASXBCR06 EQU   ASXBCRB1                                                 02535000
ASXBCR05 EQU   ASXBCRB1                                                 02536000
ASXBCR04 EQU   ASXBCRB1                                                 02537000
ASXBCR03 EQU   ASXBCRB1                                                 02538000
ASXBCR02 EQU   ASXBCRB1                                                 02539000
ASXBCR01 EQU   ASXBCRB1                                                 02540000
ASXBTFD  EQU   ASXBCRB1                                                 02541000
ASXBPIP  EQU   ASXBCRB1                                                 02542000
ASXBCTDC EQU   ASXB+212                                                 02543000
ASXBTDCB EQU   ASXB+208                                                 02544000
ASXBRV19 EQU   ASXB+204                                                 02545000
ASXBRV18 EQU   ASXB+200                                                 02546000
ASXBRV17 EQU   ASXB+196                                                 02547000
ASXBRV16 EQU   ASXB+192                                                 02548000
ASXBLSRB EQU   ASXBAEQ+20                                               02549000
ASXBFSRB EQU   ASXBAEQ+16                                               02550000
ASXBLRQE EQU   ASXBAEQ+12                                               02551000
ASXBFRQE EQU   ASXBAEQ+8                                                02552000
ASXBLIQE EQU   ASXBAEQ+4                                                02553000
ASXBFIQE EQU   ASXBAEQ                                                  02554000
ASXBETSK EQU   ASXB+164                                                 02555000
ASXBSIRB EQU   ASXB+160                                                 02556000
ASXBPSWD EQU   ASXB+152                                                 02557000
ASXBPRG  EQU   ASXB+136                                                 02558000
ASXBRV26 EQU   ASXB+132                                                 02559000
ASXBOUSB EQU   ASXB+128                                                 02560000
ASXBDDR  EQU   ASXB+124                                                 02561000
ASXBRCTD EQU   ASXB+120                                                 02562000
ASXBRSMD EQU   ASXB+116                                                 02563000
ASXBSPSA EQU   ASXB+112                                                 02564000
ASXBFRWA EQU   ASXB+108                                                 02565000
ASXBFLSA EQU   ASXB+36                                                  02566000
ASXBIHSA EQU   ASXB+32                                                  02567000
ASXBRV15 EQU   ASXB+28                                                  02568000
ASXBRV14 EQU   ASXB+24                                                  02569000
ASXBLWA  EQU   ASXB+20                                                  02570000
ASXBRS00 EQU   ASXB+14                                                  02571000
ASXBTCBS EQU   ASXB+12                                                  02572000
ASXBLTCB EQU   ASXB+8                                                   02573000
ASXBFTCB EQU   ASXB+4                                                   02574000
ASXBASXB EQU   ASXB                                                     02575000
ASXBEGIN EQU   ASXB                                                     02576000
ASCBEND  EQU   ASCB+208                                                 02577000
ASCBSRBT EQU   ASCB+200                                                 02578000
ASCBSWTL EQU   ASCB+196                                                 02579000
ASCBRS14 EQU   ASCB+195                                                 02580000
ASCBSMCT EQU   ASCB+194                                                 02581000
ASCBRS12 EQU   ASCB+192                                                 02582000
ASCBPCTT EQU   ASCB+188                                                 02583000
ASCBVGTT EQU   ASCB+184                                                 02584000
ASCBRV43 EQU   ASCBSRQ4                                                 02585000
ASCBRV42 EQU   ASCBSRQ4                                                 02586000
ASCBRV41 EQU   ASCBSRQ4                                                 02587000
ASCBRV40 EQU   ASCBSRQ4                                                 02588000
ASCBRV39 EQU   ASCBSRQ4                                                 02589000
ASCBRV38 EQU   ASCBSRQ4                                                 02590000
ASCBRV37 EQU   ASCBSRQ4                                                 02591000
ASCBRV36 EQU   ASCBSRQ4                                                 02592000
ASCBRV35 EQU   ASCBSRQ3                                                 02593000
ASCBRV34 EQU   ASCBSRQ3                                                 02594000
ASCBRV33 EQU   ASCBSRQ3                                                 02595000
ASCBRV32 EQU   ASCBSRQ3                                                 02596000
ASCBRV31 EQU   ASCBSRQ3                                                 02597000
ASCBRV30 EQU   ASCBSRQ3                                                 02598000
ASCBRV29 EQU   ASCBSRQ3                                                 02599000
ASCBRV28 EQU   ASCBSRQ3                                                 02600000
ASCBRV27 EQU   ASCBSRQ2                                                 02601000
ASCBRV26 EQU   ASCBSRQ2                                                 02602000
ASCBRV25 EQU   ASCBSRQ2                                                 02603000
ASCBRV24 EQU   ASCBSRQ2                                                 02604000
ASCBRV23 EQU   ASCBSRQ2                                                 02605000
ASCBRV22 EQU   ASCBSRQ2                                                 02606000
ASCBRV21 EQU   ASCBSRQ2                                                 02607000
ASCBRV20 EQU   ASCBSRQ2                                                 02608000
ASCBRV19 EQU   ASCBSRQ1                                                 02609000
ASCBRV18 EQU   ASCBSRQ1                                                 02610000
ASCBRV17 EQU   ASCBSRQ1                                                 02611000
ASCBRV16 EQU   ASCBSRQ1                                                 02612000
ASCBRV15 EQU   ASCBSRQ1                                                 02613000
ASCBRV14 EQU   ASCBSRQ1                                                 02614000
ASCBRV13 EQU   ASCBSRQ1                                                 02615000
ASCBSTA  EQU   ASCBSRQ1                                                 02616000
ASCBJBNS EQU   ASCB+176                                                 02617000
ASCBJBNI EQU   ASCB+172                                                 02618000
ASCBMCC  EQU   ASCB+168                                                 02619000
ASCBRTWA EQU   ASCB+164                                                 02620000
ASCBIQEA EQU   ASCB+160                                                 02621000
ASCBXMPQ EQU   ASCB+156                                                 02622000
ASCBRS01 EQU   ASCB+154                                                 02623000
ASCBFMCT EQU   ASCB+152                                                 02624000
ASCBOUXB EQU   ASCB+148                                                 02625000
ASCBOUCB EQU   ASCB+144                                                 02626000
ASCBMECB EQU   ASCB+140                                                 02627000
ASCBQECB EQU   ASCB+136                                                 02628000
ASCBLSQH EQU   ASCBLKGP+4                                               02629000
ASCBLOCK EQU   ASCBLKGP                                                 02630000
ASCBTCBS EQU   ASCB+124                                                 02631000
ASCBNVSC EQU   ASCB+122                                                 02632000
ASCBVSC  EQU   ASCB+120                                                 02633000
ASCBSRBS EQU   ASCB+118                                                 02634000
ASCBSSRB EQU   ASCB+116                                                 02635000
ASCBRV06 EQU   ASCBFLG2                                                 02636000
ASCBRV05 EQU   ASCBFLG2                                                 02637000
ASCBRV04 EQU   ASCBFLG2                                                 02638000
ASCBSNQS EQU   ASCBFLG2                                                 02639000
ASCBS2S  EQU   ASCBFLG2                                                 02640000
ASCBCEXT EQU   ASCBFLG2                                                 02641000
ASCBPXMT EQU   ASCBFLG2                                                 02642000
ASCBXMPT EQU   ASCBFLG2                                                 02643000
ASCBRF07 EQU   ASCBDSP1                                                 02644000
ASCBRF06 EQU   ASCBDSP1                                                 02645000
ASCBRF05 EQU   ASCBDSP1                                                 02646000
ASCBRF04 EQU   ASCBDSP1                                                 02647000
ASCBRF03 EQU   ASCBDSP1                                                 02648000
ASCBRF02 EQU   ASCBDSP1                                                 02649000
ASCBFAIL EQU   ASCBDSP1                                                 02650000
ASCBNOQ  EQU   ASCBDSP1                                                 02651000
ASCBSWCT EQU   ASCB+112                                                 02652000
ASCBTMCH EQU   ASCB+104                                                 02653000
ASCBNSWP EQU   ASCBFLG1                                                 02654000
ASCBTYP1 EQU   ASCBFLG1                                                 02655000
ASCBSTND EQU   ASCBFLG1                                                 02656000
ASCBABNT EQU   ASCBFLG1                                                 02657000
ASCBTERM EQU   ASCBFLG1                                                 02658000
ASCBS3S  EQU   ASCBFLG1                                                 02659000
ASCBCMSH EQU   ASCBFLG1                                                 02660000
ASCBTOFF EQU   ASCBFLG1                                                 02661000
ASCBRF01 EQU   ASCBRCTF                                                 02662000
ASCBTMLW EQU   ASCBRCTF                                                 02663000
ASCBOUT  EQU   ASCBRCTF                                                 02664000
ASCBWAIT EQU   ASCBRCTF                                                 02665000
ASCBRV08 EQU   ASCBRCTF                                                 02666000
ASCBFQU  EQU   ASCBRCTF                                                 02667000
ASCBFRS  EQU   ASCBRCTF                                                 02668000
ASCBTMNO EQU   ASCBRCTF                                                 02669000
ASCBAFFN EQU   ASCBFW1                                                  02670000
ASCBDUMP EQU   ASCB+96                                                  02671000
ASCBQSVC EQU   ASCB+92                                                  02672000
ASCBUBET EQU   ASCB+88                                                  02673000
ASCBECB  EQU   ASCB+84                                                  02674000
ASCBJSTL EQU   ASCB+80                                                  02675000
ASCBEWST EQU   ASCB+72                                                  02676000
ASCBEJST EQU   ASCB+64                                                  02677000
ASCBTSB  EQU   ASCB+60                                                  02678000
ASCBCSCB EQU   ASCB+56                                                  02679000
ASCBRSM  EQU   ASCB+52                                                  02680000
ASCBLDA  EQU   ASCB+48                                                  02681000
ASCBSTOR EQU   ASCB+44                                                  02682000
ASCBDP   EQU   ASCB+43                                                  02683000
ASCBRV07 EQU   ASCB+42                                                  02684000
ASCBIOSM EQU   ASCB+40                                                  02685000
ASCBSEQN EQU   ASCB+38                                                  02686000
ASCBASID EQU   ASCB+36                                                  02687000
ASCBCPUS EQU   ASCB+32                                                  02688000
ASCBSPL  EQU   ASCB+28                                                  02689000
ASCBIOSP EQU   ASCB+24                                                  02690000
ASCBSYNC EQU   ASCBSUPC+4                                               02691000
ASCBSVRB EQU   ASCBSUPC                                                 02692000
ASCBCMSF EQU   ASCB+12                                                  02693000
ASCBBWDP EQU   ASCB+8                                                   02694000
ASCBFWDP EQU   ASCB+4                                                   02695000
ASCBASCB EQU   ASCB                                                     02696000
ASCBEGIN EQU   ASCB                                                     02697000
@NM00026 EQU   PSA+3668                                                 02698000
PSASTAK  EQU   PSA+3072                                                 02699000
@NM00025 EQU   PSA+1048                                                 02700000
PSAUSEND EQU   PSA+1048                                                 02701000
PSARV062 EQU   PSA+1044                                                 02702000
PSACDAL  EQU   PSA+1040                                                 02703000
PSAWTCOD EQU   PSA+1036                                                 02704000
PSAATCVT EQU   PSA+1032                                                 02705000
PSAPCPSW EQU   PSA+1024                                                 02706000
PSAPIR2  EQU   PSA+1020                                                 02707000
PSARV059 EQU   PSA+1018                                                 02708000
PSASVC13 EQU   PSA+1016                                                 02709000
PSALSFCC EQU   PSA+1012                                                 02710000
PSASFACC EQU   PSA+1008                                                 02711000
PSASTOP  EQU   PSA+992                                                  02712000
PSASTART EQU   PSA+976                                                  02713000
PSARSPSW EQU   PSA+968                                                  02714000
PSASRPSW EQU   PSA+960                                                  02715000
PSARV045 EQU   PSA+892                                                  02716000
PSARV044 EQU   PSA+888                                                  02717000
PSARV043 EQU   PSA+884                                                  02718000
PSARV042 EQU   PSA+880                                                  02719000
PSARV041 EQU   PSA+876                                                  02720000
PSARV040 EQU   PSA+872                                                  02721000
PSARV025 EQU   PSA+868                                                  02722000
PSADSSED EQU   PSA+868                                                  02723000
PSADSSPR EQU   PSA+864                                                  02724000
PSADSSFW EQU   PSA+860                                                  02725000
PSADSS14 EQU   PSA+856                                                  02726000
PSADSSPP EQU   PSA+848                                                  02727000
PSADSSRP EQU   PSA+840                                                  02728000
PSADSS05 EQU   PSADSSF4                                                 02729000
PSADSS10 EQU   PSADSSF4                                                 02730000
PSADSSVE EQU   PSADSSF4                                                 02731000
PSADSSDE EQU   PSADSSF4                                                 02732000
PSADSSC0 EQU   PSADSSF4                                                 02733000
PSADSSIE EQU   PSADSSF4                                                 02734000
PSADSS12 EQU   PSADSSF4                                                 02735000
PSADSSRC EQU   PSADSSF4                                                 02736000
PSARV057 EQU   PSADSSF3                                                 02737000
PSARV056 EQU   PSADSSF3                                                 02738000
PSARV055 EQU   PSADSSF3                                                 02739000
PSADSSMC EQU   PSADSSF3                                                 02740000
PSADSSRW EQU   PSADSSF3                                                 02741000
PSADSSNM EQU   PSADSSF3                                                 02742000
PSADSSES EQU   PSADSSF3                                                 02743000
PSADSSGP EQU   PSADSSF3                                                 02744000
PSADSSF2 EQU   PSADSSFL+1                                               02745000
PSADSSPI EQU   PSADSSF1                                                 02746000
PSADSSOI EQU   PSADSSF1                                                 02747000
PSADSSSP EQU   PSADSSF1                                                 02748000
PSADSSTP EQU   PSADSSF1                                                 02749000
PSADSSDW EQU   PSADSSF1                                                 02750000
PSADSSDD EQU   PSADSSF1                                                 02751000
PSADSSDM EQU   PSADSSF1                                                 02752000
PSADSSMV EQU   PSADSSF1                                                 02753000
PSADSSTS EQU   PSA+816                                                  02754000
PSADSSWK EQU   PSA+812                                                  02755000
PSADSSR3 EQU   PSA+808                                                  02756000
PSADSSR2 EQU   PSA+804                                                  02757000
PSADSSRS EQU   PSA+800                                                  02758000
PSASTOR  EQU   PSA+796                                                  02759000
PSACPUSA EQU   PSA+794                                                  02760000
PSAVSTAP EQU   PSA+792                                                  02761000
PSAWKVAP EQU   PSA+788                                                  02762000
PSAWKRAP EQU   PSA+784                                                  02763000
PSAMCHIC EQU   PSA+783                                                  02764000
PSARV061 EQU   PSA+782                                                  02765000
PSASYMSK EQU   PSA+781                                                  02766000
PSAMCHFL EQU   PSA+780                                                  02767000
PSACR0   EQU   PSA+776                                                  02768000
PSAPSWSV EQU   PSA+768                                                  02769000
PSALITA  EQU   PSA+764                                                  02770000
PSACLHS  EQU   PSAHLHI                                                  02771000
PSALKR15 EQU   PSALKSA+60                                               02772000
PSALKR14 EQU   PSALKSA+56                                               02773000
PSALKR13 EQU   PSALKSA+52                                               02774000
PSALKR12 EQU   PSALKSA+48                                               02775000
PSALKR11 EQU   PSALKSA+44                                               02776000
PSALKR10 EQU   PSALKSA+40                                               02777000
PSALKR9  EQU   PSALKSA+36                                               02778000
PSALKR8  EQU   PSALKSA+32                                               02779000
PSALKR7  EQU   PSALKSA+28                                               02780000
PSALKR6  EQU   PSALKSA+24                                               02781000
PSALKR5  EQU   PSALKSA+20                                               02782000
PSALKR4  EQU   PSALKSA+16                                               02783000
PSALKR3  EQU   PSALKSA+12                                               02784000
PSALKR2  EQU   PSALKSA+8                                                02785000
PSALKR1  EQU   PSALKSA+4                                                02786000
PSALKR0  EQU   PSALKSA                                                  02787000
PSARV023 EQU   PSACLHT+52                                               02788000
PSALOCAL EQU   PSACLHT+48                                               02789000
PSACMSL  EQU   PSACLHT+44                                               02790000
PSAOPTL  EQU   PSACLHT+40                                               02791000
PSATPACL EQU   PSACLHT+36                                               02792000
PSATPDNL EQU   PSACLHT+32                                               02793000
PSATPNCL EQU   PSACLHT+28                                               02794000
PSAIOSLL EQU   PSACLHT+24                                               02795000
PSAIOSUL EQU   PSACLHT+20                                               02796000
PSAIOSCL EQU   PSACLHT+16                                               02797000
PSAIOSSL EQU   PSACLHT+12                                               02798000
PSASALCL EQU   PSACLHT+8                                                02799000
PSAASML  EQU   PSACLHT+4                                                02800000
PSADISPL EQU   PSACLHT                                                  02801000
PSASRSA  EQU   PSA+636                                                  02802000
PSARV050 EQU   PSA+634                                                  02803000
PSADSSGO EQU   PSA+633                                                  02804000
PSARECUR EQU   PSA+632                                                  02805000
PSAHLHIS EQU   PSA+628                                                  02806000
PSAIPCSA EQU   PSA+624                                                  02807000
@NM00024 EQU   PSA+621                                                  02808000
PSAIPCDM EQU   PSA+620                                                  02809000
PSAIPCD  EQU   PSA+616                                                  02810000
@NM00023 EQU   PSA+613                                                  02811000
PSAIPCRM EQU   PSA+612                                                  02812000
PSAIPCR  EQU   PSA+608                                                  02813000
PSAMCHEX EQU   PSA+600                                                  02814000
PSAMPSW  EQU   PSA+592                                                  02815000
PSAEXPS2 EQU   PSA+584                                                  02816000
PSAEXPS1 EQU   PSA+576                                                  02817000
PSAPIREG EQU   PSA+572                                                  02818000
PSARSREG EQU   PSA+568                                                  02819000
PSAGPREG EQU   PSA+556                                                  02820000
PSARV022 EQU   PSASUP4                                                  02821000
PSARV021 EQU   PSASUP4                                                  02822000
PSARV020 EQU   PSASUP4                                                  02823000
PSARV019 EQU   PSASUP4                                                  02824000
PSARV018 EQU   PSASUP4                                                  02825000
PSARV017 EQU   PSASUP4                                                  02826000
PSARV016 EQU   PSASUP4                                                  02827000
PSARV015 EQU   PSASUP4                                                  02828000
PSARV014 EQU   PSASUP3                                                  02829000
PSARV013 EQU   PSASUP3                                                  02830000
PSARV012 EQU   PSASUP3                                                  02831000
PSARV011 EQU   PSASUP3                                                  02832000
PSASPR   EQU   PSASUP3                                                  02833000
PSAPSREG EQU   PSASUP3                                                  02834000
PSAPI2   EQU   PSASUP3                                                  02835000
PSAIOSUP EQU   PSASUP3                                                  02836000
PSALCR   EQU   PSASUP2                                                  02837000
PSARTM   EQU   PSASUP2                                                  02838000
PSAACR   EQU   PSASUP2                                                  02839000
PSAIPCE2 EQU   PSASUP2                                                  02840000
PSAIPCES EQU   PSASUP2                                                  02841000
PSAIPCEC EQU   PSASUP2                                                  02842000
PSAGTF   EQU   PSASUP2                                                  02843000
PSAIPCRI EQU   PSASUP2                                                  02844000
PSARV063 EQU   PSASUP1                                                  02845000
PSATCTL  EQU   PSASUP1                                                  02846000
PSADISP  EQU   PSASUP1                                                  02847000
PSALOCK  EQU   PSASUP1                                                  02848000
PSAPI    EQU   PSASUP1                                                  02849000
PSAEXT   EQU   PSASUP1                                                  02850000
PSASVC   EQU   PSASUP1                                                  02851000
PSAIO    EQU   PSASUP1                                                  02852000
PSAANEW  EQU   PSA+544                                                  02853000
PSATOLD  EQU   PSA+540                                                  02854000
PSATNEW  EQU   PSA+536                                                  02855000
PSALCCAR EQU   PSA+532                                                  02856000
PSALCCAV EQU   PSA+528                                                  02857000
PSAPCCAR EQU   PSA+524                                                  02858000
PSAPCCAV EQU   PSA+520                                                  02859000
PSACPULA EQU   PSA+518                                                  02860000
PSACPUPA EQU   PSA+516                                                  02861000
PSAPSA   EQU   PSA+512                                                  02862000
FLCHDEND EQU   PSA+512                                                  02863000
FLCCRSAV EQU   FLCMCLA+280                                              02864000
FLCGRSAV EQU   FLCMCLA+216                                              02865000
FLCFPSAV EQU   FLCMCLA+184                                              02866000
FLCFLA   EQU   FLCMCLA+88                                               02867000
FLCRGNCD EQU   FLCMCLA+84                                               02868000
FLCFSAA  EQU   FLCFSA+1                                                 02869000
@NM00022 EQU   FLCFSA                                                   02870000
@NM00021 EQU   FLCMCLA+72                                               02871000
FLCMCIC  EQU   FLCMCLA+64                                               02872000
@NM00020 EQU   FLCMCLA+20                                               02873000
FLCIOAA  EQU   FLCIOA+1                                                 02874000
@NM00019 EQU   FLCIOA                                                   02875000
@NM00018 EQU   FLCMCLA+15                                               02876000
@NM00017 EQU   FLCMCLA+14                                               02877000
@NM00016 EQU   FLCMCLA+12                                               02878000
FLCLCL   EQU   FLCMCLA+8                                                02879000
FLCIOELA EQU   FLCIOEL+1                                                02880000
@NM00015 EQU   FLCIOEL                                                  02881000
FLCCHNID EQU   FLCMCLA                                                  02882000
@NM00014 EQU   PSA+160                                                  02883000
FLCMTRCD EQU   PSA+157                                                  02884000
@NM00013 EQU   PSA+156                                                  02885000
FLCPERA  EQU   FLCPER+1                                                 02886000
@NM00012 EQU   FLCPER                                                   02887000
@NM00011 EQU   PSA+151                                                  02888000
FLCPERCD EQU   PSA+150                                                  02889000
FLCMCNUM EQU   PSA+149                                                  02890000
@NM00010 EQU   PSA+148                                                  02891000
FLCTEAA  EQU   FLCTEA+1                                                 02892000
@NM00009 EQU   FLCTEA                                                   02893000
PSAPIPC  EQU   PSAPICOD                                                 02894000
PSAPIMC  EQU   PSAPICOD                                                 02895000
PSAPIPER EQU   PSAPICOD                                                 02896000
PSARV049 EQU   FLCPICOD                                                 02897000
FLCPILCB EQU   FLCPIILC                                                 02898000
@NM00008 EQU   FLCPIILC                                                 02899000
@NM00007 EQU   PSAEPPSW                                                 02900000
FLCSVCN  EQU   PSAESPSW+2                                               02901000
FLCSILCB EQU   FLCSVILC                                                 02902000
@NM00006 EQU   FLCSVILC                                                 02903000
@NM00005 EQU   PSAESPSW                                                 02904000
FLCEICOD EQU   PSAEEPSW+2                                               02905000
PSASPAD  EQU   PSAEEPSW                                                 02906000
@NM00004 EQU   PSA+128                                                  02907000
FLCINPSW EQU   PSA+120                                                  02908000
FLCMNPSW EQU   PSA+112                                                  02909000
FLCPNPSW EQU   PSA+104                                                  02910000
FLCSNPSW EQU   PSA+96                                                   02911000
FLCENPSW EQU   PSA+88                                                   02912000
FLCTRACE EQU   PSA+84                                                   02913000
FLCTIMER EQU   PSA+80                                                   02914000
FLCCVT2  EQU   PSA+76                                                   02915000
FLCCAW   EQU   PSA+72                                                   02916000
FLCCSW   EQU   PSA+64                                                   02917000
FLCIOPSW EQU   PSA+56                                                   02918000
FLCMOPSW EQU   PSA+48                                                   02919000
FLCPOPSW EQU   PSA+40                                                   02920000
FLCSOPSW EQU   PSA+32                                                   02921000
FLCEOPSW EQU   PSA+24                                                   02922000
@NM00003 EQU   FLCICCW2+4                                               02923000
FLCCVT   EQU   FLCICCW2                                                 02924000
FLCICCW1 EQU   FLCROPSW                                                 02925000
FLCIPPSW EQU   FLCRNPSW                                                 02926000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02927000
@ENDDATA EQU   *                                                        02928000
         END   ISTAPC63,(C'PLS2009',0702,79045)                         02929000
