         TITLE 'ISTAPC56-PSS DISPATCHER SRB INTERFACE'                  00001000
ISTAPC56 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTAPC56  78.336'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@12                                         0001 00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
         PRINT OFF                                                      00014000
         PRINT ON                                                       00015000
*        SRBREG=REG0;                   /*SRB PTR PASSED BY CALLER   */ 00016000
         LR    SRBREG,REG0                                         0251 00017000
*        RFY (REG0) UNRSTD;                                        0252 00018000
*        PABREG=REG1;                   /*PAB PTR PASSED BY CALLER   */ 00019000
         LR    PABREG,REG1                                         0253 00020000
*        RPHREG=PABRPHA;                /*RPH PTR FROM PAB PASSED    */ 00021000
         L     RPHREG,PABRPHA-1(,PABREG)                           0254 00022000
         LA    RPHREG,0(,RPHREG)                                   0254 00023000
*        CRAREG=RPHCRR;                 /*CRA PTR FROM RPH           */ 00024000
         L     CRAREG,RPHCRR(,RPHREG)                              0255 00025000
*        CRRREG=ADDR(CRAPSS);           /*PSS CRR PTR FROM CRA       */ 00026000
         LA    @00,CRAPSS(,CRAREG)                                 0256 00027000
         LR    CRRREG,@00                                          0256 00028000
*        APCRFLG=0;                     /*CLEAR FLAG AREA            */ 00029000
         SLR   @00,@00                                             0257 00030000
         STH   @00,APCRFLG(,CRRREG)                                0257 00031000
*        APC56E=ON;                     /*SHOWS THIS MODULE ENTERED  */ 00032000
         OI    APC56E(CRRREG),B'00001000'                          0258 00033000
*        APC56R=ON;                     /*SHOWS THIS MODULE IN CONTRL*/ 00034000
*                                                                  0259 00035000
         OI    APC56R(CRRREG),B'00001000'                          0259 00036000
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(VCVTREG)) */            0260 00037000
*          VCVTREG = ATCLCPTR; /*SET UP ATCVT POINTER*/            0261 00038000
         L     VCVTREG,ATCLCPTR                                    0261 00039000
*        END; /*LISATCVT*/ /*SETUP VTAM CVT PTR  */                0262 00040000
*        FRRPREG=ATCAP62;               /*FOR RECOVERY               */ 00041000
         L     FRRPREG,ATCAP62(,VCVTREG)                           0263 00042000
*        RFY PARREG RSTD;               /*RESTRICTED ACROSS SETFRR   */ 00043000
*        GENERATE REFS(FRRPREG,PARREG,WRKA,WRKB,PSACSTK,PSA,FRRSCURR,   00044000
*        FRRS,FRRSLAST,FRRSELEN,FRRSFRRA,FRRSENTR,FRRSPARM,PSALSFCC);   00045000
         SETFRR A,FRRAD=(FRRPREG),PARMAD=(PARREG),WRKREGS=(WRKA,WRKB)   00046000
*        RPHREG=PABRPHA;                     /*RESTORE REG AFTER MACR*/ 00047000
         L     RPHREG,PABRPHA-1(,PABREG)                           0266 00048000
         LA    RPHREG,0(,RPHREG)                                   0266 00049000
*        WORD0=RPHCRR;                  /*SET FIRST WORD OF AREA     */ 00050000
         L     @06,RPHCRR(,RPHREG)                                 0267 00051000
         ST    @06,WORD0(,PARREG)                                  0267 00052000
*                                       /*POINTED TO BY PARREG EQUAL */ 00053000
*                                       /*TO THE CRAPTR FROM RPH     */ 00054000
*        APCFRRPM=PARREG;               /*SAVE PARMAD IN THE PSS CRR */ 00055000
         ST    PARREG,APCFRRPM(,CRRREG)                            0268 00056000
*        RFY PARREG UNRSTD;                                        0269 00057000
*        PSTREG=APCPSTA;                /*PST PTR FROM CRR           */ 00058000
         L     PSTREG,APCPSTA(,CRRREG)                             0270 00059000
*        MPSTREG=PSTMPSTP;              /*MPST PTR FROM PST          */ 00060000
         L     MPSTREG,PSTMPSTP(,PSTREG)                           0271 00061000
*        SWREG=0;                       /*LOOP CONTROL-RELEASE SRB   */ 00062000
         SLR   SWREG,SWREG                                         0272 00063000
*       RFY (OLDEVREG,OLDODREG,NEWEVREG,NEWODREG) RSTD; /*ACROSS CDS */ 00064000
*        OLDODREG=MPSSRBCT;             /*PRESENT SRB CT. ON MPST    */ 00065000
         L     OLDODREG,MPSSRBCT(,MPSTREG)                         0274 00066000
*TESTREL:                                                          0275 00067000
*                                                                  /**/ 00068000
*/*THE NUMBER OF SRB'S TO BE KEPT AVAILABLE IS IN THE ATCVT. IF THAT */ 00069000
*/*AMOUNT IS PRESENTLY ON THE MPST, OR A REQUEST TO SMS FOR AN SRB   */ 00070000
*/*IS OUTSTANDING, THE SRB IS RETURNED TO STORAGE MANAGEMENT. OTHER- */ 00071000
*/*WISE, THE SRB IS QUEUED ON THE MPST AND THE SRB COUNT UPDATED IN  */ 00072000
*/*THE MPST-USING THE CDS INSTRUCTION.                               */ 00073000
*                                                                  /**/ 00074000
*        DO WHILE(SWREG=0);                                        0275 00075000
TESTREL  B     @DE00275                                            0275 00076000
@DL00275 DS    0H                                                  0276 00077000
*         IF ATCSRBAC=>ATCSRBCT | MPSSRBO=ON /*              @Z40GKF6*/ 00078000
*          THEN                                                    0276 00079000
         CLC   ATCSRBAC(2,VCVTREG),ATCSRBCT(VCVTREG)               0276 00080000
         BNL   @RT00276                                            0276 00081000
         TM    MPSSRBO(MPSTREG),B'10000000'                        0276 00082000
         BNO   @RF00276                                            0276 00083000
@RT00276 DS    0H                                                  0277 00084000
*RELSRB:        DO;                                                0277 00085000
RELSRB   DS    0H                                                  0278 00086000
*           DO; /* RELSTORE  BUFADDR(SRBREG)SAVE(NO) */            0278 00087000
*           /*RELSTORE BUFADDR(SRBREG)SAVE(NO)*/                   0279 00088000
*            DO;                                                   0279 00089000
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  0280 00090000
*/* END OF ATBUILD */                                              0280 00091000
*                                                                  0280 00092000
*           DO;                                                    0280 00093000
*           END;                                                   0281 00094000
*                                                                  0282 00095000
*           DO;                                                    0282 00096000
*           RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                0283 00097000
*           END;                                                   0284 00098000
*                                                                  0285 00099000
*         GPR04P=SRBREG;                                           0285 00100000
         LR    GPR04P,SRBREG                                       0285 00101000
*         DCL 1 FMZA0008 FIXED(31) STATIC LOCAL,                   0286 00102000
*             2 * FIXED(8) INIT(0),                                0286 00103000
*             2 * PTR(24) INIT(0);                                 0286 00104000
*         GPR03F = FMZA0008;                                       0287 00105000
*                                                                  0287 00106000
         L     GPR03F,FMZA0008                                     0287 00107000
*           DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */          0288 00108000
*             GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/          0289 00109000
         L     GPR15P,ATCLCPTR                                     0289 00110000
*           END; /*LISATCVT*/                                      0290 00111000
*         GPR02P = GPR15P->ATCBPDA;                                0291 00112000
         L     GPR02P,ATCBPDA(,GPR15P)                             0291 00113000
*         GPR15P=GPR15P->ATCSMRS;                                  0292 00114000
         L     GPR15P,ATCSMRS(,GPR15P)                             0292 00115000
*         DCL FMZL0008 BASED(GPR15P) LABEL VALUERANGE(*);          0293 00116000
*         CALL FMZL0008;                                           0294 00117000
*                                                                  0294 00118000
         BALR  @14,@15                                             0294 00119000
*           DO;                                                    0295 00120000
*           RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;              0296 00121000
*           END;                                                   0297 00122000
*                                                                  0298 00123000
*           END ;                                                  0298 00124000
*                                                                  0298 00125000
*           END;/* RELSTORE */ /*SAVE(NO) AS A TPWAIT*/            0299 00126000
*                                              /*MAY HAVE CAUSED RPH */ 00127000
*                                              /*SAVEAREA TO BE USED */ 00128000
*           SWREG=1;                           /*OUT OF DOWHILE LOOP */ 00129000
         LA    SWREG,1                                             0300 00130000
*               END RELSRB;                                        0301 00131000
*          ELSE                                                    0302 00132000
*NORELSRB:      DO;                                                0302 00133000
         B     @RC00276                                            0302 00134000
@RF00276 DS    0H                                                  0302 00135000
NORELSRB DS    0H                                                  0303 00136000
*           OLDEVREG=ATCSRBQ;                /*SRB QUE ATCVT @Z40GKF6*/ 00137000
         L     OLDEVREG,ATCSRBQ(,VCVTREG)                          0303 00138000
*           SRBFLNK=OLDEVREG;                /*SRB CHAIN PTR UPDATE  */ 00139000
         ST    OLDEVREG,SRBFLNK(,SRBREG)                           0304 00140000
*           NEWEVREG=SRBREG;                 /*TO UPDATE SRB QUE HEAD*/ 00141000
         LR    NEWEVREG,SRBREG                                     0305 00142000
*           NEWODREG=OLDODREG+'10001'X;      /*TO UPDATE SRB COUNT   */ 00143000
         LR    NEWODREG,OLDODREG                                   0306 00144000
         AL    NEWODREG,@CF02622                                   0306 00145000
*           CDS (OLDEVREG,NEWEVREG,ATCSRB);  /*              @Z40GKF6*/ 00146000
         CDS   OLDEVREG,NEWEVREG,ATCSRB(VCVTREG)                   0307 00147000
*           BC (NE,FAILCDS);                 /*SRB MPST Q+SRB CT UPED*/ 00148000
         BC    7,FAILCDS                                           0308 00149000
*                                            /*NOT EQ-GO THRU DOWHILE*/ 00150000
*           SWREG=1;                         /*OUT OF DOWHILE AS CDS=*/ 00151000
         LA    SWREG,1                                             0309 00152000
*               END NORELSRB;                                      0310 00153000
*FAILCDS:  END;                              /*DOWHILE SWREG=0 LOOP  */ 00154000
@RC00276 DS    0H                                                  0311 00155000
FAILCDS  DS    0H                                                  0311 00156000
@DE00275 LTR   SWREG,SWREG                                         0311 00157000
         BZ    @DL00275                                            0311 00158000
*       RFY (OLDEVREG,OLDODREG,NEWEVREG,NEWODREG) UNRSTD;          0312 00159000
*SETUP:                                                            0313 00160000
*                                                                  /**/ 00161000
*/*SET REGISTERS FOR PROPER INTERFACE TO ISTAPC57 AND GOTO THAT      */ 00162000
*/*PROCEDURE WITH NO RETURN-IT WILL DISPATCH THE PAB.                */ 00163000
*                                                                  /**/ 00164000
*        REG1=0;                             /*NO CRA TO BE FREED    */ 00165000
SETUP    SLR   REG1,REG1                                           0313 00166000
*                                            /*INDICATOR TO ISTAPC57 */ 00167000
*        REG9=PABREG;                        /*INTERFACE TO ISTAPC57 */ 00168000
*                                                                  0314 00169000
         LR    REG9,PABREG                                         0314 00170000
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(VCVTREG)) */            0315 00171000
*          VCVTREG = ATCLCPTR; /*SET UP ATCVT POINTER*/            0316 00172000
         L     VCVTREG,ATCLCPTR                                    0316 00173000
*        END; /*LISATCVT*//*VCVTREG LOST ACROSS  */                0317 00174000
*                                            /*RELSTORE SAVE(NO)     */ 00175000
*       RFY (REG15) RSTD;                                          0318 00176000
*        REG15=ATCAP57;                                            0319 00177000
         L     REG15,ATCAP57(,VCVTREG)                             0319 00178000
*        GOTO APC57;                         /*EXIT TO DISP. PAB     */ 00179000
         BR    REG15                                               0320 00180000
*       RFY (REG15) UNRSTD;                                        0321 00181000
*                                                                  0321 00182000
* DO; /* TPEPILOG   */                                             0322 00183000
*                                                                  0323 00184000
* GEN (PRINT OFF);                                                 0323 00185000
*                                                                  0323 00186000
         PRINT OFF                                                      00187000
* DO;                                                              0324 00188000
* DCL GPR00F FIXED(31) REG(00),GPR00P PTR(31) REG(00),GPR01F FIXED(31)  00189000
*EG(01),GPR01P PTR(31) REG(01),GPR02F FIXED(31) REG(02),GPR02P PTR(31)  00190000
*EG(02),GPR03F FIXED(31) REG(03),GPR03P PTR(31) REG(03),GPR04F FIXED(31 00191000
* REG(04),GPR04P PTR(31) REG(04),GPR05F FIXED(31) REG(05),GPR05P PTR(31 00192000
* REG(05),GPR06F FIXED(31) REG(06),GPR06P PTR(31) REG(06),GPR07F FIXED( 00193000
*1) REG(07),GPR07P PTR(31) REG(07),GPR08F FIXED(31) REG(08),GPR08P PTR( 00194000
*1) REG(08),GPR09F FIXED(31) REG(09),GPR09P PTR(31) REG(09),GPR10F FIXE 00195000
*(31) REG(10),GPR10P PTR(31) REG(10),GPR11F FIXED(31) REG(11),GPR11P PT 00196000
*(31) REG(11),GPR12F FIXED(31) REG(12),GPR12P PTR(31) REG(12),GPR13F FI 00197000
*ED(31) REG(13),GPR13P PTR(31) REG(13),GPR14F FIXED(31) REG(14),GPR14P  00198000
*TR(31) REG(14),GPR15F FIXED(31) REG(15),GPR15P PTR(31) REG(15);   0325 00199000
* END;                                                             0326 00200000
*                                                                  0327 00201000
* GEN (PRINT ON);                                                  0327 00202000
         PRINT ON                                                       00203000
* END;/* TPEPILOG */                                               0328 00204000
*        END ISTAPC56                                              0329 00205000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00206000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00207000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                        * 00208000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00209000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00210000
*;                                                                 0329 00211000
@EL00001 DS    0H                                                  0329 00212000
@EF00001 DS    0H                                                  0329 00213000
@ER00001 BR    @14                                                 0329 00214000
@DATA    DS    0H                                                       00215000
@DATD    DSECT                                                          00216000
         DS    0F                                                       00217000
ISTAPC56 CSECT                                                          00218000
         DS    0F                                                       00219000
@CF02622 DC    XL4'10001'                                               00220000
@DATD    DSECT                                                          00221000
         DS    0D                                                       00222000
CVTPTR   DS    A                                                        00223000
FRRSPTR  DS    A                                                        00224000
FRREPTR  DS    A                                                        00225000
SRBPTR   DS    A                                                        00226000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00227000
@ENDDATD EQU   *                                                        00228000
ISTAPC56 CSECT                                                          00229000
         DS    0F                                                       00230000
@SIZDATD DC    AL1(0)                                                   00231000
         DC    AL3(@ENDDATD-@DATD)                                      00232000
         DS    0D                                                       00233000
FMZA0008 DS    FL4                                                      00234000
         ORG   FMZA0008                                                 00235000
@NM00111 DC    AL1(0)                                                   00236000
@NM00112 DC    AL3(0)                                                   00237000
         ORG   FMZA0008+4                                               00238000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00239000
@01      EQU   01                                                       00240000
@02      EQU   02                                                       00241000
@03      EQU   03                                                       00242000
@04      EQU   04                                                       00243000
@05      EQU   05                                                       00244000
@06      EQU   06                                                       00245000
@07      EQU   07                                                       00246000
@08      EQU   08                                                       00247000
@09      EQU   09                                                       00248000
@10      EQU   10                                                       00249000
@11      EQU   11                                                       00250000
@12      EQU   12                                                       00251000
@13      EQU   13                                                       00252000
@14      EQU   14                                                       00253000
@15      EQU   15                                                       00254000
RPHPTR   EQU   @01                                                      00255000
REG0     EQU   @00                                                      00256000
RPHREG   EQU   @01                                                      00257000
REG1     EQU   @01                                                      00258000
WRKA     EQU   @04                                                      00259000
OLDEVREG EQU   @04                                                      00260000
WRKB     EQU   @05                                                      00261000
OLDODREG EQU   @05                                                      00262000
NEWEVREG EQU   @06                                                      00263000
NEWODREG EQU   @07                                                      00264000
VCVTREG  EQU   @08                                                      00265000
PARREG   EQU   @07                                                      00266000
REG9     EQU   @09                                                      00267000
FRRPREG  EQU   @09                                                      00268000
MPSTREG  EQU   @09                                                      00269000
PSTREG   EQU   @09                                                      00270000
SRBREG   EQU   @10                                                      00271000
PABREG   EQU   @11                                                      00272000
CRRREG   EQU   @13                                                      00273000
SWREG    EQU   @13                                                      00274000
CRAREG   EQU   @13                                                      00275000
REG15    EQU   @15                                                      00276000
GPR02P   EQU   @02                                                      00277000
GPR03P   EQU   @03                                                      00278000
GPR04P   EQU   @04                                                      00279000
GPR15P   EQU   @15                                                      00280000
GPR03F   EQU   @03                                                      00281000
GPR00F   EQU   @00                                                      00282000
GPR00P   EQU   @00                                                      00283000
GPR01F   EQU   @01                                                      00284000
GPR01P   EQU   @01                                                      00285000
GPR02F   EQU   @02                                                      00286000
GPR04F   EQU   @04                                                      00287000
GPR05F   EQU   @05                                                      00288000
GPR05P   EQU   @05                                                      00289000
GPR06F   EQU   @06                                                      00290000
GPR06P   EQU   @06                                                      00291000
GPR07F   EQU   @07                                                      00292000
GPR07P   EQU   @07                                                      00293000
GPR08F   EQU   @08                                                      00294000
GPR08P   EQU   @08                                                      00295000
GPR09F   EQU   @09                                                      00296000
GPR09P   EQU   @09                                                      00297000
GPR10F   EQU   @10                                                      00298000
GPR10P   EQU   @10                                                      00299000
GPR11F   EQU   @11                                                      00300000
GPR11P   EQU   @11                                                      00301000
GPR12F   EQU   @12                                                      00302000
GPR12P   EQU   @12                                                      00303000
GPR13F   EQU   @13                                                      00304000
GPR13P   EQU   @13                                                      00305000
GPR14F   EQU   @14                                                      00306000
GPR14P   EQU   @14                                                      00307000
GPR15F   EQU   @15                                                      00308000
PSA      EQU   0                                                        00309000
FLCRNPSW EQU   PSA                                                      00310000
FLCROPSW EQU   PSA+8                                                    00311000
FLCICCW2 EQU   PSA+16                                                   00312000
PSAEEPSW EQU   PSA+132                                                  00313000
PSAESPSW EQU   PSA+136                                                  00314000
FLCSVILC EQU   PSAESPSW+1                                               00315000
PSAEPPSW EQU   PSA+140                                                  00316000
FLCPIILC EQU   PSAEPPSW+1                                               00317000
FLCPICOD EQU   PSAEPPSW+2                                               00318000
PSAPICOD EQU   FLCPICOD+1                                               00319000
FLCTEA   EQU   PSAEPPSW+4                                               00320000
FLCPER   EQU   PSA+152                                                  00321000
FLCMCLA  EQU   PSA+168                                                  00322000
FLCIOEL  EQU   FLCMCLA+4                                                00323000
FLCIOA   EQU   FLCMCLA+16                                               00324000
FLCFSA   EQU   FLCMCLA+80                                               00325000
PSASUPER EQU   PSA+552                                                  00326000
PSASUP1  EQU   PSASUPER                                                 00327000
PSASUP2  EQU   PSASUPER+1                                               00328000
PSASUP3  EQU   PSASUPER+2                                               00329000
PSASUP4  EQU   PSASUPER+3                                               00330000
PSACLHT  EQU   PSA+640                                                  00331000
PSALKSA  EQU   PSA+696                                                  00332000
PSAHLHI  EQU   PSA+760                                                  00333000
PSADSSFL EQU   PSA+836                                                  00334000
PSADSSF1 EQU   PSADSSFL                                                 00335000
PSADSSF3 EQU   PSADSSFL+2                                               00336000
PSADSSF4 EQU   PSADSSFL+3                                               00337000
PSARSVT  EQU   PSA+896                                                  00338000
PSALSFCC EQU   PSA+1012                                                 00339000
ATCLCPTR EQU   1032                                                     00340000
CVTMAP   EQU   0                                                        00341000
CVTDAR   EQU   CVTMAP+72                                                00342000
CVTFLGS1 EQU   CVTDAR                                                   00343000
CVTDCB   EQU   CVTMAP+116                                               00344000
CVTIERLC EQU   CVTMAP+144                                               00345000
CVTOPTA  EQU   CVTMAP+182                                               00346000
CVTOPTB  EQU   CVTMAP+183                                               00347000
CVTGTF   EQU   CVTMAP+236                                               00348000
CVTGTFST EQU   CVTGTF                                                   00349000
CVTGTFS  EQU   CVTGTFST                                                 00350000
CVTSTATE EQU   CVTGTFST                                                 00351000
CVTTMODE EQU   CVTGTFST                                                 00352000
CVTFORM  EQU   CVTGTFST                                                 00353000
CVTAQAVT EQU   CVTMAP+240                                               00354000
CVTTCMFG EQU   CVTAQAVT                                                 00355000
CVTVOLM2 EQU   CVTMAP+244                                               00356000
CVTTATA  EQU   CVTVOLM2                                                 00357000
CVTTSKS  EQU   CVTTATA                                                  00358000
CVTVOLF2 EQU   CVTTSKS                                                  00359000
CVTTAT   EQU   CVTTATA+1                                                00360000
CVTATER  EQU   CVTMAP+248                                               00361000
CVTEXT1  EQU   CVTMAP+252                                               00362000
CVTPURG  EQU   CVTMAP+260                                               00363000
CVTQMSG  EQU   CVTMAP+268                                               00364000
CVTDMSR  EQU   CVTMAP+272                                               00365000
CVTRSV37 EQU   CVTDMSR                                                  00366000
CVTDMSRF EQU   CVTRSV37                                                 00367000
CVTERPV  EQU   CVTMAP+316                                               00368000
CVTINTLA EQU   CVTMAP+320                                               00369000
CVTAPF   EQU   CVTMAP+324                                               00370000
CVTEXT2  EQU   CVTMAP+328                                               00371000
CVTHJES  EQU   CVTMAP+332                                               00372000
CVTPGSIA EQU   CVTMAP+348                                               00373000
CVTA1F1  EQU   CVTMAP+356                                               00374000
CVTSYSK  EQU   CVTMAP+357                                               00375000
CVTVOLM1 EQU   CVTMAP+380                                               00376000
CVTVOLF1 EQU   CVTVOLM1                                                 00377000
CVTXTNT1 EQU   0                                                        00378000
CVTXTNT2 EQU   0                                                        00379000
CVTDSSV  EQU   CVTXTNT2                                                 00380000
CVTFLGBT EQU   CVTXTNT2+5                                               00381000
CVTQID   EQU   CVTXTNT2+24                                              00382000
CVTRV400 EQU   CVTXTNT2+52                                              00383000
CVTRV409 EQU   CVTXTNT2+53                                              00384000
CVTATCVT EQU   CVTXTNT2+64                                              00385000
CVTRV429 EQU   CVTXTNT2+84                                              00386000
CVTRV438 EQU   CVTXTNT2+85                                              00387000
CVTRV457 EQU   CVTXTNT2+112                                             00388000
CVTRV466 EQU   CVTXTNT2+113                                             00389000
CVTFIX   EQU   0                                                        00390000
CVTRELNO EQU   CVTFIX+252                                               00391000
FRRS     EQU   0                                                        00392000
FRRSHEAD EQU   FRRS                                                     00393000
FRRSLAST EQU   FRRSHEAD+4                                               00394000
FRRSELEN EQU   FRRSHEAD+8                                               00395000
FRRSCURR EQU   FRRSHEAD+12                                              00396000
FRRSENTR EQU   0                                                        00397000
FRRSFRRA EQU   FRRSENTR                                                 00398000
FRRSFLGS EQU   FRRSENTR+4                                               00399000
FRRSFLG1 EQU   FRRSFLGS                                                 00400000
FRRSPARM EQU   FRRSENTR+8                                               00401000
SRBSECT  EQU   0                                                        00402000
SRBFLNK  EQU   SRBSECT+4                                                00403000
SRBFLC   EQU   SRBSECT+12                                               00404000
ISTPFCRR EQU   0                                                        00405000
PFCCRR   EQU   ISTPFCRR                                                 00406000
PFCCRRID EQU   PFCCRR                                                   00407000
PFCCRRLN EQU   PFCCRR+2                                                 00408000
PFCHDR   EQU   ISTPFCRR+4                                               00409000
PFCCRRO  EQU   PFCHDR                                                   00410000
PFCFRRO  EQU   PFCHDR+4                                                 00411000
ISTAPCRR EQU   0                                                        00412000
APCATFLG EQU   ISTAPCRR+16                                              00413000
APC56E   EQU   APCATFLG                                                 00414000
APCRFLG  EQU   ISTAPCRR+18                                              00415000
APC56R   EQU   APCRFLG                                                  00416000
APCPSTA  EQU   ISTAPCRR+20                                              00417000
APCRTRN  EQU   ISTAPCRR+28                                              00418000
APCAUT   EQU   APCRTRN                                                  00419000
APCFRRPM EQU   ISTAPCRR+40                                              00420000
APCSAVE  EQU   ISTAPCRR+44                                              00421000
APCCOMF  EQU   ISTAPCRR+116                                             00422000
APCCOMF1 EQU   APCCOMF                                                  00423000
APC31FLG EQU   ISTAPCRR+132                                             00424000
APC52FLG EQU   ISTAPCRR+133                                             00425000
APC53FLG EQU   ISTAPCRR+134                                             00426000
APC54FLG EQU   ISTAPCRR+135                                             00427000
APC57FLG EQU   ISTAPCRR+136                                             00428000
ISTRPH   EQU   0                                                        00429000
RPHCNTL  EQU   ISTRPH                                                   00430000
RPHFLAGS EQU   RPHCNTL+2                                                00431000
RPHFSTLC EQU   RPHFLAGS                                                 00432000
RPHFLGB  EQU   RPHCNTL+3                                                00433000
RPHRPHA  EQU   ISTRPH+4                                                 00434000
RPHTSKID EQU   ISTRPH+8                                                 00435000
RPHRESMA EQU   ISTRPH+16                                                00436000
RPHWPFLG EQU   RPHRESMA                                                 00437000
RPHWEA   EQU   ISTRPH+24                                                00438000
RPHCSPA  EQU   RPHWEA                                                   00439000
RPHSRPRM EQU   ISTRPH+28                                                00440000
RPHCRR   EQU   ISTRPH+32                                                00441000
RPHPABQA EQU   ISTRPH+36                                                00442000
RPHWORK  EQU   ISTRPH+40                                                00443000
RPHSAVE1 EQU   RPHWORK                                                  00444000
RPHSBITS EQU   RPHSAVE1+1                                               00445000
ISTRIA   EQU   0                                                        00446000
RIAABRGS EQU   ISTRIA+16                                                00447000
RIAFLGS  EQU   ISTRIA+80                                                00448000
RIAFLG1  EQU   RIAFLGS                                                  00449000
RIAFLG2  EQU   RIAFLGS+1                                                00450000
ISTLOK   EQU   0                                                        00451000
LOKCHN   EQU   ISTLOK+1                                                 00452000
LOKCHNG  EQU   LOKCHN                                                   00453000
@NM00046 EQU   LOKCHNG+2                                                00454000
ISTPAB   EQU   0                                                        00455000
PABWQCHN EQU   ISTPAB                                                   00456000
PABWEQA  EQU   PABWQCHN                                                 00457000
PABCHAIN EQU   PABWQCHN+4                                               00458000
PABRUNNG EQU   PABCHAIN                                                 00459000
PABRPHFG EQU   ISTPAB+12                                                00460000
PABFLAGS EQU   PABRPHFG                                                 00461000
PABERLCK EQU   PABFLAGS                                                 00462000
PABERRLK EQU   PABERLCK                                                 00463000
PABRPHA  EQU   PABRPHFG+1                                               00464000
PABEND   EQU   ISTPAB+16                                                00465000
ISTDYPAB EQU   0                                                        00466000
DYPCHAIN EQU   ISTDYPAB+4                                               00467000
DYPPACMD EQU   ISTDYPAB+12                                              00468000
ISTPST   EQU   0                                                        00469000
PSTRQFGA EQU   ISTPST+8                                                 00470000
PSTRQUE  EQU   PSTRQFGA                                                 00471000
PSTFLGA  EQU   PSTRQFGA+4                                               00472000
PSTABINP EQU   PSTFLGA                                                  00473000
PSTMPSTP EQU   ISTPST+20                                                00474000
PSTDMPS  EQU   ISTPST+132                                               00475000
ISTMPST  EQU   0                                                        00476000
MPSRSV07 EQU   ISTMPST+4                                                00477000
MPSRQFGA EQU   ISTMPST+8                                                00478000
MPSRQUE  EQU   MPSRQFGA                                                 00479000
MPSFLGA  EQU   MPSRQFGA+4                                               00480000
MPSFLGAA EQU   MPSFLGA                                                  00481000
MPSSRBO  EQU   MPSFLGAA                                                 00482000
MPSFLGAB EQU   MPSFLGA+1                                                00483000
MPSCRA   EQU   ISTMPST+24                                               00484000
MPSCRACT EQU   MPSCRA+4                                                 00485000
MPSSRB   EQU   ISTMPST+32                                               00486000
MPSSRBCT EQU   MPSSRB+4                                                 00487000
MPSCRPL  EQU   ISTMPST+40                                               00488000
MPSRPLCT EQU   MPSCRPL+4                                                00489000
ISTATCVT EQU   0                                                        00490000
ATCRPTCH EQU   ISTATCVT                                                 00491000
ATCITFLD EQU   ISTATCVT+8                                               00492000
ATCITCDS EQU   ATCITFLD+8                                               00493000
ATCITFLG EQU   ATCITCDS+4                                               00494000
ATCITRA1 EQU   ATCITFLG+2                                               00495000
ATCSMPAB EQU   ISTATCVT+88                                              00496000
ATCVDPAB EQU   ISTATCVT+152                                             00497000
ATCLDTIL EQU   ISTATCVT+408                                             00498000
ATCGTSTR EQU   ISTATCVT+608                                             00499000
ATCSMRS  EQU   ISTATCVT+624                                             00500000
ATCLUDVT EQU   ISTATCVT+768                                             00501000
ATCANYDT EQU   ISTATCVT+776                                             00502000
@NM00054 EQU   ISTATCVT+780                                             00503000
ATCPODVT EQU   ISTATCVT+804                                             00504000
ATCBPDA  EQU   ISTATCVT+856                                             00505000
ATCSTAT  EQU   ISTATCVT+936                                             00506000
ATCSTAT1 EQU   ATCSTAT                                                  00507000
ATCPOFLG EQU   ATCSTAT+2                                                00508000
ATCSTAT4 EQU   ATCSTAT+3                                                00509000
ATCBITAN EQU   ISTATCVT+940                                             00510000
ATCFLAG2 EQU   ATCBITAN+1                                               00511000
ATCONID  EQU   ISTATCVT+944                                             00512000
ATCSSCPA EQU   ISTATCVT+948                                             00513000
ATCHPGM  EQU   ISTATCVT+1012                                            00514000
ATCVLCNT EQU   ISTATCVT+1016                                            00515000
ATCRNO   EQU   ISTATCVT+1020                                            00516000
@NM00077 EQU   ISTATCVT+1028                                            00517000
ATCSHRFG EQU   @NM00077+8                                               00518000
ATCCPDVT EQU   ISTATCVT+1096                                            00519000
ATCSMSDQ EQU   ISTATCVT+1140                                            00520000
ATCRID   EQU   ISTATCVT+1152                                            00521000
ATCLDAPP EQU   ISTATCVT+1288                                            00522000
ATCSQAFR EQU   ISTATCVT+1312                                            00523000
ATCORTCB EQU   ATCSQAFR+4                                               00524000
ATCORSRB EQU   ATCORTCB                                                 00525000
ATCICAPP EQU   ISTATCVT+1320                                            00526000
ATCDAPVT EQU   ISTATCVT+1340                                            00527000
ATCAP57  EQU   ISTATCVT+1408                                            00528000
ATCGSRBQ EQU   ISTATCVT+1472                                            00529000
ATCGSRBG EQU   ATCGSRBQ                                                 00530000
ATCENFLG EQU   ISTATCVT+1512                                            00531000
@NM00092 EQU   ISTATCVT+1575                                            00532000
ATCVTFLG EQU   ISTATCVT+1576                                            00533000
ATCAP62  EQU   ISTATCVT+1644                                            00534000
ATCZFLAG EQU   ISTATCVT+1696                                            00535000
ATCSRBCT EQU   ISTATCVT+1698                                            00536000
ATCCRA   EQU   ISTATCVT+1720                                            00537000
ATCCRACN EQU   ATCCRA+4                                                 00538000
ATCSRB   EQU   ISTATCVT+1728                                            00539000
ATCSRBQ  EQU   ATCSRB                                                   00540000
ATCSRBCN EQU   ATCSRB+4                                                 00541000
ATCSRBAC EQU   ATCSRBCN+2                                               00542000
ATCCRPL  EQU   ISTATCVT+1736                                            00543000
ATCRPLCN EQU   ATCCRPL+4                                                00544000
ISTCFCRR EQU   0                                                        00545000
CFCAUDIT EQU   ISTCFCRR                                                 00546000
CFCNTRD  EQU   CFCAUDIT                                                 00547000
CFCCRT   EQU   CFCAUDIT+1                                               00548000
ISTDCCRR EQU   0                                                        00549000
CRRSPACE EQU   ISTDCCRR+12                                              00550000
CRRSAREA EQU   0                                                        00551000
CRRMAS   EQU   CRRSAREA+148                                             00552000
CRRMAS1  EQU   CRRMAS                                                   00553000
CRRMAS2  EQU   CRRMAS+1                                                 00554000
CRRMAS3  EQU   CRRMAS+2                                                 00555000
CRRMAS4  EQU   CRRMAS+3                                                 00556000
CRRRMAS1 EQU   CRRMAS+4                                                 00557000
CRRRMAS2 EQU   CRRMAS+5                                                 00558000
CRRRMAS3 EQU   CRRMAS+6                                                 00559000
CRRSMAS  EQU   CRRRMAS3                                                 00560000
CRRATS   EQU   CRRSAREA+156                                             00561000
CRRATS1  EQU   CRRATS                                                   00562000
CRRATS2  EQU   CRRATS+1                                                 00563000
CRRATS3  EQU   CRRATS+2                                                 00564000
CRRATS4  EQU   CRRATS+3                                                 00565000
CRRRATS1 EQU   CRRATS+4                                                 00566000
CRRRATS2 EQU   CRRATS+5                                                 00567000
CRRRATS3 EQU   CRRATS+6                                                 00568000
CRRSATS  EQU   CRRRATS3                                                 00569000
CRRFLGS1 EQU   CRRSAREA+164                                             00570000
CRRFLGS2 EQU   CRRSAREA+165                                             00571000
CRRFLGS3 EQU   CRRSAREA+166                                             00572000
CRRFLGS4 EQU   CRRSAREA+167                                             00573000
CRRFLGS  EQU   CRRSAREA+168                                             00574000
CRRRFLG1 EQU   CRRSAREA+169                                             00575000
CRRRTYPE EQU   CRRRFLG1                                                 00576000
CRRFDBK1 EQU   CRRSAREA+170                                             00577000
CRRFDB2  EQU   CRRFDBK1+1                                               00578000
CRRFDB3  EQU   CRRFDBK1+2                                               00579000
CRRFDBK2 EQU   CRRSAREA+176                                             00580000
CRRDSB   EQU   CRRFDBK2                                                 00581000
CRRESR   EQU   CRRFDBK2+2                                               00582000
CRRTRBUF EQU   CRRSAREA+204                                             00583000
CRRBFLGS EQU   CRRSAREA+280                                             00584000
ISTASCRR EQU   0                                                        00585000
ASCFLAGS EQU   ISTASCRR+16                                              00586000
ASCFLG1  EQU   ASCFLAGS                                                 00587000
ASCFLG2  EQU   ASCFLAGS+2                                               00588000
ASCFLG3  EQU   ASCFLAGS+4                                               00589000
ASCUSRGS EQU   ISTASCRR+28                                              00590000
ISTCRA   EQU   0                                                        00591000
CRABASIC EQU   ISTCRA                                                   00592000
CRAHDR   EQU   CRABASIC                                                 00593000
CRALKACT EQU   CRABASIC+8                                               00594000
CRARPH   EQU   ISTCRA+52                                                00595000
CRAPSS   EQU   ISTCRA+160                                               00596000
CRAPROCR EQU   ISTCRA+312                                               00597000
CRASVC   EQU   ISTCRA+924                                               00598000
CRABUFA  EQU   CRASVC+68                                                00599000
CRARSV01 EQU   ISTCRA+996                                               00600000
CRARSV02 EQU   ISTCRA+1000                                              00601000
CRAIDS   EQU   ISTCRA+1004                                              00602000
CRACHAIN EQU   ISTCRA+1012                                              00603000
APC57    EQU   0                                                        00604000
WORD0    EQU   0                                                        00605000
FMZL0008 EQU   0                                                        00606000
ISTXDYP  EQU   0                                                        00607000
ISTXPAB  EQU   0                                                        00608000
CVTS01   EQU   CVTPGSIA                                                 00609000
CVTLPDIA EQU   CVTS01+12                                                00610000
CVTDIRST EQU   CVTLPDIA                                                 00611000
CVTSLIDA EQU   CVTS01+24                                                00612000
CVTCTLFG EQU   CVTS01+50                                                00613000
CVTRV210 EQU   CVTS01+424                                               00614000
CVTRV219 EQU   CVTS01+425                                               00615000
CVTRV228 EQU   CVTS01+426                                               00616000
CVTRV237 EQU   CVTS01+427                                               00617000
CVTMFRTR EQU   CVTS01+452                                               00618000
CVTRV262 EQU   CVTS01+468                                               00619000
CVTRV271 EQU   CVTS01+469                                               00620000
CVTRV280 EQU   CVTS01+470                                               00621000
CVTRV289 EQU   CVTS01+471                                               00622000
CVTGSDA  EQU   CVTS01+600                                               00623000
PSARSVTE EQU   PSARSVT                                                  00624000
PSACSTK  EQU   PSARSVTE                                                 00625000
PABXTNSN EQU   PABEND                                                   00626000
@NM00109 EQU   CRAPROCR                                                 00627000
CRACFCRR EQU   CRAPROCR                                                 00628000
FLC      EQU   PSA                                                      00629000
SRB      EQU   SRBSECT                                                  00630000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00631000
CRACRRSA EQU   @NM00109+12                                              00632000
@NM00110 EQU   @NM00109                                                 00633000
@NM00048 EQU   PABXTNSN+12                                              00634000
PABNPSSQ EQU   PABXTNSN+8                                               00635000
PABLOCK  EQU   PABXTNSN+4                                               00636000
PABLAST  EQU   PABXTNSN                                                 00637000
PSARSAV  EQU   PSARSVTE+60                                              00638000
PSARSTK  EQU   PSARSVTE+56                                              00639000
PSAESAV3 EQU   PSARSVTE+52                                              00640000
PSAESTK3 EQU   PSARSVTE+48                                              00641000
PSAESAV2 EQU   PSARSVTE+44                                              00642000
PSAESTK2 EQU   PSARSVTE+40                                              00643000
PSAESAV1 EQU   PSARSVTE+36                                              00644000
PSAESTK1 EQU   PSARSVTE+32                                              00645000
PSAPSAV  EQU   PSARSVTE+28                                              00646000
PSAPSTK  EQU   PSARSVTE+24                                              00647000
PSAMSAV  EQU   PSARSVTE+20                                              00648000
PSAMSTK  EQU   PSARSVTE+16                                              00649000
PSASSAV  EQU   PSARSVTE+12                                              00650000
PSASSTK  EQU   PSARSVTE+8                                               00651000
PSANSTK  EQU   PSARSVTE+4                                               00652000
CVTRV628 EQU   CVTS01+728                                               00653000
CVTRV627 EQU   CVTS01+724                                               00654000
CVTRV626 EQU   CVTS01+720                                               00655000
CVTRV625 EQU   CVTS01+716                                               00656000
CVTRV624 EQU   CVTS01+712                                               00657000
CVTRV623 EQU   CVTS01+708                                               00658000
CVTRV622 EQU   CVTS01+704                                               00659000
CVTRV621 EQU   CVTS01+700                                               00660000
CVTIHASU EQU   CVTS01+696                                               00661000
CVTSUSP  EQU   CVTS01+692                                               00662000
CVTT6SVC EQU   CVTS01+688                                               00663000
CVTCDAL  EQU   CVTS01+684                                               00664000
CVTTCTL  EQU   CVTS01+680                                               00665000
CVTRSUME EQU   CVTS01+676                                               00666000
CVTJTERM EQU   CVTS01+672                                               00667000
CVTASMRM EQU   CVTS01+668                                               00668000
CVTTCASP EQU   CVTS01+664                                               00669000
CVT0PT03 EQU   CVTS01+660                                               00670000
CVT0PT0E EQU   CVTS01+656                                               00671000
CVTRV609 EQU   CVTS01+652                                               00672000
CVTCGK   EQU   CVTS01+648                                               00673000
CVTRAC   EQU   CVTS01+644                                               00674000
CVTRV606 EQU   CVTS01+640                                               00675000
CVTRV605 EQU   CVTS01+636                                               00676000
CVTRV604 EQU   CVTS01+632                                               00677000
CVTEFF02 EQU   CVTS01+628                                               00678000
CVTCBBR  EQU   CVTS01+624                                               00679000
CVTSSCR  EQU   CVTS01+620                                               00680000
CVTEVENT EQU   CVTS01+616                                               00681000
CVTCRCA  EQU   CVTS01+612                                               00682000
CVTTPIO  EQU   CVTS01+608                                               00683000
CVTADV   EQU   CVTS01+604                                               00684000
CVTGSDAB EQU   CVTGSDA                                                  00685000
CVTQV3   EQU   CVTS01+596                                               00686000
CVTQV2   EQU   CVTS01+592                                               00687000
CVTQV1   EQU   CVTS01+588                                               00688000
CVTRPT   EQU   CVTS01+584                                               00689000
CVTSSRB  EQU   CVTS01+580                                               00690000
CVTCSDRL EQU   CVTS01+576                                               00691000
CVTEXP1  EQU   CVTS01+572                                               00692000
CVTRMPMT EQU   CVTS01+568                                               00693000
CVTRMPTT EQU   CVTS01+564                                               00694000
CVTVPSA  EQU   CVTS01+560                                               00695000
CVTVSTOP EQU   CVTS01+556                                               00696000
CVTGTFR8 EQU   CVTS01+552                                               00697000
CVTQUIT  EQU   CVTS01+548                                               00698000
CVTVACR  EQU   CVTS01+544                                               00699000
CVTWTCB  EQU   CVTS01+540                                               00700000
CVTSTPRS EQU   CVTS01+536                                               00701000
CVT0PT02 EQU   CVTS01+532                                               00702000
CVTDARCM EQU   CVTS01+528                                               00703000
CVTIRECM EQU   CVTS01+524                                               00704000
CVTJRECM EQU   CVTS01+520                                               00705000
CVTVEMS0 EQU   CVTS01+516                                               00706000
CVTSPFRR EQU   CVTS01+512                                               00707000
CVTRLSTG EQU   CVTS01+508                                               00708000
CVT0TC0A EQU   CVTS01+504                                               00709000
CVTGMBR  EQU   CVTS01+500                                               00710000
CVTLFRM  EQU   CVTS01+496                                               00711000
CVTRMBR  EQU   CVTS01+492                                               00712000
CVTVIOP  EQU   CVTS01+488                                               00713000
CVTRV307 EQU   CVTS01+486                                               00714000
CVTRV306 EQU   CVTS01+484                                               00715000
CVTRV305 EQU   CVTS01+482                                               00716000
CVTRV304 EQU   CVTS01+480                                               00717000
CVTRV303 EQU   CVTS01+478                                               00718000
CVTRV302 EQU   CVTS01+476                                               00719000
CVTTRCA  EQU   CVTS01+472                                               00720000
CVTRV297 EQU   CVTRV289                                                 00721000
CVTRV296 EQU   CVTRV289                                                 00722000
CVTRV295 EQU   CVTRV289                                                 00723000
CVTRV294 EQU   CVTRV289                                                 00724000
CVTRV293 EQU   CVTRV289                                                 00725000
CVTRV292 EQU   CVTRV289                                                 00726000
CVTRV291 EQU   CVTRV289                                                 00727000
CVTRV290 EQU   CVTRV289                                                 00728000
CVTRV288 EQU   CVTRV280                                                 00729000
CVTRV287 EQU   CVTRV280                                                 00730000
CVTRV286 EQU   CVTRV280                                                 00731000
CVTRV285 EQU   CVTRV280                                                 00732000
CVTRV284 EQU   CVTRV280                                                 00733000
CVTRV283 EQU   CVTRV280                                                 00734000
CVTRV282 EQU   CVTRV280                                                 00735000
CVTRV281 EQU   CVTRV280                                                 00736000
CVTRV279 EQU   CVTRV271                                                 00737000
CVTRV278 EQU   CVTRV271                                                 00738000
CVTRV277 EQU   CVTRV271                                                 00739000
CVTRV276 EQU   CVTRV271                                                 00740000
CVTRV275 EQU   CVTRV271                                                 00741000
CVTRV274 EQU   CVTRV271                                                 00742000
CVTRV273 EQU   CVTRV271                                                 00743000
CVTRV272 EQU   CVTRV271                                                 00744000
CVTRV270 EQU   CVTRV262                                                 00745000
CVTRV269 EQU   CVTRV262                                                 00746000
CVTRV268 EQU   CVTRV262                                                 00747000
CVTRV267 EQU   CVTRV262                                                 00748000
CVTRV266 EQU   CVTRV262                                                 00749000
CVTRV265 EQU   CVTRV262                                                 00750000
CVTRV264 EQU   CVTRV262                                                 00751000
CVTRV263 EQU   CVTRV262                                                 00752000
CVTVFP   EQU   CVTS01+464                                               00753000
CVTVSI   EQU   CVTS01+460                                               00754000
CVTVPSIB EQU   CVTS01+456                                               00755000
CVTMFACT EQU   CVTMFRTR                                                 00756000
CVTMFCTL EQU   CVTS01+448                                               00757000
CVTPVBP  EQU   CVTS01+444                                               00758000
CVTPWI   EQU   CVTS01+440                                               00759000
CVTRV254 EQU   CVTS01+438                                               00760000
CVTRV253 EQU   CVTS01+436                                               00761000
CVTRV252 EQU   CVTS01+434                                               00762000
CVTRV251 EQU   CVTS01+433                                               00763000
CVTRV250 EQU   CVTS01+432                                               00764000
CVTRV249 EQU   CVTS01+431                                               00765000
CVTRV248 EQU   CVTS01+430                                               00766000
CVTRV247 EQU   CVTS01+429                                               00767000
CVTRV246 EQU   CVTS01+428                                               00768000
CVTRV245 EQU   CVTRV237                                                 00769000
CVTRV244 EQU   CVTRV237                                                 00770000
CVTRV243 EQU   CVTRV237                                                 00771000
CVTRV242 EQU   CVTRV237                                                 00772000
CVTRV241 EQU   CVTRV237                                                 00773000
CVTRV240 EQU   CVTRV237                                                 00774000
CVTRV239 EQU   CVTRV237                                                 00775000
CVTRV238 EQU   CVTRV237                                                 00776000
CVTRV236 EQU   CVTRV228                                                 00777000
CVTRV235 EQU   CVTRV228                                                 00778000
CVTRV234 EQU   CVTRV228                                                 00779000
CVTRV233 EQU   CVTRV228                                                 00780000
CVTRV232 EQU   CVTRV228                                                 00781000
CVTRV231 EQU   CVTRV228                                                 00782000
CVTRV230 EQU   CVTRV228                                                 00783000
CVTRV229 EQU   CVTRV228                                                 00784000
CVTRV227 EQU   CVTRV219                                                 00785000
CVTRV226 EQU   CVTRV219                                                 00786000
CVTRV225 EQU   CVTRV219                                                 00787000
CVTRV224 EQU   CVTRV219                                                 00788000
CVTRV223 EQU   CVTRV219                                                 00789000
CVTRV222 EQU   CVTRV219                                                 00790000
CVTRV221 EQU   CVTRV219                                                 00791000
CVTRV220 EQU   CVTRV219                                                 00792000
CVTRV218 EQU   CVTRV210                                                 00793000
CVTRV217 EQU   CVTRV210                                                 00794000
CVTRV216 EQU   CVTRV210                                                 00795000
CVTRV215 EQU   CVTRV210                                                 00796000
CVTRV214 EQU   CVTRV210                                                 00797000
CVTRV213 EQU   CVTRV210                                                 00798000
CVTRV212 EQU   CVTRV210                                                 00799000
CVTRV211 EQU   CVTRV210                                                 00800000
CVTLCCAT EQU   CVTS01+420                                               00801000
CVTPCCAT EQU   CVTS01+416                                               00802000
CVTIPCRP EQU   CVTS01+412                                               00803000
CVTIPCRI EQU   CVTS01+408                                               00804000
CVTIPCDS EQU   CVTS01+404                                               00805000
CVTAIDVT EQU   CVTS01+400                                               00806000
CVTSSAP  EQU   CVTS01+396                                               00807000
CVTEHCIR EQU   CVTS01+392                                               00808000
CVTEHDEF EQU   CVTS01+388                                               00809000
CVTDAIR  EQU   CVTS01+384                                               00810000
CVTPERFM EQU   CVTS01+380                                               00811000
CVT044R2 EQU   CVTS01+376                                               00812000
CVTFETCH EQU   CVTS01+372                                               00813000
CVTRSTWD EQU   CVTS01+368                                               00814000
CVTSPOST EQU   CVTS01+364                                               00815000
CVTIOBP  EQU   CVTS01+360                                               00816000
CVTASMVT EQU   CVTS01+356                                               00817000
CVTRECRQ EQU   CVTS01+352                                               00818000
CVTWSAC  EQU   CVTS01+348                                               00819000
CVTRV149 EQU   CVTS01+344                                               00820000
CVTWSAL  EQU   CVTS01+340                                               00821000
CVTSPSA  EQU   CVTS01+336                                               00822000
CVTGLMN  EQU   CVTS01+332                                               00823000
CVTVEAC0 EQU   CVTS01+328                                               00824000
CVT062R1 EQU   CVTS01+324                                               00825000
CVTRPOST EQU   CVTS01+320                                               00826000
CVTDQIQE EQU   CVTS01+316                                               00827000
CVTCSD   EQU   CVTS01+312                                               00828000
CVTLKRMA EQU   CVTS01+308                                               00829000
CVTRSPIE EQU   CVTS01+304                                               00830000
CVTRENQ  EQU   CVTS01+300                                               00831000
CVTLQCB  EQU   CVTS01+296                                               00832000
CVTFQCB  EQU   CVTS01+292                                               00833000
CVTQCS01 EQU   CVTS01+288                                               00834000
CVTAPFT  EQU   CVTS01+284                                               00835000
CVTPARRL EQU   CVTS01+280                                               00836000
CVTVWAIT EQU   CVTS01+276                                               00837000
CVTGSPL  EQU   CVTS01+272                                               00838000
CVTLSMQ  EQU   CVTS01+268                                               00839000
CVTGSMQ  EQU   CVTS01+264                                               00840000
CVTEXPRO EQU   CVTS01+260                                               00841000
CVTOPCTP EQU   CVTS01+256                                               00842000
CVTSIC   EQU   CVTS01+252                                               00843000
CVTTPIOS EQU   CVTS01+248                                               00844000
CVTRTMS  EQU   CVTS01+244                                               00845000
CVTSDBF  EQU   CVTS01+240                                               00846000
CVTSCBP  EQU   CVTS01+236                                               00847000
CVTSDMP  EQU   CVTS01+232                                               00848000
CVTSV60  EQU   CVTS01+228                                               00849000
CVTRTMCT EQU   CVTS01+224                                               00850000
CVTASCBL EQU   CVTS01+220                                               00851000
CVTASCBH EQU   CVTS01+216                                               00852000
CVTGDA   EQU   CVTS01+212                                               00853000
CVTASVT  EQU   CVTS01+208                                               00854000
CVTVVMDI EQU   CVTS01+204                                               00855000
CVTAQTOP EQU   CVTS01+200                                               00856000
CVTIOSCS EQU   CVTS01+196                                               00857000
CVTSDRM  EQU   CVTS01+192                                               00858000
CVTOPTE  EQU   CVTS01+188                                               00859000
CVTSTXU  EQU   CVTS01+184                                               00860000
CVTQUIS  EQU   CVTS01+180                                               00861000
CVTPARS  EQU   CVTS01+176                                               00862000
CVTS1EE  EQU   CVTS01+172                                               00863000
CVTFRAS  EQU   CVTS01+168                                               00864000
CVTQSAS  EQU   CVTS01+164                                               00865000
CVTCRAS  EQU   CVTS01+160                                               00866000
CVTCRMN  EQU   CVTS01+156                                               00867000
CVTDELCP EQU   CVTS01+152                                               00868000
CVTFRECL EQU   CVTS01+148                                               00869000
CVTGETCL EQU   CVTS01+144                                               00870000
CVTBLDCP EQU   CVTS01+140                                               00871000
CVTAUTHL EQU   CVTS01+136                                               00872000
CVTSCAN  EQU   CVTS01+132                                               00873000
CVTRV144 EQU   CVTS01+130                                               00874000
CVTMAXMP EQU   CVTS01+128                                               00875000
CVTSTCK  EQU   CVTS01+124                                               00876000
CVTRV139 EQU   CVTS01+123                                               00877000
CVTDSSAC EQU   CVTS01+122                                               00878000
CVTRV513 EQU   CVTS01+121                                               00879000
CVTIOSPL EQU   CVTS01+120                                               00880000
CVTPTGT  EQU   CVTS01+116                                               00881000
CVTCSPIE EQU   CVTS01+112                                               00882000
CVTSMFEX EQU   CVTS01+108                                               00883000
CVTOLT0A EQU   CVTS01+104                                               00884000
CVTSRBRT EQU   CVTS01+100                                               00885000
CVTPUTL  EQU   CVTS01+96                                                00886000
CVTASCRL EQU   CVTS01+92                                                00887000
CVTASCRF EQU   CVTS01+88                                                00888000
CVTRV326 EQU   CVTS01+84                                                00889000
CVTRV325 EQU   CVTS01+80                                                00890000
CVTRV324 EQU   CVTS01+76                                                00891000
CVT0VL01 EQU   CVTS01+72                                                00892000
CVTSHRVM EQU   CVTS01+68                                                00893000
CVTRV332 EQU   CVTS01+64                                                00894000
CVTTAS   EQU   CVTS01+60                                                00895000
CVTRSCN  EQU   CVTS01+56                                                00896000
CVTTRAC2 EQU   CVTS01+54                                                00897000
CVTTRACE EQU   CVTS01+52                                                00898000
CVTAPG   EQU   CVTS01+51                                                00899000
CVTSDTRC EQU   CVTCTLFG                                                 00900000
CVTGTRCE EQU   CVTCTLFG                                                 00901000
CVTNOMP  EQU   CVTCTLFG                                                 00902000
CVTRSV79 EQU   CVTCTLFG                                                 00903000
CVTDSTAT EQU   CVTCTLFG                                                 00904000
CVTRSV78 EQU   CVTCTLFG                                                 00905000
CVTRV333 EQU   CVTCTLFG                                                 00906000
CVTRV323 EQU   CVTCTLFG                                                 00907000
CVTSPVLK EQU   CVTS01+49                                                00908000
CVTRSV77 EQU   CVTS01+48                                                00909000
CVTRV331 EQU   CVTS01+44                                                00910000
CVTRV330 EQU   CVTS01+40                                                00911000
CVTRV329 EQU   CVTS01+36                                                00912000
CVTRV328 EQU   CVTS01+32                                                00913000
CVTRV322 EQU   CVTS01+28                                                00914000
CVTSLID  EQU   CVTSLIDA+1                                               00915000
CVTSYLK  EQU   CVTSLIDA                                                 00916000
CVTRV321 EQU   CVTS01+20                                                00917000
CVTRV320 EQU   CVTS01+16                                                00918000
CVTLPDIR EQU   CVTLPDIA+1                                               00919000
CVTRSV69 EQU   CVTDIRST                                                 00920000
CVTRSV68 EQU   CVTDIRST                                                 00921000
CVTRSV67 EQU   CVTDIRST                                                 00922000
CVTRSV66 EQU   CVTDIRST                                                 00923000
CVTRSV65 EQU   CVTDIRST                                                 00924000
CVTRSV64 EQU   CVTDIRST                                                 00925000
CVTRSV63 EQU   CVTDIRST                                                 00926000
CVTDICOM EQU   CVTDIRST                                                 00927000
CVTPVTP  EQU   CVTS01+8                                                 00928000
CVTLPDSR EQU   CVTS01+4                                                 00929000
CVTGETL  EQU   CVTS01                                                   00930000
CRAID    EQU   CRAIDS+4                                                 00931000
CRAASID  EQU   CRAIDS+2                                                 00932000
@NM00108 EQU   CRAIDS                                                   00933000
CRABFTBA EQU   CRABUFA                                                  00934000
CRAMASK  EQU   CRASVC+64                                                00935000
CRAHSIZ  EQU   CRASVC+60                                                00936000
CRAASCRR EQU   CRASVC                                                   00937000
@NM00107 EQU   CRAPROCR                                                 00938000
CRALAPTR EQU   CRABASIC+48                                              00939000
CRAL9PTR EQU   CRABASIC+44                                              00940000
CRAL8PTR EQU   CRABASIC+40                                              00941000
CRAL7PTR EQU   CRABASIC+36                                              00942000
CRAL6PTR EQU   CRABASIC+32                                              00943000
CRAL5PTR EQU   CRABASIC+28                                              00944000
CRAL4PTR EQU   CRABASIC+24                                              00945000
CRAL3PTR EQU   CRABASIC+20                                              00946000
CRAL2PTR EQU   CRABASIC+16                                              00947000
CRAL1PTR EQU   CRABASIC+12                                              00948000
CRALEV01 EQU   CRALKACT+3                                               00949000
CRALEV02 EQU   CRALKACT+3                                               00950000
CRALEV03 EQU   CRALKACT+3                                               00951000
CRALEV04 EQU   CRALKACT+3                                               00952000
CRALEV05 EQU   CRALKACT+3                                               00953000
CRALEV06 EQU   CRALKACT+3                                               00954000
CRALEV07 EQU   CRALKACT+3                                               00955000
CRALEV08 EQU   CRALKACT+3                                               00956000
CRALEV09 EQU   CRALKACT+2                                               00957000
CRALEV10 EQU   CRALKACT+2                                               00958000
CRALEV11 EQU   CRALKACT+2                                               00959000
CRALEV12 EQU   CRALKACT+2                                               00960000
CRALEV13 EQU   CRALKACT+2                                               00961000
CRALEV14 EQU   CRALKACT+2                                               00962000
CRALEV15 EQU   CRALKACT+2                                               00963000
CRALEV16 EQU   CRALKACT+2                                               00964000
CRALEV17 EQU   CRALKACT+1                                               00965000
CRALEV18 EQU   CRALKACT+1                                               00966000
CRALEV19 EQU   CRALKACT+1                                               00967000
CRALEV20 EQU   CRALKACT+1                                               00968000
CRALEV21 EQU   CRALKACT+1                                               00969000
CRALEV22 EQU   CRALKACT+1                                               00970000
CRALEV23 EQU   CRALKACT+1                                               00971000
CRALEV24 EQU   CRALKACT+1                                               00972000
CRALEV25 EQU   CRALKACT                                                 00973000
CRALEV26 EQU   CRALKACT                                                 00974000
CRALEV27 EQU   CRALKACT                                                 00975000
CRALEV28 EQU   CRALKACT                                                 00976000
CRALEV29 EQU   CRALKACT                                                 00977000
CRALEV30 EQU   CRALKACT                                                 00978000
CRALEV31 EQU   CRALKACT                                                 00979000
CRALEV32 EQU   CRALKACT                                                 00980000
CRAFRR   EQU   CRAHDR+4                                                 00981000
CRACRR   EQU   CRAHDR                                                   00982000
ASCPSREG EQU   ISTASCRR+44                                              00983000
ASCUSR01 EQU   ASCUSRGS+12                                              00984000
ASCUSR00 EQU   ASCUSRGS+8                                               00985000
ASCUSR15 EQU   ASCUSRGS+4                                               00986000
ASCUSR14 EQU   ASCUSRGS                                                 00987000
ASCETRYA EQU   ISTASCRR+24                                              00988000
ASCKEY   EQU   ISTASCRR+23                                              00989000
ASCAUDIT EQU   ASCFLG3                                                  00990000
ASCFBDUD EQU   ASCFLG3                                                  00991000
ASCLLKF  EQU   ASCFLG3                                                  00992000
ASCKEYF  EQU   ASCFLG3                                                  00993000
ASCFBDAL EQU   ASCFLG3                                                  00994000
ASCFSRGT EQU   ASCFLG3                                                  00995000
ASCICR   EQU   ASCFLG2                                                  00996000
ASCFSRIC EQU   ASCFLG2                                                  00997000
ASCFBDIC EQU   ASCFLG2                                                  00998000
ASCFBAIC EQU   ASCFLG2                                                  00999000
ASCPASTR EQU   ASCFLG1                                                  01000000
ASCFSR   EQU   ASCFLG1                                                  01001000
ASCFBD   EQU   ASCFLG1                                                  01002000
ASCFBA   EQU   ASCFLG1                                                  01003000
ASCPFCRR EQU   ISTASCRR                                                 01004000
CRRRVPT5 EQU   CRRSAREA+316                                             01005000
CRRRVPT4 EQU   CRRSAREA+312                                             01006000
CRRRVPT3 EQU   CRRSAREA+308                                             01007000
CRRRVPT2 EQU   CRRSAREA+304                                             01008000
CRRRVPT1 EQU   CRRSAREA+300                                             01009000
CRRRVCR2 EQU   CRRSAREA+296                                             01010000
CRRCID   EQU   CRRSAREA+292                                             01011000
CRRRVCR1 EQU   CRRSAREA+291                                             01012000
CRRXFNCD EQU   CRRSAREA+290                                             01013000
CRRLDOCT EQU   CRRSAREA+288                                             01014000
CRRBTLEN EQU   CRRSAREA+284                                             01015000
CRRBLEN  EQU   CRRSAREA+282                                             01016000
CRRBRTCD EQU   CRRSAREA+281                                             01017000
@NM00106 EQU   CRRBFLGS                                                 01018000
CRRBFLG1 EQU   CRRBFLGS                                                 01019000
CRRBLDAD EQU   CRRSAREA+276                                             01020000
CRRBARAD EQU   CRRSAREA+272                                             01021000
CRRRTN12 EQU   CRRSAREA+268                                             01022000
CRRRTN11 EQU   CRRSAREA+264                                             01023000
CRRRTN10 EQU   CRRSAREA+260                                             01024000
CRRRTN9  EQU   CRRSAREA+256                                             01025000
CRRRTN8  EQU   CRRSAREA+252                                             01026000
CRRRTN7  EQU   CRRSAREA+248                                             01027000
CRRRTN6  EQU   CRRSAREA+244                                             01028000
CRRRTN5  EQU   CRRSAREA+240                                             01029000
CRRRTN4  EQU   CRRSAREA+236                                             01030000
CRRRTN3  EQU   CRRSAREA+232                                             01031000
CRRRTN2  EQU   CRRSAREA+228                                             01032000
CRRRTN1  EQU   CRRSAREA+224                                             01033000
CRRRES1  EQU   CRRSAREA+222                                             01034000
CRRLCNT  EQU   CRRSAREA+220                                             01035000
CRRATCVT EQU   CRRSAREA+216                                             01036000
CRRVALCK EQU   CRRSAREA+212                                             01037000
CRRARPL  EQU   CRRTRBUF+4                                               01038000
CRRBIND  EQU   CRRTRBUF+3                                               01039000
CRRTRRES EQU   CRRTRBUF                                                 01040000
CRRCLDO  EQU   CRRSAREA+200                                             01041000
CRRUECB  EQU   CRRSAREA+196                                             01042000
CRRLCPB  EQU   CRRSAREA+192                                             01043000
CRRCMDAD EQU   CRRSAREA+188                                             01044000
CRRFMCB  EQU   CRRSAREA+184                                             01045000
CRRCLCCW EQU   CRRSAREA+180                                             01046000
CRRESR2  EQU   CRRESR+1                                                 01047000
CRRESR1  EQU   CRRESR                                                   01048000
CRRDSB2  EQU   CRRDSB+1                                                 01049000
CRRDSB1  EQU   CRRDSB                                                   01050000
CRRDTACT EQU   CRRSAREA+174                                             01051000
CRRRSV99 EQU   CRRSAREA+173                                             01052000
CRRRDSOH EQU   CRRFDB3                                                  01053000
CRRRLG   EQU   CRRFDB3                                                  01054000
CRRLGFRC EQU   CRRFDB3                                                  01055000
CRRRDEOT EQU   CRRFDB3                                                  01056000
CRRRDEOM EQU   CRRFDB3                                                  01057000
CRRRDEOB EQU   CRRFDB3                                                  01058000
CRRUNUSD EQU   CRRFDB3                                                  01059000
CRRUINPT EQU   CRRFDB3                                                  01060000
CRRSTSAV EQU   CRRFDB2                                                  01061000
CRRCUERR EQU   CRRFDB2                                                  01062000
CRRDLGFL EQU   CRRFDB2                                                  01063000
CRRIOERR EQU   CRRFDB2                                                  01064000
CRRDVUNS EQU   CRRFDB2                                                  01065000
CRRATND  EQU   CRRFDB2                                                  01066000
CRRRVID  EQU   CRRFDB2                                                  01067000
CRRERLK  EQU   CRRFDB2                                                  01068000
CRRRTNCD EQU   CRRFDBK1                                                 01069000
CRRNSNA  EQU   CRRRTYPE                                                 01070000
CRRDFSYN EQU   CRRRTYPE                                                 01071000
CRRRESP  EQU   CRRRTYPE                                                 01072000
CRRDFASY EQU   CRRRTYPE                                                 01073000
CRRDBLCK EQU   CRRRFLG1                                                 01074000
CRRRPSBD EQU   CRRRFLG1                                                 01075000
CRRRPLOQ EQU   CRRRFLG1                                                 01076000
CRRRPLS  EQU   CRRRFLG1                                                 01077000
CRRSW7   EQU   CRRFLGS                                                  01078000
CRRSW6   EQU   CRRFLGS                                                  01079000
CRRSW5   EQU   CRRFLGS                                                  01080000
CRRSW4   EQU   CRRFLGS                                                  01081000
CRRSW3   EQU   CRRFLGS                                                  01082000
CRRSW2   EQU   CRRFLGS                                                  01083000
CRRSW1   EQU   CRRFLGS                                                  01084000
CRRSW0   EQU   CRRFLGS                                                  01085000
CRRRSV04 EQU   CRRFLGS4                                                 01086000
CRRFMCLK EQU   CRRFLGS4                                                 01087000
CRRDLCCW EQU   CRRFLGS3                                                 01088000
CRRRESET EQU   CRRFLGS3                                                 01089000
CRRSUBBK EQU   CRRFLGS3                                                 01090000
CRRRSV08 EQU   CRRFLGS3                                                 01091000
CRRDEBQ  EQU   CRRFLGS3                                                 01092000
CRRSTSPR EQU   CRRFLGS3                                                 01093000
CRRDREQ  EQU   CRRFLGS3                                                 01094000
CRRDFDBK EQU   CRRFLGS3                                                 01095000
CRRDFSB  EQU   CRRFLGS2                                                 01096000
CRRDPROC EQU   CRRFLGS2                                                 01097000
CRREXTS  EQU   CRRFLGS2                                                 01098000
CRRELSRI EQU   CRRFLGS2                                                 01099000
CRRPOST  EQU   CRRFLGS2                                                 01100000
CRRENDLW EQU   CRRFLGS2                                                 01101000
CRRPRGIP EQU   CRRFLGS2                                                 01102000
CRRDEXP  EQU   CRRFLGS2                                                 01103000
CRRSOLRQ EQU   CRRFLGS1                                                 01104000
CRRREQP  EQU   CRRFLGS1                                                 01105000
CRRCPROC EQU   CRRFLGS1                                                 01106000
CRRFINI  EQU   CRRFLGS1                                                 01107000
CRRPREIO EQU   CRRFLGS1                                                 01108000
CRRINIO  EQU   CRRFLGS1                                                 01109000
CRRFLDOS EQU   CRRFLGS1                                                 01110000
CRRDOCUR EQU   CRRFLGS1                                                 01111000
CRRRATS4 EQU   CRRATS+7                                                 01112000
CRRASC31 EQU   CRRSATS                                                  01113000
CRRASC11 EQU   CRRSATS                                                  01114000
CRRASC51 EQU   CRRSATS                                                  01115000
CRRASC40 EQU   CRRSATS                                                  01116000
CRRASC30 EQU   CRRSATS                                                  01117000
CRRASC21 EQU   CRRSATS                                                  01118000
CRRASC10 EQU   CRRSATS                                                  01119000
CRRASC01 EQU   CRRSATS                                                  01120000
CRRSCBND EQU   CRRRATS2                                                 01121000
CRRPLIC  EQU   CRRRATS2                                                 01122000
CRRRC81  EQU   CRRRATS2                                                 01123000
CRRRC80  EQU   CRRRATS2                                                 01124000
CRRRC65  EQU   CRRRATS2                                                 01125000
CRRRC63  EQU   CRRRATS2                                                 01126000
CRRRC55  EQU   CRRRATS2                                                 01127000
CRRRC54  EQU   CRRRATS2                                                 01128000
CRRRC53  EQU   CRRRATS1                                                 01129000
CRRRC52  EQU   CRRRATS1                                                 01130000
CRRRC51  EQU   CRRRATS1                                                 01131000
CRRRC30  EQU   CRRRATS1                                                 01132000
CRRRC26  EQU   CRRRATS1                                                 01133000
CRRRC23  EQU   CRRRATS1                                                 01134000
CRRRC22  EQU   CRRRATS1                                                 01135000
CRRRC21  EQU   CRRRATS1                                                 01136000
@NM00105 EQU   CRRATS4                                                  01137000
CRRC3X   EQU   CRRATS4                                                  01138000
CRRC85   EQU   CRRATS4                                                  01139000
CRRC83   EQU   CRRATS4                                                  01140000
CRRC82   EQU   CRRATS4                                                  01141000
CRRC61   EQU   CRRATS4                                                  01142000
CRRC60   EQU   CRRATS4                                                  01143000
CRRC81   EQU   CRRATS3                                                  01144000
CRRC80   EQU   CRRATS3                                                  01145000
CRRC75   EQU   CRRATS3                                                  01146000
CRRC51   EQU   CRRATS3                                                  01147000
CRRC50   EQU   CRRATS3                                                  01148000
CRRC42   EQU   CRRATS3                                                  01149000
CRRC41   EQU   CRRATS3                                                  01150000
CRRC40   EQU   CRRATS3                                                  01151000
CRRC32   EQU   CRRATS2                                                  01152000
CRRC31   EQU   CRRATS2                                                  01153000
CRRC30   EQU   CRRATS2                                                  01154000
CRRC25   EQU   CRRATS2                                                  01155000
CRRC24   EQU   CRRATS2                                                  01156000
CRRC23   EQU   CRRATS2                                                  01157000
CRRC22   EQU   CRRATS2                                                  01158000
CRRC21   EQU   CRRATS2                                                  01159000
CRRC20   EQU   CRRATS1                                                  01160000
CRRC13   EQU   CRRATS1                                                  01161000
CRRC12   EQU   CRRATS1                                                  01162000
CRRC11   EQU   CRRATS1                                                  01163000
CRRC10   EQU   CRRATS1                                                  01164000
CRRC02   EQU   CRRATS1                                                  01165000
CRRC01   EQU   CRRATS1                                                  01166000
CRRC00   EQU   CRRATS1                                                  01167000
CRRRMAS4 EQU   CRRMAS+7                                                 01168000
CRRMSC31 EQU   CRRSMAS                                                  01169000
CRRMSC11 EQU   CRRSMAS                                                  01170000
CRRMSC51 EQU   CRRSMAS                                                  01171000
CRRMSC40 EQU   CRRSMAS                                                  01172000
CRRMSC30 EQU   CRRSMAS                                                  01173000
CRRMSC21 EQU   CRRSMAS                                                  01174000
CRRMSC10 EQU   CRRSMAS                                                  01175000
CRRMSC01 EQU   CRRSMAS                                                  01176000
@NM00104 EQU   CRRRMAS2                                                 01177000
CRRRM81  EQU   CRRRMAS2                                                 01178000
CRRRM80  EQU   CRRRMAS2                                                 01179000
CRRRM65  EQU   CRRRMAS2                                                 01180000
CRRRM63  EQU   CRRRMAS2                                                 01181000
CRRRM55  EQU   CRRRMAS2                                                 01182000
CRRRM54  EQU   CRRRMAS2                                                 01183000
CRRRM53  EQU   CRRRMAS1                                                 01184000
CRRRM52  EQU   CRRRMAS1                                                 01185000
CRRRM51  EQU   CRRRMAS1                                                 01186000
CRRRM30  EQU   CRRRMAS1                                                 01187000
CRRRM26  EQU   CRRRMAS1                                                 01188000
CRRRM23  EQU   CRRRMAS1                                                 01189000
CRRRM22  EQU   CRRRMAS1                                                 01190000
CRRRM21  EQU   CRRRMAS1                                                 01191000
@NM00103 EQU   CRRMAS4                                                  01192000
CRRM3X   EQU   CRRMAS4                                                  01193000
CRRM85   EQU   CRRMAS4                                                  01194000
CRRM83   EQU   CRRMAS4                                                  01195000
CRRM82   EQU   CRRMAS4                                                  01196000
CRRM61   EQU   CRRMAS4                                                  01197000
CRRM60   EQU   CRRMAS4                                                  01198000
CRRM81   EQU   CRRMAS3                                                  01199000
CRRM80   EQU   CRRMAS3                                                  01200000
CRRM75   EQU   CRRMAS3                                                  01201000
CRRM51   EQU   CRRMAS3                                                  01202000
CRRM50   EQU   CRRMAS3                                                  01203000
CRRM42   EQU   CRRMAS3                                                  01204000
CRRM41   EQU   CRRMAS3                                                  01205000
CRRM40   EQU   CRRMAS3                                                  01206000
CRRM32   EQU   CRRMAS2                                                  01207000
CRRM31   EQU   CRRMAS2                                                  01208000
CRRM30   EQU   CRRMAS2                                                  01209000
CRRM25   EQU   CRRMAS2                                                  01210000
CRRM24   EQU   CRRMAS2                                                  01211000
CRRM23   EQU   CRRMAS2                                                  01212000
CRRM22   EQU   CRRMAS2                                                  01213000
CRRM21   EQU   CRRMAS2                                                  01214000
CRRM20   EQU   CRRMAS1                                                  01215000
CRRM13   EQU   CRRMAS1                                                  01216000
CRRM12   EQU   CRRMAS1                                                  01217000
CRRM11   EQU   CRRMAS1                                                  01218000
CRRM10   EQU   CRRMAS1                                                  01219000
CRRM02   EQU   CRRMAS1                                                  01220000
CRRM01   EQU   CRRMAS1                                                  01221000
CRRM00   EQU   CRRMAS1                                                  01222000
CRRFSB   EQU   CRRSAREA+144                                             01223000
CRRSAVE1 EQU   CRRSAREA+72                                              01224000
CRRSAVE  EQU   CRRSAREA                                                 01225000
CRRRSV22 EQU   ISTDCCRR+4                                               01226000
CRRCRR   EQU   ISTDCCRR                                                 01227000
CCFRSVD1 EQU   CFCCRT                                                   01228000
CCFCR2   EQU   CFCCRT                                                   01229000
CCFCRP   EQU   CFCCRT                                                   01230000
CCFCR1   EQU   CFCCRT                                                   01231000
CCFCS2   EQU   CFCCRT                                                   01232000
CCFCS1   EQU   CFCCRT                                                   01233000
NCFRSVD  EQU   CFCNTRD                                                  01234000
NCFCR2   EQU   CFCNTRD                                                  01235000
NCFCRP   EQU   CFCNTRD                                                  01236000
NCFCR1   EQU   CFCNTRD                                                  01237000
NCFCS2   EQU   CFCNTRD                                                  01238000
NCFCS1   EQU   CFCNTRD                                                  01239000
ATCAOS   EQU   ISTATCVT+1868                                            01240000
@NM00102 EQU   ISTATCVT+1860                                            01241000
@NM00101 EQU   ISTATCVT+1852                                            01242000
@NM00100 EQU   ISTATCVT+1844                                            01243000
@NM00099 EQU   ISTATCVT+1836                                            01244000
@NM00098 EQU   ISTATCVT+1828                                            01245000
@NM00097 EQU   ISTATCVT+1820                                            01246000
@NM00096 EQU   ISTATCVT+1816                                            01247000
ATCCACSA EQU   ISTATCVT+1812                                            01248000
ATCMXCSA EQU   ISTATCVT+1808                                            01249000
ATCTPMPB EQU   ISTATCVT+1776                                            01250000
ATCTRMPB EQU   ISTATCVT+1744                                            01251000
ATCRPLAC EQU   ATCRPLCN+2                                               01252000
ATCRPLRC EQU   ATCRPLCN                                                 01253000
ATCCRPLQ EQU   ATCCRPL                                                  01254000
ATCSRBRC EQU   ATCSRBCN                                                 01255000
ATCCRAAC EQU   ATCCRACN+2                                               01256000
ATCCRARC EQU   ATCCRACN                                                 01257000
ATCCRAQ  EQU   ATCCRA                                                   01258000
ATCLUFFD EQU   ISTATCVT+1716                                            01259000
ATCVIOPM EQU   ISTATCVT+1712                                            01260000
ATCTPMMI EQU   ISTATCVT+1708                                            01261000
ATCPXSRB EQU   ISTATCVT+1704                                            01262000
ATCRPLCT EQU   ISTATCVT+1702                                            01263000
ATCCRACT EQU   ISTATCVT+1700                                            01264000
ATCSTNSM EQU   ISTATCVT+1697                                            01265000
@NM00095 EQU   ATCZFLAG                                                 01266000
ATCZF001 EQU   ATCZFLAG                                                 01267000
ATCTPCP1 EQU   ISTATCVT+1692                                            01268000
ATCTPCP0 EQU   ISTATCVT+1688                                            01269000
ATCZR01  EQU   ISTATCVT+1684                                            01270000
ATCMPLTA EQU   ISTATCVT+1680                                            01271000
ATCASCB  EQU   ISTATCVT+1676                                            01272000
ATCAP86  EQU   ISTATCVT+1672                                            01273000
ATCAP85  EQU   ISTATCVT+1668                                            01274000
ATCAP84  EQU   ISTATCVT+1664                                            01275000
ATCAP83  EQU   ISTATCVT+1660                                            01276000
ATCAP82  EQU   ISTATCVT+1656                                            01277000
ATCAP69  EQU   ISTATCVT+1652                                            01278000
ATCAP66  EQU   ISTATCVT+1648                                            01279000
ATCAPC59 EQU   ISTATCVT+1640                                            01280000
ATCAP56  EQU   ISTATCVT+1636                                            01281000
ATCAP55  EQU   ISTATCVT+1632                                            01282000
ATCAP41  EQU   ISTATCVT+1628                                            01283000
ATCAPC25 EQU   ISTATCVT+1624                                            01284000
ATCAP23  EQU   ISTATCVT+1620                                            01285000
ATCAPBE  EQU   ISTATCVT+1616                                            01286000
ATCPSTA  EQU   ISTATCVT+1612                                            01287000
ATCSMABF EQU   ISTATCVT+1608                                            01288000
ATCSMAPR EQU   ISTATCVT+1604                                            01289000
ATCTPWQA EQU   ISTATCVT+1600                                            01290000
ATCSMAID EQU   ISTATCVT+1596                                            01291000
ATCSMARA EQU   ISTATCVT+1592                                            01292000
ATCCACXA EQU   ISTATCVT+1588                                            01293000
ATCATA10 EQU   ISTATCVT+1584                                            01294000
ATCHLTCB EQU   ISTATCVT+1580                                            01295000
@NM00094 EQU   ATCVTFLG                                                 01296000
ATCVTACT EQU   ATCVTFLG                                                 01297000
@NM00093 EQU   @NM00092                                                 01298000
ATCVTMAB EQU   @NM00092                                                 01299000
ATCVTBAM EQU   ISTATCVT+1572                                            01300000
@NM00091 EQU   ISTATCVT+1568                                            01301000
@NM00090 EQU   ISTATCVT+1520                                            01302000
ATCCCOOC EQU   ISTATCVT+1516                                            01303000
@NM00089 EQU   ISTATCVT+1513                                            01304000
ATCSNUF  EQU   ATCENFLG                                                 01305000
ATCOPKL  EQU   ATCENFLG                                                 01306000
ATCABEN  EQU   ATCENFLG                                                 01307000
ATCSRDN  EQU   ATCENFLG                                                 01308000
ATCDLDN  EQU   ATCENFLG                                                 01309000
ATCTIMER EQU   ISTATCVT+1508                                            01310000
ATCAIWT  EQU   ISTATCVT+1504                                            01311000
ATCOROBT EQU   ISTATCVT+1500                                            01312000
ATCDMAPP EQU   ISTATCVT+1496                                            01313000
ATCZDVTX EQU   ISTATCVT+1492                                            01314000
ATCPXCRA EQU   ISTATCVT+1488                                            01315000
ATCICNCB EQU   ISTATCVT+1484                                            01316000
ATCCMTCB EQU   ISTATCVT+1480                                            01317000
ATCPRPH  EQU   ISTATCVT+1476                                            01318000
ATCGSRBF EQU   ATCGSRBG                                                 01319000
ATCSRBRT EQU   ISTATCVT+1468                                            01320000
ATCTSCPC EQU   ISTATCVT+1464                                            01321000
@NM00088 EQU   ISTATCVT+1460                                            01322000
ATCCDTCB EQU   ISTATCVT+1456                                            01323000
ATCORFRL EQU   ISTATCVT+1452                                            01324000
ATCORFPX EQU   ISTATCVT+1448                                            01325000
ATCORFMG EQU   ISTATCVT+1444                                            01326000
ATCSMBQ  EQU   ISTATCVT+1440                                            01327000
ATCINFDD EQU   ISTATCVT+1436                                            01328000
ATCAP67  EQU   ISTATCVT+1432                                            01329000
ATCAP65  EQU   ISTATCVT+1428                                            01330000
ATCAP64  EQU   ISTATCVT+1424                                            01331000
ATCAP63  EQU   ISTATCVT+1420                                            01332000
ATCAP61  EQU   ISTATCVT+1416                                            01333000
ATCAP58  EQU   ISTATCVT+1412                                            01334000
ATCAP54  EQU   ISTATCVT+1404                                            01335000
ATCAP53  EQU   ISTATCVT+1400                                            01336000
ATCAP52  EQU   ISTATCVT+1396                                            01337000
ATCAP51  EQU   ISTATCVT+1392                                            01338000
ATCAP38  EQU   ISTATCVT+1388                                            01339000
ATCAP37  EQU   ISTATCVT+1384                                            01340000
ATCAP34  EQU   ISTATCVT+1380                                            01341000
ATCAP32  EQU   ISTATCVT+1376                                            01342000
ATCAP31  EQU   ISTATCVT+1372                                            01343000
ATCAP12  EQU   ISTATCVT+1368                                            01344000
ATCAP11  EQU   ISTATCVT+1364                                            01345000
ATCDAPDG EQU   ATCDAPVT+20                                              01346000
ATCDXCEA EQU   ATCDAPVT+16                                              01347000
ATCDCEA  EQU   ATCDAPVT+12                                              01348000
ATCDPCIA EQU   ATCDAPVT+8                                               01349000
ATCDSIOA EQU   ATCDAPVT+4                                               01350000
ATCDEOEA EQU   ATCDAPVT                                                 01351000
ATCZAEA  EQU   ATCICAPP+16                                              01352000
ATCZCEA  EQU   ATCICAPP+12                                              01353000
ATCZCPCI EQU   ATCICAPP+8                                               01354000
ATCZSIOA EQU   ATCICAPP+4                                               01355000
ATCCDRPH EQU   ATCICAPP                                                 01356000
ATCORQG  EQU   ATCORSRB                                                 01357000
ATCORTBF EQU   ATCSQAFR                                                 01358000
@NM00087 EQU   ISTATCVT+1308                                            01359000
ATCZLAEA EQU   ATCLDAPP+16                                              01360000
ATCZLCEA EQU   ATCLDAPP+12                                              01361000
ATCZLPCI EQU   ATCLDAPP+8                                               01362000
ATCSMFRR EQU   ATCLDAPP+4                                               01363000
ATCCDTID EQU   ATCLDAPP                                                 01364000
@NM00086 EQU   ISTATCVT+1256                                            01365000
ATCZPAB2 EQU   ISTATCVT+1224                                            01366000
@NM00085 EQU   ISTATCVT+1224                                            01367000
@NM00084 EQU   ISTATCVT+1164                                            01368000
ATCCPCFE EQU   ISTATCVT+1160                                            01369000
@NM00083 EQU   ATCRID+2                                                 01370000
ATCCDRMA EQU   ATCRID                                                   01371000
@NM00082 EQU   ATCSMSDQ+8                                               01372000
@NM00081 EQU   ATCSMSDQ+4                                               01373000
@NM00080 EQU   ATCSMSDQ                                                 01374000
ATCSEQNO EQU   ISTATCVT+1136                                            01375000
ATCSMPMD EQU   ISTATCVT+1132                                            01376000
ATCPAREA EQU   ISTATCVT+1128                                            01377000
ATCCPCSM EQU   ISTATCVT+1124                                            01378000
ATCQLOCK EQU   ISTATCVT+1120                                            01379000
ATCITQLE EQU   ISTATCVT+1116                                            01380000
ATCSQCDS EQU   ISTATCVT+1112                                            01381000
ATCUSSVT EQU   ISTATCVT+1108                                            01382000
ATCNOSQ  EQU   ISTATCVT+1104                                            01383000
ATCINCIP EQU   ATCCPDVT+4                                               01384000
ATCTSCNI EQU   ATCCPDVT                                                 01385000
ATCMGCRT EQU   ISTATCVT+1092                                            01386000
ATCMACRT EQU   ISTATCVT+1088                                            01387000
ATCCSMT  EQU   ISTATCVT+1084                                            01388000
ATCDRUSL EQU   ISTATCVT+1080                                            01389000
ATCDRULL EQU   ISTATCVT+1076                                            01390000
ATCCFCDR EQU   ISTATCVT+1072                                            01391000
@NM00079 EQU   ISTATCVT+1069                                            01392000
ATCMROUT EQU   ISTATCVT+1060                                            01393000
ATCONFIG EQU   ISTATCVT+1052                                            01394000
ATCNODEL EQU   ISTATCVT+1044                                            01395000
@NM00078 EQU   @NM00077+9                                               01396000
ATCLAST  EQU   ATCSHRFG                                                 01397000
ATCSHRTN EQU   @NM00077                                                 01398000
@NM00076 EQU   ISTATCVT+1026                                            01399000
ATCNMCTR EQU   ISTATCVT+1024                                            01400000
ATCPOIA  EQU   ATCRNO+1                                                 01401000
@NM00075 EQU   ATCRNO                                                   01402000
ATCLCLCT EQU   ATCVLCNT+2                                               01403000
ATCRNCNT EQU   ATCVLCNT                                                 01404000
ATCHBSIZ EQU   ATCHPGM+2                                                01405000
ATCHBFNO EQU   ATCHPGM                                                  01406000
@NM00074 EQU   ISTATCVT+1011                                            01407000
ATCXRANG EQU   ISTATCVT+1010                                            01408000
ATCMAXID EQU   ISTATCVT+1009                                            01409000
ATCMSGSP EQU   ISTATCVT+1008                                            01410000
ATCCIDM  EQU   ISTATCVT+1006                                            01411000
ATCACTRM EQU   ISTATCVT+1004                                            01412000
ATCECTLP EQU   ISTATCVT+1000                                            01413000
ATCECNET EQU   ISTATCVT+996                                             01414000
ATCECOPC EQU   ISTATCVT+992                                             01415000
ATCECSES EQU   ISTATCVT+988                                             01416000
ATCECDSP EQU   ISTATCVT+984                                             01417000
ATCECVRY EQU   ISTATCVT+980                                             01418000
ATCECHLT EQU   ISTATCVT+976                                             01419000
ATCECMOD EQU   ISTATCVT+972                                             01420000
ATCVDLOK EQU   ISTATCVT+968                                             01421000
ATCRDTLK EQU   ISTATCVT+964                                             01422000
ATCVOCLK EQU   ISTATCVT+960                                             01423000
ATCITLIM EQU   ISTATCVT+958                                             01424000
ATCTMINV EQU   ISTATCVT+956                                             01425000
ATCHOSTA EQU   ISTATCVT+954                                             01426000
ATCPUNSA EQU   ISTATCVT+952                                             01427000
ATCSAF   EQU   ISTATCVT+950                                             01428000
ATCVTMID EQU   ATCSSCPA                                                 01429000
ATCHCNID EQU   ATCONID+2                                                01430000
ATCSCNID EQU   ATCONID                                                  01431000
@NM00073 EQU   ATCBITAN+3                                               01432000
@NM00072 EQU   ATCBITAN+2                                               01433000
@NM00071 EQU   ATCFLAG2                                                 01434000
@NM00070 EQU   ATCFLAG2                                                 01435000
@NM00069 EQU   ATCFLAG2                                                 01436000
ATCCRYPF EQU   ATCFLAG2                                                 01437000
ATCTUNCL EQU   ATCFLAG2                                                 01438000
ATCTUNRQ EQU   ATCFLAG2                                                 01439000
ATCTUNAC EQU   ATCFLAG2                                                 01440000
ATCCDLRA EQU   ATCFLAG2                                                 01441000
@NM00068 EQU   ATCBITAN                                                 01442000
@NM00067 EQU   ATCSTAT4                                                 01443000
@NM00066 EQU   ATCSTAT4                                                 01444000
@NM00065 EQU   ATCSTAT4                                                 01445000
@NM00064 EQU   ATCSTAT4                                                 01446000
@NM00063 EQU   ATCSTAT4                                                 01447000
ATCPRTAT EQU   ATCSTAT4                                                 01448000
ATCNCSD  EQU   ATCSTAT4                                                 01449000
ATCMTST  EQU   ATCSTAT4                                                 01450000
@NM00062 EQU   ATCPOFLG                                                 01451000
@NM00061 EQU   ATCPOFLG                                                 01452000
@NM00060 EQU   ATCPOFLG                                                 01453000
@NM00059 EQU   ATCPOFLG                                                 01454000
@NM00058 EQU   ATCPOFLG                                                 01455000
@NM00057 EQU   ATCPOFLG                                                 01456000
@NM00056 EQU   ATCPOFLG                                                 01457000
ATCPOUNS EQU   ATCPOFLG                                                 01458000
@NM00055 EQU   ATCSTAT+1                                                01459000
ATCHIP   EQU   ATCSTAT1                                                 01460000
ATCMDHLT EQU   ATCSTAT1                                                 01461000
ATCINHLT EQU   ATCSTAT1                                                 01462000
ATCNETSL EQU   ATCSTAT1                                                 01463000
ATCQKHLT EQU   ATCSTAT1                                                 01464000
ATCSNHLT EQU   ATCSTAT1                                                 01465000
ATCACTIV EQU   ATCSTAT1                                                 01466000
ATCSTART EQU   ATCSTAT1                                                 01467000
ATCNOP00 EQU   ISTATCVT+932                                             01468000
ATCTSBUF EQU   ISTATCVT+928                                             01469000
ATCFEPT  EQU   ISTATCVT+924                                             01470000
ATCFDVT  EQU   ISTATCVT+920                                             01471000
ATCCONFT EQU   ISTATCVT+916                                             01472000
ATCRDTH  EQU   ISTATCVT+912                                             01473000
ATCSIBQ  EQU   ISTATCVT+908                                             01474000
ATCHLTMS EQU   ISTATCVT+904                                             01475000
ATCECPRM EQU   ISTATCVT+900                                             01476000
ATCVPARM EQU   ISTATCVT+896                                             01477000
ATCOCHA  EQU   ISTATCVT+892                                             01478000
ATCDSPLQ EQU   ISTATCVT+888                                             01479000
ATCVARYQ EQU   ISTATCVT+884                                             01480000
ATCHALTQ EQU   ISTATCVT+880                                             01481000
ATCMODQ  EQU   ISTATCVT+876                                             01482000
ATCSRT   EQU   ISTATCVT+872                                             01483000
ATCRDT   EQU   ISTATCVT+868                                             01484000
ATCSDVT  EQU   ISTATCVT+864                                             01485000
ATCDLRPT EQU   ISTATCVT+860                                             01486000
ATCACDA  EQU   ISTATCVT+852                                             01487000
ATCMNT   EQU   ISTATCVT+848                                             01488000
ATCUEP   EQU   ISTATCVT+844                                             01489000
ATCNODDS EQU   ISTATCVT+840                                             01490000
ATCITRT  EQU   ISTATCVT+836                                             01491000
ATCTODVT EQU   ISTATCVT+832                                             01492000
ATCTRCPT EQU   ISTATCVT+828                                             01493000
ATCMODTB EQU   ISTATCVT+824                                             01494000
ATCUSSPT EQU   ISTATCVT+820                                             01495000
ATCTUBUF EQU   ISTATCVT+816                                             01496000
ATCTACB  EQU   ISTATCVT+812                                             01497000
ATCDWA   EQU   ISTATCVT+808                                             01498000
ATCCFCR2 EQU   ATCPODVT                                                 01499000
ATCEPA   EQU   ISTATCVT+800                                             01500000
ATCPULQB EQU   @NM00054+16                                              01501000
ATCMCQAB EQU   @NM00054+12                                              01502000
ATCLUSMQ EQU   @NM00054+8                                               01503000
ATCLUIOQ EQU   @NM00054+4                                               01504000
ATCIOLQB EQU   @NM00054                                                 01505000
ATCTSCAP EQU   ATCANYDT                                                 01506000
ATCTSCCO EQU   ATCLUDVT+4                                               01507000
ATCTSCSR EQU   ATCLUDVT                                                 01508000
ATCVTLOD EQU   ISTATCVT+764                                             01509000
ATCTSCLF EQU   ISTATCVT+760                                             01510000
ATCTSCLE EQU   ISTATCVT+756                                             01511000
ATCTSCLB EQU   ISTATCVT+752                                             01512000
ATCTSCLS EQU   ISTATCVT+748                                             01513000
ATCTSCCF EQU   ISTATCVT+744                                             01514000
ATCTSCFV EQU   ISTATCVT+740                                             01515000
ATCTSCCE EQU   ISTATCVT+736                                             01516000
ATCTSCCB EQU   ISTATCVT+732                                             01517000
ATCTSCWS EQU   ISTATCVT+728                                             01518000
ATCTSCEM EQU   ISTATCVT+724                                             01519000
ATCTSCNS EQU   ISTATCVT+720                                             01520000
ATCTSCER EQU   ISTATCVT+716                                             01521000
ATCTSCPR EQU   ISTATCVT+712                                             01522000
ATCTSCGR EQU   ISTATCVT+708                                             01523000
ATCTSCCI EQU   ISTATCVT+704                                             01524000
ATCTSVT  EQU   ISTATCVT+700                                             01525000
ATCDVLOD EQU   ISTATCVT+696                                             01526000
ATCCDCNR EQU   ISTATCVT+692                                             01527000
ATCCDCNF EQU   ISTATCVT+688                                             01528000
ATCCDCND EQU   ISTATCVT+684                                             01529000
ATCCDCNA EQU   ISTATCVT+680                                             01530000
ATCCDCCP EQU   ISTATCVT+676                                             01531000
ATCCDFDN EQU   ISTATCVT+672                                             01532000
ATCCDFIN EQU   ISTATCVT+668                                             01533000
ATCCDFND EQU   ISTATCVT+664                                             01534000
ATCCDDEL EQU   ISTATCVT+660                                             01535000
ATCCDADD EQU   ISTATCVT+656                                             01536000
ATCTCLIM EQU   ISTATCVT+652                                             01537000
ATCRACTR EQU   ISTATCVT+648                                             01538000
ATCRACTI EQU   ISTATCVT+644                                             01539000
ATCREMOV EQU   ISTATCVT+640                                             01540000
ATCRACIO EQU   ISTATCVT+636                                             01541000
ATCADD   EQU   ISTATCVT+632                                             01542000
ATCPUCRT EQU   ISTATCVT+628                                             01543000
ATCSMRQ  EQU   ISTATCVT+620                                             01544000
ATCORCPX EQU   ISTATCVT+616                                             01545000
ATCORCAF EQU   ISTATCVT+612                                             01546000
ATCFRSTR EQU   ATCGTSTR                                                 01547000
ATCSTMA  EQU   ISTATCVT+604                                             01548000
ATCSRTAD EQU   ISTATCVT+600                                             01549000
ATCOCRT  EQU   ISTATCVT+596                                             01550000
ATCOCCFS EQU   ISTATCVT+592                                             01551000
ATCOCCFP EQU   ISTATCVT+588                                             01552000
ATCSRTDF EQU   ISTATCVT+584                                             01553000
ATCLUCRT EQU   ISTATCVT+580                                             01554000
ATCINCY5 EQU   ISTATCVT+576                                             01555000
ATCINCW3 EQU   ISTATCVT+572                                             01556000
ATCINCU6 EQU   ISTATCVT+568                                             01557000
ATCINCTQ EQU   ISTATCVT+564                                             01558000
ATCINCS1 EQU   ISTATCVT+560                                             01559000
ATCSRTAB EQU   ISTATCVT+556                                             01560000
ATCINCRD EQU   ISTATCVT+552                                             01561000
ATCINCPH EQU   ISTATCVT+548                                             01562000
ATCINCLQ EQU   ISTATCVT+544                                             01563000
ATCNOCRT EQU   ISTATCVT+540                                             01564000
ATCINCF1 EQU   ISTATCVT+536                                             01565000
ATCINCCI EQU   ISTATCVT+532                                             01566000
ATCINCCO EQU   ISTATCVT+528                                             01567000
ATCBLDLA EQU   ISTATCVT+524                                             01568000
ATCALOAD EQU   ISTATCVT+520                                             01569000
ATCADEL  EQU   ISTATCVT+516                                             01570000
ATCESC02 EQU   ISTATCVT+512                                             01571000
ATCESC01 EQU   ISTATCVT+508                                             01572000
ATCDEC01 EQU   ISTATCVT+504                                             01573000
ATCDEC00 EQU   ISTATCVT+500                                             01574000
ATCCPCRT EQU   ISTATCVT+496                                             01575000
ATCMSGM  EQU   ISTATCVT+492                                             01576000
ATCCPCFR EQU   ISTATCVT+488                                             01577000
ATCCPCGR EQU   ISTATCVT+484                                             01578000
ATCCPCPP EQU   ISTATCVT+480                                             01579000
ATCMSGP  EQU   ISTATCVT+476                                             01580000
ATCCPCNT EQU   ISTATCVT+472                                             01581000
ATCAUTHA EQU   ISTATCVT+468                                             01582000
ATCACCTA EQU   ISTATCVT+464                                             01583000
ATCAP39  EQU   ISTATCVT+460                                             01584000
ATCAP36  EQU   ISTATCVT+456                                             01585000
ATCAP35  EQU   ISTATCVT+452                                             01586000
ATCAP33  EQU   ISTATCVT+448                                             01587000
ATCAPCR5 EQU   ISTATCVT+444                                             01588000
ATCAICPT EQU   ISTATCVT+440                                             01589000
ATCAPI   EQU   ISTATCVT+436                                             01590000
ATCAICTN EQU   ISTATCVT+432                                             01591000
ATCACC01 EQU   ISTATCVT+428                                             01592000
ATCACC00 EQU   ISTATCVT+424                                             01593000
ATCLDECB EQU   ATCLDTIL+12                                              01594000
ATCLDLCK EQU   ATCLDTIL+8                                               01595000
ATCLDLST EQU   ATCLDTIL+4                                               01596000
ATCLDNCS EQU   ATCLDTIL                                                 01597000
ATCNOSPB EQU   ISTATCVT+376                                             01598000
ATCNSPAB EQU   ISTATCVT+344                                             01599000
ATCLUSRT EQU   ISTATCVT+312                                             01600000
ATCPUIOP EQU   ISTATCVT+280                                             01601000
ATCPUPAB EQU   ISTATCVT+248                                             01602000
ATCPXPAB EQU   ISTATCVT+216                                             01603000
ATCPOPAB EQU   ISTATCVT+184                                             01604000
@NM00053 EQU   ATCVDPAB+16                                              01605000
ATCFEPAB EQU   ATCVDPAB                                                 01606000
ATCTCIPB EQU   ISTATCVT+120                                             01607000
ATCCSPAB EQU   ATCSMPAB+16                                              01608000
@NM00052 EQU   ATCSMPAB                                                 01609000
ATCTMRPB EQU   ISTATCVT+56                                              01610000
ATCITPAB EQU   ISTATCVT+24                                              01611000
@NM00051 EQU   ATCITRA1                                                 01612000
ATCITSCP EQU   ATCITRA1                                                 01613000
ATCITMSG EQU   ATCITRA1                                                 01614000
ATCITPIU EQU   ATCITRA1                                                 01615000
ATCITSMS EQU   ATCITRA1                                                 01616000
ATCITPSS EQU   ATCITRA1                                                 01617000
ATCITLCK EQU   ATCITRA1                                                 01618000
ATCITAPI EQU   ATCITRA1                                                 01619000
ATCITCNT EQU   ATCITFLG                                                 01620000
ATCITRPH EQU   ATCITCDS                                                 01621000
ATCITTBL EQU   ATCITFLD+4                                               01622000
ATCITPRM EQU   ATCITFLD                                                 01623000
ATCPTCHA EQU   ATCRPTCH+4                                               01624000
ATCVTLVL EQU   ATCRPTCH                                                 01625000
MPSSRB1  EQU   ISTMPST+172                                              01626000
MPSSAVE  EQU   ISTMPST+140                                              01627000
MPSMQLBP EQU   ISTMPST+136                                              01628000
MPSSYSRT EQU   ISTMPST+132                                              01629000
MPSQEL   EQU   ISTMPST+128                                              01630000
MPSDBTBL EQU   ISTMPST+124                                              01631000
MPSASCB  EQU   ISTMPST+120                                              01632000
MPSTPPAB EQU   ISTMPST+88                                               01633000
MPSSMPAB EQU   ISTMPST+56                                               01634000
MPSSMRPH EQU   ISTMPST+52                                               01635000
MPSSRB55 EQU   ISTMPST+48                                               01636000
MPSRPLAC EQU   MPSRPLCT+2                                               01637000
MPSRPLRC EQU   MPSRPLCT                                                 01638000
MPSCRPLQ EQU   MPSCRPL                                                  01639000
MPSSRBAC EQU   MPSSRBCT+2                                               01640000
MPSSRBRC EQU   MPSSRBCT                                                 01641000
MPSSRBQ  EQU   MPSSRB                                                   01642000
MPSCRAAC EQU   MPSCRACT+2                                               01643000
MPSCRARC EQU   MPSCRACT                                                 01644000
MPSCRAQ  EQU   MPSCRA                                                   01645000
MPSMPSTP EQU   ISTMPST+20                                               01646000
MPSPSTCT EQU   ISTMPST+16                                               01647000
MPSASID  EQU   MPSFLGA+2                                                01648000
MPSRMGOC EQU   MPSFLGAB                                                 01649000
MPSPSTAB EQU   MPSFLGAA                                                 01650000
MPSRSV01 EQU   MPSFLGAA                                                 01651000
MPSTPBU  EQU   MPSFLGAA                                                 01652000
MPMEMTRM EQU   MPSFLGAA                                                 01653000
MPSAUTH  EQU   MPSFLGAA                                                 01654000
MPSCRAO  EQU   MPSFLGAA                                                 01655000
MPSRQUEG EQU   MPSRQUE                                                  01656000
MPSTSOIR EQU   MPSRSV07                                                 01657000
MPSTSOIW EQU   MPSRSV07                                                 01658000
MPSID    EQU   ISTMPST                                                  01659000
PSTDRDYQ EQU   PSTDMPS+1                                                01660000
@NM00050 EQU   PSTDMPS                                                  01661000
PSTDGATE EQU   PSTDMPS                                                  01662000
PSTDEBP  EQU   ISTPST+128                                               01663000
PSTSAVE  EQU   ISTPST+96                                                01664000
PSTSMDYP EQU   ISTPST+64                                                01665000
PSTCRRS  EQU   ISTPST+60                                                01666000
PSTCRR1  EQU   ISTPST+56                                                01667000
PSTIQE22 EQU   ISTPST+52                                                01668000
PSTIQE21 EQU   ISTPST+48                                                01669000
PSTIQE12 EQU   ISTPST+44                                                01670000
PSTIQE11 EQU   ISTPST+40                                                01671000
PSTUEQ   EQU   ISTPST+36                                                01672000
PSTNSSQ  EQU   ISTPST+32                                                01673000
PSTPSSQ  EQU   ISTPST+28                                                01674000
PSTACBCT EQU   ISTPST+24                                                01675000
PSTTCBA  EQU   ISTPST+16                                                01676000
PSTRSV08 EQU   PSTFLGA+1                                                01677000
PSTPEND  EQU   PSTFLGA+1                                                01678000
PSTDMPC  EQU   PSTFLGA+1                                                01679000
PSTABEND EQU   PSTABINP                                                 01680000
PSTAUTH  EQU   PSTFLGA                                                  01681000
PSTSMCU  EQU   PSTFLGA                                                  01682000
PSTSMQR  EQU   PSTFLGA                                                  01683000
PSTIRBU2 EQU   PSTFLGA                                                  01684000
PSTIRBU1 EQU   PSTFLGA                                                  01685000
PSTUERN  EQU   PSTFLGA                                                  01686000
PSTSSRN  EQU   PSTFLGA                                                  01687000
PSTRQUEA EQU   PSTRQUE+1                                                01688000
PSTRSV07 EQU   PSTRQUE                                                  01689000
PSTRSV06 EQU   PSTRQUE                                                  01690000
PSTRSV05 EQU   PSTRQUE                                                  01691000
PSTRSV04 EQU   PSTRQUE                                                  01692000
PSTRSV03 EQU   PSTRQUE                                                  01693000
PSTRSV02 EQU   PSTRQUE                                                  01694000
PSTRSV01 EQU   PSTRQUE                                                  01695000
PSTRQFLG EQU   PSTRQUE                                                  01696000
PSTCHAIN EQU   ISTPST+4                                                 01697000
@NM00049 EQU   ISTPST+2                                                 01698000
PSTLNGTH EQU   ISTPST+1                                                 01699000
PSTTYPE  EQU   ISTPST                                                   01700000
DYPPAB   EQU   ISTDYPAB+16                                              01701000
DYPOCRPH EQU   DYPPACMD                                                 01702000
DYPTSKID EQU   ISTDYPAB+8                                               01703000
DYPPACTB EQU   DYPCHAIN                                                 01704000
DYPFLGS  EQU   ISTDYPAB+2                                               01705000
DYPLNGTH EQU   ISTDYPAB+1                                               01706000
DYPTYPE  EQU   ISTDYPAB                                                 01707000
PABNODQ  EQU   PABFLAGS                                                 01708000
PABINHBT EQU   PABFLAGS                                                 01709000
PABERLOK EQU   PABERRLK                                                 01710000
PABSSN   EQU   PABFLAGS                                                 01711000
PABDYNAM EQU   PABFLAGS                                                 01712000
PABXTND  EQU   PABFLAGS                                                 01713000
PABPRIOR EQU   PABFLAGS                                                 01714000
PABAPYP  EQU   PABFLAGS                                                 01715000
PABDVTA  EQU   ISTPAB+9                                                 01716000
PABOFFST EQU   ISTPAB+8                                                 01717000
PABCHNGP EQU   PABCHAIN+1                                               01718000
PABRSV02 EQU   PABCHAIN                                                 01719000
PABDELAY EQU   PABCHAIN                                                 01720000
PABQUED  EQU   PABRUNNG                                                 01721000
PABRESET EQU   PABCHAIN                                                 01722000
PABUNCON EQU   PABCHAIN                                                 01723000
PABCDP   EQU   PABCHAIN                                                 01724000
PABRESCH EQU   PABCHAIN                                                 01725000
PABCHNG  EQU   PABCHAIN                                                 01726000
PABWEQP  EQU   PABWEQA+1                                                01727000
PABRSV01 EQU   PABWEQA                                                  01728000
PABWEQG  EQU   PABWEQA                                                  01729000
LOKXCL   EQU   @NM00046                                                 01730000
LOKPRY   EQU   @NM00046                                                 01731000
@NM00047 EQU   @NM00046                                                 01732000
@NM00045 EQU   LOKCHNG                                                  01733000
LOKCT    EQU   ISTLOK                                                   01734000
RIARSV03 EQU   RIAFLGS+2                                                01735000
RIARSV02 EQU   RIAFLG2                                                  01736000
RIABR15  EQU   RIAFLG2                                                  01737000
RIARSPCC EQU   RIAFLG2                                                  01738000
RIARTPXT EQU   RIAFLG2                                                  01739000
RIACONT  EQU   RIAFLG2                                                  01740000
RIAFABN  EQU   RIAFLG2                                                  01741000
RIARSV01 EQU   RIAFLG1                                                  01742000
RIACTIVE EQU   RIAFLG1                                                  01743000
RIACTL   EQU   RIAFLG1                                                  01744000
RIAABR15 EQU   RIAABRGS+60                                              01745000
RIAABR14 EQU   RIAABRGS+56                                              01746000
RIAABR13 EQU   RIAABRGS+52                                              01747000
RIAABR12 EQU   RIAABRGS+48                                              01748000
RIAABR11 EQU   RIAABRGS+44                                              01749000
RIAABR10 EQU   RIAABRGS+40                                              01750000
RIAABR09 EQU   RIAABRGS+36                                              01751000
RIAABR08 EQU   RIAABRGS+32                                              01752000
RIAABR07 EQU   RIAABRGS+28                                              01753000
RIAABR06 EQU   RIAABRGS+24                                              01754000
RIAABR05 EQU   RIAABRGS+20                                              01755000
RIAABR04 EQU   RIAABRGS+16                                              01756000
RIAABR03 EQU   RIAABRGS+12                                              01757000
RIAABR02 EQU   RIAABRGS+8                                               01758000
RIAABR01 EQU   RIAABRGS+4                                               01759000
RIAABR00 EQU   RIAABRGS                                                 01760000
RIARSV04 EQU   ISTRIA+14                                                01761000
RIAABPSW EQU   ISTRIA+4                                                 01762000
RIAABCD  EQU   ISTRIA                                                   01763000
RPHUPSTA EQU   ISTRPH+104                                               01764000
RPHSAV16 EQU   RPHWORK+60                                               01765000
RPHSAV15 EQU   RPHWORK+56                                               01766000
RPHSAV14 EQU   RPHWORK+52                                               01767000
RPHSAV13 EQU   RPHWORK+48                                               01768000
RPHSAV12 EQU   RPHWORK+44                                               01769000
RPHSAV11 EQU   RPHWORK+40                                               01770000
RPHSAV10 EQU   RPHWORK+36                                               01771000
RPHSAVE9 EQU   RPHWORK+32                                               01772000
RPHSAVE8 EQU   RPHWORK+28                                               01773000
RPHSAVE7 EQU   RPHWORK+24                                               01774000
RPHSAVE6 EQU   RPHWORK+20                                               01775000
RPHSAVE5 EQU   RPHWORK+16                                               01776000
RPHSAVE4 EQU   RPHWORK+12                                               01777000
RPHSAVE3 EQU   RPHWORK+8                                                01778000
RPHSAVE2 EQU   RPHWORK+4                                                01779000
RPHSHALF EQU   RPHSAVE1+2                                               01780000
RPHSBIT8 EQU   RPHSBITS                                                 01781000
RPHSBIT7 EQU   RPHSBITS                                                 01782000
RPHSBIT6 EQU   RPHSBITS                                                 01783000
RPHSBIT5 EQU   RPHSBITS                                                 01784000
RPHSBIT4 EQU   RPHSBITS                                                 01785000
RPHSBIT3 EQU   RPHSBITS                                                 01786000
RPHSBIT2 EQU   RPHSBITS                                                 01787000
RPHSBIT1 EQU   RPHSBITS                                                 01788000
RPHSBYTE EQU   RPHSAVE1                                                 01789000
RPHPABQP EQU   RPHPABQA+1                                               01790000
RPHPABFG EQU   RPHPABQA                                                 01791000
RPHSRP34 EQU   RPHSRPRM+2                                               01792000
RPHSRP12 EQU   RPHSRPRM                                                 01793000
RPHWEGT  EQU   RPHCSPA                                                  01794000
RPHMAJCB EQU   ISTRPH+21                                                01795000
RPHPABOF EQU   ISTRPH+20                                                01796000
RPHRESUM EQU   RPHRESMA+1                                               01797000
@NM00044 EQU   RPHWPFLG                                                 01798000
RPHPURGE EQU   RPHWPFLG                                                 01799000
RPHPT    EQU   RPHWPFLG                                                 01800000
RPHWT    EQU   RPHWPFLG                                                 01801000
RPHRSKEY EQU   RPHWPFLG                                                 01802000
RPHDVTA  EQU   ISTRPH+12                                                01803000
RPHTIK   EQU   RPHTSKID+3                                               01804000
@NM00043 EQU   RPHTSKID                                                 01805000
RPHRPHAP EQU   RPHRPHA+1                                                01806000
@NM00042 EQU   RPHRPHA                                                  01807000
RPHGATE  EQU   RPHRPHA                                                  01808000
RPHABEND EQU   RPHFLGB                                                  01809000
RPHUWAIT EQU   RPHFLGB                                                  01810000
RPHRLCRA EQU   RPHFLGB                                                  01811000
@NM00041 EQU   RPHFLGB                                                  01812000
RPHPGCMP EQU   RPHFLGB                                                  01813000
RPHFBAPS EQU   RPHFLGB                                                  01814000
RPHBSSP  EQU   RPHFLGB                                                  01815000
RPHLOCK  EQU   RPHFLGB                                                  01816000
RPHFNFLG EQU   RPHFSTLC                                                 01817000
RPHMLTCP EQU   RPHFLAGS                                                 01818000
RPHSMCLR EQU   RPHFLAGS                                                 01819000
RPHSMTYP EQU   RPHFLAGS                                                 01820000
RPHSMQ   EQU   RPHFLAGS                                                 01821000
RPHAPTYP EQU   RPHFLAGS                                                 01822000
RPHSPGIN EQU   RPHFLAGS                                                 01823000
RPHOGIND EQU   RPHFLAGS                                                 01824000
RPHLNGTH EQU   RPHCNTL+1                                                01825000
RPHTYPE  EQU   RPHCNTL                                                  01826000
@NM00040 EQU   ISTAPCRR+144                                             01827000
APCSVRB  EQU   ISTAPCRR+140                                             01828000
@NM00039 EQU   ISTAPCRR+137                                             01829000
@NM00038 EQU   APC57FLG                                                 01830000
APCNREL  EQU   APC57FLG                                                 01831000
APCRECRA EQU   APC57FLG                                                 01832000
@NM00037 EQU   APC54FLG                                                 01833000
APCRLST  EQU   APC54FLG                                                 01834000
APCPR153 EQU   APC53FLG                                                 01835000
@NM00036 EQU   APC52FLG                                                 01836000
APCWKF   EQU   APC52FLG                                                 01837000
APCNWF   EQU   APC52FLG                                                 01838000
APCRDQ   EQU   APC52FLG                                                 01839000
APCQENQ  EQU   APC52FLG                                                 01840000
APCSMSR  EQU   APC52FLG                                                 01841000
APCCKRQ  EQU   APC52FLG                                                 01842000
@NM00035 EQU   APC31FLG                                                 01843000
APCSORT  EQU   APC31FLG                                                 01844000
APCRESCH EQU   APC31FLG                                                 01845000
APCTPXIT EQU   APC31FLG                                                 01846000
APCSWTWD EQU   ISTAPCRR+128                                             01847000
APCSAV2  EQU   ISTAPCRR+124                                             01848000
APCSAV1  EQU   ISTAPCRR+120                                             01849000
APCRETCD EQU   APCCOMF+2                                                01850000
@NM00034 EQU   APCCOMF1+1                                               01851000
APCTSO   EQU   APCCOMF1+1                                               01852000
APCAUTHE EQU   APCCOMF1+1                                               01853000
APCZLBER EQU   APCCOMF1                                                 01854000
APCEXIT  EQU   APCCOMF1                                                 01855000
APCRELR  EQU   APCCOMF1                                                 01856000
APCIRB2  EQU   APCCOMF1                                                 01857000
APCIRB1  EQU   APCCOMF1                                                 01858000
APCSMCR  EQU   APCCOMF1                                                 01859000
APCUETSK EQU   APCCOMF1                                                 01860000
APCSSTSK EQU   APCCOMF1                                                 01861000
APCESTAL EQU   APCSAVE                                                  01862000
APCQWFO  EQU   ISTAPCRR+36                                              01863000
APCPABSV EQU   ISTAPCRR+32                                              01864000
APCRTRNA EQU   APCRTRN+1                                                01865000
@NM00033 EQU   APCAUT                                                   01866000
APCAUTEX EQU   APCAUT                                                   01867000
APCTCBA  EQU   ISTAPCRR+24                                              01868000
@NM00032 EQU   APCRFLG+1                                                01869000
APC31R   EQU   APCRFLG                                                  01870000
APC58R   EQU   APCRFLG                                                  01871000
APC57R   EQU   APCRFLG                                                  01872000
APC54R   EQU   APCRFLG                                                  01873000
APC53R   EQU   APCRFLG                                                  01874000
APC52R   EQU   APCRFLG                                                  01875000
APC51R   EQU   APCRFLG                                                  01876000
@NM00031 EQU   APCATFLG+1                                               01877000
APC31E   EQU   APCATFLG                                                 01878000
APC58E   EQU   APCATFLG                                                 01879000
APC57E   EQU   APCATFLG                                                 01880000
APC54E   EQU   APCATFLG                                                 01881000
APC53E   EQU   APCATFLG                                                 01882000
APC52E   EQU   APCATFLG                                                 01883000
APC51E   EQU   APCATFLG                                                 01884000
APCHDRSV EQU   ISTAPCRR                                                 01885000
PFCRSV01 EQU   ISTPFCRR+13                                              01886000
PFCFTA   EQU   ISTPFCRR+12                                              01887000
CRRFRR   EQU   PFCFRRO                                                  01888000
CRRCHAIN EQU   PFCCRRO                                                  01889000
CRRLEN   EQU   PFCCRRLN                                                 01890000
PFCRSV10 EQU   PFCCRR+1                                                 01891000
CRRID    EQU   PFCCRRID                                                 01892000
@NM00030 EQU   SRBSECT+40                                               01893000
@NM00029 EQU   SRBSECT+38                                               01894000
SRBPRIOR EQU   SRBSECT+37                                               01895000
SRBPKF   EQU   SRBSECT+36                                               01896000
SRBSAVE  EQU   SRBSECT+32                                               01897000
SRBPARM  EQU   SRBSECT+28                                               01898000
SRBRMTR  EQU   SRBSECT+24                                               01899000
SRBEP    EQU   SRBSECT+20                                               01900000
SRBPTCB  EQU   SRBFLC+4                                                 01901000
SRBPASID EQU   SRBFLC+2                                                 01902000
SRBCPAFF EQU   SRBFLC                                                   01903000
SRBASCB  EQU   SRBSECT+8                                                01904000
SRBID    EQU   SRBSECT                                                  01905000
@NM00004 EQU   FRRSFLGS+1                                               01906000
@NM00003 EQU   FRRSFLG1                                                 01907000
FRRSRCUR EQU   FRRSFLG1                                                 01908000
FRRSENTS EQU   FRRS+84                                                  01909000
FRRSRTMW EQU   FRRS+16                                                  01910000
FRRSEMP  EQU   FRRSHEAD                                                 01911000
CVTLEVL  EQU   CVTRELNO+2                                               01912000
CVTNUMB  EQU   CVTRELNO                                                 01913000
CVTMDL   EQU   CVTFIX+250                                               01914000
@NM00002 EQU   CVTFIX+248                                               01915000
@NM00001 EQU   CVTFIX                                                   01916000
CVTRV482 EQU   CVTXTNT2+128                                             01917000
CVTRV481 EQU   CVTXTNT2+124                                             01918000
CVTRV480 EQU   CVTXTNT2+120                                             01919000
CVTRV479 EQU   CVTXTNT2+118                                             01920000
CVTRV478 EQU   CVTXTNT2+117                                             01921000
CVTRV477 EQU   CVTXTNT2+116                                             01922000
CVTRV476 EQU   CVTXTNT2+115                                             01923000
CVTRV475 EQU   CVTXTNT2+114                                             01924000
CVTRV474 EQU   CVTRV466                                                 01925000
CVTRV473 EQU   CVTRV466                                                 01926000
CVTRV472 EQU   CVTRV466                                                 01927000
CVTRV471 EQU   CVTRV466                                                 01928000
CVTRV470 EQU   CVTRV466                                                 01929000
CVTRV469 EQU   CVTRV466                                                 01930000
CVTRV468 EQU   CVTRV466                                                 01931000
CVTRV467 EQU   CVTRV466                                                 01932000
CVTRV465 EQU   CVTRV457                                                 01933000
CVTRV464 EQU   CVTRV457                                                 01934000
CVTRV463 EQU   CVTRV457                                                 01935000
CVTRV462 EQU   CVTRV457                                                 01936000
CVTRV461 EQU   CVTRV457                                                 01937000
CVTRV460 EQU   CVTRV457                                                 01938000
CVTRV459 EQU   CVTRV457                                                 01939000
CVTRV458 EQU   CVTRV457                                                 01940000
CVTRV456 EQU   CVTXTNT2+108                                             01941000
CVTRV455 EQU   CVTXTNT2+104                                             01942000
CVTRV454 EQU   CVTXTNT2+100                                             01943000
CVTRV453 EQU   CVTXTNT2+96                                              01944000
CVTRV452 EQU   CVTXTNT2+94                                              01945000
CVTRV451 EQU   CVTXTNT2+92                                              01946000
CVTRV450 EQU   CVTXTNT2+90                                              01947000
CVTRV449 EQU   CVTXTNT2+88                                              01948000
CVTRV448 EQU   CVTXTNT2+87                                              01949000
CVTRV447 EQU   CVTXTNT2+86                                              01950000
CVTRV446 EQU   CVTRV438                                                 01951000
CVTRV445 EQU   CVTRV438                                                 01952000
CVTRV444 EQU   CVTRV438                                                 01953000
CVTRV443 EQU   CVTRV438                                                 01954000
CVTRV442 EQU   CVTRV438                                                 01955000
CVTRV441 EQU   CVTRV438                                                 01956000
CVTRV440 EQU   CVTRV438                                                 01957000
CVTRV439 EQU   CVTRV438                                                 01958000
CVTRV437 EQU   CVTRV429                                                 01959000
CVTRV436 EQU   CVTRV429                                                 01960000
CVTRV435 EQU   CVTRV429                                                 01961000
CVTRV434 EQU   CVTRV429                                                 01962000
CVTRV433 EQU   CVTRV429                                                 01963000
CVTRV432 EQU   CVTRV429                                                 01964000
CVTRV431 EQU   CVTRV429                                                 01965000
CVTRV430 EQU   CVTRV429                                                 01966000
CVTRV428 EQU   CVTXTNT2+80                                              01967000
CVTRV427 EQU   CVTXTNT2+76                                              01968000
CVTRV426 EQU   CVTXTNT2+72                                              01969000
CVTRV425 EQU   CVTXTNT2+68                                              01970000
CVTATACT EQU   CVTATCVT                                                 01971000
CVTRV423 EQU   CVTXTNT2+62                                              01972000
CVTRV422 EQU   CVTXTNT2+60                                              01973000
CVTRV421 EQU   CVTXTNT2+58                                              01974000
CVTRV420 EQU   CVTXTNT2+56                                              01975000
CVTRV419 EQU   CVTXTNT2+55                                              01976000
CVTRV418 EQU   CVTXTNT2+54                                              01977000
CVTRV417 EQU   CVTRV409                                                 01978000
CVTRV416 EQU   CVTRV409                                                 01979000
CVTRV415 EQU   CVTRV409                                                 01980000
CVTRV414 EQU   CVTRV409                                                 01981000
CVTRV413 EQU   CVTRV409                                                 01982000
CVTRV412 EQU   CVTRV409                                                 01983000
CVTRV411 EQU   CVTRV409                                                 01984000
CVTRV410 EQU   CVTRV409                                                 01985000
CVTRV408 EQU   CVTRV400                                                 01986000
CVTRV407 EQU   CVTRV400                                                 01987000
CVTRV406 EQU   CVTRV400                                                 01988000
CVTRV405 EQU   CVTRV400                                                 01989000
CVTRV404 EQU   CVTRV400                                                 01990000
CVTRV403 EQU   CVTRV400                                                 01991000
CVTRV402 EQU   CVTRV400                                                 01992000
CVTRV401 EQU   CVTRV400                                                 01993000
CVTICB   EQU   CVTXTNT2+48                                              01994000
CVTSKTA  EQU   CVTXTNT2+44                                              01995000
CVTCCVT  EQU   CVTXTNT2+40                                              01996000
CVTRSV98 EQU   CVTXTNT2+36                                              01997000
CVTRSV97 EQU   CVTXTNT2+34                                              01998000
CVTRSV96 EQU   CVTXTNT2+32                                              01999000
CVTOLTEP EQU   CVTXTNT2+28                                              02000000
CVTQIDA  EQU   CVTQID+1                                                 02001000
CVTRSV95 EQU   CVTQID                                                   02002000
CVTRSV94 EQU   CVTXTNT2+20                                              02003000
CVTRSV93 EQU   CVTXTNT2+16                                              02004000
CVTRSV92 EQU   CVTXTNT2+12                                              02005000
CVTDEBVR EQU   CVTXTNT2+8                                               02006000
CVTRSV91 EQU   CVTXTNT2+6                                               02007000
CVTRSV9H EQU   CVTFLGBT                                                 02008000
CVTRSV9G EQU   CVTFLGBT                                                 02009000
CVTRSV9F EQU   CVTFLGBT                                                 02010000
CVTRSV9E EQU   CVTFLGBT                                                 02011000
CVTRSV9D EQU   CVTFLGBT                                                 02012000
CVTBAH   EQU   CVTFLGBT                                                 02013000
CVTVME   EQU   CVTFLGBT                                                 02014000
CVTNPE   EQU   CVTFLGBT                                                 02015000
CVTNUCLS EQU   CVTXTNT2+4                                               02016000
CVTDSSVA EQU   CVTDSSV+1                                                02017000
CVTRSV89 EQU   CVTDSSV                                                  02018000
CVTRSV88 EQU   CVTXTNT1+8                                               02019000
CVTRSV87 EQU   CVTXTNT1+4                                               02020000
CVTFACHN EQU   CVTXTNT1                                                 02021000
CVTRV488 EQU   CVTMAP+412                                               02022000
CVTRV487 EQU   CVTMAP+408                                               02023000
CVTRV486 EQU   CVTMAP+404                                               02024000
CVTRV485 EQU   CVTMAP+400                                               02025000
CVTACTAP EQU   CVTMAP+396                                               02026000
CVTAUTH  EQU   CVTMAP+392                                               02027000
CVTRV490 EQU   CVTMAP+388                                               02028000
CVTSU    EQU   CVTMAP+384                                               02029000
CVTVOLT1 EQU   CVTVOLM1+1                                               02030000
CVTVOLI1 EQU   CVTVOLF1                                                 02031000
CVTSTOA  EQU   CVTMAP+376                                               02032000
CVTRSV58 EQU   CVTMAP+374                                               02033000
CVTRSV57 EQU   CVTMAP+372                                               02034000
CVTDDCE  EQU   CVTMAP+368                                               02035000
CVTPNWFR EQU   CVTMAP+364                                               02036000
CVTSMF   EQU   CVTMAP+360                                               02037000
CVTSULK  EQU   CVTMAP+358                                               02038000
CVTSLKO  EQU   CVTSYSK                                                  02039000
CVTSLKP  EQU   CVTSYSK                                                  02040000
CVTSLKQ  EQU   CVTSYSK                                                  02041000
CVTSLKR  EQU   CVTSYSK                                                  02042000
CVTRSV56 EQU   CVTSYSK                                                  02043000
CVTRSV55 EQU   CVTSYSK                                                  02044000
CVTRSV54 EQU   CVTSYSK                                                  02045000
CVTRSV53 EQU   CVTSYSK                                                  02046000
CVTRSV52 EQU   CVTA1F1                                                  02047000
CVTRSV51 EQU   CVTA1F1                                                  02048000
CVTRSV50 EQU   CVTA1F1                                                  02049000
CVTRSV49 EQU   CVTA1F1                                                  02050000
CVTRSV48 EQU   CVTA1F1                                                  02051000
CVTRSV47 EQU   CVTA1F1                                                  02052000
CVTSRSW  EQU   CVTA1F1                                                  02053000
CVTPFSW  EQU   CVTA1F1                                                  02054000
CVTPCVT  EQU   CVTMAP+352                                               02055000
CVTRSV46 EQU   CVTMAP+344                                               02056000
CVTRSV45 EQU   CVTMAP+340                                               02057000
CVTRSV44 EQU   CVTMAP+338                                               02058000
CVTRSV43 EQU   CVTMAP+336                                               02059000
CVTHJESA EQU   CVTHJES+1                                                02060000
CVTRSV42 EQU   CVTHJES                                                  02061000
CVTEXT2A EQU   CVTEXT2+1                                                02062000
CVTRSV41 EQU   CVTEXT2                                                  02063000
CVTAPFA  EQU   CVTAPF+1                                                 02064000
CVTRSV40 EQU   CVTAPF                                                   02065000
CVTRV518 EQU   CVTINTLA                                                 02066000
CVTRV517 EQU   CVTERPV                                                  02067000
CVTEORM  EQU   CVTMAP+312                                               02068000
CVTMCHPR EQU   CVTMAP+308                                               02069000
CVTTZ    EQU   CVTMAP+304                                               02070000
CVTJEPS  EQU   CVTMAP+300                                               02071000
CVTJESCT EQU   CVTMAP+296                                               02072000
CVTMODE  EQU   CVTMAP+292                                               02073000
CVTPTRV  EQU   CVTMAP+288                                               02074000
CVTREAL  EQU   CVTMAP+284                                               02075000
CVTRSV39 EQU   CVTMAP+280                                               02076000
CVTRSV38 EQU   CVTMAP+276                                               02077000
CVTDMSRA EQU   CVTDMSR+1                                                02078000
CVTRV634 EQU   CVTDMSRF                                                 02079000
CVTRV633 EQU   CVTDMSRF                                                 02080000
CVTRV632 EQU   CVTDMSRF                                                 02081000
CVTRV631 EQU   CVTDMSRF                                                 02082000
CVTRV630 EQU   CVTDMSRF                                                 02083000
CVTRV629 EQU   CVTDMSRF                                                 02084000
CVTUDUMP EQU   CVTDMSRF                                                 02085000
CVTSDUMP EQU   CVTDMSRF                                                 02086000
CVTQMSGA EQU   CVTQMSG+1                                                02087000
CVTRSV36 EQU   CVTQMSG                                                  02088000
CVTAMFF  EQU   CVTMAP+264                                               02089000
CVTPURGA EQU   CVTPURG+1                                                02090000
CVTRSV35 EQU   CVTPURG                                                  02091000
CVTCBSP  EQU   CVTMAP+256                                               02092000
CVTATERA EQU   CVTATER+1                                                02093000
CVTSYST  EQU   CVTATER                                                  02094000
CVTVOLT2 EQU   CVTTAT                                                   02095000
CVTVOLI2 EQU   CVTVOLF2                                                 02096000
CVTAQAVB EQU   CVTAQAVT+1                                               02097000
CVTRSV34 EQU   CVTTCMFG                                                 02098000
CVTRSV33 EQU   CVTTCMFG                                                 02099000
CVTRSV32 EQU   CVTTCMFG                                                 02100000
CVTRSV31 EQU   CVTTCMFG                                                 02101000
CVTRSV30 EQU   CVTTCMFG                                                 02102000
CVTRSV29 EQU   CVTTCMFG                                                 02103000
CVTLDEV  EQU   CVTTCMFG                                                 02104000
CVTTCRDY EQU   CVTTCMFG                                                 02105000
CVTGTFA  EQU   CVTGTF+1                                                 02106000
CVTRSV27 EQU   CVTGTFST                                                 02107000
CVTRNIO  EQU   CVTGTFST                                                 02108000
CVTUSR   EQU   CVTGTFST                                                 02109000
CVTRV318 EQU   CVTFORM                                                  02110000
CVTRV317 EQU   CVTTMODE                                                 02111000
CVTRV316 EQU   CVTSTATE                                                 02112000
CVTRV315 EQU   CVTGTFS                                                  02113000
CVTGTFAV EQU   CVTGTFS                                                  02114000
CVT0SCR1 EQU   CVTMAP+232                                               02115000
CVTRV515 EQU   CVTMAP+228                                               02116000
CVTRMS   EQU   CVTMAP+224                                               02117000
CVTPATCH EQU   CVTMAP+220                                               02118000
CVTTSCE  EQU   CVTMAP+216                                               02119000
CVTLNKSC EQU   CVTMAP+214                                               02120000
CVTQABST EQU   CVTMAP+212                                               02121000
CVTMDLDS EQU   CVTMAP+208                                               02122000
CVTUSER  EQU   CVTMAP+204                                               02123000
CVTABEND EQU   CVTMAP+200                                               02124000
CVTSMCA  EQU   CVTMAP+196                                               02125000
CVTRSV18 EQU   CVTMAP+192                                               02126000
CVTQLPAQ EQU   CVTMAP+188                                               02127000
CVTQCDSR EQU   CVTMAP+184                                               02128000
CVTVS1B  EQU   CVTOPTB                                                  02129000
CVTVS1A  EQU   CVTOPTB                                                  02130000
CVTFP    EQU   CVTOPTB                                                  02131000
CVTAPTHR EQU   CVTOPTB                                                  02132000
CVTNLOG  EQU   CVTOPTB                                                  02133000
CVTTOD   EQU   CVTOPTB                                                  02134000
CVTCTIMS EQU   CVTOPTB                                                  02135000
CVTPROT  EQU   CVTOPTB                                                  02136000
CVTXPFP  EQU   CVTOPTA                                                  02137000
CVTASCII EQU   CVTOPTA                                                  02138000
CVTRSV13 EQU   CVTOPTA                                                  02139000
CVTRSV12 EQU   CVTOPTA                                                  02140000
CVTNIP   EQU   CVTOPTA                                                  02141000
CVTDDR   EQU   CVTOPTA                                                  02142000
CVTAPR   EQU   CVTOPTA                                                  02143000
CVTCCH   EQU   CVTOPTA                                                  02144000
CVTSNCTR EQU   CVTMAP+180                                               02145000
CVTQMWR  EQU   CVTMAP+176                                               02146000
CVTQOCR  EQU   CVTMAP+172                                               02147000
CVT1EF00 EQU   CVTMAP+168                                               02148000
CVTMZ00  EQU   CVTMAP+164                                               02149000
CVTHEAD  EQU   CVTMAP+160                                               02150000
CVTRSV11 EQU   CVTMAP+156                                               02151000
CVT0PT01 EQU   CVTMAP+152                                               02152000
CVTMSER  EQU   CVTMAP+148                                               02153000
CVTRV516 EQU   CVTIERLC                                                 02154000
CVTILCH  EQU   CVTMAP+140                                               02155000
CVT0DS   EQU   CVTMAP+136                                               02156000
CVTFBOSV EQU   CVTMAP+132                                               02157000
CVTNUCB  EQU   CVTMAP+128                                               02158000
CVTIXAVL EQU   CVTMAP+124                                               02159000
CVTIOQET EQU   CVTMAP+120                                               02160000
CVTDCBA  EQU   CVTMAP+117                                               02161000
CVTMVS2  EQU   CVTDCB                                                   02162000
CVT6DAT  EQU   CVTDCB                                                   02163000
CVT4MPS  EQU   CVTDCB                                                   02164000
CVTRSV09 EQU   CVTDCB                                                   02165000
CVT4MS1  EQU   CVTDCB                                                   02166000
CVT2SPS  EQU   CVTDCB                                                   02167000
CVT1SSS  EQU   CVTDCB                                                   02168000
CVTRSV08 EQU   CVTDCB                                                   02169000
CVTSTB   EQU   CVTMAP+112                                               02170000
CVTQTD00 EQU   CVTMAP+108                                               02171000
CVTQTE00 EQU   CVTMAP+104                                               02172000
CVTCUCB  EQU   CVTMAP+100                                               02173000
CVTSJQ   EQU   CVTMAP+96                                                02174000
CVTPBLDL EQU   CVTMAP+92                                                02175000
CVTTPC   EQU   CVTMAP+88                                                02176000
CVTSVDCB EQU   CVTMAP+84                                                02177000
CVTBRET  EQU   CVTMAP+82                                                02178000
CVTEXIT  EQU   CVTMAP+80                                                02179000
CVT0FN00 EQU   CVTMAP+76                                                02180000
CVTDARA  EQU   CVTDAR+1                                                 02181000
CVTRSV07 EQU   CVTFLGS1                                                 02182000
CVTRSV06 EQU   CVTFLGS1                                                 02183000
CVTRSV05 EQU   CVTFLGS1                                                 02184000
CVTRSV04 EQU   CVTFLGS1                                                 02185000
CVTRSV03 EQU   CVTFLGS1                                                 02186000
CVTRSV02 EQU   CVTFLGS1                                                 02187000
CVTRSV01 EQU   CVTFLGS1                                                 02188000
CVTDMPLK EQU   CVTFLGS1                                                 02189000
CVTXITP  EQU   CVTMAP+68                                                02190000
CVTZDTAB EQU   CVTMAP+64                                                02191000
CVTMSLT  EQU   CVTMAP+60                                                02192000
CVTDATE  EQU   CVTMAP+56                                                02193000
CVTBTERM EQU   CVTMAP+52                                                02194000
CVTSYSAD EQU   CVTMAP+48                                                02195000
CVTXTLER EQU   CVTMAP+44                                                02196000
CVTILK2  EQU   CVTMAP+40                                                02197000
CVTILK1  EQU   CVTMAP+36                                                02198000
CVTPRLTV EQU   CVTMAP+32                                                02199000
CVTPCNVT EQU   CVTMAP+28                                                02200000
CVT0VL00 EQU   CVTMAP+24                                                02201000
CVTXAPG  EQU   CVTMAP+20                                                02202000
CVTBUF   EQU   CVTMAP+16                                                02203000
CVTJOB   EQU   CVTMAP+12                                                02204000
CVTLINK  EQU   CVTMAP+8                                                 02205000
CVT0EF00 EQU   CVTMAP+4                                                 02206000
CVTTCBP  EQU   CVTMAP                                                   02207000
CVT      EQU   CVTMAP                                                   02208000
@NM00028 EQU   PSA+3668                                                 02209000
PSASTAK  EQU   PSA+3072                                                 02210000
@NM00027 EQU   PSA+1048                                                 02211000
PSAUSEND EQU   PSA+1048                                                 02212000
PSARV062 EQU   PSA+1044                                                 02213000
PSACDAL  EQU   PSA+1040                                                 02214000
PSAWTCOD EQU   PSA+1036                                                 02215000
PSAATCVT EQU   PSA+1032                                                 02216000
PSAPCPSW EQU   PSA+1024                                                 02217000
PSAPIR2  EQU   PSA+1020                                                 02218000
PSARV059 EQU   PSA+1018                                                 02219000
PSASVC13 EQU   PSA+1016                                                 02220000
PSASFACC EQU   PSA+1008                                                 02221000
PSASTOP  EQU   PSA+992                                                  02222000
PSASTART EQU   PSA+976                                                  02223000
PSARSPSW EQU   PSA+968                                                  02224000
PSASRPSW EQU   PSA+960                                                  02225000
PSARV045 EQU   PSA+892                                                  02226000
PSARV044 EQU   PSA+888                                                  02227000
PSARV043 EQU   PSA+884                                                  02228000
PSARV042 EQU   PSA+880                                                  02229000
PSARV041 EQU   PSA+876                                                  02230000
PSARV040 EQU   PSA+872                                                  02231000
PSARV025 EQU   PSA+868                                                  02232000
PSADSSED EQU   PSA+868                                                  02233000
PSADSSPR EQU   PSA+864                                                  02234000
PSADSSFW EQU   PSA+860                                                  02235000
PSADSS14 EQU   PSA+856                                                  02236000
PSADSSPP EQU   PSA+848                                                  02237000
PSADSSRP EQU   PSA+840                                                  02238000
PSADSS05 EQU   PSADSSF4                                                 02239000
PSADSS10 EQU   PSADSSF4                                                 02240000
PSADSSVE EQU   PSADSSF4                                                 02241000
PSADSSDE EQU   PSADSSF4                                                 02242000
PSADSSC0 EQU   PSADSSF4                                                 02243000
PSADSSIE EQU   PSADSSF4                                                 02244000
PSADSS12 EQU   PSADSSF4                                                 02245000
PSADSSRC EQU   PSADSSF4                                                 02246000
PSARV057 EQU   PSADSSF3                                                 02247000
PSARV056 EQU   PSADSSF3                                                 02248000
PSARV055 EQU   PSADSSF3                                                 02249000
PSADSSMC EQU   PSADSSF3                                                 02250000
PSADSSRW EQU   PSADSSF3                                                 02251000
PSADSSNM EQU   PSADSSF3                                                 02252000
PSADSSES EQU   PSADSSF3                                                 02253000
PSADSSGP EQU   PSADSSF3                                                 02254000
PSADSSF2 EQU   PSADSSFL+1                                               02255000
PSADSSPI EQU   PSADSSF1                                                 02256000
PSADSSOI EQU   PSADSSF1                                                 02257000
PSADSSSP EQU   PSADSSF1                                                 02258000
PSADSSTP EQU   PSADSSF1                                                 02259000
PSADSSDW EQU   PSADSSF1                                                 02260000
PSADSSDD EQU   PSADSSF1                                                 02261000
PSADSSDM EQU   PSADSSF1                                                 02262000
PSADSSMV EQU   PSADSSF1                                                 02263000
PSADSSTS EQU   PSA+816                                                  02264000
PSADSSWK EQU   PSA+812                                                  02265000
PSADSSR3 EQU   PSA+808                                                  02266000
PSADSSR2 EQU   PSA+804                                                  02267000
PSADSSRS EQU   PSA+800                                                  02268000
PSASTOR  EQU   PSA+796                                                  02269000
PSACPUSA EQU   PSA+794                                                  02270000
PSAVSTAP EQU   PSA+792                                                  02271000
PSAWKVAP EQU   PSA+788                                                  02272000
PSAWKRAP EQU   PSA+784                                                  02273000
PSAMCHIC EQU   PSA+783                                                  02274000
PSARV061 EQU   PSA+782                                                  02275000
PSASYMSK EQU   PSA+781                                                  02276000
PSAMCHFL EQU   PSA+780                                                  02277000
PSACR0   EQU   PSA+776                                                  02278000
PSAPSWSV EQU   PSA+768                                                  02279000
PSALITA  EQU   PSA+764                                                  02280000
PSACLHS  EQU   PSAHLHI                                                  02281000
PSALKR15 EQU   PSALKSA+60                                               02282000
PSALKR14 EQU   PSALKSA+56                                               02283000
PSALKR13 EQU   PSALKSA+52                                               02284000
PSALKR12 EQU   PSALKSA+48                                               02285000
PSALKR11 EQU   PSALKSA+44                                               02286000
PSALKR10 EQU   PSALKSA+40                                               02287000
PSALKR9  EQU   PSALKSA+36                                               02288000
PSALKR8  EQU   PSALKSA+32                                               02289000
PSALKR7  EQU   PSALKSA+28                                               02290000
PSALKR6  EQU   PSALKSA+24                                               02291000
PSALKR5  EQU   PSALKSA+20                                               02292000
PSALKR4  EQU   PSALKSA+16                                               02293000
PSALKR3  EQU   PSALKSA+12                                               02294000
PSALKR2  EQU   PSALKSA+8                                                02295000
PSALKR1  EQU   PSALKSA+4                                                02296000
PSALKR0  EQU   PSALKSA                                                  02297000
PSARV023 EQU   PSACLHT+52                                               02298000
PSALOCAL EQU   PSACLHT+48                                               02299000
PSACMSL  EQU   PSACLHT+44                                               02300000
PSAOPTL  EQU   PSACLHT+40                                               02301000
PSATPACL EQU   PSACLHT+36                                               02302000
PSATPDNL EQU   PSACLHT+32                                               02303000
PSATPNCL EQU   PSACLHT+28                                               02304000
PSAIOSLL EQU   PSACLHT+24                                               02305000
PSAIOSUL EQU   PSACLHT+20                                               02306000
PSAIOSCL EQU   PSACLHT+16                                               02307000
PSAIOSSL EQU   PSACLHT+12                                               02308000
PSASALCL EQU   PSACLHT+8                                                02309000
PSAASML  EQU   PSACLHT+4                                                02310000
PSADISPL EQU   PSACLHT                                                  02311000
PSASRSA  EQU   PSA+636                                                  02312000
PSARV050 EQU   PSA+634                                                  02313000
PSADSSGO EQU   PSA+633                                                  02314000
PSARECUR EQU   PSA+632                                                  02315000
PSAHLHIS EQU   PSA+628                                                  02316000
PSAIPCSA EQU   PSA+624                                                  02317000
@NM00026 EQU   PSA+621                                                  02318000
PSAIPCDM EQU   PSA+620                                                  02319000
PSAIPCD  EQU   PSA+616                                                  02320000
@NM00025 EQU   PSA+613                                                  02321000
PSAIPCRM EQU   PSA+612                                                  02322000
PSAIPCR  EQU   PSA+608                                                  02323000
PSAMCHEX EQU   PSA+600                                                  02324000
PSAMPSW  EQU   PSA+592                                                  02325000
PSAEXPS2 EQU   PSA+584                                                  02326000
PSAEXPS1 EQU   PSA+576                                                  02327000
PSAPIREG EQU   PSA+572                                                  02328000
PSARSREG EQU   PSA+568                                                  02329000
PSAGPREG EQU   PSA+556                                                  02330000
PSARV022 EQU   PSASUP4                                                  02331000
PSARV021 EQU   PSASUP4                                                  02332000
PSARV020 EQU   PSASUP4                                                  02333000
PSARV019 EQU   PSASUP4                                                  02334000
PSARV018 EQU   PSASUP4                                                  02335000
PSARV017 EQU   PSASUP4                                                  02336000
PSARV016 EQU   PSASUP4                                                  02337000
PSARV015 EQU   PSASUP4                                                  02338000
PSARV014 EQU   PSASUP3                                                  02339000
PSARV013 EQU   PSASUP3                                                  02340000
PSARV012 EQU   PSASUP3                                                  02341000
PSARV011 EQU   PSASUP3                                                  02342000
PSASPR   EQU   PSASUP3                                                  02343000
PSAPSREG EQU   PSASUP3                                                  02344000
PSAPI2   EQU   PSASUP3                                                  02345000
PSAIOSUP EQU   PSASUP3                                                  02346000
PSALCR   EQU   PSASUP2                                                  02347000
PSARTM   EQU   PSASUP2                                                  02348000
PSAACR   EQU   PSASUP2                                                  02349000
PSAIPCE2 EQU   PSASUP2                                                  02350000
PSAIPCES EQU   PSASUP2                                                  02351000
PSAIPCEC EQU   PSASUP2                                                  02352000
PSAGTF   EQU   PSASUP2                                                  02353000
PSAIPCRI EQU   PSASUP2                                                  02354000
PSARV063 EQU   PSASUP1                                                  02355000
PSATCTL  EQU   PSASUP1                                                  02356000
PSADISP  EQU   PSASUP1                                                  02357000
PSALOCK  EQU   PSASUP1                                                  02358000
PSAPI    EQU   PSASUP1                                                  02359000
PSAEXT   EQU   PSASUP1                                                  02360000
PSASVC   EQU   PSASUP1                                                  02361000
PSAIO    EQU   PSASUP1                                                  02362000
PSAAOLD  EQU   PSA+548                                                  02363000
PSAANEW  EQU   PSA+544                                                  02364000
PSATOLD  EQU   PSA+540                                                  02365000
PSATNEW  EQU   PSA+536                                                  02366000
PSALCCAR EQU   PSA+532                                                  02367000
PSALCCAV EQU   PSA+528                                                  02368000
PSAPCCAR EQU   PSA+524                                                  02369000
PSAPCCAV EQU   PSA+520                                                  02370000
PSACPULA EQU   PSA+518                                                  02371000
PSACPUPA EQU   PSA+516                                                  02372000
PSAPSA   EQU   PSA+512                                                  02373000
FLCHDEND EQU   PSA+512                                                  02374000
FLCCRSAV EQU   FLCMCLA+280                                              02375000
FLCGRSAV EQU   FLCMCLA+216                                              02376000
FLCFPSAV EQU   FLCMCLA+184                                              02377000
FLCFLA   EQU   FLCMCLA+88                                               02378000
FLCRGNCD EQU   FLCMCLA+84                                               02379000
FLCFSAA  EQU   FLCFSA+1                                                 02380000
@NM00024 EQU   FLCFSA                                                   02381000
@NM00023 EQU   FLCMCLA+72                                               02382000
FLCMCIC  EQU   FLCMCLA+64                                               02383000
@NM00022 EQU   FLCMCLA+20                                               02384000
FLCIOAA  EQU   FLCIOA+1                                                 02385000
@NM00021 EQU   FLCIOA                                                   02386000
@NM00020 EQU   FLCMCLA+15                                               02387000
@NM00019 EQU   FLCMCLA+14                                               02388000
@NM00018 EQU   FLCMCLA+12                                               02389000
FLCLCL   EQU   FLCMCLA+8                                                02390000
FLCIOELA EQU   FLCIOEL+1                                                02391000
@NM00017 EQU   FLCIOEL                                                  02392000
FLCCHNID EQU   FLCMCLA                                                  02393000
@NM00016 EQU   PSA+160                                                  02394000
FLCMTRCD EQU   PSA+157                                                  02395000
@NM00015 EQU   PSA+156                                                  02396000
FLCPERA  EQU   FLCPER+1                                                 02397000
@NM00014 EQU   FLCPER                                                   02398000
@NM00013 EQU   PSA+151                                                  02399000
FLCPERCD EQU   PSA+150                                                  02400000
FLCMCNUM EQU   PSA+149                                                  02401000
@NM00012 EQU   PSA+148                                                  02402000
FLCTEAA  EQU   FLCTEA+1                                                 02403000
@NM00011 EQU   FLCTEA                                                   02404000
PSAPIPC  EQU   PSAPICOD                                                 02405000
PSAPIMC  EQU   PSAPICOD                                                 02406000
PSAPIPER EQU   PSAPICOD                                                 02407000
PSARV049 EQU   FLCPICOD                                                 02408000
FLCPILCB EQU   FLCPIILC                                                 02409000
@NM00010 EQU   FLCPIILC                                                 02410000
@NM00009 EQU   PSAEPPSW                                                 02411000
FLCSVCN  EQU   PSAESPSW+2                                               02412000
FLCSILCB EQU   FLCSVILC                                                 02413000
@NM00008 EQU   FLCSVILC                                                 02414000
@NM00007 EQU   PSAESPSW                                                 02415000
FLCEICOD EQU   PSAEEPSW+2                                               02416000
PSASPAD  EQU   PSAEEPSW                                                 02417000
@NM00006 EQU   PSA+128                                                  02418000
FLCINPSW EQU   PSA+120                                                  02419000
FLCMNPSW EQU   PSA+112                                                  02420000
FLCPNPSW EQU   PSA+104                                                  02421000
FLCSNPSW EQU   PSA+96                                                   02422000
FLCENPSW EQU   PSA+88                                                   02423000
FLCTRACE EQU   PSA+84                                                   02424000
FLCTIMER EQU   PSA+80                                                   02425000
FLCCVT2  EQU   PSA+76                                                   02426000
FLCCAW   EQU   PSA+72                                                   02427000
FLCCSW   EQU   PSA+64                                                   02428000
FLCIOPSW EQU   PSA+56                                                   02429000
FLCMOPSW EQU   PSA+48                                                   02430000
FLCPOPSW EQU   PSA+40                                                   02431000
FLCSOPSW EQU   PSA+32                                                   02432000
FLCEOPSW EQU   PSA+24                                                   02433000
@NM00005 EQU   FLCICCW2+4                                               02434000
FLCCVT   EQU   FLCICCW2                                                 02435000
FLCICCW1 EQU   FLCROPSW                                                 02436000
FLCIPPSW EQU   FLCRNPSW                                                 02437000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02438000
@ENDDATA EQU   *                                                        02439000
         END   ISTAPC56,(C'PLS1136',0702,78336)                         02440000
