         TITLE 'READ WRITE EXIT - ISTCC016'                             00001000
ISTCC016 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTCC016  78.336'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  DS    0H                                                  0002 00009000
         PRINT OFF                                                      00010000
         PRINT ON                                                       00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
         PRINT OFF                                                      00014000
         PRINT ON                                                       00015000
         PRINT OFF                                                      00016000
         PRINT ON                                                       00017000
*                                    /* SET UP BASE AND SCR @ZD10878*/  00018000
         LR    R12,R15             GET THE ENTRY ADDRESS                00019000
         USING ISTCC016,R12                                             00020000
         LA    R9,C16CBUF1   POINT TO EXIT WORK AREA           @ZD10878 00021000
         USING @DATD,R9      SET UP ADDRESSABILITY FOR SCRTCH  @ZD10878 00022000
*   RPLPTR=R1;                      /* SAVE POINTER TO RPL           */ 00023000
         LR    RPLPTR,R1                                           0155 00024000
*   WAPTR=RPLUSFLD;                                                0156 00025000
         L     WAPTR,RPLUSFLD(,RPLPTR)                             0156 00026000
*   R13=ADDR($EXITSAV);             /* SET UP PTR TO MY SAVEAREA     */ 00027000
         L     R13,RCAPTR(,WAPTR)                                  0157 00028000
         LA    R13,$EXITSAV(,R13)                                  0157 00029000
*   C16EXSAV=R14;                   /* SAVE R14 FOR RET TO VTAM      */ 00030000
*                                                                  0158 00031000
         ST    R14,C16EXSAV                                        0158 00032000
*   /*****************************************************************/ 00033000
*   /*                                                               */ 00034000
*   /* CHECK THE RPL SO IT IS NOT ACTIVE                             */ 00035000
*   /*                                                               */ 00036000
*   /*****************************************************************/ 00037000
*                                                                  0159 00038000
*   GEN(CHECK RPL=(RPLPTR));        /* CLEAR UP RPL BEFORE PROCESSING*/ 00039000
         CHECK RPL=(RPLPTR)                                             00040000
*   INDX=AP;                        /* FEEDBACK FOR AP               */ 00041000
         LA    INDX,2                                              0160 00042000
*   IF RPLPTR=ADDR($TLTRPL1) THEN   /* SET UP INDEX INTO TABLE     0161 00043000
*                                                            @D32JPGH*/ 00044000
         LA    @00,$TLTRPL1(,WAPTR)                                0161 00045000
         CR    RPLPTR,@00                                          0161 00046000
         BNE   @RF00161                                            0161 00047000
*     INDX=CT;                      /* FEEDBACK FOR CT               */ 00048000
*                                                                  0162 00049000
         LA    INDX,1                                              0162 00050000
*   /*****************************************************************/ 00051000
*   /*                                                               */ 00052000
*   /* CHK FOR TEMP ERRORS RETRY IF POSSIBLE                         */ 00053000
*   /*                                                               */ 00054000
*   /*****************************************************************/ 00055000
*                                                                  0163 00056000
*   IF(RPLRTNCD='08'X&RPLFDB2='00'X)|(RPLRTNCD='0C'X&(RPLFDB2='03'X|    00057000
*       RPLFDB2='05'X)) THEN                                       0163 00058000
@RF00161 CLI   RPLRTNCD(RPLPTR),8                                  0163 00059000
         BNE   @GL00001                                            0163 00060000
         CLI   RPLFDB2(RPLPTR),0                                   0163 00061000
         BE    @RT00163                                            0163 00062000
@GL00001 CLI   RPLRTNCD(RPLPTR),12                                 0163 00063000
         BNE   @RF00163                                            0163 00064000
         CLI   RPLFDB2(RPLPTR),3                                   0163 00065000
         BE    @RT00163                                            0163 00066000
         CLI   RPLFDB2(RPLPTR),5                                   0163 00067000
         BE    @RT00163                                            0163 00068000
*     GOTO C16C0225;                                               0164 00069000
*   IF RPLRTNCD^='00'X              /* IF THERE WAS AN ERROR         */ 00070000
*     THEN                                                         0165 00071000
@RF00163 CLI   RPLRTNCD(RPLPTR),0                                  0165 00072000
         BE    @RF00165                                            0165 00073000
*     DO;                                                          0166 00074000
*       IF RPLRTNCD='0C'X&(RPLFDB2>='0A'X&RPLFDB2<='0C'X)/* CHECK TO    00075000
*                                      SEE IF WE SHOULD STOP @D32JPGH*/ 00076000
*         THEN                                                     0167 00077000
         CLI   RPLRTNCD(RPLPTR),12                                 0167 00078000
         BNE   @RF00167                                            0167 00079000
         CLI   RPLFDB2(RPLPTR),10                                  0167 00080000
         BL    @RF00167                                            0167 00081000
         CLI   RPLFDB2(RPLPTR),12                                  0167 00082000
         BH    @RF00167                                            0167 00083000
*         DO;                       /* NOT ERROR, BUT GET OUT NOW    */ 00084000
*           CALL C16C0910;          /* FREE CURRENT ELEMENT          */ 00085000
         BAL   @14,C16C0910                                        0169 00086000
*           GOTO C16C0251;          /* EXIT FROM THIS MODULE         */ 00087000
         B     C16C0251                                            0170 00088000
*         END;                      /* END OF NOT ERROR,BUT STOP CODE*/ 00089000
*       IF RPLRTNCD<=4&$DEVLU(INDX)=ON THEN/* IF LU STATUS PASSED  0172 00090000
*                                      BACK                  @DM00895*/ 00091000
@RF00167 CLI   RPLRTNCD(RPLPTR),4                                  0172 00092000
         BH    @RF00172                                            0172 00093000
         LR    @11,INDX                                            0172 00094000
         MH    @11,@CH00337                                        0172 00095000
         ALR   @11,WAPTR                                           0172 00096000
         TM    $DEVLU-68(@11),B'00001000'                          0172 00097000
         BO    @RT00172                                            0172 00098000
*         GO TO C16C0253;           /* PROCESS THE FEEDBACK          */ 00099000
*       IF RPLRTNCD='0C'X&          /* WAS IT AN RFT RECEIVED        */ 00100000
*           RPLFDB2='02'X&INDX=CT   /* FROM THE CT                   */ 00101000
*         THEN                                                     0174 00102000
@RF00172 CLI   RPLRTNCD(RPLPTR),12                                 0174 00103000
         BNE   @RF00174                                            0174 00104000
         CLI   RPLFDB2(RPLPTR),2                                   0174 00105000
         BNE   @RF00174                                            0174 00106000
         C     INDX,@CF00072                                       0174 00107000
         BNE   @RF00174                                            0174 00108000
*         DO;                       /* IF YES DO THE FOLLOWING       */ 00109000
*           $RETREG=0;                                             0176 00110000
         SLR   @11,@11                                             0176 00111000
         ST    @11,$RETREG(,WAPTR)                                 0176 00112000
*           IF RPLAARLN=0 THEN                                     0177 00113000
         C     @11,RPLAARLN(,RPLPTR)                               0177 00114000
         BE    @RT00177                                            0177 00115000
*             GOTO C16C0100;                                       0178 00116000
*           ELSE                                                   0179 00117000
*             GOTO C16C0225;        /* GO & RETRY ORIG REQ           */ 00118000
         B     C16C0225                                            0179 00119000
*         END;                                                     0180 00120000
*       IF RPLRTNCD='04'X&          /* WAS AN ATTENTION RECEIVED     */ 00121000
*           RPLFDB2='01'X&INDX=CT   /* FROM CT                       */ 00122000
*         THEN                      /* THEN DO THE FOLLOWING         */ 00123000
@RF00174 CLI   RPLRTNCD(RPLPTR),4                                  0181 00124000
         BNE   @RF00181                                            0181 00125000
         CLI   RPLFDB2(RPLPTR),1                                   0181 00126000
         BNE   @RF00181                                            0181 00127000
         C     INDX,@CF00072                                       0181 00128000
         BNE   @RF00181                                            0181 00129000
*         DO;                                                      0182 00130000
*           $CIREQ=ON;              /* SET C. I. REQ ON              */ 00131000
         OI    $CIREQ(WAPTR),B'00000001'                           0183 00132000
*           $RETREG=0;              /* SET ZERO RETURN CODE          */ 00133000
         SLR   @00,@00                                             0184 00134000
         ST    @00,$RETREG(,WAPTR)                                 0184 00135000
*           GOTO C16C0100;                                         0185 00136000
         B     C16C0100                                            0185 00137000
*         END;                                                     0186 00138000
*       $RETREG=8;                  /* SET ERROR RC = 8              */ 00139000
@RF00181 MVC   $RETREG(4,WAPTR),@CF00054                           0187 00140000
*C16C0075:                                                         0188 00141000
*       CALL C16C0920;              /* SET ERROR STATUS              */ 00142000
C16C0075 BAL   @14,C16C0920                                        0188 00143000
*       GO TO C16C0251;             /* EXIT FROM THE MODULE          */ 00144000
         B     C16C0251                                            0189 00145000
*     END;                                                         0190 00146000
*   ELSE                                                           0191 00147000
*     $RETREG=0;                    /* SET GOOD RC OF 00             */ 00148000
@RF00165 SLR   @00,@00                                             0191 00149000
         ST    @00,$RETREG(,WAPTR)                                 0191 00150000
*C16C0100:                                                         0192 00151000
*   ;                                                              0192 00152000
C16C0100 DS    0H                                                  0193 00153000
*   IF $DEVLU(INDX)=ON              /* IF DEVICE IS AN LU            */ 00154000
*     THEN                                                         0193 00155000
         LR    @11,INDX                                            0193 00156000
         MH    @11,@CH00337                                        0193 00157000
         ST    @11,@TF00001                                        0193 00158000
         ALR   @11,WAPTR                                           0193 00159000
         TM    $DEVLU-68(@11),B'00001000'                          0193 00160000
         BO    @RT00193                                            0193 00161000
*     GOTO C16C0253;                /* THIS CODE HANDLES LU        0194 00162000
*                                      INFORMATION                   */ 00163000
*   IF INCT^=0                      /* ONE WAY MSG?                  */ 00164000
*     THEN                                                         0195 00165000
         L     @11,@TF00001                                        0195 00166000
         L     @11,$CURELEM-68(@11,WAPTR)                          0195 00167000
         CLI   INCT(@11),0                                         0195 00168000
         BE    @RF00195                                            0195 00169000
*     DO;                                                          0196 00170000
*       IF RPLREQ='11'X|(RPLREQ='1D'X&RPLREOT=OFF)/* IF WRITE OR READ   00171000
*                                      FOR EOT                       */ 00172000
*         THEN                                                     0197 00173000
         CLI   RPLREQ(RPLPTR),17                                   0197 00174000
         BE    @RT00197                                            0197 00175000
         CLI   RPLREQ(RPLPTR),29                                   0197 00176000
         BNE   @RF00197                                            0197 00177000
         TM    RPLREOT(RPLPTR),B'00001000'                         0197 00178000
         BNZ   @RF00197                                            0197 00179000
@RT00197 DS    0H                                                  0198 00180000
*         DO;                       /* READING DATA FROM CT          */ 00181000
*           IF $DVINCT(1)^=0 THEN                                  0199 00182000
         CLI   $DVINCT(WAPTR),0                                    0199 00183000
         BE    @RF00199                                            0199 00184000
*             DO;                                                  0200 00185000
*               RPLBUFL=$DVINCT(1); /* SET READ COUNT                */ 00186000
         SLR   @00,@00                                             0201 00187000
         IC    @00,$DVINCT(,WAPTR)                                 0201 00188000
         ST    @00,RPLBUFL(,RPLPTR)                                0201 00189000
*               RPLAREA=ADDR($TRMINPT);/* POINT TO BUFFER            */ 00190000
         LA    @00,$TRMINPT(,WAPTR)                                0202 00191000
         ST    @00,RPLAREA(,RPLPTR)                                0202 00192000
*             END;                                                 0203 00193000
*           ELSE                                                   0204 00194000
*             DO;                                                  0204 00195000
         B     @RC00199                                            0204 00196000
@RF00199 DS    0H                                                  0205 00197000
*               RPLBUFL=LENGTH(SCRATCH);                           0205 00198000
         MVC   RPLBUFL(4,RPLPTR),@CF00072                          0205 00199000
*               RPLAREA=ADDR(SCRATCH);                             0206 00200000
         LA    @00,SCRATCH                                         0206 00201000
         ST    @00,RPLAREA(,RPLPTR)                                0206 00202000
*             END;                                                 0207 00203000
*           GEN REFS(RPLPTR,ARG,ISTCC016);                         0208 00204000
@RC00199 DS    0H                                                  0208 00205000
*                                 /* READ DATA */                       00206000
 READ RPL=(RPLPTR),EXIT=ISTCC016,OPTCD=(ASY,TRUNC)                      00207000
*           IF R15^=0 THEN          /* IF ERROR, GET OUT FAST        */ 00208000
         LTR   R15,R15                                             0209 00209000
         BNZ   @RT00209                                            0209 00210000
*             GO TO C16C0075;       /* EXIT THE MODULE               */ 00211000
*           $DVINCT(1)=0;           /* READ NO MORE DATA             */ 00212000
         MVI   $DVINCT(WAPTR),X'00'                                0211 00213000
*           GOTO C16C0251;          /* EXIT                          */ 00214000
         B     C16C0251                                            0212 00215000
*         END;                      /* END OF READ FOR DATA          */ 00216000
*       CALL C16C0900;              /* PUT DATA IN CALLERS BUFFER    */ 00217000
@RF00197 BAL   @14,C16C0900                                        0214 00218000
*     END;                          /* END OF GETTING DATA FOR     0215 00219000
*                                      TERMINAL                      */ 00220000
*C16C0200:                                                         0216 00221000
*   IF INDX=CT&                     /* CHECK FOR LOGOFF RECEIVED     */ 00222000
*       RPLFDB3='04'X               /* IF YES                        */ 00223000
*     THEN                                                         0216 00224000
@RF00195 DS    0H                                                  0216 00225000
C16C0200 C     INDX,@CF00072                                       0216 00226000
         BNE   @RF00216                                            0216 00227000
         CLI   RPLFDB3(RPLPTR),4                                   0216 00228000
         BNE   @RF00216                                            0216 00229000
*     $EOJ=ON;                      /* SET EOJ FLAG TO FORCE CANCEL  */ 00230000
         OI    $EOJ(WAPTR),B'00000010'                             0217 00231000
*C16C0250:                                                         0218 00232000
*   RPLSAVE=$CURELEM(INDX);         /* SAVE PTR TO CURRENT ELEM      */ 00233000
@RF00216 DS    0H                                                  0218 00234000
C16C0250 LR    @11,INDX                                            0218 00235000
         MH    @11,@CH00337                                        0218 00236000
         L     @00,$CURELEM-68(@11,WAPTR)                          0218 00237000
         ST    @00,RPLSAVE                                         0218 00238000
*   RESPECIFY                                                      0219 00239000
*     PTR1 RESTRICTED;              /* DONT LET THIS REG GET ALTERED */ 00240000
*   PTR1=INDX;                      /* POINT TO PARTICULAR ENTRY     */ 00241000
         LR    PTR1,INDX                                           0220 00242000
*   CALL C16C0265;                  /* START THE NEXT RPL            */ 00243000
         BAL   @14,C16C0265                                        0221 00244000
*   RESPECIFY                                                      0222 00245000
*     PTR1 UNRESTRICTED;            /* RELEASE THIS REGISTER FOR USE */ 00246000
*   RPLPTR=RPLSAVE;                 /* RESTORE ELEM PTR              */ 00247000
         L     RPLPTR,RPLSAVE                                      0223 00248000
*   IF RPLPTR^=0 THEN               /* ONLY RELEASE IF THERE IS    0224 00249000
*                                      SOMETHING TO RELEASE          */ 00250000
         LTR   RPLPTR,RPLPTR                                       0224 00251000
         BZ    @RF00224                                            0224 00252000
*     CALL C16C0270;                /* FREE LAST RPL WE ARE DONE     */ 00253000
         BAL   @14,C16C0270                                        0225 00254000
*C16C0251:                                                         0226 00255000
*   ;                                                              0226 00256000
@RF00224 DS    0H                                                  0226 00257000
C16C0251 DS    0H                                                  0227 00258000
*   R14=C16EXSAV;                   /* RESTORE RET REG               */ 00259000
         L     R14,C16EXSAV                                        0227 00260000
*   RETURN;                         /* RETURN TO VTAM                */ 00261000
@EL00001 DS    0H                                                  0228 00262000
@EF00001 DS    0H                                                  0228 00263000
@ER00001 BR    @14                                                 0228 00264000
*C16C0225:                                                         0229 00265000
*   GEN SETS(RPLPTR);                                              0229 00266000
C16C0225 DS    0H                                                  0229 00267000
         EXECRPL RPL=(RPLPTR)                                           00268000
*   IF R15^=0 THEN                  /* CHECK FOR AN ERROR            */ 00269000
         LTR   R15,R15                                             0230 00270000
         BNZ   @RT00230                                            0230 00271000
*     GO TO C16C0075;               /* ERROR, GET OUT                */ 00272000
*   GOTO C16C0251;                                                 0232 00273000
         B     C16C0251                                            0232 00274000
*                                                                  0233 00275000
*   /*****************************************************************/ 00276000
*   /*                                                               */ 00277000
*   /* CODE TO HANDLE RECORD MODE                                    */ 00278000
*   /*                                                               */ 00279000
*   /*****************************************************************/ 00280000
*                                                                  0233 00281000
*C16C0253:                                                         0233 00282000
*   R6=0;                           /* SET FLAG FOR STARTING QUEUE 0233 00283000
*                                      AFTER RESPONSE OR NOT         */ 00284000
C16C0253 SLR   R6,R6                                               0233 00285000
*   IF RPLRRESP=OFF                 /* IF IT IS A RESPONSE           */ 00286000
*     THEN                                                         0234 00287000
         LA    @11,16                                              0234 00288000
         ALR   @11,RPLPTR                                          0234 00289000
         TM    RPLRRESP(@11),B'00001000'                           0234 00290000
         BNZ   @RF00234                                            0234 00291000
*     DO;                                                          0235 00292000
*                                                                  0235 00293000
*       /*************************************************************/ 00294000
*       /*                                                           */ 00295000
*       /* NOT A RESPONSE,EITHER NORMAL OR EXPIDITED FLOW            */ 00296000
*       /*                                                           */ 00297000
*       /*************************************************************/ 00298000
*                                                                  0236 00299000
*       IF RPLNFSYN=OFF             /* IF IT IS NOT SYNCHRONEOUS     */ 00300000
*         THEN                                                     0236 00301000
         TM    RPLNFSYN(@11),B'00000100'                           0236 00302000
         BNZ   @RF00236                                            0236 00303000
*         DO;                                                      0237 00304000
*           IF RPLSEQNO^=$DVSEQNO(INDX)/* CHECK FOR SEQ ERRORS       */ 00305000
*             THEN                                                 0238 00306000
         LR    @11,INDX                                            0238 00307000
         MH    @11,@CH00337                                        0238 00308000
         ALR   @11,WAPTR                                           0238 00309000
         CLC   RPLSEQNO+60(2,RPLPTR),$DVSEQNO-68(@11)              0238 00310000
         BE    @RF00238                                            0238 00311000
*             DO;                                                  0239 00312000
*               RPLSSNSO='0201'X;   /* SET ERROR STATUS              */ 00313000
         MVC   RPLSSNSO(2,RPLPTR),@CB01933                         0240 00314000
*               GOTO C16C0300;      /* SEND RESPONSE                 */ 00315000
         B     C16C0300                                            0241 00316000
*             END;                                                 0242 00317000
*           $DVSEQNO(INDX)=$DVSEQNO(INDX)+1;/* INCREMENT SEQ # BY 1  */ 00318000
@RF00238 LR    @11,INDX                                            0243 00319000
         MH    @11,@CH00337                                        0243 00320000
         LA    @00,1                                               0243 00321000
         LH    @10,$DVSEQNO-68(@11,WAPTR)                          0243 00322000
         N     @10,@CF02031                                        0243 00323000
         ALR   @00,@10                                             0243 00324000
         STH   @00,$DVSEQNO-68(@11,WAPTR)                          0243 00325000
*         END;                                                     0244 00326000
*       IF BINBRAK=ON               /* IF BOUND WITH BRACKETS        */ 00327000
*         THEN                                                     0245 00328000
@RF00236 LR    @11,INDX                                            0245 00329000
         MH    @11,@CH00337                                        0245 00330000
         LA    @10,$DEVSESP-68(@11,WAPTR)                          0245 00331000
         TM    BINBRAK-1(@10),B'00100000'                          0245 00332000
         BNO   @RF00245                                            0245 00333000
*         DO;                                                      0246 00334000
*           IF RPLBB=ON             /* IF BEGIN BRACKET ON           */ 00335000
*             THEN                                                 0247 00336000
         TM    RPLBB+16(RPLPTR),B'10000000'                        0247 00337000
         BNO   @RF00247                                            0247 00338000
*             $DVBRKST(INDX)=INB;   /* GOING INTO BRACKET            */ 00339000
         LA    @00,1                                               0248 00340000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0248 00341000
*           IF RPLEB=ON             /* IF END BRACKET ON             */ 00342000
*             THEN                                                 0249 00343000
@RF00247 TM    RPLEB+16(RPLPTR),B'01000000'                        0249 00344000
         BNO   @RF00249                                            0249 00345000
*             $DVBRKST(INDX)=BETB;  /* GOING TO BETWEEN BRACKETS     */ 00346000
         LR    @11,INDX                                            0250 00347000
         MH    @11,@CH00337                                        0250 00348000
         SLR   @00,@00                                             0250 00349000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0250 00350000
*         END;                                                     0251 00351000
@RF00249 DS    0H                                                  0252 00352000
*       N=MIN(RPLBUFL,RPLRLEN);     /* GET NUMBER OF BYTES GIVEN BY     00353000
*                                      VTAM                          */ 00354000
@RF00245 L     @00,RPLBUFL(,RPLPTR)                                0252 00355000
         L     @11,RPLRLEN(,RPLPTR)                                0252 00356000
         CR    @00,@11                                             0252 00357000
         BNH   *+6                                                      00358000
         LR    @00,@11                                             0252 00359000
         STH   @00,N                                               0252 00360000
*       IF $ASCII(INDX)=ON&RPLCSI=ON/* IF ASCII                      */ 00361000
*         THEN                                                     0253 00362000
         LR    @11,INDX                                            0253 00363000
         MH    @11,@CH00337                                        0253 00364000
         ALR   @11,WAPTR                                           0253 00365000
         TM    $ASCII-68(@11),B'00000100'                          0253 00366000
         BNO   @RF00253                                            0253 00367000
         TM    RPLCSI+16(RPLPTR),B'00001000'                       0253 00368000
         BNO   @RF00253                                            0253 00369000
*         DO I=1 TO N;              /* TRANSLATE EACH CHARACTER TO 0254 00370000
*                                      ASCII                         */ 00371000
         LA    @00,1                                               0254 00372000
         B     @DE00254                                            0254 00373000
@DL00254 DS    0H                                                  0255 00374000
*           DO M=1 TO LENGTH($TRASCII);/* SEARCH FOR ASCII MATCH     */ 00375000
         LA    @00,1                                               0255 00376000
         STH   @00,M                                               0255 00377000
@DL00255 DS    0H                                                  0256 00378000
*             IF $TRMINPT(I)=$TRASCII(M)/* IF CHAR FOUND IN TABLE    */ 00379000
*               THEN                                               0256 00380000
         LH    @11,I                                               0256 00381000
         L     @10,RCAPTR(,WAPTR)                                  0256 00382000
         ALR   @11,WAPTR                                           0256 00383000
         ALR   @10,@00                                             0256 00384000
         CLC   $TRMINPT-1(1,@11),$TRASCII-1(@10)                   0256 00385000
         BNE   @RF00256                                            0256 00386000
*               DO;                                                0257 00387000
*                 $TRMINPT(I)=M-1;  /* SET TO EBCDIC VALUE           */ 00388000
         LH    @11,I                                               0258 00389000
         BCTR  @00,0                                               0258 00390000
         STC   @00,$TRMINPT-1(@11,WAPTR)                           0258 00391000
*                 GOTO C16C0254;                                   0259 00392000
         B     C16C0254                                            0259 00393000
*               END;                                               0260 00394000
*           END;                                                   0261 00395000
@RF00256 LA    @00,1                                               0261 00396000
         AH    @00,M                                               0261 00397000
         STH   @00,M                                               0261 00398000
         C     @00,@CF00083                                        0261 00399000
         BNH   @DL00255                                            0261 00400000
*           RPLSSNSO='1001'X;       /* SET ERROR STATUS              */ 00401000
         MVC   RPLSSNSO(2,RPLPTR),@CB01937                         0262 00402000
*           GOTO C16C0300;          /* SEND RESPONSE                 */ 00403000
         B     C16C0300                                            0263 00404000
*C16C0254:                                                         0264 00405000
*         END;                                                     0264 00406000
C16C0254 LA    @00,1                                               0264 00407000
         AH    @00,I                                               0264 00408000
@DE00254 STH   @00,I                                               0264 00409000
         CH    @00,N                                               0264 00410000
         BNH   @DL00254                                            0264 00411000
*       IF RPLDATA=OFF              /* IF NO DATA RECEIVED           */ 00412000
*         THEN                                                     0265 00413000
@RF00253 LA    @11,16                                              0265 00414000
         ALR   @11,RPLPTR                                          0265 00415000
         TM    RPLDATA(@11),B'10000000'                            0265 00416000
         BNZ   @RF00265                                            0265 00417000
*         DO;                       /* THIS IS A CONTROL FUNCTION    */ 00418000
*                                                                  0266 00419000
*           /*********************************************************/ 00420000
*           /*                                                       */ 00421000
*           /* PROCESSING A FUNCTION NOT DATA                        */ 00422000
*           /*                                                       */ 00423000
*           /*********************************************************/ 00424000
*                                                                  0267 00425000
*           IF RPLCNCEL=ON          /* WAS CANCEL REQUESTED          */ 00426000
*             THEN                                                 0267 00427000
         TM    RPLCNCEL(@11),B'01000000'                           0267 00428000
         BNO   @RF00267                                            0267 00429000
*             DO;                                                  0268 00430000
*               $DVINCT(INDX)=LENGTH($TRMINPT);/* READ A NEW MESSAGE */ 00431000
         LR    @11,INDX                                            0269 00432000
         MH    @11,@CH00337                                        0269 00433000
         LA    @00,80                                              0269 00434000
         STC   @00,$DVINCT-68(@11,WAPTR)                           0269 00435000
*               $TRMINPT=$TRMINPT&&$TRMINPT;/* SCRATCH OLD MSG       */ 00436000
         XC    $TRMINPT(80,WAPTR),$TRMINPT(WAPTR)                  0270 00437000
*               GOTO C16C0300;                                     0271 00438000
         B     C16C0300                                            0271 00439000
*             END;                  /* SEND RESPONSE                 */ 00440000
*           IF RPLSIGNL=ON          /* IS IT A SIGNAL                */ 00441000
*             THEN                                                 0273 00442000
@RF00267 TM    RPLSIGNL+16(RPLPTR),B'00010000'                     0273 00443000
         BNO   @RF00273                                            0273 00444000
*             DO;                                                  0274 00445000
*               $CIREQ=ON;          /* COMMUNICATION INTERVAL      0275 00446000
*                                      REQUIRED                      */ 00447000
         OI    $CIREQ(WAPTR),B'00000001'                           0275 00448000
*               GOTO C16C0300;      /* SEND RESPONSE                 */ 00449000
         B     C16C0300                                            0276 00450000
*             END;                                                 0277 00451000
*           IF RPLCHASE=ON          /* IS IT A CHASE                 */ 00452000
*             THEN                                                 0278 00453000
@RF00273 LA    @11,16                                              0278 00454000
         ALR   @11,RPLPTR                                          0278 00455000
         TM    RPLCHASE(@11),B'00001000'                           0278 00456000
         BO    @RT00278                                            0278 00457000
*             GOTO C16C0300;        /* SEND RESPONSE                 */ 00458000
*           IF RPLLUS=ON            /* IS LU STATU BEING SENT        */ 00459000
*             THEN                                                 0280 00460000
         TM    RPLLUS(@11),B'00100000'                             0280 00461000
         BNO   @RF00280                                            0280 00462000
*             IF RPLSSEI=0          /* IS ERROR STATUS ZERO          */ 00463000
*               THEN                                               0281 00464000
         CLI   RPLSSEI(RPLPTR),0                                   0281 00465000
         BE    @RT00281                                            0281 00466000
*               GOTO C16C0300;      /* SEND RESPONSE                 */ 00467000
*             ELSE                                                 0283 00468000
*               GOTO C16C0075;                                     0283 00469000
         B     C16C0075                                            0283 00470000
*           IF RPLSHUTD=ON|RPLSHUTC=ON|RPLRSHUT=ON/* IF ANY SHUTDOWN    00471000
*                                      REQUESTS ARE ON               */ 00472000
*             THEN                                                 0284 00473000
@RF00280 LA    @11,16                                              0284 00474000
         ALR   @11,RPLPTR                                          0284 00475000
         TM    RPLSHUTD(@11),B'00011010'                           0284 00476000
         BNZ   @RT00284                                            0284 00477000
*             GOTO C16C0075;                                       0285 00478000
*           IF RPLRTR=ON            /* IS TERMINAL READY TO RECEIVE     00479000
*                                      DATA                          */ 00480000
*             THEN                                                 0286 00481000
         TM    RPLRTR(@11),B'01000000'                             0286 00482000
         BNO   @RF00286                                            0286 00483000
*             RPLSSNSO='0819'X;     /* SET ERROR STATUS              */ 00484000
         MVC   RPLSSNSO(2,RPLPTR),@CB01939                         0287 00485000
*           ELSE                                                   0288 00486000
*             RPLSSNSO='1007'X;     /* SET ERROR STATUS              */ 00487000
         B     @RC00286                                            0288 00488000
@RF00286 MVC   RPLSSNSO(2,RPLPTR),@CB01940                         0288 00489000
*           GOTO C16C0300;          /* SEND RESPONSE                 */ 00490000
         B     C16C0300                                            0289 00491000
*         END;                                                     0290 00492000
*       IF RPLFMHDR=ON              /* IS THERE AN FM HEADER @DM00898*/ 00493000
*         THEN                      /*                       @DM00898*/ 00494000
@RF00265 TM    RPLFMHDR(RPLPTR),B'00000001'                        0291 00495000
         BNO   @RF00291                                            0291 00496000
*         DO;                       /*                       @DM00898*/ 00497000
*           RPLSSNSO='1008'X;       /* SET ERROR STATUS      @DM00898*/ 00498000
         MVC   RPLSSNSO(2,RPLPTR),@CB01941                         0293 00499000
*           GOTO C16C0300;          /* SEND RESPONSE         @DM00898*/ 00500000
         B     C16C0300                                            0294 00501000
*         END;                      /*                       @DM00898*/ 00502000
*                                                                  0295 00503000
*       /*************************************************************/ 00504000
*       /*                                                           */ 00505000
*       /* DATA RECEIVED,CHECK IF WE MUST WAIT FOR MORE              */ 00506000
*       /*                                                           */ 00507000
*       /*************************************************************/ 00508000
*                                                                  0296 00509000
*       IF RPLONLY^=ON&RPLLAST^=ON  /* IS IT END OF CHAIN            */ 00510000
*         THEN                                                     0296 00511000
@RF00291 TM    RPLONLY+16(RPLPTR),B'00110000'                      0296 00512000
         BNZ   @RF00296                                            0296 00513000
*         DO;                                                      0297 00514000
*           $DVINCT(INDX)=0;        /* DON'T READ ANYMORE DATA FROM     00515000
*                                      TERMINAL                      */ 00516000
         LR    @11,INDX                                            0298 00517000
         MH    @11,@CH00337                                        0298 00518000
         SLR   @00,@00                                             0298 00519000
         STC   @00,$DVINCT-68(@11,WAPTR)                           0298 00520000
*           GOTO C16C0300;          /* SEND RESPONSE                 */ 00521000
         B     C16C0300                                            0299 00522000
*         END;                                                     0300 00523000
*       IF $CURELEM(INDX)=0|INCT=0|$DVSNDOK(INDX)='0'B/* IF NO     0301 00524000
*                                      ELEMENTS                      */ 00525000
*         THEN                                                     0301 00526000
@RF00296 LR    @11,INDX                                            0301 00527000
         MH    @11,@CH00337                                        0301 00528000
         L     @10,$CURELEM-68(@11,WAPTR)                          0301 00529000
         LTR   @10,@10                                             0301 00530000
         BZ    @RT00301                                            0301 00531000
         CLI   INCT(@10),0                                         0301 00532000
         BE    @RT00301                                            0301 00533000
         ALR   @11,WAPTR                                           0301 00534000
         TM    $DVSNDOK-68(@11),B'00010000'                        0301 00535000
         BNZ   @RF00301                                            0301 00536000
@RT00301 DS    0H                                                  0302 00537000
*         $CIREQ=ON;                /* COMMUNICATION INTERVAL      0302 00538000
*                                      REQUIRED                      */ 00539000
         OI    $CIREQ(WAPTR),B'00000001'                           0302 00540000
*       ELSE                                                       0303 00541000
*         DO;                       /* DATA RECEIVED FROM CT, PASS IT   00542000
*                                      BACK                          */ 00543000
         B     @RC00301                                            0303 00544000
@RF00301 DS    0H                                                  0304 00545000
*           CALL C16C0900;          /* PASS BACK RESPONSE TO CALLER  */ 00546000
         BAL   @14,C16C0900                                        0304 00547000
*           R6=1;                   /* START NEXT ELEMENT ON QUEUE   */ 00548000
         LA    R6,1                                                0305 00549000
*         END;                      /* END OF DATA RECEIVED FROM CT  */ 00550000
*C16C0300:                                                         0307 00551000
*       IF(RPLNFME=OFF|RPLRRN=ON)&  /* IF RESP TYPE 1 OR 2   @DM00899*/ 00552000
*           (RPLEX=OFF|RPLSSEO^=0) THEN/* AND NORMAL OR ECEPTION   0307 00553000
*                                                            @DM00899*/ 00554000
@RC00301 DS    0H                                                  0307 00555000
C16C0300 TM    RPLRRN+16(RPLPTR),B'00000001'                       0307 00556000
         BNZ   @GL00018                                            0307 00557000
         TM    RPLNFME+16(RPLPTR),B'00000010'                      0307 00558000
         BO    @RF00307                                            0307 00559000
@GL00018 TM    RPLEX+16(RPLPTR),B'00000100'                        0307 00560000
         BZ    @RT00307                                            0307 00561000
         CLI   RPLSSEO(RPLPTR),0                                   0307 00562000
         BE    @RF00307                                            0307 00563000
@RT00307 DS    0H                                                  0308 00564000
*         DO;                       /* RESPONSE REQUIRED TO INBOUND     00565000
*                                      REQUEST               @DM00899*/ 00566000
*           IF RPLSSEO^=0 THEN      /* EXCEPTION RESPONSE    @DM00899*/ 00567000
         CLI   RPLSSEO(RPLPTR),0                                   0309 00568000
         BE    @RF00309                                            0309 00569000
*             RPLEX=ON;             /* YES,SET EXCEPTION BIT @DM00899*/ 00570000
         OI    RPLEX+16(RPLPTR),B'00000100'                        0310 00571000
*           ARG=$CID(INDX);         /* PICK UP THE CID               */ 00572000
@RF00309 LR    @11,INDX                                            0311 00573000
         MH    @11,@CH00337                                        0311 00574000
         ALR   @11,WAPTR                                           0311 00575000
         ICM   ARG,15,$CID-68(@11)                                 0311 00576000
*           GEN REFS(RPLPTR,ARG);                                  0312 00577000
*                        /* SEND RESPONSE */                            00578000
 SEND RPL=(RPLPTR),POST=SCHED,STYPE=RESP,OPTCD=SYN,ARG=(ARG)            00579000
*           IF R15^=0 THEN          /* CHECK FOR ERROR RETURN CODE   */ 00580000
         LTR   R15,R15                                             0313 00581000
         BNZ   @RT00313                                            0313 00582000
*             GO TO C16C0075;       /* ERROR, GET OUT                */ 00583000
*         END;                                                     0315 00584000
*       IF R6^=0|$CURELEM(INDX)=0   /* SHOULD WE FREE THIS ELEMENT 0316 00585000
*                                      AND START ANEW        @DM00899*/ 00586000
*         THEN                                                     0316 00587000
@RF00307 SLR   @11,@11                                             0316 00588000
         CR    R6,@11                                              0316 00589000
         BNE   @RT00316                                            0316 00590000
         LR    @10,INDX                                            0316 00591000
         MH    @10,@CH00337                                        0316 00592000
         C     @11,$CURELEM-68(@10,WAPTR)                          0316 00593000
         BE    @RT00316                                            0316 00594000
*         GOTO C16C0250;            /* GET NEXT MESSAGE              */ 00595000
*C16C0256:                                                         0318 00596000
*       RPLAREA=ADDR($TRMINPT);     /* POINT TO THE BUFFER           */ 00597000
C16C0256 LA    @00,$TRMINPT(,WAPTR)                                0318 00598000
         ST    @00,RPLAREA(,RPLPTR)                                0318 00599000
*       RPLBUFL=$DVINCT(INDX);      /* SET FOR NUMBER OF BYTES TO  0319 00600000
*                                      READ                          */ 00601000
         LR    @11,INDX                                            0319 00602000
         MH    @11,@CH00337                                        0319 00603000
         SLR   @00,@00                                             0319 00604000
         IC    @00,$DVINCT-68(@11,WAPTR)                           0319 00605000
         ST    @00,RPLBUFL(,RPLPTR)                                0319 00606000
*       ARG=$CID(INDX);             /* PICK UP THE CID               */ 00607000
         ALR   @11,WAPTR                                           0320 00608000
         ICM   ARG,15,$CID-68(@11)                                 0320 00609000
*       GEN REFS(RPLPTR,ARG);                                      0321 00610000
*                      /* DO A RECEIVE */                               00611000
 RECEIVE RPL=(RPLPTR),ARG=(ARG),EXIT=ISTCC016,                         X00612000
               OPTCD=(ASY,TRUNC,Q),RTYPE=(DFSYN,DFASY,RESP)             00613000
*       IF R15^=0 THEN              /* CHECK FOR ERROR RETURN CODE   */ 00614000
         LTR   R15,R15                                             0322 00615000
         BNZ   @RT00322                                            0322 00616000
*         GO TO C16C0075;           /* IF ERROR,EXIT                 */ 00617000
*       GOTO C16C0251;              /* EXIT                          */ 00618000
         B     C16C0251                                            0324 00619000
*     END;                                                         0325 00620000
*                                                                  0325 00621000
*   /*****************************************************************/ 00622000
*   /*                                                               */ 00623000
*   /* RESPONSE RECEIVED FROM OUR REQUEST                            */ 00624000
*   /*                                                               */ 00625000
*   /*****************************************************************/ 00626000
*                                                                  0326 00627000
*   IF RPLEX=ON                     /* DID REQUEST TERMINATE WITH  0326 00628000
*                                      EXCEPTION                     */ 00629000
*     THEN                                                         0326 00630000
@RF00234 TM    RPLEX+16(RPLPTR),B'00000100'                        0326 00631000
         BNO   @RF00326                                            0326 00632000
*     DO;                           /* YES IT TERMINATED WITH AN   0327 00633000
*                                      EXCEPTION                     */ 00634000
*       IF RPLSSEI='08'X&(RPLSSMI='13'X|RPLSSMI='14'X|RPLSSMI='1B'X)    00635000
*                                   /* IS IT A TEMPORARY ERROR       */ 00636000
*         THEN                                                     0328 00637000
         CLI   RPLSSEI(RPLPTR),X'08'                               0328 00638000
         BNE   @RF00328                                            0328 00639000
         CLI   RPLSSMI(RPLPTR),19                                  0328 00640000
         BE    @RT00328                                            0328 00641000
         CLI   RPLSSMI(RPLPTR),20                                  0328 00642000
         BE    @RT00328                                            0328 00643000
         CLI   RPLSSMI(RPLPTR),27                                  0328 00644000
         BNE   @RF00328                                            0328 00645000
@RT00328 DS    0H                                                  0329 00646000
*         DO;                                                      0329 00647000
*           CALL C16C0280;          /* ADD ELEMENT BACK ON QUE       */ 00648000
         BAL   @14,C16C0280                                        0330 00649000
*           IF $DVSNDOK(INDX)=ON    /* IF OK TO SEND NEXT MSG        */ 00650000
*             THEN                                                 0331 00651000
         LR    @11,INDX                                            0331 00652000
         MH    @11,@CH00337                                        0331 00653000
         ALR   @11,WAPTR                                           0331 00654000
         TM    $DVSNDOK-68(@11),B'00010000'                        0331 00655000
         BO    @RT00331                                            0331 00656000
*             GOTO C16C0250;        /* GET ELEMENT OFF QUE AND START    00657000
*                                      IT                            */ 00658000
*           ELSE                                                   0333 00659000
*             GOTO C16C0256;        /* GOTO RECEIVE INPUT            */ 00660000
         B     C16C0256                                            0333 00661000
*         END;                                                     0334 00662000
*       ELSE                                                       0335 00663000
*         GOTO C16C0075;            /* FLAG CT OR AP AS AN ERROR     */ 00664000
*     END;                                                         0336 00665000
*   $DVSNDOK(INDX)=ON;                                             0337 00666000
@RF00326 LR    @11,INDX                                            0337 00667000
         MH    @11,@CH00337                                        0337 00668000
         ST    @11,@TF00001                                        0337 00669000
         ALR   @11,WAPTR                                           0337 00670000
         OI    $DVSNDOK-68(@11),B'00010000'                        0337 00671000
*   IF BINBRAK=ON                   /* IF BOUND WITH BRACKETS        */ 00672000
*     THEN                                                         0338 00673000
         L     @11,@TF00001                                        0338 00674000
         LA    @11,$DEVSESP-68(@11,WAPTR)                          0338 00675000
         BCTR  @11,0                                               0338 00676000
         TM    BINBRAK(@11),B'00100000'                            0338 00677000
         BNO   @RF00338                                            0338 00678000
*     IF BINBKTR=ON&$DVBRKSN(INDX)=SNDEB/* CHECK BRACKET             */ 00679000
*       THEN                                                       0339 00680000
         TM    BINBKTR(@11),B'00010000'                            0339 00681000
         BNO   @RF00339                                            0339 00682000
         L     @11,@TF00001                                        0339 00683000
         SLR   @00,@00                                             0339 00684000
         IC    @00,$DVBRKSN-68(@11,WAPTR)                          0339 00685000
         C     @00,@CF00139                                        0339 00686000
         BNE   @RF00339                                            0339 00687000
*       $DVBRKST(INDX)=BETB;        /* NOW BETWEEN BRACKETS          */ 00688000
         SLR   @00,@00                                             0340 00689000
         L     @11,@TF00001                                        0340 00690000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0340 00691000
*     ELSE                                                         0341 00692000
*       IF $DVBRKSN(INDX)=SNDBB     /* WAS BEGIN BRACKET SUCCESSFUL  */ 00693000
*         THEN                                                     0341 00694000
         B     @RC00339                                            0341 00695000
@RF00339 LA    @11,1                                               0341 00696000
         LR    @10,INDX                                            0341 00697000
         MH    @10,@CH00337                                        0341 00698000
         SLR   @00,@00                                             0341 00699000
         IC    @00,$DVBRKSN-68(@10,WAPTR)                          0341 00700000
         CR    @11,@00                                             0341 00701000
         BNE   @RF00341                                            0341 00702000
*         $DVBRKST(INDX)=INB;       /* NOW IN BRACKET                */ 00703000
         STC   @11,$DVBRKST-68(@10,WAPTR)                          0342 00704000
*   IF $CURELEM(INDX)->INCT^=0      /* POINT TO CURRENT ELEMENT AND     00705000
*                                      CHECK FOR INPUT               */ 00706000
*     THEN                                                         0343 00707000
@RF00341 DS    0H                                                  0343 00708000
@RC00339 DS    0H                                                  0343 00709000
@RF00338 LR    @11,INDX                                            0343 00710000
         MH    @11,@CH00337                                        0343 00711000
         L     @11,$CURELEM-68(@11,WAPTR)                          0343 00712000
         CLI   INCT(@11),0                                         0343 00713000
         BNE   @RT00343                                            0343 00714000
*     GOTO C16C0256;                /* GOTO RECEIVE INPUT            */ 00715000
*   GOTO C16C0250;                  /* GET ELEMENT OFF QUE AND START    00716000
*                                      IT                            */ 00717000
         B     C16C0250                                            0345 00718000
*   RESPECIFY                                                      0346 00719000
*    (R0,                                                          0346 00720000
*     R1) RESTRICTED;               /* DONT LET THESE REGISTERS GET     00721000
*                                      ALTRED                        */ 00722000
*C16C1000:                                                         0347 00723000
*   GEN REFS(C16C1000,BASE,R12,R13,R14,R15,C16CBUF2);              0347 00724000
C16C1000 DS    0H                                                  0347 00725000
*                                                 /*SETUP @ZD10878*/    00726000
         USING C16C1000,R15                                             00727000
         STM   R14,R12,12(R13)     SAVE CALLERS REGISTERS               00728000
         L     R12,BASE            PICK UP COMMON BASE ADDRESS          00729000
         DROP  R15                                                      00730000
         LA    R9,C16CBUF2 POINT TO MAINLINE WORK AREA         @ZD10878 00731000
*   SAVEA(2)=R13;                   /* SAVE ADDRESS OF CALLERS     0348 00732000
*                                      SAVEAREA                      */ 00733000
         ST    R13,SAVEA+4                                         0348 00734000
*   BACKSAVE(3)=ADDR(SAVEA);        /* POINT TO MY SAVEAREA          */ 00735000
         LA    @11,SAVEA                                           0349 00736000
         ST    @11,BACKSAVE+8(,R13)                                0349 00737000
*   R13=ADDR(SAVEA);                /* GET ADDRESS OF MY SAVEAREA    */ 00738000
         LR    R13,@11                                             0350 00739000
*   INDX=R1;                        /* POINT TO ENTRY IN DEV TABLE   */ 00740000
         LR    INDX,R1                                             0351 00741000
*   IF R0=0 THEN                    /* IF CALLED TO START A QUE      */ 00742000
         LTR   R0,R0                                               0352 00743000
         BNZ   @RF00352                                            0352 00744000
*     DO;                           /* THEN START THE QUEUE PASSED IN   00745000
*                                      R1                            */ 00746000
*       CALL C16C0265;              /* START THE QUEUE POINTED TO BY    00747000
*                                      R1                            */ 00748000
         BAL   @14,C16C0265                                        0354 00749000
*       GO TO C16C1050;             /* EXIT THE MODULE               */ 00750000
         B     C16C1050                                            0355 00751000
*     END;                          /* END OF ROUTINE TO START QUEUE */ 00752000
*   IF R0=4 THEN                    /* IF CALLED TO PURGE A QUEUE    */ 00753000
@RF00352 C     R0,@CF00068                                         0357 00754000
         BNE   @RF00357                                            0357 00755000
*     DO;                           /* PURGE QUEUE POINTED TO BY RU  */ 00756000
*       RESPECIFY                                                  0359 00757000
*        (PTR1,                                                    0359 00758000
*         PTR2) RESTRICTED;         /* DONT ALTER REGISTERS          */ 00759000
*       PTR2=PTR1;                  /* SAVE ADDRESS OF QUEUE         */ 00760000
         LR    PTR2,PTR1                                           0360 00761000
*       R0=0;                       /* INDICATE NO ELEMENTS ON CHAIN */ 00762000
         SLR   R0,R0                                               0361 00763000
*C16C1005:                                                         0362 00764000
*       PTR1=LASTCHN;               /* GET CHAIN PTR                 */ 00765000
C16C1005 L     PTR1,LASTCHN(,PTR2)                                 0362 00766000
*       CS(PTR1,R0,LASTCHN);        /* REMOVE ALL ELEMENTS FROM QUEUE*/ 00767000
         CS    PTR1,@00,LASTCHN(PTR2)                              0363 00768000
*       BC(4,C16C1005);             /* COMPARE AND SWAP FAILED, TRY     00769000
*                                      AGAIN                         */ 00770000
         BC    4,C16C1005                                          0364 00771000
*       IF((PTR1&GATEBIT0)^=0) THEN /* CHECK FOR ANYTHING ON QUE   0365 00772000
*                                                            @ZD10874*/ 00773000
         LR    @11,PTR1                                            0365 00774000
         N     @11,@CF00650                                        0365 00775000
         LTR   @11,@11                                             0365 00776000
         BZ    @RF00365                                            0365 00777000
*         DO;                                                      0366 00778000
*           R8=PTR1;                /* POINT TO NEXT ELEMENT @DA04688*/ 00779000
         LR    R8,PTR1                                             0367 00780000
*C16C1025:                                                         0368 00781000
*           RPLPTR=R8;              /* POINT TO ELE TO BE FREED    0368 00782000
*                                                            @ZD10874*/ 00783000
C16C1025 LR    RPLPTR,R8                                           0368 00784000
*           R8=RPLPTR->CHAIN&GATEBIT0;/* POINT TO NEXT ELE   @ZD10874*/ 00785000
         L     R8,CHAIN(,RPLPTR)                                   0369 00786000
         N     R8,@CF00650                                         0369 00787000
*           CALL C16C0270;          /* FREE THIS ELEMENT     @ZD10874*/ 00788000
         BAL   @14,C16C0270                                        0370 00789000
*           IF R8^=0 THEN           /* ANY ELEMENTS LEFT ON QUE    0371 00790000
*                                                            @ZD10874*/ 00791000
         LTR   R8,R8                                               0371 00792000
         BNZ   @RT00371                                            0371 00793000
*             GOTO C16C1025;        /* YES FREE IT           @ZD10874*/ 00794000
*         END;                      /* END OF LOOPING THOOUGHT THE 0373 00795000
*                                      ELEMENTS                      */ 00796000
*       GO TO C16C1050;             /* EXIT THE MODULE               */ 00797000
         B     C16C1050                                            0374 00798000
*     END;                          /* END OF FREEING HE QUE CODE    */ 00799000
*C16C1050:                                                         0376 00800000
*   GEN REFS(R13,R12,R14);                                         0376 00801000
@RF00357 DS    0H                                                  0376 00802000
C16C1050 DS    0H                                                  0376 00803000
         L     R13,4(R13)          PICK UP LAST SAVE AREA ADDRESS       00804000
         LM    R14,R12,12(R13)     RESTORE REGISTERS                    00805000
         BR    R14                 RETURN TO CALLER                     00806000
*   RESPECIFY                                                      0377 00807000
*    (PTR1,                                                        0377 00808000
*     PTR2) UNRESTRICTED;           /* REGISTERS ARE FREE AGAIN      */ 00809000
*   RESPECIFY                                                      0378 00810000
*    (R0,                                                          0378 00811000
*     R1) UNRESTRICTED;             /* RELEASE THESE REGISTERS FOR 0378 00812000
*                                      USE                           */ 00813000
*C16C0255:                                                         0379 00814000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0379 00815000
         B     @PB00002                                            0379 00816000
C16C0255 DS    0H                                                  0380 00817000
*   RESPECIFY                                                      0380 00818000
*    (PTR1,                                                        0380 00819000
*     PTR2) RESTRICTED;             /* DONT ALTER REGISTERS          */ 00820000
*   R7=R14;                         /* SAVE R14 FOR RETRUN           */ 00821000
         LR    R7,R14                                              0381 00822000
*   PTR2=ADDR($MSGOTSD(INDX));      /* SAVE PTR1                     */ 00823000
         LR    @11,INDX                                            0382 00824000
         MH    @11,@CH00337                                        0382 00825000
         LA    PTR2,$MSGOTSD-68(@11,WAPTR)                         0382 00826000
*   PTR1=LASTCHN&GATEBIT0;          /* PTR TO 1ST ELEMENT            */ 00827000
         L     PTR1,LASTCHN(,PTR2)                                 0383 00828000
         N     PTR1,@CF00650                                       0383 00829000
*   IF PTR1=0 THEN                  /* IF NO OUTSTANDING MESSAGES    */ 00830000
         LTR   PTR1,PTR1                                           0384 00831000
         BNZ   @RF00384                                            0384 00832000
*     DO;                           /* HANDLE AS SPECIAL CASE        */ 00833000
*       LASTCHN=PTR1;               /* SET MESSAGES OUTSTANDING TO 0386 00834000
*                                      ZERO                          */ 00835000
         ST    PTR1,LASTCHN(,PTR2)                                 0386 00836000
*       R1=ADDR($TLTECB2);          /* POINT TO ECB TO BE POSTED   0387 00837000
*                                                            @ZD10879*/ 00838000
         L     R1,RCAPTR(,WAPTR)                                   0387 00839000
         LA    R1,$TLTECB2(,R1)                                    0387 00840000
*       IF $CTEQTT='1'B&($SNDRFLG='1'B|$EXIOWAT='1'B)/* POST ECB   0388 00841000
*                                                            @ZD10879*/ 00842000
*         THEN                                                     0388 00843000
         TM    $CTEQTT(WAPTR),B'00010000'                          0388 00844000
         BNO   @RF00388                                            0388 00845000
         TM    $SNDRFLG(WAPTR),B'00100100'                         0388 00846000
         BZ    @RF00388                                            0388 00847000
*         CALL I00C1001;            /* POST ECB              @ZD10879*/ 00848000
         L     @15,@CV01962                                        0389 00849000
         BALR  @14,@15                                             0389 00850000
*       PTR1=0;                     /* SHOW NO ELEMENT FOUND @ZD10879*/ 00851000
@RF00388 SLR   PTR1,PTR1                                           0390 00852000
*       GO TO C16C0260;             /* EXIT FROM THE FUNCTION        */ 00853000
         B     C16C0260                                            0391 00854000
*     END;                          /* END OF THE SPECIAL CASE       */ 00855000
*   DO WHILE((PTR1->CHAIN&GATEBIT0)^=0);/* LOOP UNTIL LAST ELEMENT   */ 00856000
@RF00384 B     @DE00393                                            0393 00857000
@DL00393 DS    0H                                                  0394 00858000
*     PTR2=PTR1;                    /* ADDR OF PTR TO NEXT ELEMENT   */ 00859000
         LR    PTR2,PTR1                                           0394 00860000
*     PTR1=PTR2->CHAIN;             /* ADDR OF NEXT ELEMENT          */ 00861000
         L     PTR1,CHAIN(,PTR2)                                   0395 00862000
*   END;                            /* END OF LOOP LOOKING FOR LAST     00863000
*                                      ELEMENT                       */ 00864000
@DE00393 L     @00,CHAIN(,PTR1)                                    0396 00865000
         N     @00,@CF00650                                        0396 00866000
         LTR   @00,@00                                             0396 00867000
         BNZ   @DL00393                                            0396 00868000
*   PTR2->LASTCHN=GATEBIT1;         /* ZERO LAST CHAIN PTR           */ 00869000
         MVC   LASTCHN(4,PTR2),@CF00652                            0397 00870000
*C16C0260:                                                         0398 00871000
*   R14=R7;                         /* RETURN TO THE CALLER          */ 00872000
C16C0260 LR    R14,R7                                              0398 00873000
*   END C16C0255;                   /* END OF SUBROUTINE TO REMOVE 0399 00874000
*                                      ELEMENT FROM QUEUE            */ 00875000
@EL00002 DS    0H                                                  0399 00876000
@EF00002 DS    0H                                                  0399 00877000
@ER00002 BR    @14                                                 0399 00878000
*   RESPECIFY                                                      0400 00879000
*    (PTR1,                                                        0400 00880000
*     PTR2) UNRESTRICTED;           /* REGISTERS ARE FREE AGAIN      */ 00881000
*   RESPECIFY                                                      0401 00882000
*     R1 RESTRICTED;                /* DONT LET THIS REG GET ALTERED */ 00883000
*C16C0265:                                                         0402 00884000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0402 00885000
C16C0265 DS    0H                                                  0403 00886000
*   R8=R14;                         /* SAVE THE RETURN ADDRESS       */ 00887000
         LR    R8,R14                                              0403 00888000
*   CALL C16C0255;                  /* GET AN RPL TO PROCESS         */ 00889000
         BAL   @14,C16C0255                                        0404 00890000
*   $CURELEM(INDX)=PTR1;                                           0405 00891000
         LR    @11,INDX                                            0405 00892000
         MH    @11,@CH00337                                        0405 00893000
         ST    PTR1,$CURELEM-68(@11,WAPTR)                         0405 00894000
*   RPLPTR=ADDR($TLTRPL1);          /* POINT TO THE CT RPL           */ 00895000
         LA    RPLPTR,$TLTRPL1(,WAPTR)                             0406 00896000
*   IF INDX=2 THEN                  /* CHECK TO SEE WHICH RPL IS   0407 00897000
*                                      CORRECT                       */ 00898000
         C     INDX,@CF00139                                       0407 00899000
         BNE   @RF00407                                            0407 00900000
*     RPLPTR=ADDR($TLTRPL2);        /* MUST BE AN AP                 */ 00901000
         LA    RPLPTR,$TLTRPL2(,WAPTR)                             0408 00902000
*   ARG=$CID(INDX);                 /* PICK UP THE CID               */ 00903000
@RF00407 LR    @11,INDX                                            0409 00904000
         MH    @11,@CH00337                                        0409 00905000
         ST    @11,@TF00001                                        0409 00906000
         ALR   @11,WAPTR                                           0409 00907000
         ICM   ARG,15,$CID-68(@11)                                 0409 00908000
*   RPLUSFLD=WAPTR;                 /* SAVE WAPTR            @DM30415*/ 00909000
         ST    WAPTR,RPLUSFLD(,RPLPTR)                             0410 00910000
*   IF R1^=0 THEN                   /* CHECK FOR ELEMENT TO PROCESS  */ 00911000
         LTR   R1,R1                                               0411 00912000
         BZ    @RF00411                                            0411 00913000
*     DO;                           /* IF THER WAS A RETURNED      0412 00914000
*                                      ELEMENT, START IT             */ 00915000
*       RESPECIFY                                                  0413 00916000
*         R1 UNRESTRICTED;          /* RELEASE THIS REGISTER FOR USE */ 00917000
*       R7=ADDR(MSG);               /* POINT TO MSG TO BE SENT       */ 00918000
         L     @11,@TF00001                                        0414 00919000
         L     @11,$CURELEM-68(@11,WAPTR)                          0414 00920000
         LA    R7,MSG(,@11)                                        0414 00921000
*       R6=OUTCT;                   /* SET UP LENGTH OF OUTBOUND MSG */ 00922000
         SLR   R6,R6                                               0415 00923000
         IC    R6,OUTCT(,@11)                                      0415 00924000
*       IF $DEVLU(INDX)=OFF         /* IF NOT AN LU                  */ 00925000
*         THEN                                                     0416 00926000
         LR    @11,WAPTR                                           0416 00927000
         AL    @11,@TF00001                                        0416 00928000
         TM    $DEVLU-68(@11),B'00001000'                          0416 00929000
         BNZ   @RF00416                                            0416 00930000
*         DO;                                                      0417 00931000
*           IF $DVCTBYT(INDX)=OFF   /* IF NO CONTROL BYTE PRESENT    */ 00932000
*             THEN                                                 0418 00933000
         LR    @11,WAPTR                                           0418 00934000
         AL    @11,@TF00001                                        0418 00935000
         TM    $DVCTBYT-68(@11),B'00000010'                        0418 00936000
         BNZ   @RF00418                                            0418 00937000
*             GEN REFS(RPLPTR,ISTCC016,ARG,R6,R7);                 0419 00938000
 WRITE RPL=(RPLPTR),OPTCD=ASY,EXIT=ISTCC016,ARG=(ARG),                 X00939000
               AREA=(R7),RECLEN=(R6)                                    00940000
*           ELSE                                                   0420 00941000
*             DO;                                                  0420 00942000
         B     @RC00418                                            0420 00943000
@RF00418 DS    0H                                                  0421 00944000
*               R7=R7+1;            /* SKIP OVER CONTROL BYTE        */ 00945000
         AL    R7,@CF00072                                         0421 00946000
*               R6=R6-1;            /* REDUCE THE COUNT              */ 00947000
         BCTR  R6,0                                                0422 00948000
*               IF MSG(1)='1'       /* SHOULD SCREEN BE ERASED       */ 00949000
*                 THEN                                             0423 00950000
         LR    @11,INDX                                            0423 00951000
         MH    @11,@CH00337                                        0423 00952000
         L     @11,$CURELEM-68(@11,WAPTR)                          0423 00953000
         CLI   MSG(@11),C'1'                                       0423 00954000
         BNE   @RF00423                                            0423 00955000
*                 GEN REFS(RPLPTR,ISTCC016,ARG,R6,R7);             0424 00956000
 WRITE RPL=(RPLPTR),EXIT=ISTCC016,ARG=(ARG),RECLEN=(R6),               X00957000
               AREA=(R7),OPTCD=(ASY,LBT,NERASE)                         00958000
*               ELSE                                               0425 00959000
*                 GEN REFS(RPLPTR,ISTCC016,ARG,R6,R7);             0425 00960000
         B     @RC00423                                            0425 00961000
@RF00423 DS    0H                                                  0425 00962000
 WRITE RPL=(RPLPTR),EXIT=ISTCC016,ARG=(ARG),RECLEN=(R6),               X00963000
               AREA=(R7),OPTCD=(ASY,LBT,ERASE)                          00964000
*             END;                                                 0426 00965000
*         END;                                                     0427 00966000
*       ELSE                        /* PROCESS AN LU         @D32JPGH*/ 00967000
*         DO;                                                      0428 00968000
         B     @RC00416                                            0428 00969000
@RF00416 DS    0H                                                  0429 00970000
*           IF BINBRAK=ON           /* DID WE BIND TO USE BRACKETS 0429 00971000
*                                                            @D32JPGH*/ 00972000
*             THEN                                                 0429 00973000
         LR    @11,INDX                                            0429 00974000
         MH    @11,@CH00337                                        0429 00975000
         LA    @10,$DEVSESP-68(@11,WAPTR)                          0429 00976000
         TM    BINBRAK-1(@10),B'00100000'                          0429 00977000
         BNO   @RF00429                                            0429 00978000
*             DO;                                                  0430 00979000
*               RPLBB=OFF;                                         0431 00980000
*               RPLEB=OFF;                                         0432 00981000
         LA    @10,16                                              0432 00982000
         ALR   @10,RPLPTR                                          0432 00983000
         NI    RPLBB(@10),B'00111111'                              0432 00984000
*               $DVBRKSN(INDX)=0;   /* RESET BRACKET TO ZERO @D32JPGH*/ 00985000
         SLR   @00,@00                                             0433 00986000
         STC   @00,$DVBRKSN-68(@11,WAPTR)                          0433 00987000
*               IF $DVBRKST(INDX)^=INB/* NOT IN BRACKET STATE      0434 00988000
*                                                            @D32JPGH*/ 00989000
*                 THEN              /* THEN                  @D32JPGH*/ 00990000
         SLR   @00,@00                                             0434 00991000
         IC    @00,$DVBRKST-68(@11,WAPTR)                          0434 00992000
         C     @00,@CF00072                                        0434 00993000
         BE    @RF00434                                            0434 00994000
*                 RPLBB=ON;         /* SET BEGIN BRACKET     @D32JPGH*/ 00995000
         OI    RPLBB(@10),B'10000000'                              0435 00996000
*               IF($MSGOTSD(INDX)&GATEBIT0)=0&INCT=0/* IF NO MORE  0436 00997000
*                                      ELEMENTS AND DON'T NEED DATA  */ 00998000
*                 THEN                                             0436 00999000
@RF00434 LR    @11,INDX                                            0436 01000000
         MH    @11,@CH00337                                        0436 01001000
         L     @00,$MSGOTSD-68(@11,WAPTR)                          0436 01002000
         N     @00,@CF00650                                        0436 01003000
         LTR   @00,@00                                             0436 01004000
         BNZ   @RF00436                                            0436 01005000
         L     @11,$CURELEM-68(@11,WAPTR)                          0436 01006000
         CLI   INCT(@11),0                                         0436 01007000
         BNE   @RF00436                                            0436 01008000
*                 RPLEB=ON;         /* END BRACKET           @D32JPGH*/ 01009000
         OI    RPLEB+16(RPLPTR),B'01000000'                        0437 01010000
*               IF RPLBB=ON THEN    /* IF SENDING A BB               */ 01011000
@RF00436 LA    @11,16                                              0438 01012000
         ALR   @11,RPLPTR                                          0438 01013000
         TM    RPLBB(@11),B'10000000'                              0438 01014000
         BNO   @RF00438                                            0438 01015000
*                 IF RPLEB=ON THEN  /* AND IF SENDING AN EB          */ 01016000
         TM    RPLEB(@11),B'01000000'                              0439 01017000
         BNO   @RF00439                                            0439 01018000
*                   $DVBRKST(INDX)=BETB;/* THEN GOING BETEWEEN     0440 01019000
*                                      BRACKET                       */ 01020000
         LR    @11,INDX                                            0440 01021000
         MH    @11,@CH00337                                        0440 01022000
         SLR   @00,@00                                             0440 01023000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0440 01024000
*                 ELSE              /* IF BB AND NOT EB              */ 01025000
*                   $DVBRKSN(INDX)=SNDBB;/* OTHERWISE, ONLY SENDING     01026000
*                                      BB                            */ 01027000
         B     @RC00439                                            0441 01028000
@RF00439 LR    @11,INDX                                            0441 01029000
         MH    @11,@CH00337                                        0441 01030000
         LA    @00,1                                               0441 01031000
         STC   @00,$DVBRKSN-68(@11,WAPTR)                          0441 01032000
*               ELSE                /* IF NOT SENDING BB             */ 01033000
*                 IF RPLEB=ON THEN  /* IF AN EB WITHOUT A BB         */ 01034000
         B     @RC00438                                            0442 01035000
@RF00438 TM    RPLEB+16(RPLPTR),B'01000000'                        0442 01036000
         BNO   @RF00442                                            0442 01037000
*                   IF BINBKTR=ON THEN/* AND IF CONDITIONAL        0443 01038000
*                                      TERMINATION                   */ 01039000
         LR    @11,INDX                                            0443 01040000
         MH    @11,@CH00337                                        0443 01041000
         LA    @10,$DEVSESP-68(@11,WAPTR)                          0443 01042000
         TM    BINBKTR-1(@10),B'00010000'                          0443 01043000
         BNO   @RF00443                                            0443 01044000
*                     $DVBRKSN(INDX)=SNDEB;/* ONLY SENDING AN EB     */ 01045000
         LA    @00,2                                               0444 01046000
         STC   @00,$DVBRKSN-68(@11,WAPTR)                          0444 01047000
*                   ELSE            /* SENDING EB ONLY,NO CONDITIONAL   01048000
*                                      TERMINATION                   */ 01049000
*                     $DVBRKST(INDX)=BETB;/* GO TO BETWEEN BRACKETS  */ 01050000
         B     @RC00443                                            0445 01051000
@RF00443 LR    @11,INDX                                            0445 01052000
         MH    @11,@CH00337                                        0445 01053000
         SLR   @00,@00                                             0445 01054000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0445 01055000
*             END;                  /* END OF BRACKET STATE MANAGER  */ 01056000
@RC00443 DS    0H                                                  0446 01057000
@RF00442 DS    0H                                                  0446 01058000
@RC00438 DS    0H                                                  0447 01059000
*           IF $ASCII(INDX)=ON THEN /* IF ASCII, SET ALTERNATE CODE     01060000
*                                      BIT                   @ZD10887*/ 01061000
@RF00429 LR    @11,INDX                                            0447 01062000
         MH    @11,@CH00337                                        0447 01063000
         ALR   @11,WAPTR                                           0447 01064000
         TM    $ASCII-68(@11),B'00000100'                          0447 01065000
         BNO   @RF00447                                            0447 01066000
*             RPLCSI=ON;            /* ITS ASCII, SET BIT            */ 01067000
         OI    RPLCSI+16(RPLPTR),B'00001000'                       0448 01068000
*           $DVSNDOK(INDX)=OFF;     /* DONT SEND ANOTHER MSG         */ 01069000
@RF00447 LR    @11,INDX                                            0449 01070000
         MH    @11,@CH00337                                        0449 01071000
         ST    @11,@TF00001                                        0449 01072000
         ALR   @11,WAPTR                                           0449 01073000
         NI    $DVSNDOK-68(@11),B'11101111'                        0449 01074000
*           IF INCT^=0&BINFMTRM=BINHDXFF THEN/* IF ANSWER EXPECTED 0450 01075000
*                                      AND HALF- DUPLEX FF CHANGE  0450 01076000
*                                      DIRECTION             @AX11982*/ 01077000
         L     @11,@TF00001                                        0450 01078000
         L     @11,$CURELEM-68(@11,WAPTR)                          0450 01079000
         CLI   INCT(@11),0                                         0450 01080000
         BE    @RF00450                                            0450 01081000
         L     @11,@TF00001                                        0450 01082000
         LA    @11,$DEVSESP-68(@11,WAPTR)                          0450 01083000
         TM    BINFMTRM-1(@11),B'10000000'                         0450 01084000
         BNO   @RF00450                                            0450 01085000
         TM    BINFMTRM-1(@11),B'01000000'                         0450 01086000
         BNZ   @RF00450                                            0450 01087000
*             RPLCMD='1'B;                                         0451 01088000
         OI    RPLCMD+16(RPLPTR),B'00100000'                       0451 01089000
*           GEN REFS(RPLPTR,ARG,R6,R7);                            0452 01090000
@RF00450 DS    0H                                                  0452 01091000
 SEND RPL=(RPLPTR),ARG=(ARG),AREA=(R7),RECLEN=(R6),                    X01092000
               STYPE=REQ,CONTROL=DATA,POST=SCHED,CHAIN=ONLY,           X01093000
               OPTCD=(SYN,NFMHDR),RESPOND=(NEX,FME,NRRN)                01094000
*         END;                      /* END OF LU(RECORD) PROCESSING  */ 01095000
*       IF R15^=0 THEN              /* CHECK TO SEE THE I/O WENT O.K */ 01096000
@RC00416 LTR   R15,R15                                             0454 01097000
         BZ    @RF00454                                            0454 01098000
*         DO;                       /* BAD R.C., PROCESS             */ 01099000
*           CALL C16C0920;          /* IF ERROR, FREE STORAGE        */ 01100000
         BAL   @14,C16C0920                                        0456 01101000
*           GO TO C16C0266;         /* IF ERROR,GET OUT NOW          */ 01102000
         B     C16C0266                                            0457 01103000
*         END;                      /* END OF BAD R.C, PROCESSING    */ 01104000
*     END;                          /* END OF STARTING A NEW ELEMENT    01105000
*                                      OPERATION                     */ 01106000
@RF00454 DS    0H                                                  0460 01107000
*   IF $DEVLU(INDX)='1'B THEN       /* IF THIS IS AN LU, RECEIVE RESP*/ 01108000
@RF00411 LR    @11,INDX                                            0460 01109000
         MH    @11,@CH00337                                        0460 01110000
         ST    @11,@TF00001                                        0460 01111000
         ALR   @11,WAPTR                                           0460 01112000
         TM    $DEVLU-68(@11),B'00001000'                          0460 01113000
         BNO   @RF00460                                            0460 01114000
*     DO;                           /* LU, GET THE DATA              */ 01115000
*       RPLBUFL=$DVINCT(INDX);      /* POINT TO BUFFER TO READ INTO  */ 01116000
         L     @11,@TF00001                                        0462 01117000
         SLR   @00,@00                                             0462 01118000
         IC    @00,$DVINCT-68(@11,WAPTR)                           0462 01119000
         ST    @00,RPLBUFL(,RPLPTR)                                0462 01120000
*       RPLAREA=ADDR($TRMINPT);     /* LOCATION                      */ 01121000
         LA    @00,$TRMINPT(,WAPTR)                                0463 01122000
         ST    @00,RPLAREA(,RPLPTR)                                0463 01123000
*       GEN REFS(RPLPTR,ARG);                                      0464 01124000
 RECEIVE RPL=(RPLPTR),ARG=(ARG),EXIT=ISTCC016,                         X01125000
               OPTCD=(ASY,TRUNC,Q),RTYPE=(DFSYN,DFASY,RESP)             01126000
*       IF R15^=0 THEN              /* IF ERROR DURING RECEIVE       */ 01127000
         LTR   R15,R15                                             0465 01128000
         BZ    @RF00465                                            0465 01129000
*         CALL C16C0920;            /* ERROR, GET RID OF EVERYTHING  */ 01130000
         BAL   @14,C16C0920                                        0466 01131000
*     END;                          /* END OF LU RECEIVE FOR RESPONSE*/ 01132000
@RF00465 DS    0H                                                  0468 01133000
*C16C0266:                                                         0468 01134000
*   R14=R8;                         /* RESTORE REG 14                */ 01135000
@RF00460 DS    0H                                                  0468 01136000
C16C0266 LR    R14,R8                                              0468 01137000
*   END C16C0265;                   /* END OF ROUTINE TO START AN  0469 01138000
*                                      ELEMENT ON QUEUE              */ 01139000
@EL00003 DS    0H                                                  0469 01140000
@EF00003 DS    0H                                                  0469 01141000
@ER00003 BR    @14                                                 0469 01142000
*C16C0270:                                                         0470 01143000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0470 01144000
C16C0270 DS    0H                                                  0471 01145000
*   RESPECIFY                                                      0471 01146000
*     R5 RESTRICTED;                /* RESTRICT RETURN SAVE REGISTER */ 01147000
*   R5=R14;                         /* SAVE REG 14                   */ 01148000
         LR    R5,R14                                              0472 01149000
*   RESPECIFY                                                      0473 01150000
*    (R0,                                                          0473 01151000
*     R1) RESTRICTED;               /* DONT LET THESE REGISTERS GET     01152000
*                                      ALTRED                        */ 01153000
*   R0=RPLPTR->OUTCT+10;            /* GET LENGTH OF GETMAINED AREA  */ 01154000
         LA    R0,10                                               0474 01155000
         SLR   @11,@11                                             0474 01156000
         IC    @11,OUTCT(,RPLPTR)                                  0474 01157000
         ALR   R0,@11                                              0474 01158000
*   R1=RPLPTR;                      /* PTR TO AREA TO BE FREED       */ 01159000
         LR    R1,RPLPTR                                           0475 01160000
*/*VFRMAIN  SIZE((0))STORAGE((1))SUBPOOL(0)                          */ 01161000
*                                                                  0476 01162000
*   DO;                                                            0476 01163000
*     DO;                           /* CMZMREG (0,15) RESTRICT       */ 01164000
*       RFY                                                        0478 01165000
*        (GPR00P,                                                  0478 01166000
*         GPR15P) RSTD;                                            0478 01167000
*     END;                          /* CMZMREG PUT SUBPOOL PARM IN 0479 01168000
*                                      HIGH- ORDER BYTE OF REG 15    */ 01169000
*     GPR15F=0;                                                    0480 01170000
         SLR   GPR15F,GPR15F                                       0480 01171000
*     SLL(GPR15P,24);               /* COMBINE SUBPOOL AND SIZE IN 0481 01172000
*                                      REGISTER 0                    */ 01173000
         SLL   GPR15P,24                                           0481 01174000
*     GPR00P=GPR00P|GPR15P;                                        0482 01175000
         OR    GPR00P,GPR15P                                       0482 01176000
*     DO;                           /* CMZMREG (0,15) RELEASE        */ 01177000
*       RFY                                                        0484 01178000
*        (GPR00P,                                                  0484 01179000
*         GPR15P) UNRSTD;                                          0484 01180000
*     END;                          /* CMZMREG DECLARE AND RESTRICT     01181000
*                                      REG 1                         */ 01182000
*     DO;                           /* CMZMREG (1) RESTRICT          */ 01183000
*       RFY                                                        0487 01184000
*        (GPR01P) RSTD;                                            0487 01185000
*     END;                          /* CMZMREG INVOKE XREGSET MACRO     01186000
*                                      TO CHECK STORAGE PARM AND PUT    01187000
*                                      ADDR IN REGISTER 1            */ 01188000
*/*XREGSET  PID('STORAGE')PPARM((1))RREG(1,GPR01P)                   */ 01189000
*                                                                  0489 01190000
*     DO;                                                          0489 01191000
*                                                                  0489 01192000
*/*PARM ALREADY IN PROPER REGISTER                                   */ 01193000
*                                                                  0490 01194000
*     END;                          /* XREGSET INVOKE FREEMAIN MACRO */ 01195000
*     GEN;                                                         0491 01196000
         FREEMAIN R,LV=(0),A=(1)                                        01197000
*                                   /* UNRESTRICT REG 1              */ 01198000
*     DO;                           /* CMZMREG (1) RELEASE           */ 01199000
*       RFY                                                        0493 01200000
*        (GPR01P) UNRSTD;                                          0493 01201000
*     END;                          /* CMZMREG                       */ 01202000
*   END;                            /* VFRMAIN                       */ 01203000
*   RESPECIFY                                                      0496 01204000
*    (R0,                                                          0496 01205000
*     R1) UNRESTRICTED;             /* RELEASE THESE REGISTERS FOR 0496 01206000
*                                      USE                           */ 01207000
*   R14=R5;                         /* RESTORE REG 14                */ 01208000
         LR    R14,R5                                              0497 01209000
*   END C16C0270;                   /* END OF ROUTINE TO FREE ELEMENT   01210000
*                                      FROM QUEUE                    */ 01211000
@EL00004 DS    0H                                                  0498 01212000
@EF00004 DS    0H                                                  0498 01213000
@ER00004 BR    @14                                                 0498 01214000
*C16C0280:                                                         0499 01215000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0499 01216000
C16C0280 DS    0H                                                  0500 01217000
*   R5=R14;                         /* SAVE THE RETURN ADDRESS     0500 01218000
*                                                            @D32JPGH*/ 01219000
         LR    R5,R14                                              0500 01220000
*   RESPECIFY                                                      0501 01221000
*     LASTCHN BASED(PTR1);                                         0501 01222000
*   PTR1=ADDR($MSGOTSD(INDX));      /* PTR TO 1ST ELEMENT    @D32JPGH*/ 01223000
         LR    @11,INDX                                            0502 01224000
         MH    @11,@CH00337                                        0502 01225000
         LA    PTR1,$MSGOTSD-68(@11,WAPTR)                         0502 01226000
*   DO WHILE((PTR1->CHAIN&GATEBIT0)^=0);/* LOOP TILL LAST ELEMENT    */ 01227000
         B     @DE00503                                            0503 01228000
@DL00503 DS    0H                                                  0504 01229000
*     PTR1=PTR1->CHAIN;             /* ADDR OF NEXT ELEMENT  @D32JPGH*/ 01230000
         L     PTR1,CHAIN(,PTR1)                                   0504 01231000
*   END;                            /* END OF LOOP           @D32JPGH*/ 01232000
@DE00503 SLR   @11,@11                                             0505 01233000
         L     @00,CHAIN(,PTR1)                                    0505 01234000
         N     @00,@CF00650                                        0505 01235000
         CR    @00,@11                                             0505 01236000
         BNE   @DL00503                                            0505 01237000
*   PTR1->CHAIN=$CURELEM(INDX);     /* PUT PTR INTO LAST ELEMENT     */ 01238000
         LR    @10,INDX                                            0506 01239000
         MH    @10,@CH00337                                        0506 01240000
         L     @00,$CURELEM-68(@10,WAPTR)                          0506 01241000
         ST    @00,CHAIN(,PTR1)                                    0506 01242000
*   $CURELEM(INDX)=0;               /* SHOW NO CURRENT INDX          */ 01243000
         ST    @11,$CURELEM-68(@10,WAPTR)                          0507 01244000
*   R14=R5;                         /* RETURN TO THE CALLER  @D32JPGH*/ 01245000
         LR    R14,R5                                              0508 01246000
*   END C16C0280;                   /* END OF SUBROUTINE TO ADD    0509 01247000
*                                      ELEMENT TO QUE        @D32JPGH*/ 01248000
@EL00005 DS    0H                                                  0509 01249000
@EF00005 DS    0H                                                  0509 01250000
@ER00005 BR    @14                                                 0509 01251000
*C16C0900:                                                         0510 01252000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* MOVE DATA TO CALLER           */ 01253000
C16C0900 DS    0H                                                  0511 01254000
*   R5=R14;                         /* SAVE RETURN POINT             */ 01255000
         LR    R5,R14                                              0511 01256000
*   IF INADR^=0 THEN                /* BUFFER AVAILABLE              */ 01257000
         SLR   @11,@11                                             0512 01258000
         LR    @10,INDX                                            0512 01259000
         MH    @10,@CH00337                                        0512 01260000
         ST    @10,@TF00001                                        0512 01261000
         L     @10,$CURELEM-68(@10,WAPTR)                          0512 01262000
         C     @11,INADR(,@10)                                     0512 01263000
         BE    @RF00512                                            0512 01264000
*     DO;                           /* YES, PASSBACK DATA            */ 01265000
*       M=0;                                                       0514 01266000
         STH   @11,M                                               0514 01267000
*       I=1;                        /* INITIAL COUNTERS              */ 01268000
         MVC   I(2),@CH00072                                       0515 01269000
*       IF $DEVFRRS(INDX)='19'X|$DEVFRRS(INDX)='1C'X THEN/* 3270     */ 01270000
         LR    @11,WAPTR                                           0516 01271000
         AL    @11,@TF00001                                        0516 01272000
         CLI   $DEVFRRS-68(@11),X'19'                              0516 01273000
         BE    @RT00516                                            0516 01274000
         LR    @11,WAPTR                                           0516 01275000
         AL    @11,@TF00001                                        0516 01276000
         CLI   $DEVFRRS-68(@11),X'1C'                              0516 01277000
         BNE   @RF00516                                            0516 01278000
@RT00516 DS    0H                                                  0517 01279000
*         I=7;                      /* YES, SKIP CURSOR ADDR         */ 01280000
         MVC   I(2),@CH00215                                       0517 01281000
*       DO I=I TO LENGTH($TRMINPT); /* MOVE DATA BACK TO CALLER      */ 01282000
@RF00516 LH    @00,I                                               0518 01283000
         B     @DE00518                                            0518 01284000
@DL00518 DS    0H                                                  0519 01285000
*         IF $TRMINPT(I)>=' ' THEN  /* DATA                          */ 01286000
         LR    @11,@00                                             0519 01287000
         ALR   @11,WAPTR                                           0519 01288000
         CLI   $TRMINPT-1(@11),C' '                                0519 01289000
         BL    @RF00519                                            0519 01290000
*           DO;                     /* YES, PASS IT BACK             */ 01291000
*             M=M+1;                /* INCREASE BYTES PASSED         */ 01292000
         LA    @11,1                                               0521 01293000
         AH    @11,M                                               0521 01294000
         STH   @11,M                                               0521 01295000
*             CARRAY(M)=$TRMINPT(I)|' ';/* MOVE DATA, PUT IN UPPER 0522 01296000
*                                      CASE                          */ 01297000
         LR    @10,INDX                                            0522 01298000
         MH    @10,@CH00337                                        0522 01299000
         L     @10,$CURELEM-68(@10,WAPTR)                          0522 01300000
         ST    @10,@TF00001                                        0522 01301000
         L     @10,INADR(,@10)                                     0522 01302000
         ALR   @10,@11                                             0522 01303000
         BCTR  @10,0                                               0522 01304000
         LR    @11,@00                                             0522 01305000
         ALR   @11,WAPTR                                           0522 01306000
         MVC   CARRAY(1,@10),$TRMINPT-1(@11)                       0522 01307000
         OI    CARRAY(@10),C' '                                    0522 01308000
*             IF M=INCT THEN        /* MORE ROOM IN THE BUFFER       */ 01309000
         LH    @11,M                                               0523 01310000
         L     @10,@TF00001                                        0523 01311000
         SLR   @00,@00                                             0523 01312000
         IC    @00,INCT(,@10)                                      0523 01313000
         CR    @11,@00                                             0523 01314000
         BE    @RT00523                                            0523 01315000
*               GO TO C16C0905;     /* NO, LEAVE                     */ 01316000
*           END;                    /* END, OF PASS BACK DATA        */ 01317000
*         ELSE                      /* NOT DATA, CONTROL INFO        */ 01318000
*           IF $TRMINPT(I)='11'X THEN/* 3270, IS IT A SBA CHARACTER  */ 01319000
         B     @RC00519                                            0526 01320000
@RF00519 LH    @11,I                                               0526 01321000
         ALR   @11,WAPTR                                           0526 01322000
         CLI   $TRMINPT-1(@11),X'11'                               0526 01323000
         BNE   @RF00526                                            0526 01324000
*             I=I+2;                /* YES, SKIP ADDR CHARACTERS     */ 01325000
         LH    @11,I                                               0527 01326000
         LA    @11,2(,@11)                                         0527 01327000
         STH   @11,I                                               0527 01328000
*       END;                        /* END OF MOVING BACK DATA       */ 01329000
@RF00526 DS    0H                                                  0528 01330000
@RC00519 LA    @00,1                                               0528 01331000
         AH    @00,I                                               0528 01332000
         STH   @00,I                                               0528 01333000
@DE00518 C     @00,@CF00048                                        0528 01334000
         BNH   @DL00518                                            0528 01335000
*C16C0905:                                                         0529 01336000
*       MSGCOUNT=M;                 /* RETURN COUNT                  */ 01337000
C16C0905 LR    @11,INDX                                            0529 01338000
         MH    @11,@CH00337                                        0529 01339000
         L     @11,$CURELEM-68(@11,WAPTR)                          0529 01340000
         L     @11,INADR(,@11)                                     0529 01341000
         LH    @00,M                                               0529 01342000
         BCTR  @11,0                                               0529 01343000
         STC   @00,MSGCOUNT(,@11)                                  0529 01344000
*       IF $ALTPRTR=ON THEN         /* IF AP PRESENT                 */ 01345000
         TM    $ALTPRTR(WAPTR),B'00000010'                         0530 01346000
         BNO   @RF00530                                            0530 01347000
*         $TWOWAY=ON;               /* PUT REPLY THERE               */ 01348000
         OI    $TWOWAY(WAPTR),B'01000000'                          0531 01349000
*       $POSTFLG=OFF;               /* RESET WAITING FLAG            */ 01350000
@RF00530 NI    $POSTFLG(WAPTR),B'10111111'                         0532 01351000
*       R1=ADDR($TLTECB2);          /* POINT TO THE ECB TO POST      */ 01352000
         L     R1,RCAPTR(,WAPTR)                                   0533 01353000
         LA    R1,$TLTECB2(,R1)                                    0533 01354000
*       CALL I00C1001;              /* POST THE ECB                  */ 01355000
         L     @15,@CV01962                                        0534 01356000
         BALR  @14,@15                                             0534 01357000
*     END;                          /* END USE OF BUFFER TRMINPT     */ 01358000
*   $TRMINPT=$TRMINPT&&$TRMINPT;                                   0536 01359000
@RF00512 XC    $TRMINPT(80,WAPTR),$TRMINPT(WAPTR)                  0536 01360000
*   $DVINCT(1)=LENGTH($TRMINPT);                                   0537 01361000
         MVI   $DVINCT(WAPTR),X'50'                                0537 01362000
*   R14=R5;                         /* RESTORE RETURN POINTER        */ 01363000
         LR    R14,R5                                              0538 01364000
*   END C16C0900;                                                  0539 01365000
@EL00006 DS    0H                                                  0539 01366000
@EF00006 DS    0H                                                  0539 01367000
@ER00006 BR    @14                                                 0539 01368000
*C16C0910:                                                         0540 01369000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0540 01370000
C16C0910 DS    0H                                                  0541 01371000
*   R7=R14;                         /* SAVE RETURN POINT             */ 01372000
         LR    R7,R14                                              0541 01373000
*   RPLPTR=$CURELEM(INDX);          /* POINT TO ELEMENT BEING      0542 01374000
*                                      PROCESSED                     */ 01375000
         LR    @11,INDX                                            0542 01376000
         MH    @11,@CH00337                                        0542 01377000
         L     RPLPTR,$CURELEM-68(@11,WAPTR)                       0542 01378000
*   $CURELEM(INDX)=0;               /* ZERO OUT CURRENT ELEMENT    0543 01379000
*                                      POINTER                       */ 01380000
         SLR   @10,@10                                             0543 01381000
         ST    @10,$CURELEM-68(@11,WAPTR)                          0543 01382000
*   IF RPLPTR^=0 THEN               /* ONLY CALL IF THERE IS AN    0544 01383000
*                                      ELEMENT TO FREE               */ 01384000
         CR    RPLPTR,@10                                          0544 01385000
         BE    @RF00544                                            0544 01386000
*     CALL C16C0270;                /* FREE THE ELEMENT              */ 01387000
         BAL   @14,C16C0270                                        0545 01388000
*   R14=R7;                         /* RESTORE THE RETURN POINT      */ 01389000
@RF00544 LR    R14,R7                                              0546 01390000
*   END C16C0910;                   /* END OF ROUTINE TO FREE CURRENT   01391000
*                                      ELEMENT                       */ 01392000
@EL00007 DS    0H                                                  0547 01393000
@EF00007 DS    0H                                                  0547 01394000
@ER00007 BR    @14                                                 0547 01395000
*C16C0920:                                                         0548 01396000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0548 01397000
C16C0920 DS    0H                                                  0549 01398000
*   R6=R14;                         /* SAVE THE RETURN POINT         */ 01399000
         LR    R6,R14                                              0549 01400000
*   IF $ALTPRTR=ON&                 /* IF THERE IS AN AP             */ 01401000
*       INDX=AP                     /* AND THIS IS A TEST TERMINAL   */ 01402000
*     THEN                                                         0550 01403000
         TM    $ALTPRTR(WAPTR),B'00000010'                         0550 01404000
         BNO   @RF00550                                            0550 01405000
         C     INDX,@CF00139                                       0550 01406000
         BNE   @RF00550                                            0550 01407000
*     $ALTPRTR=OFF;                 /* DITCH THE AP                  */ 01408000
         NI    $ALTPRTR(WAPTR),B'11111101'                         0551 01409000
*   ELSE                            /* THE ERROR WAS ON THE CT       */ 01410000
*     DO;                                                          0552 01411000
         B     @RC00550                                            0552 01412000
@RF00550 DS    0H                                                  0553 01413000
*       IF $RPLERR=0 THEN                                          0553 01414000
         L     @00,$RPLERR-1(,WAPTR)                               0553 01415000
         ICM   @00,8,@CB01486                                      0553 01416000
         LTR   @00,@00                                             0553 01417000
         BNZ   @RF00553                                            0553 01418000
*         $RPLERR=RPLFDBK;          /* SET FIRST ERROR FEEDBACK      */ 01419000
         MVC   $RPLERR(3,WAPTR),RPLFDBK(RPLPTR)                    0554 01420000
*       $CANCEL=ON;                 /* CANCEL THIS LOGON             */ 01421000
@RF00553 OI    $CANCEL(WAPTR),B'00000010'                          0555 01422000
*       $CTERROR=ON;                /* CANCEL BECAUSE OF CT ERR      */ 01423000
         OI    $CTERROR(WAPTR),B'01000000'                         0556 01424000
*       $POSTFLG=OFF;               /* STOP WAITING FOR DATA         */ 01425000
         NI    $POSTFLG(WAPTR),B'10111111'                         0557 01426000
*     END;                                                         0558 01427000
*   CALL C16C0910;                  /* FREE THE CURRENT ELEMENT      */ 01428000
@RC00550 BAL   @14,C16C0910                                        0559 01429000
*   R14=R6;                         /* RESTORE THE RETURN POINT      */ 01430000
         LR    R14,R6                                              0560 01431000
*   END C16C0920;                   /* END OF SETTING ERROR STATUS   */ 01432000
@EL00008 DS    0H                                                  0561 01433000
@EF00008 DS    0H                                                  0561 01434000
@ER00008 BR    @14                                                 0561 01435000
@PB00008 DS    0H                                                  0562 01436000
*   DO;                             /* TPEPILOG                      */ 01437000
*     GEN(PRINT OFF);                                              0563 01438000
         PRINT OFF                                                      01439000
*     DO;                                                          0564 01440000
*       DCL                                                        0565 01441000
*         GPR00F FIXED(31) REG(00),                                0565 01442000
*         GPR00P PTR(31) REG(00),                                  0565 01443000
*         GPR01F FIXED(31) REG(01),                                0565 01444000
*         GPR01P PTR(31) REG(01),                                  0565 01445000
*         GPR02F FIXED(31) REG(02),                                0565 01446000
*         GPR02P PTR(31) REG(02),                                  0565 01447000
*         GPR03F FIXED(31) REG(03),                                0565 01448000
*         GPR03P PTR(31) REG(03),                                  0565 01449000
*         GPR04F FIXED(31) REG(04),                                0565 01450000
*         GPR04P PTR(31) REG(04),                                  0565 01451000
*         GPR05F FIXED(31) REG(05),                                0565 01452000
*         GPR05P PTR(31) REG(05),                                  0565 01453000
*         GPR06F FIXED(31) REG(06),                                0565 01454000
*         GPR06P PTR(31) REG(06),                                  0565 01455000
*         GPR07F FIXED(31) REG(07),                                0565 01456000
*         GPR07P PTR(31) REG(07),                                  0565 01457000
*         GPR08F FIXED(31) REG(08),                                0565 01458000
*         GPR08P PTR(31) REG(08),                                  0565 01459000
*         GPR09F FIXED(31) REG(09),                                0565 01460000
*         GPR09P PTR(31) REG(09),                                  0565 01461000
*         GPR10F FIXED(31) REG(10),                                0565 01462000
*         GPR10P PTR(31) REG(10),                                  0565 01463000
*         GPR11F FIXED(31) REG(11),                                0565 01464000
*         GPR11P PTR(31) REG(11),                                  0565 01465000
*         GPR12F FIXED(31) REG(12),                                0565 01466000
*         GPR12P PTR(31) REG(12),                                  0565 01467000
*         GPR13F FIXED(31) REG(13),                                0565 01468000
*         GPR13P PTR(31) REG(13),                                  0565 01469000
*         GPR14F FIXED(31) REG(14),                                0565 01470000
*         GPR14P PTR(31) REG(14),                                  0565 01471000
*         GPR15F FIXED(31) REG(15),                                0565 01472000
*         GPR15P PTR(31) REG(15);                                  0565 01473000
*     END;                                                         0566 01474000
*     GEN(PRINT ON);                                               0567 01475000
         PRINT ON                                                       01476000
*   END;                            /* TPEPILOG                      */ 01477000
*   DO;                             /* ATDSPLY                       */ 01478000
*   END;                            /* ATDSPLY                       */ 01479000
*   END ISTCC016                                                   0571 01480000
*                                                                  0571 01481000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01482000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 01483000
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                       */ 01484000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 01485000
*                                                                  0571 01486000
*       ;                                                          0571 01487000
         B     @EL00001                                            0571 01488000
@DATA    DS    0H                                                       01489000
@CH00215 DC    H'7'                                                     01490000
@CH00337 DC    H'68'                                                    01491000
@DATD    DSECT                                                          01492000
         DS    0F                                                       01493000
@TF00001 DS    F                                                        01494000
ISTCC016 CSECT                                                          01495000
         DS    0F                                                       01496000
@CF00072 DC    F'1'                                                     01497000
@CH00072 EQU   @CF00072+2                                               01498000
@CF00139 DC    F'2'                                                     01499000
@CF00068 DC    F'4'                                                     01500000
@CF00054 DC    F'8'                                                     01501000
@CF00048 DC    F'80'                                                    01502000
@CF00083 DC    F'256'                                                   01503000
@CF00650 DC    XL4'7FFFFFFF'                                            01504000
@CF00652 DC    XL4'80000000'                                            01505000
@CF02031 DC    XL4'0000FFFF'                                            01506000
@DATD    DSECT                                                          01507000
         DS    0D                                                       01508000
RPLSAVE  DS    A                                                        01509000
I        DS    H                                                        01510000
M        DS    H                                                        01511000
N        DS    H                                                        01512000
SCRATCH  DS    CL1                                                      01513000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01514000
@ENDDATD EQU   *                                                        01515000
ISTCC016 CSECT                                                          01516000
         DS    0F                                                       01517000
@SIZDATD DC    AL1(0)                                                   01518000
         DC    AL3(@ENDDATD-@DATD)                                      01519000
@CV01962 DC    V(I00C1001)                                              01520000
         DS    0D                                                       01521000
C16EXSAV DC    F'0'                                                     01522000
BASE     DC    AL4(ISTCC016)                                            01523000
@CB01933 DC    X'0201'                                                  01524000
@CB01937 DC    X'1001'                                                  01525000
@CB01939 DC    X'0819'                                                  01526000
@CB01940 DC    X'1007'                                                  01527000
@CB01941 DC    X'1008'                                                  01528000
@CB01486 DC    X'00'                                                    01529000
         DS    CL1                                                      01530000
C16CBUF1 DC    CL52' '                                                  01531000
C16CBUF2 DC    CL52' '                                                  01532000
SAVEA    DC    18F'0'                                                   01533000
PATCH    DC    25F'0'                                                   01534000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01535000
@01      EQU   01                                                       01536000
@02      EQU   02                                                       01537000
@03      EQU   03                                                       01538000
@04      EQU   04                                                       01539000
@05      EQU   05                                                       01540000
@06      EQU   06                                                       01541000
@07      EQU   07                                                       01542000
@08      EQU   08                                                       01543000
@09      EQU   09                                                       01544000
@10      EQU   10                                                       01545000
@11      EQU   11                                                       01546000
@12      EQU   12                                                       01547000
@13      EQU   13                                                       01548000
@14      EQU   14                                                       01549000
@15      EQU   15                                                       01550000
WAPTR    EQU   @02                                                      01551000
RPLPTR   EQU   @04                                                      01552000
RPHPTR   EQU   @01                                                      01553000
R1       EQU   @01                                                      01554000
R14      EQU   @14                                                      01555000
R15      EQU   @15                                                      01556000
R0       EQU   @00                                                      01557000
R13      EQU   @13                                                      01558000
R5       EQU   @05                                                      01559000
R8       EQU   @08                                                      01560000
R6       EQU   @06                                                      01561000
R7       EQU   @07                                                      01562000
R9       EQU   @09                                                      01563000
R12      EQU   @12                                                      01564000
PTR2     EQU   @15                                                      01565000
PTR1     EQU   @01                                                      01566000
INDX     EQU   @03                                                      01567000
ARG      EQU   @05                                                      01568000
GPR00P   EQU   @00                                                      01569000
GPR15P   EQU   @15                                                      01570000
GPR15F   EQU   @15                                                      01571000
GPR01P   EQU   @01                                                      01572000
GPR00F   EQU   @00                                                      01573000
GPR01F   EQU   @01                                                      01574000
GPR02F   EQU   @02                                                      01575000
GPR02P   EQU   @02                                                      01576000
GPR03F   EQU   @03                                                      01577000
GPR03P   EQU   @03                                                      01578000
GPR04F   EQU   @04                                                      01579000
GPR04P   EQU   @04                                                      01580000
GPR05F   EQU   @05                                                      01581000
GPR05P   EQU   @05                                                      01582000
GPR06F   EQU   @06                                                      01583000
GPR06P   EQU   @06                                                      01584000
GPR07F   EQU   @07                                                      01585000
GPR07P   EQU   @07                                                      01586000
GPR08F   EQU   @08                                                      01587000
GPR08P   EQU   @08                                                      01588000
GPR09F   EQU   @09                                                      01589000
GPR09P   EQU   @09                                                      01590000
GPR10F   EQU   @10                                                      01591000
GPR10P   EQU   @10                                                      01592000
GPR11F   EQU   @11                                                      01593000
GPR11P   EQU   @11                                                      01594000
GPR12F   EQU   @12                                                      01595000
GPR12P   EQU   @12                                                      01596000
GPR13F   EQU   @13                                                      01597000
GPR13P   EQU   @13                                                      01598000
GPR14F   EQU   @14                                                      01599000
GPR14P   EQU   @14                                                      01600000
         ENTRY C16C1000                                                 01601000
ATCLCPTR EQU   1032                                                     01602000
$RCAAREA EQU   0                                                        01603000
$POINTER EQU   $RCAAREA+100                                             01604000
$TLTECB2 EQU   $POINTER+28                                              01605000
$TRTBLA  EQU   $POINTER+124                                             01606000
$CONSTNT EQU   $RCAAREA+244                                             01607000
$RCAFLG  EQU   $RCAAREA+604                                             01608000
$TRASCII EQU   $RCAAREA+608                                             01609000
$EXITSAV EQU   $RCAAREA+864                                             01610000
TOLTEPWA EQU   0                                                        01611000
$SCTTBLE EQU   TOLTEPWA                                                 01612000
$TESTOPT EQU   $SCTTBLE+2                                               01613000
$ERROPT  EQU   $SCTTBLE+3                                               01614000
$PDEVFLG EQU   $SCTTBLE+10                                              01615000
$CDSFLGS EQU   $SCTTBLE+11                                              01616000
$CDS8T19 EQU   $SCTTBLE+20                                              01617000
$EXECFLG EQU   $SCTTBLE+33                                              01618000
$OLTFLGS EQU   $SCTTBLE+36                                              01619000
$OLTFLG2 EQU   $SCTTBLE+37                                              01620000
$TOTFLG1 EQU   $SCTTBLE+38                                              01621000
$CTEQTT  EQU   $TOTFLG1                                                 01622000
$ROUTMSK EQU   $SCTTBLE+40                                              01623000
$CDA     EQU   TOLTEPWA+100                                             01624000
$RCA     EQU   $CDA+44                                                  01625000
$OLTPTR  EQU   $CDA+52                                                  01626000
$HIMOREC EQU   $CDA+60                                                  01627000
$COMMFLG EQU   TOLTEPWA+224                                             01628000
$FLAG3   EQU   $COMMFLG+2                                               01629000
$ALTPRTR EQU   $FLAG3                                                   01630000
$FLAG4   EQU   $COMMFLG+3                                               01631000
$FLAG5   EQU   $COMMFLG+4                                               01632000
$EOJ     EQU   $FLAG5                                                   01633000
$CANCEL  EQU   $EOJ                                                     01634000
$FLAG6   EQU   $COMMFLG+5                                               01635000
$CTERROR EQU   $FLAG6                                                   01636000
$ABNDBIT EQU   $FLAG6                                                   01637000
$CIREQ   EQU   $FLAG6                                                   01638000
$FLAG7   EQU   $COMMFLG+6                                               01639000
$EXIOWAT EQU   $FLAG7                                                   01640000
$SNDRFLG EQU   $FLAG7                                                   01641000
$FLAG8   EQU   $COMMFLG+7                                               01642000
$TWOWAY  EQU   $FLAG8                                                   01643000
$FLAG12  EQU   $COMMFLG+11                                              01644000
$POSTFLG EQU   $FLAG12                                                  01645000
$DEVTBLE EQU   TOLTEPWA+240                                             01646000
$DEVCDS  EQU   $DEVTBLE                                                 01647000
$DEVUNAD EQU   $DEVCDS                                                  01648000
@NM00043 EQU   $DEVUNAD+2                                               01649000
$DEVFEAT EQU   $DEVCDS+4                                                01650000
$DEVFRRS EQU   $DEVFEAT+1                                               01651000
$DEVCDSF EQU   $DEVCDS+9                                                01652000
$DEVSDCF EQU   $DEVCDS+10                                               01653000
$$SYMNME EQU   $DEVCDS+12                                               01654000
$MSGOTSD EQU   $$SYMNME                                                 01655000
$CURELEM EQU   $$SYMNME+4                                               01656000
$DEVFLG1 EQU   $DEVTBLE+20                                              01657000
$EVNCPLT EQU   $DEVFLG1                                                 01658000
$ATTNEXP EQU   $DEVFLG1                                                 01659000
$INTOCC  EQU   $DEVFLG1                                                 01660000
$DVCTBYT EQU   $INTOCC                                                  01661000
$DEVFLG2 EQU   $DEVTBLE+21                                              01662000
$DEVTECB EQU   $DEVTBLE+22                                              01663000
$OPIS    EQU   $DEVTECB                                                 01664000
$DVSEQNO EQU   $OPIS                                                    01665000
$OPND    EQU   $DEVTECB+2                                               01666000
$DVBRKSN EQU   $OPND                                                    01667000
$DVBRKST EQU   $OPND+1                                                  01668000
$DVINCT  EQU   $DEVTBLE+26                                              01669000
$DEVFLG3 EQU   $DEVTBLE+27                                              01670000
$SIOFLG  EQU   $DEVFLG3                                                 01671000
$DVSNDOK EQU   $SIOFLG                                                  01672000
$IFTOUT  EQU   $DEVTBLE+36                                              01673000
$DEVSESP EQU   $IFTOUT                                                  01674000
$SSCPDAF EQU   $IFTOUT+6                                                01675000
$LDNCBPT EQU   $DEVTBLE+48                                              01676000
$CID     EQU   $DEVTBLE+52                                              01677000
$RNINFO  EQU   $DEVTBLE+56                                              01678000
$DEVFLG5 EQU   $RNINFO+8                                                01679000
$DEVLU   EQU   $DEVFLG5                                                 01680000
$ASCII   EQU   $DEVFLG5                                                 01681000
$DEVFLG4 EQU   $DEVTBLE+65                                              01682000
$TLTRPL1 EQU   TOLTEPWA+1616                                            01683000
$TLTRPL2 EQU   TOLTEPWA+1736                                            01684000
$TRMINPT EQU   TOLTEPWA+2184                                            01685000
#EXITA   EQU   TOLTEPWA+2632                                            01686000
$RETREG  EQU   TOLTEPWA+2636                                            01687000
$CCOMDAT EQU   TOLTEPWA+2644                                            01688000
$CFLGS   EQU   $CCOMDAT+16                                              01689000
$24FEMSG EQU   TOLTEPWA+2681                                            01690000
$24CATMG EQU   $24FEMSG+11                                              01691000
@NM00051 EQU   TOLTEPWA+2776                                            01692000
$OUNTPTR EQU   @NM00051+4                                               01693000
$NSPTR   EQU   $OUNTPTR                                                 01694000
$NSCNT   EQU   @NM00051+10                                              01695000
$ENXX    EQU   @NM00051+15                                              01696000
$IMITX   EQU   $ENXX                                                    01697000
$RPLERR  EQU   TOLTEPWA+2977                                            01698000
SVESC033 EQU   TOLTEPWA+3160                                            01699000
SVECC013 EQU   TOLTEPWA+3232                                            01700000
SVEIC003 EQU   TOLTEPWA+3592                                            01701000
SVESC022 EQU   TOLTEPWA+3736                                            01702000
SVECC011 EQU   TOLTEPWA+4024                                            01703000
IFGRPL   EQU   0                                                        01704000
RPLCOMN  EQU   IFGRPL                                                   01705000
RPLIDWD  EQU   RPLCOMN                                                  01706000
RPLREQ   EQU   RPLIDWD+2                                                01707000
RPLLEN   EQU   RPLIDWD+3                                                01708000
RPLECB   EQU   RPLCOMN+8                                                01709000
RPLEXITP EQU   RPLECB                                                   01710000
RPLFDBWD EQU   RPLCOMN+12                                               01711000
RPLFDBK  EQU   RPLFDBWD+1                                               01712000
RPLRTNCD EQU   RPLFDBK                                                  01713000
RPLCNDCD EQU   RPLFDBK+1                                                01714000
RPLCMPON EQU   RPLCNDCD                                                 01715000
RPLFDB2  EQU   RPLCMPON                                                 01716000
RPLERRCD EQU   RPLCNDCD+1                                               01717000
RPLFDB3  EQU   RPLERRCD                                                 01718000
RPLREOT  EQU   RPLFDB3                                                  01719000
RPLKEYLE EQU   RPLCOMN+16                                               01720000
RPLAREA  EQU   RPLCOMN+32                                               01721000
RPLARG   EQU   RPLCOMN+36                                               01722000
RPLOPTCD EQU   RPLCOMN+40                                               01723000
RPLOPT1  EQU   RPLOPTCD                                                 01724000
RPLECBSW EQU   RPLOPT1                                                  01725000
RPLOPT2  EQU   RPLOPTCD+1                                               01726000
RPLADR   EQU   RPLOPT2                                                  01727000
RPLOPT3  EQU   RPLOPTCD+2                                               01728000
RPLOPT4  EQU   RPLOPTCD+3                                               01729000
RPLNXTRP EQU   RPLCOMN+44                                               01730000
RPLRLEN  EQU   RPLCOMN+48                                               01731000
RPLBUFL  EQU   RPLCOMN+52                                               01732000
RPLOPTC2 EQU   RPLCOMN+56                                               01733000
RPLOPT5  EQU   RPLOPTC2                                                 01734000
RPLWRTYP EQU   RPLOPT5                                                  01735000
RPLOPT6  EQU   RPLOPTC2+1                                               01736000
RPLUNTYP EQU   RPLOPT6                                                  01737000
RPLOPT7  EQU   RPLOPTC2+2                                               01738000
RPLCNOPT EQU   RPLOPT7                                                  01739000
RPLOPT8  EQU   RPLOPTC2+3                                               01740000
RPLRBAR  EQU   RPLCOMN+60                                               01741000
RPLAIXID EQU   RPLRBAR+2                                                01742000
RPLEXTDS EQU   RPLCOMN+68                                               01743000
RPLEXTD1 EQU   RPLEXTDS                                                 01744000
RPLVTEXT EQU   IFGRPL+76                                                01745000
RPLAARLN EQU   RPLVTEXT+4                                               01746000
RPLFDBK2 EQU   RPLVTEXT+12                                              01747000
RPLSSNSI EQU   RPLFDBK2                                                 01748000
RPLDSB   EQU   RPLSSNSI                                                 01749000
RPLDSB1  EQU   RPLDSB                                                   01750000
RPLSSEI  EQU   RPLDSB1                                                  01751000
RPLDSB2  EQU   RPLDSB+1                                                 01752000
RPLSSMI  EQU   RPLDSB2                                                  01753000
RPLUSNSI EQU   RPLFDBK2+2                                               01754000
RPLUSFLD EQU   RPLVTEXT+16                                              01755000
RPLOPTC3 EQU   RPLVTEXT+20                                              01756000
RPLOPT9  EQU   RPLOPTC3                                                 01757000
RPLOPT10 EQU   RPLOPTC3+1                                               01758000
RPLOPT11 EQU   RPLOPTC3+2                                               01759000
RPLOPT12 EQU   RPLOPTC3+3                                               01760000
RPLFMHDR EQU   RPLOPT12                                                 01761000
RPLOSENS EQU   RPLVTEXT+24                                              01762000
RPLSSNSO EQU   RPLOSENS                                                 01763000
RPLSSEO  EQU   RPLSSNSO                                                 01764000
ISTAVT   EQU   0                                                        01765000
ISTRETRG EQU   ISTAVT+44                                                01766000
ISTLOK   EQU   0                                                        01767000
LOKCHN   EQU   ISTLOK+1                                                 01768000
LOKCHNG  EQU   LOKCHN                                                   01769000
@NM00055 EQU   LOKCHNG+2                                                01770000
ISTPAB   EQU   0                                                        01771000
PABWQCHN EQU   ISTPAB                                                   01772000
PABWEQA  EQU   PABWQCHN                                                 01773000
PABCHAIN EQU   PABWQCHN+4                                               01774000
PABRUNNG EQU   PABCHAIN                                                 01775000
PABRPHFG EQU   ISTPAB+12                                                01776000
PABFLAGS EQU   PABRPHFG                                                 01777000
PABERLCK EQU   PABFLAGS                                                 01778000
PABERRLK EQU   PABERLCK                                                 01779000
PABEND   EQU   ISTPAB+16                                                01780000
ISTDYPAB EQU   0                                                        01781000
DYPCHAIN EQU   ISTDYPAB+4                                               01782000
DYPPACMD EQU   ISTDYPAB+12                                              01783000
ISTRPH   EQU   0                                                        01784000
RPHCNTL  EQU   ISTRPH                                                   01785000
RPHFLAGS EQU   RPHCNTL+2                                                01786000
RPHFSTLC EQU   RPHFLAGS                                                 01787000
RPHFLGB  EQU   RPHCNTL+3                                                01788000
RPHRPHA  EQU   ISTRPH+4                                                 01789000
RPHTSKID EQU   ISTRPH+8                                                 01790000
RPHRESMA EQU   ISTRPH+16                                                01791000
RPHWPFLG EQU   RPHRESMA                                                 01792000
RPHWEA   EQU   ISTRPH+24                                                01793000
RPHCSPA  EQU   RPHWEA                                                   01794000
RPHSRPRM EQU   ISTRPH+28                                                01795000
RPHPABQA EQU   ISTRPH+36                                                01796000
RPHWORK  EQU   ISTRPH+40                                                01797000
RPHSAVE1 EQU   RPHWORK                                                  01798000
RPHSBITS EQU   RPHSAVE1+1                                               01799000
ISTATCVT EQU   0                                                        01800000
ATCRPTCH EQU   ISTATCVT                                                 01801000
ATCITFLD EQU   ISTATCVT+8                                               01802000
ATCITCDS EQU   ATCITFLD+8                                               01803000
ATCITFLG EQU   ATCITCDS+4                                               01804000
ATCITRA1 EQU   ATCITFLG+2                                               01805000
ATCSMPAB EQU   ISTATCVT+88                                              01806000
ATCVDPAB EQU   ISTATCVT+152                                             01807000
ATCLDTIL EQU   ISTATCVT+408                                             01808000
ATCGTSTR EQU   ISTATCVT+608                                             01809000
ATCLUDVT EQU   ISTATCVT+768                                             01810000
ATCANYDT EQU   ISTATCVT+776                                             01811000
@NM00065 EQU   ISTATCVT+780                                             01812000
ATCPODVT EQU   ISTATCVT+804                                             01813000
ATCSTAT  EQU   ISTATCVT+936                                             01814000
ATCSTAT1 EQU   ATCSTAT                                                  01815000
ATCPOFLG EQU   ATCSTAT+2                                                01816000
ATCSTAT4 EQU   ATCSTAT+3                                                01817000
ATCBITAN EQU   ISTATCVT+940                                             01818000
ATCFLAG2 EQU   ATCBITAN+1                                               01819000
ATCONID  EQU   ISTATCVT+944                                             01820000
ATCSSCPA EQU   ISTATCVT+948                                             01821000
ATCHPGM  EQU   ISTATCVT+1012                                            01822000
ATCVLCNT EQU   ISTATCVT+1016                                            01823000
ATCRNO   EQU   ISTATCVT+1020                                            01824000
@NM00088 EQU   ISTATCVT+1028                                            01825000
ATCSHRFG EQU   @NM00088+8                                               01826000
ATCCPDVT EQU   ISTATCVT+1096                                            01827000
ATCSMSDQ EQU   ISTATCVT+1140                                            01828000
ATCRID   EQU   ISTATCVT+1152                                            01829000
ATCLDAPP EQU   ISTATCVT+1288                                            01830000
ATCSQAFR EQU   ISTATCVT+1312                                            01831000
ATCORTCB EQU   ATCSQAFR+4                                               01832000
ATCORSRB EQU   ATCORTCB                                                 01833000
ATCICAPP EQU   ISTATCVT+1320                                            01834000
ATCDAPVT EQU   ISTATCVT+1340                                            01835000
ATCGSRBQ EQU   ISTATCVT+1472                                            01836000
ATCGSRBG EQU   ATCGSRBQ                                                 01837000
ATCENFLG EQU   ISTATCVT+1512                                            01838000
@NM00103 EQU   ISTATCVT+1575                                            01839000
ATCVTFLG EQU   ISTATCVT+1576                                            01840000
ATCZFLAG EQU   ISTATCVT+1696                                            01841000
ATCCRA   EQU   ISTATCVT+1720                                            01842000
ATCCRACN EQU   ATCCRA+4                                                 01843000
ATCSRB   EQU   ISTATCVT+1728                                            01844000
ATCSRBCN EQU   ATCSRB+4                                                 01845000
ATCCRPL  EQU   ISTATCVT+1736                                            01846000
ATCRPLCN EQU   ATCCRPL+4                                                01847000
ISTTIE   EQU   0                                                        01848000
TIETIEA  EQU   ISTTIE+4                                                 01849000
TIESNA   EQU   ISTTIE+8                                                 01850000
TIERPHA  EQU   ISTTIE+12                                                01851000
ISTBIND  EQU   0                                                        01852000
BINFMTY  EQU   ISTBIND                                                  01853000
BINPRIP  EQU   ISTBIND+3                                                01854000
BINSECP  EQU   ISTBIND+4                                                01855000
BINCMNP  EQU   ISTBIND+5                                                01856000
BINBRAK  EQU   BINCMNP                                                  01857000
BINBKTR  EQU   BINCMNP                                                  01858000
BINCMNP2 EQU   ISTBIND+6                                                01859000
BINFMTRM EQU   BINCMNP2                                                 01860000
BINTSU   EQU   ISTBIND+7                                                01861000
BINAPACE EQU   BINTSU                                                   01862000
BINRPACE EQU   BINTSU+1                                                 01863000
BINRUSZ  EQU   BINTSU+2                                                 01864000
BINSRUSZ EQU   BINRUSZ                                                  01865000
BINPRUSZ EQU   BINRUSZ+1                                                01866000
BINSPACE EQU   BINTSU+4                                                 01867000
BINBPACE EQU   BINTSU+5                                                 01868000
BINPRSVC EQU   ISTBIND+13                                               01869000
BINLUP   EQU   BINPRSVC                                                 01870000
BINPSCHR EQU   BINPRSVC+1                                               01871000
BINCRYPT EQU   ISTBIND+25                                               01872000
BINCRYRL EQU   0                                                        01873000
BINCRCTL EQU   BINCRYRL                                                 01874000
BINCRPFL EQU   BINCRYRL+1                                               01875000
BINPNAU  EQU   0                                                        01876000
BINAUNML EQU   BINPNAU                                                  01877000
BINAUNM  EQU   BINPNAU+1                                                01878000
BINUSEDT EQU   0                                                        01879000
BINUSDTL EQU   BINUSEDT                                                 01880000
BINUSDTA EQU   BINUSEDT+1                                               01881000
BINURC   EQU   0                                                        01882000
BINURCL  EQU   BINURC                                                   01883000
BINURCD  EQU   BINURC+1                                                 01884000
BINSLUNM EQU   0                                                        01885000
RPLOF16  EQU   0                                                        01886000
RPLRH3   EQU   RPLOF16                                                  01887000
RPLBB    EQU   RPLRH3                                                   01888000
RPLEB    EQU   RPLRH3                                                   01889000
RPLCMD   EQU   RPLRH3                                                   01890000
RPLCSI   EQU   RPLRH3                                                   01891000
RPLSRTYP EQU   RPLOF16+1                                                01892000
RPLSTYPE EQU   RPLSRTYP                                                 01893000
RPLRTYPE EQU   RPLSRTYP                                                 01894000
RPLRRESP EQU   RPLRTYPE                                                 01895000
RPLNFSYN EQU   RPLRTYPE                                                 01896000
RPLCHN   EQU   RPLOF16+2                                                01897000
RPLLAST  EQU   RPLCHN                                                   01898000
RPLONLY  EQU   RPLCHN                                                   01899000
RPLVTFL1 EQU   RPLOF16+3                                                01900000
RPLVTFL2 EQU   RPLOF16+4                                                01901000
RPLPOSTV EQU   RPLVTFL2                                                 01902000
RPLRESP  EQU   RPLVTFL2                                                 01903000
RPLEX    EQU   RPLRESP                                                  01904000
RPLNFME  EQU   RPLRESP                                                  01905000
RPLRRN   EQU   RPLRESP                                                  01906000
RPLCNTRL EQU   RPLOF16+5                                                01907000
RPLCNTDF EQU   RPLCNTRL                                                 01908000
RPLDATA  EQU   RPLCNTDF                                                 01909000
RPLCNCEL EQU   RPLCNTDF                                                 01910000
RPLCHASE EQU   RPLCNTDF                                                 01911000
RPLCNTDC EQU   RPLCNTRL+1                                               01912000
RPLRTR   EQU   RPLCNTDC                                                 01913000
RPLLUS   EQU   RPLCNTDC                                                 01914000
RPLSIGNL EQU   RPLCNTDC                                                 01915000
RPLCNTSC EQU   RPLCNTRL+2                                               01916000
RPLSHUTD EQU   RPLCNTSC                                                 01917000
RPLSHUTC EQU   RPLCNTSC                                                 01918000
RPLRSHUT EQU   RPLCNTSC                                                 01919000
RPLOF60  EQU   0                                                        01920000
RPLOBSQ  EQU   RPLOF60+4                                                01921000
RPLIBSQ  EQU   RPLOF60+5                                                01922000
RPLSEQNO EQU   RPLOF60+6                                                01923000
CARRAY   EQU   0                                                        01924000
MSGCOUNT EQU   0                                                        01925000
ELEMENT  EQU   0                                                        01926000
CHAIN    EQU   ELEMENT                                                  01927000
INADR    EQU   ELEMENT+4                                                01928000
OUTCT    EQU   ELEMENT+8                                                01929000
INCT     EQU   ELEMENT+9                                                01930000
MSG      EQU   ELEMENT+10                                               01931000
BACKSAVE EQU   0                                                        01932000
LASTCHN  EQU   0                                                        01933000
$TRTBL   EQU   0                                                        01934000
#EXIT    EQU   0                                                        01935000
ISTRPL   EQU   0                                                        01936000
ISTXDYP  EQU   0                                                        01937000
ISTXPAB  EQU   0                                                        01938000
RCAPTR   EQU   $RCA                                                     01939000
PABXTNSN EQU   PABEND                                                   01940000
BINLUP1  EQU   BINPSCHR                                                 01941000
BINLUS   EQU   BINPSCHR                                                 01942000
BINFMF1  EQU   BINLUS                                                   01943000
@NM00123 EQU   BINFMF1                                                  01944000
BINDSPF1 EQU   BINLUS+2                                                 01945000
BINMEDIA EQU   BINLUS+4                                                 01946000
BINLUP2  EQU   BINPSCHR                                                 01947000
BINSCRSZ EQU   BINLUP2+5                                                01948000
BINLUP3  EQU   BINPSCHR                                                 01949000
BINBFRSZ EQU   BINLUP3+5                                                01950000
BINBDESC EQU   BINLUP3+9                                                01951000
BINLUP4  EQU   BINPSCHR                                                 01952000
BINPSNDO EQU   BINLUP4                                                  01953000
BINPDSPP EQU   BINPSNDO                                                 01954000
BINADSPP EQU   BINPSNDO+1                                               01955000
BINFMHUP EQU   BINPSNDO+3                                               01956000
BINSSNDO EQU   BINLUP4+4                                                01957000
BINCSO   EQU   BINLUP4+8                                                01958000
BINCSOR  EQU   BINCSO                                                   01959000
BINGENCO EQU   BINLUP4+9                                                01960000
SVECC012 EQU   SVESC022                                                 01961000
SVEIC00A EQU   SVEIC003                                                 01962000
SVEIC004 EQU   SVEIC003                                                 01963000
SVEIC005 EQU   SVEIC003                                                 01964000
SVESC02A EQU   SVESC022                                                 01965000
SVESC02B EQU   SVESC022                                                 01966000
SVESC02D EQU   SVESC022                                                 01967000
SVESC02E EQU   SVESC022                                                 01968000
SVESC02F EQU   SVECC013                                                 01969000
SVESC024 EQU   SVESC022                                                 01970000
SVESC027 EQU   SVESC022                                                 01971000
SVESC029 EQU   SVESC033                                                 01972000
SVESC031 EQU   SVECC013                                                 01973000
SVESC032 EQU   SVECC011                                                 01974000
SVETC037 EQU   SVEIC003                                                 01975000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01976000
BINRSV35 EQU   BINLUP4+10                                               01977000
BINRVS34 EQU   BINGENCO                                                 01978000
BINAAO   EQU   BINGENCO                                                 01979000
BINIAO   EQU   BINGENCO                                                 01980000
BINRSV33 EQU   BINGENCO                                                 01981000
BINWSDF  EQU   BINGENCO                                                 01982000
BINRSV32 EQU   BINGENCO                                                 01983000
BINCSOC2 EQU   BINCSO                                                   01984000
BINCSOC1 EQU   BINCSO                                                   01985000
BINRSV31 EQU   BINCSOR                                                  01986000
BINRSV30 EQU   BINCSOR                                                  01987000
BINCSOAI EQU   BINCSOR                                                  01988000
BINCSOE  EQU   BINCSOR                                                  01989000
BINFMHUS EQU   BINSSNDO+3                                               01990000
BINCSLS  EQU   BINSSNDO+2                                               01991000
BINADSPS EQU   BINSSNDO+1                                               01992000
BINPDSPS EQU   BINSSNDO                                                 01993000
BINKIXS  EQU   BINFMHUP                                                 01994000
BINQFDO  EQU   BINFMHUP                                                 01995000
BINWPFMO EQU   BINFMHUP                                                 01996000
BINPDIRO EQU   BINFMHUP                                                 01997000
BINCOMPO EQU   BINFMHUP                                                 01998000
BINDSSTO EQU   BINFMHUP                                                 01999000
BINSSDAT EQU   BINFMHUP                                                 02000000
BINCSLP  EQU   BINPSNDO+2                                               02001000
BINRSV29 EQU   BINADSPP                                                 02002000
BINADSRF EQU   BINADSPP                                                 02003000
BINADSSF EQU   BINADSPP                                                 02004000
BINADSBE EQU   BINADSPP                                                 02005000
BINADSEC EQU   BINADSPP                                                 02006000
BINADSCD EQU   BINADSPP                                                 02007000
BINADSEP EQU   BINADSPP                                                 02008000
BINPEP   EQU   BINPDSPP                                                 02009000
BINDPP   EQU   BINPDSPP                                                 02010000
BINRSV28 EQU   BINPDSPP                                                 02011000
@NM00134 EQU   BINLUP3+10                                               02012000
BINBFSIZ EQU   BINBDESC                                                 02013000
@NM00133 EQU   BINBDESC                                                 02014000
BINBDRAC EQU   BINBFRSZ+3                                               02015000
BINBFRAR EQU   BINBFRSZ+2                                               02016000
BINBFRDC EQU   BINBFRSZ+1                                               02017000
BINBFRDR EQU   BINBFRSZ                                                 02018000
@NM00132 EQU   BINLUP3                                                  02019000
@NM00131 EQU   BINLUP2+10                                               02020000
BINPRESZ EQU   BINLUP2+9                                                02021000
BINSALTC EQU   BINSCRSZ+3                                               02022000
BINSALTR EQU   BINSCRSZ+2                                               02023000
BINSPRIC EQU   BINSCRSZ+1                                               02024000
BINSPRIR EQU   BINSCRSZ                                                 02025000
@NM00130 EQU   BINLUP2+1                                                02026000
@NM00129 EQU   BINLUP2                                                  02027000
BINSEDS  EQU   BINLUP2                                                  02028000
@NM00128 EQU   BINMEDIA                                                 02029000
BINCDEDS EQU   BINMEDIA                                                 02030000
BINXDOCF EQU   BINMEDIA                                                 02031000
BINXCDF  EQU   BINMEDIA                                                 02032000
BINDISK  EQU   BINMEDIA                                                 02033000
BINXCHNG EQU   BINMEDIA                                                 02034000
BINCARD  EQU   BINMEDIA                                                 02035000
BINDOCMT EQU   BINMEDIA                                                 02036000
@NM00127 EQU   BINDSPF1+1                                               02037000
BINUAALT EQU   BINDSPF1+1                                               02038000
BINUAINT EQU   BINDSPF1+1                                               02039000
BINTRNDS EQU   BINDSPF1                                                 02040000
@NM00126 EQU   BINDSPF1                                                 02041000
BINSLD   EQU   BINDSPF1                                                 02042000
BINVSDS  EQU   BINDSPF1                                                 02043000
BINVTDS  EQU   BINDSPF1                                                 02044000
BINHFDS  EQU   BINDSPF1                                                 02045000
BININTR  EQU   BINDSPF1                                                 02046000
@NM00125 EQU   @NM00123+1                                               02047000
BINXFPD  EQU   @NM00123+1                                               02048000
BINCSDS  EQU   @NM00123+1                                               02049000
BINQDSI  EQU   @NM00123+1                                               02050000
@NM00124 EQU   @NM00123+1                                               02051000
BINARRR  EQU   @NM00123                                                 02052000
BINSIDS  EQU   @NM00123                                                 02053000
BINSAI   EQU   @NM00123                                                 02054000
BINSDSI  EQU   @NM00123                                                 02055000
BINKDDSI EQU   @NM00123                                                 02056000
BINPDIR  EQU   BINFMF1                                                  02057000
BINCMPCT EQU   BINFMF1                                                  02058000
BINDESTS EQU   BINFMF1                                                  02059000
BINSLUS1 EQU   BINLUP1+6                                                02060000
BINPLUS1 EQU   BINLUP1+1                                                02061000
BINDSP1  EQU   BINLUP1                                                  02062000
BINFMHS1 EQU   BINLUP1                                                  02063000
@NM00057 EQU   PABXTNSN+12                                              02064000
PABNPSSQ EQU   PABXTNSN+8                                               02065000
PABLOCK  EQU   PABXTNSN+4                                               02066000
PABLAST  EQU   PABXTNSN                                                 02067000
@NM00157 EQU   RPLIBSQ                                                  02068000
RPLIINV  EQU   RPLIBSQ                                                  02069000
RPLINEG  EQU   RPLIBSQ                                                  02070000
RPLIPOS  EQU   RPLIBSQ                                                  02071000
RPLIIGN  EQU   RPLIBSQ                                                  02072000
RPLIRSET EQU   RPLIBSQ                                                  02073000
RPLITST  EQU   RPLIBSQ                                                  02074000
RPLISET  EQU   RPLIBSQ                                                  02075000
@NM00156 EQU   RPLOBSQ                                                  02076000
RPLOINV  EQU   RPLOBSQ                                                  02077000
RPLONEG  EQU   RPLOBSQ                                                  02078000
RPLOPOS  EQU   RPLOBSQ                                                  02079000
RPLOIGN  EQU   RPLOBSQ                                                  02080000
RPLORSET EQU   RPLOBSQ                                                  02081000
RPLOTST  EQU   RPLOBSQ                                                  02082000
RPLOSET  EQU   RPLOBSQ                                                  02083000
RPLIBSQV EQU   RPLOF60+2                                                02084000
RPLOBSQV EQU   RPLOF60                                                  02085000
@NM00155 EQU   RPLCNTSC                                                 02086000
RPLRQR   EQU   RPLCNTSC                                                 02087000
RPLSTSN  EQU   RPLCNTSC                                                 02088000
RPLCLEAR EQU   RPLCNTSC                                                 02089000
RPLSDT   EQU   RPLCNTSC                                                 02090000
RPLBIS   EQU   RPLCNTDC                                                 02091000
RPLSBI   EQU   RPLCNTDC                                                 02092000
RPLTUNBD EQU   RPLCNTDC                                                 02093000
RPLTBIND EQU   RPLCNTDC                                                 02094000
RPLBID   EQU   RPLCNTDC                                                 02095000
@NM00154 EQU   RPLCNTDF                                                 02096000
RPLQI    EQU   RPLCNTDF                                                 02097000
RPLRELQ  EQU   RPLCNTDF                                                 02098000
RPLQEC   EQU   RPLCNTDF                                                 02099000
RPLQC    EQU   RPLCNTDF                                                 02100000
RPLQRI   EQU   RPLRESP                                                  02101000
@NM00153 EQU   RPLPOSTV                                                 02102000
RPLSCHED EQU   RPLPOSTV                                                 02103000
@NM00152 EQU   RPLVTFL1                                                 02104000
RPLTLGAC EQU   RPLVTFL1                                                 02105000
RPLTNDSP EQU   RPLVTFL1                                                 02106000
RPLAUTUS EQU   RPLVTFL1                                                 02107000
RPLVTUSE EQU   RPLVTFL1                                                 02108000
@NM00151 EQU   RPLVTFL1                                                 02109000
@NM00150 EQU   RPLCHN                                                   02110000
RPLMIDLE EQU   RPLCHN                                                   02111000
RPLFIRST EQU   RPLCHN                                                   02112000
@NM00149 EQU   RPLRTYPE                                                 02113000
RPLDFASY EQU   RPLRTYPE                                                 02114000
@NM00148 EQU   RPLSTYPE                                                 02115000
RPLSRESP EQU   RPLSTYPE                                                 02116000
@NM00147 EQU   RPLRH3                                                   02117000
RPLCHREQ EQU   RPLRH3                                                   02118000
BINSNMD  EQU   BINSLUNM+1                                               02119000
BINSNML  EQU   BINSLUNM                                                 02120000
BINCRKEY EQU   BINCRYRL+2                                               02121000
BINCCIPH EQU   BINCRPFL                                                 02122000
BINCRSV1 EQU   BINCRPFL                                                 02123000
BINCKEYT EQU   BINCRPFL                                                 02124000
BINCLEN  EQU   BINCRCTL                                                 02125000
BINCSESS EQU   BINCRCTL                                                 02126000
BINCEUMB EQU   BINCRCTL                                                 02127000
BINUSE   EQU   ISTBIND+36                                               02128000
BINUSEL  EQU   ISTBIND+35                                               02129000
BINPRIM  EQU   ISTBIND+27                                               02130000
BINPRIML EQU   ISTBIND+26                                               02131000
BINLUTYP EQU   BINLUP                                                   02132000
@NM00122 EQU   BINLUP                                                   02133000
BINBPACM EQU   BINBPACE                                                 02134000
@NM00121 EQU   BINBPACE                                                 02135000
BINSPACM EQU   BINSPACE                                                 02136000
@NM00120 EQU   BINSPACE                                                 02137000
BINPS1ST EQU   BINSPACE                                                 02138000
BINPRUSE EQU   BINPRUSZ                                                 02139000
BINPRUSM EQU   BINPRUSZ                                                 02140000
BINSRUSE EQU   BINSRUSZ                                                 02141000
BINSRUSM EQU   BINSRUSZ                                                 02142000
BINRPACM EQU   BINRPACE                                                 02143000
@NM00119 EQU   BINRPACE                                                 02144000
BINAPACM EQU   BINAPACE                                                 02145000
@NM00118 EQU   BINAPACE                                                 02146000
BINSP2ST EQU   BINAPACE                                                 02147000
BINCONR  EQU   BINCMNP2                                                 02148000
BINRCHN  EQU   BINCMNP2                                                 02149000
BINMDIBK EQU   BINCMNP2                                                 02150000
BINBKFS  EQU   BINCMNP2                                                 02151000
BINRCVR  EQU   BINCMNP2                                                 02152000
@NM00117 EQU   BINCMNP                                                  02153000
BINALT   EQU   BINCMNP                                                  02154000
BINFMHD  EQU   BINCMNP                                                  02155000
@NM00116 EQU   BINCMNP                                                  02156000
BINSSEB  EQU   BINSECP                                                  02157000
BINSCMP  EQU   BINSECP                                                  02158000
@NM00115 EQU   BINSECP                                                  02159000
BINSCHNR EQU   BINSECP                                                  02160000
BINSMCH  EQU   BINSECP                                                  02161000
BINSCHN  EQU   BINSECP                                                  02162000
BINPSEB  EQU   BINPRIP                                                  02163000
BINPCMP  EQU   BINPRIP                                                  02164000
@NM00114 EQU   BINPRIP                                                  02165000
BINPCHNR EQU   BINPRIP                                                  02166000
BINPMCH  EQU   BINPRIP                                                  02167000
BINPCHN  EQU   BINPRIP                                                  02168000
BINTS    EQU   ISTBIND+2                                                02169000
BINFM    EQU   ISTBIND+1                                                02170000
BINTYPE  EQU   BINFMTY                                                  02171000
BINFMT   EQU   BINFMTY                                                  02172000
TIEPTR2  EQU   TIERPHA                                                  02173000
TIEPTR1  EQU   TIESNA                                                   02174000
TIEGATE  EQU   TIETIEA                                                  02175000
TIEREQ   EQU   ISTTIE+3                                                 02176000
TIERETCD EQU   ISTTIE+2                                                 02177000
TIELNGTH EQU   ISTTIE+1                                                 02178000
TIETYPE  EQU   ISTTIE                                                   02179000
ATCAOS   EQU   ISTATCVT+1868                                            02180000
@NM00113 EQU   ISTATCVT+1860                                            02181000
@NM00112 EQU   ISTATCVT+1852                                            02182000
@NM00111 EQU   ISTATCVT+1844                                            02183000
@NM00110 EQU   ISTATCVT+1836                                            02184000
@NM00109 EQU   ISTATCVT+1828                                            02185000
@NM00108 EQU   ISTATCVT+1820                                            02186000
@NM00107 EQU   ISTATCVT+1816                                            02187000
ATCCACSA EQU   ISTATCVT+1812                                            02188000
ATCMXCSA EQU   ISTATCVT+1808                                            02189000
ATCTPMPB EQU   ISTATCVT+1776                                            02190000
ATCTRMPB EQU   ISTATCVT+1744                                            02191000
ATCRPLAC EQU   ATCRPLCN+2                                               02192000
ATCRPLRC EQU   ATCRPLCN                                                 02193000
ATCCRPLQ EQU   ATCCRPL                                                  02194000
ATCSRBAC EQU   ATCSRBCN+2                                               02195000
ATCSRBRC EQU   ATCSRBCN                                                 02196000
ATCSRBQ  EQU   ATCSRB                                                   02197000
ATCCRAAC EQU   ATCCRACN+2                                               02198000
ATCCRARC EQU   ATCCRACN                                                 02199000
ATCCRAQ  EQU   ATCCRA                                                   02200000
ATCLUFFD EQU   ISTATCVT+1716                                            02201000
ATCVIOPM EQU   ISTATCVT+1712                                            02202000
ATCTPMMI EQU   ISTATCVT+1708                                            02203000
ATCPXSRB EQU   ISTATCVT+1704                                            02204000
ATCRPLCT EQU   ISTATCVT+1702                                            02205000
ATCCRACT EQU   ISTATCVT+1700                                            02206000
ATCSRBCT EQU   ISTATCVT+1698                                            02207000
ATCSTNSM EQU   ISTATCVT+1697                                            02208000
@NM00106 EQU   ATCZFLAG                                                 02209000
ATCZF001 EQU   ATCZFLAG                                                 02210000
ATCTPCP1 EQU   ISTATCVT+1692                                            02211000
ATCTPCP0 EQU   ISTATCVT+1688                                            02212000
ATCZR01  EQU   ISTATCVT+1684                                            02213000
ATCMPLTA EQU   ISTATCVT+1680                                            02214000
ATCASCB  EQU   ISTATCVT+1676                                            02215000
ATCAP86  EQU   ISTATCVT+1672                                            02216000
ATCAP85  EQU   ISTATCVT+1668                                            02217000
ATCAP84  EQU   ISTATCVT+1664                                            02218000
ATCAP83  EQU   ISTATCVT+1660                                            02219000
ATCAP82  EQU   ISTATCVT+1656                                            02220000
ATCAP69  EQU   ISTATCVT+1652                                            02221000
ATCAP66  EQU   ISTATCVT+1648                                            02222000
ATCAP62  EQU   ISTATCVT+1644                                            02223000
ATCAPC59 EQU   ISTATCVT+1640                                            02224000
ATCAP56  EQU   ISTATCVT+1636                                            02225000
ATCAP55  EQU   ISTATCVT+1632                                            02226000
ATCAP41  EQU   ISTATCVT+1628                                            02227000
ATCAPC25 EQU   ISTATCVT+1624                                            02228000
ATCAP23  EQU   ISTATCVT+1620                                            02229000
ATCAPBE  EQU   ISTATCVT+1616                                            02230000
ATCPSTA  EQU   ISTATCVT+1612                                            02231000
ATCSMABF EQU   ISTATCVT+1608                                            02232000
ATCSMAPR EQU   ISTATCVT+1604                                            02233000
ATCTPWQA EQU   ISTATCVT+1600                                            02234000
ATCSMAID EQU   ISTATCVT+1596                                            02235000
ATCSMARA EQU   ISTATCVT+1592                                            02236000
ATCCACXA EQU   ISTATCVT+1588                                            02237000
ATCATA10 EQU   ISTATCVT+1584                                            02238000
ATCHLTCB EQU   ISTATCVT+1580                                            02239000
@NM00105 EQU   ATCVTFLG                                                 02240000
ATCVTACT EQU   ATCVTFLG                                                 02241000
@NM00104 EQU   @NM00103                                                 02242000
ATCVTMAB EQU   @NM00103                                                 02243000
ATCVTBAM EQU   ISTATCVT+1572                                            02244000
@NM00102 EQU   ISTATCVT+1568                                            02245000
@NM00101 EQU   ISTATCVT+1520                                            02246000
ATCCCOOC EQU   ISTATCVT+1516                                            02247000
@NM00100 EQU   ISTATCVT+1513                                            02248000
ATCSNUF  EQU   ATCENFLG                                                 02249000
ATCOPKL  EQU   ATCENFLG                                                 02250000
ATCABEN  EQU   ATCENFLG                                                 02251000
ATCSRDN  EQU   ATCENFLG                                                 02252000
ATCDLDN  EQU   ATCENFLG                                                 02253000
ATCTIMER EQU   ISTATCVT+1508                                            02254000
ATCAIWT  EQU   ISTATCVT+1504                                            02255000
ATCOROBT EQU   ISTATCVT+1500                                            02256000
ATCDMAPP EQU   ISTATCVT+1496                                            02257000
ATCZDVTX EQU   ISTATCVT+1492                                            02258000
ATCPXCRA EQU   ISTATCVT+1488                                            02259000
ATCICNCB EQU   ISTATCVT+1484                                            02260000
ATCCMTCB EQU   ISTATCVT+1480                                            02261000
ATCPRPH  EQU   ISTATCVT+1476                                            02262000
ATCGSRBF EQU   ATCGSRBG                                                 02263000
ATCSRBRT EQU   ISTATCVT+1468                                            02264000
ATCTSCPC EQU   ISTATCVT+1464                                            02265000
@NM00099 EQU   ISTATCVT+1460                                            02266000
ATCCDTCB EQU   ISTATCVT+1456                                            02267000
ATCORFRL EQU   ISTATCVT+1452                                            02268000
ATCORFPX EQU   ISTATCVT+1448                                            02269000
ATCORFMG EQU   ISTATCVT+1444                                            02270000
ATCSMBQ  EQU   ISTATCVT+1440                                            02271000
ATCINFDD EQU   ISTATCVT+1436                                            02272000
ATCAP67  EQU   ISTATCVT+1432                                            02273000
ATCAP65  EQU   ISTATCVT+1428                                            02274000
ATCAP64  EQU   ISTATCVT+1424                                            02275000
ATCAP63  EQU   ISTATCVT+1420                                            02276000
ATCAP61  EQU   ISTATCVT+1416                                            02277000
ATCAP58  EQU   ISTATCVT+1412                                            02278000
ATCAP57  EQU   ISTATCVT+1408                                            02279000
ATCAP54  EQU   ISTATCVT+1404                                            02280000
ATCAP53  EQU   ISTATCVT+1400                                            02281000
ATCAP52  EQU   ISTATCVT+1396                                            02282000
ATCAP51  EQU   ISTATCVT+1392                                            02283000
ATCAP38  EQU   ISTATCVT+1388                                            02284000
ATCAP37  EQU   ISTATCVT+1384                                            02285000
ATCAP34  EQU   ISTATCVT+1380                                            02286000
ATCAP32  EQU   ISTATCVT+1376                                            02287000
ATCAP31  EQU   ISTATCVT+1372                                            02288000
ATCAP12  EQU   ISTATCVT+1368                                            02289000
ATCAP11  EQU   ISTATCVT+1364                                            02290000
ATCDAPDG EQU   ATCDAPVT+20                                              02291000
ATCDXCEA EQU   ATCDAPVT+16                                              02292000
ATCDCEA  EQU   ATCDAPVT+12                                              02293000
ATCDPCIA EQU   ATCDAPVT+8                                               02294000
ATCDSIOA EQU   ATCDAPVT+4                                               02295000
ATCDEOEA EQU   ATCDAPVT                                                 02296000
ATCZAEA  EQU   ATCICAPP+16                                              02297000
ATCZCEA  EQU   ATCICAPP+12                                              02298000
ATCZCPCI EQU   ATCICAPP+8                                               02299000
ATCZSIOA EQU   ATCICAPP+4                                               02300000
ATCCDRPH EQU   ATCICAPP                                                 02301000
ATCORQG  EQU   ATCORSRB                                                 02302000
ATCORTBF EQU   ATCSQAFR                                                 02303000
@NM00098 EQU   ISTATCVT+1308                                            02304000
ATCZLAEA EQU   ATCLDAPP+16                                              02305000
ATCZLCEA EQU   ATCLDAPP+12                                              02306000
ATCZLPCI EQU   ATCLDAPP+8                                               02307000
ATCSMFRR EQU   ATCLDAPP+4                                               02308000
ATCCDTID EQU   ATCLDAPP                                                 02309000
@NM00097 EQU   ISTATCVT+1256                                            02310000
ATCZPAB2 EQU   ISTATCVT+1224                                            02311000
@NM00096 EQU   ISTATCVT+1224                                            02312000
@NM00095 EQU   ISTATCVT+1164                                            02313000
ATCCPCFE EQU   ISTATCVT+1160                                            02314000
@NM00094 EQU   ATCRID+2                                                 02315000
ATCCDRMA EQU   ATCRID                                                   02316000
@NM00093 EQU   ATCSMSDQ+8                                               02317000
@NM00092 EQU   ATCSMSDQ+4                                               02318000
@NM00091 EQU   ATCSMSDQ                                                 02319000
ATCSEQNO EQU   ISTATCVT+1136                                            02320000
ATCSMPMD EQU   ISTATCVT+1132                                            02321000
ATCPAREA EQU   ISTATCVT+1128                                            02322000
ATCCPCSM EQU   ISTATCVT+1124                                            02323000
ATCQLOCK EQU   ISTATCVT+1120                                            02324000
ATCITQLE EQU   ISTATCVT+1116                                            02325000
ATCSQCDS EQU   ISTATCVT+1112                                            02326000
ATCUSSVT EQU   ISTATCVT+1108                                            02327000
ATCNOSQ  EQU   ISTATCVT+1104                                            02328000
ATCINCIP EQU   ATCCPDVT+4                                               02329000
ATCTSCNI EQU   ATCCPDVT                                                 02330000
ATCMGCRT EQU   ISTATCVT+1092                                            02331000
ATCMACRT EQU   ISTATCVT+1088                                            02332000
ATCCSMT  EQU   ISTATCVT+1084                                            02333000
ATCDRUSL EQU   ISTATCVT+1080                                            02334000
ATCDRULL EQU   ISTATCVT+1076                                            02335000
ATCCFCDR EQU   ISTATCVT+1072                                            02336000
@NM00090 EQU   ISTATCVT+1069                                            02337000
ATCMROUT EQU   ISTATCVT+1060                                            02338000
ATCONFIG EQU   ISTATCVT+1052                                            02339000
ATCNODEL EQU   ISTATCVT+1044                                            02340000
@NM00089 EQU   @NM00088+9                                               02341000
ATCLAST  EQU   ATCSHRFG                                                 02342000
ATCSHRTN EQU   @NM00088                                                 02343000
@NM00087 EQU   ISTATCVT+1026                                            02344000
ATCNMCTR EQU   ISTATCVT+1024                                            02345000
ATCPOIA  EQU   ATCRNO+1                                                 02346000
@NM00086 EQU   ATCRNO                                                   02347000
ATCLCLCT EQU   ATCVLCNT+2                                               02348000
ATCRNCNT EQU   ATCVLCNT                                                 02349000
ATCHBSIZ EQU   ATCHPGM+2                                                02350000
ATCHBFNO EQU   ATCHPGM                                                  02351000
@NM00085 EQU   ISTATCVT+1011                                            02352000
ATCXRANG EQU   ISTATCVT+1010                                            02353000
ATCMAXID EQU   ISTATCVT+1009                                            02354000
ATCMSGSP EQU   ISTATCVT+1008                                            02355000
ATCCIDM  EQU   ISTATCVT+1006                                            02356000
ATCACTRM EQU   ISTATCVT+1004                                            02357000
ATCECTLP EQU   ISTATCVT+1000                                            02358000
ATCECNET EQU   ISTATCVT+996                                             02359000
ATCECOPC EQU   ISTATCVT+992                                             02360000
ATCECSES EQU   ISTATCVT+988                                             02361000
ATCECDSP EQU   ISTATCVT+984                                             02362000
ATCECVRY EQU   ISTATCVT+980                                             02363000
ATCECHLT EQU   ISTATCVT+976                                             02364000
ATCECMOD EQU   ISTATCVT+972                                             02365000
ATCVDLOK EQU   ISTATCVT+968                                             02366000
ATCRDTLK EQU   ISTATCVT+964                                             02367000
ATCVOCLK EQU   ISTATCVT+960                                             02368000
ATCITLIM EQU   ISTATCVT+958                                             02369000
ATCTMINV EQU   ISTATCVT+956                                             02370000
ATCHOSTA EQU   ISTATCVT+954                                             02371000
ATCPUNSA EQU   ISTATCVT+952                                             02372000
ATCSAF   EQU   ISTATCVT+950                                             02373000
ATCVTMID EQU   ATCSSCPA                                                 02374000
ATCHCNID EQU   ATCONID+2                                                02375000
ATCSCNID EQU   ATCONID                                                  02376000
@NM00084 EQU   ATCBITAN+3                                               02377000
@NM00083 EQU   ATCBITAN+2                                               02378000
@NM00082 EQU   ATCFLAG2                                                 02379000
@NM00081 EQU   ATCFLAG2                                                 02380000
@NM00080 EQU   ATCFLAG2                                                 02381000
ATCCRYPF EQU   ATCFLAG2                                                 02382000
ATCTUNCL EQU   ATCFLAG2                                                 02383000
ATCTUNRQ EQU   ATCFLAG2                                                 02384000
ATCTUNAC EQU   ATCFLAG2                                                 02385000
ATCCDLRA EQU   ATCFLAG2                                                 02386000
@NM00079 EQU   ATCBITAN                                                 02387000
@NM00078 EQU   ATCSTAT4                                                 02388000
@NM00077 EQU   ATCSTAT4                                                 02389000
@NM00076 EQU   ATCSTAT4                                                 02390000
@NM00075 EQU   ATCSTAT4                                                 02391000
@NM00074 EQU   ATCSTAT4                                                 02392000
ATCPRTAT EQU   ATCSTAT4                                                 02393000
ATCNCSD  EQU   ATCSTAT4                                                 02394000
ATCMTST  EQU   ATCSTAT4                                                 02395000
@NM00073 EQU   ATCPOFLG                                                 02396000
@NM00072 EQU   ATCPOFLG                                                 02397000
@NM00071 EQU   ATCPOFLG                                                 02398000
@NM00070 EQU   ATCPOFLG                                                 02399000
@NM00069 EQU   ATCPOFLG                                                 02400000
@NM00068 EQU   ATCPOFLG                                                 02401000
@NM00067 EQU   ATCPOFLG                                                 02402000
ATCPOUNS EQU   ATCPOFLG                                                 02403000
@NM00066 EQU   ATCSTAT+1                                                02404000
ATCHIP   EQU   ATCSTAT1                                                 02405000
ATCMDHLT EQU   ATCSTAT1                                                 02406000
ATCINHLT EQU   ATCSTAT1                                                 02407000
ATCNETSL EQU   ATCSTAT1                                                 02408000
ATCQKHLT EQU   ATCSTAT1                                                 02409000
ATCSNHLT EQU   ATCSTAT1                                                 02410000
ATCACTIV EQU   ATCSTAT1                                                 02411000
ATCSTART EQU   ATCSTAT1                                                 02412000
ATCNOP00 EQU   ISTATCVT+932                                             02413000
ATCTSBUF EQU   ISTATCVT+928                                             02414000
ATCFEPT  EQU   ISTATCVT+924                                             02415000
ATCFDVT  EQU   ISTATCVT+920                                             02416000
ATCCONFT EQU   ISTATCVT+916                                             02417000
ATCRDTH  EQU   ISTATCVT+912                                             02418000
ATCSIBQ  EQU   ISTATCVT+908                                             02419000
ATCHLTMS EQU   ISTATCVT+904                                             02420000
ATCECPRM EQU   ISTATCVT+900                                             02421000
ATCVPARM EQU   ISTATCVT+896                                             02422000
ATCOCHA  EQU   ISTATCVT+892                                             02423000
ATCDSPLQ EQU   ISTATCVT+888                                             02424000
ATCVARYQ EQU   ISTATCVT+884                                             02425000
ATCHALTQ EQU   ISTATCVT+880                                             02426000
ATCMODQ  EQU   ISTATCVT+876                                             02427000
ATCSRT   EQU   ISTATCVT+872                                             02428000
ATCRDT   EQU   ISTATCVT+868                                             02429000
ATCSDVT  EQU   ISTATCVT+864                                             02430000
ATCDLRPT EQU   ISTATCVT+860                                             02431000
ATCBPDA  EQU   ISTATCVT+856                                             02432000
ATCACDA  EQU   ISTATCVT+852                                             02433000
ATCMNT   EQU   ISTATCVT+848                                             02434000
ATCUEP   EQU   ISTATCVT+844                                             02435000
ATCNODDS EQU   ISTATCVT+840                                             02436000
ATCITRT  EQU   ISTATCVT+836                                             02437000
ATCTODVT EQU   ISTATCVT+832                                             02438000
ATCTRCPT EQU   ISTATCVT+828                                             02439000
ATCMODTB EQU   ISTATCVT+824                                             02440000
ATCUSSPT EQU   ISTATCVT+820                                             02441000
ATCTUBUF EQU   ISTATCVT+816                                             02442000
ATCTACB  EQU   ISTATCVT+812                                             02443000
ATCDWA   EQU   ISTATCVT+808                                             02444000
ATCCFCR2 EQU   ATCPODVT                                                 02445000
ATCEPA   EQU   ISTATCVT+800                                             02446000
ATCPULQB EQU   @NM00065+16                                              02447000
ATCMCQAB EQU   @NM00065+12                                              02448000
ATCLUSMQ EQU   @NM00065+8                                               02449000
ATCLUIOQ EQU   @NM00065+4                                               02450000
ATCIOLQB EQU   @NM00065                                                 02451000
ATCTSCAP EQU   ATCANYDT                                                 02452000
ATCTSCCO EQU   ATCLUDVT+4                                               02453000
ATCTSCSR EQU   ATCLUDVT                                                 02454000
ATCVTLOD EQU   ISTATCVT+764                                             02455000
ATCTSCLF EQU   ISTATCVT+760                                             02456000
ATCTSCLE EQU   ISTATCVT+756                                             02457000
ATCTSCLB EQU   ISTATCVT+752                                             02458000
ATCTSCLS EQU   ISTATCVT+748                                             02459000
ATCTSCCF EQU   ISTATCVT+744                                             02460000
ATCTSCFV EQU   ISTATCVT+740                                             02461000
ATCTSCCE EQU   ISTATCVT+736                                             02462000
ATCTSCCB EQU   ISTATCVT+732                                             02463000
ATCTSCWS EQU   ISTATCVT+728                                             02464000
ATCTSCEM EQU   ISTATCVT+724                                             02465000
ATCTSCNS EQU   ISTATCVT+720                                             02466000
ATCTSCER EQU   ISTATCVT+716                                             02467000
ATCTSCPR EQU   ISTATCVT+712                                             02468000
ATCTSCGR EQU   ISTATCVT+708                                             02469000
ATCTSCCI EQU   ISTATCVT+704                                             02470000
ATCTSVT  EQU   ISTATCVT+700                                             02471000
ATCDVLOD EQU   ISTATCVT+696                                             02472000
ATCCDCNR EQU   ISTATCVT+692                                             02473000
ATCCDCNF EQU   ISTATCVT+688                                             02474000
ATCCDCND EQU   ISTATCVT+684                                             02475000
ATCCDCNA EQU   ISTATCVT+680                                             02476000
ATCCDCCP EQU   ISTATCVT+676                                             02477000
ATCCDFDN EQU   ISTATCVT+672                                             02478000
ATCCDFIN EQU   ISTATCVT+668                                             02479000
ATCCDFND EQU   ISTATCVT+664                                             02480000
ATCCDDEL EQU   ISTATCVT+660                                             02481000
ATCCDADD EQU   ISTATCVT+656                                             02482000
ATCTCLIM EQU   ISTATCVT+652                                             02483000
ATCRACTR EQU   ISTATCVT+648                                             02484000
ATCRACTI EQU   ISTATCVT+644                                             02485000
ATCREMOV EQU   ISTATCVT+640                                             02486000
ATCRACIO EQU   ISTATCVT+636                                             02487000
ATCADD   EQU   ISTATCVT+632                                             02488000
ATCPUCRT EQU   ISTATCVT+628                                             02489000
ATCSMRS  EQU   ISTATCVT+624                                             02490000
ATCSMRQ  EQU   ISTATCVT+620                                             02491000
ATCORCPX EQU   ISTATCVT+616                                             02492000
ATCORCAF EQU   ISTATCVT+612                                             02493000
ATCFRSTR EQU   ATCGTSTR                                                 02494000
ATCSTMA  EQU   ISTATCVT+604                                             02495000
ATCSRTAD EQU   ISTATCVT+600                                             02496000
ATCOCRT  EQU   ISTATCVT+596                                             02497000
ATCOCCFS EQU   ISTATCVT+592                                             02498000
ATCOCCFP EQU   ISTATCVT+588                                             02499000
ATCSRTDF EQU   ISTATCVT+584                                             02500000
ATCLUCRT EQU   ISTATCVT+580                                             02501000
ATCINCY5 EQU   ISTATCVT+576                                             02502000
ATCINCW3 EQU   ISTATCVT+572                                             02503000
ATCINCU6 EQU   ISTATCVT+568                                             02504000
ATCINCTQ EQU   ISTATCVT+564                                             02505000
ATCINCS1 EQU   ISTATCVT+560                                             02506000
ATCSRTAB EQU   ISTATCVT+556                                             02507000
ATCINCRD EQU   ISTATCVT+552                                             02508000
ATCINCPH EQU   ISTATCVT+548                                             02509000
ATCINCLQ EQU   ISTATCVT+544                                             02510000
ATCNOCRT EQU   ISTATCVT+540                                             02511000
ATCINCF1 EQU   ISTATCVT+536                                             02512000
ATCINCCI EQU   ISTATCVT+532                                             02513000
ATCINCCO EQU   ISTATCVT+528                                             02514000
ATCBLDLA EQU   ISTATCVT+524                                             02515000
ATCALOAD EQU   ISTATCVT+520                                             02516000
ATCADEL  EQU   ISTATCVT+516                                             02517000
ATCESC02 EQU   ISTATCVT+512                                             02518000
ATCESC01 EQU   ISTATCVT+508                                             02519000
ATCDEC01 EQU   ISTATCVT+504                                             02520000
ATCDEC00 EQU   ISTATCVT+500                                             02521000
ATCCPCRT EQU   ISTATCVT+496                                             02522000
ATCMSGM  EQU   ISTATCVT+492                                             02523000
ATCCPCFR EQU   ISTATCVT+488                                             02524000
ATCCPCGR EQU   ISTATCVT+484                                             02525000
ATCCPCPP EQU   ISTATCVT+480                                             02526000
ATCMSGP  EQU   ISTATCVT+476                                             02527000
ATCCPCNT EQU   ISTATCVT+472                                             02528000
ATCAUTHA EQU   ISTATCVT+468                                             02529000
ATCACCTA EQU   ISTATCVT+464                                             02530000
ATCAP39  EQU   ISTATCVT+460                                             02531000
ATCAP36  EQU   ISTATCVT+456                                             02532000
ATCAP35  EQU   ISTATCVT+452                                             02533000
ATCAP33  EQU   ISTATCVT+448                                             02534000
ATCAPCR5 EQU   ISTATCVT+444                                             02535000
ATCAICPT EQU   ISTATCVT+440                                             02536000
ATCAPI   EQU   ISTATCVT+436                                             02537000
ATCAICTN EQU   ISTATCVT+432                                             02538000
ATCACC01 EQU   ISTATCVT+428                                             02539000
ATCACC00 EQU   ISTATCVT+424                                             02540000
ATCLDECB EQU   ATCLDTIL+12                                              02541000
ATCLDLCK EQU   ATCLDTIL+8                                               02542000
ATCLDLST EQU   ATCLDTIL+4                                               02543000
ATCLDNCS EQU   ATCLDTIL                                                 02544000
ATCNOSPB EQU   ISTATCVT+376                                             02545000
ATCNSPAB EQU   ISTATCVT+344                                             02546000
ATCLUSRT EQU   ISTATCVT+312                                             02547000
ATCPUIOP EQU   ISTATCVT+280                                             02548000
ATCPUPAB EQU   ISTATCVT+248                                             02549000
ATCPXPAB EQU   ISTATCVT+216                                             02550000
ATCPOPAB EQU   ISTATCVT+184                                             02551000
@NM00064 EQU   ATCVDPAB+16                                              02552000
ATCFEPAB EQU   ATCVDPAB                                                 02553000
ATCTCIPB EQU   ISTATCVT+120                                             02554000
ATCCSPAB EQU   ATCSMPAB+16                                              02555000
@NM00063 EQU   ATCSMPAB                                                 02556000
ATCTMRPB EQU   ISTATCVT+56                                              02557000
ATCITPAB EQU   ISTATCVT+24                                              02558000
@NM00062 EQU   ATCITRA1                                                 02559000
ATCITSCP EQU   ATCITRA1                                                 02560000
ATCITMSG EQU   ATCITRA1                                                 02561000
ATCITPIU EQU   ATCITRA1                                                 02562000
ATCITSMS EQU   ATCITRA1                                                 02563000
ATCITPSS EQU   ATCITRA1                                                 02564000
ATCITLCK EQU   ATCITRA1                                                 02565000
ATCITAPI EQU   ATCITRA1                                                 02566000
ATCITCNT EQU   ATCITFLG                                                 02567000
ATCITRPH EQU   ATCITCDS                                                 02568000
ATCITTBL EQU   ATCITFLD+4                                               02569000
ATCITPRM EQU   ATCITFLD                                                 02570000
ATCPTCHA EQU   ATCRPTCH+4                                               02571000
ATCVTLVL EQU   ATCRPTCH                                                 02572000
RPHUPSTA EQU   ISTRPH+104                                               02573000
RPHSAV16 EQU   RPHWORK+60                                               02574000
RPHSAV15 EQU   RPHWORK+56                                               02575000
RPHSAV14 EQU   RPHWORK+52                                               02576000
RPHSAV13 EQU   RPHWORK+48                                               02577000
RPHSAV12 EQU   RPHWORK+44                                               02578000
RPHSAV11 EQU   RPHWORK+40                                               02579000
RPHSAV10 EQU   RPHWORK+36                                               02580000
RPHSAVE9 EQU   RPHWORK+32                                               02581000
RPHSAVE8 EQU   RPHWORK+28                                               02582000
RPHSAVE7 EQU   RPHWORK+24                                               02583000
RPHSAVE6 EQU   RPHWORK+20                                               02584000
RPHSAVE5 EQU   RPHWORK+16                                               02585000
RPHSAVE4 EQU   RPHWORK+12                                               02586000
RPHSAVE3 EQU   RPHWORK+8                                                02587000
RPHSAVE2 EQU   RPHWORK+4                                                02588000
RPHSHALF EQU   RPHSAVE1+2                                               02589000
RPHSBIT8 EQU   RPHSBITS                                                 02590000
RPHSBIT7 EQU   RPHSBITS                                                 02591000
RPHSBIT6 EQU   RPHSBITS                                                 02592000
RPHSBIT5 EQU   RPHSBITS                                                 02593000
RPHSBIT4 EQU   RPHSBITS                                                 02594000
RPHSBIT3 EQU   RPHSBITS                                                 02595000
RPHSBIT2 EQU   RPHSBITS                                                 02596000
RPHSBIT1 EQU   RPHSBITS                                                 02597000
RPHSBYTE EQU   RPHSAVE1                                                 02598000
RPHPABQP EQU   RPHPABQA+1                                               02599000
RPHPABFG EQU   RPHPABQA                                                 02600000
RPHCRR   EQU   ISTRPH+32                                                02601000
RPHSRP34 EQU   RPHSRPRM+2                                               02602000
RPHSRP12 EQU   RPHSRPRM                                                 02603000
RPHWEGT  EQU   RPHCSPA                                                  02604000
RPHMAJCB EQU   ISTRPH+21                                                02605000
RPHPABOF EQU   ISTRPH+20                                                02606000
RPHRESUM EQU   RPHRESMA+1                                               02607000
@NM00061 EQU   RPHWPFLG                                                 02608000
RPHPURGE EQU   RPHWPFLG                                                 02609000
RPHPT    EQU   RPHWPFLG                                                 02610000
RPHWT    EQU   RPHWPFLG                                                 02611000
RPHRSKEY EQU   RPHWPFLG                                                 02612000
RPHDVTA  EQU   ISTRPH+12                                                02613000
RPHTIK   EQU   RPHTSKID+3                                               02614000
@NM00060 EQU   RPHTSKID                                                 02615000
RPHRPHAP EQU   RPHRPHA+1                                                02616000
@NM00059 EQU   RPHRPHA                                                  02617000
RPHGATE  EQU   RPHRPHA                                                  02618000
RPHABEND EQU   RPHFLGB                                                  02619000
RPHUWAIT EQU   RPHFLGB                                                  02620000
RPHRLCRA EQU   RPHFLGB                                                  02621000
@NM00058 EQU   RPHFLGB                                                  02622000
RPHPGCMP EQU   RPHFLGB                                                  02623000
RPHFBAPS EQU   RPHFLGB                                                  02624000
RPHBSSP  EQU   RPHFLGB                                                  02625000
RPHLOCK  EQU   RPHFLGB                                                  02626000
RPHFNFLG EQU   RPHFSTLC                                                 02627000
RPHMLTCP EQU   RPHFLAGS                                                 02628000
RPHSMCLR EQU   RPHFLAGS                                                 02629000
RPHSMTYP EQU   RPHFLAGS                                                 02630000
RPHSMQ   EQU   RPHFLAGS                                                 02631000
RPHAPTYP EQU   RPHFLAGS                                                 02632000
RPHSPGIN EQU   RPHFLAGS                                                 02633000
RPHOGIND EQU   RPHFLAGS                                                 02634000
RPHLNGTH EQU   RPHCNTL+1                                                02635000
RPHTYPE  EQU   RPHCNTL                                                  02636000
DYPPAB   EQU   ISTDYPAB+16                                              02637000
DYPOCRPH EQU   DYPPACMD                                                 02638000
DYPTSKID EQU   ISTDYPAB+8                                               02639000
DYPPACTB EQU   DYPCHAIN                                                 02640000
DYPFLGS  EQU   ISTDYPAB+2                                               02641000
DYPLNGTH EQU   ISTDYPAB+1                                               02642000
DYPTYPE  EQU   ISTDYPAB                                                 02643000
PABRPHA  EQU   PABRPHFG+1                                               02644000
PABNODQ  EQU   PABFLAGS                                                 02645000
PABINHBT EQU   PABFLAGS                                                 02646000
PABERLOK EQU   PABERRLK                                                 02647000
PABSSN   EQU   PABFLAGS                                                 02648000
PABDYNAM EQU   PABFLAGS                                                 02649000
PABXTND  EQU   PABFLAGS                                                 02650000
PABPRIOR EQU   PABFLAGS                                                 02651000
PABAPYP  EQU   PABFLAGS                                                 02652000
PABDVTA  EQU   ISTPAB+9                                                 02653000
PABOFFST EQU   ISTPAB+8                                                 02654000
PABCHNGP EQU   PABCHAIN+1                                               02655000
PABRSV02 EQU   PABCHAIN                                                 02656000
PABDELAY EQU   PABCHAIN                                                 02657000
PABQUED  EQU   PABRUNNG                                                 02658000
PABRESET EQU   PABCHAIN                                                 02659000
PABUNCON EQU   PABCHAIN                                                 02660000
PABCDP   EQU   PABCHAIN                                                 02661000
PABRESCH EQU   PABCHAIN                                                 02662000
PABCHNG  EQU   PABCHAIN                                                 02663000
PABWEQP  EQU   PABWEQA+1                                                02664000
PABRSV01 EQU   PABWEQA                                                  02665000
PABWEQG  EQU   PABWEQA                                                  02666000
LOKXCL   EQU   @NM00055                                                 02667000
LOKPRY   EQU   @NM00055                                                 02668000
@NM00056 EQU   @NM00055                                                 02669000
@NM00054 EQU   LOKCHNG                                                  02670000
LOKCT    EQU   ISTLOK                                                   02671000
ISTRETR7 EQU   ISTRETRG+4                                               02672000
ISTRETR6 EQU   ISTRETRG                                                 02673000
ISTRSV01 EQU   ISTAVT+42                                                02674000
ISTPDAVP EQU   ISTAVT+38                                                02675000
ISTVTTP  EQU   ISTAVT+36                                                02676000
ISTAGTWT EQU   ISTAVT+34                                                02677000
ISTATRT  EQU   ISTAVT+32                                                02678000
ISTARID  EQU   ISTAVT+30                                                02679000
ISTX1    EQU   ISTAVT+29                                                02680000
ISTPHNM  EQU   ISTAVT+24                                                02681000
ISTAPSEX EQU   ISTAVT+20                                                02682000
ISTVTTIK EQU   ISTAVT+18                                                02683000
AVTASID  EQU   ISTAVT+16                                                02684000
ISTAPSTA EQU   ISTAVT+12                                                02685000
ISTAS53  EQU   ISTAVT+8                                                 02686000
ISTAS49  EQU   ISTAVT+4                                                 02687000
ISTACVT  EQU   ISTAVT                                                   02688000
RPLSIGDA EQU   RPLVTEXT+32                                              02689000
RPLSAV13 EQU   RPLVTEXT+28                                              02690000
RPLUSNSO EQU   RPLOSENS+2                                               02691000
RPLSSMO  EQU   RPLSSNSO+1                                               02692000
@NM00146 EQU   RPLSSEO                                                  02693000
RPLRRO   EQU   RPLSSEO                                                  02694000
RPLFIO   EQU   RPLSSEO                                                  02695000
RPLSTATO EQU   RPLSSEO                                                  02696000
RPLCPMO  EQU   RPLSSEO                                                  02697000
@NM00145 EQU   RPLSSEO                                                  02698000
@NM00144 EQU   RPLOPT12                                                 02699000
@NM00143 EQU   RPLOPT12                                                 02700000
@NM00142 EQU   RPLOPT12                                                 02701000
RPLNIBTK EQU   RPLOPT12                                                 02702000
RPLTRUNC EQU   RPLOPT12                                                 02703000
RPLKEEP  EQU   RPLOPT12                                                 02704000
@NM00141 EQU   RPLOPT12                                                 02705000
RPLRSVE8 EQU   RPLOPT11                                                 02706000
RPLRSVE7 EQU   RPLOPT11                                                 02707000
RPLRSVE6 EQU   RPLOPT11                                                 02708000
RPLRSVE5 EQU   RPLOPT11                                                 02709000
RPLRSVE4 EQU   RPLOPT11                                                 02710000
RPLSTOP  EQU   RPLOPT11                                                 02711000
RPLSTART EQU   RPLOPT11                                                 02712000
RPLQUIES EQU   RPLOPT11                                                 02713000
RPLRSVI6 EQU   RPLOPT10                                                 02714000
RPLRSVI5 EQU   RPLOPT10                                                 02715000
RPLRSVI4 EQU   RPLOPT10                                                 02716000
RPLRSVI3 EQU   RPLOPT10                                                 02717000
RPLTSKY  EQU   RPLOPT10                                                 02718000
RPLSPARM EQU   RPLOPT10                                                 02719000
RPLDSPLY EQU   RPLOPT10                                                 02720000
RPLBSCID EQU   RPLOPT10                                                 02721000
RPLTOPL  EQU   RPLOPT9                                                  02722000
RPLCIDE  EQU   RPLOPT9                                                  02723000
RPLRNNM  EQU   RPLOPT9                                                  02724000
RPLAPPST EQU   RPLOPT9                                                  02725000
RPLCOUNT EQU   RPLOPT9                                                  02726000
RPLTERMS EQU   RPLOPT9                                                  02727000
RPLDEVCH EQU   RPLOPT9                                                  02728000
RPLLOGON EQU   RPLOPT9                                                  02729000
RPLESR2  EQU   RPLUSNSI+1                                               02730000
RPLESR1  EQU   RPLUSNSI                                                 02731000
@NM00140 EQU   RPLSSEI                                                  02732000
RPLRRI   EQU   RPLSSEI                                                  02733000
RPLFII   EQU   RPLSSEI                                                  02734000
RPLSTATI EQU   RPLSSEI                                                  02735000
RPLCPMI  EQU   RPLSSEI                                                  02736000
RPLPATHI EQU   RPLSSEI                                                  02737000
RPLARCLN EQU   RPLVTEXT+8                                               02738000
RPLAAREA EQU   RPLVTEXT                                                 02739000
RPLERMSA EQU   RPLCOMN+72                                               02740000
RPLEMLEN EQU   RPLCOMN+70                                               02741000
RPLACTIV EQU   RPLCOMN+69                                               02742000
RPLBRANC EQU   RPLEXTD1                                                 02743000
RPLNIB   EQU   RPLEXTD1                                                 02744000
RPLTCRYP EQU   RPLEXTD1                                                 02745000
@NM00139 EQU   RPLEXTD1                                                 02746000
RPLEXIT  EQU   RPLEXTD1                                                 02747000
RPLNEXIT EQU   RPLEXTD1                                                 02748000
RPLEXSCH EQU   RPLEXTD1                                                 02749000
RPLDDDD  EQU   RPLRBAR+4                                                02750000
@NM00138 EQU   RPLRBAR+3                                                02751000
@NM00137 EQU   RPLAIXID                                                 02752000
RPLAXPKP EQU   RPLAIXID                                                 02753000
RPLAIXPC EQU   RPLRBAR                                                  02754000
RPLRSV88 EQU   RPLOPT8                                                  02755000
RPLUNCON EQU   RPLOPT8                                                  02756000
RPLACTV  EQU   RPLOPT8                                                  02757000
RPLSESS  EQU   RPLOPT8                                                  02758000
RPLPEND  EQU   RPLOPT8                                                  02759000
RPLODPRM EQU   RPLOPT8                                                  02760000
RPLODACP EQU   RPLOPT8                                                  02761000
RPLODACQ EQU   RPLOPT8                                                  02762000
RPLRSV78 EQU   RPLOPT7                                                  02763000
RPLTCRNO EQU   RPLOPT7                                                  02764000
RPLRLSOP EQU   RPLOPT7                                                  02765000
RPLTPOST EQU   RPLOPT7                                                  02766000
RPLQOPT  EQU   RPLOPT7                                                  02767000
RPLCNIMM EQU   RPLCNOPT                                                 02768000
RPLCNANY EQU   RPLCNOPT                                                 02769000
RPLCNALL EQU   RPLCNOPT                                                 02770000
RPLRSV68 EQU   RPLOPT6                                                  02771000
RPLRSV67 EQU   RPLOPT6                                                  02772000
RPLLOCK  EQU   RPLOPT6                                                  02773000
RPLNCOND EQU   RPLOPT6                                                  02774000
RPLCOND  EQU   RPLOPT6                                                  02775000
RPLEOT   EQU   RPLUNTYP                                                 02776000
RPLEOM   EQU   RPLUNTYP                                                 02777000
RPLEOB   EQU   RPLUNTYP                                                 02778000
RPLWROPT EQU   RPLOPT5                                                  02779000
RPLNODE  EQU   RPLOPT5                                                  02780000
RPLERACE EQU   RPLWRTYP                                                 02781000
RPLEAU   EQU   RPLWRTYP                                                 02782000
RPLNERAS EQU   RPLWRTYP                                                 02783000
RPLPSOPT EQU   RPLOPT5                                                  02784000
@NM00136 EQU   RPLOPT5                                                  02785000
RPLDLGIN EQU   RPLOPT5                                                  02786000
RPLCHAIN EQU   RPLNXTRP                                                 02787000
@NM00135 EQU   RPLOPT4                                                  02788000
RPLMKFRM EQU   RPLOPT4                                                  02789000
RPLENDTR EQU   RPLOPT4                                                  02790000
RPLALIGN EQU   RPLOPT3                                                  02791000
RPLFMT   EQU   RPLOPT3                                                  02792000
RPLFLD   EQU   RPLOPT3                                                  02793000
RPLVFY   EQU   RPLOPT3                                                  02794000
RPLBLK   EQU   RPLOPT3                                                  02795000
RPLSFORM EQU   RPLOPT3                                                  02796000
RPLEODS  EQU   RPLOPT3                                                  02797000
RPLNSP   EQU   RPLOPT2                                                  02798000
RPLUPD   EQU   RPLOPT2                                                  02799000
RPLWAITX EQU   RPLOPT2                                                  02800000
RPLLRD   EQU   RPLOPT2                                                  02801000
RPLBWD   EQU   RPLOPT2                                                  02802000
RPLCNV   EQU   RPLOPT2                                                  02803000
RPLADD   EQU   RPLADR                                                   02804000
RPLKEY   EQU   RPLOPT2                                                  02805000
RPLECBIN EQU   RPLECBSW                                                 02806000
RPLGEN   EQU   RPLOPT1                                                  02807000
RPLKGE   EQU   RPLOPT1                                                  02808000
RPLASY   EQU   RPLOPT1                                                  02809000
RPLSKP   EQU   RPLOPT1                                                  02810000
RPLSEQ   EQU   RPLOPT1                                                  02811000
RPLDIR   EQU   RPLOPT1                                                  02812000
RPLLOC   EQU   RPLOPT1                                                  02813000
RPLDAF   EQU   RPLARG+2                                                 02814000
RPLSAF   EQU   RPLARG                                                   02815000
RPLTCBPT EQU   RPLCOMN+28                                               02816000
RPLDACB  EQU   RPLCOMN+24                                               02817000
RPLCCHAR EQU   RPLCOMN+20                                               02818000
RPLSTRID EQU   RPLCOMN+18                                               02819000
RPLKEYL  EQU   RPLKEYLE                                                 02820000
RPLRDSOH EQU   RPLFDB3                                                  02821000
RPLRLG   EQU   RPLFDB3                                                  02822000
RPLLGFRC EQU   RPLFDB3                                                  02823000
RPLREOM  EQU   RPLFDB3                                                  02824000
RPLREOB  EQU   RPLFDB3                                                  02825000
RPLSV32  EQU   RPLFDB3                                                  02826000
RPLUINPT EQU   RPLFDB3                                                  02827000
RPLSTSAV EQU   RPLFDB2                                                  02828000
RPLCUERR EQU   RPLFDB2                                                  02829000
RPLDLGFL EQU   RPLFDB2                                                  02830000
RPLIOERR EQU   RPLFDB2                                                  02831000
RPLDVUNS EQU   RPLFDB2                                                  02832000
RPLATND  EQU   RPLFDB2                                                  02833000
RPLRVID  EQU   RPLFDB2                                                  02834000
RPLERLK  EQU   RPLFDB2                                                  02835000
RPLERREG EQU   RPLRTNCD                                                 02836000
RPLSTAT  EQU   RPLFDBWD                                                 02837000
RPLPOST  EQU   RPLEXITP                                                 02838000
RPLWAIT  EQU   RPLEXITP                                                 02839000
RPLPLHPT EQU   RPLCOMN+4                                                02840000
RPLLEN2  EQU   RPLLEN                                                   02841000
RPLSTYP  EQU   RPLIDWD+1                                                02842000
RPLID    EQU   RPLIDWD                                                  02843000
SVECC010 EQU   TOLTEPWA+3952                                            02844000
SVETC035 EQU   TOLTEPWA+3880                                            02845000
SVESC030 EQU   TOLTEPWA+3808                                            02846000
SVESC020 EQU   TOLTEPWA+3664                                            02847000
SVEIC002 EQU   TOLTEPWA+3520                                            02848000
SVECC014 EQU   TOLTEPWA+3376                                            02849000
SVESC120 EQU   TOLTEPWA+3304                                            02850000
SVESC025 EQU   TOLTEPWA+3088                                            02851000
@NM00053 EQU   TOLTEPWA+2980                                            02852000
@NM00052 EQU   TOLTEPWA+2976                                            02853000
$R13PR3  EQU   TOLTEPWA+2972                                            02854000
$CEINT2  EQU   TOLTEPWA+2968                                            02855000
$CEINT1  EQU   TOLTEPWA+2964                                            02856000
$MSGGET  EQU   TOLTEPWA+2960                                            02857000
$ACQLIST EQU   TOLTEPWA+2956                                            02858000
$R4SAVE1 EQU   TOLTEPWA+2952                                            02859000
$CLSISS  EQU   TOLTEPWA+2950                                            02860000
$CLSCNT  EQU   TOLTEPWA+2948                                            02861000
$CUTABLE EQU   TOLTEPWA+2868                                            02862000
$BUFSZ2  EQU   TOLTEPWA+2864                                            02863000
$RESID2  EQU   TOLTEPWA+2860                                            02864000
$OLTCCW2 EQU   TOLTEPWA+2856                                            02865000
$ENDBFR2 EQU   TOLTEPWA+2852                                            02866000
$1STBFR2 EQU   TOLTEPWA+2848                                            02867000
$TECB2   EQU   TOLTEPWA+2844                                            02868000
$BUFSZ1  EQU   TOLTEPWA+2840                                            02869000
$RESID1  EQU   TOLTEPWA+2836                                            02870000
$OLTCCW1 EQU   TOLTEPWA+2832                                            02871000
$ENDBFR1 EQU   TOLTEPWA+2828                                            02872000
$1STBFR1 EQU   TOLTEPWA+2824                                            02873000
$TECB1   EQU   TOLTEPWA+2820                                            02874000
$WAITIME EQU   TOLTEPWA+2816                                            02875000
$TRTN#   EQU   TOLTEPWA+2815                                            02876000
$WIODEV  EQU   TOLTEPWA+2814                                            02877000
$RQSTSZE EQU   TOLTEPWA+2812                                            02878000
$RQSTPTR EQU   TOLTEPWA+2808                                            02879000
$R4SAVE  EQU   TOLTEPWA+2804                                            02880000
$PARTADR EQU   TOLTEPWA+2800                                            02881000
$TBSDATA EQU   TOLTEPWA+2796                                            02882000
$CTWIDTH EQU   TOLTEPWA+2795                                            02883000
$CTLINE  EQU   TOLTEPWA+2794                                            02884000
$APWIDTH EQU   TOLTEPWA+2793                                            02885000
$APLINE  EQU   TOLTEPWA+2792                                            02886000
$INDEX   EQU   $IMITX                                                   02887000
$UMXX    EQU   @NM00051+14                                              02888000
$NSXX    EQU   @NM00051+12                                              02889000
$ATACNT  EQU   $NSCNT                                                   02890000
$CTR     EQU   @NM00051+8                                               02891000
$ATAPTR  EQU   $NSPTR                                                   02892000
$DDRPTR  EQU   @NM00051                                                 02893000
$DTORESP EQU   TOLTEPWA+2712                                            02894000
$APNAME  EQU   TOLTEPWA+2704                                            02895000
$24SYMNE EQU   $24CATMG+4                                               02896000
$24DEVAD EQU   $24CATMG                                                 02897000
$24RTN#  EQU   $24FEMSG+8                                               02898000
$ESECTID EQU   $24FEMSG                                                 02899000
$24FLGS  EQU   TOLTEPWA+2680                                            02900000
$24SAVE2 EQU   TOLTEPWA+2676                                            02901000
$24SAVE1 EQU   TOLTEPWA+2672                                            02902000
$24UNADR EQU   TOLTEPWA+2668                                            02903000
$24SAV13 EQU   TOLTEPWA+2664                                            02904000
$24RETCD EQU   TOLTEPWA+2663                                            02905000
$MACID   EQU   TOLTEPWA+2661                                            02906000
$CSPARE  EQU   $CFLGS                                                   02907000
$C2WAY   EQU   $CFLGS                                                   02908000
$CINCT   EQU   $CCOMDAT+12                                              02909000
$CINADR  EQU   $CCOMDAT+8                                               02910000
$COUTCT  EQU   $CCOMDAT+4                                               02911000
$COUTAD  EQU   $CCOMDAT                                                 02912000
ROOTLOC  EQU   TOLTEPWA+2640                                            02913000
$WORK    EQU   TOLTEPWA+2376                                            02914000
$EXTA    EQU   TOLTEPWA+2320                                            02915000
$PASSONA EQU   TOLTEPWA+2264                                            02916000
$INBUFR  EQU   TOLTEPWA+2104                                            02917000
$BUFFER  EQU   TOLTEPWA+1976                                            02918000
$TLTRPL3 EQU   TOLTEPWA+1856                                            02919000
$SLTBL   EQU   TOLTEPWA+1468                                            02920000
$CDEVPT  EQU   TOLTEPWA+1466                                            02921000
$DEVCNTS EQU   TOLTEPWA+1464                                            02922000
$FEEDBCK EQU   $DEVTBLE+66                                              02923000
$WTISUED EQU   $DEVFLG4                                                 02924000
$EXIOISD EQU   $DEVFLG4                                                 02925000
$REMWRIT EQU   $DEVFLG4                                                 02926000
$REMDONE EQU   $DEVFLG4                                                 02927000
$2NDUSED EQU   $DEVFLG4                                                 02928000
$1STUSED EQU   $DEVFLG4                                                 02929000
$IGLXIFB EQU   $DEVFLG4                                                 02930000
$EXIOLV3 EQU   $DEVFLG4                                                 02931000
@NM00050 EQU   $DEVFLG5                                                 02932000
$DVBASIC EQU   $DEVFLG5                                                 02933000
$OPNDFAL EQU   $DEVFLG5                                                 02934000
$ACQNCB  EQU   $DEVFLG5                                                 02935000
$REMOTE  EQU   $DEVFLG5                                                 02936000
$ENDNODE EQU   $DEVFLG5                                                 02937000
$LINENME EQU   $RNINFO                                                  02938000
$DVCOL   EQU   $LDNCBPT+2                                               02939000
$DVROW   EQU   $LDNCBPT                                                 02940000
$NCSPLP  EQU   $DEVTBLE+44                                              02941000
$DVLN    EQU   $SSCPDAF                                                 02942000
$DAF     EQU   $DEVSESP+4                                               02943000
$VARYPAB EQU   $DEVSESP                                                 02944000
$SYSMN   EQU   $DEVTBLE+28                                              02945000
@NM00049 EQU   $DEVFLG3                                                 02946000
$CLRSNT  EQU   $DEVFLG3                                                 02947000
$OLTERR  EQU   $DEVFLG3                                                 02948000
$SRTEST  EQU   $DEVFLG3                                                 02949000
$POLLREQ EQU   $DEVFLG3                                                 02950000
$ACQRED  EQU   $DEVFLG3                                                 02951000
$NOTDEV  EQU   $DEVFLG3                                                 02952000
$CEINTRP EQU   $DEVFLG2                                                 02953000
$TESTMDE EQU   $DEVFLG2                                                 02954000
$DEVALOC EQU   $DEVFLG2                                                 02955000
$ALLDATA EQU   $DEVFLG2                                                 02956000
$ENDCNTL EQU   $DEVFLG2                                                 02957000
$CTLDEV  EQU   $DEVFLG2                                                 02958000
$NOCDS   EQU   $DEVFLG2                                                 02959000
$DATAIN  EQU   $DEVFLG2                                                 02960000
$PRIMARY EQU   $DEVFLG1                                                 02961000
$DEVACT  EQU   $DEVFLG1                                                 02962000
$DVLGMDE EQU   $ATTNEXP                                                 02963000
$DVSPRM  EQU   $EVNCPLT                                                 02964000
$GRABBED EQU   $DEVFLG1                                                 02965000
$CATASTR EQU   $DEVFLG1                                                 02966000
$LETGO   EQU   $DEVFLG1                                                 02967000
$EXTDEV  EQU   $DEVCDS+11                                               02968000
@NM00048 EQU   $DEVSDCF                                                 02969000
$NOTPRIM EQU   $DEVSDCF                                                 02970000
@NM00047 EQU   $DEVCDSF                                                 02971000
@NM00046 EQU   $DEVCDSF                                                 02972000
@NM00045 EQU   $DEVCDSF                                                 02973000
$CDSNAME EQU   $DEVCDSF                                                 02974000
$EXTRN   EQU   $DEVCDSF                                                 02975000
$CEVOLUM EQU   $DEVCDSF                                                 02976000
$SHARD   EQU   $DEVCDSF                                                 02977000
$DEVFPM  EQU   $DEVCDSF                                                 02978000
$DEVCNT  EQU   $DEVCDS+8                                                02979000
$DEVTYPE EQU   $DEVFEAT+3                                               02980000
$DEVCLAS EQU   $DEVFEAT+2                                               02981000
$DEVMOD  EQU   $DEVFEAT                                                 02982000
$DEVRDGT EQU   @NM00043+1                                               02983000
$DEVCTLU EQU   @NM00043+1                                               02984000
$DEVCHAN EQU   @NM00043                                                 02985000
@NM00044 EQU   @NM00043                                                 02986000
$CTINDX  EQU   $DEVUNAD                                                 02987000
@NM00042 EQU   $COMMFLG+15                                              02988000
@NM00041 EQU   $COMMFLG+14                                              02989000
@NM00040 EQU   $COMMFLG+13                                              02990000
@NM00039 EQU   $COMMFLG+12                                              02991000
@NM00038 EQU   $FLAG12                                                  02992000
$VARYINP EQU   $FLAG12                                                  02993000
$ENDTEST EQU   $FLAG12                                                  02994000
$VRYHRD  EQU   $FLAG12                                                  02995000
$VRYSFT  EQU   $FLAG12                                                  02996000
$OPTMSG  EQU   $FLAG12                                                  02997000
@NM00037 EQU   $COMMFLG+10                                              02998000
@NM00036 EQU   $COMMFLG+9                                               02999000
@NM00035 EQU   $COMMFLG+8                                               03000000
$TCECM   EQU   $FLAG8                                                   03001000
$VS2     EQU   $FLAG8                                                   03002000
$VS1     EQU   $FLAG8                                                   03003000
$EDOS    EQU   $FLAG8                                                   03004000
@NM00034 EQU   $FLAG8                                                   03005000
@NM00033 EQU   $FLAG8                                                   03006000
$RCVMSG  EQU   $FLAG7                                                   03007000
$RCVRFLG EQU   $FLAG7                                                   03008000
$LDOIS   EQU   $FLAG7                                                   03009000
$DCONTCT EQU   $FLAG7                                                   03010000
$2NDDATA EQU   $FLAG7                                                   03011000
$1STDATA EQU   $FLAG7                                                   03012000
$ABTERM  EQU   $ABNDBIT                                                 03013000
$FSTMCIS EQU   $FLAG6                                                   03014000
$DISCREQ EQU   $FLAG6                                                   03015000
$DISCISS EQU   $FLAG6                                                   03016000
$CHANGE  EQU   $FLAG6                                                   03017000
$RECAL11 EQU   $FLAG6                                                   03018000
@NM00032 EQU   $FLAG5                                                   03019000
$PROGCK  EQU   $CANCEL                                                  03020000
$PRINTAP EQU   $FLAG5                                                   03021000
@NM00031 EQU   $FLAG5                                                   03022000
$MSG922  EQU   $FLAG5                                                   03023000
$CT924   EQU   $FLAG5                                                   03024000
$FSTCAT  EQU   $FLAG5                                                   03025000
$FSTFE   EQU   $FLAG5                                                   03026000
$ACTOPND EQU   $FLAG4                                                   03027000
$ACQCUTT EQU   $FLAG4                                                   03028000
$CLSSACT EQU   $FLAG4                                                   03029000
$BACKINT EQU   $FLAG4                                                   03030000
$DMSGSW  EQU   $FLAG4                                                   03031000
$TSTDEVP EQU   $FLAG4                                                   03032000
$APRQPER EQU   $FLAG4                                                   03033000
$OPCOM   EQU   $FLAG4                                                   03034000
$NEWAP   EQU   $FLAG3                                                   03035000
$OPTERR  EQU   $FLAG3                                                   03036000
$PRTONLY EQU   $FLAG3                                                   03037000
$REQSTOR EQU   $FLAG3                                                   03038000
$LOGOFFE EQU   $FLAG3                                                   03039000
$TSTERR  EQU   $FLAG3                                                   03040000
$DEVERR  EQU   $FLAG3                                                   03041000
@NM00030 EQU   $COMMFLG+1                                               03042000
@NM00029 EQU   $COMMFLG                                                 03043000
@NM00028 EQU   $CDA+120                                                 03044000
$CUCNT   EQU   $CDA+118                                                 03045000
@NM00027 EQU   $CDA+117                                                 03046000
$PRTFORM EQU   $CDA+116                                                 03047000
$OPISCNT EQU   $CDA+114                                                 03048000
$OPNDCNT EQU   $CDA+112                                                 03049000
$GETMSZE EQU   $CDA+110                                                 03050000
$GRCNTS  EQU   $CDA+108                                                 03051000
$CTLCNT  EQU   $CDA+106                                                 03052000
$ACTLVL  EQU   $CDA+105                                                 03053000
$PRNTLVL EQU   $CDA+104                                                 03054000
$ERRCNTA EQU   $CDA+102                                                 03055000
$TLCNT   EQU   $CDA+100                                                 03056000
$TIMEALW EQU   $CDA+96                                                  03057000
$PTRAREA EQU   $CDA+92                                                  03058000
$GETMPTR EQU   $CDA+88                                                  03059000
$R13PTRT EQU   $CDA+84                                                  03060000
$R13PTR  EQU   $CDA+80                                                  03061000
$TEPEND  EQU   $CDA+76                                                  03062000
$PLINKDL EQU   $CDA+72                                                  03063000
$TEPBEGN EQU   $CDA+68                                                  03064000
$FRELPTR EQU   $CDA+64                                                  03065000
$HIGHADR EQU   $HIMOREC                                                 03066000
$LOMOREC EQU   $CDA+56                                                  03067000
$LOWADDR EQU   $OLTPTR                                                  03068000
$ENDCOMM EQU   $CDA+48                                                  03069000
$COMMON  EQU   $RCA                                                     03070000
$SLASHAD EQU   $CDA+32                                                  03071000
$PASSON  EQU   $CDA+28                                                  03072000
$TOLBRTB EQU   $CDA+24                                                  03073000
$SCTPTR8 EQU   $CDA+20                                                  03074000
$SCTPTR  EQU   $CDA+16                                                  03075000
$TBWDPTR EQU   $CDA+12                                                  03076000
$TFWDPTR EQU   $CDA+8                                                   03077000
@NM00026 EQU   $CDA                                                     03078000
@NM00025 EQU   $SCTTBLE+98                                              03079000
$SCTLWTC EQU   $SCTTBLE+96                                              03080000
$SCTLWTA EQU   $SCTTBLE+92                                              03081000
#EXT     EQU   $SCTTBLE+88                                              03082000
#PASS    EQU   $SCTTBLE+84                                              03083000
#TABLE   EQU   $SCTTBLE+80                                              03084000
#MSGIDAC EQU   $SCTTBLE+78                                              03085000
@NM00024 EQU   $SCTTBLE+71                                              03086000
$RETMASK EQU   $SCTTBLE+70                                              03087000
$R249255 EQU   $ROUTMSK+29                                              03088000
$R241248 EQU   $ROUTMSK+28                                              03089000
$R233240 EQU   $ROUTMSK+27                                              03090000
$R225232 EQU   $ROUTMSK+26                                              03091000
$R217224 EQU   $ROUTMSK+25                                              03092000
$R209216 EQU   $ROUTMSK+24                                              03093000
$R201208 EQU   $ROUTMSK+23                                              03094000
$R193200 EQU   $ROUTMSK+22                                              03095000
$R185192 EQU   $ROUTMSK+21                                              03096000
$R177184 EQU   $ROUTMSK+20                                              03097000
$R169176 EQU   $ROUTMSK+19                                              03098000
$R161168 EQU   $ROUTMSK+18                                              03099000
$R153160 EQU   $ROUTMSK+17                                              03100000
$R145152 EQU   $ROUTMSK+16                                              03101000
$R137144 EQU   $ROUTMSK+15                                              03102000
$R129136 EQU   $ROUTMSK+14                                              03103000
$R121128 EQU   $ROUTMSK+13                                              03104000
$R113120 EQU   $ROUTMSK+12                                              03105000
$R105112 EQU   $ROUTMSK+11                                              03106000
$R097104 EQU   $ROUTMSK+10                                              03107000
$R089096 EQU   $ROUTMSK+9                                               03108000
$R081088 EQU   $ROUTMSK+8                                               03109000
$R073080 EQU   $ROUTMSK+7                                               03110000
$R065072 EQU   $ROUTMSK+6                                               03111000
$R057064 EQU   $ROUTMSK+5                                               03112000
$R049056 EQU   $ROUTMSK+4                                               03113000
$R041048 EQU   $ROUTMSK+3                                               03114000
$R033040 EQU   $ROUTMSK+2                                               03115000
$R025032 EQU   $ROUTMSK+1                                               03116000
$R017024 EQU   $ROUTMSK                                                 03117000
$TOTFLG2 EQU   $SCTTBLE+39                                              03118000
@NM00023 EQU   $TOTFLG1                                                 03119000
@NM00022 EQU   $TOTFLG1                                                 03120000
@NM00021 EQU   $TOTFLG1                                                 03121000
$CURELOD EQU   $TOTFLG1                                                 03122000
@NM00020 EQU   $TOTFLG1                                                 03123000
@NM00019 EQU   $TOTFLG1                                                 03124000
$LINESHR EQU   $TOTFLG1                                                 03125000
@NM00018 EQU   $OLTFLG2                                                 03126000
@NM00017 EQU   $OLTFLG2                                                 03127000
@NM00016 EQU   $OLTFLG2                                                 03128000
@NM00015 EQU   $OLTFLG2                                                 03129000
@NM00014 EQU   $OLTFLG2                                                 03130000
@NM00013 EQU   $OLTFLG2                                                 03131000
@NM00012 EQU   $OLTFLG2                                                 03132000
$TALK    EQU   $OLTFLG2                                                 03133000
$DYCOM   EQU   $OLTFLGS                                                 03134000
@NM00011 EQU   $OLTFLGS                                                 03135000
$TRACE   EQU   $OLTFLGS                                                 03136000
$RETCODE EQU   $OLTFLGS                                                 03137000
$CONTCB  EQU   $OLTFLGS                                                 03138000
$RETAIN  EQU   $OLTFLGS                                                 03139000
$CLEANRT EQU   $OLTFLGS                                                 03140000
$MANINTV EQU   $OLTFLGS                                                 03141000
$OLTSIZE EQU   $SCTTBLE+34                                              03142000
$QSCTMOD EQU   $EXECFLG                                                 03143000
$CTRLMOD EQU   $EXECFLG                                                 03144000
$CLEANUP EQU   $EXECFLG                                                 03145000
$LSTPDEV EQU   $EXECFLG                                                 03146000
$ERRCNT  EQU   $EXECFLG                                                 03147000
$RTNSLCT EQU   $EXECFLG                                                 03148000
$MULTDEV EQU   $EXECFLG                                                 03149000
@NM00010 EQU   $EXECFLG                                                 03150000
$RMSKCNT EQU   $SCTTBLE+32                                              03151000
$SYNAME  EQU   $CDS8T19+4                                               03152000
$EXTSIG  EQU   $CDS8T19+3                                               03153000
$CDFLGS  EQU   $CDS8T19+1                                               03154000
$CDSCNT  EQU   $CDS8T19                                                 03155000
$PDEVDSC EQU   $SCTTBLE+16                                              03156000
$PDEVADR EQU   $SCTTBLE+12                                              03157000
$COMMCN  EQU   $CDSFLGS                                                 03158000
$CUSTSYM EQU   $CDSFLGS                                                 03159000
$TWOCHSW EQU   $CDSFLGS                                                 03160000
$SYMNAME EQU   $CDSFLGS                                                 03161000
$EXTINTC EQU   $CDSFLGS                                                 03162000
$CEVOL   EQU   $CDSFLGS                                                 03163000
$SHARED  EQU   $CDSFLGS                                                 03164000
$FPM     EQU   $CDSFLGS                                                 03165000
$LASTSUB EQU   $PDEVFLG                                                 03166000
@NM00009 EQU   $PDEVFLG                                                 03167000
@NM00008 EQU   $PDEVFLG                                                 03168000
@NM00007 EQU   $PDEVFLG                                                 03169000
$LASTDEV EQU   $PDEVFLG                                                 03170000
@NM00006 EQU   $PDEVFLG                                                 03171000
$EXFILPT EQU   $PDEVFLG                                                 03172000
$FPMOLD  EQU   $PDEVFLG                                                 03173000
$TSSSYM  EQU   $SCTTBLE+8                                               03174000
$SCTLEVL EQU   $SCTTBLE+7                                               03175000
$DRIVER  EQU   $SCTTBLE+6                                               03176000
$RT0916  EQU   $SCTTBLE+5                                               03177000
$RT0108  EQU   $SCTTBLE+4                                               03178000
$LOOPTST EQU   $ERROPT                                                  03179000
$LOOPERR EQU   $ERROPT                                                  03180000
$NERRPRT EQU   $ERROPT                                                  03181000
$NOCNTRL EQU   $ERROPT                                                  03182000
$ALTPRNT EQU   $ERROPT                                                  03183000
$CATERR  EQU   $ERROPT                                                  03184000
$ASTERIK EQU   $ERROPT                                                  03185000
$TESTERR EQU   $ERROPT                                                  03186000
$FSTCOMM EQU   $TESTOPT                                                 03187000
$INDEFLP EQU   $TESTOPT                                                 03188000
$NOPRT   EQU   $TESTOPT                                                 03189000
$PARAPRT EQU   $TESTOPT                                                 03190000
@NM00005 EQU   $TESTOPT                                                 03191000
$ERRLPCT EQU   $SCTTBLE                                                 03192000
$TLTEND  EQU   $RCAAREA+945                                             03193000
$CNSLID  EQU   $RCAAREA+936                                             03194000
@NM00004 EQU   $RCAAREA+605                                             03195000
$VTAMEND EQU   $RCAFLG                                                  03196000
$TPPOSTD EQU   $RCAFLG                                                  03197000
$NEWCT   EQU   $RCAFLG                                                  03198000
$ABNDALL EQU   $RCAFLG                                                  03199000
$CUTESTB EQU   $RCAFLG                                                  03200000
$CONSOLE EQU   $RCAFLG                                                  03201000
$TPLOGON EQU   $RCAFLG                                                  03202000
$UPDATE  EQU   $RCAFLG                                                  03203000
$DEVAREA EQU   $RCAAREA+600                                             03204000
$CTDVAR  EQU   $RCAAREA+596                                             03205000
$BUFFS   EQU   $RCAAREA+464                                             03206000
$TLTNIB  EQU   $CONSTNT+140                                             03207000
$TLTPRPL EQU   $CONSTNT+20                                              03208000
@NM00003 EQU   $CONSTNT+4                                               03209000
@NM00002 EQU   $CONSTNT+2                                               03210000
$USECNT  EQU   $CONSTNT                                                 03211000
$CURRTWA EQU   $POINTER+140                                             03212000
$CTNAME  EQU   $POINTER+132                                             03213000
$CTARGX  EQU   $POINTER+128                                             03214000
$COMINT  EQU   $POINTER+120                                             03215000
$QUEHNDL EQU   $POINTER+116                                             03216000
@NM00001 EQU   $POINTER+36                                              03217000
$RTNPTR  EQU   $POINTER+32                                              03218000
$TLTECB1 EQU   $POINTER+24                                              03219000
$CLEANP  EQU   $POINTER+20                                              03220000
$ABEND   EQU   $POINTER+16                                              03221000
$LSTAREA EQU   $POINTER+12                                              03222000
$FSTAREA EQU   $POINTER+8                                               03223000
$CVTSAVE EQU   $POINTER+4                                               03224000
$TOLTEP  EQU   $POINTER                                                 03225000
$TLTACB  EQU   $RCAAREA                                                 03226000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03227000
@RT00163 EQU   C16C0225                                                 03228000
@RT00172 EQU   C16C0253                                                 03229000
@RT00177 EQU   C16C0100                                                 03230000
@RF00177 EQU   C16C0225                                                 03231000
@RT00193 EQU   C16C0253                                                 03232000
@RT00209 EQU   C16C0075                                                 03233000
@RT00230 EQU   C16C0075                                                 03234000
@RT00278 EQU   C16C0300                                                 03235000
@RT00281 EQU   C16C0300                                                 03236000
@RF00281 EQU   C16C0075                                                 03237000
@RT00284 EQU   C16C0075                                                 03238000
@RC00286 EQU   C16C0300                                                 03239000
@RT00313 EQU   C16C0075                                                 03240000
@RT00316 EQU   C16C0250                                                 03241000
@RT00322 EQU   C16C0075                                                 03242000
@RT00331 EQU   C16C0250                                                 03243000
@RF00331 EQU   C16C0256                                                 03244000
@RF00328 EQU   C16C0075                                                 03245000
@RT00343 EQU   C16C0256                                                 03246000
@RT00371 EQU   C16C1025                                                 03247000
@RF00365 EQU   C16C1050                                                 03248000
@RC00418 EQU   @RC00416                                                 03249000
@RC00423 EQU   @RC00416                                                 03250000
@RC00439 EQU   @RC00438                                                 03251000
@RT00523 EQU   C16C0905                                                 03252000
@PB00007 EQU   @PB00008                                                 03253000
@PB00006 EQU   @PB00007                                                 03254000
@PB00005 EQU   @PB00006                                                 03255000
@PB00004 EQU   @PB00005                                                 03256000
@PB00003 EQU   @PB00004                                                 03257000
@PB00002 EQU   @PB00003                                                 03258000
@ENDDATA EQU   *                                                        03259000
         END   ISTCC016,(C'PLS1039',0702,78336)                         03260000
