SVTM     TITLE ' COMMAND FAC-- ISTCFCRP -- POI REPLY PROCESSOR'         00001000
*                                                               01S0001 00002000
ISTCFCRP CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'ISTCFCRP  79.038'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
*/*A-000000-999999                                           @X50BHK6*/ 00014000
*                                                               01S0002 00015000
*   DO;                             /* ISTREG ALL                    */ 00016000
*   END;                            /* ISTREG                        */ 00017000
*                                                               01S0004 00018000
*/*                                                                  */ 00019000
*/*      COMMUNICATION VECTOR TABLE                                  */ 00020000
*/*                                                                  */ 00021000
*/*      OS/VS2 SU39, 02/25/77, LEVEL=1                              */ 00022000
*/*                                                                  */ 00023000
*/*  METHOD OF ACCESS                                                */ 00024000
*/*      PL/S - DCL CVTPTR PTR                                       */ 00025000
*/*      BAL  - DSECT=YES SHOULD BE SPECIFIED ON MACRO CALL EXCEPT   */ 00026000
*/*             WHEN CALLED DURING SYSGEN TO CREATE CSECT.  CVT FOR  */ 00027000
*/*             OS/VS2 IS MAPPED UNLESS SYS=AOS1 IS SPECIFIED.  THE  */ 00028000
*/*             PREFIX IS NOT MAPPED UNLESS PREFIX=YES IS SPECIFIED. */ 00029000
*/*             A USING ON CVTMAP OR DSECT NAME WILL ESTABLISH       */ 00030000
*/*             ADDRESSABILITY FOR ALL SYMBOLS EXCEPT IN THE 2       */ 00031000
*/*             EXTENSIONS.  TO ESTABLISH ADDRESSABILITY FOR THE     */ 00032000
*/*             OS - OS/VS COMMON EXTENSION, YOU SHOULD CODE         */ 00033000
*/*                                                                  */ 00034000
*/*             L     REG,CVTEXT1                                    */ 00035000
*/*             USING CVTXTNT1,REG                                   */ 00036000
*/*                                                                  */ 00037000
*/*             TO ESTABLISH ADDRESSABILITY FOR THE OS/VS1 - OS/VS2  */ 00038000
*/*             COMMON EXTENSION, YOU SHOULD CODE                    */ 00039000
*/*                                                                  */ 00040000
*/*             L     REG,CVTEXT2                                    */ 00041000
*/*             USING CVTXTNT2,REG                                   */ 00042000
*/*                                                                  */ 00043000
*/*             WHERE REG IN EITHER CASE IS ANY REGISTER OTHER       */ 00044000
*/*             THAN ZERO.                                           */ 00045000
*/*                                                                  */ 00046000
*/*             WHEN LISTING IS SUPPRESSED, YOU CAN DETERMINE WHICH  */ 00047000
*/*             DSECT A SYMBOL IS IN BY USING THE STATEMENT NUMBER   */ 00048000
*/*             IN THE DEFN COLUMN IN THE CROSS REFERENCE LISTING.   */ 00049000
*/*             FOR EXAMPLE, ANY SYMBOL DEFINED BETWEEN THE          */ 00050000
*/*             STATEMENT NUMBERS FOR CVTXTNT1 AND CVTXTNT2 IS IN    */ 00051000
*/*             THE OS - OS/VS COMMON EXTENSION.                     */ 00052000
*/*                                                                  */ 00053000
*/*  F.E.'S                                                          */ 00054000
*/*      MICROFICHE LISTING - CVT                                    */ 00055000
*/*                                                                  */ 00056000
*/*  DEVELOPERS                                                      */ 00057000
*/*      BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL               */ 00058000
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE INCLUDE        */ 00059000
*/*                                                                  */ 00060000
*/*      FOR INTEGRATION, A LISTING MUST NOT BE REQUESTED UNLESS     */ 00061000
*/*      YOUR MODULE CREATES THE CSECT.                              */ 00062000
*                                                               01S0004 00063000
*                                                               01S0004 00064000
*/*                    CVT PROPER                                    */ 00065000
*                                                               01S0004 00066000
*   DECLARE                                                     01S0004 00067000
*     1 CVTMAP BASED(CVTPTR) BDY(WORD),                         01S0004 00068000
*      2 CVT CHAR(0) BDY(WORD),     /* BEGINNING OF CVT MDC150       */ 00069000
*      2 CVTTCBP PTR(31),           /* ADDRESS OF A DOUBLE WORD, THE    00070000
*                                      FIRST CONTAINING THE NEXT-TO-    00071000
*                                      BE-DISPATCHED TCB ADDRESS. THE   00072000
*                                      SECOND CONTAINING THE LAST       00073000
*                                      (CURRENT) TCB ADDRESS. BOTH      00074000
*                                      WORDS ARE IDENTICAL UNLESS THE   00075000
*                                      TASK GOES INTO A WAIT STATE.     00076000
*                                      WHEN IN A WAIT STATE, THE        00077000
*                                      FIRST WORD IS SET TO ZERO        00078000
*                                      UNTIL THE WAITING IS OVER AND    00079000
*                                      THEN BOTH WORDS ARE ONCE AGAIN   00080000
*                                      IDENTICAL. (OS/VS1) ADDRESS OF   00081000
*                                      4-WORD LIST OF ADDRESSES - THE   00082000
*                                      NEXT TCB, THE CURRENT TCB, THE   00083000
*                                      NEXT ASCB AND THE CURRENT        00084000
*                                      ASCB, IN THAT ORDER (OS/VS2)     00085000
*                                      MDC026                        */ 00086000
*      2 CVT0EF00 PTR(31),          /* ADDRESS OF ROUTINE TO SCHEDULE   00087000
*                                      ASYNCHRONOUS EXITS            */ 00088000
*      2 CVTLINK PTR(31),           /* ADDRESS OF DCB FOR       01S0004 00089000
*                                      SYS1.LINKLIB DATA SET         */ 00090000
*      2 CVTJOB PTR(31),            /* ADDRESS OF QUEUE MANAGER 01S0004 00091000
*                                      RESIDENT DATA AREA (QMRES)       00092000
*                                      (OS/VS1) (MDC083)       XM4042*/ 00093000
*      2 CVTBUF PTR(31),            /* ADDRESS OF THE BUFFER OF THE     00094000
*                                      RESIDENT CONSOLE INTERRUPT       00095000
*                                      ROUTINE                       */ 00096000
*      2 CVTXAPG PTR(31),           /* ADDRESS OF I/O SUPERVISOR        00097000
*                                      APPENDAGE VECTOR TABLE        */ 00098000
*      2 CVT0VL00 PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00099000
*                                      TASK SUPERVISOR'S ADDRESS        00100000
*                                      VALIDITY CHECKING ROUTINE     */ 00101000
*      2 CVTPCNVT PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00102000
*                                      ROUTINE WHICH CONVERTS A 01S0004 00103000
*                                      RELATIVE TRACK ADDRESS (TTR)     00104000
*                                      TO AN ABSOLUTE TRACK ADDRESS     00105000
*                                      (MBBCCHHR)                    */ 00106000
*      2 CVTPRLTV PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00107000
*                                      ROUTINE WHICH CONVERTS AN        00108000
*                                      ABSOLUTE TRACK ADDRESS   01S0004 00109000
*                                      (MBBCCHHR) TO A RELATIVE TRACK   00110000
*                                      ADDRESS (TTR)                 */ 00111000
*      2 CVTILK1 PTR(31),           /* ADDRESS OF THE CHANNEL AND       00112000
*                                      CONTROL UNIT PORTION OF THE      00113000
*                                      UCB LOOKUP TABLE              */ 00114000
*      2 CVTILK2 PTR(31),           /* ADDRESS OF THE UCB HALFWORD      00115000
*                                      ADDRESS LIST PORTION OF THE      00116000
*                                      UCB LOOKUP TABLE              */ 00117000
*      2 CVTXTLER PTR(31),          /* ADDRESS OF ERROR RECOVERY        00118000
*                                      PROCEDURE (ERP) LOADER   01S0004 00119000
*                                      (IECVERPL) ENTRY POINT   01S0004 00120000
*                                      IECXTLER (MDC349)     @Z40AQ9A*/ 00121000
*      2 CVTSYSAD PTR(31),          /* ADDRESS OF THE SYSTEM    01S0004 00122000
*                                      RESIDENCE VOLUME ENTRY IN THE    00123000
*                                      UCB LOOKUP TABLE              */ 00124000
*      2 CVTBTERM PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00125000
*                                      ABTERM ROUTINE                */ 00126000
*      2 CVTDATE CHAR(4) BDY(WORD), /* CURRENT DATE IN PACKED DECIMAL*/ 00127000
*      2 CVTMSLT PTR(31),           /* ADDRESS OF THE MASTER COMMON     00128000
*                                      AREA IN MASTER SCHEDULER 01S0004 00129000
*                                      RESIDENT DATA AREA. NOTE - USE   00130000
*                                      CVTMSER INSTEAD TO ADDRESS       00131000
*                                      MASTER SCHEDULER RESIDENT DATA   00132000
*                                      AREA.                         */ 00133000
*      2 CVTZDTAB PTR(31),          /* ADDRESS OF I/O DEVICE    01S0004 00134000
*                                      CHARACTERISTIC TABLE          */ 00135000
*      2 CVTXITP PTR(31),           /* ADDRESS OF ERROR INTERPRETER     00136000
*                                      ROUTINE                       */ 00137000
*      2 CVTDAR PTR(31),            /* SAME AS CVTDARA BELOW (OS/VS1)   00138000
*                                      MDC029                        */ 00139000
*       3 CVTFLGS1 BIT(8),          /* FLAG BYTE (OS/VS1) MDC030     */ 00140000
*        4 CVTDMPLK BIT(1),         /* SVC DUMP IS IN PROGRESS  01S0004 00141000
*                                      (OS/VS1) MDC030               */ 00142000
*        4 CVTRSV01 BIT(1),         /* RESERVED                      */ 00143000
*        4 CVTRSV02 BIT(1),         /* RESERVED                      */ 00144000
*        4 CVTRSV03 BIT(1),         /* RESERVED                      */ 00145000
*        4 CVTRSV04 BIT(1),         /* RESERVED                      */ 00146000
*        4 CVTRSV05 BIT(1),         /* RESERVED                      */ 00147000
*        4 CVTRSV06 BIT(1),         /* RESERVED                      */ 00148000
*        4 CVTRSV07 BIT(1),         /* RESERVED                      */ 00149000
*       3 CVTDARA PTR(24),          /* ADDRESS OF THE SYS1.DUMP I/O     00150000
*                                      CONTROL BLOCKS NEEDED BY 01S0004 00151000
*                                      ABEND'S DAMAGE ASSESSMENT        00152000
*                                      ROUTINE (DAR) (OS/VS1) MDC029 */ 00153000
*      2 CVT0FN00 PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00154000
*                                      FINCH ROUTINE (OS/VS1)        */ 00155000
*      2 CVTEXIT CHAR(2) BDY(WORD), /* AN SVC 3 INSTRUCTION. EXIT TO    00156000
*                                      DISPATCHER.                   */ 00157000
*      2 CVTBRET CHAR(2) BDY(WORD,3),/* A BCR 15,14 INSTRUCTION.        00158000
*                                      RETURN TO CALLER (USED BY DATA   00159000
*                                      MANAGEMENT ROUTINES)          */ 00160000
*      2 CVTSVDCB PTR(31),          /* ADDRESS OF THE DCB FOR THE       00161000
*                                      SYS1.SVCLIB DATA SET          */ 00162000
*      2 CVTTPC PTR(31),            /* ADDRESS OF THE TIMER     01S0004 00163000
*                                      SUPERVISOR WORK AREA          */ 00164000
*      2 CVTPBLDL PTR(31),          /* ADDRESS OF BRANCH AND LINK       00165000
*                                      (BALR) ENTRY POINT OF THE BLDL   00166000
*                                      ROUTINE (OS/VS1) MDC103       */ 00167000
*      2 CVTSJQ PTR(31),            /* ADDRESS OF THE SELECTED JOB      00168000
*                                      QUEUE (OS/VS1)                */ 00169000
*      2 CVTCUCB PTR(31),           /* ADDRESS OF THE TABLE THAT        00170000
*                                      CONTAINS THE CURRENT CONSOLE     00171000
*                                      UCB ADDRESSES                 */ 00172000
*      2 CVTQTE00 PTR(31),          /* ADDRESS OF THE TIMER ENQUEUE     00173000
*                                      ROUTINE FOR INTERVAL TIMER    */ 00174000
*      2 CVTQTD00 PTR(31),          /* ADDRESS OF THE TIMER DEQUEUE     00175000
*                                      ROUTINE FOR INTERVAL TIMER    */ 00176000
*      2 CVTSTB PTR(31),            /* ADDRESS OF THE I/O DEVICE        00177000
*                                      STATISTICS TABLE              */ 00178000
*      2 CVTDCB CHAR(1) BDY(WORD),  /* OPERATING SYSTEM CONFIGURATION*/ 00179000
*        4 CVTRSV08 BIT(1),         /* RESERVED                      */ 00180000
*        4 CVT1SSS BIT(1),          /* PCP                           */ 00181000
*        4 CVT2SPS BIT(1),          /* MFT, OS/VS1                   */ 00182000
*        4 CVT4MS1 BIT(1),          /* MVT, OS/VS2                   */ 00183000
*        4 CVTRSV09 BIT(1),         /* RESERVED                      */ 00184000
*        4 CVT4MPS BIT(1),          /* MODEL 65 MULTIPROCESSING      */ 00185000
*        4 CVT6DAT BIT(1),          /* DYNAMIC ADDRESS TRANSLATION BY   00186000
*                                      CPU (OS/VS1, OS/VS2)          */ 00187000
*        4 CVTMVS2 BIT(1),          /* MULTIPLE MEMORY OPTION OF        00188000
*                                      OS/VS2 IS PRESENT MDC131      */ 00189000
*      2 CVTDCBA PTR(24),           /* ADDRESS OF THE DCB FOR THE       00190000
*                                      SYS1.LOGREC (OUTBOARD    01S0004 00191000
*                                      RECORDER) DATA SET FOR SYSTEM    00192000
*                                      ENVIRONMENT RECORDING (SER)   */ 00193000
*      2 CVTIOQET PTR(31),          /* ADDRESS OF IOS REQUEST ELEMENT   00194000
*                                      TABLE (OS/VS1) MDC020         */ 00195000
*      2 CVTIXAVL PTR(31),          /* ADDRESS OF THE I/O       01S0004 00196000
*                                      SUPERVISOR'S FREELIST POINTER    00197000
*                                      WHICH CONTAINS THE ADDRESS OF    00198000
*                                      THE NEXT REQUEST ELEMENT 01S0004 00199000
*                                      (OS/VS1) ADDRESS OF THE I/O      00200000
*                                      SUPERVISOR'S COMMUNICATION       00201000
*                                      AREA (IOCOM) (OS/VS2)         */ 00202000
*      2 CVTNUCB PTR(31),           /* LOWEST ADDRESS NOT IN THE        00203000
*                                      NUCLEUS (ON PAGE BOUNDARY FOR    00204000
*                                      OS/VS1) (ON SEGMENT BOUNDARY     00205000
*                                      FOR OS/VS2) (MDC318)  @Z30AQ9A*/ 00206000
*      2 CVTFBOSV PTR(31),          /* ADDRESS OF PROGRAM FETCH 01S0004 00207000
*                                      ROUTINE                       */ 00208000
*      2 CVT0DS PTR(31),            /* ADDRESS OF ENTRY POINT OF THE    00209000
*                                      DISPATCHER                    */ 00210000
*      2 CVTILCH PTR(31),           /* ADDRESS OF THE LOGICAL CHANNEL   00211000
*                                      WORD TABLE                    */ 00212000
*      2 CVTIERLC PTR(31),          /* ADDRESS OF THE ASYNCHRONOUS      00213000
*                                      EXIT QUEUE (OS/VS1) (MDC218)     00214000
*                                                              YM4043*/ 00215000
*       3 CVTRV516 PTR(31),         /* ** CVTIERLC FIELD UNUSED IN      00216000
*                                      MVS ** (MDC218)         YM4043*/ 00217000
*      2 CVTMSER PTR(31),           /* ADDRESS OF DATA AREA OF MASTER   00218000
*                                      SCHEDULER RESIDENT DATA AREA  */ 00219000
*      2 CVT0PT01 PTR(31),          /* ADDRESS OF BRANCH ENTRY POINT    00220000
*                                      OF POST ROUTINE               */ 00221000
*      2 CVTRSV11 PTR(31),          /* ** CVTTRMTB FIELD UNUSED IN      00222000
*                                      OS/VS **                      */ 00223000
*      2 CVTHEAD PTR(31),           /* ADDRESS OF THE HIGHEST   01S0004 00224000
*                                      PRIORITY TCB IN THE READY        00225000
*                                      QUEUE (OS/VS1) MDC025         */ 00226000
*      2 CVTMZ00 PTR(31),           /* HIGHEST ADDRESS IN VIRTUAL       00227000
*                                      STORAGE FOR THE MACHINE       */ 00228000
*      2 CVT1EF00 PTR(31),          /* ADDRESS OF ROUTINE WHICH 01S0004 00229000
*                                      CREATES IRB'S FOR EXITS       */ 00230000
*      2 CVTQOCR PTR(31),           /* GRAPHICS INTERFACE TASK (GFX)    00231000
*                                      FIELD. ADDRESS OF SEVENTH WORD   00232000
*                                      OF GFX PARAMETER LIST, IF GFX    00233000
*                                      IS ACTIVE. ZERO IF GFX IS NOT    00234000
*                                      ACTIVE.                       */ 00235000
*      2 CVTQMWR PTR(31),           /* ADDRESS OF QUEUE MANAGER'S       00236000
*                                      SYSTEM OUTPUT COMMUNICATIONS-    00237000
*                                      DATA-AREA (CDA), WHICH IS        00238000
*                                      STORED ON AN EXTERNAL DEVICE  */ 00239000
*      2 CVTSNCTR FIXED(15),        /* SERIAL NUMBER COUNTER FOR        00240000
*                                      ASSIGNING SERIAL NUMBERS TO      00241000
*                                      NON-SPECIFIC, UNLABELED  01S0004 00242000
*                                      MAGNETIC TAPE VOLUMES         */ 00243000
*      2 CVTOPTA CHAR(1),           /* OPTION INDICATORS             */ 00244000
*       3 CVTCCH BIT(1),            /* CHANNEL CHECK HANDLER (CCH)      00245000
*                                      OPTION PRESENT - RECOVERY        00246000
*                                      MANAGEMENT SUPPORT (RMS) 01S0004 00247000
*                                                              XM4686*/ 00248000
*       3 CVTAPR BIT(1),            /* ALTERNATE PATH RETRY (APR)       00249000
*                                      OPTION PRESENT - RECOVERY        00250000
*                                      MANAGEMENT SUPPORT (RMS)      */ 00251000
*       3 CVTDDR BIT(1),            /* DYNAMIC DEVICE RECONFIGURATION   00252000
*                                      (DDR) OPTION PRESENT -   01S0004 00253000
*                                      RECOVERY MANAGEMENT SUPPORT      00254000
*                                      (RMS) (OS/VS1) DDR       01S0004 00255000
*                                      SYSTEM-INITIATED SWAP ACTIVE     00256000
*                                      (OS/VS2) MDC126               */ 00257000
*       3 CVTNIP BIT(1),            /* NIP IS EXECUTING              */ 00258000
*       3 CVTRSV12 BIT(1),          /* RESERVED                      */ 00259000
*       3 CVTRSV13 BIT(1),          /* RESERVED                      */ 00260000
*       3 CVTASCII BIT(1),          /* ASCII TAPE PROCESSING IS 01S0004 00261000
*                                      GENERATED IN THIS SYSTEM      */ 00262000
*       3 CVTXPFP BIT(1),           /* CPU HAS EXTENDED PRECISION       00263000
*                                      FLOATING POINT FEATURE        */ 00264000
*      2 CVTOPTB CHAR(1),           /* MISCELLANEOUS FLAGS           */ 00265000
*       3 CVTPROT BIT(1),           /* CPU HAS STORE PROTECTION 01S0004 00266000
*                                      FEATURE (OS/VS1)              */ 00267000
*       3 CVTCTIMS BIT(1),          /* IF ON, HARDWARE HAS THE CLOCK    00268000
*                                      COMPARATOR AND CPU TIMER 01S0004 00269000
*                                      FEATURE INSTALLED, AND OS/VS1    00270000
*                                      SYSGEN HAS SPECIFIED THIS        00271000
*                                      FEATURE (OS/VS1) MDC127       */ 00272000
*       3 CVTTOD BIT(1),            /* CPU HAS TIME-OF-DAY CLOCK        00273000
*                                      FEATURE                       */ 00274000
*       3 CVTNLOG BIT(1),           /* SYS1.LOGREC IS UNAVAILABLE FOR   00275000
*                                      ERROR RECORDING. ALWAYS SET TO   00276000
*                                      ZERO FOR OS/VS1 ICB382        */ 00277000
*       3 CVTAPTHR BIT(1),          /* NIP SETS THIS BIT TO 1 WHEN      00278000
*                                      DEVICE TESTING IS COMPLETE. IF   00279000
*                                      1, I/O SUPERVISOR USES AN        00280000
*                                      ALTERNATE PATH TO A DEVICE       00281000
*                                      WHEN A CONDITION CODE OF 3       00282000
*                                      EXISTS. THIS BIT IS RESET BY     00283000
*                                      NIP TO 0 AFTER THE LINK PACK     00284000
*                                      AREA IS INITIALIZED.    YM2670*/ 00285000
*       3 CVTFP BIT(1),             /* CPU HAS FETCH PROTECTION 01S0004 00286000
*                                      FEATURE (OS/VS1) ICB427       */ 00287000
*       3 CVTVS1A BIT(1),           /* VS1 ASSIST IS AVAILABLE FOR      00288000
*                                      USE (OS/VS1) (MDC353) @X60CA9A*/ 00289000
*       3 CVTVS1B BIT(1),           /* VS1 ASSIST SUBSET IS AVAILABLE   00290000
*                                      FOR USE (OS/VS1) (MDC365)        00291000
*                                                            @X60KU9A*/ 00292000
*      2 CVTQCDSR PTR(31),          /* CDE SEARCH ROUTINE ADDRESS       00293000
*                                      (OS/VS2) ADDRESS OF THE  01S0004 00294000
*                                      ROUTINE THAT SEARCHES THE        00295000
*                                      REENTERABLE LOAD MODULE QUEUE    00296000
*                                      (OS/VS1)                      */ 00297000
*      2 CVTQLPAQ PTR(31),          /* ADDRESS OF POINTER TO MOST       00298000
*                                      RECENT ENTRY ON LINK PACK AREA   00299000
*                                      CDE QUEUE (OS/VS2) ADDRESS OF    00300000
*                                      THE REENTERABLE LOAD MODULE      00301000
*                                      QUEUE (OS/VS1)                */ 00302000
*      2 CVTRSV18 PTR(31),          /* ** CVTMPCVT FIELD UNUSED IN      00303000
*                                      OS/VS **                      */ 00304000
*      2 CVTSMCA PTR(31),           /* ADDRESS OF THE SYSTEM    01S0004 00305000
*                                      MANAGEMENT CONTROL AREA (SMCA)   00306000
*                                      IF THE SYSTEM MANAGEMENT 01S0004 00307000
*                                      FACILITIES (SMF) OPTION IS       00308000
*                                      PRESENT IN THE SYSTEM.   01S0004 00309000
*                                      OTHERWISE, ZERO.              */ 00310000
*      2 CVTABEND PTR(31),          /* ADDRESS OF SECONDARY CVT FOR     00311000
*                                      ABEND IN EOT (OS/VS2) USED BY    00312000
*                                      AN INTERNAL ABEND TRACE  01S0004 00313000
*                                      ROUTINE FOR DEBUG PURPOSES       00314000
*                                      (OS/VS1)                XM0615*/ 00315000
*      2 CVTUSER PTR(31),           /* A WORD AVAILABLE TO THE USER  */ 00316000
*      2 CVTMDLDS PTR(31),          /* RESERVED FOR MODEL-DEPENDENT     00317000
*                                      SUPPORT                       */ 00318000
*      2 CVTQABST CHAR(2) BDY(WORD),/* AN SVC 13 (ABEND) INSTRUCTION    00319000
*                                      (OS/VS2) RESERVED (OS/VS1)    */ 00320000
*      2 CVTLNKSC CHAR(2) BDY(WORD,3),/* AN SVC 6 (LINK) INSTRUCTION    00321000
*                                      ICB369                        */ 00322000
*      2 CVTTSCE PTR(31),           /* ADDRESS OF THE FIRST TIME        00323000
*                                      SLICE CONTROL ELEMENT (TSCE)  */ 00324000
*      2 CVTPATCH PTR(31),          /* ADDRESS OF A 200-BYTE FE PATCH   00325000
*                                      AREA                          */ 00326000
*      2 CVTRMS PTR(31),            /* RECOVERY MANAGEMENT SUPPORT      00327000
*                                      (RMS) COMMUNICATIONS VECTOR.     00328000
*                                      ADDRESS OF A MACHINE STATUS      00329000
*                                      BLOCK.                        */ 00330000
*      2 CVTRV515 PTR(31),          /* ** CVTTSCVT FIELD UNUSED IN      00331000
*                                      MVS ** (MDC037)       @Z40AQ9A*/ 00332000
*      2 CVT0SCR1 PTR(31),          /* ADDRESS OF THE SECTOR    01S0004 00333000
*                                      CALCULATION ROUTINE FOR  01S0004 00334000
*                                      ROTATIONAL POSITION SENSING      00335000
*                                      (RPS)                         */ 00336000
*      2 CVTGTF PTR(31),            /* GENERALIZED TRACE FACILITY       00337000
*                                      (GTF) CONTROL WORD ICB312     */ 00338000
*       3 CVTGTFST BIT(8),          /* GTF FLAG BYTE ICB312          */ 00339000
*        4 CVTGTFS BIT(2),          /* GTF STATUS (OS/VS1) MDC088    */ 00340000
*         5 CVTGTFAV BIT(1),        /* IF ZERO, GTF NOT ACTIVE. IF      00341000
*                                      ONE, GTF ACTIVE. (OS/VS2)        00342000
*                                      MDC098                        */ 00343000
*         5 CVTRV315 BIT(1),        /* RESERVED (OS/VS2)             */ 00344000
*        4 CVTSTATE BIT(1),         /* GTF IS IN CONTROL PROCESSING A   00345000
*                                      HOOK (OS/VS1) MDC093          */ 00346000
*         5 CVTRV316 BIT(1),        /* RESERVED (OS/VS2)             */ 00347000
*        4 CVTTMODE BIT(1),         /* IF 0, MODE=INT SPECIFIED. IF     00348000
*                                      1, MODE=EXT SPECIFIED WHICH      00349000
*                                      MEANS TRACE DATA IS TO BE        00350000
*                                      WRITTEN TO AN EXTERNAL DEVICE.   00351000
*                                      (OS/VS1) MDC094               */ 00352000
*         5 CVTRV317 BIT(1),        /* RESERVED (OS/VS2)             */ 00353000
*        4 CVTFORM BIT(1),          /* TRACE DATA IS TO BE FORMATTED    00354000
*                                      ON ABNORMAL TERMINATION  01S0004 00355000
*                                      (OS/VS1) MDC095               */ 00356000
*         5 CVTRV318 BIT(1),        /* RESERVED (OS/VS2)             */ 00357000
*        4 CVTUSR BIT(1),           /* TRACE=USR SPECIFIED.     01S0004 00358000
*                                      USER-REQUESTED TRACE DATA IS     00359000
*                                      TO BE INCLUDED IN THE TRACE      00360000
*                                      DATA SET. (MDC317)    @Z30AP9A*/ 00361000
*        4 CVTRNIO BIT(1),          /* GTF IS ACTIVE AND TRACING RNIO   00362000
*                                      EVENTS MDC187                 */ 00363000
*        4 CVTRSV27 BIT(1),         /* RESERVED                      */ 00364000
*       3 CVTGTFA PTR(24),          /* ADDRESS OF THE MONITOR CALL      00365000
*                                      VECTOR TABLE (OS/VS1) ADDRESS    00366000
*                                      OF MAIN MONITOR CALL ROUTING     00367000
*                                      TABLE, MCHEAD (OS/VS2) MDC156 */ 00368000
*      2 CVTAQAVT PTR(31),          /* ADDRESS OF THE FIRST WORD OF     00369000
*                                      THE TCAM DISPATCHER WHICH        00370000
*                                      CONTAINS THE ADDRESS OF THE      00371000
*                                      ADDRESS VECTOR TABLE (AVT). IF   00372000
*                                      ZERO, TCAM IS NOT STARTED     */ 00373000
*       3 CVTTCMFG CHAR(1),         /* TCAM FLAGS                    */ 00374000
*        4 CVTTCRDY BIT(1),         /* TCAM IS READY TO ACCEPT USERS */ 00375000
*        4 CVTLDEV BIT(1),          /* LOCAL DEVICE ATTACHED TO TCAM    00376000
*                                      (MDC357)              @Z40XA9A*/ 00377000
*        4 CVTRSV29 BIT(1),         /* RESERVED                      */ 00378000
*        4 CVTRSV30 BIT(1),         /* RESERVED                      */ 00379000
*        4 CVTRSV31 BIT(1),         /* RESERVED                      */ 00380000
*        4 CVTRSV32 BIT(1),         /* RESERVED                      */ 00381000
*        4 CVTRSV33 BIT(1),         /* RESERVED                      */ 00382000
*        4 CVTRSV34 BIT(1),         /* RESERVED                      */ 00383000
*       3 CVTAQAVB PTR(24),         /* SAME AS CVTAQAVT ABOVE        */ 00384000
*      2 CVTVOLM2 PTR(31),          /* ADDRESS OF TABLE FOR POWER       00385000
*                                      WARNING FEATURE (PWF) (OS/VS2)   00386000
*                                      (MDC308)              @Z30AQ9A*/ 00387000
*       3 CVTTATA PTR(31),          /* ADDRESS OF THE FIRST ENTRY IN    00388000
*                                      THE TCB ADDRESS TABLE. THE       00389000
*                                      FIRST ENTRY IS FOR PARTITION     00390000
*                                      0. (OS/VS1)                   */ 00391000
*        4 CVTTSKS PTR(8),          /* MAXIMUM ALLOWABLE NUMBER OF      00392000
*                                      ENTRIES IN THE TCB ADDRESS       00393000
*                                      TABLE (OS/VS1)                */ 00394000
*         5 CVTVOLF2 BIT(8),        /* PWF FLAG BYTE. THIS BYTE IS      00395000
*                                      OVERLAID BY CVTVOLM2 AFTER PWF   00396000
*                                      INITIALIZATION. (OS/VS2) 01S0004 00397000
*                                      (MDC309)              @Z30AQ9A*/ 00398000
*          6 CVTVOLI2 BIT(1),       /* PWF INITIALIZATION HAS NOT       00399000
*                                      OCCURRED (OS/VS2) (MDC310)       00400000
*                                                            @Z30AQ9A*/ 00401000
*        4 CVTTAT PTR(24),          /* SAME AS CVTTATA ABOVE         */ 00402000
*         5 CVTVOLT2 PTR(24),       /* PWF RECHECK TIME DELAY. THIS     00403000
*                                      VALUE IS OVERLAID BY CVTVOLM2    00404000
*                                      AFTER PWF INITIALIZATION.        00405000
*                                      (OS/VS2) (MDC311)     @Z30AQ9A*/ 00406000
*      2 CVTATER PTR(31),           /* ADDRESS OF THE SYSTEM ERROR      00407000
*                                      TCB. THE PURGE ROUTINE USES      00408000
*                                      THIS FIELD TO ACCESS THE SIRB.   00409000
*                                      (OS/VS1) ICB346               */ 00410000
*       3 CVTSYST PTR(8),           /* NUMBER OF ENTRIES IN THE TCB     00411000
*                                      ADDRESS TABLE FOR TCB'S  01S0004 00412000
*                                      CREATED DURING SYSTEM    01S0004 00413000
*                                      GENERATION (OS/VS1)           */ 00414000
*       3 CVTATERA PTR(24),         /* SAME AS CVTATER ABOVE         */ 00415000
*      2 CVTEXT1 PTR(31),           /* ADDRESS OF OS - OS/VS COMMON     00416000
*                                      EXTENSION ICB421              */ 00417000
*      2 CVTCBSP PTR(31),           /* ADDRESS OF ACCESS METHOD 01S0004 00418000
*                                      CONTROL BLOCK STRUCTURE MDC195*/ 00419000
*      2 CVTPURG PTR(31),           /* ADDRESS OF SUBSYSTEM PURGE       00420000
*                                      ROUTINE ICB330                */ 00421000
*       3 CVTRSV35 PTR(8),          /* RESERVED ICB330               */ 00422000
*       3 CVTPURGA PTR(24),         /* ADDRESS OF SUBSYSTEM PURGE       00423000
*                                      ROUTINE ICB330                */ 00424000
*      2 CVTAMFF CHAR(4),           /* RESERVED FOR ACCESS METHOD       00425000
*                                      FLAGS ICB436                  */ 00426000
*      2 CVTQMSG PTR(31),           /* ADDRESS OF INFORMATION TO BE     00427000
*                                      PRINTED BY ABEND ICB307       */ 00428000
*       3 CVTRSV36 PTR(8),          /* RESERVED ICB307               */ 00429000
*       3 CVTQMSGA PTR(24),         /* ADDRESS OF INFORMATION TO BE     00430000
*                                      PRINTED BY ABEND ICB307       */ 00431000
*      2 CVTDMSR PTR(31),           /* SAME AS CVTDMSRA BELOW ICB346 */ 00432000
*       3 CVTRSV37 PTR(8),          /* RESERVED (OS/VS1) ICB346      */ 00433000
*        4 CVTDMSRF BIT(8),         /* OPEN/CLOSE/EOV FLAG BYTE.        00434000
*                                      SETTING BOTH BIT 0 AND BIT 1     00435000
*                                      ON WILL CAUSE BOTH KINDS OF      00436000
*                                      DUMPS TO BE TAKEN. THESE BITS    00437000
*                                      ARE USED DURING TESTING AND      00438000
*                                      DEBUGGING WHEN OTHER DEBUG       00439000
*                                      METHODS ARE INEFFECTIVE. 01S0004 00440000
*                                      (OS/VS2) (MDC350)     @Z40AQ9A*/ 00441000
*         5 CVTSDUMP BIT(1),        /* SET BY COREZAP. WILL CAUSE AN    00442000
*                                      SDUMP TO BE TAKEN AND IEC999I    00443000
*                                      MESSAGE ISSUED FOR EVERY ABEND   00444000
*                                      ISSUED WITHIN AN         01S0004 00445000
*                                      OPEN/CLOSE/EOV OR DADSM  01S0004 00446000
*                                      FUNCTION. (OS/VS2) (MDC351)      00447000
*                                                            @Z40AQ9A*/ 00448000
*         5 CVTUDUMP BIT(1),        /* SET BY COREZAP. WILL CAUSE AN    00449000
*                                      ABEND DUMP TO BE TAKEN FOR       00450000
*                                      EVERY ABEND ISSUED WITHIN AN     00451000
*                                      OPEN/CLOSE/EOV OR DADSM  01S0004 00452000
*                                      FUNCTION. (OS/VS2) (MDC352)      00453000
*                                                            @Z40AQ9A*/ 00454000
*         5 CVTRV629 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00455000
*         5 CVTRV630 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00456000
*         5 CVTRV631 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00457000
*         5 CVTRV632 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00458000
*         5 CVTRV633 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00459000
*         5 CVTRV634 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00460000
*       3 CVTDMSRA PTR(24),         /* ADDRESS OF THE OPEN/CLOSE/EOV    00461000
*                                      SUPERVISORY ROUTINE IN THE       00462000
*                                      NUCLEUS. THIS ROUTINE HANDLES    00463000
*                                      THE ROUTING OF CONTROL AMONG     00464000
*                                      THE I/O SUPPORT ROUTINES.        00465000
*                                      ICB346                        */ 00466000
*      2 CVTRSV38 PTR(31),          /* RESERVED                      */ 00467000
*      2 CVTRSV39 PTR(31),          /* RESERVED                      */ 00468000
*/*            OS/VS1 - OS/VS2 COMMON SECTION                        */ 00469000
*                                                               01S0004 00470000
*      2 CVTREAL PTR(31),           /* ADDRESS OF THE VIRTUAL STORAGE   00471000
*                                      BYTE FOLLOWING THE HIGHEST       00472000
*                                      VIRTUAL=REAL STORAGE ADDRESS     00473000
*                                      ICB368                        */ 00474000
*      2 CVTPTRV PTR(31),           /* ADDRESS OF PAGING SUPERVISOR     00475000
*                                      GENERAL ROUTINE TO TRANSLATE     00476000
*                                      REAL ADDRESSES TO VIRTUAL        00477000
*                                      ADDRESSES                     */ 00478000
*      2 CVTMODE PTR(31),           /* ADDRESS OF ROUTINE TO CHANGE     00479000
*                                      SYSTEM MASK (OS/VS1) (MDC217)    00480000
*                                                              YM4244*/ 00481000
*      2 CVTJESCT PTR(31),          /* ADDRESS OF JOB ENTRY SUBSYSTEM   00482000
*                                      (JES) CONTROL TABLE           */ 00483000
*      2 CVTJEPS PTR(31),           /* ADDRESS OF JOB ENTRY     01S0004 00484000
*                                      PERIPHERAL SERVICES (JEPS)       00485000
*                                      MONITOR TCB (OS/VS1)    YM2702*/ 00486000
*      2 CVTTZ FIXED(31),           /* DIFFERENCE BETWEEN LOCAL TIME    00487000
*                                      AND GREENWICH MEAN TIME IN       00488000
*                                      BINARY UNITS OF 1.048576 01S0004 00489000
*                                      SECONDS                       */ 00490000
*      2 CVTMCHPR PTR(31),          /* ADDRESS OF MACHINE CHECK 01S0004 00491000
*                                      PARAMETER LIST                */ 00492000
*      2 CVTEORM PTR(31),           /* HIGHEST REAL ADDRESS IN MAIN     00493000
*                                      STORAGE (OS/VS1) POTENTIAL       00494000
*                                      REAL HIGH STORAGE ADDRESS        00495000
*                                      (OS/VS2) MDC087               */ 00496000
*      2 CVTERPV PTR(31),           /* ADDRESS OF I/O SUPERVISOR        00497000
*                                      SUBROUTINE TO CONVERT CCW DATA   00498000
*                                      ADDRESSES TO VIRTUAL ADDRESSES   00499000
*                                      (OS/VS1) (MDC219)       YM4043*/ 00500000
*       3 CVTRV517 PTR(31),         /* ** CVTERPV FIELD UNUSED IN MVS   00501000
*                                      ** (MDC219)             YM4043*/ 00502000
*      2 CVTINTLA PTR(31),          /* ADDRESS OF A TIME INTERVAL.      00503000
*                                      I/O LOAD BALANCING COUNTS THE    00504000
*                                      NUMBER OF EXCP'S ISSUED DURING   00505000
*                                      THIS TIME INTERVAL AND USES      00506000
*                                      THE VALUE IN DETERMINING THE     00507000
*                                      AMOUNT OF I/O ACTIVITY IN THE    00508000
*                                      SYSTEM. (OS/VS1) (MDC220)        00509000
*                                                              YM4043*/ 00510000
*       3 CVTRV518 PTR(31),         /* ** CVTINTLA FIELD UNUSED IN      00511000
*                                      MVS ** (MDC220)         YM4043*/ 00512000
*      2 CVTAPF PTR(31),            /* SAME AS CVTAPFA BELOW ICB360  */ 00513000
*       3 CVTRSV40 PTR(8),          /* RESERVED ICB360               */ 00514000
*       3 CVTAPFA PTR(24),          /* ADDRESS OF BRANCH ENTRY POINT    00515000
*                                      IN AUTHORIZED PROGRAM FACILITY   00516000
*                                      (APF) ROUTINE                 */ 00517000
*      2 CVTEXT2 PTR(31),           /* ADDRESS OF OS/VS1 - OS/VS2       00518000
*                                      COMMON EXTENSION ICB330       */ 00519000
*       3 CVTRSV41 PTR(8),          /* RESERVED ICB330               */ 00520000
*       3 CVTEXT2A PTR(24),         /* SAME AS CVTEXT2 ABOVE ICB330  */ 00521000
*      2 CVTHJES PTR(31),           /* SAME AS CVTHJESA BELOW ICB454 */ 00522000
*       3 CVTRSV42 PTR(8),          /* RESERVED ICB454               */ 00523000
*       3 CVTHJESA PTR(24),         /* ADDRESS OF OPTIONAL JOB ENTRY    00524000
*                                      SUBSYSTEM (JES) COMMUNICATION    00525000
*                                      VECTOR TABLE ICB454           */ 00526000
*      2 CVTRSV43 FIXED(15),        /* RESERVED                      */ 00527000
*      2 CVTRSV44 FIXED(15),        /* RESERVED                      */ 00528000
*      2 CVTRSV45 PTR(31),          /* RESERVED                      */ 00529000
*      2 CVTRSV46 PTR(31),          /* RESERVED                      */ 00530000
*/*            OS/VS1 OVERLAY                                        */ 00531000
*                                                               01S0004 00532000
*      2 CVTPGSIA PTR(31),          /* ADDRESS OF PAGING SUPERVISOR     00533000
*                                      INFORMATION AREA              */ 00534000
*      2 CVTPCVT PTR(31),           /* ADDRESS OF PAGED CVT EXTENSION*/ 00535000
*      2 CVTA1F1 CHAR(1),           /* PAGE FAULT FLAGS              */ 00536000
*       3 CVTPFSW BIT(1),           /* ONLY THE PAGING TASK MAY BE      00537000
*                                      DISPATCHED                    */ 00538000
*       3 CVTSRSW BIT(1),           /* NO TASK EXCEPT THE PAGING TASK   00539000
*                                      MAY EXECUTE DISABLED CODE     */ 00540000
*       3 CVTRSV47 BIT(1),          /* RESERVED                      */ 00541000
*       3 CVTRSV48 BIT(1),          /* RESERVED                      */ 00542000
*       3 CVTRSV49 BIT(1),          /* RESERVED                      */ 00543000
*       3 CVTRSV50 BIT(1),          /* RESERVED                      */ 00544000
*       3 CVTRSV51 BIT(1),          /* RESERVED                      */ 00545000
*       3 CVTRSV52 BIT(1),          /* RESERVED                      */ 00546000
*      2 CVTSYSK CHAR(1),           /* SYSTEM LOCK. IF NOT ZERO, ONLY   00547000
*                                      THE PAGING TASK MAY BE   01S0004 00548000
*                                      DISPATCHED                    */ 00549000
*       3 CVTRSV53 BIT(1),          /* RESERVED                      */ 00550000
*       3 CVTRSV54 BIT(1),          /* RESERVED                      */ 00551000
*       3 CVTRSV55 BIT(1),          /* RESERVED                      */ 00552000
*       3 CVTRSV56 BIT(1),          /* RESERVED                      */ 00553000
*       3 CVTSLKR BIT(1),           /* MACHINE CHECK HANDLING IS IN     00554000
*                                      PROGRESS ICB320               */ 00555000
*       3 CVTSLKQ BIT(1),           /* SYSTEM QUEUE AREA (SQA) HAS      00556000
*                                      BEEN EXHAUSTED                */ 00557000
*       3 CVTSLKP BIT(1),           /* LAST PAGING CONTROL BLOCK        00558000
*                                      (PCB) HAS BEEN USED           */ 00559000
*       3 CVTSLKO BIT(1),           /* A ROUTINE RUNNING DISABLED HAS   00560000
*                                      PRODUCED A PAGE FAULT         */ 00561000
*      2 CVTSULK FIXED(15),         /* SUPERVISOR LOCK. NUMBER OF       00562000
*                                      TASKS ATTEMPTING TO EXECUTE      00563000
*                                      DISABLED ROUTINES. IF NOT        00564000
*                                      ZERO, ONLY ENABLED TASKS MAY     00565000
*                                      RUN.                          */ 00566000
*      2 CVTSMF PTR(31),            /* ADDRESS OF SYSTEM MANAGEMENT     00567000
*                                      FACILITIES (SMF) TCB ICB395   */ 00568000
*      2 CVTPNWFR PTR(31),          /* ADDRESS OF ROUTINE WHICH FREES   00569000
*                                      THE 'EMERGENCY' WORK AREA        00570000
*                                      (ICB413)                XM2452*/ 00571000
*      2 CVTDDCE PTR(31),           /* ADDRESS OF DYNAMIC DISPATCHING   00572000
*                                      CONTROL ELEMENT ICB466        */ 00573000
*      2 CVTRSV57 FIXED(15),        /* RESERVED                      */ 00574000
*      2 CVTRSV58 FIXED(15),        /* RESERVED                      */ 00575000
*      2 CVTSTOA FIXED(31),         /* SAVE AREA FOR THE REAL STORAGE   00576000
*                                      ADDRESS OF THE SEGMENT TABLE     00577000
*                                      ORIGIN ICB496                 */ 00578000
*      2 CVTVOLM1 PTR(31),          /* ADDRESS OF TABLE FOR POWER       00579000
*                                      WARNING FEATURE (PWF) (MDC312)   00580000
*                                                            @X04AQ9A*/ 00581000
*       3 CVTVOLF1 BIT(8),          /* PWF FLAG BYTE. THIS BYTE IS      00582000
*                                      OVERLAID BY CVTVOLM1 AFTER PWF   00583000
*                                      INITIALIZATION. (MDC313) 01S0004 00584000
*                                                            @X04AQ9A*/ 00585000
*        4 CVTVOLI1 BIT(1),         /* PWF INITIALIZATION HAS NOT       00586000
*                                      OCCURRED (MDC314)     @X04AQ9A*/ 00587000
*       3 CVTVOLT1 PTR(24),         /* PWF RECHECK TIME DELAY. THIS     00588000
*                                      VALUE IS OVERLAID BY CVTVOLM1    00589000
*                                      AFTER PWF INITIALIZATION.        00590000
*                                      (MDC315)              @X04AQ9A*/ 00591000
*      2 CVTSU PTR(31),             /* ADDRESS OF SU BIT STRING 01S0004 00592000
*                                      (MDC366)              @X60KV9A*/ 00593000
*      2 CVTRV490 PTR(31),          /* RESERVED (MDC359)     @X60CV9A*/ 00594000
*      2 CVTAUTH PTR(31),           /* POINTER TO AUTHORIZED LIBRARY    00595000
*                                      TABLE MDC188                  */ 00596000
*      2 CVTACTAP PTR(31),          /* ADDRESS OF BRANCH ENTRY TO       00597000
*                                      VTAM'S SVC ROUTINE ISTAPC42      00598000
*                                      (MDC216)              @X31BH9A*/ 00599000
*      2 CVTRV485 PTR(31),          /* RESERVED MDC106               */ 00600000
*      2 CVTRV486 PTR(31),          /* RESERVED MDC106               */ 00601000
*      2 CVTRV487 PTR(31),          /* RESERVED MDC106               */ 00602000
*      2 CVTRV488 PTR(31);          /* RESERVED MDC106               */ 00603000
*/*            OS/VS2 OVERLAY                                        */ 00604000
*                                                               01S0005 00605000
*   DECLARE                                                     01S0005 00606000
*     1 CVTS01 DEF(CVTPGSIA) BDY(WORD),                         01S0005 00607000
*      2 CVTGETL PTR(31),           /* ADDRESS OF IKJGETL, TSO GET      00608000
*                                      LINE ROUTINE (MDC206)   YM2225*/ 00609000
*      2 CVTLPDSR PTR(31),          /* ADDRESS OF LINK PACK AREA        00610000
*                                      (LPA) DIRECTORY SEARCH ROUTINE*/ 00611000
*      2 CVTPVTP PTR(31),           /* ADDRESS OF PAGE VECTOR TABLE  */ 00612000
*      2 CVTLPDIA PTR(31),          /* ADDRESS OF LINK PACK AREA        00613000
*                                      (LPA) DIRECTORY (ON PAGE 01S0005 00614000
*                                      BOUNDARY)                     */ 00615000
*       3 CVTDIRST CHAR(1),         /* FLAG BYTE                     */ 00616000
*        4 CVTDICOM BIT(1),         /* LPA DIRECTORY HAS BEEN   01S0005 00617000
*                                      INITIALIZED BY NIP            */ 00618000
*        4 CVTRSV63 BIT(1),         /* RESERVED                      */ 00619000
*        4 CVTRSV64 BIT(1),         /* RESERVED                      */ 00620000
*        4 CVTRSV65 BIT(1),         /* RESERVED                      */ 00621000
*        4 CVTRSV66 BIT(1),         /* RESERVED                      */ 00622000
*        4 CVTRSV67 BIT(1),         /* RESERVED                      */ 00623000
*        4 CVTRSV68 BIT(1),         /* RESERVED                      */ 00624000
*        4 CVTRSV69 BIT(1),         /* RESERVED                      */ 00625000
*       3 CVTLPDIR PTR(24),         /* ADDRESS OF LPA DIRECTORY. ON     00626000
*                                      PAGE BOUNDARY                 */ 00627000
*      2 CVTRV320 PTR(31),          /* ** CVTPAGE1 FIELD UNUSED IN      00628000
*                                      MVS ** (MDC112)       @Z40AQ9A*/ 00629000
*      2 CVTRV321 PTR(31),          /* ** CVTPGSUP FIELD UNUSED IN      00630000
*                                      MVS ** (MDC113)       @Z40AQ9A*/ 00631000
*      2 CVTSLIDA CHAR(4) BDY(WORD),/* IDENTITY OF TCB CAUSING  01S0005 00632000
*                                      SUPERVISOR LOCK BYTE (CVTSYLK)   00633000
*                                      TO BE SET OR IDENTITY OF TCB     00634000
*                                      THAT SECOND EXIT PROCESSING IS   00635000
*                                      FOR WHEN CVTSEIC=1            */ 00636000
*       3 CVTSYLK CHAR(1),          /* SUPERVISOR LOCK. ONLY ENABLED    00637000
*                                      TASKS MAY BE DISPATCHED       */ 00638000
*       3 CVTSLID CHAR(3),          /* SAME AS CVTSLIDA ABOVE        */ 00639000
*      2 CVTRV322 PTR(31),          /* RESERVED FOR FUTURE USE  01S0005 00640000
*                                      (MDC343)              @Z40AQ9A*/ 00641000
*      2 CVTRV328 PTR(31),          /* ** CVTSEG AND CVTSEGA FIELDS     00642000
*                                      UNUSED IN MVS ** (MDC139)        00643000
*                                                            @Z40AQ9A*/ 00644000
*      2 CVTRV329 PTR(31),          /* ** CVTSEGB FIELD UNUSED IN MVS   00645000
*                                      ** (MDC141)           @Z40AQ9A*/ 00646000
*      2 CVTRV330 PTR(31),          /* ** CVTSEGC AND SUBFIELDS 01S0005 00647000
*                                      UNUSED IN MVS ** (MDC142)        00648000
*                                                            @Z40AQ9A*/ 00649000
*      2 CVTRV331 PTR(31),          /* ** CVTSEGD AND SUBFIELDS 01S0005 00650000
*                                      UNUSED IN MVS ** (MDC145)        00651000
*                                                            @Z40AQ9A*/ 00652000
*      2 CVTRSV77 PTR(8),           /* RESERVED                      */ 00653000
*      2 CVTSPVLK PTR(8),           /* NUMBER OF TASKS WHICH HAVE       00654000
*                                      TERMINATED WHILE OWNING  01S0005 00655000
*                                      SUPERVISOR LOCK WITHOUT  01S0005 00656000
*                                      OPERATOR HAVING YET BEEN 01S0005 00657000
*                                      NOTIFIED                      */ 00658000
*      2 CVTCTLFG CHAR(1),          /* SYSTEM CONTROL FLAGS          */ 00659000
*       3 CVTRV323 BIT(1),          /* ** CVTPSIC BIT UNUSED IN MVS     00660000
*                                      ** (MDC118)           @Z40AQ9A*/ 00661000
*       3 CVTRV333 BIT(1),          /* ** CVTAPGB BIT UNUSED IN MVS     00662000
*                                      ** (MDC151)           @Z40AQ9A*/ 00663000
*       3 CVTRSV78 BIT(1),          /* RESERVED ICB382               */ 00664000
*       3 CVTDSTAT BIT(1),          /* DEVSTAT OPTION IN EFFECT.        00665000
*                                      DEVICE ADDRESS FOR 2319, 3330,   00666000
*                                      2314, 3330-1, 3340 CAN VARY      00667000
*                                      ACROSS SYSTEMS MDC189         */ 00668000
*       3 CVTRSV79 BIT(1),          /* RESERVED                      */ 00669000
*       3 CVTNOMP BIT(1),           /* MULTIPROCESSING CODE IS NOT IN   00670000
*                                      THE SYSTEM MDC176             */ 00671000
*       3 CVTGTRCE BIT(1),          /* GENERALIZED TRACE FACILITY       00672000
*                                      (GTF) HAS SUPPRESSED     01S0005 00673000
*                                      SUPERVISOR TRACE ICB446       */ 00674000
*       3 CVTSDTRC BIT(1),          /* SVC DUMP HAS SUPPRESSED  01S0005 00675000
*                                      SUPERVISOR TRACE ICB446       */ 00676000
*      2 CVTAPG CHAR(1),            /* DISPATCHING PRIORITY OF  01S0005 00677000
*                                      AUTOMATIC PRIORITY GROUP (APG)   00678000
*                                      ICB339                        */ 00679000
*      2 CVTTRACE CHAR(2) BDY(WORD),/* BRANCH ON REGISTER       01S0005 00680000
*                                      INSTRUCTION. SET BY NIP. 01S0005 00681000
*                                      REGISTER TEN FOR TRACE.  01S0005 00682000
*                                      REGISTER ELEVEN FOR NO TRACE. */ 00683000
*      2 CVTTRAC2 CHAR(2) BDY(WORD,3),/* BRANCH ON REGISTER 11  01S0005 00684000
*                                      INSTRUCTION. THIS ALLOWS FOR     00685000
*                                      SUPPRESSING TRACE DYNAMICALLY    00686000
*                                      BY SETTING CONDITION CODE MASK   00687000
*                                      TO ZERO IN FIRST INSTRUCTION     00688000
*                                      (CVTTRACE)                    */ 00689000
*      2 CVTRSCN PTR(31),           /* ADDRESS OF ROUTINE TO SCAN TCB   00690000
*                                      TREE                          */ 00691000
*      2 CVTTAS PTR(31),            /* ADDRESS OF ROUTINE TO TRANSFER   00692000
*                                      ADDRESS SPACE                 */ 00693000
*      2 CVTRV332 PTR(31),          /* ** CVTPVALD FIELD UNUSED IN      00694000
*                                      MVS ** (MDC148)       @Z40AQ9A*/ 00695000
*      2 CVTSHRVM PTR(31),          /* LOWEST ADDRESS OF SHARED 01S0005 00696000
*                                      VIRTUAL STORAGE AREA. THIS       00697000
*                                      ADDRESS WILL BE THE BEGINNING    00698000
*                                      OF THE COMMON SERVICE AREA       00699000
*                                      (CSA) (MDC324)        @Z30AQ9A*/ 00700000
*      2 CVT0VL01 PTR(31),          /* ENTRY POINT ADDRESS OF   01S0005 00701000
*                                      VALIDITY CHECK ROUTINE   01S0005 00702000
*                                      (IEA0VL01) USED TO COMPARE       00703000
*                                      PROTECT KEY OF AN ADDRESS WITH   00704000
*                                      TCB PROTECT KEY.              */ 00705000
*      2 CVTRV324 PTR(31),          /* ** CVTPFIXQ FIELD UNUSED IN      00706000
*                                      MVS ** (MDC119)       @Z40AQ9A*/ 00707000
*      2 CVTRV325 PTR(31),          /* ** CVTPFIXR FIELD UNUSED IN      00708000
*                                      MVS ** (MDC120)       @Z40AQ9A*/ 00709000
*      2 CVTRV326 PTR(31),          /* ** CVTPFIXP FIELD UNUSED IN      00710000
*                                      MVS ** (MDC121)       @Z40AQ9A*/ 00711000
*      2 CVTASCRF PTR(31),          /* CREATED ASCB QUEUE HEADER        00712000
*                                      (MDC337)              @ZA04120*/ 00713000
*      2 CVTASCRL PTR(31),          /* CREATED ASCB QUEUE TRAILER       00714000
*                                      (MDC338)              @ZA04120*/ 00715000
*      2 CVTPUTL PTR(31),           /* ADDRESS OF IKJPUTL, TSO PUT      00716000
*                                      LINE ROUTINE (MDC207)   YM2225*/ 00717000
*      2 CVTSRBRT PTR(31),          /* DISPATCHER RETURN ADDRESS FOR    00718000
*                                      SRB ROUTINES MDC130           */ 00719000
*      2 CVTOLT0A PTR(31),          /* BRANCH ENTRY TO OLTEP MEMORY     00720000
*                                      TERMINATION RESOURCE MANAGER     00721000
*                                      MDC129                        */ 00722000
*      2 CVTSMFEX PTR(31),          /* BRANCH ENTRY TO SYSTEM   01S0005 00723000
*                                      MANAGEMENT FACILITIES (SMF)      00724000
*                                      EXCP COUNTING ROUTINE FOR VAM    00725000
*                                      WINDOW INTERCEPT MDC133       */ 00726000
*      2 CVTCSPIE PTR(31),          /* FOR CHECKPOINT/RESTART, BRANCH   00727000
*                                      ENTRY TO SPIE MDC149          */ 00728000
*      2 CVTPTGT PTR(31),           /* ADDRESS OF IKJPTGT, TSO PUTGET   00729000
*                                      ROUTINE (MDC208)        YM2225*/ 00730000
*      2 CVTIOSPL PTR(8),           /* PRIORITY LEVEL OF I/O    01S0005 00731000
*                                      SUPERVISOR CHANNEL SCHEDULER     00732000
*                                      MDC019                        */ 00733000
*      2 CVTRV513 CHAR(1),          /* RESERVED MDC165               */ 00734000
*      2 CVTDSSAC CHAR(1),          /* DYNAMIC SUPPORT SYSTEM (DSS)     00735000
*                                      ACTIVATED FLAG - USED BY 01S0005 00736000
*                                      RESTART FLIH. IF X'00', DSS      00737000
*                                      NOT INITIALIZED. IF X'FF', DSS   00738000
*                                      HAS BEEN INITIALIZED. MDC163  */ 00739000
*      2 CVTRV139 PTR(8),           /* RESERVED                      */ 00740000
*      2 CVTSTCK PTR(31),           /* ADDRESS OF IKJSTCK, TSO STACK    00741000
*                                      ROUTINE (MDC209)        YM2225*/ 00742000
*      2 CVTMAXMP PTR(15),          /* FOR MEASUREMENT FACILITY 01S0005 00743000
*                                      (MF/1), MAXIMUM PHYSICAL CPU     00744000
*                                      ADDRESS SUPPORTED BY THIS        00745000
*                                      RELEASE MDC165                */ 00746000
*      2 CVTRV144 FIXED(15),        /* RESERVED                      */ 00747000
*      2 CVTSCAN PTR(31),           /* ADDRESS OF IKJSCAN, TSO SCAN     00748000
*                                      ROUTINE (MDC210)        YM2225*/ 00749000
*      2 CVTAUTHL PTR(31),          /* POINTER TO AUTHORIZED LIBRARY    00750000
*                                      TABLE MDC001                  */ 00751000
*      2 CVTBLDCP PTR(31),          /* BRANCH ENTRY TO BUILD POOL       00752000
*                                      MDC003                        */ 00753000
*      2 CVTGETCL PTR(31),          /* BRANCH ENTRY TO GET CELL 01S0005 00754000
*                                      MDC004                        */ 00755000
*      2 CVTFRECL PTR(31),          /* BRANCH ENTRY TO FREE CELL        00756000
*                                      MDC005                        */ 00757000
*      2 CVTDELCP PTR(31),          /* BRANCH ENTRY TO DELETE POOL      00758000
*                                      MDC006                        */ 00759000
*      2 CVTCRMN PTR(31),           /* BRANCH ENTRY TO SVC 120  01S0005 00760000
*                                      (GETMAIN/FREEMAIN:CRBRANCH)      00761000
*                                      MDC007                        */ 00762000
*      2 CVTCRAS PTR(31),           /* BRANCH ENTRY TO 'CREATE  01S0005 00763000
*                                      ADDRESS SPACE' MDC008         */ 00764000
*      2 CVTQSAS PTR(31),           /* BRANCH ENTRY TO TASK     01S0005 00765000
*                                      TERMINATION MDC009            */ 00766000
*      2 CVTFRAS PTR(31),           /* BRANCH ENTRY TO FREE ADDRESS     00767000
*                                      SPACE MDC010                  */ 00768000
*      2 CVTS1EE PTR(31),           /* BRANCH ENTRY TO STAGE 1 EXIT     00769000
*                                      EFFECTOR MDC011               */ 00770000
*      2 CVTPARS PTR(31),           /* ADDRESS OF IKJPARS, TSO PARSE    00771000
*                                      ROUTINE (MDC211)        YM2225*/ 00772000
*      2 CVTQUIS PTR(31),           /* BRANCH ENTRY TO QUIESCE MDC013*/ 00773000
*      2 CVTSTXU PTR(31),           /* BRANCH ENTRY TO ATTENTION EXIT   00774000
*                                      EPILOGUE MDC014               */ 00775000
*      2 CVTOPTE PTR(31),           /* BRANCH ENTRY ADDRESS TO  01S0005 00776000
*                                      SYSEVENT MDC015               */ 00777000
*      2 CVTSDRM PTR(31),           /* BRNACH ENTRY ADDRESS OF THE      00778000
*                                      RESOURCE MANAGER ROUTINE FOR     00779000
*                                      SVC DUMP. THIS ROUTINE CAN BE    00780000
*                                      INVOKED BY MEMORY TERMINATION    00781000
*                                      MDC077                        */ 00782000
*      2 CVTIOSCS PTR(31),          /* ENTRY POINT OF I/O SUPERVISOR    00783000
*                                      CHANNEL SCHEDULER MDC018      */ 00784000
*      2 CVTAQTOP PTR(31),          /* POINTER TO AREA CONTAINING       00785000
*                                      QUIESCE DESCRIPTOR BLOCK 01S0005 00786000
*                                      (QDB'S) FOR DEVICE ALLOCATION    00787000
*                                      MDC021                        */ 00788000
*      2 CVTVVMDI PTR(31),          /* CONSTANT USED BY PAGED LINK      00789000
*                                      PACK AREA (LPA) DIRECTORY        00790000
*                                      SEARCH ALGORITHM MDC022       */ 00791000
*      2 CVTASVT PTR(31),           /* POINTER TO ADDRESS SPACE 01S0005 00792000
*                                      VECTOR TABLE (ASVT) MDC070    */ 00793000
*      2 CVTGDA PTR(31),            /* POINTER TO GLOBAL DATA AREA      00794000
*                                      (GDA) IN SQA MDC024           */ 00795000
*      2 CVTASCBH PTR(31),          /* POINTER TO HIGHEST PRIORITY      00796000
*                                      ADDRESS SPACE CONTROL BLOCK      00797000
*                                      (ASCB) ON THE ASCB DISPATCHING   00798000
*                                      QUEUE (HEAD OF ASCB QUEUE)       00799000
*                                      MDC027                        */ 00800000
*      2 CVTASCBL PTR(31),          /* POINTER TO LOWEST PRIORITY       00801000
*                                      ASCB ON ASCB DISPATCHING QUEUE   00802000
*                                      MDC028                        */ 00803000
*      2 CVTRTMCT PTR(31),          /* POINTER TO               01S0005 00804000
*                                      RECOVERY/TERMINATION CONTROL     00805000
*                                      TABLE MDC031                  */ 00806000
*      2 CVTSV60 PTR(31),           /* ADDRESS OF SVC 60 BRANCH ENTRY   00807000
*                                      POINT (MDC354)        @Z40FP9A*/ 00808000
*      2 CVTSDMP PTR(31),           /* ADDRESS OF SVC DUMP BRANCH       00809000
*                                      ENTRY POINT MDC033            */ 00810000
*      2 CVTSCBP PTR(31),           /* ADDRESS OF SCB PURGE RESOURCE    00811000
*                                      MANAGER MDC034                */ 00812000
*      2 CVTSDBF PTR(31),           /* ADDRESS OF 4K SQA BUFFER USED    00813000
*                                      BY SVC DUMP. HIGH ORDER BIT OF   00814000
*                                      THIS CVT WORD IS USED AS LOCK    00815000
*                                      TO INDICATE BUFFER IS IN USE     00816000
*                                      MDC035                        */ 00817000
*      2 CVTRTMS PTR(31),           /* ADDRESS OF SERVICABILITY LEVEL   00818000
*                                      INDICATOR PROCESSING (SLIP)      00819000
*                                      HEADER (MDC358)       @G17SP9A*/ 00820000
*      2 CVTTPIOS PTR(31),          /* ADDRESS OF THE TELEPROCESSING    00821000
*                                      I/O SUPERV1SOR ROUTINE (TPIOS)   00822000
*                                      MDC078                        */ 00823000
*      2 CVTSIC PTR(31),            /* BRANCH ENTRY ADDRESS OF THE      00824000
*                                      ROUTINE TO SCHEDULE SYSTEM       00825000
*                                      INITIALIZED CANCEL MDC042     */ 00826000
*      2 CVTOPCTP PTR(31),          /* ADDRESS OF SYSTEM RESOURCES      00827000
*                                      MANAGER (SRM) CONTROL TABLE      00828000
*                                      MDC043                        */ 00829000
*      2 CVTEXPRO PTR(31),          /* ADDRESS OF EXIT PROLOGUE/TYPE    00830000
*                                      1 EXIT MDC044                 */ 00831000
*      2 CVTGSMQ PTR(31),           /* ADDRESS OF GLOBAL SERVICE        00832000
*                                      MANAGER QUEUE MDC045          */ 00833000
*      2 CVTLSMQ PTR(31),           /* ADDRESS OF LOCAL SERVICE 01S0005 00834000
*                                      MANAGER QUEUE MDC046          */ 00835000
*      2 CVTGSPL PTR(31),           /* ADDRESS OF GLOBAL SYSTEM 01S0005 00836000
*                                      PRIORITY LIST QUEUE MDC047    */ 00837000
*      2 CVTVWAIT PTR(31),          /* ADDRESS OF WAIT ROUTINE MDC048*/ 00838000
*      2 CVTPARRL PTR(31),          /* ADDRESS OF PARTIALLY LOADED      00839000
*                                      DELETE QUEUE MDC049           */ 00840000
*      2 CVTAPFT PTR(31),           /* ADDRESS OF AUTHORIZED PROGRAM    00841000
*                                      FACILITY (APF) TABLE.    01S0005 00842000
*                                      INITIALIZED BY NIP. MDC050    */ 00843000
*      2 CVTQCS01 PTR(31),          /* BRANCH ENTRY ADDRESS TO  01S0005 00844000
*                                      PROGRAM MANAGER USED BY ATTACH   00845000
*                                      MDC051                        */ 00846000
*      2 CVTFQCB PTR(31),           /* POINTER TO FIRST MAJOR QCB FOR   00847000
*                                      ENQ MDC052                    */ 00848000
*      2 CVTLQCB PTR(31),           /* POINTER TO LAST MAJOR QCB FOR    00849000
*                                      ENQ MDC053                    */ 00850000
*      2 CVTRENQ PTR(31),           /* RESOURCE MANAGER ADDRESS FOR     00851000
*                                      ENQ MDC054                    */ 00852000
*      2 CVTRSPIE PTR(31),          /* RESOURCE MANAGER FOR SPIE        00853000
*                                      MDC055                        */ 00854000
*      2 CVTLKRMA PTR(31),          /* RESOURCE MANAGER ADDRESS FOR     00855000
*                                      LOCK MANAGER MDC056           */ 00856000
*      2 CVTCSD PTR(31),            /* VIRTUAL ADDRESS OF COMMON        00857000
*                                      SYSTEM DATA AREA (CSD).  01S0005 00858000
*                                      INITIALIZED BY NIP. MDC057    */ 00859000
*      2 CVTDQIQE PTR(31),          /* RESOURCE MANAGER FOR EXIT        00860000
*                                      EFFECTORS MDC058              */ 00861000
*      2 CVTRPOST PTR(31),          /* RESOURCE MANAGER FOR POST        00862000
*                                      MDC059                        */ 00863000
*      2 CVT062R1 PTR(31),          /* BRANCH ENTRY TO DETACH MDC060 */ 00864000
*      2 CVTVEAC0 PTR(31),          /* ASCBCHAP BRANCH ENTRY MDC061  */ 00865000
*      2 CVTGLMN PTR(31),           /* GLOBAL BRANCH ENTRY ADDRESS      00866000
*                                      FOR GETMAIN/FREEMAIN MDC062   */ 00867000
*      2 CVTSPSA PTR(31),           /* POINTER TO GLOBAL WORK/SAVE      00868000
*                                      AREA VECTOR TABLE (WSAG) 01S0005 00869000
*                                      MDC071                        */ 00870000
*      2 CVTWSAL PTR(31),           /* ADDRESS OF TABLE OF LENGTHS OF   00871000
*                                      LOCAL WORK/SAVE AREAS MDC072  */ 00872000
*      2 CVTRV149 PTR(31),          /* RESERVED (MDC073)       YM4043*/ 00873000
*      2 CVTWSAC PTR(31),           /* ADDRESS OF TABLE OF LENGTHS OF   00874000
*                                      CPU WORK/SAVE AREAS MDC074    */ 00875000
*      2 CVTRECRQ PTR(31),          /* ADDRESS OF THE RECORDING 01S0005 00876000
*                                      REQUEST FACILITY (PART OF RTM1   00877000
*                                      - CALLED BY RTM2 AND RMS)        00878000
*                                      MDC075                        */ 00879000
*      2 CVTASMVT PTR(31),          /* POINTER TO AUXILIARY STORAGE     00880000
*                                      MANAGEMENT VECTOR TABLE (AMVT)   00881000
*                                      MDC076                        */ 00882000
*      2 CVTIOBP PTR(31),           /* ADDRESS OF THE BLOCK PROCESSOR   00883000
*                                      CVT MDC079                    */ 00884000
*      2 CVTSPOST PTR(31),          /* POST RESOURCE MANAGER    01S0005 00885000
*                                      TERMINATION ROUTINE (RMTR)       00886000
*                                      ENTRY POINT MDC085            */ 00887000
*      2 CVTRSTWD FIXED(31),        /* RESTART RESOURCE MANAGEMENT      00888000
*                                      WORD - CONTAINS IDENTIFIER OF    00889000
*                                      USER IF RESTART IS IN USE.       00890000
*                                      OTHERWISE, ZERO. MDC161       */ 00891000
*      2 CVTFETCH PTR(31),          /* ADDRESS OF ENTRY POINT FOR       00892000
*                                      BASIC FETCH MDC196            */ 00893000
*      2 CVT044R2 PTR(31),          /* ADDRESS OF IGC044R2 IN CHAP      00894000
*                                      SERVICE ROUTINE MDC197        */ 00895000
*      2 CVTPERFM PTR(31),          /* ADDRESS OF THE PERFORMANCE       00896000
*                                      WORK AREA. SET BY IGX00018.      00897000
*                                      MDC205                        */ 00898000
*      2 CVTDAIR PTR(31),           /* ADDRESS OF IKJDAIR, TSO  01S0005 00899000
*                                      DYNAMIC ALLOCATION INTERFACE     00900000
*                                      ROUTINE (MDC212)        YM2225*/ 00901000
*      2 CVTEHDEF PTR(31),          /* ADDRESS OF IKJEHDEF, TSO 01S0005 00902000
*                                      DEFAULT SERVICE ROUTINE  01S0005 00903000
*                                      (MDC213)                YM2225*/ 00904000
*      2 CVTEHCIR PTR(31),          /* ADDRESS OF IKJEHCIR, TSO 01S0005 00905000
*                                      CATALOG INFORMATION ROUTINE      00906000
*                                      (MDC214)                YM2225*/ 00907000
*      2 CVTSSAP PTR(31),           /* ADDRESS OF SYSTEM SAVE AREA      00908000
*                                      MDC063                        */ 00909000
*      2 CVTAIDVT PTR(31),          /* POINTER TO APPENDAGE ID VECTOR   00910000
*                                      TABLE MDC064                  */ 00911000
*      2 CVTIPCDS PTR(31),          /* BRANCH ENTRY FOR DIRECT SIGNAL   00912000
*                                      SERVICE ROUTINE MDC065        */ 00913000
*      2 CVTIPCRI PTR(31),          /* BRANCH ENTRY FOR REMOTE  01S0005 00914000
*                                      IMMEDIATE SIGNAL SERVICE 01S0005 00915000
*                                      ROUTINE MDC066                */ 00916000
*      2 CVTIPCRP PTR(31),          /* BRANCH ENTRY FOR REMOTE  01S0005 00917000
*                                      PENDABLE SIGNAL SERVICE  01S0005 00918000
*                                      ROUTINE MDC067                */ 00919000
*      2 CVTPCCAT PTR(31),          /* POINTER TO PHYSICAL CCA VECTOR   00920000
*                                      TABLE MDC068                  */ 00921000
*      2 CVTLCCAT PTR(31),          /* POINTER TO LOGICAL CCA VECTOR    00922000
*                                      TABLE MDC069                  */ 00923000
*      2 CVTRV210 BIT(8),           /* RESERVED                      */ 00924000
*       3 CVTRV211 BIT(1),          /* RESERVED                      */ 00925000
*       3 CVTRV212 BIT(1),          /* RESERVED                      */ 00926000
*       3 CVTRV213 BIT(1),          /* RESERVED                      */ 00927000
*       3 CVTRV214 BIT(1),          /* RESERVED                      */ 00928000
*       3 CVTRV215 BIT(1),          /* RESERVED                      */ 00929000
*       3 CVTRV216 BIT(1),          /* RESERVED                      */ 00930000
*       3 CVTRV217 BIT(1),          /* RESERVED                      */ 00931000
*       3 CVTRV218 BIT(1),          /* RESERVED                      */ 00932000
*      2 CVTRV219 BIT(8),           /* RESERVED                      */ 00933000
*       3 CVTRV220 BIT(1),          /* RESERVED                      */ 00934000
*       3 CVTRV221 BIT(1),          /* RESERVED                      */ 00935000
*       3 CVTRV222 BIT(1),          /* RESERVED                      */ 00936000
*       3 CVTRV223 BIT(1),          /* RESERVED                      */ 00937000
*       3 CVTRV224 BIT(1),          /* RESERVED                      */ 00938000
*       3 CVTRV225 BIT(1),          /* RESERVED                      */ 00939000
*       3 CVTRV226 BIT(1),          /* RESERVED                      */ 00940000
*       3 CVTRV227 BIT(1),          /* RESERVED                      */ 00941000
*      2 CVTRV228 BIT(8),           /* RESERVED                      */ 00942000
*       3 CVTRV229 BIT(1),          /* RESERVED                      */ 00943000
*       3 CVTRV230 BIT(1),          /* RESERVED                      */ 00944000
*       3 CVTRV231 BIT(1),          /* RESERVED                      */ 00945000
*       3 CVTRV232 BIT(1),          /* RESERVED                      */ 00946000
*       3 CVTRV233 BIT(1),          /* RESERVED                      */ 00947000
*       3 CVTRV234 BIT(1),          /* RESERVED                      */ 00948000
*       3 CVTRV235 BIT(1),          /* RESERVED                      */ 00949000
*       3 CVTRV236 BIT(1),          /* RESERVED                      */ 00950000
*      2 CVTRV237 BIT(8),           /* RESERVED                      */ 00951000
*       3 CVTRV238 BIT(1),          /* RESERVED                      */ 00952000
*       3 CVTRV239 BIT(1),          /* RESERVED                      */ 00953000
*       3 CVTRV240 BIT(1),          /* RESERVED                      */ 00954000
*       3 CVTRV241 BIT(1),          /* RESERVED                      */ 00955000
*       3 CVTRV242 BIT(1),          /* RESERVED                      */ 00956000
*       3 CVTRV243 BIT(1),          /* RESERVED                      */ 00957000
*       3 CVTRV244 BIT(1),          /* RESERVED                      */ 00958000
*       3 CVTRV245 BIT(1),          /* RESERVED                      */ 00959000
*      2 CVTRV246 PTR(8),           /* RESERVED                      */ 00960000
*      2 CVTRV247 PTR(8),           /* RESERVED                      */ 00961000
*      2 CVTRV248 PTR(8),           /* RESERVED                      */ 00962000
*      2 CVTRV249 PTR(8),           /* RESERVED                      */ 00963000
*      2 CVTRV250 PTR(8),           /* RESERVED                      */ 00964000
*      2 CVTRV251 PTR(8),           /* RESERVED                      */ 00965000
*      2 CVTRV252 PTR(15),          /* RESERVED                      */ 00966000
*      2 CVTRV253 FIXED(15),        /* RESERVED                      */ 00967000
*      2 CVTRV254 FIXED(15),        /* RESERVED                      */ 00968000
*      2 CVTPWI PTR(31),            /* ADDRESS OF THE WINDOW    01S0005 00969000
*                                      INTERCEPT ROUTINE MDC104      */ 00970000
*      2 CVTPVBP PTR(31),           /* ADDRESS OF THE VIRTUAL BLOCK     00971000
*                                      PROCESSOR MDC105              */ 00972000
*      2 CVTMFCTL PTR(31),          /* POINTER TO MEASUREMENT   01S0005 00973000
*                                      FACILITY CONTROL BLOCK MDC100 */ 00974000
*      2 CVTMFRTR PTR(31),          /* IF MEASUREMENT FACILITY IS       00975000
*                                      ACTIVE, CONTAINS ADDRESS OF      00976000
*                                      MEASUREMENT FACILITY ROUTER.     00977000
*                                      OTHERWISE, ADDRESS OF CVTBRET.   00978000
*                                      MDC101                        */ 00979000
*       3 CVTMFACT BIT(1),          /* IF ONE, I/O SUPERVISOR AND       00980000
*                                      TIMER SECOND LEVEL INTERRUPT     00981000
*                                      HANDLER HOOKS BRANCH TO  01S0005 00982000
*                                      MEASUREMENT FACILITY ROUTER      00983000
*                                      MDC102                        */ 00984000
*      2 CVTVPSIB PTR(31),          /* BRANCH ENTRY TO PAGE SERVICES    00985000
*                                      MDC108                        */ 00986000
*      2 CVTVSI PTR(31),            /* BRANCH ENTRY TO VAM SERVICES     00987000
*                                      MDC109                        */ 00988000
*      2 CVTVFP PTR(31),            /* BRANCH ENTRY TO FINDPAGE 01S0005 00989000
*                                      MDC110                        */ 00990000
*      2 CVTRV262 BIT(8),           /* RESERVED                      */ 00991000
*       3 CVTRV263 BIT(1),          /* RESERVED                      */ 00992000
*       3 CVTRV264 BIT(1),          /* RESERVED                      */ 00993000
*       3 CVTRV265 BIT(1),          /* RESERVED                      */ 00994000
*       3 CVTRV266 BIT(1),          /* RESERVED                      */ 00995000
*       3 CVTRV267 BIT(1),          /* RESERVED                      */ 00996000
*       3 CVTRV268 BIT(1),          /* RESERVED                      */ 00997000
*       3 CVTRV269 BIT(1),          /* RESERVED                      */ 00998000
*       3 CVTRV270 BIT(1),          /* RESERVED                      */ 00999000
*      2 CVTRV271 BIT(8),           /* RESERVED                      */ 01000000
*       3 CVTRV272 BIT(1),          /* RESERVED                      */ 01001000
*       3 CVTRV273 BIT(1),          /* RESERVED                      */ 01002000
*       3 CVTRV274 BIT(1),          /* RESERVED                      */ 01003000
*       3 CVTRV275 BIT(1),          /* RESERVED                      */ 01004000
*       3 CVTRV276 BIT(1),          /* RESERVED                      */ 01005000
*       3 CVTRV277 BIT(1),          /* RESERVED                      */ 01006000
*       3 CVTRV278 BIT(1),          /* RESERVED                      */ 01007000
*       3 CVTRV279 BIT(1),          /* RESERVED                      */ 01008000
*      2 CVTRV280 BIT(8),           /* RESERVED                      */ 01009000
*       3 CVTRV281 BIT(1),          /* RESERVED                      */ 01010000
*       3 CVTRV282 BIT(1),          /* RESERVED                      */ 01011000
*       3 CVTRV283 BIT(1),          /* RESERVED                      */ 01012000
*       3 CVTRV284 BIT(1),          /* RESERVED                      */ 01013000
*       3 CVTRV285 BIT(1),          /* RESERVED                      */ 01014000
*       3 CVTRV286 BIT(1),          /* RESERVED                      */ 01015000
*       3 CVTRV287 BIT(1),          /* RESERVED                      */ 01016000
*       3 CVTRV288 BIT(1),          /* RESERVED                      */ 01017000
*      2 CVTRV289 BIT(8),           /* RESERVED                      */ 01018000
*       3 CVTRV290 BIT(1),          /* RESERVED                      */ 01019000
*       3 CVTRV291 BIT(1),          /* RESERVED                      */ 01020000
*       3 CVTRV292 BIT(1),          /* RESERVED                      */ 01021000
*       3 CVTRV293 BIT(1),          /* RESERVED                      */ 01022000
*       3 CVTRV294 BIT(1),          /* RESERVED                      */ 01023000
*       3 CVTRV295 BIT(1),          /* RESERVED                      */ 01024000
*       3 CVTRV296 BIT(1),          /* RESERVED                      */ 01025000
*       3 CVTRV297 BIT(1),          /* RESERVED                      */ 01026000
*      2 CVTTRCA PTR(31),           /* ADDRESS OF TRACE TABLE HEADER    01027000
*                                      (MDC327)              @ZA02352*/ 01028000
*      2 CVTRV302 PTR(15),          /* RESERVED                      */ 01029000
*      2 CVTRV303 PTR(15),          /* RESERVED                      */ 01030000
*      2 CVTRV304 FIXED(15),        /* RESERVED                      */ 01031000
*      2 CVTRV305 FIXED(15),        /* RESERVED                      */ 01032000
*      2 CVTRV306 FIXED(15),        /* RESERVED                      */ 01033000
*      2 CVTRV307 FIXED(15),        /* RESERVED                      */ 01034000
*      2 CVTVIOP PTR(31),           /* ENTRY POINT OF PAGE I/O POST     01035000
*                                      MDC111                        */ 01036000
*      2 CVTRMBR PTR(31),           /* ADDRESS OF REGMAIN BRANCH        01037000
*                                      ENTRY MDC123                  */ 01038000
*      2 CVTLFRM PTR(31),           /* LIST FORMAT FREEMAIN BRANCH      01039000
*                                      ENTRY POINT MDC124            */ 01040000
*      2 CVTGMBR PTR(31),           /* LIST FORMAT GETMAIN BRANCH       01041000
*                                      ENTRY POINT MDC125            */ 01042000
*      2 CVT0TC0A PTR(31),          /* ADDRESS OF TASK CLOSE MODULE     01043000
*                                      IFG0TC0A MDC128               */ 01044000
*      2 CVTRLSTG FIXED(31),        /* SIZE OF ACTUAL REAL STORAGE      01045000
*                                      ONLINE AT IPL TIME IN 'K'.       01046000
*                                      VALUE PLACED HERE BY IEAVNIP0.   01047000
*                                      MDC153                        */ 01048000
*      2 CVTSPFRR PTR(31),          /* 'SUPER FRR' ADDRESS (ADDRESS     01049000
*                                      OF FUNCTIONAL RECOVERY ROUTINE   01050000
*                                      ESTABLISHED AT NIP0 TIME TO      01051000
*                                      PROTECT SUPERVISOR CONTROL       01052000
*                                      PROGRAM) MDC154               */ 01053000
*      2 CVTVEMS0 PTR(31),          /* ADDRESS OF MEMORY SWITCH 01S0005 01054000
*                                      ROUTINE MDC155                */ 01055000
*      2 CVTJRECM PTR(31),          /* ADDRESS OF SUBSYSTEM INTERFACE   01056000
*                                      RESOURCE MANAGER MDC157       */ 01057000
*      2 CVTIRECM PTR(31),          /* ADDRESS OF INITIATOR RESOURCE    01058000
*                                      MANAGER MDC158                */ 01059000
*      2 CVTDARCM PTR(31),          /* ADDRESS OF DEVICE ALLOCATION     01060000
*                                      RESOURCE MANAGER MDC159       */ 01061000
*      2 CVT0PT02 PTR(31),          /* ADDRESS OF POST ENTRY POINT      01062000
*                                      IEA0PT02 MDC160               */ 01063000
*      2 CVTSTPRS PTR(31),          /* ENTRY POINT OF STOP AND  01S0005 01064000
*                                      RESTART SUBROUTINE MDC162     */ 01065000
*      2 CVTWTCB PTR(31),           /* ADDRESS OF WAIT STATE TCB        01066000
*                                      MDC164                        */ 01067000
*      2 CVTVACR PTR(31),           /* ACR/VARY CPU CHANNEL RECOVERY    01068000
*                                      ROUTINE ADDRESS. ADDRESS 01S0005 01069000
*                                      FILLED IN BY VARY CPU    01S0005 01070000
*                                      PROCESSOR. MDC178             */ 01071000
*      2 CVTQUIT PTR(31),           /* VARY CPU SHUTDOWN ROUTINE        01072000
*                                      ADDRESS. ADDRESS FILLED IN BY    01073000
*                                      VARY CPU PROCESSOR. MDC179    */ 01074000
*      2 CVTGTFR8 PTR(31),          /* GENERALIZED TRACE FACILITY       01075000
*                                      (GTF) CONTROL REGISTER 8 01S0005 01076000
*                                      INITIALIZATION ROUTINE ADDRESS   01077000
*                                      MDC180                        */ 01078000
*      2 CVTVSTOP PTR(31),          /* ADDRESS OF VARY CPU STOP CPU     01079000
*                                      ROUTINE MDC169                */ 01080000
*      2 CVTVPSA PTR(31),           /* ADDRESS OF COPY OF SYSGEN'ED     01081000
*                                      PSA - PLACED HERE BY NIP 01S0005 01082000
*                                      MDC170                        */ 01083000
*      2 CVTRMPTT PTR(31),          /* ADDRESS OF ISTRAMA1, THE VTAM    01084000
*                                      RESOURCE MANAGER FOR NORMAL      01085000
*                                      AND ABNORMAL TASK TERMINATION    01086000
*                                      (MDC322)              @Z30AP9A*/ 01087000
*      2 CVTRMPMT PTR(31),          /* ADDRESS OF ISTRAMA2, THE VTAM    01088000
*                                      RESOURCE MANAGER FOR NORMAL      01089000
*                                      AND ABNORMAL MEMORY      01S0005 01090000
*                                      TERMINATION (MDC323)  @Z30AP9A*/ 01091000
*      2 CVTEXP1 PTR(31),           /* ADDRESS OF EXIT PROLOGUE WHICH   01092000
*                                      RETURNS TO THE DISPATCHER        01093000
*                                      MDC173                        */ 01094000
*      2 CVTCSDRL PTR(31),          /* REAL ADDRESS OF COMMON SYSTEM    01095000
*                                      DATA AREA (CSD). INITIALIZED     01096000
*                                      BY NIP. MDC174                */ 01097000
*      2 CVTSSRB PTR(31),           /* STATUS STOP SRB ENTRY MDC175  */ 01098000
*      2 CVTRPT PTR(31),            /* ADDRESS OF IGARPT01 MODULE OF    01099000
*                                      RADIX PARTITION TREE SERVICES.   01100000
*                                      INITIALIZED BY NIP. MDC177    */ 01101000
*      2 CVTQV1 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    01102000
*                                      FOR SINGLE THREADED QUEUES       01103000
*                                      WITH HEADERS ONLY MDC181      */ 01104000
*      2 CVTQV2 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    01105000
*                                      FOR SINGLE THREADED QUEUES       01106000
*                                      WITH HEADER AND TRAILER MDC182*/ 01107000
*      2 CVTQV3 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    01108000
*                                      FOR DOUBLE THREADED QUEUES       01109000
*                                      MDC183                        */ 01110000
*      2 CVTGSDA PTR(31),           /* ADDRESS OF GLOBAL SYSTEM 01S0005 01111000
*                                      DUPLEX AREA. ADDRESS FILLED IN   01112000
*                                      BY NIP0. MDC184               */ 01113000
*       3 CVTGSDAB BIT(1),          /* IF HIGH-ORDER BIT IS ONE,        01114000
*                                      THERE IS A VALID VALUE IN        01115000
*                                      FOLLOWING 31 BITS MDC185      */ 01116000
*      2 CVTADV PTR(31),            /* ADDRESS OF ADDRESS       01S0005 01117000
*                                      VERIFICATION ROUTINE MDC186   */ 01118000
*      2 CVTTPIO PTR(31),           /* ADDRESS OF VTAM TPIO (SVC 124)   01119000
*                                      ROUTINE MDC193                */ 01120000
*      2 CVTCRCA PTR(31),           /* WHEN CHANNEL RECONFIGURATION     01121000
*                                      HARDWARE (CRH) IS ACTIVE,        01122000
*                                      ADDRESS OF CRH COMMUNICATION     01123000
*                                      AREA IECVCRCA. OTHERWISE,        01124000
*                                      ZERO. (MDC306)        @Z30CQ9A*/ 01125000
*      2 CVTEVENT PTR(31),          /* BRANCH ENTRY ADDRESS TO EVENTS   01126000
*                                      (FAST MULTIPLE WAIT ROUTINE)     01127000
*                                      (MDC316)              @Z30HP9A*/ 01128000
*      2 CVTSSCR PTR(31),           /* ADDRESS OF STORAGE SYSTEM        01129000
*                                      CONTROLLER RECOVERY MANAGER      01130000
*                                      CLEANUP ROUTINE (SSC RMCR)       01131000
*                                      (MDC319)              @Z30LP9A*/ 01132000
*      2 CVTCBBR PTR(31),           /* BRANCH ENTRY ADDRESS TO  01S0005 01133000
*                                      GETMAIN/FREEMAIN (MDC325)        01134000
*                                                            @Z30EN9A*/ 01135000
*      2 CVTEFF02 PTR(31),          /* ADDRESS OF IKJEFF02, TSO 01S0005 01136000
*                                      MESSAGE ISSUER SERVICE ROUTINE   01137000
*                                      (MDC326)              @ZM30972*/ 01138000
*      2 CVTRV604 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01139000
*      2 CVTRV605 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01140000
*      2 CVTRV606 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01141000
*      2 CVTRAC PTR(31),            /* ADDRESS OF ACCESS CONTROL CVT    01142000
*                                      (MDC320)              @Z40RP9A*/ 01143000
*      2 CVTCGK PTR(31),            /* ADDRESS OF ROUTINE USED TO       01144000
*                                      CHANGE THE KEY OF VIRTUAL        01145000
*                                      PAGES (MDC331)        @Z40EP9A*/ 01146000
*      2 CVTRV609 PTR(31),          /* RESERVED (MDC332)     @Z40AQ9A*/ 01147000
*      2 CVT0PT0E PTR(31),          /* ENTRY POINT TO IDENTIFY POST     01148000
*                                      EXIT ROUTINES (MDC334)   01S0005 01149000
*                                                            @Z40EP9A*/ 01150000
*      2 CVT0PT03 PTR(31),          /* POST REINVOCATION ENTRY POINT    01151000
*                                      FROM POST EXIT ROUTINES  01S0005 01152000
*                                      (MDC335)              @Z40EP9A*/ 01153000
*      2 CVTTCASP PTR(31),          /* RESERVED FOR FUTURE USE  01S0005 01154000
*                                      (MDC336)              @Z40DQ9A*/ 01155000
*      2 CVTASMRM PTR(31),          /* ADDRESS OF AUXILIARY STORAGE     01156000
*                                      MANAGEMENT RESOURCE MANAGER      01157000
*                                      FOR ADDRESS SPACE TERMINATION    01158000
*                                      (MDC341)              @Z40WP9A*/ 01159000
*      2 CVTJTERM PTR(31),          /* ADDRESS OF AUXILIARY STORAGE     01160000
*                                      MANAGEMENT JOB TERMINATION       01161000
*                                      RESOURCE MANAGER (MDC342)        01162000
*                                                            @Z40WP9A*/ 01163000
*      2 CVTRSUME PTR(31),          /* ADDRESS OF RESUME FUNCTION       01164000
*                                      (MDC344)              @Z40FP9A*/ 01165000
*      2 CVTTCTL PTR(31),           /* ADDRESS OF TRANSFER CONTROL      01166000
*                                      (TCTL) FUNCTION (MDC345) 01S0005 01167000
*                                                            @Z40FP9A*/ 01168000
*      2 CVTCDAL PTR(31),           /* ADDRESS OF COMMON DISPATCHER     01169000
*                                      ACTIVE LIST (MDC346)  @Z40FP9A*/ 01170000
*      2 CVTT6SVC PTR(31),          /* ENTRY POINT ADDRESS FOR TYPE 6   01171000
*                                      SVC EXIT FUNCTION (MDC347)       01172000
*                                                            @Z40FP9A*/ 01173000
*      2 CVTSUSP PTR(31),           /* ADDRESS OF SUSPEND ROUTINE       01174000
*                                      (MDC348)              @Z40FP9A*/ 01175000
*      2 CVTIHASU PTR(31),          /* ADDRESS OF BIT STRING (MDC355)   01176000
*                                                            @Z404P9A*/ 01177000
*      2 CVTRV621 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01178000
*      2 CVTRV622 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01179000
*      2 CVTRV623 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01180000
*      2 CVTRV624 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01181000
*      2 CVTRV625 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01182000
*      2 CVTRV626 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01183000
*      2 CVTRV627 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01184000
*      2 CVTRV628 PTR(31);          /* RESERVED (MDC307)     @Z30AQ9A*/ 01185000
*/*                                                                  */ 01186000
*/*            OS - OS/VS COMMON EXTENSION                           */ 01187000
*/*                                                                  */ 01188000
*                                                               01S0006 01189000
*   DECLARE                                                     01S0006 01190000
*     1 CVTXTNT1 BASED(CVTEXT1),    /* START OF OS - OS/VS COMMON       01191000
*                                      EXTENSION ICB421              */ 01192000
*      2 CVTFACHN PTR(31),          /* ADDRESS OF CHAIN OF DCB FIELD    01193000
*                                      AREAS (ISAM) ICB421           */ 01194000
*      2 CVTRSV87 PTR(31),          /* RESERVED                      */ 01195000
*      2 CVTRSV88 PTR(31);          /* RESERVED                      */ 01196000
*/*                                                                  */ 01197000
*/*            OS/VS1 - OS/VS2 COMMON EXTENSION                      */ 01198000
*/*                                                                  */ 01199000
*                                                               01S0007 01200000
*   DECLARE                                                     01S0007 01201000
*     1 CVTXTNT2 BASED(CVTEXT2),    /* START OF OS/VS1 - OS/VS2 01S0007 01202000
*                                      EXTENSION                     */ 01203000
*      2 CVTDSSV PTR(31),           /* ADDRESS OF THE DYNAMIC SUPPORT   01204000
*                                      SYSTEM (DSS) VECTOR TABLE        01205000
*                                      ICB313                        */ 01206000
*       3 CVTRSV89 PTR(8),          /* RESERVED ICB313               */ 01207000
*       3 CVTDSSVA PTR(24),         /* ADDRESS OF THE DSS VECTOR        01208000
*                                      TABLE ICB313                  */ 01209000
*      2 CVTNUCLS CHAR(1),          /* IDENTIFICATION OF THE NUCLEUS    01210000
*                                      MEMBER NAME ICB322            */ 01211000
*      2 CVTFLGBT BIT(8),           /* FLAG BYTE (OS/VS1) (MDC301)      01212000
*                                                            @X04EP9A*/ 01213000
*       3 CVTNPE BIT(1),            /* INDICATES NON-PAGING     01S0007 01214000
*                                      ENVIRONMENT (VM HANDSHAKING)     01215000
*                                      (OS/VS1) (MDC302)     @X04EP9A*/ 01216000
*       3 CVTVME BIT(1),            /* INDICATES MACHINE IS OPERATING   01217000
*                                      IN VM ENVIRONMENT (OS/VS1)       01218000
*                                      (MDC303)              @X04EP9A*/ 01219000
*       3 CVTBAH BIT(1),            /* INDICATES THAT THE VM/370 -      01220000
*                                      OS/VS1 BTAM AUTOPOLL HANDSHAKE   01221000
*                                      IS OPERATIONAL (OS/VS1)  01S0007 01222000
*                                      (MDC356)              @X60KL9A*/ 01223000
*       3 CVTRSV9D BIT(1),          /* RESERVED                      */ 01224000
*       3 CVTRSV9E BIT(1),          /* RESERVED                      */ 01225000
*       3 CVTRSV9F BIT(1),          /* RESERVED                      */ 01226000
*       3 CVTRSV9G BIT(1),          /* RESERVED                      */ 01227000
*       3 CVTRSV9H BIT(1),          /* RESERVED                      */ 01228000
*      2 CVTRSV91 FIXED(15),        /* RESERVED                      */ 01229000
*      2 CVTDEBVR PTR(31),          /* ADDRESS OF BRANCH ENTRY POINT    01230000
*                                      OF DEB VALIDITY CHECK ROUTINE    01231000
*                                      (ICB380)                XM9028*/ 01232000
*      2 CVTRSV92 PTR(31),          /* RESERVED (MDC190)       YM2278*/ 01233000
*      2 CVTRSV93 PTR(31),          /* RESERVED                      */ 01234000
*      2 CVTRSV94 PTR(31),          /* RESERVED                      */ 01235000
*      2 CVTQID PTR(31),            /* SAVE AS CVTQIDA BELOW ICB381  */ 01236000
*       3 CVTRSV95 PTR(8),          /* RESERVED ICB381               */ 01237000
*       3 CVTQIDA PTR(24),          /* ADDRESS OF QUEUE         01S0007 01238000
*                                      IDENTIFICATION (QID) TABLE       01239000
*                                      PREFIX ICB381                 */ 01240000
*      2 CVTOLTEP PTR(31),          /* POINTER TO CONTROL BLOCK 01S0007 01241000
*                                      CREATED BY SVC 59 TO POINT TO    01242000
*                                      PSEUDO-DEB'S ICB423           */ 01243000
*      2 CVTRSV96 FIXED(15),        /* RESERVED                      */ 01244000
*      2 CVTRSV97 FIXED(15),        /* RESERVED                      */ 01245000
*      2 CVTRSV98 PTR(31),          /* RESERVED                      */ 01246000
*      2 CVTCCVT PTR(31),           /* ADDRESS OF CRYPTOGRAPHIC 01S0007 01247000
*                                      FACILITY CVT (MDC370) @G39CP9A*/ 01248000
*      2 CVTSKTA PTR(31),           /* ADDRESS OF STORAGE KEY TABLE     01249000
*                                      (VM HANDSHAKING) (OS/VS1)        01250000
*                                      (MDC304)              @X04EP9A*/ 01251000
*      2 CVTICB PTR(31),            /* ADDRESS OF MASS STORAGE SYSTEM   01252000
*                                      (MSS) CONTROL BLOCK (MDC305)     01253000
*                                                            @Z30LP9A*/ 01254000
*      2 CVTRV400 BIT(8),           /* RESERVED                      */ 01255000
*       3 CVTRV401 BIT(1),          /* RESERVED                      */ 01256000
*       3 CVTRV402 BIT(1),          /* RESERVED                      */ 01257000
*       3 CVTRV403 BIT(1),          /* RESERVED                      */ 01258000
*       3 CVTRV404 BIT(1),          /* RESERVED                      */ 01259000
*       3 CVTRV405 BIT(1),          /* RESERVED                      */ 01260000
*       3 CVTRV406 BIT(1),          /* RESERVED                      */ 01261000
*       3 CVTRV407 BIT(1),          /* RESERVED                      */ 01262000
*       3 CVTRV408 BIT(1),          /* RESERVED                      */ 01263000
*      2 CVTRV409 BIT(8),           /* RESERVED                      */ 01264000
*       3 CVTRV410 BIT(1),          /* RESERVED                      */ 01265000
*       3 CVTRV411 BIT(1),          /* RESERVED                      */ 01266000
*       3 CVTRV412 BIT(1),          /* RESERVED                      */ 01267000
*       3 CVTRV413 BIT(1),          /* RESERVED                      */ 01268000
*       3 CVTRV414 BIT(1),          /* RESERVED                      */ 01269000
*       3 CVTRV415 BIT(1),          /* RESERVED                      */ 01270000
*       3 CVTRV416 BIT(1),          /* RESERVED                      */ 01271000
*       3 CVTRV417 BIT(1),          /* RESERVED                      */ 01272000
*      2 CVTRV418 PTR(8),           /* RESERVED                      */ 01273000
*      2 CVTRV419 PTR(8),           /* RESERVED                      */ 01274000
*      2 CVTRV420 PTR(15),          /* RESERVED                      */ 01275000
*      2 CVTRV421 FIXED(15),        /* RESERVED                      */ 01276000
*      2 CVTRV422 FIXED(15),        /* RESERVED                      */ 01277000
*      2 CVTRV423 FIXED(15),        /* RESERVED                      */ 01278000
*      2 CVTATCVT PTR(31),          /* POINTER TO VTAM'S CVT MDC080  */ 01279000
*       3 CVTATACT BIT(1),          /* IF ON, VTAM IS ACTIVE MDC081  */ 01280000
*      2 CVTRV425 PTR(31),          /* RESERVED                      */ 01281000
*      2 CVTRV426 PTR(31),          /* RESERVED                      */ 01282000
*      2 CVTRV427 PTR(31),          /* RESERVED                      */ 01283000
*      2 CVTRV428 FIXED(31),        /* RESERVED                      */ 01284000
*      2 CVTRV429 BIT(8),           /* RESERVED                      */ 01285000
*       3 CVTRV430 BIT(1),          /* RESERVED                      */ 01286000
*       3 CVTRV431 BIT(1),          /* RESERVED                      */ 01287000
*       3 CVTRV432 BIT(1),          /* RESERVED                      */ 01288000
*       3 CVTRV433 BIT(1),          /* RESERVED                      */ 01289000
*       3 CVTRV434 BIT(1),          /* RESERVED                      */ 01290000
*       3 CVTRV435 BIT(1),          /* RESERVED                      */ 01291000
*       3 CVTRV436 BIT(1),          /* RESERVED                      */ 01292000
*       3 CVTRV437 BIT(1),          /* RESERVED                      */ 01293000
*      2 CVTRV438 BIT(8),           /* RESERVED                      */ 01294000
*       3 CVTRV439 BIT(1),          /* RESERVED                      */ 01295000
*       3 CVTRV440 BIT(1),          /* RESERVED                      */ 01296000
*       3 CVTRV441 BIT(1),          /* RESERVED                      */ 01297000
*       3 CVTRV442 BIT(1),          /* RESERVED                      */ 01298000
*       3 CVTRV443 BIT(1),          /* RESERVED                      */ 01299000
*       3 CVTRV444 BIT(1),          /* RESERVED                      */ 01300000
*       3 CVTRV445 BIT(1),          /* RESERVED                      */ 01301000
*       3 CVTRV446 BIT(1),          /* RESERVED                      */ 01302000
*      2 CVTRV447 PTR(8),           /* RESERVED                      */ 01303000
*      2 CVTRV448 PTR(8),           /* RESERVED                      */ 01304000
*      2 CVTRV449 PTR(15),          /* RESERVED                      */ 01305000
*      2 CVTRV450 FIXED(15),        /* RESERVED                      */ 01306000
*      2 CVTRV451 FIXED(15),        /* RESERVED                      */ 01307000
*      2 CVTRV452 FIXED(15),        /* RESERVED                      */ 01308000
*      2 CVTRV453 PTR(31),          /* RESERVED                      */ 01309000
*      2 CVTRV454 PTR(31),          /* RESERVED                      */ 01310000
*      2 CVTRV455 PTR(31),          /* RESERVED                      */ 01311000
*      2 CVTRV456 PTR(31),          /* RESERVED                      */ 01312000
*      2 CVTRV457 BIT(8),           /* RESERVED                      */ 01313000
*       3 CVTRV458 BIT(1),          /* RESERVED                      */ 01314000
*       3 CVTRV459 BIT(1),          /* RESERVED                      */ 01315000
*       3 CVTRV460 BIT(1),          /* RESERVED                      */ 01316000
*       3 CVTRV461 BIT(1),          /* RESERVED                      */ 01317000
*       3 CVTRV462 BIT(1),          /* RESERVED                      */ 01318000
*       3 CVTRV463 BIT(1),          /* RESERVED                      */ 01319000
*       3 CVTRV464 BIT(1),          /* RESERVED                      */ 01320000
*       3 CVTRV465 BIT(1),          /* RESERVED                      */ 01321000
*      2 CVTRV466 BIT(8),           /* RESERVED                      */ 01322000
*       3 CVTRV467 BIT(1),          /* RESERVED                      */ 01323000
*       3 CVTRV468 BIT(1),          /* RESERVED                      */ 01324000
*       3 CVTRV469 BIT(1),          /* RESERVED                      */ 01325000
*       3 CVTRV470 BIT(1),          /* RESERVED                      */ 01326000
*       3 CVTRV471 BIT(1),          /* RESERVED                      */ 01327000
*       3 CVTRV472 BIT(1),          /* RESERVED                      */ 01328000
*       3 CVTRV473 BIT(1),          /* RESERVED                      */ 01329000
*       3 CVTRV474 BIT(1),          /* RESERVED                      */ 01330000
*      2 CVTRV475 PTR(8),           /* RESERVED                      */ 01331000
*      2 CVTRV476 PTR(8),           /* RESERVED                      */ 01332000
*      2 CVTRV477 PTR(8),           /* RESERVED                      */ 01333000
*      2 CVTRV478 PTR(8),           /* RESERVED                      */ 01334000
*      2 CVTRV479 FIXED(15),        /* RESERVED                      */ 01335000
*      2 CVTRV480 PTR(31),          /* RESERVED                      */ 01336000
*      2 CVTRV481 PTR(31),          /* RESERVED                      */ 01337000
*      2 CVTRV482 PTR(31);          /* RESERVED                      */ 01338000
*/*                       CVT PREFIX                                 */ 01339000
*                                                               01S0008 01340000
*   DCL                                                         01S0008 01341000
*     1 CVTFIX BASED(CVTPTR-256) BDY(WORD),                     01S0008 01342000
*      2 * CHAR(248) BDY(WORD),     /* RESERVED                      */ 01343000
*      2 * CHAR(2) BDY(WORD),       /* RESERVED                      */ 01344000
*      2 CVTMDL CHAR(2) BDY(WORD,3),/* CPU MODEL NUMBER IN SIGNLESS     01345000
*                                      PACKED DECIMAL, I.E., A MODEL    01346000
*                                      145 WOULD BE REPRESENTED AS      01347000
*                                      0145 HEX                      */ 01348000
*      2 CVTRELNO CHAR(4) BDY(WORD),/* RELEASE NUMBER (EBCDIC)       */ 01349000
*       3 CVTNUMB CHAR(2) BDY(WORD),/* RELEASE NUMBER                */ 01350000
*       3 CVTLEVL CHAR(2) BDY(WORD,3);/* LEVEL NUMBER OF THIS RELEASE*/ 01351000
*/*                    END OF CVT MACRO                              */ 01352000
*                                                               01S0009 01353000
*   DCL                                                         01S0009 01354000
*     1 IFGRPL BASED,               /* LEVEL ONE DECLARE             */ 01355000
*      2 RPLCOMN,                   /* RPL COMMON SECTION X03004     */ 01356000
*       3 RPLIDWD CHAR(4),          /* ID WORD OF RPL                */ 01357000
*        4 RPLID BIT(8),            /* IDENT & HEADER TYPE           */ 01358000
*        4 RPLSTYP PTR(8),          /* SUBTYPE                       */ 01359000
*        4 RPLREQ PTR(8),           /* REQUEST TYPE                  */ 01360000
*        4 RPLLEN PTR(8),           /* LENGTH OF THIS BLOCK          */ 01361000
*         5 RPLLEN2 PTR(8),         /* LENGTH OF THIS BLOCK X03004   */ 01362000
*       3 RPLPLHPT PTR(31),         /* PTR TO PLACEHOLDER            */ 01363000
*       3 RPLECB PTR(31),           /* EXTERNAL ECB PTR OR INTERNAL     01364000
*                                      ECB                           */ 01365000
*         5 RPLWAIT BIT(1),         /* EVENT WAITED ON               */ 01366000
*         5 RPLPOST BIT(1),         /* EVENT COMPLETE                */ 01367000
*       3 RPLFDBWD PTR(31),         /* FEEDBACK WORD@X04SVHS         */ 01368000
*        4 RPLSTAT BIT(8),          /* CURRENT RPL STATUS            */ 01369000
*        4 RPLFDBK PTR(24),         /* FEEDBACK AREA                 */ 01370000
*         5 RPLRTNCD PTR(8),        /* RPL RETURN CODE               */ 01371000
*          6 RPLERREG PTR(8),       /* SAME AS RPLRTNCD RECEIVED        01372000
*                                      X3004BS                       */ 01373000
*         5 RPLCNDCD BIT(16) BDY(BYTE),/* RPL CONDITION X3004BS      */ 01374000
*          6 RPLCMPON PTR(8),       /* COMPONENT ISSUING CODE(VSAM)  */ 01375000
*           7 RPLFDB2 PTR(8),       /* REASON CODE(VTAM) X03004      */ 01376000
*            8 RPLERLK BIT(1),      /* ERROR LOCK SET X03004         */ 01377000
*            8 RPLRVID BIT(1),      /* RVI RECEIVED X03004           */ 01378000
*            8 RPLATND BIT(1),      /* ATTENTION RECEIVED X03004     */ 01379000
*            8 RPLDVUNS BIT(1),     /* DEVICE UNUSEABLE X03004       */ 01380000
*            8 RPLIOERR BIT(1),     /* I/O ERROR - 0=INPUT/ 1=OUTPUT    01381000
*                                      X03004                        */ 01382000
*            8 RPLDLGFL BIT(1),     /* DIALOG INITIATION FAILED 01S0009 01383000
*                                      X03004                        */ 01384000
*            8 RPLCUERR BIT(1),     /* CONTROL UNIT FAILURE X03004   */ 01385000
*            8 RPLSTSAV BIT(1),     /* SENSE BYTES PRESENT X03004    */ 01386000
*          6 RPLERRCD PTR(8),       /* ERROR CODE(VSAM)              */ 01387000
*           7 RPLFDB3 PTR(8),       /* DATA FLAGS(VTAM) X03004       */ 01388000
*            8 RPLUINPT BIT(1),     /* UNSOLICITED INPUT X03004      */ 01389000
*            8 RPLSV32 BIT(1),      /* RESERVED X03004               */ 01390000
*            8 RPLREOB BIT(1),      /* END OF BLOCK X03004           */ 01391000
*            8 RPLREOM BIT(1),      /* END OF MESSAGE X03004         */ 01392000
*            8 RPLREOT BIT(1),      /* END OF TRANSMISSION X03004    */ 01393000
*            8 RPLLGFRC BIT(1),     /* LOGOFF RECEIVEDX03004         */ 01394000
*            8 RPLRLG BIT(1),       /* LEADING GRAPHICS RECEIVED        01395000
*                                      X03004                        */ 01396000
*            8 RPLRDSOH BIT(1),     /* START-OF-HEADER (SOH) RECEIVED   01397000
*                                      X03004                        */ 01398000
*       3 RPLKEYLE FIXED(15),       /* KEY LENGTH (PROC=GEN)         */ 01399000
*        4 RPLKEYL FIXED(15),       /* SAME AS RPLKEYLE              */ 01400000
*       3 RPLSTRID FIXED(15),       /* STRING IDENTIFIER             */ 01401000
*       3 RPLCCHAR PTR(31),         /* CONTROL CHAR POINTER          */ 01402000
*       3 RPLDACB PTR(31),          /* DATA ACB POINTER              */ 01403000
*       3 RPLTCBPT PTR(31),         /* TCB POINTER                   */ 01404000
*       3 RPLAREA PTR(31),          /* DATA AREA POINTER             */ 01405000
*       3 RPLARG PTR(31),           /* SEARCH ARGUMENT PTR SETPRT       01406000
*                                      PARMLIST PTR                  */ 01407000
*        4 RPLSAF PTR(16),          /* SOURCE ADDRESS FIELD X03004   */ 01408000
*        4 RPLDAF PTR(16),          /* DESTINATION ADDRESS FIELD        01409000
*                                      X03004                        */ 01410000
*       3 RPLOPTCD BIT(32),         /* OPTION CODES                  */ 01411000
*        4 RPLOPT1 BIT(8),          /* OPTION BYTE 1                 */ 01412000
*         5 RPLLOC BIT(1),          /* LOCATE MODE MOVE MODE IF OFF  */ 01413000
*         5 RPLDIR BIT(1),          /* DIRECT SEARCH ACCESS          */ 01414000
*         5 RPLSEQ BIT(1),          /* SEQUENTIAL ACCESS             */ 01415000
*         5 RPLSKP BIT(1),          /* SKIP SEQ ACCESS               */ 01416000
*         5 RPLASY BIT(1),          /* ASYNCHRONOUS REQUEST SYNCH IF    01417000
*                                      OFF                           */ 01418000
*         5 RPLKGE BIT(1),          /* SEARCH KEY GT/EQ SEARCH KEY EQ   01419000
*                                      IF OFF                        */ 01420000
*         5 RPLGEN BIT(1),          /* GENERIC KEY REQUEST FULL KEY     01421000
*                                      IF OFF                        */ 01422000
*         5 RPLECBSW BIT(1),        /* EXTERNAL ECB                  */ 01423000
*          6 RPLECBIN BIT(1),       /* SAME AS RPLECBSW X03004       */ 01424000
*        4 RPLOPT2 BIT(8),          /* OPTION BYTE 2                 */ 01425000
*         5 RPLKEY BIT(1),          /* KEYED ACCESS                  */ 01426000
*         5 RPLADR BIT(1),          /* ACCESS BY LOCATION            */ 01427000
*          6 RPLADD BIT(1),         /* SAME AS RPLADR                */ 01428000
*         5 RPLCNV BIT(1),          /* CINV ACCESS (BY RBA)          */ 01429000
*         5 RPLBWD BIT(1),          /* FWD=0/BWD=1           @X04SVHS*/ 01430000
*         5 RPLLRD BIT(1),          /* ARD=0/LRD=1           @X04SVHS*/ 01431000
*         5 RPLWAITX BIT(1),        /* SYNCH PROCESSING WAIT EXIT       01432000
*                                                            @ZA07549*/ 01433000
*         5 RPLUPD BIT(1),          /* UPDATE IF ON                  */ 01434000
*         5 RPLNSP BIT(1),          /* NOTE STRING POSITION          */ 01435000
*        4 RPLOPT3 BIT(8),          /* OPTION BYTE 3                 */ 01436000
*         5 RPLEODS BIT(1),         /* END OF USER SYSOUT            */ 01437000
*         5 RPLSFORM BIT(1),        /* SPECIAL FORM ON REMOTE PRINTER*/ 01438000
*         5 RPLBLK BIT(1),          /* BLOCK=1,UNBLOCKED=0 FIXED        01439000
*                                      BLOCK PROCESSING X04SVHS      */ 01440000
*         5 RPLVFY BIT(1),          /* UCS/FCB VERIFY=1              */ 01441000
*         5 RPLFLD BIT(1),          /* UCS FOLD=1                    */ 01442000
*         5 RPLFMT BIT(2),          /* FORMAT TYPE 00=UCS LOAD 01=FCB   01443000
*                                      LOAD 10=3800 PRINTER 11  01S0009 01444000
*                                      RESERVED                      */ 01445000
*         5 RPLALIGN BIT(1),        /* 0=DO NOT ALIGN FCB BUFFER        01446000
*                                      LOADS 1=ALIGN BUFFER AND 01S0009 01447000
*                                      NOTIFY OPERATOR               */ 01448000
*        4 RPLOPT4 BIT(8),          /* OPTION BYTE 4                 */ 01449000
*         5 RPLENDTR BIT(1),        /* 3800 END OF TRANSMISSION 01S0009 01450000
*                                                            @Z40SVHS*/ 01451000
*         5 RPLMKFRM BIT(1),        /* 3800 MARK FORM        @Z40SVHS*/ 01452000
*         5 * BIT(6),               /* RESERVED                      */ 01453000
*       3 RPLNXTRP PTR(31),         /* CHAIN TO NEXT RPL             */ 01454000
*        4 RPLCHAIN PTR(31),        /* SAME AS RPLNXTRP              */ 01455000
*       3 RPLRLEN PTR(31),          /* LENGTH OF RECORD              */ 01456000
*       3 RPLBUFL PTR(31),          /* USER BUFFER SIZE              */ 01457000
*       3 RPLOPTC2 BIT(32),         /* VTAM OPTIONS X03004           */ 01458000
*        4 RPLOPT5 BIT(8),          /* OPTION BYTE 5 X03004          */ 01459000
*         5 RPLDLGIN BIT(1),        /* 1 = CS / 0 = CA X03004        */ 01460000
*         5 * BIT(1),               /* RESERVED              @Z40BHUC*/ 01461000
*         5 RPLPSOPT BIT(1),        /* 1 = PASS/0 = RELEASE X03004   */ 01462000
*         5 RPLWRTYP BIT(3),        /* WRITE TYPE X03004             */ 01463000
*          6 RPLNERAS BIT(1),       /* WRITE NO ERASE X03004         */ 01464000
*          6 RPLEAU BIT(1),         /* WRITE EAU X03004              */ 01465000
*          6 RPLERACE BIT(1),       /* WRITE WITH ERASE X03004       */ 01466000
*         5 RPLNODE BIT(1),         /* 1=ANY/0=SPEC X03004           */ 01467000
*         5 RPLWROPT BIT(1),        /* 1=CONV/0=NCONV X03004         */ 01468000
*        4 RPLOPT6 BIT(8),          /* OPTION BYTE 6 X03004          */ 01469000
*         5 RPLUNTYP BIT(3),        /* UNIT TYPE X03004              */ 01470000
*          6 RPLEOB BIT(1),         /* WRITE = BLK X03004            */ 01471000
*          6 RPLEOM BIT(1),         /* WRITE = LBM X03004            */ 01472000
*          6 RPLEOT BIT(1),         /* WRITE = LBT X03004            */ 01473000
*         5 RPLCOND BIT(1),         /* CONDITIONAL X03004            */ 01474000
*         5 RPLNCOND BIT(1),        /* UNCONDITIONAL X03004          */ 01475000
*         5 RPLLOCK BIT(1),         /* LOCK X03004                   */ 01476000
*         5 RPLRSV67 BIT(1),        /* RESERVED X03004               */ 01477000
*         5 RPLRSV68 BIT(1),        /* RESERVED X03004               */ 01478000
*        4 RPLOPT7 BIT(8),          /* OPTION BYTE 7 X03004          */ 01479000
*         5 RPLCNOPT BIT(3),        /* CONNECTION OPTION X03004      */ 01480000
*          6 RPLCNALL BIT(1),       /* CONALL X03004                 */ 01481000
*          6 RPLCNANY BIT(1),       /* CONANY X03004                 */ 01482000
*          6 RPLCNIMM BIT(1),       /* RESERVED FOR CONIMM X03004    */ 01483000
*         5 RPLQOPT BIT(1),         /* 1 = Q / 0 = NQ X03004         */ 01484000
*         5 RPLTPOST BIT(1),        /* RPL ALREADY UNDER PSS @XM08790*/ 01485000
*         5 RPLRLSOP BIT(1),        /* 1 = RELQ / 0 = NRELQ X03004   */ 01486000
*         5 RPLTCRNO BIT(1),        /* CLOSE IN PROCESS FOR PO  01S0009 01487000
*                                      INTERFACE             @Z40BHUC*/ 01488000
*         5 RPLRSV78 BIT(1),        /* RESERVED X03004               */ 01489000
*        4 RPLOPT8 BIT(8),          /* OPTION BYTE 8 X03004          */ 01490000
*         5 RPLODACQ BIT(1),        /* ACQUIRE X03004                */ 01491000
*         5 RPLODACP BIT(1),        /* ACCEPT X03004                 */ 01492000
*         5 RPLODPRM BIT(1),        /* PREEMPT X03004                */ 01493000
*         5 RPLPEND BIT(1),         /* PEND X03004                   */ 01494000
*         5 RPLSESS BIT(1),         /* SESSION X03004                */ 01495000
*         5 RPLACTV BIT(1),         /* ACTIVE X03004                 */ 01496000
*         5 RPLUNCON BIT(1),        /* UNCONDL X03004                */ 01497000
*         5 RPLRSV88 BIT(1),        /* RESERVED X03004               */ 01498000
*       3 RPLRBAR CHAR(8)           /* RBA RETURN LOCATION           */ 01499000
*             BDY(WORD),                                        01S0009 01500000
*        4 RPLAIXPC PTR(16),        /* AIX POINTER COUNT     @X04SVHS*/ 01501000
*        4 RPLAIXID BIT(8),         /* AIX POINTER TYPE      @X04SVHS*/ 01502000
*         5 RPLAXPKP BIT(1),        /* RBA=0/PRIME=1         @XM07761*/ 01503000
*         5 * BIT(7),               /* RESERVED              @X04SVHS*/ 01504000
*        4 * BIT(8),                /* RESERVED              @X04SVHS*/ 01505000
*        4 RPLDDDD PTR(32),         /* RELATIVE BYTE ADDRESS         */ 01506000
*       3 RPLEXTDS BIT(8),          /* EXIT DEFINITIONS X03004       */ 01507000
*        4 RPLEXTD1 BIT(8),         /* SAME AS RPLEXTDS X03004       */ 01508000
*         5 RPLEXSCH BIT(1),        /* EXIT SCHEDULED X03004         */ 01509000
*         5 RPLNEXIT BIT(1),        /* NO EXIT SPECIFIED X03004      */ 01510000
*         5 RPLEXIT BIT(1),         /* ASYNCH EXIT           @XM01127*/ 01511000
*         5 * BIT(1),               /* RESERVED              @XM01127*/ 01512000
*         5 RPLTCRYP BIT(1),        /* IF ON, ENCRYPTION FEATURE REQ    01513000
*                                                            @G40AKSL*/ 01514000
*         5 RPLNIB BIT(1),          /* ARG HAS NIB POINTER IF ON        01515000
*                                      X03004                        */ 01516000
*         5 RPLBRANC BIT(1),        /* BRANCH ENTRY TO MACRO IF ON      01517000
*                                      X03004                        */ 01518000
*       3 RPLACTIV BIT(8),          /* ACTIVE INDICATOR         01S0009 01519000
*                                      FF=ACTIVE/00=INACTIVE         */ 01520000
*       3 RPLEMLEN PTR(16),         /* ERROR MESSAGE AREA LENGTH     */ 01521000
*       3 RPLERMSA PTR(31),         /* PTR TO ERR MSG AREA           */ 01522000
*      2 RPLVTEXT,                  /* START OF EXTENSION            */ 01523000
*       3 RPLAAREA PTR(31),         /* ALTERNATE AREA ADDR X03004    */ 01524000
*       3 RPLAARLN PTR(31),         /* ALTERNATE AREA LENGTH X03004  */ 01525000
*       3 RPLARCLN PTR(31),         /* ALTERNATE RECORD LENGTH X03004*/ 01526000
*       3 RPLFDBK2 BIT(32),         /* FEED BACK WORD 2 X03004       */ 01527000
*         5 RPLSSNSI BIT(16),       /* SYSTEM SENSE INPUT X03004JS   */ 01528000
*          6 RPLDSB BIT(16),        /* DEVICE STATUS BYTES X03004JS  */ 01529000
*           7 RPLDSB1 BIT(8),       /* DEVICE STATUS BYTE 1 X03004JS */ 01530000
*            8 RPLSSEI BIT(8),      /* SYSTEM SENSE ERROR CODES 01S0009 01531000
*                                      X03004JS                      */ 01532000
*             9 RPLPATHI BIT(1),    /* SSENSEI PATH X03004JS         */ 01533000
*             9 RPLCPMI BIT(1),     /* SSENSEI CPM X03004JS          */ 01534000
*             9 RPLSTATI BIT(1),    /* SSENSEI STATEX03004JS         */ 01535000
*             9 RPLFII BIT(1),      /* SSENSEI FI X03004JS           */ 01536000
*             9 RPLRRI BIT(1),      /* SSENSEI RR X03004JS           */ 01537000
*             9 * BIT(3),           /* RESERVED FOR VTAM X03004JS    */ 01538000
*           7 RPLDSB2 BIT(8),       /* DEVICE STATUS BYTE 2 X03004JS */ 01539000
*            8 RPLSSMI PTR(8),      /* SYSTEM SENSE MODIFIER INPUT      01540000
*                                      X03004HS                      */ 01541000
*         5 RPLUSNSI PTR(16),       /* USER SENSE INPUT X03004HS     */ 01542000
*          6 RPLESR1 BIT(8),        /* EXTENDED SYSTEM RESPONSE 1       01543000
*                                      X03004JS                      */ 01544000
*          6 RPLESR2 BIT(8),        /* EXTENDED SYSTEM RESPONSE 2       01545000
*                                      X03004JS                      */ 01546000
*       3 RPLUSFLD BIT(32),         /* USER FIELD X03004             */ 01547000
*       3 RPLOPTC3 BIT(32),         /* VTAM OPTIONS X03004           */ 01548000
*        4 RPLOPT9 BIT(8),          /* OPTION BYTE 9 X03004          */ 01549000
*         5 RPLLOGON BIT(1),        /* INQ LOGON MSG X03004          */ 01550000
*         5 RPLDEVCH BIT(1),        /* INQ DEVICE CHARX03004         */ 01551000
*         5 RPLTERMS BIT(1),        /* INQ TERMS X03004              */ 01552000
*         5 RPLCOUNT BIT(1),        /* INQ COUNTS X03004             */ 01553000
*         5 RPLAPPST BIT(1),        /* INQ APPSTAT X03004            */ 01554000
*         5 RPLRNNM BIT(1),         /* INQ RNNAME X03004             */ 01555000
*         5 RPLCIDE BIT(1),         /* INQ CIDXLATE X03004           */ 01556000
*         5 RPLTOPL BIT(1),         /* INQ TOP LOGON X03004          */ 01557000
*        4 RPLOPT10 BIT(8),         /* OPTION BYTE 10 X03004         */ 01558000
*         5 RPLBSCID BIT(1),        /* INQ BSC ID X03004             */ 01559000
*         5 RPLDSPLY BIT(1),        /* INQ DISPLAY X03004            */ 01560000
*         5 RPLSPARM BIT(1),        /* INQ SESSPARM          @Z40BHUC*/ 01561000
*         5 RPLTSKY BIT(1),         /* INQ SESSKEY           @G40AKSL*/ 01562000
*         5 RPLRSVI3 BIT(1),        /* RESERVED X03004               */ 01563000
*         5 RPLRSVI4 BIT(1),        /* RESERVED X03004               */ 01564000
*         5 RPLRSVI5 BIT(1),        /* RESERVED X03004               */ 01565000
*         5 RPLRSVI6 BIT(1),        /* RESERVED X03004               */ 01566000
*        4 RPLOPT11 BIT(8),         /* OPTION BYTE 11 X03004         */ 01567000
*         5 RPLQUIES BIT(1),        /* SETLOGON QUIESCE X03004       */ 01568000
*         5 RPLSTART BIT(1),        /* SETLOGON START X03004         */ 01569000
*         5 RPLSTOP BIT(1),         /* SETLOGON STOP X03004          */ 01570000
*         5 RPLRSVE4 BIT(1),        /* RESERVED X03004               */ 01571000
*         5 RPLRSVE5 BIT(1),        /* RESERVED X03004               */ 01572000
*         5 RPLRSVE6 BIT(1),        /* RESERVED X03004               */ 01573000
*         5 RPLRSVE7 BIT(1),        /* RESERVED X03004               */ 01574000
*         5 RPLRSVE8 BIT(1),        /* RESERVED X03004               */ 01575000
*        4 RPLOPT12 BIT(8),         /* OPTION BYTE 12 X03004         */ 01576000
*         5 * BIT(1),               /* RESERVED              @Z40BHUC*/ 01577000
*         5 RPLKEEP BIT(1),         /* RECEIVE KEEP           X3004BH*/ 01578000
*         5 RPLTRUNC BIT(1),        /* RECEIVE TRUNC          X3004BH*/ 01579000
*         5 RPLNIBTK BIT(1),        /* RECEIVE NIBTK          X3004BH*/ 01580000
*         5 * BIT(1),               /* RESERVED              @Z40BHUC*/ 01581000
*         5 * BIT(1),               /* RESERVED              @Z40BHUC*/ 01582000
*         5 * BIT(1),               /* RESERVED              @Z40BHUC*/ 01583000
*         5 RPLFMHDR BIT(1),        /* 0=NFMHDR/1=FMHDR X03004JS     */ 01584000
*       3 RPLOSENS BIT(32),         /* SENSE OUTPUT DATA      X3004BH*/ 01585000
*        4 RPLSSNSO BIT(16),        /* SYSTEM SENSE OUTPUT    X3004BH*/ 01586000
*         5 RPLSSEO BIT(8),         /* SYSTEM SENSE ERROR CODES 01S0009 01587000
*                                      X03004JS                      */ 01588000
*          6 * BIT(1),              /* RESERVED FOR VTAM X03004JS    */ 01589000
*          6 RPLCPMO BIT(1),        /* SSENSEO CPM X03004JS          */ 01590000
*          6 RPLSTATO BIT(1),       /* SSENSEO STATE X03004JS        */ 01591000
*          6 RPLFIO BIT(1),         /* SSENSEO FI X03004JS           */ 01592000
*          6 RPLRRO BIT(1),         /* SSENSEO RR X03004JS           */ 01593000
*          6 * BIT(3),              /* RESERVED FOR VTAM X03004JS    */ 01594000
*         5 RPLSSMO PTR(8),         /* SYSTEM SENSE MODIFIER OUTPUT     01595000
*                                      X03004HS                      */ 01596000
*        4 RPLUSNSO PTR(16),        /* USER SENSE OUTPUT     @Y30ASHS*/ 01597000
*       3 RPLSAV13 PTR(31),         /* SAVE AREA FOR VTAM FAST PATH     01598000
*                                                            @Y30ASHS*/ 01599000
*       3 RPLSIGDA PTR(31);         /* SIGNAL DATA FIELD     @Z40BHUC*/ 01600000
*   DCL                                                         01S0010 01601000
*     1 RPLOF16 BASED(ADDR(RPLKEYLE)),/* BASE AT OFFSET 16    X3004BH*/ 01602000
*      2 RPLRH3 BIT(8),             /* THIRD RH BYTE          X3004BH*/ 01603000
*       3 RPLBB BIT(1),             /* BRACKET - 0=NBB/1=BB X03004JS */ 01604000
*       3 RPLEB BIT(1),             /* BRACKET - 0=NEB/1=EB X03004JS */ 01605000
*       3 RPLCMD BIT(1),            /* CHNGDIR - 0=NCMD/1=CMD X3004BH*/ 01606000
*       3 RPLCHREQ BIT(1),          /* CHNGDIR - 0=NREQ/1=REQ X3004BH*/ 01607000
*       3 RPLCSI BIT(1),            /* 0=STANDARD - CODESEL 1=ALT       01608000
*                                                            @Z40BHUC*/ 01609000
*       3 * BIT(3),                 /* RESERVED FOR VTAM      X3004BH*/ 01610000
*      2 RPLSRTYP BIT(8),           /* SEND OR RECEIVE TYPE   X3004BH*/ 01611000
*       3 RPLSTYPE BIT(4),          /* SEND TYPE              X3004BH*/ 01612000
*        4 RPLSRESP BIT(1),         /* STYPE - 0=REQ/1=RESP   X3004BH*/ 01613000
*        4 * BIT(3),                /* RESERVED FOR VTAM      X3004BH*/ 01614000
*       3 RPLRTYPE BIT(4),          /* RECEIVE TYPE           X3004BH*/ 01615000
*        4 RPLRRESP BIT(1),         /* RTYPE - 0=NRESP/ 1=RESP  01S0010 01616000
*                                                             X3004BH*/ 01617000
*        4 RPLNFSYN BIT(1),         /* RTYPE - 0=DFSYN/ 1=NDFSYN        01618000
*                                                             X3004BH*/ 01619000
*        4 RPLDFASY BIT(1),         /* RTYPE - 0=NDFASY/ 1=DFASY        01620000
*                                                             X3004BH*/ 01621000
*        4 * BIT(1),                /* RESERVED              @Z40BHUC*/ 01622000
*      2 RPLCHN BIT(8),             /* POSITION IN RU CHAIN   X3004BH*/ 01623000
*       3 RPLFIRST BIT(1),          /* CHAIN FIRST            X3004BH*/ 01624000
*       3 RPLMIDLE BIT(1),          /* CHAIN MIDDLE           X3004BH*/ 01625000
*       3 RPLLAST BIT(1),           /* CHAIN LAST             X3004BH*/ 01626000
*       3 RPLONLY BIT(1),           /* CHAIN ONLY             X3004BH*/ 01627000
*       3 * BIT(4),                 /* RESERVED FOR VTAM      X3004BH*/ 01628000
*      2 RPLVTFL1 BIT(8),           /* VTAM FLAGS             X3004BH*/ 01629000
*       3 * BIT(1),                 /* RESERVED              @Z40BHUC*/ 01630000
*       3 RPLVTUSE BIT(1),          /* 0=APPL/1=SYSTEMX3004BH        */ 01631000
*       3 RPLAUTUS BIT(1),          /* VTAM FAST PATH@Y30ASHS        */ 01632000
*       3 RPLTNDSP BIT(1),          /* 1=DOMAIN REQ          @G40AKCM*/ 01633000
*       3 RPLTLGAC BIT(1),          /* 1=LOGON ACCOMPLISHED  @G40AKCM*/ 01634000
*       3 * BIT(3),                 /* RESERVED FOR VTAM     @G40AKCM*/ 01635000
*      2 RPLVTFL2 BIT(8),           /* POST/RESPOND FLAGS     X3004BH*/ 01636000
*       3 RPLPOSTV BIT(4),          /* POST FLAGS             X3004BH*/ 01637000
*        4 RPLSCHED BIT(1),         /* POST - 0=RESP/1=SCHED  X3004BH*/ 01638000
*        4 * BIT(3),                /* RESERVED FOR VTAM      X3004BH*/ 01639000
*       3 RPLRESP BIT(4),           /* RESPOND FLAGS          X3004BH*/ 01640000
*        4 RPLQRI BIT(1),           /* RESPOND - 0=NQREQ/1=QREQ 01S0010 01641000
*                                                            @G40AKSL*/ 01642000
*        4 RPLEX BIT(1),            /* RESPOND - 0=NEX/1=EX   X3004BH*/ 01643000
*        4 RPLNFME BIT(1),          /* RESPOND - 0=FME/1=NFME X3004BH*/ 01644000
*        4 RPLRRN BIT(1),           /* RESPOND - 0=NRRN/1=RRN X3004BH*/ 01645000
*      2 RPLCNTRL CHAR(3),          /* RU CONTROL CODES       X3004BH*/ 01646000
*       3 RPLCNTDF BIT(8),          /* DATA FLOW CONTROL CODES  01S0010 01647000
*                                                             X3004BH*/ 01648000
*        4 RPLDATA BIT(1),          /* CONTROL DATA           X3004BH*/ 01649000
*        4 RPLCNCEL BIT(1),         /* CONTROL CANCEL         X3004BH*/ 01650000
*        4 RPLQC BIT(1),            /* CONTROL QC             X3004BH*/ 01651000
*        4 RPLQEC BIT(1),           /* CONTROL QEC            X3004BH*/ 01652000
*        4 RPLCHASE BIT(1),         /* CONTROL CHASE          X3004BH*/ 01653000
*        4 RPLRELQ BIT(1),          /* CONTROL RELQ           X3004BH*/ 01654000
*        4 RPLQI BIT(1),            /* RESERVED FOR VTAM X03004JS    */ 01655000
*        4 * BIT(1),                /* RESERVED FOR VTAM      X3004BH*/ 01656000
*       3 RPLCNTDC BIT(8),          /* DATA FLOW CONTROL CTD X03004JS*/ 01657000
*        4 RPLBID BIT(1),           /* CONTROL BID X03004JS          */ 01658000
*        4 RPLRTR BIT(1),           /* CONTROL RTR X03004JS          */ 01659000
*        4 RPLLUS BIT(1),           /* CONTROL LUS X03004JS          */ 01660000
*        4 RPLSIGNL BIT(1),         /* CONTROL SIGNALX03004JS        */ 01661000
*        4 RPLTBIND BIT(1),         /* CONTROL BIND          @G40AKSL*/ 01662000
*        4 RPLTUNBD BIT(1),         /* CONTROL UNBIND@G40AKSL        */ 01663000
*        4 RPLSBI BIT(1),           /* CONTROL SBI           @G40AKSL*/ 01664000
*        4 RPLBIS BIT(1),           /* CONTROL BIS           @G40AKSL*/ 01665000
*       3 RPLCNTSC BIT(8),          /* SESSION CONTROL CODES  X3004BH*/ 01666000
*        4 RPLSDT BIT(1),           /* CONTROL SDT            X3004BH*/ 01667000
*        4 RPLCLEAR BIT(1),         /* CONTROL CLEAR          X3004BH*/ 01668000
*        4 RPLSTSN BIT(1),          /* CONTROL STSN           X3004BH*/ 01669000
*        4 RPLSHUTD BIT(1),         /* CONTROL SHUTD          X3004BH*/ 01670000
*        4 RPLSHUTC BIT(1),         /* CONTROL SHUTC          X3004BH*/ 01671000
*        4 RPLRQR BIT(1),           /* CONTROL RQR            X3004BH*/ 01672000
*        4 RPLRSHUT BIT(1),         /* CONTROL RSHUTDX03004JS        */ 01673000
*        4 * BIT(1);                /* RESERVED FOR VTAM X03004JS    */ 01674000
*   DCL                                                         01S0011 01675000
*     1 RPLOF56 BASED(ADDR(RPLOPT5)),/* BASE ON RPLOPT5      @G69AKJP*/ 01676000
*      2 RPLO5 BIT(8),              /* VTAM OPTION BYTE 5    @G69AKJP*/ 01677000
*       3 * BIT(1),                 /* RESERVED              @G69AKJP*/ 01678000
*       3 RPLTNFY BIT(1),           /* THIRD PARTY NOTIFY    @G69AKJP*/ 01679000
*       3 * BIT(6);                 /* RESERVED              @G69AKJP*/ 01680000
*   DCL                                                         01S0012 01681000
*     1 RPLOF60 BASED(ADDR(RPLRBAR)),/* BASE AT OFFSET 60     X3004BH*/ 01682000
*      2 RPLOBSQV FIXED(16),        /* STSN OUTBOUND SEQ. NO. X3004BH*/ 01683000
*      2 RPLIBSQV FIXED(16),        /* STSN INBOUND SEQ. NO.  X3004BH*/ 01684000
*      2 RPLOBSQ BIT(8),            /* STSN OUTBOUND ACTION CODES       01685000
*                                                             X3004BH*/ 01686000
*       3 RPLOSET BIT(1),           /* OBSQAC SET             X3004BH*/ 01687000
*       3 RPLOTST BIT(1),           /* OBSQAC TESTSET         X3004BH*/ 01688000
*       3 RPLORSET BIT(1),          /* OBSQAC RESET           X3004BH*/ 01689000
*       3 RPLOIGN BIT(1),           /* OBSQAC IGNORE          X3004BH*/ 01690000
*       3 RPLOPOS BIT(1),           /* OBSQAC TESTPOS         X3004BH*/ 01691000
*       3 RPLONEG BIT(1),           /* OBSQAC TESTNEG         X3004BH*/ 01692000
*       3 RPLOINV BIT(1),           /* OBSQAC INVALID         X3004BH*/ 01693000
*       3 * BIT(1),                 /* RESERVED FOR VTAM      X3004BH*/ 01694000
*      2 RPLIBSQ BIT(8),            /* STSN INBOUND ACTION CODES        01695000
*                                                             X3004BH*/ 01696000
*       3 RPLISET BIT(1),           /* IBSQAC SET             X3004BH*/ 01697000
*       3 RPLITST BIT(1),           /* IBSQAC TESTSET         X3004BH*/ 01698000
*       3 RPLIRSET BIT(1),          /* IBSQAC RESET           X3004BH*/ 01699000
*       3 RPLIIGN BIT(1),           /* IBSQAC IGNORE          X3004BH*/ 01700000
*       3 RPLIPOS BIT(1),           /* IBSQAC TESTPOS         X3004BH*/ 01701000
*       3 RPLINEG BIT(1),           /* IBSQAC TESTNEG         X3004BH*/ 01702000
*       3 RPLIINV BIT(1),           /* IBSQAC INVALID         X3004BH*/ 01703000
*       3 * BIT(1),                 /* RESERVED FOR VTAM      X3004BH*/ 01704000
*      2 RPLSEQNO FIXED(16);        /* SEQUENCE NUMBERX3004BH        */ 01705000
*   DCL                                                         01S0013 01706000
*     ISTRPL BASED(ADDR(IFGRPL))    /* ISTRPL LENGTH           X03004*/ 01707000
*         CHAR(LENGTH(IFGRPL));     /* DUE TO SYNTAX ERR. PRIMARY       01708000
*                                      CANNOT ISSUE TERMSESS OR MACRO   01709000
*                                      FUNCTION FAILED,SENSE INC.    */ 01710000
*/*                                                                  */ 01711000
*                                                               01S0014 01712000
*                                   /* MACRO                   X03004*/ 01713000
*   DCL                                                         01S0014 01714000
*     RPLGET PTR(8) CONSTANT(0);    /* GET REQUEST           @X04SVHS*/ 01715000
*   DCL                                                         01S0015 01716000
*     RPLPUT PTR(8) CONSTANT(1);    /* PUT REQUEST           @X04SVHS*/ 01717000
*   DCL                                                         01S0016 01718000
*     RPLCHECK PTR(8) CONSTANT(2);  /* CHECK REQUEST         @X04SVHS*/ 01719000
*   DCL                                                         01S0017 01720000
*     RPLPOINT PTR(8) CONSTANT(3);  /* POINT REQUEST         @X04SVHS*/ 01721000
*   DCL                                                         01S0018 01722000
*     RPLENDRE PTR(8) CONSTANT(4);  /* ENDREQ REQUEST@X04SVHS        */ 01723000
*   DCL                                                         01S0019 01724000
*     RPLERASE PTR(8) CONSTANT(5);  /* ERASE REQUEST         @X04SVHS*/ 01725000
*   DCL                                                         01S0020 01726000
*     RPLVERIF PTR(8) CONSTANT(6);  /* VERIFY REQUEST@X04SVHS        */ 01727000
*   DCL                                                         01S0021 01728000
*     RPLPFMTD PTR(8) CONSTANT(8);  /* DATA PREFORMAT@X04SVHS        */ 01729000
*   DCL                                                         01S0022 01730000
*     RPLPFMTI PTR(8) CONSTANT(9);  /* INDEX PREFORMAT       @X04SVHS*/ 01731000
*   DCL                                                         01S0023 01732000
*     RPLFRCIO PTR(8) CONSTANT(10); /* FORCE I/O REQUEST     @X04SVHS*/ 01733000
*   DCL                                                         01S0024 01734000
*     RPLGETIX PTR(8) CONSTANT(11); /* GETIX REQUEST@X04SVHS         */ 01735000
*   DCL                                                         01S0025 01736000
*     RPLPUTIX PTR(8) CONSTANT(12); /* PUTIX REQUEST@X04SVHS         */ 01737000
*   DCL                                                         01S0026 01738000
*     RPLSRCHB PTR(8) CONSTANT(13); /* SRCHBFR REQUEST       @X04SVHS*/ 01739000
*   DCL                                                         01S0027 01740000
*     RPLMRKB PTR(8) CONSTANT(14);  /* MRKBFR REQUEST        @X04SVHS*/ 01741000
*   DCL                                                         01S0028 01742000
*     RPLWRTB PTR(8) CONSTANT(15);  /* WRTBFR REQUEST        @X04SVHS*/ 01743000
*   DCL                                                         01S0029 01744000
*     RPLTERM PTR(8) CONSTANT(19);  /* TERMRPL REQUEST       @ZA32757*/ 01745000
         EJECT                                                          01746000
*                                                               01S0030 01747000
*/* ATBUILD  DEFER(ALL)                                              */ 01748000
*/* END OF ATBUILD                                                   */ 01749000
*/* ATBUILD (ISTOCW,ISTPOPWA)                                        */ 01750000
*                                                               01S0030 01751000
*   GEN(PRINT OFF);                                             01S0030 01752000
         PRINT OFF                                                      01753000
*/********************************************************************/ 01754000
*/*                                                                  */ 01755000
*/*  MACRO-NAME: ISTPROCD                                            */ 01756000
*/*                                                                  */ 01757000
*/*  MACRO-DESCRIPTIVE-NAME: VTAM PROCESS OPTIONS DEFINITION         */ 01758000
*/*                          BLOCK MAPPING MACRO                     */ 01759000
*/*                                                                  */ 01760000
*/*  MACRO-COPYRIGHT: NONE                                           */ 01761000
*/*                                                                  */ 01762000
*/*  MACRO-STATUS: VTAM RELEASE 4.0                                  */ 01763000
*/*                                                                  */ 01764000
*/*  MACRO-FUNCTION: TO PROVIDE A VTAM PL/S MAPPING FOR THE          */ 01765000
*/*                  VTAM PROCESS OPTIONS DEFINITION BLOCK           */ 01766000
*/*                                                                  */ 01767000
*/*  MACRO-NOTES: NONE                                               */ 01768000
*/*                                                                  */ 01769000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 01770000
*/*                                                                  */ 01771000
*/*    REQUIRED-INNER-MAPS: NONE                                     */ 01772000
*/*                                                                  */ 01773000
*/*    REQUIRED-BY: NONE                                             */ 01774000
*/*                                                                  */ 01775000
*/*  MACRO-DATE-CREATED: NOTKNOWN                                    */ 01776000
*/*                                                                  */ 01777000
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */ 01778000
*/*        01 - 01/15/78 - SNA4 FOR D4491.01                 @D14AKMC*/ 01779000
*/*                                                                  */ 01780000
*/********************************************************************/ 01781000
*DCL                                                            01S0031 01782000
*  1 ISTPROCD BDY(WORD) BASED,                                  01S0031 01783000
*    2 PROPROC BIT(32),         /* PROCESSING OPTIONS                */ 01784000
*      3 PROPROC1 BIT(8),       /* PROCESSING OPTIONS - 1            */ 01785000
*        4 PROASYIP BIT(1),     /* 1=ASYIPX 0=NASYIPX                */ 01786000
*        4 PROTRUNC BIT(1),     /* 1=TRUNC 0=KEEP                    */ 01787000
*        4 PROXPOPT BIT(1),     /* 1=BINARY 0=NBINARY                */ 01788000
*        4 PRODFASY BIT(1),     /* PROC-0=NDFASYX/1=DFASYX           */ 01789000
*        4 PRORESPX BIT(1),     /* PROC-0=NRESPX/1=RESPX             */ 01790000
*        4 PROCA BIT(1),        /* 1=RECEIVE ANY CA/0=NO CA          */ 01791000
*        4 PROCS BIT(1),        /* 1=RECEIVE ANY CS/0=NO CS          */ 01792000
*        4 PRORPLC BIT(1),      /* 1=OPTION IN RPL/0=NO RPL          */ 01793000
*      3 PROPROC2 BIT(8),       /* PROCESSING OPTIONS - 2            */ 01794000
*        4 PRONEGBD BIT(1),     /* 1=NEGOTIABLE BIND         @D14AKMC*/ 01795000
*        4 PROERPO BIT(1),      /* 1=NERPOUT 0=ERPOUT                */ 01796000
*        4 PROLGOT BIT(1),      /* 1=NLGOUT 0=LGOUT                  */ 01797000
*        4 PROSYSR BIT(1),      /* 0=VTAM RESPONDS TO           01S0031 01798000
*                                    EXPEDITED DFC              01S0031 01799000
*                                  1=APPLICATION RESPONDS    @D34CKMC*/ 01800000
*        4 PROFIFOR BIT(1),     /* 0=NO ORDERING OF RESPONSE    01S0031 01801000
*                                    WIRH REQUEST               01S0031 01802000
*                                  1=RESPONSE KEPT IN ORDER     01S0031 01803000
*                                    WITH REQUEST            @D434401*/ 01804000
*        4 PRONTFL BIT(1),      /* 1=NTMFLL 0=TMFLL                  */ 01805000
*        4 PROEMLC BIT(1),      /* 1=ELC 0=NELC                      */ 01806000
*        4 PROCFTX BIT(1),      /* 1=CONFTXT 0=NCONFTXT              */ 01807000
*      3 PROPROC3 BIT(8),       /* PROCESSING OPTIONS - 3            */ 01808000
*        4 PRORSV07 BIT(1),     /* RESERVED                          */ 01809000
*        4 PROERPI BIT(1),      /* 1=NERPIN 0=ERPIN                  */ 01810000
*        4 PROLGIN BIT(1),      /* 1=NLGIN 0=LGIN                    */ 01811000
*        4 PRONTO BIT(1),       /* 1=NTIMEOUT 0=TIMEOUT              */ 01812000
*        4 PROSUBLK BIT(1),     /* 0=INHIBIT SUBBLOCKING        01S0031 01813000
*                                  1=ALLOW SUBBLOCKING               */ 01814000
*        4 PROMONIT BIT(1),     /* 1=MONITOR 0=NMONITOR              */ 01815000
*        4 PROMONT2 BIT(1),     /* FIRST TIME MONITOR                */ 01816000
*        4 PROMONT3 BIT(1),     /* CONTINUE MONITOR          @0Z19910*/ 01817000
*      3 PROPROC4 BIT(8),       /* PROCESSING OPTION  - 4            */ 01818000
*        4 PROEIB BIT(1),       /* 1=EIB 0=NEIB                      */ 01819000
*        4 PRORSV12 BIT(1),     /* RESERVED                          */ 01820000
*        4 PRORSV13 BIT(1),     /* RESERVED                          */ 01821000
*        4 PRORSV14 BIT(1),     /* RESERVED                          */ 01822000
*        4 PROMODB BIT(1),      /* BLOCK                             */ 01823000
*        4 PROMODM BIT(1),      /* MSG                               */ 01824000
*        4 PROMODT BIT(1),      /* TRANS (DEFAULT)                   */ 01825000
*        4 PROMODC BIT(1);      /* CONT                              */ 01826000
*/*                                                                  */ 01827000
*/*                                                                  */ 01828000
*DCL                                                            01S0032 01829000
*  1 PROPROCS                                                   01S0032 01830000
*     BASED(ADDR(ISTPROCD)),    /* REDEFINITION OF OPTIONS      01S0032 01831000
*                                  FOR SETMODE MASK                  */ 01832000
*    2 PRORSV41 BIT(8),         /* PROCESSING OPTIONS - 1            */ 01833000
*    2 PROSETMS CHAR(3),        /* SETMODE OPTION BYTES              */ 01834000
*      3 PROSETM2 BIT(8),       /* PROCESSING OPTIONS - 2            */ 01835000
*        4 PRORSV42 BIT(5),     /* RESERVED                          */ 01836000
*        4 PROSNTFL BIT(1),     /* INHIBIT TIME FILL            01S0032 01837000
*                                  SS - ONLY                         */ 01838000
*        4 PRORSV43 BIT(2),     /* RESERVED                          */ 01839000
*      3 PROSETM3 BIT(8),       /* PROCESSING OPTIONS - 3            */ 01840000
*        4 PRORSV44 BIT(3),     /* RESERVED                          */ 01841000
*        4 PROSNTO BIT(1),      /* 1=BSC - EIB INSERTION        01S0032 01842000
*                                    SS - INHIBIT TIMEOUT            */ 01843000
*        4 PRORSV45 BIT(1),     /* RESERVED                          */ 01844000
*        4 PROSMONT BIT(1),     /* 1=MONITOR FOR ATTN           01S0032 01845000
*                                    INTS - SS ONLY                  */ 01846000
*        4 PRORSV46 BIT(2),     /* RESERVED                          */ 01847000
*      3 PROSETM4 BIT(8),       /* PROCESSING OPTIONS - 4            */ 01848000
*        4 PROSCON BIT(1),      /* 1=CONTINUOUS MODE            01S0032 01849000
*                                    (TPIOS ONLY)                    */ 01850000
*        4 PRORSV47 BIT(5),     /* RESERVED                          */ 01851000
*        4 PROSRDEF BIT(2);     /* RECORD DEFINITION            01S0032 01852000
*                                  01=BLOCK                     01S0032 01853000
*                                  10=MESSAGE                   01S0032 01854000
*                                  11=TRANSMISSION                   */ 01855000
*                                                               01S0032 01856000
*DCL                                                            01S0033 01857000
*  PROSBLCK                                                     01S0033 01858000
*    BIT(8) CONSTANT('01'X);    /* TO INDICATE BLOCK MODE            */ 01859000
*DCL                                                            01S0034 01860000
*  PROSMSG                                                      01S0034 01861000
*    BIT(8) CONSTANT('02'X);    /* TO INDICATE MSG MODE              */ 01862000
*DCL                                                            01S0035 01863000
*  PROSTRNS                                                     01S0035 01864000
*    BIT(8) CONSTANT('03'X);    /* TO INDICATE TRANSMISSION     01S0035 01865000
*                                  MODE                              */ 01866000
*DCL                                                            01S0036 01867000
*  PROSCONT                                                     01S0036 01868000
*    BIT(8) CONSTANT('83'X);    /* TO INDICATE CONTINUOUS MODE       */ 01869000
*DCL                                                            01S0037 01870000
*  PROSANDC                                                     01S0037 01871000
*    BIT(8) CONSTANT('7F'X);    /* TO EQUATE CONT TO TRANS      01S0037 01872000
*                                  FOR 3704/3705                     */ 01873000
*DCL                                                            01S0038 01874000
*  PROSORC                                                      01S0038 01875000
*    BIT(8) CONSTANT('80'X);    /* TO RESTORE CONT INDICATOR         */ 01876000
*/********************************************************************/ 01877000
*/*                                                                  */ 01878000
*/*  MACRO-NAME: ISTDEVCH                                            */ 01879000
*/*                                                                  */ 01880000
*/*  MACRO-DESCRIPTIVE-NAME: DEVICE CHARACTERISTICS CONTROL BLOCK    */ 01881000
*/*                          MAPPING MACRO                           */ 01882000
*/*                                                                  */ 01883000
*/*  MACRO-COPYRIGHT: NONE                                           */ 01884000
*/*                                                                  */ 01885000
*/*  MACRO-STATUS: VTAM RELEASE 4.0                                  */ 01886000
*/*                                                                  */ 01887000
*/*  MACRO-FUNCTION: TO PROVIDE A VTAM PL/S MAPPING FOR THE          */ 01888000
*/*                  DEVICE CHARACTERISTICS CONTROL BLOCK            */ 01889000
*/*                                                                  */ 01890000
*/*  MACRO-NOTES:                                                    */ 01891000
*/*        1. THIS FIXED-LENGTH DEVICE CHARACTERISTICS FIELD IS      */ 01892000
*/*           DEFINED IN THE SYSTEMS NETWORK ARCHITECTURE (SNA),     */ 01893000
*/*           AND IS PART OF THE INFORMATION EXCHANGED WITH OTHER    */ 01894000
*/*           DOMAINS WHEN CROSS-DOMAIN SESSIONS ARE ESTABLISHED.    */ 01895000
*/*           THUS, NO CHANGES CAN BE MADE TO THE FORMAT OR CONTENTS */ 01896000
*/*           OF THESE DEVICE CHARACTERISTICS WITHOUT AN AGREEMENT   */ 01897000
*/*           FOR A CORRESPONDING SNA CHANGE (CDINIT AND CINIT RUS). */ 01898000
*/*        2. ANY CHANGE TO ISTDEVCH MUST BE MADE TO ISTDVCHR.       */ 01899000
*/*                                                                  */ 01900000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 01901000
*/*                                                                  */ 01902000
*/*    REQUIRED-INNER-MAPS: NONE                                     */ 01903000
*/*                                                                  */ 01904000
*/*    REQUIRED-BY: NONE                                             */ 01905000
*/*                                                                  */ 01906000
*/*  MACRO-DATE-CREATED: NOTKNOWN                                    */ 01907000
*/*                                                                  */ 01908000
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */ 01909000
*/*        01 - 08/07/74 -      FOR PTM 1569                         */ 01910000
*/*        02 - 07/27/78 - SNA4 FOR D4579.00                 @D14AKMC*/ 01911000
*/*        03 - 08/02/78 - SNA4 FOR D4549.04                 @D14AKMC*/ 01912000
*/*        04 - 08/28/78 - SNA4 FOR D4579.01                 @D14AKMC*/ 01913000
*/*        05 - 09/15/78 - SNA4 FOR D4579.02                 @D14AKMC*/ 01914000
*/*                                                                  */ 01915000
*/********************************************************************/ 01916000
*DCL                                                            01S0039 01917000
*  1 ISTDEVCH  BDY(WORD)BASED,                                  01S0039 01918000
*    2  DEVSHCH BIT(8),         /* DEV SCHED CHARACTERISTICS         */ 01919000
*      3 DEVCHAR  BIT(8),       /* COMPATIBILITY EXISTING CODE       */ 01920000
*        4 DEVINPUT  BIT(1),    /* DEVICE IS FOR INPUT               */ 01921000
*        4 DEVOTPUT  BIT(1),    /* DEVICE IS FOR OUTPUT              */ 01922000
*        4 DEVCONVR  BIT(1),    /* DEVICE IS CONVERSATION       01S0039 01923000
*                                  RN DEFINITION                     */ 01924000
*        4 DEVSUBND  BIT(1),    /* DEVICE HAS SCHEDULABLE SUB-NODES  */ 01925000
*        4 DEVSPS BIT(1),       /* DEV IS START PRINT SENSITIVE      */ 01926000
*        4 DEVNNSPT BIT(1),     /* NODE HAS NETWORK MANAGEMENT  01S0039 01927000
*                                  SUPPORT                      01S0039 01928000
*                                  DO NOT REMOVE FOR D434305         */ 01929000
*        4 DEVCCTL BIT(1),      /* NODE HAS CONN CNTRL DEPENDCS      */ 01930000
*        4  DEVSPOLL  BIT(1),   /* 1 = SPECIFIC POLLED          01S0039 01931000
*                                  BSC 3270                  @D434300*/ 01932000
*    2 DEVTCODE BIT(8),         /* DEVICE TYPE CODES                 */ 01933000
*      3 DEVCHAR2  BIT(8),      /* COMPATIBILITY EXISTING CODE       */ 01934000
*    2 DEVMCODE BIT(8),         /* DEVICE MODEL CODE                 */ 01935000
*    2 DEVFLAGS BIT(8),         /*USE DEPENDS ON DEVSHCH VALUES      */ 01936000
*      3 DEVFCCTL BIT(4),       /* USED IF DEVICE REQ CONN CTRL      */ 01937000
*        4 DEVCBSC BIT(1),      /* RESET ORDERLY, BI-SYNCH      01S0039 01938000
*                                  TERMINALS EXCEPT 3270'S           */ 01939000
*        4 DEVCSSL BIT(1),      /* RESET AT END OF COMMAND. 3270'S      01940000
*                                  AND START/STOP EXCEPT TERMS  01S0039 01941000
*                                  WITH REVERSE BREAK FEATURE        */ 01942000
*        4 DEVCRVB BIT(1),      /* RESET IMMEDIATE. START/STOP  01S0039 01943000
*                                  TERMS WITH REVERSE BREAK FEATURE  */ 01944000
*        4 DEVCSWL BIT(1),      /* 1=HIGHER NODE IS SWITCH CON- 01S0039 01945000
*                                  NECTION, 0=LEASED CONNECTION      */ 01946000
*      3 DEVCHAR3 BIT(4),       /* COMPATIBILITY EXISTING CODE       */ 01947000
*        4 DEVCATTN BIT(1),     /* TERMINAL CAN INTERRUPT WITH  01S0039 01948000
*                                  ATTENTION                         */ 01949000
*        4 DEVCCHEK BIT(1),     /* TERMINAL HAS CHECKING             */ 01950000
*        4 DEVCSTCL BIT(1),     /* TERMINAL HAS STATION CONTROL      */ 01951000
*        4 DEVCSLPN BIT(1),     /* TERMINAL HAS SELECTOR PEN         */ 01952000
*    2 DEVPHYSA CHAR(1),        /* PHYSICAL DEVICE ADDRESS           */ 01953000
*    2 DEVMODE  BIT(8),         /* MISC FLAG FIELD           @D434300*/ 01954000
*      3 DEVREC   BIT(1),       /* 1 = RECORD MODE CAN          01S0039 01955000
*                                  BE USED                   @D434300*/ 01956000
*      3 DEVBASIC BIT(1),       /* 1 = BASIC MODE CAN           01S0039 01957000
*                                  BE USED                   @D434300*/ 01958000
*      3 *        BIT(5),       /* RESTRICTED FOR NON-SNA       01S0039 01959000
*                                  CROSS-DOMAIN SESSION SETUP - 01S0039 01960000
*                                  NOT - AVAILABLE           @D14AKMC*/ 01961000
*      3 DEVADVFE BIT(1),       /* ADVANCED FEATURES CAN BE USED -      01962000
*                                  FOR 3270 DEVICE TYPES,       01S0039 01963000
*                                  3270 EXTENDED DATA STREAM USED       01964000
*                                  ( REQUIRING BSC TRANSPARENT DLC )    01965000
*                                                            @D14AKMC*/ 01966000
*    2 DEVAUXTP BIT(8),         /* AUXILIARY DEVICE TYPE. VALID ONLY    01967000
*                                  WHEN DEVICE TYPE (DEVTCODE) IS AN    01968000
*                                  LU (DEVLU).               @D14AKMC*/ 01969000
*    2 DEVRSV01 CHAR(1);        /* NOT USED - AVAILABLE      @D14AKMC*/ 01970000
*/* DEVICE TYPE CODES */                                        01S0040 01971000
*DCL DEV2740 BIT(8) CONSTANT ('01'X);  /* DEVICE IS A 2740           */ 01972000
*DCL DEV2741 BIT(8) CONSTANT ('02'X);  /* DEVICE IS A 2741           */ 01973000
*DCL DEV1050 BIT(8) CONSTANT ('03'X);  /* DEVICE IS A 1050           */ 01974000
*DCL DEVTWX  BIT(8) CONSTANT ('04'X);  /* DEVICE IS A TWX            */ 01975000
*DCL DEVWTTY BIT(8) CONSTANT ('05'X);  /* DEVICE IS A WTTY           */ 01976000
*DCL DEV115A BIT(8) CONSTANT ('06'X);  /* DEVICE IS A 115A           */ 01977000
*DCL DEV83B3 BIT(8) CONSTANT ('07'X);  /* DEVICE IS AN 83B3          */ 01978000
*DCL DEV2715 BIT(8) CONSTANT ('08'X);  /* DEVICE IS A 2715           */ 01979000
*DCL DEV2770 BIT(8) CONSTANT ('09'X);  /* DEVICE IS A 2770           */ 01980000
*DCL DEV2780 BIT(8) CONSTANT ('0A'X);  /* DEVICE IS A 2780           */ 01981000
*DCL DEV3735 BIT(8) CONSTANT ('0B'X);  /* DEVICE IS A 3735           */ 01982000
*DCL DEV3780 BIT(8) CONSTANT ('0C'X);  /* DEVICE IS A 3780           */ 01983000
*DCL DEV1130 BIT(8) CONSTANT ('0D'X);  /* DEVICE IS AN 1130          */ 01984000
*DCL DEV1800 BIT(8) CONSTANT ('0E'X);  /* DEVICE IS AN 1800          */ 01985000
*DCL DEVDAN  BIT(8) CONSTANT ('0F'X);  /* DEVICE IS A DAN    @DM41569*/ 01986000
*DCL DEV3125 BIT(8) CONSTANT ('11'X);  /* DEVICE IS A 3125           */ 01987000
*DCL DEV3135 BIT(8) CONSTANT ('12'X);  /* DEVICE IS A 3135           */ 01988000
*DCL DEVSYS3 BIT(8) CONSTANT ('13'X);  /* DEVICE IS SYS 3            */ 01989000
*DCL DEV2701 BIT(8) CONSTANT ('14'X);  /* DEVICE IS A 2701 OZ05270   */ 01990000
*DCL DEV2703 BIT(8) CONSTANT ('15'X);  /* DEVICE IS A 2703 OZ05270   */ 01991000
*DCL DEV3704 BIT(8) CONSTANT ('16'X);  /* DEVICE IS A 3704           */ 01992000
*DCL DEV3705 BIT(8) CONSTANT ('17'X);  /* DEVICE IS A 3705           */ 01993000
*DCL DEV2980 BIT(8) CONSTANT ('18'X);  /* DEVICE IS A 2980           */ 01994000
*DCL DEV3277 BIT(8) CONSTANT ('19'X);  /* DEVICE IS A 3277           */ 01995000
*DCL DEV3284 BIT(8) CONSTANT ('1A'X);  /* DEVICE IS A 3284           */ 01996000
*DCL DEV3286 BIT(8) CONSTANT ('1B'X);  /* DEVICE IS A 3286           */ 01997000
*DCL DEV3275 BIT(8) CONSTANT ('1C'X);  /* DEVICE IS A 3275           */ 01998000
*DCL DEV3741 BIT(8) CONSTANT ('1D'X);  /* DEVICE IS A 3741           */ 01999000
*DCL DEV3747 BIT(8) CONSTANT ('1E'X);  /* DEVICE IS A 3747           */ 02000000
*DCL DEVMTA  BIT(8) CONSTANT ('28'X);  /* DEVICE IS AN MTA           */ 02001000
*DCL DEV2972 BIT(8) CONSTANT ('33'X);  /* DEVICE IS A 2972           */ 02002000
*DCL DEV3271 BIT(8) CONSTANT ('34'X);  /* DEVICE IS A 3271           */ 02003000
*DCL DEV3272 BIT(8) CONSTANT ('36'X);  /* DEVICE IS A 3272           */ 02004000
*DCL DEVCC   BIT(8) CONSTANT ('35'X);  /* DEVICE IS A PHYSICAL UNIT  */ 02005000
*DCL DEV1052 BIT(8) CONSTANT ('64'X);  /* DEVICE IS A 1052           */ 02006000
*DCL DEV1053 BIT(8) CONSTANT ('65'X);  /* DEVICE IS A 1053           */ 02007000
*DCL DEV1054 BIT(8) CONSTANT ('66'X);  /* DEVICE IS A 1054           */ 02008000
*DCL DEV1055 BIT(8) CONSTANT ('67'X);  /* DEVICE IS A 1055           */ 02009000
*DCL DEV1056 BIT(8) CONSTANT ('68'X);  /* DEVICE IS A 1056           */ 02010000
*DCL DEV1057 BIT(8) CONSTANT ('69'X);  /* DEVICE IS A 1057           */ 02011000
*DCL DEV1058 BIT(8) CONSTANT ('6A'X);  /* DEVICE IS A 1058           */ 02012000
*DCL DEV1092 BIT(8) CONSTANT ('6B'X);  /* DEVICE IS A 1092           */ 02013000
*DCL DEV1093 BIT(8) CONSTANT ('6C'X);  /* DEVICE IS A 1093           */ 02014000
*DCL DEVLU   BIT(8) CONSTANT ('6D'X);  /* DEVICE IS A LOGICAL UNIT   */ 02015000
*DCL DEV545  BIT(8) CONSTANT ('78'X);  /* DEVICE IS A 545            */ 02016000
*DCL DEV1017 BIT(8) CONSTANT ('79'X);  /* DEVICE IS A 1017           */ 02017000
*DCL DEV1018 BIT(8) CONSTANT ('7A'X);  /* DEVICE IS A 1018           */ 02018000
*DCL DEV2203 BIT(8) CONSTANT ('7B'X);  /* DEVICE IS A 2203           */ 02019000
*DCL DEV2213 BIT(8) CONSTANT ('7C'X);  /* DEVICE IS A 2213           */ 02020000
*DCL DEV2265 BIT(8) CONSTANT ('7D'X);  /* DEVICE IS A 2265           */ 02021000
*DCL DEV2502 BIT(8) CONSTANT ('7E'X);  /* DEVICE IS A 2502           */ 02022000
*DCL DEV50   BIT(8) CONSTANT ('7F'X);  /* DEVICE IS A 50             */ 02023000
*DCL DEV1255 BIT(8) CONSTANT ('80'X);  /* DEVICE IS A 1255           */ 02024000
*DCL DEV5496 BIT(8) CONSTANT ('81'X);  /* DEVICE IS A 5496           */ 02025000
*/* MODEL CODES */                                              01S0094 02026000
*DCL DEVMOD1 BIT(8) CONSTANT ('00'X);  /* MODEL 1                    */ 02027000
*DCL DEVMOD2 BIT(8) CONSTANT ('01'X);  /* MODEL 2                    */ 02028000
*/* AUXILIARY DEVICE TYPES                                   @D14AKMC*/ 02029000
*DCL DEVAUND  BIT(8) CONSTANT('00'X); /* AUX DEVICE IS UNDEFINED        02030000
*                                        ACTUAL DEVICE IS AN LU      */ 02031000
*DCL DEVA2741 BIT(8) CONSTANT('04'X); /* AUX DEVICE IS AN LU 2741    */ 02032000
*DCL DEVAWTTY BIT(8) CONSTANT('08'X); /* AUX DEVICE IS AN LU WTTY    */ 02033000
*DCL DEVATWX  BIT(8) CONSTANT('20'X); /* AUX DEVICE IS AN LU TWX     */ 02034000
*DCL DEVA2740 BIT(8) CONSTANT('40'X); /* AUX DEVICE IS AN LU 2740    */ 02035000
*DCL DEVA115A BIT(8) CONSTANT('10'X); /* AUX DEVICE IS AN LU 115A    */ 02036000
*DCL DEVA83B3 BIT(8) CONSTANT('30'X); /* AUX DEVICE IS AN LU 83B3    */ 02037000
*DCL DEVA1050 BIT(8) CONSTANT('80'X); /* AUX DEVICE IS AN LU 1050    */ 02038000
*DCL DEVA2780 BIT(8) CONSTANT('90'X); /* AUX DEVICE IS AN LU 2780    */ 02039000
*/********************************************************************/ 02040000
*/*                                                                  */ 02041000
*/*  MACRO-NAME: ISTBIND                                             */ 02042000
*/*                                                                  */ 02043000
*/*  MACRO-DESCRIPTIVE-NAME: VTAM BIND RU SESSION PARAMETERS         */ 02044000
*/*                          AND/OR DATA AREA MAPPING MACRO          */ 02045000
*/*                                                                  */ 02046000
*/*  MACRO-COPYRIGHT: NONE                                           */ 02047000
*/*                                                                  */ 02048000
*/*  MACRO-STATUS: VTAM RELEASE 4.0                                  */ 02049000
*/*                                                                  */ 02050000
*/*  MACRO-FUNCTION: TO PROVIDE A VTAM PL/S MAPPING FOR THE          */ 02051000
*/*                  VTAM BIND RU SESSION PARAMETERS AND/OR          */ 02052000
*/*                  DATA AREA.                                      */ 02053000
*/*                                                                  */ 02054000
*/*  MACRO-NOTES: TO MAP THE SESSION PARAMETERS AREA IN A            */ 02055000
*/*               LOGON MODE TABLE, LOGON PARAMETERS AREA,           */ 02056000
*/*               OR BNDAREA, SPECIFY -                              */ 02057000
*/*                  RFY ISTBIND BASED(AREAPTR)                      */ 02058000
*/*                  WHERE 'AREAPTR' IS A POINTER TO THE             */ 02059000
*/*                  SESSION PARAMETERS AREA OR THE ADDR             */ 02060000
*/*                  OF THE AREA.                                    */ 02061000
*/*               TO MAP THE DATA PORTION OF THE BIND RU,            */ 02062000
*/*               SPECIFY -                                          */ 02063000
*/*                  RFY ISTBIND BASED(ADDR(SRUDATA))                */ 02064000
*/*                  AND INCLUDE THE ISTRU MAPPING MACRO             */ 02065000
*/*                                                                  */ 02066000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 02067000
*/*                                                                  */ 02068000
*/*    REQUIRED-INNER-MAPS: NONE                                     */ 02069000
*/*                                                                  */ 02070000
*/*  MACRO-DATE-CREATED: NOTKNOWN                                    */ 02071000
*/*                                                                  */ 02072000
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */ 02073000
*/*        01 - 10/20/77 - SNA4 FOR D4405.15 AND D4490.02    @D14AKMP*/ 02074000
*/*        02 - 10/21/77 - ADDED SUPPORT FOR BINFMS2C        @DM30817*/ 02075000
*/*        03 - 11/04/77 - ADDED LU.T4 SUPPORT FOR D4495.00  @G35AKMP*/ 02076000
*/*        04 - 01/15/78 - ADDED NEGOTIABLE BIND SUPPORT             */ 02077000
*/*                              FOR D4491.00                @D14AKMP*/ 02078000
*/*        05 - 03/07/78 - ADDED 2-STAGE PACING SUPPORT              */ 02079000
*/*                              FOR D4502.05                @D14AKMC*/ 02080000
*/*        06 - 07/27/78 - D4574.00                          @D14AKMC*/ 02081000
*/*                                                                  */ 02082000
*/********************************************************************/ 02083000
*DCL                                                            01S0105 02084000
*  1 ISTBIND BASED,             /* SESSION PARAMETERS AREA           */ 02085000
*    2 BINFMTY,                 /* BIND FORMAT AND TYPE              */ 02086000
*      3 BINFMT   BIT(4),       /* BIND FORMAT                       */ 02087000
*      3 BINTYPE  BIT(4),       /* BIND TYPE                         */ 02088000
*    2 BINFM    FIXED(8),       /* FUNCTION MANAGEMENT          01S0105 02089000
*                                  PROFILE                           */ 02090000
*    2 BINTS    FIXED(8),       /* TRANSMISSION SERVICES        01S0105 02091000
*                                  PROFILE                           */ 02092000
*    2 BINPRIP,                 /* PRIMARY NAU PROTOCOLS             */ 02093000
*      3 BINPCHN  BIT(1),       /* 1=MULTIPLE RU CHAINS         01S0105 02094000
*                                  0=SINGLE RU CHAINS                */ 02095000
*      3 BINPMCH  BIT(1),       /* 1=MULTIPLE OUTSTANDING       01S0105 02096000
*                                    CHAINS                     01S0105 02097000
*                                    (DELAYED REQUEST MODE)     01S0105 02098000
*                                  0=SINGLE OUTSTANDING CHAIN   01S0105 02099000
*                                    (IMMEDIATE REQUEST MODE)        */ 02100000
*      3 BINPCHNR BIT(2),       /* CHAIN RESPONSE PROTOCOL           */ 02101000
*      3 *        BIT(2),       /*  NOT USED                         */ 02102000
*      3 BINPCMP  BIT(1),       /* 1=COMPRESSION MAY BE USED    01S0105 02103000
*                                  0=COMPRESSION MUST NOT BE    01S0105 02104000
*                                    USED                            */ 02105000
*      3 BINPSEB  BIT(1),       /* 1=PRIMARY MAY SEND EB        01S0105 02106000
*                                  0=PRIMARY WILL NOT SEND EB        */ 02107000
*    2 BINSECP,                 /* SECONDARY NAU PROTOCOLS           */ 02108000
*      3 BINSCHN  BIT(1),       /* 1=MULTIPLE RU CHAINS         01S0105 02109000
*                                  0=SINGLE RU CHAIN                 */ 02110000
*      3 BINSMCH  BIT(1),       /* 1=MULTIPLE OUTSTANDING       01S0105 02111000
*                                    CHAINS DELAYED REQUEST     01S0105 02112000
*                                    MODE                       01S0105 02113000
*                                  0=SINGLE OUTSTANDING CHAIN   01S0105 02114000
*                                    IMMEDIATE REQUEST MODE          */ 02115000
*      3 BINSCHNR BIT(2),       /* CHAIN RESPONSE PROTOCOLS          */ 02116000
*      3 *        BIT(2),       /*   NOT USED                        */ 02117000
*      3 BINSCMP  BIT(1),       /* 1=COMPRESSION MAY BE USED    01S0105 02118000
*                                  0=COMPRESSION MUST NOT BE    01S0105 02119000
*                                    USED                            */ 02120000
*      3 BINSSEB  BIT(1),       /* 1=SECONDARY MAY SEND EB      01S0105 02121000
*                                  0=SECONDARY WILL NOT SEND    01S0105 02122000
*                                    EB                              */ 02123000
*     2 BINCMNP,                /* COMMON NAU PROTOCOLS              */ 02124000
*       3 *        BIT(1),      /*   NOT USED                        */ 02125000
*       3 BINFMHD  BIT(1),      /* 1=FM HEADERS MAY BE USED     01S0105 02126000
*                                  0=FM HEADERS MUST NOT BE     01S0105 02127000
*                                    USED                            */ 02128000
*       3 BINBRAK  BIT(1),      /* 1=BRACKETS WILL BE USED      01S0105 02129000
*                                  0=BRACKETS WILL NOT BE       01S0105 02130000
*                                    USED                            */ 02131000
*       3 BINBKTR  BIT(1),      /* 1=CONDITIONAL TERMINATION    01S0105 02132000
*                                  0=UNCONDITIONAL TERMINATION       */ 02133000
*       3 BINALT   BIT(1),      /* 1=ALTERNATE CODE MAY BE USED 01S0105 02134000
*                                  0=ALT. CODE MUST NOT BE USED      */ 02135000
*       3 *        BIT(3),      /*   NOT USED                        */ 02136000
*     2 BINCMNP2,               /* COMMON NAU PROTOCOLS              */ 02137000
*       3 BINFMTRM BIT(2),      /* SEND/RECEIVE MODE         @D34EKMP*/ 02138000
*       3 BINRCVR  BIT(1),      /* 1=SENDER OF RU RESPONSIBLE   01S0105 02139000
*                                    FOR RECOVERY               01S0105 02140000
*                                  0=PRIMARY RESPONSIBLE FOR    01S0105 02141000
*                                    RECOVERY                        */ 02142000
*       3 BINBKFS  BIT(1),      /* 1=PRIMARY IS BRACKETS        01S0105 02143000
*                                    FIRST SPEAKER              01S0105 02144000
*                                  0=SECONDARY IS BRACKETS      01S0105 02145000
*                                    FIRST SPEAKER                   */ 02146000
*       3 BINMDIBK BIT(2),      /*   NOT USED                        */ 02147000
*       3 BINRCHN  BIT(1),      /*   NOT USED                        */ 02148000
*       3 BINCONR  BIT(1),      /* CONTENTION RESOLUTION-       01S0105 02149000
*                                  FOR HDX FLIP-FLOP:           01S0105 02150000
*                                  1=PRIMARY SPEAKS FIRST       01S0105 02151000
*                                    WHEN DATA TRAFFIC RESET    01S0105 02152000
*                                    IS LEFT                    01S0105 02153000
*                                  0=SECONDARY SPEAKS FIRST     01S0105 02154000
*                                    WHEN DATA TRAFFIC RESET    01S0105 02155000
*                                    IS LEFT                    01S0105 02156000
*                                  FOR HDX CONTENTION:          01S0105 02157000
*                                  1=PRIMARY WINS CONTENTION    01S0105 02158000
*                                  0=SECONDARY WINS             01S0105 02159000
*                                    CONTENTION                      */ 02160000
*     2 BINTSU,                 /* TS USAGE                          */ 02161000
*       3 BINAPACE CHAR(1),     /* SLU SEND PACING COUNT             */ 02162000
*         4 BINSP2ST BIT(1),    /* 0 = 1-STAGE PACING IS BEING USED     02163000
*                                      BETWEEN THE SLU AND THE PLU      02164000
*                                  1 = 2-STAGE PACING IS BEING USED     02165000
*                                      BETWEEN THE SLU AND THE PLU      02166000
*                                                            @D14AKMC*/ 02167000
*         4 *        BIT(1),    /* NOT USED - RESERVED       @D14AKMC*/ 02168000
*         4 BINAPACM BIT(6),    /* SLU SEND PACING COUNT             */ 02169000
*       3 BINRPACE FIXED(8),    /* SLU RECEIVE PACING COUNT          */ 02170000
*         4 *        BIT(2),    /* NOT USED                          */ 02171000
*         4 BINRPACM BIT(6),    /* SLU RECEIVE PACING COUNT          */ 02172000
*       3 BINRUSZ,              /* RU SIZES                          */ 02173000
*         4 BINSRUSZ FIXED(8),  /* SLU MAXIMUM SEND                  */ 02174000
*           5 BINSRUSM BIT(4),  /* MANTISSA                          */ 02175000
*           5 BINSRUSE BIT(4),  /* EXPONENT                          */ 02176000
*         4 BINPRUSZ FIXED(8),  /* PLU MAXIMUM SEND RU SIZE          */ 02177000
*           5 BINPRUSM BIT(4),  /* MANTISSA                          */ 02178000
*           5 BINPRUSE BIT(4),  /* EXPONENT                          */ 02179000
*       3 BINSPACE CHAR(1),     /* PLU SEND PACING COUNT             */ 02180000
*         4 BINPS1ST BIT(1),    /* 0 = 2-STAGE PACING IS BEING USED     02181000
*                                      BETWEEN THE PLU AND THE SLU      02182000
*                                  1 = 1-STAGE PACING IS BEING USED     02183000
*                                      BETWEEN THE PLU AND THE SLU      02184000
*                                                            @D14AKMC*/ 02185000
*         4 *        BIT(1),    /* NOT USED - RESERVED       @D14AKMC*/ 02186000
*         4 BINSPACM BIT(6),    /* PLU SEND PACING COUNT             */ 02187000
*       3 BINBPACE CHAR(1),     /* PLU RECV PACING COUNT     @D34EKMP*/ 02188000
*         4 *        BIT(2),    /* NOT USED                  @D34EKMP*/ 02189000
*         4 BINBPACM BIT(6),    /* PLU RECV PACING COUNT     @D34EKMP*/ 02190000
*     2 BINPRSVC,               /* PRESENTATION SERVICES             */ 02191000
*       3 BINLUP,               /* LU PROFILE                        */ 02192000
*         4 *        BIT(1),    /* NOT USED                          */ 02193000
*         4 BINLUTYP BIT(7),    /* LU TYPE                           */ 02194000
*       3 BINPSCHR CHAR(11),    /* LU PROFILE DEPENDENT         01S0105 02195000
*                                  PRESENTATION SERVICES        01S0105 02196000
*                                  CHARACTERISTICS                   */ 02197000
*     2 BINCRYPT CHAR(1),       /* ****** FIELD              @G54AKMP*/ 02198000
*     2 BINPRIML FIXED(8),      /* PRIMARY NAU NAME LENGTH           */ 02199000
*     2 BINPRIM  CHAR(8),       /* PRIMARY NAU NAME                  */ 02200000
*     2 BINUSEL  FIXED(8),      /* USER DATA LENGTH                  */ 02201000
*     2 BINUSE   CHAR(*);       /* USER DATA                         */ 02202000
*                                                               01S0105 02203000
*/*                                                                  */ 02204000
*/*  OVERLAY FOR BINPSCHR -  PRESENTATION SERVICES                   */ 02205000
*/*                          CHARACTERICTICS FOR                     */ 02206000
*/*                          LU PROFILE 1                            */ 02207000
*/*                                                                  */ 02208000
*DCL                                                            01S0106 02209000
*  1 BINLUP1 DEFINED(BINPSCHR), /* LU PROFILE 1                      */ 02210000
*    2 BINFMHS1 BIT(4),         /* FM HEADER SUBSET                  */ 02211000
*    2 BINDSP1  BIT(4),         /* DATA STREAM PROFILE               */ 02212000
*    2 BINPLUS1 CHAR(5),        /* PLU USAGE                         */ 02213000
*    2 BINSLUS1 CHAR(5);        /* SLU USAGE                         */ 02214000
*                                                               01S0106 02215000
*/*                                                                  */ 02216000
*/*  OVERLAY FOR BINPLUS1 AND BINSLUS1 - LU USAGE                    */ 02217000
*/*                                                                  */ 02218000
*DCL                                                            01S0107 02219000
*  1 BINLUS DEFINED(BINPSCHR),  /* PLU/SLU USAGE                     */ 02220000
*    2 BINFMF1  BIT(16),        /* FM HEADER SUBSET                  */ 02221000
*      3 BINDESTS BIT(1),       /* NUMBER OF OUTSTANDING        01S0107 02222000
*                                  DESTINATIONS:                01S0107 02223000
*                                  1=TRANSMISSION MAY BE        01S0107 02224000
*                                    INTERRUPTED TWICE          01S0107 02225000
*                                  0=TRANSMISSION MAY BE        01S0107 02226000
*                                    INTERUPTED ONCE                 */ 02227000
*       3 BINCMPCT BIT(1),      /* 0=PRIMARY WILL NOT SEND      01S0107 02228000
*                                    COMPACTION TABLE           01S0107 02229000
*                                    HEADERS, SECONDARY         01S0107 02230000
*                                    WILL NOT QUERY FOR         01S0107 02231000
*                                    COMPACTION TABLES          01S0107 02232000
*                                  1=PRIMARY MAYSEND,           01S0107 02233000
*                                    SECONDARY MAY QUERY             */ 02234000
*       3 BINPDIR  BIT(1),      /* 0=PDIR WILL NOT BE SENT      01S0107 02235000
*                                  1=PDIR MAY BE SENT                */ 02236000
*       3 *        BIT(13),     /*   NOT USED FOR FMHS 1             */ 02237000
*/*  ADDITIONAL FMHS FLAGS                                           */ 02238000
*         4 BINKDDSI BIT(1),    /* 0=KEYED DIRECT DATA SET      01S0107 02239000
*                                    WILL NOT BE SENT           01S0107 02240000
*                                  1=KEYED DIRECT DATA SET      01S0107 02241000
*                                    MAY BE SENT                     */ 02242000
*         4 BINSDSI  BIT(1),    /* 0=SEQUENTIAL DATA SET        01S0107 02243000
*                                    WILL NOT BE SENT           01S0107 02244000
*                                  1=SEQUENTIAL DATA SET        01S0107 02245000
*                                    MAY BE SENT                     */ 02246000
*         4 BINSAI   BIT(1),    /* 0=SEQUENTIAL ACCESS TO       01S0107 02247000
*                                    ADDRESSED DIRECT DATA      01S0107 02248000
*                                    SETS WILL NOT BE SENT      01S0107 02249000
*                                  1=SEQUENTIAL ACCESS TO       01S0107 02250000
*                                    ADDRESSED DIRECT DATA      01S0107 02251000
*                                    SETS MAY BE SENT                */ 02252000
*         4 BINSIDS  BIT(1),    /* 0=SERIES ID NOT SUPPORTED(WITH       02253000
*                                    (WITH STATUS IN REPLY)     01S0107 02254000
*                                  1=SERIES ID NOT SUPPORTED(WITH       02255000
*                                    (WITH STATUS IN REPLY)          */ 02256000
*         4 BINARRR  BIT(1),    /* 0=ADD REPLICATE, REPLACE     01S0107 02257000
*                                    REPLICATE NOT SUPPORTED    01S0107 02258000
*                                  1=ADD REPLICATE, REPLACE     01S0107 02259000
*                                    REPLICATE SUPPORTED             */ 02260000
*         4 *        BIT(1),    /*   NOT USED                        */ 02261000
*         4 BINQDSI  BIT(1),    /* 0=QUERY DATA SET NOT         01S0107 02262000
*                                    SUPPORTED                  01S0107 02263000
*                                  1=QUERY DATA SET             01S0107 02264000
*                                    SUPPORTED                       */ 02265000
*         4 BINCSDS  BIT(1),    /* 0=CREATE/SCRATCH/SCRATCH     01S0107 02266000
*                                     ALL DATA SET NOT ALLOWED  01S0107 02267000
*                                  1=CREATE/SCRATCH/SCRATCH     01S0107 02268000
*                                     ALL DATA SET ALLOWED           */ 02269000
*         4 BINXFPD  BIT(1),    /* 0=EXECUTE FP NOT ALLOWED     01S0107 02270000
*                                  1=EXECUTE FP ALLOWED      @D34EKMP*/ 02271000
*         4 *        BIT(4),    /*   NOT USED FOR FMHS3              */ 02272000
*     2 BINDSPF1 BIT(16),       /* DATA STREAM PROFILE FLAGS         */ 02273000
*       3 BININTR  BIT(1),      /* 0=INTERACTIVE DATA STREAM    01S0107 02274000
*                                    (BS,CR,LF,ENP,INP,HT,VT)   01S0107 02275000
*                                    WILL NOT BE SENT           01S0107 02276000
*                                  1=INTERACTIVE DATA STREAM    01S0107 02277000
*                                    (BS,CR,LF,ENP,INP,HT,VT)   01S0107 02278000
*                                    MAY BE SENT             @D34EKMP*/ 02279000
*       3 BINHFDS  BIT(1),      /* 0=HORIZONTAL FORMAT DATA     01S0107 02280000
*                                    STREAM (SHF) WILL NOT      01S0107 02281000
*                                    BE SENT                    01S0107 02282000
*                                  1=HORIZONTAL FORMAT DATA     01S0107 02283000
*                                    STREAM (SHF) MAY BE        01S0107 02284000
*                                    SENT                    @D34EKMP*/ 02285000
*       3 BINVTDS  BIT(1),      /* 0=VERTICAL TAB DATA          01S0107 02286000
*                                    STREAM (SVT) WILL          01S0107 02287000
*                                    NOT BE SENT                01S0107 02288000
*                                  1=VERTICAL TAB DATA          01S0107 02289000
*                                    STREAM (SVT) WILL          01S0107 02290000
*                                    BE SENT                 @D34EKMP*/ 02291000
*       3 BINVSDS  BIT(1),      /* 0=VERTICAL SELECT DATA       01S0107 02292000
*                                    STREAM (SVF-CHANNELS)      01S0107 02293000
*                                    WILL NOT BE SENT           01S0107 02294000
*                                  1=VERTICAL SELECT DATA       01S0107 02295000
*                                    STREAM (SVF-CHANNELS)      01S0107 02296000
*                                    MAY BE SENT                     */ 02297000
*       3 BINSLD   BIT(1),      /* 0=SLD WILL NOT BE SENT       01S0107 02298000
*                                  1=SLD MAY BE SENT         @D34EKMP*/ 02299000
*       3 *        BIT(2),      /*   NOT USED                @D34EKMP*/ 02300000
*       3 BINTRNDS BIT(1),      /* 0=TRANSPARENCY DATA          01S0107 02301000
*                                    STREAM (TRN,IRS)           01S0107 02302000
*                                    WILL NOT BE SENT           01S0107 02303000
*                                  1=TRANSPARENCY DATA          01S0107 02304000
*                                    STREAM (TRN,IRS)           01S0107 02305000
*                                    MAY BE SENT                     */ 02306000
*       3 BINUAINT BIT(1),      /* 0=SLU WILL INITIATE          01S0107 02307000
*                                    ATTENDED                   01S0107 02308000
*                                  1=SLU WILL INITIATE          01S0107 02309000
*                                    UNATTENDED              @D34EKMP*/ 02310000
*       3 BINUAALT BIT(1),      /* 0=DURING SESSION SLU WILL    01S0107 02311000
*                                    NOT ALTERNATE BETWEEN      01S0107 02312000
*                                    ATTENDED AND UNATTEND      01S0107 02313000
*                                  1=DURING SESSION SLU WILL    01S0107 02314000
*                                    ALTERNATE BETWEEN          01S0107 02315000
*                                    ATTENDED AND UNATTEND   @D34EKMP*/ 02316000
*       3 *        BIT(6),      /*   NOT USED                @D34EKMP*/ 02317000
*     2 BINMEDIA BIT(8),        /* MEDIA FLAGS                       */ 02318000
*       3 BINDOCMT BIT(1),      /* 0=DOCUMENT MEDIA WILL NOT    01S0107 02319000
*                                    BE SENT                    01S0107 02320000
*                                  1=DOCUMENT MEDIA MAY BE      01S0107 02321000
*                                    SENT                            */ 02322000
*       3 BINCARD  BIT(1),      /* 0=CARD FORMAT WILL NOT BE    01S0107 02323000
*                                    SENT                       01S0107 02324000
*                                  1=CARD FORMAT MAY BE SENT         */ 02325000
*       3 BINXCHNG BIT(1),      /* 0=EXCHANGE MEDIA WILL NOT    01S0107 02326000
*                                    BE SENT                    01S0107 02327000
*                                  1=EXCHANGE MEDIA MAY BE      01S0107 02328000
*                                    SENT                            */ 02329000
*       3 BINDISK  BIT(1),      /* 0=DISK FORMAT WILL NOT BE    01S0107 02330000
*                                    SENT                       01S0107 02331000
*                                  1=DISK FORMAT MAY BE SENT         */ 02332000
*       3 BINXCDF  BIT(1),      /* 0=EXTENDED CARD FORMAT       01S0107 02333000
*                                    WILL NOT BE SENT           01S0107 02334000
*                                  1=EXTENDED CARD FORMAT       01S0107 02335000
*                                    MAY BE SENT             @D34EKMP*/ 02336000
*       3 BINXDOCF BIT(1),      /* 0=EXTENDED DOCUMENT          01S0107 02337000
*                                    FORMAT WILL NOT BE SENT    01S0107 02338000
*                                  1=EXTENDED DOCUMENT          01S0107 02339000
*                                    FORMAT MAY BE SENT      @D34EKMP*/ 02340000
*       3 BINCDEDS BIT(1),      /* 0=SLU MAY SEND CD EVERY      01S0107 02341000
*                                    EDS                        01S0107 02342000
*                                  1=SLU MUST SEND CD EVERY     01S0107 02343000
*                                    EDS                        01S0107 02344000
*                                    (THIS FLAG APPLIES ONLY TO 01S0107 02345000
*                                     BINPMED1)              @D34EKMP*/ 02346000
*       3 *        BIT(1);      /*   NOT USED                @D34EKMP*/ 02347000
*                                                               01S0107 02348000
*/*                                                                  */ 02349000
*/*  OVERLAY FOR BINPSCHR - PRESENTATION SERVICES                    */ 02350000
*/*                         CHARACTERICTICS FOR                      */ 02351000
*/*                         LU PROFILE 2                             */ 02352000
*/*                                                                  */ 02353000
*DCL                                                            01S0108 02354000
*  1 BINLUP2 DEFINED(BINPSCHR), /* LU PROFILE 2                      */ 02355000
*    2 BINSEDS  BIT(1),         /* 3270 EXTENDED DATA STREAM @D14AKMC*/ 02356000
*    2 *        BIT(7),         /* RESERVED                  @D14AKMC*/ 02357000
*    2 *        CHAR(4),        /* NOT USED                  @D14AKMC*/ 02358000
*    2 BINSCRSZ CHAR(4),        /* SCREEN SIZE IF ROW/COLUMN    01S0108 02359000
*                                  FORMAT DEFINED BY BINPRESZ        */ 02360000
*      3 BINSPRIR FIXED(8),     /* PRIMARY NUMBER OF ROWS            */ 02361000
*      3 BINSPRIC FIXED(8),     /* PRIMARY NUMBER OF COLS            */ 02362000
*      3 BINSALTR FIXED(8),     /* ALTERNATE NUMBER OF ROWS          */ 02363000
*      3 BINSALTC FIXED(8),     /* ALTERNATE NUMBER OF COLS          */ 02364000
*    2 BINPRESZ FIXED(8),       /* PRESENTATION SPACE SIZE           */ 02365000
*    2 *        BIT(8);         /* NOT USED                          */ 02366000
*                                                               01S0108 02367000
*/*                                                                  */ 02368000
*/*  OVERLAY FOR BINPSCHR - PRESENTATION SERVICES                    */ 02369000
*/*                         CHARACTERICTICS FOR                      */ 02370000
*/*                         LU PROFILE 3                             */ 02371000
*/*                                                                  */ 02372000
*DCL                                                            01S0109 02373000
*  1 BINLUP3 DEFINED(BINPSCHR), /* LU PROFILE 3                      */ 02374000
*    2 *        CHAR(5),        /* NOT USED                          */ 02375000
*    2 BINBFRSZ CHAR(4),        /* BUFFER SIZE IF ROW/COLUMN    01S0109 02376000
*                                  FORMAT DEFINED BY BINBFSIZ        */ 02377000
*      3 BINBFRDR FIXED(8),     /* DEFAULT ROWS                      */ 02378000
*      3 BINBFRDC FIXED(8),     /* DEFAULT COLS                      */ 02379000
*      3 BINBFRAR FIXED(8),     /* ALTERNATE ROWS                    */ 02380000
*      3 BINBDRAC FIXED(8),     /* ALTERNATE COLS                    */ 02381000
*    2 BINBDESC CHAR(1),        /* CONTAINS CODE FOR BUFFER     01S0109 02382000
*                                  SPECIFICATION                     */ 02383000
*      3 *        BIT(1),       /* NOT USED                          */ 02384000
*      3 BINBFSIZ BIT(7),       /* CODE FOR BUFFER SIZE         01S0109 02385000
*                                  SPECIFICATION                     */ 02386000
*    2 *        CHAR(1);        /* NOT USED                          */ 02387000
*                                                               01S0109 02388000
*/*                                                                  */ 02389000
*/*  OVERLAY FOR BINPSCHR - PRESENTATION SERVICES            @G35AKMP*/ 02390000
*/*                         CHARACTERICTICS FOR              @G35AKMP*/ 02391000
*/*                         LU PROFILE 4                     @G35AKMP*/ 02392000
*/*                                                                  */ 02393000
*DCL                                                            01S0110 02394000
*  1 BINLUP4 DEFINED(BINPSCHR), /* LU PROFILE 4                      */ 02395000
*    2 BINPSNDO BIT(32),        /* PLU SEND CAPABILITY       @G35AKMP*/ 02396000
*      3 BINPDSPP BIT(8),       /* PRINTER DATA STREAM       @G35AKMP*/ 02397000
*        4 BINRSV28 BIT(6),     /*     RESERVED              @G35AKMP*/ 02398000
*        4 BINDPP   BIT(1),     /* 0 = DUAL PITCH PRINTER       01S0110 02399000
*                                      NOT SUPPORTED            01S0110 02400000
*                                  1 = DUAL PITCH PRINTER       01S0110 02401000
*                                      SUPPORTED             @G35AKMP*/ 02402000
*        4 BINPEP   BIT(1),     /* 0 = PROPORTIONAL             01S0110 02403000
*                                      ESCAPEMENT PRINTER       01S0110 02404000
*                                      NOT SUPPORTED            01S0110 02405000
*                                  1 = PROPORTIONAL             01S0110 02406000
*                                      ESCAPEMENT PRINTER       01S0110 02407000
*                                      SUPPORTED             @G35AKMP*/ 02408000
*      3 BINADSPP BIT(8),       /* ADDITIONAL DATA STREAM       01S0110 02409000
*                                  PROFILE                   @G35AKMP*/ 02410000
*        4 BINADSEP BIT(1),     /* 0 = EXTENDED PRINTER         01S0110 02411000
*                                      NOT SUPPORTED            01S0110 02412000
*                                  1 = EXTENDED PRINTER         01S0110 02413000
*                                      SUPPORTED             @G35AKMP*/ 02414000
*        4 BINADSCD BIT(1),     /* 0 = CARD NOT SUPPORTED       01S0110 02415000
*                                  1 = CARD SUPPORTED        @G35AKMP*/ 02416000
*        4 BINADSEC BIT(1),     /* 0 = EXTENDED CARD NOT        01S0110 02417000
*                                      SUPPORTED                01S0110 02418000
*                                  1 = EXTENDED CARD            01S0110 02419000
*                                      SUPPORTED             @G35AKMP*/ 02420000
*        4 BINADSBE BIT(1),     /* 0 = EXCHANGE NOT             01S0110 02421000
*                                      SUPPORTED                01S0110 02422000
*                                  1 = EXCHANGE SUPPORTED    @G35AKMP*/ 02423000
*        4 BINADSSF BIT(1),     /* 0 = SEQUENTIAL FILE          01S0110 02424000
*                                      NOT SUPPORTED            01S0110 02425000
*                                  1 = SEQUENTIAL FILE          01S0110 02426000
*                                      SUPPORTED             @G35AKMP*/ 02427000
*        4 BINADSRF BIT(1),     /* 0 = RANDOM FILE NOT          01S0110 02428000
*                                      SUPPORTED                01S0110 02429000
*                                  1 = RANDOM FILE              01S0110 02430000
*                                      SUPPORTED             @G35AKMP*/ 02431000
*        4 BINRSV29 BIT(2),     /*     RESERVED              @G35AKMP*/ 02432000
*      3 BINCSLP  BIT(8),       /* CONSOLE                   @G35AKMP*/ 02433000
*      3 BINFMHUP BIT(8),       /* FM/FMH USAGE              @G35AKMP*/ 02434000
*        4 BINSSDAT BIT(1),     /* 0 = SUPERVISORY              01S0110 02435000
*                                      SERVICE FM DATA          01S0110 02436000
*                                      NOT SUPPORTED            01S0110 02437000
*                                  1 = SUPERVISORY              01S0110 02438000
*                                      SERVICE FM DATA          01S0110 02439000
*                                      SUPPORTED (NOTE:         01S0110 02440000
*                                      NOT EXAMINED BY          01S0110 02441000
*                                      SLU IN SESSION           01S0110 02442000
*                                      WITH SSCP)            @G35AKMP*/ 02443000
*        4 BINDSSTO BIT(2),     /* 00= 1ST LEVEL DEST           01S0110 02444000
*                                      SELECTION SUSPEND        01S0110 02445000
*                                      STACK                    01S0110 02446000
*                                  01= 2ND LEVEL DEST           01S0110 02447000
*                                      SELECTION SUSPEND        01S0110 02448000
*                                      STACK                    01S0110 02449000
*                                  10= RESERVED                 01S0110 02450000
*                                  11= 3RD LEVEL DEST           01S0110 02451000
*                                      SELECTION SUSPEND        01S0110 02452000
*                                      STACK                 @G35AKMP*/ 02453000
*        4 BINCOMPO BIT(1),     /* 0 = COMPACTION NOT           01S0110 02454000
*                                      SUPPORTED                01S0110 02455000
*                                  1 = COMPACTION               01S0110 02456000
*                                      SUPPORTED             @G35AKMP*/ 02457000
*        4 BINPDIRO BIT(1),     /* 0 = PDIR FOR ALL MEDIA       01S0110 02458000
*                                      NOT SUPPORTED            01S0110 02459000
*                                  1 = PDIR FOR ALL MEDIA       01S0110 02460000
*                                      SUPPORTED             @G35AKMP*/ 02461000
*        4 BINWPFMO BIT(1),     /* 0 = FORMAT HEADER NOT        01S0110 02462000
*                                      SUPPORTED                01S0110 02463000
*                                  1 = FORMAT HEADER            01S0110 02464000
*                                      SUPPORTED             @G35AKMP*/ 02465000
*        4 BINQFDO  BIT(1),     /* 0 = QUERY FOR DEST           01S0110 02466000
*                                      FMH2 NOT SUPPORTED       01S0110 02467000
*                                  1 = QUERY FOR DEST           01S0110 02468000
*                                      FMH2 SUPPORTED        @G35AKMP*/ 02469000
*        4 BINKIXS  BIT(1),     /* 0 = SLU NEED NOT             01S0110 02470000
*                                      RECEIVE CD ON            01S0110 02471000
*                                      EVERY EDS                01S0110 02472000
*                                  1 = SLU MUST RECEIVE         01S0110 02473000
*                                      CD ON EVERY EDS       @G35AKMP*/ 02474000
*    2 BINSSNDO BIT(32),        /* SLU SEND CAPABILITY       @G35AKMP*/ 02475000
*      3 BINPDSPS BIT(8),       /* PRINTER DATA STREAM          01S0110 02476000
*                                  PROFILE (SEE PDSPP)       @G35AKMP*/ 02477000
*      3 BINADSPS BIT(8),       /* ADDITIONAL DATA STREAM       01S0110 02478000
*                                  PROFILE (SEE ADSPP)       @G35AKMP*/ 02479000
*      3 BINCSLS  BIT(8),       /* CONSOLE (SEE CSLP )       @G35AKMP*/ 02480000
*      3 BINFMHUS BIT(8),       /* FM/FMH USAGE (SEE            01S0110 02481000
*                                  FMHUP) - MEANING FOR         01S0110 02482000
*                                  BINKIXS IS:                  01S0110 02483000
*                                  0 = PLU NEED NOT             01S0110 02484000
*                                      RECEIVE CD ON            01S0110 02485000
*                                      EVERY EDS                01S0110 02486000
*                                  1 = PLU MUST RECEIVE         01S0110 02487000
*                                      CD ON EVERY EDS       @G35AKMP*/ 02488000
*    2 BINCSO   BIT(8),         /* CODE SELECTION            @G35AKMP*/ 02489000
*      3 BINCSOR  BIT(4),       /* REPERTOIRE                @G35AKMP*/ 02490000
*        4 BINCSOE  BIT(1),     /* 1 = EBCDIC                @G35AKMP*/ 02491000
*        4 BINCSOAI BIT(1),     /* 1 = ASCII/ISCII/ITA#5     @G35AKMP*/ 02492000
*        4 BINRSV30 BIT(1),     /*     RESERVED              @G35AKMP*/ 02493000
*        4 BINRSV31 BIT(1),     /*     RESERVED              @G35AKMP*/ 02494000
*      3 BINCSOC1 BIT(2),       /* 00= CODE 0 (MAIN CODE)       01S0110 02495000
*                                      SELECTION IS             01S0110 02496000
*                                      EBCDIC                   01S0110 02497000
*                                  01= CODE 0 (MAIN CODE)       01S0110 02498000
*                                      SELECTION IS             01S0110 02499000
*                                      ASCII/ICSII/ITA#5     @G35AKMP*/ 02500000
*      3 BINCSOC2 BIT(2),       /* 00= CODE 1 (ALTERNATE        01S0110 02501000
*                                      CODE) SELECTION IS       01S0110 02502000
*                                      EBCDIC                   01S0110 02503000
*                                  01= CODE 1 (ALTERNATE        01S0110 02504000
*                                      CODE) SELECTION IS       01S0110 02505000
*                                      ASCII/ICSII/ITA#5     @G35AKMP*/ 02506000
*    2 BINGENCO BIT(8),         /* GENERAL CHARACTERISTIC    @G35AKMP*/ 02507000
*      3 BINRSV32 BIT(2),       /*     RESERVED              @G35AKMP*/ 02508000
*      3 BINWSDF  BIT(1),       /* 0 = PLU MAY SEND DATA        01S0110 02509000
*                                      FIRST                    01S0110 02510000
*                                  1 = SLU MUST SEND DATA       01S0110 02511000
*                                      FIRST                 @G35AKMP*/ 02512000
*      3 BINRSV33 BIT(1),       /*     RESERVED              @G35AKMP*/ 02513000
*      3 BINIAO   BIT(1),       /* 0 = SLU WILL INITIATE        01S0110 02514000
*                                      ATTENDED                 01S0110 02515000
*                                  1 = SLU WILL INITIATE        01S0110 02516000
*                                      UNATTEND              @G35AKMP*/ 02517000
*      3 BINAAO   BIT(1),       /* 0 = SLU WILL NOT             01S0110 02518000
*                                      ALTERNATE BETWEEN        01S0110 02519000
*                                      ATTEND AND               01S0110 02520000
*                                      UNATTEND                 01S0110 02521000
*                                  1 = SLU WILL ALTERNATE       01S0110 02522000
*                                      BETWEEN ATTEND AND       01S0110 02523000
*                                      UNATTEND              @G35AKMP*/ 02524000
*      3 BINRVS34 BIT(2),       /*     RESERVED              @G35AKMP*/ 02525000
*    2 BINRSV35 BIT(8);         /* RESERVED                  @G35AKMP*/ 02526000
*                                                               01S0110 02527000
*/*                                                          @G54AKMP*/ 02528000
*/*  OVERLAY FOR BINCRYPT - FOR TRUE ****** DEFINITION       @G54AKMP*/ 02529000
*/*                                                          @G54AKMP*/ 02530000
*DCL                                                            01S0111 02531000
*  1 BINCRYRL                                                   01S0111 02532000
*      BASED(ADDR(BINCRYPT)),   /*                           @G54AKMP*/ 02533000
*    2 BINCRCTL BIT(8),         /* ****** CONTROL BYTE       @G54AKMP*/ 02534000
*      3 BINCEUMB BIT(2),       /* EUM/PRIVATE FLAGS         @G54AKMP*/ 02535000
*      3 BINCSESS BIT(2),       /* SESSION LEVEL ******      @G54AKMP*/ 02536000
*      3 BINCLEN  BIT(4),       /* LENGTH OF ****** FIELD    @G54AKMP*/ 02537000
*    2 BINCRPFL CHAR(1),        /* ****** FLAGS              @G54AKMP*/ 02538000
*      3 BINCKEYT BIT(2),       /* KEY MODE                  @G54AKMP*/ 02539000
*      3 BINCRSV1 BIT(3),       /* NOT USED                  @G54AKMP*/ 02540000
*      3 BINCCIPH BIT(3),       /* ****** METHOD             @G54AKMP*/ 02541000
*    2 BINCRKEY CHAR(8);        /* ****** KEY                @G54AKMP*/ 02542000
*                                                               01S0111 02543000
*/*                                                          @D34EKMP*/ 02544000
*/*  EXPANDED DEFINITION OF NAU NAME AND VARIABLE            @D34EKMP*/ 02545000
*/*                                                          @D34EKMP*/ 02546000
*DCL                                                            01S0112 02547000
*  1 BINPNAU BASED(ADDR(BINCRPFL)+(BINCRCTL & '0F'X)),/*     @D34EKMP*/ 02548000
*    2 BINAUNML FIXED(8),       /* LENGTH OF NAME            @D34EKMP*/ 02549000
*    2 BINAUNM  CHAR(*);        /* PRIMARY NAU NAME          @D34EKMP*/ 02550000
*                                                               01S0112 02551000
*/*                                                          @D34EKMP*/ 02552000
*/*  LOCATION OF USER DATA BEYOND VARIABLES                  @D34EKMP*/ 02553000
*/*                                                          @D34EKMP*/ 02554000
*DCL                                                            01S0113 02555000
*  1 BINUSEDT BASED(EVAL(ADDR(BINAUNM)+BINAUNML)),/*         @D34EKMP*/ 02556000
*    2 BINUSDTL FIXED(8),       /* USER DATA LENGTH          @D34EKMP*/ 02557000
*    2 BINUSDTA CHAR(*);        /* USER DATA                 @D34EKMP*/ 02558000
*                                                               01S0113 02559000
*/*                                                          @D14AKMP*/ 02560000
*/*  USER REQUEST CORRELATOR - THIS FIELD IS OPTIONAL AND    @D14AKMP*/ 02561000
*/*                            NEED NOT BE PRESENT           @D14AKMP*/ 02562000
*/*                                                          @D14AKMP*/ 02563000
*DCL                                                            01S0114 02564000
*  1 BINURC BASED(EVAL(ADDR(BINUSDTA)+BINUSDTL)),/*          @D14AKMP*/ 02565000
*    2 BINURCL  FIXED(8),       /* URC LENGTH                @D14AKMP*/ 02566000
*    2 BINURCD  CHAR(*);        /* URC DATA                  @D14AKMP*/ 02567000
*                                                               01S0114 02568000
*/*                                                          @D14AKMP*/ 02569000
*/*  SECONDARY LOGICAL UNIT NAME - THIS FIELD IS OPTIONAL    @D14AKMP*/ 02570000
*/*                                AND NEED NOT BE PRESENT   @D14AKMP*/ 02571000
*/*                                                          @D14AKMP*/ 02572000
*DCL                                                            01S0115 02573000
*  1 BINSLUNM BASED(EVAL(ADDR(BINURCD)+BINURCL)),/*          @D14AKMP*/ 02574000
*    2 BINSNML  FIXED(8),       /* SLU NAME LENGTH           @D14AKMP*/ 02575000
*    2 BINSNMD  CHAR(*);        /* SLU NAME DATA             @D14AKMP*/ 02576000
*                                                               01S0115 02577000
*/*                                                          @D34EKMP*/ 02578000
*/*  VALUES FOR BINSRUSZ AND BINPRUSZ (RU SIZES                      */ 02579000
*/*                                                          @D34EKMP*/ 02580000
*DCL                                                            01S0116 02581000
*  BINRU256 BIT(8) CONSTANT('85'X);/* 256 BYTE RU                    */ 02582000
*                                                               01S0116 02583000
*/*                                                                  */ 02584000
*/*  VALUES FOR BINLUP - LU PROFILE                                  */ 02585000
*/*                                                                  */ 02586000
*DCL                                                            01S0117 02587000
*  BINLUP0C FIXED(8) CONSTANT(0),/* LU PROFILE 0             @D34EKMP*/ 02588000
*  BINLUP1C FIXED(8) CONSTANT(1),/* LU PROFILE 1                     */ 02589000
*  BINLUP2C FIXED(8) CONSTANT(2),/* LU PROFILE 2                     */ 02590000
*  BINLUP3C FIXED(8) CONSTANT(3);/* LU PROFILE 3                     */ 02591000
*                                                               01S0117 02592000
*/*                                                                  */ 02593000
*/*  VALUES FOR BINFMHS1 - FM HEADER SUBSET                          */ 02594000
*/*                                                                  */ 02595000
*DCL                                                            01S0118 02596000
*  BINFMS1C BIT(4) CONSTANT('0001'B),/* SUBSET 1                     */ 02597000
*  BINFMS2C BIT(4) CONSTANT('0010'B),/* SUBSET 2             @DM30817*/ 02598000
*  BINFMS3C BIT(4) CONSTANT('0011'B);/* SUBSET 3                     */ 02599000
*                                                               01S0118 02600000
*/*                                                                  */ 02601000
*/*  VALUES FOR BINDSP1 - DATA STREAM PROFILE                        */ 02602000
*/*                                                                  */ 02603000
*DCL                                                            01S0119 02604000
*  BINDSP0C BIT(4) CONSTANT('0000'B),/* BASIC CONTROL                */ 02605000
*  BINDSP1C BIT(4) CONSTANT('0001'B);/* BASIC CONTROL CARDS     01S0119 02606000
*                                       MAY SPAN RUS                 */ 02607000
*                                                               01S0119 02608000
*/*                                                                  */ 02609000
*/*  VALUES FOR BINPRESZ - PRESENTATION SPACE SIZE                   */ 02610000
*/*                                                                  */ 02611000
*DCL                                                            01S0120 02612000
*  BINPSZ0  FIXED(8) CONSTANT(0),  /* UNDEFINED CHARACTER       01S0120 02613000
*                                     MATRIX                         */ 02614000
*  BINPSZ1  FIXED(8) CONSTANT(1),  /* 12X40 MATRIX                   */ 02615000
*  BINPSZ2  FIXED(8) CONSTANT(2),  /* 24X80 MATRIX                   */ 02616000
*  BINPSFX  BIT(8) CONSTANT('7E'X),                             01S0120 02617000
*  BINPSZRC BIT(8) CONSTANT('7F'X),                             01S0120 02618000
*  BINUSERD BIT(8) CONSTANT('00'X);/* USER DATA LENGTH          01S0120 02619000
*                                     DEFAULT                        */ 02620000
*                                                               01S0120 02621000
*/*                                                                  */ 02622000
*/*  VALUES FOR BINPCHNR AND BINSCHNR - TYPE OF RESPONSES            */ 02623000
*/*                                     ASKED FOR BY                 */ 02624000
*/*                                     REQUESTS FROM                */ 02625000
*/*                                     PRIMARY/SECONDARY            */ 02626000
*DCL                                                            01S0121 02627000
*  BINNORSP BIT(2) CONSTANT('00'B),/* NO RESPONSE                    */ 02628000
*  BINEXRSP BIT(2) CONSTANT('01'B),/* EXCEPTION RESPONSE     @D34EKMP*/ 02629000
*  BINDFRSP BIT(2) CONSTANT('10'B),/* DEFINITE RESPONSE              */ 02630000
*  BINNYRSP BIT(2) CONSTANT('11'B);/* DEFINITE OR EXCEPTION     01S0121 02631000
*                                     RESPONSE                       */ 02632000
*                                                               01S0121 02633000
*/*                                                                  */ 02634000
*/*  VALUES FOR BINFMTRM - TRANSACTION MODE                          */ 02635000
*/*                                                                  */ 02636000
*DCL                                                            01S0122 02637000
*  BINFLDPX BIT(2) CONSTANT('00'B),/* FULL DUPLEX                    */ 02638000
*  BINHDXC  BIT(2) CONSTANT('01'B),/* HALF-DUPLEX CONTENTION         */ 02639000
*  BINHDXFF BIT(2) CONSTANT('10'B),/* HALF-DUPLEX FLIP-FLOP          */ 02640000
*  BINMSTSL BIT(2) CONSTANT('11'B);/* MASTER/SLAVE                   */ 02641000
*                                                               01S0122 02642000
*/*                                                                  */ 02643000
*/*  VALUES FOR BINTS - TRANSMISSION SERVICES PROFILE                */ 02644000
*/*                                                                  */ 02645000
*DCL                                                            01S0123 02646000
*  BINTS0   FIXED CONSTANT(0),  /* ID'S - NO RESET STATE             */ 02647000
*  BINTS1   FIXED CONSTANT(1),  /* ID'S - NO RESET STATE             */ 02648000
*  BINTS2   FIXED CONSTANT(2),  /* SEQ NOS - NO RESET STATE          */ 02649000
*  BINTS3   FIXED CONSTANT(3);  /* SEQ NOS - RESET STATE             */ 02650000
*                                                               01S0123 02651000
*/*                                                                  */ 02652000
*/*  VALUES FOR BINTYPE - TYPE                                       */ 02653000
*/*                                                                  */ 02654000
*DCL                                                            01S0124 02655000
*  BINNEGO  BIT(4) CONSTANT('0000'B),/* COLD/NEGOTIABLE      @D14AKMP*/ 02656000
*  BINCOLD  BIT(4) CONSTANT('0001'B),/* COLD/NON-NEGOTIABLE  @D34EKMP*/ 02657000
*  BINERP   BIT(4) CONSTANT('0010'B),/* ERP                          */ 02658000
*  BINWARM  BIT(4) CONSTANT('0100'B),/* WARM                         */ 02659000
*  BINCHNGE BIT(4) CONSTANT('1000'B);/* CHANGE                       */ 02660000
*                                                               01S0124 02661000
*/*                                                                  */ 02662000
*/*  VALUES FOR BINFMT - FORMAT                                      */ 02663000
*/*                                                                  */ 02664000
*DCL                                                            01S0125 02665000
*  BINFMT0  BIT(4) CONSTANT('0000'B);/* FORMAT 0                     */ 02666000
*                                                               01S0125 02667000
*/*                                                          @G54AKMP*/ 02668000
*/*  VALUES FOR BINCRCTL                                     @G54AKMP*/ 02669000
*/*                                                          @G54AKMP*/ 02670000
*DCL                                                            01S0126 02671000
*  BINNOCRY BIT(8) CONSTANT('00'X),/* NO ******              @G54AKMP*/ 02672000
*  BINCRYCA BIT(8) CONSTANT('09'X),/* ****** CAPABLE         @G54AKMP*/ 02673000
*  BINCRYSL BIT(8) CONSTANT('19'X),/* ****** SELECTIVE       @G54AKMP*/ 02674000
*  BINCRYRQ BIT(8) CONSTANT('39'X);/* ****** REQUIRED        @G54AKMP*/ 02675000
*                                                               01S0126 02676000
*/*                                                                  */ 02677000
*/*  VALUES FOR BINCEUMB - EUM/PRIVATE FLAGS                 @G54AKMP*/ 02678000
*/*                                                                  */ 02679000
*DCL                                                            01S0127 02680000
*  BINCEUNP BIT(2) CONSTANT('00'B),/* NO PRIVATE/EUM         @G54AKMP*/ 02681000
*  BINCEUPP BIT(2) CONSTANT('01'B),/* PRIVATE KEY,              01S0127 02682000
*                                     PRIVATE PROTOCOL       @G54AKMP*/ 02683000
*  BINCEUPS BIT(2) CONSTANT('10'B);/* SYSTEM KEY,               01S0127 02684000
*                                     PRIVATE PROTOCOL       @G54AKMP*/ 02685000
*                                                               01S0127 02686000
*/*                                                                  */ 02687000
*/*  VALUES FOR BINCSESS - SESSION LEVEL FLAGS               @G54AKMP*/ 02688000
*/*                                                                  */ 02689000
*DCL                                                            01S0128 02690000
*  BINCSENP BIT(2) CONSTANT('00'B),/* NO SESSION LEVEL       @G54AKMP*/ 02691000
*  BINCSESP BIT(2) CONSTANT('01'B),/* SELECTED SESSION          01S0128 02692000
*                                     LEVEL                  @G54AKMP*/ 02693000
*  BINCSESR BIT(2) CONSTANT('11'B);/* REQUIRED SESSION          01S0128 02694000
*                                     LEVEL                  @G54AKMP*/ 02695000
*/*  CONNECTIONS SERVICES LIST ENTRY                                 */ 02696000
*/*  NETWORKING                                        002 02/26/76  */ 02697000
*DCL  1  ISTCSL BASED BDY(WORD),                                01S0129 02698000
*        2 CSLRDEF  PTR(32),        /* RSC RDTE DEFINATION           */ 02699000
*          3 CSLRDTE  PTR(31),      /* RSC RDTE POINTER              */ 02700000
*            4 CSLRDTEF BIT(1),     /* RSC RDTE FLAG                 */ 02701000
*            4 *        BIT(7),     /* RESERVED                      */ 02702000
*            4 CSLRDTPT PTR(24),    /* RESOURCE RDTE POINTER         */ 02703000
*        2 CSLNDEF  PTR(32),        /* RSC NIB DEFINATION            */ 02704000
*          3 CSLNIB   PTR(31),      /* RSC NIB POINTER               */ 02705000
*            4 CSLNIBF  BIT(1),     /* RSC NIB FLAG                  */ 02706000
*        2 CSLDDEF  PTR(32),        /* RSC DATA DEFINATION           */ 02707000
*          3 CSLDATA  PTR(31),      /* RSC DATA POINTER              */ 02708000
*            4 CSLDATAF BIT(1),     /* RSC DATA FLAG                 */ 02709000
*        2 *        PTR(31);        /* RESERVED                      */ 02710000
*/*         VTAM NODE IDENTIFICATION BLOCK                           */ 02711000
*/*  NETWORKING                                        002 03/01/76  */ 02712000
*DECLARE                                                        01S0130 02713000
*      1 ISTNIB   BDY(WORD)     BASED,                          01S0130 02714000
*        2 NIBID       CHAR(1),       /* NIB IDENTIFIER              */ 02715000
*        2 NIBRSV01    CHAR(1),        /* RESERVED                   */ 02716000
*        2 NIBCONDN    CHAR(1),         /* CONDN */             01S0130 02717000
*        2 NIBLEN      CHAR(1),         /* NIB LENGTH */        01S0130 02718000
*        2 NIBCID       CHAR(4),        /* COMMUNICATION ID           * 02719000
*        2 NIBUSER     CHAR(4),        /* USER DATA AREA             */ 02720000
*        2 NIBSYM      CHAR(8),        /* SYMBOLIC NODE NAME         */ 02721000
*        2 NIBMODE     CHAR(8),        /*MODE NAME FOR SKEL DVT      */ 02722000
*        2 NIBDEVCH    CHAR(LENGTH(ISTDEVCH)), /* AREA FOR DEVICE       02723000
*                                                CHARACTERISTICS     */ 02724000
*        2 NIBPROCD    CHAR(LENGTH(ISTPROCD)),    /* NIB        01S0130 02725000
*                                                PROCESSING OPTIONS  */ 02726000
*        2 NIBFLGS     BIT(8),       /* FLAGS                      */   02727000
*          3 NIBFLG1   BIT(8),         /* FLAGS 1                    */ 02728000
*            4 NIBLAST BIT(1),         /* 1=NOT LAST NIB */     01S0130 02729000
*            4 NIBCON  BIT(1),         /*1=NODE CONNECTED            */ 02730000
*            4 NIBSDAPP BIT(1),        /* SDT / APPL=1,VTAM=0        */ 02731000
*            4 NIBSHLTP BIT(1),        /* DESTINATION IS REQUIRED BY    02732000
*                                         ANOTHER APPLICATION        */ 02733000
*            4 NIBNACLQ BIT(1),  /* IF ACCEPT FAILED, LOGON CANCELLED*/ 02734000
*            4 NIBTSEL BIT(1),   /* SELECTIVE CRYPTO         @D440502*/ 02735000
*            4 NIBTREQ BIT(1),   /* REQUIRED CRYPTO          @D440502*/ 02736000
*            4 *        BIT(1),  /* RESERVED                         */ 02737000
*         2 * CHAR(1),        /* RESERVED   */                  01S0130 02738000
*         2 NIBLIMIT FIXED(15),  /* RESPLIM VALUE                    */ 02739000
*         2 NIBEXLST PTR(31),    /* EXIT LIST ADDRESS                */ 02740000
*         2 NIBLMODE CHAR(8),    /* LOGON MODE                       */ 02741000
*         2 NIBNDAR  PTR(31),    /* POINTER TO BIND SESSION PARAMS   */ 02742000
*         2 NIBRESV  CHAR(4);    /* RESERVED                         */ 02743000
*      DCL NIBIDD BIT(8) CONSTANT('D0'X);   /*      NIBID EQUATE  */    02744000
*/* CONNECTION SERVICES PARAMETER LIST */                       01S0132 02745000
*/*  NETWORKING                                        004 04/29/76  */ 02746000
*DCL  1  ISTCSP BASED BDY(WORD),                                01S0132 02747000
*       2  CSPIDX FIXED(15),           /* INDEX TO FTN VECTOR TABLE  */ 02748000
*       2  CSPOPT BIT(16),             /* FLAGS                      */ 02749000
*         3  CSPOPT1 BIT(8),           /* FLAG BYTE                  */ 02750000
*            4  *      BIT(1),         /* RESERVED                   */ 02751000
*            4  CSPQ BIT(1),           /* QUEUE TYPE                 */ 02752000
*            4  CSPLOGI BIT(1),        /* LOGON TYPE ACQUIRE         */ 02753000
*            4  CSPDEACT BIT(1),       /* REQUEST TO CSCAD IS DEACT. */ 02754000
*            4  CSPSINIT BIT(1),       /* INITIATED BY SECONDARY     */ 02755000
*            4  CSPLIFOP BIT(1),       /* LIFO QUEUEING AT PRIMARY   */ 02756000
*            4  CSPLIFOS BIT(1),       /* LIFO QUEUEING AT SECONDARY */ 02757000
*            4  CSPRESP  BIT(1),       /*TURN ON POS. RESP. BIT IN CE*/ 02758000
*         3  CSPOPT2 BIT(8),           /* FLAG BYTE 2                */ 02759000
*            4  CSPSTAP BIT(1),        /* SHOULDER TAP CURRENT OWNER */ 02760000
*            4  CSPCOREQ BIT(1),       /* LIST FORM IS COREQUISITE   */ 02761000
*            4  CSPNOREL BIT(1),       /* REALLOCATION ONLY          */ 02762000
*            4  CSPACES BIT(1),        /* RESERVED - REMOVE LATER    */ 02763000
*            4  CSPACQS BIT(1),        /* CANCEL ACQUIRES            */ 02764000
*            4  CSPWASQD BIT(1),       /* ON AFTER REQUEST WAS QUEUED*/ 02765000
*            4  CSPNONTF BIT(1),       /* NO FUNNY NOTIFY            */ 02766000
*            4  CSPRLRQ  BIT(1),       /* RELREQ EXIT TO BE SCHEDULED*/ 02767000
*       2  CSPSRC PTR(31),             /* SOURCE APPLICATION RDTE PTR*/ 02768000
*          3 CSPPRIM  PTR(31),         /* ADDRESS OF PRIMARY RDTE    */ 02769000
*       2  CSPDEST PTR(31),            /* DESTINATION APPLIC.RDTE PTR*/ 02770000
*          3 CSPTARG  PTR(31),         /* TARGET RDTE FOR LOGON      */ 02771000
*       2  CSPRSCE PTR(31),            /* RESOURCE RDTE PTR          */ 02772000
*          3 CSPCSL   PTR(31),         /* ADDRESS OF CSL             */ 02773000
*       2  CSPDATA PTR(31),            /* ADDRESS OF LOGON DATA      */ 02774000
*                                      /* BUFFER TO BE FREED         */ 02775000
*       2  CSPQID FIXED(8),            /* GENERIC IDENTIFIER OF QUEUE*/ 02776000
*       2  CSPCC FIXED(8),             /* CONNECTIONS SERVICES RC    */ 02777000
*       2  CSPNO FIXED(15),            /* NUMBER OF ENTRIES IN CSL   */ 02778000
*       2  CSPID FIXED(16),            /* ID NUMBER OF REQUEST       */ 02779000
*       2  *     CHAR(6),              /* RESERVED                   */ 02780000
*       2  CSPUNMPT PTR(31) BDY(WORD), /* PRIMARY NAU NAME FOR LOGON */ 02781000
*       2  *        CHAR(4),           /* RESERVED                   */ 02782000
*       2  CSPFUNCT BIT(16),           /* MENU OPTIONS               */ 02783000
*          3 CSPMEN1  BIT(8),          /* 1ST BYTE OF MENU OPTIONS   */ 02784000
*            4 CSPAE    BIT(1),        /* CHECK AUTHORIZATION        */ 02785000
*            4 CSPAD    BIT(1),        /* ACTIVATE/DEACTIVATE ID     */ 02786000
*            4 CSPLO    BIT(1),        /* LOCATE ELEMENT             */ 02787000
*            4 *        BIT(1),        /* RESERVED                   */ 02788000
*            4 CSPCV    BIT(1),        /* REQUEUE ELEMENT            */ 02789000
*            4 *        BIT(1),        /* RESERVED                   */ 02790000
*            4 CSPQU    BIT(1),        /* QUEUE ELEMENT              */ 02791000
*            4 CSPLE    BIT(1),        /* SCHEDULE APPL EXIT         */ 02792000
*          3 CSPMEN2  BIT(8),          /* 2ND BYTE OF MENU OPTIONS   */ 02793000
*            4 *        BIT(1),        /* RESERVED                   */ 02794000
*            4 *        BIT(1),        /* RESERVED                   */ 02795000
*            4 CSPAC    BIT(1),        /* RSVD FOR ACCEPT---         */ 02796000
*                                      /* SEE CONSTANT CSPACC        */ 02797000
*            4 *        BIT(1),        /* RESERVED                   */ 02798000
*            4 CSPRL    BIT(1),        /* RSVD FOR RELEASE--         */ 02799000
*                                      /* SEE CONSTANT CSPREL        */ 02800000
*            4 CSPCL    BIT(1),        /* RESERVED FOR CANCEL--      */ 02801000
*                                      /* SEE CONSTANT CSPCNCL       */ 02802000
*            4 *        BIT(1),        /* RESERVED                   */ 02803000
*            4 CSPJS    BIT(1),        /* ACTIVATE                   */ 02804000
*        2 CSPRSV   CHAR(2),           /* RESERVED                   */ 02805000
*        2 CSPCECT  FIXED(15),         /* NUMBER OF CONNECTION       */ 02806000
*                                      /* ELEMENTS REQUIRED          */ 02807000
*        2 CSPUCBCT FIXED(15),         /* NUMBER OF UECBS REQUIRED   */ 02808000
*        2 CSPCE    PTR(31),           /* POINTER TO EXISTING/FOUND  */ 02809000
*                                      /* CONNECTION ELEMENT         */ 02810000
*        2 CSPCEA   PTR(31),           /* PTR TO C.E. OR C.E. CHAIN  */ 02811000
*                                      /* GOTTEN OR TO BE FREED      */ 02812000
*        2 CSPUECBA PTR(31);           /* PTR TO UECB OR UECB CHAIN  */ 02813000
*                                      /* GOTTEN OR TO BE FREED      */ 02814000
*/* FVT INDEXES - STORED IN CSPIDX                                   */ 02815000
*   DCL CSPISIML FIXED(15) CONSTANT(01); /* FVT SIMLOGON INDEX       */ 02816000
*   DCL CSPIACQ  FIXED(15) CONSTANT(01); /* FVT ACQUIRE  INDEX       */ 02817000
*   DCL CSPIREL  FIXED(15) CONSTANT(00); /* FVT RELEASE  INDEX       */ 02818000
*   DCL CSPIACPT FIXED(15) CONSTANT(03); /* FVT ACCEPT   INDEX       */ 02819000
*   DCL CSPILGN  FIXED(15) CONSTANT(04); /* FVT LOGON    INDEX       */ 02820000
*   DCL CSPIPASS FIXED(15) CONSTANT(05); /* FVT PASS     INDEX       */ 02821000
*   DCL CSPICNCL FIXED(15) CONSTANT(00); /* FVT CANCEL   INDEX       */ 02822000
*   DCL CSPIREQS FIXED(15) CONSTANT(00); /* FVT REQSESS  INDEX       */ 02823000
*   DCL CSPIOPNS FIXED(15) CONSTANT(06); /* FVT OPNSEC   INDEX       */ 02824000
*DCL CSPIMTCH FIXED(15) CONSTANT(08);    /* FVT MATCH    INDEX       */ 02825000
*DCL CSPIWAIT FIXED(15) CONSTANT(09);    /* FVT WAIT     INDEX       */ 02826000
*DCL CSPIPOST FIXED(15) CONSTANT(10);    /* FVT POST     INDEX       */ 02827000
*DCL CSPIQ    FIXED(15) CONSTANT(11);    /* FVT QUEUE    INDEX       */ 02828000
*DCL CSPISRCH FIXED(15) CONSTANT(12);    /* FVT SEARCHQ  INDEX       */ 02829000
*DCL CSPITCON FIXED(15) CONSTANT(13);    /* FVT TCONNECT INDEX       */ 02830000
*DCL CSPIACON FIXED(15) CONSTANT(14);    /* FVT ACONNECT INDEX       */ 02831000
*DCL CSPIDCON FIXED(15) CONSTANT(15);    /* FVT DCONNECT INDEX       */ 02832000
*DCL CSPIFRR  FIXED(15) CONSTANT(16);    /* FVT FRR      INDEX       */ 02833000
*DCL CSPIGSTR FIXED(15) CONSTANT(17);    /* FVT GETSTORE INDEX       */ 02834000
*DCL CSPILG0  FIXED(15) CONSTANT(18);    /* FVT LOGON0   INDEX       */ 02835000
*DCL CSPITPQ  FIXED(15) CONSTANT(19);    /* FVT TPQUE    INDEX       */ 02836000
*DCL CSPIFSTR FIXED(15) CONSTANT(20);    /* FVT FREESTOR INDEX       */ 02837000
*DCL CSPIACCT FIXED(15) CONSTANT(21);    /* FVT DOACCT   INDEX       */ 02838000
*/*  HEX VALUES TO IDENTIFY GENERIC QUEUE - STORED IN CSPQID         */ 02839000
*DCL CSPGACEQ FIXED(8) CONSTANT(01);     /* ACTIVE ACE QUEUE         */ 02840000
*DCL CSPGLGNQ FIXED(8) CONSTANT(02);     /* PENDING-ACTIVE (LOGON) Q */ 02841000
*DCL CSPGAQRQ FIXED(8) CONSTANT(03);     /* Q'ED-INACT (ACQUIRE) Q   */ 02842000
*DCL CSPGACPQ FIXED(8) CONSTANT(04);     /* ACCEPT QUEUE             */ 02843000
*/* CONSTANT VALUES REQUIRED IN CSPFUNCT FOR                         */ 02844000
*/* ACCEPT, RELEASE, AND CANCEL                                      */ 02845000
*/* NOTE: INDIVIDUAL BITS OF CSPFUNCT REPRESENT DIFFERENT            */ 02846000
*/* FUNCTIONS BUT ONLY THE FOLLOWING COMBINATIONS CAN                */ 02847000
*/* REPRESENT ACCEPT, RELEASE AND CANCEL                             */ 02848000
*DCL CSPACC   BIT(16) CONSTANT('8020'X); /* ACCEPT                   */ 02849000
*DCL CSPREL   BIT(16) CONSTANT('0008'X); /* RELEASE                  */ 02850000
*DCL CSPCNCL  BIT(16) CONSTANT('0004'X); /* CANCEL                   */ 02851000
*/* CONSTANT VALUES FOR RETURN CODES IN CSPCC                        */ 02852000
*DCL CSPGDRC  FIXED(8) CONSTANT(00); /* SUCCESSFUL                   */ 02853000
*DCL CSPINV   FIXED(8) CONSTANT(04); /* INVALID PARAMETERS           */ 02854000
*DCL CSPNOTAE FIXED(8) CONSTANT(08); /* OPERATION NOT AUTHORIZED     */ 02855000
*DCL CSPNOSTG FIXED(8) CONSTANT(12); /* INSUFFICIENT STORAGE         */ 02856000
*DCL CSPBLKLG FIXED(8) CONSTANT(20); /* RESOURCE NOT ACCEPTING LOGONS*/ 02857000
*DCL CSPUNAVL FIXED(8) CONSTANT(28); /* RESOURCE TIED OR UNAVAILABLE */ 02858000
*DCL CSPDUPLI FIXED(8) CONSTANT(32); /* DUPLICATE CONNECTION EXISTS  */ 02859000
*DCL CSPQUSC  FIXED(8) CONSTANT(40); /* RESOURCE IS QUIESCING        */ 02860000
*DCL CSPNOELE FIXED(8) CONSTANT(44); /* CONNECTION ELEMENT NOT FOUND */ 02861000
*DCL CSPNOMCH FIXED(8) CONSTANT(48); /* NO MATCHING LOGON FOUND FOR  */ 02862000
*                                    /* ACCEPT                       */ 02863000
*DCL CSPRLNTO FIXED(8) CONSTANT(52); /* RESOURCE NOT OWNED (RELEASE) */ 02864000
*DCL CSPRLCNC FIXED(8) CONSTANT(56); /*REQUESTS CANCELLED BY CLOSEACB*/ 02865000
*DCL CSPRLLOG FIXED(8) CONSTANT(60); /*INSUFFICIENT STORAGE FOR LOGON*/ 02866000
*                                   /*TO CONTROLLER,FOLLOWING RELEASE*/ 02867000
*DCL CSPPSSTA FIXED(8) CONSTANT(64); /* RESOURCE ALREADY REQUESTED BY*/ 02868000
*                                    /* ANOTHER RESOURCE             */ 02869000
*DCL CSPCLACT FIXED(8) CONSTANT(68); /* REALLOCATION FAILED-RESOURCE */ 02870000
*                                    /* ALREADY ACTIVE OR LOGON ON   */ 02871000
*DCL CSPCLUNW FIXED(8) CONSTANT(72); /* REALLOCATION FAILED-RESOURCE */ 02872000
*                                    /* IS NOT WANTED                */ 02873000
*/*               OPEN / CLOSE WORK ELEMENT                          */ 02874000
*/*                                                                  */ 02875000
*/* REVISIONS                                              03/01/77  */ 02876000
*/*                                                                  */ 02877000
*DECLARE                                                        01S0179 02878000
*       1 ISTOCW  BDY(WORD)     BASED,                          01S0179 02879000
*         2 OCWID      CHAR(1),        /* CONTROL BLOCK IDENTIFIER   */ 02880000
*         2 OCWSLEN    PTR(8),         /* LENGTH OF EACH SAVE AREA   */ 02881000
*         2 OCWTLEN    FIXED(15),      /* TOTAL LENGTH OF WORK  01S0179 02882000
*                                         ELEMENT                    */ 02883000
* /* NOTE:  THE FIELD OCWPBCHN MUST ALWAYS BE THE SECOND WORD OF        02884000
*           ISTOCW                                                   */ 02885000
*         2 OCWPBCHN   PTR(31),        /* PAB CHAIN POINTER          */ 02886000
*         2 OCWCHAIN   PTR(31),        /* PSS CHAIN FIELD            */ 02887000
*         2 OCWRPL     PTR(31),        /* RPL  ADDRESS               */ 02888000
*         2 OCWRPH     PTR(31),        /* RPL HEADER ADDRESS         */ 02889000
*         2 OCWPAB     PTR(31),        /* PAB ADDRESS                */ 02890000
*         2 OCWACVT    PTR(31),        /* ATCVT ADDRESS              */ 02891000
*         2 OCWCSL  CHAR(LENGTH(ISTCSL)) BDY(WORD), /* DUMMY LIST ENT*/ 02892000
*         2  OCWLRDTE PTR(32),                                  01S0179 02893000
*            3  OCWDRDTE PTR(31),      /* DEST RDTE PTR              */ 02894000
*               4  OCWDRHOB BIT(1),    /* ON = DEST SUCCESSFULLY     */ 02895000
*         2 OCWNIB   PTR(31),          /* TEMP NIB PTR               */ 02896000
*         2 OCWARDTE   PTR(31),        /* APPLICATION RDTE ADDRESS   */ 02897000
*         2 OCWEPTAB   PTR(31),        /* EPTAB ADDRESS              */ 02898000
*         2 OCWFMCB    PTR(31),        /* FMCB ADDRESS               */ 02899000
*         2 OCWNCB     PTR(31),        /* DNCB OR INCB ADDRESS       */ 02900000
*         2 OCWACDEB   PTR(31),        /* ACB DEB ADDRESS            */ 02901000
*         2 OCWRSCE    CHAR(8),        /* PASS RESOURCE NAME         */ 02902000
*         2 OCWCPOST   PTR(31),        /* ADDR CURRENT RPH (TPPOSTED)*/ 02903000
*         2 OCWODLST   PTR(31),        /* ADDR OF LIST AREA          */ 02904000
*         2 OCWODNAS   PTR(31),        /* ADDR OF NEXT AVAIL SLOT IN    02905000
*                                          LIST AREA                 */ 02906000
*         2 OCWODFST   PTR(31),        /* ADDR OF FIRST SLOT IN SORT    02907000
*                                          ORDER                     */ 02908000
*         2 OCWODRC  CHAR(2),          /* OPEN RC FOR FDBK           */ 02909000
*            3  OCWRC CHAR(1),          /* MAJOR RETURN CODE         */ 02910000
*            3  OCWEC CHAR(1),          /* MINOR RETURN CODE         */ 02911000
*         2 OCWSVCOD CHAR(2),           /* SAVE AREA                 */ 02912000
*            3  OCWSVRC CHAR(1),        /* FOR MAJOR                 */ 02913000
*            3  OCWSVEC CHAR(1),        /* AND MINOR RC              */ 02914000
*         2 OCWSVCCL CHAR(2),          /* SAVE RC ACROSS CLSDST      */ 02915000
*           3 OCWSVCRC CHAR(1),        /* MAJOR RETURN CODE          */ 02916000
*           3 OCWSVCEC CHAR(1),        /* MINOR RETURN CODE          */ 02917000
*         2 OCWCSID FIXED(16),         /* ID TO CORRELATE CONNECTION    02918000
*                                         SERVICES REQUESTS          */ 02919000
*         2 OCWSVSNS FIXED(32),        /* SAVED SNA SENSE CODE       */ 02920000
*         2 OCWSVCID BIT(32),          /* SAVED CID FOR SESSION      */ 02921000
*         2 OCWDSTNO   FIXED(15),      /* # OF NIBS ON LIST TO BE       02922000
*                                          OPENED                    */ 02923000
*         2 OCWCONNO   FIXED(15),      /* # OF SESSIONS ESTABLISHED  */ 02924000
*         2 OCWDNIB    CHAR(LENGTH(ISTNIB)), /* DUMMY NIB            */ 02925000
*           3 OCWDSPLY CHAR(16),       /* DATA MAINTAINED FOR   01S0179 02926000
*                                          DISPLAY FUNCTION  @D433250*/ 02927000
*             4 OCWJOBNM CHAR(8),      /* APPLICATIONS JOB      01S0179 02928000
*                                          NAME              @D433250*/ 02929000
*             4 OCWSTEPN CHAR(8),      /* APPLICATIONS STEP     01S0179 02930000
*                                          NAME              @D433250*/ 02931000
*         2 OCWSCPAD CHAR(28),         /* SCRATCH PAD                */ 02932000
*         2 OCWSWTA    CHAR(1),        /* FIRST SWITCH BYTE          */ 02933000
*           3 OCWGTLST BIT(1),         /* ON = MORE THAN ONE NIB        02934000
*                                         SPECIFIED ON OPNDST        */ 02935000
*           3 OCWSRT   BIT(1),            /* ON = CALL SRTDELFD      */ 02936000
*           3 OCWNOCON BIT(1),            /* ON = DO NOT CALL CON SER*/ 02937000
*           3 OCWGOCNT BIT(1),            /* ON = CONTINUE COUNT NIB */ 02938000
*           3 OCWSORT  BIT(1),            /* ON = CONT SORT RDTE PTRS*/ 02939000
*           3 OCWGODST BIT(1),            /* ON = CONTINUE ON DODEST    02940000
*                                            SUCCESSFUL PATH         */ 02941000
*           3 OCWODCL  BIT(1),            /* ON = OPNDST1 EXITS TO      02942000
*                                           CLEANUP, OFF, TO OPNDST2 */ 02943000
*           3 OCWNODLT BIT(1),            /* DO NOT DELETE           */ 02944000
*         2 OCWSWTB    CHAR(1),           /* SECOND SWITCH BYTE      */ 02945000
*           3 OCWSESS  BIT(1),            /* SESSION STARTED         */ 02946000
*           3 OCWSNA   BIT(1),            /* SNA SESSION             */ 02947000
*           3 OCWCLOOP BIT(1),            /*  ON = CLEANUP IS IN THE    02948000
*                                             MIDDLE OF PROC ALIST   */ 02949000
*           3 OCWDOPHY BIT(1),            /* ON=SSCP CALLED TO MAKE  */ 02950000
*                                         /* PHYSICAL CONNECTION     */ 02951000
*           3 OCWCOREQ BIT(1),            /* LIST REQUEST            */ 02952000
*           3 OCWOLOCK BIT(1),            /* ON=MUST UNLOCK RDT      */ 02953000
*           3 OCWRECD  BIT(1),            /* RECORD CNTL BLOCKS      */ 02954000
*                                         /* USED           @D434407 */ 02955000
*           3 *        BIT(1),            /* RESERVED       @D434407 */ 02956000
*         2 OCWSWTC    CHAR(1),           /* THIRD SWITCH BYTE       */ 02957000
*           3 OCWSPCLS BIT(1),            /* ON = SPEC CALL TO CLSDST*/ 02958000
*           3 OCWSWTC1 BIT(1),            /* ON = INTERPRET     01S0179 02959000
*                                            ISSUED TPUNLOCK         */ 02960000
*           3 OCWODCLS BIT(1),            /* ON = MUST CALL CLSDST IF   02961000
*                                            OPNDST FAILS            */ 02962000
*           3 OCWCKACE BIT(1),            /* ON = MUST MAKE SURE        02963000
*                                            ACERPHA PTS TO OUR RPH  */ 02964000
*           3 OCWRBH   BIT(1),            /* ON = FOUND REQUIRED BH     02965000
*                                            ID                      */ 02966000
*           3 OCWPBH   BIT(1),            /* ON = FOUND PREFERRED BH    02967000
*                                            ID                      */ 02968000
*           3 OCWPRMTR BIT(1),            /* SAVED VALUE OF FMCPRMTR */ 02969000
*           3 OCWVARY  BIT(1),            /* VARY IS CALLER          */ 02970000
*          2 OCWSWTD   CHAR(1),           /* FOURTH SWITCH BYTE      */ 02971000
*           3 OCWCLDEB BIT(1),            /* ON = CLOSEDEB IN PROG   */ 02972000
*           3 OCWNPOST BIT(1),            /* OPEN/CLOSE UNROUTER:    */ 02973000
*                                         /* 1= DO NOT POST USER     */ 02974000
*           3 OCWSTCTL BIT(1),            /* 1=CLUS SCHEDULED        */ 02975000
*           3 OCWPGDON BIT(1),            /* 1=PURGE ISSUED FOR CLSDST* 02976000
*           3 OCWENSS  BIT(1),            /* END SESSION NCSPL REQ.  */ 02977000
*           3 OCWSWTD5 BIT(1),            /* RESERVED                */ 02978000
*           3 OCWSWTD6 BIT(1),            /* RESERVED                */ 02979000
*           3 OCWSWTD7 BIT(1),            /* RESERVED                */ 02980000
*         2 OCWVPAB   PTR(31),            /* ADDR VARY PAB           */ 02981000
*         2 OCWLUCBA  PTR(31),            /* ADDRESS OF REQUESTING   */ 02982000
*                                         /* APPLICATIONS LUCB       */ 02983000
*         2 OCWNA     FIXED(16),          /* NETWORK ADDRESS OF      */ 02984000
*                                         /* REQUESTING APPLICATION  */ 02985000
*         2 OCWRSVD   CHAR(6),            /* RESERVED                */ 02986000
*         2 OCWCSPL    CHAR(LENGTH(ISTCSP)),  /* CONN SRV PARM LIST  */ 02987000
*/*  USE ISTCSP MAPPING TO ADDRESS THIS SPACE **                     */ 02988000
*/*                                                                  */ 02989000
*/*  REMOTE NETWORK OPERATOR REQUIRES THAT THE OCW SAVE AREAS:       */ 02990000
*/*                          OCWSAVE1                                */ 02991000
*/*                          OCWSAVE2                                */ 02992000
*/*                          OCWSAVE3                                */ 02993000
*/*                          OCWSAVE4                                */ 02994000
*/*                          OCWSAVE5                                */ 02995000
*/*  REMAIN CONTIGUOUS. DEPENDENT MODULES ARE:                       */ 02996000
*/*                          ISTCFCS1                                */ 02997000
*/*                          ISTCFCS2                                */ 02998000
*/*                          ISTCFCRP                                */ 02999000
*/*                          ISTCFCR1                                */ 03000000
*/*                                                                  */ 03001000
*         2 OCWSAVE1 (18) FIXED(31),   /* LEVEL 1 SAVE AREA          */ 03002000
*         2 OCWSAVE2 (18) FIXED(31),   /* LEVEL 2 SAVE AREA          */ 03003000
*         2 OCWSAVE3 (18) FIXED(31),   /* LEVEL 3 SAVE AREA          */ 03004000
*         2 OCWSAVE4 (18) FIXED(31),   /* LEVEL 4 SAVE AREA          */ 03005000
*         2 OCWSAVE5 (18) FIXED(31),   /* LEVEL 5 SAVE AREA          */ 03006000
*         2 OCWR14SV (18) FIXED(31),   /* REG 14 SAVE AREA           */ 03007000
*         2 OCWLCPBA    PTR(31),       /* ADDR OF PREMPT/RESTOR LCPB */ 03008000
*           3 OCWTSCB  PTR(31),        /* PTR TO TSCB       @D434407 */ 03009000
*         2 OCWRUPE     PTR(31),       /* RUPE ADDRESS               */ 03010000
*         2 OCWSDVT     PTR(31),       /* ADDR OF SKELDVT            */ 03011000
*         2 OCWMDVT     PTR(31),       /* ADDR OF MSTR DVT           */ 03012000
*         2 OCWSORTP    PTR(31),       /* ADDR OF SORT ORDER SLOT    */ 03013000
*         2 OCWOENIB    PTR(31),       /* ADDR OF NIB SAVE AREA      */ 03014000
*         2 OCWSDVTA    PTR(31),       /* ADDR OF SKELDVT SAVE AREA  */ 03015000
*         2 OCWLALEN    FIXED(15),     /* LENGTH OF LIST AREA        */ 03016000
*         2 OCWCLCD1    FIXED(15),     /* INTERNAL CODE 1            */ 03017000
*         2 OCWCLCD2    FIXED(15),     /* INTERNAL CODE 2            */ 03018000
*         2 OCWSWTRD    CHAR(1),       /* CONTROL SWITCHS - ISTOCCRD */ 03019000
*           3 OCWSRDVT  BIT(1),           /* ON = LOOP IN DVT SEARCH */ 03020000
*           3 OCWCLEN   BIT(1),           /* ON = LOOP IN COMPLEN    */ 03021000
*           3 OCWCPARE  BIT(1),           /* ON = LOOP IN DVT COMPAR */ 03022000
*           3 OCWEPTLP  BIT(1),           /* ON = LOOP IN EPT        */ 03023000
*           3 OCWDPDVT  BIT(1),           /* ON = DVT STILL DUPLICAT */ 03024000
*           3 OCWSWTR5  BIT(1),           /* RESERVED                */ 03025000
*           3 OCWSWTR6  BIT(1),           /* RESERVED                */ 03026000
*           3 OCWSWTR7  BIT(1),           /* RESERVED                */ 03027000
*         2 OCWSWTE     CHAR(1),          /* FIFTH SWITCH BYTE       */ 03028000
*           3 OCWSKEL   BIT(1),           /* ON = DELETE SKEL DVT    */ 03029000
*           3 OCWLCPBC  BIT(1),           /* ON = LCPB PREEMPT, 01S0179 03030000
*                                            OFF = LCPB RESTORE      */ 03031000
*           3 OCWLKSRL  BIT(1),           /* 1 = LOCKS HAVE BEEN     */ 03032000
*                                         /* RELEASED AND CONNECTION */ 03033000
*                                         /* MUST BE REVERIFIED      */ 03034000
*           3 OCWSWTE3  BIT(1),           /* RESERVED                */ 03035000
*           3 OCWSWTE4  BIT(1),           /* RESERVED                */ 03036000
*           3 OCWSWTE5  BIT(1),           /* RESERVED                */ 03037000
*           3 OCWSWTE6  BIT(1),           /* RESERVED                */ 03038000
*           3 OCWSWTE7  BIT(1),           /* RESERVED                */ 03039000
*         2 OCWCRYPF    CHAR(1),       /* CRYPTO FLAG        @D440500*/ 03040000
*           3 OCWCRYPT  BIT(1),        /* CRYPTO IN SESSION  @D440500*/ 03041000
*           3 OCWCSEL   BIT(1),        /* SELECTIVE CRYPTO   @D440500*/ 03042000
*           3 OCWCTRNP  BIT(1),        /* TRANSPARENT CRYPTO @D440500*/ 03043000
*           3 OCWSPRSS  BIT(1),        /* SUPPRESS CRYPTO - ONLY SET */ 03044000
*                                      /* FOR APPL-APPL, SAME        */ 03045000
*                                      /* DOMAIN             @D440500*/ 03046000
*           3 *         BIT(4),        /* RESERVED           @D440500*/ 03047000
*         2 OCWBHSID    CHAR(1),       /* INPUT BHSET ID             */ 03048000
*         2 OCWIOMAJ    CHAR(1),       /* MAJOR RC FROM FSB          */ 03049000
*         2 OCWIOMIN    CHAR(1),       /* MINOR RC FROM FSB          */ 03050000
*         2 OCWACE      PTR(31),       /* PTR TO ACE                 */ 03051000
*         2 OCWLOCKS    CHAR(1),                                01S0179 03052000
*           3  OCWVLOCK BIT(1),        /* ON = VOC LOCK HELD         */ 03053000
*           3  OCWRLOCK BIT(1),        /* ON = RDT LOCK HELD         */ 03054000
*           3  OCWELOCK BIT(1),        /* ON = ENTRY LOCK HELD       */ 03055000
*           3  OCWCLOCK BIT(1),        /* ON = CID(DAF) LOCK HELD    */ 03056000
*           3  OCWDLOCK BIT(1),        /* ON = DVT LOCK HELD         */ 03057000
*           3  OCWALOCK BIT(1),        /* ON = ACDEB LOCK HELD       */ 03058000
*           3  OCWMLOCK BIT(1),        /* ON = LOCAL MEMORY LOCK HELD*/ 03059000
*           3  OCWRSV82 BIT(1),        /* RESERVED                   */ 03060000
*         2 OCWRSV0A CHAR(1),          /* RESERVED                   */ 03061000
*         2 OCWRULEN FIXED(15),        /* RU LENGTH                  */ 03062000
*         2 OCWCID      FIXED(32),     /* COMMUNICATIONS ID          */ 03063000
*           3  OCWSAF   FIXED(16),     /* SOURCE ADDR FIELD          */ 03064000
*              4 OCWSEC  FIXED(16),    /* SECONDARY LOOKUP           */ 03065000
*           3  OCWDAF   FIXED(16),     /* DESTINATION ADDR FIELD     */ 03066000
*              4 OCWPRIM  FIXED(16),   /* PRIMARY LOOKUP             */ 03067000
*         2 OCWPABCT    FIXED(31),     /* NO. OF ACT DYPABS SCHEDULED*/ 03068000
*         2 OCWCCRPH    PTR(31),       /* WAITING RPH FOR ISTOCCCC   */ 03069000
*         2 OCWPROCD CHAR(LENGTH(ISTPROCD)), /* PROCESSING OPTIONS   */ 03070000
*         2 OCWIOCNT FIXED(32),        /* OUTSTANDING CLSDST         */ 03071000
*                                      /* I/O REQUESTS               */ 03072000
*           3 OCWSCHIO BIT(1),         /* CLSDST I/O SCHED IN PROC   */ 03073000
*         2 OCWODOA     PTR(31),       /* SAVE WD FOR OCCMD AND OCCRD*/ 03074000
*         2 OCWFMCT     PTR(31),       /* COUNT OF FMCBS             */ 03075000
*                                      /* FOR ACTIVE SESSIONS        */ 03076000
*         2 OCWRH       CHAR(3),       /* RH FOR SSCP REQUESTS       */ 03077000
*         2 OCWPACEN    FIXED(8),      /* VPACING - N VALUE          */ 03078000
*         2 OCWELCP     PTR(31),       /* ELCP POINTER               */ 03079000
*         2 OCWBNDRU PTR(31),          /* BIND RU ADDRESS            */ 03080000
*         2 OCWSHPL  CHAR(12),         /* PARM LIST FOR SEARCH       */ 03081000
*                                      /* LOGON MODE ROUTINE         */ 03082000
*           3 OCWSHPLA CHAR(4),        /* RDTE @                     */ 03083000
*           3 OCWSHPLB CHAR(4),        /* SESS PARM FIELD @          */ 03084000
*           3 OCWSHPLC CHAR(4),        /* LOGON MODE NAME @          */ 03085000
*         2 OCWBIND  CHAR(LENGTH(ISTBIND)+9),  /* OCWBIND AREA       */ 03086000
*           3 OCWBINDC CHAR(1),        /* BIND RU REQUEST CODE       */ 03087000
*           3 OCWBINDA CHAR(LENGTH(ISTBIND)),  /* SESSION PARMS      */ 03088000
*           3 OCWBINDD CHAR(8),        /* USER DATA AREA             */ 03089000
*         2 OCWBNDSZ CHAR(2),          /* SIZE OF BIND RU            */ 03090000
*         2 OCWSENSE BIT(32),          /* SENSE INFORMATION          */ 03091000
*         2 OCWFLG1  CHAR(1),          /* OCW FLAGS                  */ 03092000
*           3 OCWEXIT BIT(1),          /* SUBROUTINE EXIT SW.        */ 03093000
*           3 *       BIT(7),          /* RESERVED                   */ 03094000
*                                  /* LENGTH(ISTLIE) DELETED @434407 */ 03095000
*         2 OCWEND CHAR(*);            /* END OF OPEN/CLOSE WORK        03096000
*                                         ELEMENT                    */ 03097000
* DCL OCWTYPE BIT(8) CONSTANT('24'X);  /* OCW TYPE                   */ 03098000
*/*   PROGRAM OPERATOR PARAMETER WORK AREA                          */  03099000
*/*   REVISIONS                                        002 07/31/75 */  03100000
*DCL  1  ISTPOPWA BASED,                                        01S0181 03101000
*        2 *        CHAR(3),          /* RESERVED                   */  03102000
*        2 POPTPOPT BDY(BYTE),        /* OPTIONS FIELD FOR TPMSG USE*/  03103000
*          3 POPSTAT  CHAR(1),        /* FIELD WHERE TPMSG TEST FOR */  03104000
*                                     /* A MSG FOR POA              */  03105000
*          3 POPHDR   CHAR(4),        /* PROGRAM OPERATOR MSG HEADER*/  03106000
*          3 POPDEB   PTR(31),        /* DEB ADDRESS OF PROGRAM     */  03107000
*                                     /* OPERATOR APPLICATION       */  03108000
*        2 POPMSG   CHAR(126),        /* TEMPORARY STORAGE AREA     */  03109000
*                                     /* FOR COMMANDS               */  03110000
*        2 *        CHAR(2),          /* RESERVED                   */  03111000
*        2 POPPLA  (4)FIXED(31),      /* PARM LIST AREA FORTPMSG USE*/  03112000
*        2 POPSAVE (18)FIXED(31),     /* SAVE AREA FOR TPMSG USE    */  03113000
*        2 POPMSGID CHAR(4),          /* STORAGE FOR TPMSG ID       */  03114000
*        2 POPTXPTR PTR(31);          /* POINTER TO BEGINNING OF    */  03115000
*                                     /* COMMAND TEXT               */  03116000
*   GEN(PRINT ON);                                              01S0182 03117000
         PRINT ON                                                       03118000
*                                                               01S0183 03119000
*/* END OF ATBUILD                                                   */ 03120000
*/* ATBUILD (ISTPAB,ISTATCVT,ISTPOIA)                                */ 03121000
*                                                               01S0183 03122000
*   GEN(PRINT OFF);                                             01S0183 03123000
         PRINT OFF                                                      03124000
*/* LOCKWORD FORMAT DSECT                                            */ 03125000
*/*  INITIAL LEVEL                                     001 05/24/74  */ 03126000
*DCL 1 ISTLOK BDY(WORD) BASED,                                  01S0184 03127000
*     2  LOKCT CHAR(1) BDY(WORD),       /* COUNT OF LOCK OWNERS      */ 03128000
*     2  LOKCHN PTR(24),                /* ADDR OF NEXT RPH WAITING     03129000
*                                          ON LOCK                   */ 03130000
*        3  LOKCHNG CHAR(3),            /* CHAIN/FLAGS               */ 03131000
*           4 *        CHAR(2),                                 01S0184 03132000
*           4 *        BIT(8),                                  01S0184 03133000
*             5 *        BIT(6),                                01S0184 03134000
*             5  LOKPRY BIT(1),         /* PRIORITY FLAG, 1 = ON     */ 03135000
*             5  LOKXCL BIT(1);         /* EXCLUSIVE FLAG, 1 = ON    */ 03136000
*DCL LOKXCL1  BIT(32) CONSTANT('00000001'X); /* CONSTANT TO TURN LOKXCL 03137000
*                                          ON                        */ 03138000
*DCL LOKPRY1  BIT(32) CONSTANT('00000002'X); /* CONSTANT TO TURN LOKPRY 03139000
*                                          ON                        */ 03140000
*DCL LOKCHN1  BIT(32) CONSTANT('00FFFFFC'X); /* CONSTANT TO TURN LOKXCL 03141000
*                                          AND LOKPRY OFF            */ 03142000
*DCL LOKCT1   BIT(32) CONSTANT('01000000'X); /* CONSTANT TO MAKE LOKCT  03143000
*                                          = 1                       */ 03144000
*DCL LOKCT255 BIT(32) CONSTANT('FF000000'X); /* CONSTANT TO CHECK FOR   03145000
*                                          MAX LOKCT (255)           */ 03146000
*/* PROCESS ANCHOR BLOCK                                              * 03147000
*/*  REVISIONS                                         004 11/17/75  */ 03148000
*/*  REVISIONS                           DCR 4566.00 10/10/78 @D11AKJY* 03149000
*DCL  1  ISTPAB BDY(DWORD) BASED,                               01S0190 03150000
*       2  PABWQCHN CHAR(8) BDY(DWORD), /* CPS SWAP FIELD FOR NEQ&CHN * 03151000
*        3  PABWEQA PTR(31) BDY(WORD), /* WORK ELEMENT QUEUE ADDRESS  * 03152000
*           4  PABWEQG BIT(1),         /* GATING BIT                  * 03153000
*           4  PABRSV01 BIT(7),        /* RESERVED                    * 03154000
*           4  PABWEQP PTR(24),        /* WKEL PTR                    * 03155000
*        3  PABCHAIN PTR(31) BDY(WORD), /* APS CHAIN                  * 03156000
*           4  PABCHNG BIT(1),         /* GATING BIT                  * 03157000
*           4  PABRESCH BIT(1),        /* RESCHEDULE PAB AT     01S0190 03158000
*                                         TPEXIT                      * 03159000
*           4  PABCDP BIT(1),          /* CLOSE DST/CHANGE IN PROGRESS* 03160000
*           4  PABUNCON BIT(1),        /* UNCONDITIONALLY RESCHEDULE    03161000
*                                         PAB AT TPEXIT               * 03162000
*           4  PABRESET BIT(1),        /* RESET ISSUED ON THIS PAB    * 03163000
*           4  PABRUNNG BIT(1),        /* PAB RUNNING                 * 03164000
*              5  PABQUED  BIT(1),     /* PAB IS QUED ON APT          * 03165000
*           4  PABDELAY BIT(1),        /* DELAY OPTION USED           * 03166000
*           4  PABRSV02 BIT(1),        /* RESERVED                    * 03167000
*           4  PABCHNGP PTR(24),       /* PSS CHAIN PTR               * 03168000
*        2  PABOFFST PTR(8),           /* OFFSET FROM CONTROL BLOCK   * 03169000
*        2  PABDVTA PTR(24),           /* DVT ADDRESS                 * 03170000
*        2  PABRPHFG PTR(31),          /* SCHED FLAGS AND RPH         * 03171000
*           3  PABFLAGS BIT(8),        /* SCHEDULING FLAGS            * 03172000
*              4  PABAPYP BIT(1),      /* APPLICATION IS A USER EXIT  * 03173000
*              4  PABPRIOR BIT(1),     /* IMMEDIATE PRIORITY          * 03174000
*              4  PABXTND  BIT(1),     /* 1=PAB EXTENSION IS PRESENT    03175000
*                                                             @D11AKJY* 03176000
*              4  PABDYNAM BIT(1),     /* DYNAMIC                     * 03177000
*              4  PABSSN BIT(1),       /* SYSTEM SERVICES             * 03178000
*              4  PABERLCK BIT(1),     /* PAB ERROR LOCK FLAG         * 03179000
*                 5  PABERRLK BIT(1),  /* ERROR LOCK                  * 03180000
*                    6  PABERLOK BIT(1), /* ERROR LOCK                * 03181000
*/*    ABNORMAL TO ALLOW VARY COMPARE AND SWAP                        * 03182000
*              4  PABINHBT BIT(1) ABNL,/* 1=INHIBIT TRAFFIC,0=NO      * 03183000
*              4  PABNODQ BIT(1),      /* DO NOT DEQ WORK ELEMENT     * 03184000
*                                      /* NOT USED BY DOS             * 03185000
*           3  PABRPHA PTR(24),        /* RPL HEADER ADDRESS          * 03186000
*        2  PABEND CHAR(*);            /*                     @D11AKJY* 03187000
*DCL 1  PABXTNSN DEF(PABEND),          /* PAB EXTENSION - PRESENT ONLY  03188000
*                                         IF PABXTND=1        @D11AKJY* 03189000
*      2  PABLAST PTR,                 /* PTR TO YOUNGEST ELEMENT ON    03190000
*                                         PAB WKE QUEUE       @D11AKJY* 03191000
*      2  PABLOCK CHAR(LENGTH(ISTLOK)),/* QUEUE LOCK          @D11AKJY* 03192000
*      2  PABNPSSQ PTR,                /* NON-PSS QUE ANCHOR  @D11AKJY* 03193000
*      2  * CHAR(4);                   /* RESERVED --- TO PRESERVE      03194000
*                                         ALIGNMENT           @D11AKJY* 03195000
*/* LENGTH(ISTXPAB) GIVES LENGTH OF EXTENDED PAB              @D11AKJY* 03196000
*DCL ISTXPAB CHAR(LENGTH(ISTPAB)+LENGTH(PABXTNSN)) BASED;       01S0192 03197000
*                                                               01S0192 03198000
*DCL PABWEQG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABWEQG OFF     * 03199000
*    PABWEQG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABWEQG ON      * 03200000
*    PABCHNG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABCHNG OFF     * 03201000
*    PABCHNG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABCHNG ON      * 03202000
*    PABRESC0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PABRESCH OFF    * 03203000
*    PABRESC1 BIT(32) CONSTANT('40000000'X),  /* TURN PABRESCH ON     * 03204000
*    PABCDP0  BIT(32) CONSTANT ('DFFFFFFF'X), /* TURN PABCDP OFF      * 03205000
*    PABCDP1  BIT(32) CONSTANT ('20000000'X), /* TURN PABCDP ON       * 03206000
*    PABERLK0 BIT(32) CONSTANT('FBFFFFFF'X),  /* TURN PABERRLK ON     * 03207000
*    PABERLK1 BIT(32) CONSTANT('04000000'X),  /* TURN PABERRLK OFF    * 03208000
*    PABUNCO0 BIT(32) CONSTANT('EFFFFFFF'X),  /* TURN PABUNCON OFF    * 03209000
*    PABUNCO1 BIT(32) CONSTANT('10000000'X),  /* TURN PABUNCON ON     * 03210000
*    PABPRIR0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PAB PRIOR OFF   * 03211000
*    PABPRIR1 BIT(32) CONSTANT('40000000'X),  /* TURN PAB PRIOR ON    * 03212000
*    PABRST0  BIT(32) CONSTANT('F7FFFFFF'X),  /* TURN PABRESET OFF    * 03213000
*    PABRST1  BIT(32) CONSTANT('08000000'X),  /* TURN PABRESET ON     * 03214000
*    PABDLAY0 BIT(32) CONSTANT('FDFFFFFF'X),  /* TURN PAB DELAY OFF   * 03215000
*    PABDLAY1 BIT(32) CONSTANT('02000000'X);  /* TURN PAB DELAY ON    * 03216000
*/*     DYNAMIC PAB                                                  */ 03217000
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE                */ 03218000
*       2  DYPTYPE CHAR(1),        /* CONTROL BLOCK TYPE CODE        */ 03219000
*       2  DYPLNGTH PTR(8),        /* CONTROL BLOCK LENGTH (BYTES)   */ 03220000
*       2 DYPFLGS CHAR(2),         /* FLAGS                          */ 03221000
*       2 DYPCHAIN PTR(31),        /* CHAIN POINTER                  */ 03222000
*         3 DYPPACTB PTR(31),      /* POINTER TO PACE TABLE          */ 03223000
*       2 DYPTSKID PTR(31),        /* TASKID OR PTR TO PSS TABLES    */ 03224000
*       2 DYPPACMD PTR(31),        /* POINTER TO PACING MODULE       */ 03225000
*         3 DYPOCRPH PTR(31),      /* POINTER TO ISTOCCCC'S RPH DURING  03226000
*                                     ASYCHRONOUS CLSDST PROCESSING  */ 03227000
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF PAB   */ 03228000
*DCL DYTYP BIT(8) CONSTANT('11'X); /* TYPE                           */ 03229000
*/* LENGTH(ISTXDYP) GIVES LENGTH OF EXTENDED DYPAB                   */ 03230000
*/*                                    DCR 4566.00 10/10/78  @D11AKJY*/ 03231000
*DCL ISTXDYP CHAR(LENGTH(ISTDYPAB)+LENGTH(PABXTNSN)) BASED;/*@D11AKJY*/ 03232000
*/* RPL HEADER                                                        * 03233000
*DCL RPHPTR PTR(31) REGISTER(1) RESTRICTED;                     01S0197 03234000
*DCL  1  ISTRPH BDY(WORD) BASED(RPHPTR),                        01S0198 03235000
*        2 RPHCNTL  FIXED(32),         /* CONTROL INFORMATION         * 03236000
*          3 RPHTYPE  CHAR(1),         /* CONTROL BLOCK TYPE          * 03237000
*          3 RPHLNGTH PTR(8),          /* LENGTH IN BYTES             * 03238000
*          3 RPHFLAGS BIT(8),          /* SYSTEM DEPENDENT FLAGS      * 03239000
*            4 RPHOGIND BIT(1),        /* OPEN GATE INDICATOR         * 03240000
*            4 RPHSPGIN BIT(1),        /* SPECIAL GATE OPEN IND.      * 03241000
*            4 RPHAPTYP BIT(1),        /* APS IS A USER EXIT          * 03242000
*            4 RPHSMQ   BIT(1),        /* INDICATOR IF RPH IS TO BE   * 03243000
*                                      /* QUEUED                      * 03244000
*            4 RPHSMTYP BIT(1),        /* REQUEST TYPE IS BUFFER OR   * 03245000
*                                      /* DOUBLE-WORD                 * 03246000
*            4 RPHSMCLR BIT(1),        /* INDICATOR IF BUFFER TO BE   * 03247000
*                                      /* CLEARED                     * 03248000
*            4 RPHMLTCP BIT(1),        /* USED BY LOCAL 3270  SUPPORT * 03249000
*                                      /* WHEN BUILDING MULTIPLE CHAN * 03250000
*                                      /* PROGRAM                     * 03251000
*            4 RPHFSTLC BIT(1),        /* USED BY LOCAL 3270 SUPPORT  * 03252000
*                                      /* TO INDICATE FIRST LCCW      * 03253000
*              5 RPHFNFLG BIT(1),      /* LCCW SET FUNCTION FLAGS     * 03254000
*          3 RPHFLGB BIT(8),           /* SECOND FLAG BYTE            * 03255000
*            4 RPHLOCK  BIT(1),        /* LOCKING OPTION              * 03256000
*            4 RPHBSSP  BIT(1),        /* SYSTEM SERVICES PROGRESS    * 03257000
*            4 RPHFBAPS BIT(1),        /* STG. OBTAINED BY APS        * 03258000
*            4 RPHPGCMP BIT(1),        /* BIT ON INDICATES RESOURCE   * 03259000
*                                      /* MGR HAS COMPLETED UNLOCK    * 03260000
*            4 *        BIT(1),        /* RESERVED                    * 03261000
*            4 RPHRLCRA BIT(1),        /* RPH CAN BE RELEASED         * 03262000
*                                      /* WHEN PURGE COMPLETED        * 03263000
*            4 RPHUWAIT BIT(1),        /* IF ON, INDICATES RPH WAITING* 03264000
*                                      /* FOR USER TASK POST AND      * 03265000
*                                      /* RPHUPSTA = ADDR OF USER PST * 03266000
*            4 RPHABEND BIT(1),        /* USER SCHEDULED ABEND        * 03267000
*        2 RPHRPHA PTR(31),            /* ADDR.OF NEXT RPL HEADER     * 03268000
*          3 RPHGATE BIT(1),           /* GATING FLAG                 * 03269000
*          3 *       BIT(7),           /* RESERVED                    * 03270000
*          3 RPHRPHAP PTR(24),                                  01S0198 03271000
*        2 RPHTSKID PTR(31),           /* TASK IDENTIFICATION         * 03272000
*                                      /* OR ADDR.OF APS TABLE        * 03273000
*          3 *     CHAR(3),            /* RPH TSK ID                  * 03274000
*          3 RPHTIK PTR(8),            /* TIK                         * 03275000
*        2 RPHDVTA PTR(31),            /* ADDR.OF  CURRENT DVT        * 03276000
*        2 RPHRESMA PTR(31) BDY(WORD), /* TPWAIT-POST INFO            * 03277000
*          3 RPHWPFLG CHAR(1),         /* WAIT-POST FLAGS             * 03278000
*            4 RPHRSKEY BIT(4),        /* STORAGE PROTECT KEY TO RESUME 03279000
*                                         PROCESSING                  * 03280000
*            4 RPHWT BIT(1),           /* WAIT BIT                    * 03281000
*            4 RPHPT BIT(1),           /* POST BIT                    * 03282000
*            4 RPHPURGE BIT(1),        /* RPH FLAGGED BY RECOVERY     * 03283000
*                                      /* TO BE PURGED BY PSS         * 03284000
*            4 *     BIT(1),           /* RESERVED                    * 03285000
*          3 RPHRESUM PTR(24),         /* RESUME ADDRRSS              * 03286000
*        2 RPHPABOF PTR(8),            /* OFFSET OF PAB IN CONTROL BLK* 03287000
*        2 RPHMAJCB PTR(24),           /* ADDR.OF MAJOR CONTROL BLOCK * 03288000
*        2 RPHWEA   PTR(31),           /* ADDR.OF WORK ELEMENT        * 03289000
*          3 RPHCSPA PTR(31),          /* ADDR OF ISTCSP              * 03290000
*            4 RPHWEGT BIT(1),         /* GATE FOR WORK ELEMENT PROC. * 03291000
*        2 RPHSRPRM PTR(31),           /* SERVICE ROUTINE PARM.FIELD  * 03292000
*          3 RPHSRP12 FIXED(15),       /* COUNT OF Q'ED SMS REQUESTS  * 03293000
*          3 RPHSRP34 FIXED(15),       /* SIZE OF Q'ED SMS REQUESTS   * 03294000
*        2 RPHCRR PTR(31),             /* ADDR.OF COMPONENT RECOVERY  * 03295000
*                                      /* RECORD                      * 03296000
*        2 RPHPABQA PTR(31),           /* PAB QUEUE ADDRESS           * 03297000
*          3 RPHPABFG CHAR(1),         /* FLAG BYTE CARRIED FROM PAB  * 03298000
*          3 RPHPABQP PTR(24),         /* POINTER TO QUEUE OF PAB'S   * 03299000
*        2 RPHWORK CHAR(64) BDY(WORD), /* 16 WORD WORK AREA           * 03300000
*          3 RPHSAVE1 FIXED(31),       /*                             * 03301000
*            4 RPHSBYTE CHAR(1),       /* 1-BYTE SAVE FIELD           * 03302000
*            4 RPHSBITS BIT(8),        /* SAVE FIELD FOR FLAG BYTE    * 03303000
*              5 RPHSBIT1 BIT(1),      /* 1ST SAVE FIELD              * 03304000
*              5 RPHSBIT2 BIT(1),      /* 2ND SAVE FIELD              * 03305000
*              5 RPHSBIT3 BIT(1),      /* 3RD SAVE FIELD              * 03306000
*              5 RPHSBIT4 BIT(1),      /* 4TH SAVE FIELD              * 03307000
*              5 RPHSBIT5 BIT(1),      /* 5TH SAVE FIELD              * 03308000
*              5 RPHSBIT6 BIT(1),      /* 6TH SAVE FIELD              * 03309000
*              5 RPHSBIT7 BIT(1),      /* 7TH SAVE FIELD              * 03310000
*              5 RPHSBIT8 BIT(1),      /* 8TH SAVE FIELD              * 03311000
*            4 RPHSHALF FIXED(15),     /* HALF WORD SAVE AREA         * 03312000
*          3 RPHSAVE2 FIXED(31),       /*                             * 03313000
*          3 RPHSAVE3 FIXED(31),       /*                             * 03314000
*          3 RPHSAVE4 FIXED(31),       /*                             * 03315000
*          3 RPHSAVE5 FIXED(31),       /*                             * 03316000
*          3 RPHSAVE6 FIXED(31),       /*                             * 03317000
*          3 RPHSAVE7 FIXED(31),       /*                             * 03318000
*          3 RPHSAVE8 FIXED(31),       /*                             * 03319000
*          3 RPHSAVE9 FIXED(31),       /*                             * 03320000
*          3 RPHSAV10 FIXED(31),       /*                             * 03321000
*          3 RPHSAV11 FIXED(31),       /*                             * 03322000
*          3 RPHSAV12 FIXED(31),       /*                             * 03323000
*          3 RPHSAV13 FIXED(31),       /*                             * 03324000
*          3 RPHSAV14 FIXED(31),       /*                             * 03325000
*          3 RPHSAV15 FIXED(31),       /*                             * 03326000
*          3 RPHSAV16 FIXED(31),       /*                             * 03327000
*        2 RPHUPSTA PTR(31);           /* IF RPHUWAIT = ON, CONTAINS  * 03328000
*                                      /* ADDRESS OF USER PST ON WHICH* 03329000
*                                      /* WAITING TASK IS RELYING     * 03330000
*                                      /* ON COMPLETION               * 03331000
* DCL RPTYPE BIT(8) CONSTANT('01'X);   /* TYPE CODE FOR RPH           * 03332000
* DCL RPHWT0 BIT(32) CONSTANT('F7FFFFFF'X);   /* TURN RPHWT OFF */      03333000
* DCL RPHWT1 BIT(32) CONSTANT('08000000'X);   /* TURN RPHWT ON */       03334000
* DCL RPHPT0 BIT(32) CONSTANT('FBFFFFFF'X);   /* TURN RPHPT OFF */      03335000
* DCL RPHPT1 BIT(32) CONSTANT('04000000'X);   /* TURN RPHPT ON */       03336000
* DCL RPHPABQ1 BIT(24) CONSTANT('000000'X); /* TURN RPHPBQ GATE */      03337000
*/********************************************************************/ 03338000
*/*                                                                  */ 03339000
*/*  MACRO-NAME: ISTATCVT                                            */ 03340000
*/*                                                                  */ 03341000
*/*  MACRO-DESCRIPTIVE-NAME: VTAM COMMUNICATIONS VECTOR TABLE        */ 03342000
*/*                          MAPPING MACRO                           */ 03343000
*/*                                                                  */ 03344000
*/*  MACRO-COPYRIGHT: NONE                                           */ 03345000
*/*                                                                  */ 03346000
*/*  MACRO-STATUS: VTAM RELEASE 4.0 - XXXXXX UNIQUE                  */ 03347000
*/*                                                                  */ 03348000
*/*  MACRO-FUNCTION: TO PROVIDE A VTAM PL/S MAPPING FOR THE          */ 03349000
*/*                  VTAM COMMUNICATIONS VECTOR TABLE                */ 03350000
*/*                                                                  */ 03351000
*/*  MACRO-NOTES: AT A MINIMUM, THE FOLLOWING VTAM PROCESSORS        */ 03352000
*/*               MUST BE RECOMPILED WHEN THE SIZE OF THE            */ 03353000
*/*               VTAM CVT CHANGES:                                  */ 03354000
*/*                                                                  */ 03355000
*/*                    XXXXXXXX                                      */ 03356000
*/*                                                                  */ 03357000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 03358000
*/*                                                                  */ 03359000
*/*    REQUIRED-INNER-MAPS: ISTDYPAB ISTPAB   ISTLOK                 */ 03360000
*/*                                                                  */ 03361000
*/*    REQUIRED-BY: NONE                                             */ 03362000
*/*                                                                  */ 03363000
*/*  MACRO-DATE-CREATED: NOTKNOWN                                    */ 03364000
*/*                                                                  */ 03365000
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */ 03366000
*/*        01 - 09/05/77 - FOR SNA4 D4477.03, D4478.01, AND          */ 03367000
*/*                                 D4480.00                 @D14AKMC*/ 03368000
*/*        02 - 10/20/77 - FOR SNA4 D4478.08                 @D14AKMP*/ 03369000
*/*        03 - 01/04/78 - FOR SNA4 D4487.01, D4506.00       @D14AKMC*/ 03370000
*/*        04 - 01/10/78 - FOR SNA4 D4500.00                 @D14AKMC*/ 03371000
*/*        05 - 02/17/78 - FOR SNA4 DM41522                  @D14AKMC*/ 03372000
*/*        06 - 03/16/78 - FOR SNA4 D4487.02                 @D14AKMC*/ 03373000
*/*        07 - 04/06/78 - FOR SNA4 D4517.00                 @D14AKMC*/ 03374000
*/*        08 - 04/11/78 - FOR SNA4 D4517.03                 @D14AKMC*/ 03375000
*/*        09 - 05/11/78 - FOR SNA4 D4536.01,4550.01,4536.00 @D14AKMC*/ 03376000
*/*        10 - 05/18/78 - FOR SNA4 D4527.05                 @D14AKMC*/ 03377000
*/*        11 - 05/23/78 - FOR SNA4 D4536.06                 @D14AKMC*/ 03378000
*/*        12 - 07/12/78 - FOR SNA4 OX21978                  @D14AKMC*/ 03379000
*/*        13 - 07/27/78 - FOR SNA4 D4575.00 AND D4578.00    @D14AKMC*/ 03380000
*/*        14 - 07/31/78 - FOR SNA4 D4572.00                 @D14AKMC*/ 03381000
*/*        15 - 09/08/78 - FOR SNA4 D4602.00                 @D14AKMC*/ 03382000
*/*        16 - 09/18/78 - FOR SNA4 D4587.00                 @D14AKMC*/ 03383000
*/*        17 - 09/28/78 - FOR SNA4 D4610.00 & D4551.00      @G70AKMC*/ 03384000
*/*                                 AND DM42669                      */ 03385000
*/*        18 - 10/12/78 - FOR SNA4 D4566.01                 @D14AKNL*/ 03386000
*/*        19 - 12/21/78 - FOR SNA4 D4554.03                 @G70AKMC*/ 03387000
*/*                                                                  */ 03388000
*/********************************************************************/ 03389000
*DCL ATCLCPTR PTR LOCATION(1032); /* LOCATION OF OS/MVS VTAM CVT     */ 03390000
*                                                               01S0205 03391000
*/*------------------------------------------------------------------*/ 03392000
*/*   S Y S T E M   I N D E P E N D E N T   S E C T I O N            */ 03393000
*/*------------------------------------------------------------------*/ 03394000
*DCL                                                            01S0206 03395000
*  1 ISTATCVT BDY(DWORD) BASED(ATCLCPTR),                       01S0206 03396000
*    2 ATCRPTCH BDY(DWORD),     /* VTAM RELEASE AND PATCH       01S0206 03397000
*                                  AREA ADDRESS              @D14AKMP*/ 03398000
*      3 ATCVTLVL CHAR(4),      /* VTAM RELEASE LEVEL                */ 03399000
*      3 ATCPTCHA PTR,          /* PTR TO VTAM PATCH AREA            */ 03400000
*    2 ATCITFLD BDY(DWORD),     /* VTAM INTERNAL TRACE          01S0206 03401000
*                                  FIELDS                    @D14AKMP*/ 03402000
*      3 ATCITPRM CHAR(4),      /* VIT START PARAMETERS MAPPED BY       03403000
*                                  NCSPLITF                  @G70AKMC*/ 03404000
*      3 ATCITTBL PTR,          /* PTR TO INTERNAL TRACE        01S0206 03405000
*                                  TABLE                     @D34CKMC*/ 03406000
*      3 ATCITCDS CHAR(8) BDY(DWORD), /* CDS FIELD FOR          01S0206 03407000
*                                  INTERNAL TRACE            @D34CKMC*/ 03408000
*        4 ATCITRPH PTR,        /* PTR TO INTERNAL TRACE        01S0206 03409000
*                                  RPH                       @D34CKMC*/ 03410000
*        4 ATCITFLG CHAR(4) BDY(WORD), /* INT TRACE FLAGS    @D34CKMC*/ 03411000
*          5 ATCITCNT FIXED(15),/* INT TRACE USE COUNT       @D34CKMC*/ 03412000
*          5 ATCITRA1 BIT(16),  /* TRACING FLAGS FOR            01S0206 03413000
*                                  INTERNAL TRACE (MUST         01S0206 03414000
*                                  BE IN SAME ORDER AS          01S0206 03415000
*                                  NCSPL FLAGS <NCSITFL1>)   @G70AKMC*/ 03416000
*            6 ATCITAPI BIT(1), /* 1=API TRACE ACTIVE        @D34CKMC*/ 03417000
*            6 ATCITLCK BIT(1), /* 1=LOCKING TRACE ACTIVE    @D34CKMC*/ 03418000
*            6 ATCITPSS BIT(1), /* 1=PSS TRACE ACTIVE        @D34CKMC*/ 03419000
*            6 ATCITSMS BIT(1), /* 1=SMS TRACE ACTIVE        @D34CKMC*/ 03420000
*            6 ATCITPIU BIT(1), /* 1=PIU TRACE ACTIVE        @D436810*/ 03421000
*            6 ATCITMSG BIT(1), /* 1=MSG TRACE ACTIVE        @D436810*/ 03422000
*            6 ATCITSCP BIT(1), /* 1=SSCP TRACE ACTIVE       @D436810*/ 03423000
*            6 * BIT(9),        /* RESERVED FOR TRACING      @G70AKMC*/ 03424000
*    2 ATCITPAB                                                 01S0206 03425000
*       BDY(DWORD)                                              01S0206 03426000
*        CHAR(LENGTH(ISTDYPAB)),/* VTAM INTERNAL TRACE          01S0206 03427000
*                                  DYNAMIC PAB               @D34CKMC*/ 03428000
*    2 ATCTMRPB                                                 01S0206 03429000
*       BDY(DWORD)                                              01S0206 03430000
*        CHAR(LENGTH(ISTDYPAB)),/* VTAM TIMER SERVICES PAB   @D433021*/ 03431000
*    2 ATCSMPAB                                                 01S0206 03432000
*       BDY(DWORD)                                              01S0206 03433000
*        CHAR(LENGTH(ISTDYPAB)),/* SSCP DYNAMIC PAB          @D14AKMC*/ 03434000
*      3 *        CHAR(16),     /* NOT USED - UNAVAILABLE    @D14AKMC*/ 03435000
*      3 ATCCSPAB                                               01S0206 03436000
*         CHAR(LENGTH(ISTPAB)), /* CONFIGURATION SERVICES       01S0206 03437000
*                                  PAB                       @D14AKMP*/ 03438000
*    2 ATCTCIPB                                                 01S0206 03439000
*       BDY(DWORD)                                              01S0206 03440000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS     01S0206 03441000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 03442000
*    2 ATCVDPAB                                                 01S0206 03443000
*       BDY(DWORD)                                              01S0206 03444000
*        CHAR(LENGTH(ISTDYPAB)),/* SSCP COMMAND PROCESSING   @D14AKNL*/ 03445000
*      3 ATCFEPAB CHAR(LENGTH(ISTPAB))                          01S0206 03446000
*         BDY(DWORD),           /* FRONT END ROUTER PAB FOR     01S0206 03447000
*                                  EXTENDED PABS             @D14AKNL*/ 03448000
*      3 *        CHAR(LENGTH(ISTPAB))                          01S0206 03449000
*         BDY(DWORD),           /* SSCP COMMAND PROCESSING      01S0206 03450000
*                                  PAB                       @D14AKNL*/ 03451000
*    2 ATCPOPAB                                                 01S0206 03452000
*       BDY(DWORD)                                              01S0206 03453000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS     01S0206 03454000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 03455000
*    2 ATCPXPAB                                                 01S0206 03456000
*       BDY(DWORD)                                              01S0206 03457000
*        CHAR(LENGTH(ISTDYPAB)),/* DYNAMIC BUFFER POOL          01S0206 03458000
*                                  EXPANSION DYNAMIC PAB             */ 03459000
*    2 ATCPUPAB                                                 01S0206 03460000
*       BDY(DWORD)                                              01S0206 03461000
*        CHAR(LENGTH(ISTDYPAB)),/* PHYSICAL UNIT SERVICES       01S0206 03462000
*                                  DYNAMIC PAB                       */ 03463000
*    2 ATCPUIOP                                                 01S0206 03464000
*       BDY(DWORD)                                              01S0206 03465000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS     01S0206 03466000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 03467000
*    2 ATCLUSRT                                                 01S0206 03468000
*       BDY(DWORD)                                              01S0206 03469000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS     01S0206 03470000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 03471000
*    2 ATCNSPAB                                                 01S0206 03472000
*       BDY(DWORD)                                              01S0206 03473000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS     01S0206 03474000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 03475000
*    2 ATCNOSPB                                                 01S0206 03476000
*       BDY(DWORD)                                              01S0206 03477000
*        CHAR(LENGTH(ISTDYPAB)),                                01S0206 03478000
*                           /* NETWORK OPERATOR SERVICES PAB @D14AKMC*/ 03479000
*    2 ATCLDTIL BDY(DWORD),     /* DUMP/LOAD/RESTART TASK       01S0206 03480000
*                                  INTERFACE LIST            @D14AKMP*/ 03481000
*      3 ATCLDNCS PTR,          /* DUMP/LOAD/RESTART WORK       01S0206 03482000
*                                  QUEUE ANCHOR              @D14AKMP*/ 03483000
*      3 ATCLDLST PTR,          /* PTR TO LAST ELEMENT ON Q. @D14AKMC*/ 03484000
*      3 ATCLDLCK CHAR(LENGTH(ISTLOK)), /* QUEUE LOCK        @D14AKMC*/ 03485000
*      3 ATCLDECB CHAR(4),      /* DUMP/LOAD/RESTART            01S0206 03486000
*                                  SUBTASK ECB                       */ 03487000
*    2 ATCACC00 PTR,            /* PTR TO ACTIVATE(PART-1)      01S0206 03488000
*                                  PROCESSOR -                  01S0206 03489000
*                                  ISTACC00                  @D14AKMC*/ 03490000
*    2 ATCACC01 PTR,            /* PTR TO ACTIVATE(PART-2)      01S0206 03491000
*                                  PROCESSOR -                  01S0206 03492000
*                                  ISTACC01                  @D14AKMC*/ 03493000
*    2 ATCAICTN PTR,            /* PTR TO APPLICATION           01S0206 03494000
*                                  PROGRAM INTERFACE            01S0206 03495000
*                                  (API) TRANSLATION            01S0206 03496000
*                                  PROCESSOR -                  01S0206 03497000
*                                  ISTAICTN                          */ 03498000
*    2 ATCAPI PTR,              /* PTR TO API PROGRAM           01S0206 03499000
*                                  INTERFACE ROUTING            01S0206 03500000
*                                  PROCESSOR -                  01S0206 03501000
*                                  ISTAICIR                          */ 03502000
*    2 ATCAICPT PTR,            /* PTR TO API POSTING           01S0206 03503000
*                                  PROCESSOR -                  01S0206 03504000
*                                  ISTAICPT                          */ 03505000
*    2 ATCAPCR5 PTR,            /* PTR TO CHECKPOINT/RESTART    01S0206 03506000
*                                  ROUTING PROCESSOR -          01S0206 03507000
*                                  ISTAPCR5                          */ 03508000
*    2 ATCAP33 PTR,             /* PTR TO TPUNLOCK              01S0206 03509000
*                                  PROCESSOR -                  01S0206 03510000
*                                  ISTAPC33                          */ 03511000
*    2 ATCAP35 PTR,             /* PTR TO TPLOCK SHARED         01S0206 03512000
*                                  PROCESSOR -                  01S0206 03513000
*                                  ISTAPC35                          */ 03514000
*    2 ATCAP36 PTR,             /* PTR TO TPLOCK EXCLUSIVE      01S0206 03515000
*                                  PROCESSOR -                  01S0206 03516000
*                                  ISTAPC36                          */ 03517000
*    2 ATCAP39 PTR,             /* PTR TO TPUNLOCK ALL          01S0206 03518000
*                                  PROCESSOR -                  01S0206 03519000
*                                  ISTAPC39                          */ 03520000
*    2 ATCACCTA PTR,            /* PTR TO INSTALLATION          01S0206 03521000
*                                  ACCOUNTING ROUTINE -         01S0206 03522000
*                                  ISTAUCAG                          */ 03523000
*    2 ATCAUTHA PTR,            /* PTR TO INSTALLATION          01S0206 03524000
*                                  AUTHORIZATION ROUTINE -      01S0206 03525000
*                                  ISTAUCAT                          */ 03526000
*    2 ATCCPCNT PTR,            /* PTR TO CPNFY                 01S0206 03527000
*                                  PROCESSOR -                  01S0206 03528000
*                                  ISTCPCNT                  @D14AKMC*/ 03529000
*    2 ATCMSGP PTR,             /* PTR TO TPMSG                 01S0206 03530000
*                                  PROCESSOR -                  01S0206 03531000
*                                  ISTCFCTM                          */ 03532000
*    2 ATCCPCPP PTR,            /* PTR TO CPPOST/CPPURGE        01S0206 03533000
*                                  PROCESSOR -                  01S0206 03534000
*                                  ISTCPCPP                  @D14AKMP*/ 03535000
*    2 ATCCPCGR PTR,            /* PTR TO GETRUPE               01S0206 03536000
*                                  PROCESSOR -                  01S0206 03537000
*                                  ISTCPCGR                          */ 03538000
*    2 ATCCPCFR PTR,            /* PTR TO FREERUPE              01S0206 03539000
*                                  PROCESSOR -                  01S0206 03540000
*                                  ISTCPCFR                          */ 03541000
*    2 ATCMSGM PTR,             /* PTR TO TPMSG                 01S0206 03542000
*                                  MESSAGE CSECT -              01S0206 03543000
*                                  ISTCFCMM                  @D14AKMC*/ 03544000
*    2 ATCCPCRT PTR,            /* PTR TO SESSION SERVICES      01S0206 03545000
*                                  ROUTING PROCESSOR -          01S0206 03546000
*                                  ISTCPCRT                          */ 03547000
*    2 ATCDEC00 PTR,            /* PTR TO DEACTIVATE(PART-1)    01S0206 03548000
*                                  PROCESSOR -                  01S0206 03549000
*                                  ISTDEC00                  @D14AKMC*/ 03550000
*    2 ATCDEC01 PTR,            /* PTR TO DEACTIVATE(PART-2)    01S0206 03551000
*                                  PROCESSOR -                  01S0206 03552000
*                                  ISTDEC01                  @D14AKMC*/ 03553000
*    2 ATCESC01 PTR,            /* PTR TO TPESC                 01S0206 03554000
*                                  PROCESSOR -                  01S0206 03555000
*                                  ISTESC01                          */ 03556000
*    2 ATCESC02 PTR,            /* PTR TO TPDVTS                01S0206 03557000
*                                  PROCESSOR -                  01S0206 03558000
*                                  ISTESC02                          */ 03559000
*    2 ATCADEL PTR,             /* PTR TO ADELETE               01S0206 03560000
*                                  PROCESSOR -                  01S0206 03561000
*                                  ISTINCAD                          */ 03562000
*    2 ATCALOAD PTR,            /* PTR TO ALOAD                 01S0206 03563000
*                                  PROCESSOR -                  01S0206 03564000
*                                  ISTINCAL                          */ 03565000
*    2 ATCBLDLA PTR,            /* PTR TO BLDL                  01S0206 03566000
*                                  PROCESSOR -                  01S0206 03567000
*                                  ISTINCBL                          */ 03568000
*    2 ATCINCCO PTR,            /* PTR TO CPCALL OUTBOUND       01S0206 03569000
*                                  PROCESSOR -                  01S0206 03570000
*                                  ISTINCCO                          */ 03571000
*    2 ATCINCCI PTR,            /* PTR TO CPCALL INBOUND        01S0206 03572000
*                                  PROCESSOR -                  01S0206 03573000
*                                  ISTINCCI                          */ 03574000
*    2 ATCINCF1 PTR,            /* PTR TO SEND REQUEST UNIT     01S0206 03575000
*                                  INTERFACE PROCESSOR -        01S0206 03576000
*                                  ISTINCF1                  @D14AKMC*/ 03577000
*    2 ATCNOCRT PTR,            /* PTR TO ISTNOCRT           @D14AKMC*/ 03578000
*    2 ATCINCLQ PTR,            /* PTR TO CPFIND, ALIAS         01S0206 03579000
*                                  RDTADD/FIND/DEL              01S0206 03580000
*                                  PROCESSOR -                  01S0206 03581000
*                                  ISTINCLQ                          */ 03582000
*    2 ATCINCPH PTR,            /* PTR TO INIT/TERM             01S0206 03583000
*                                  KEYWORD SCAN                 01S0206 03584000
*                                  PROCESSOR -                  01S0206 03585000
*                                  ISTINCPH                  @D14AKMC*/ 03586000
*    2 ATCINCRD PTR,            /* PTR TO INIT/TERM CARD        01S0206 03587000
*                                  READ PROCESSOR -             01S0206 03588000
*                                  ISTINCRD                  @D14AKMC*/ 03589000
*    2 ATCSRTAB PTR,            /* PTR TO LOGON MODE TABLE      01S0206 03590000
*                                  SEARCH PROCESSOR -           01S0206 03591000
*                                  ISTINCSH                          */ 03592000
*    2 ATCINCS1 PTR,            /* PTR TO SSCP/PUNS/LUS         01S0206 03593000
*                                  SEND RESPONSE                01S0206 03594000
*                                  PROCESSOR -                  01S0206 03595000
*                                  ISTINCS1                          */ 03596000
*    2 ATCINCTQ PTR,            /* PTR TO TIMER SERVICES        01S0206 03597000
*                                  PROCESSOR -                  01S0206 03598000
*                                  ISTINCTQ                  @D34CKMC*/ 03599000
*    2 ATCINCU6 PTR,            /* PTR TO USS MESSAGE           01S0206 03600000
*                                  BUILD PROCESSOR -            01S0206 03601000
*                                  ISTINCU6                  @D14AKMC*/ 03602000
*    2 ATCINCW3 PTR,            /* PTR TO GETNCSPL/FRENCSPL     01S0206 03603000
*                                  PROCESSOR -                  01S0206 03604000
*                                  ISTINCW3                          */ 03605000
*    2 ATCINCY5 PTR,            /* PTR TO DISCONNECTION         01S0206 03606000
*                                  PROCESSOR -                  01S0206 03607000
*                                  ISTINCY5                  @D14AKMC*/ 03608000
*    2 ATCLUCRT PTR,            /* PTR TO LOGICAL UNIT          01S0206 03609000
*                                  SERVICES ROUTING             01S0206 03610000
*                                  PROCESSOR -                  01S0206 03611000
*                                  ISTLUCRT                          */ 03612000
*    2 ATCSRTDF PTR,            /* PTR TO SRTDEL/FIND           01S0206 03613000
*                                  PROCESSOR -                  01S0206 03614000
*                                  ISTOCCDF                          */ 03615000
*    2 ATCOCCFP PTR,            /* PTR TO FMCBADD/DEL           01S0206 03616000
*                                  PROCESSOR -                  01S0206 03617000
*                                  ISTOCCFP                          */ 03618000
*    2 ATCOCCFS PTR,            /* PTR TO LUCB LIE              01S0206 03619000
*                                  PROCESSOR -                  01S0206 03620000
*                                  ISTOCCFS                  @D14AKMC*/ 03621000
*    2 ATCOCRT PTR,             /* PTR TO OPEN/CLOSE            01S0206 03622000
*                                  ROUTING PROCESSOR -          01S0206 03623000
*                                  ISTOCCRT                          */ 03624000
*    2 ATCSRTAD PTR,            /* PTR TO SRTADD                01S0206 03625000
*                                  PROCESSOR -                  01S0206 03626000
*                                  ISTOCCSA                          */ 03627000
*    2 ATCSTMA PTR,             /* PTR TO STORAGE MANAGEMENT    01S0206 03628000
*                                  INITIALIZATION               01S0206 03629000
*                                  PROCESSOR -                  01S0206 03630000
*                                  ISTORCBP (DOS/VS)            01S0206 03631000
*                                  ISTORFPO (OS/VS )                 */ 03632000
*    2 ATCGTSTR PTR,            /* PTR TO GETSTOR               01S0206 03633000
*                                  PROCESSOR -                  01S0206 03634000
*                                  ISTORCGS (DOS/VS)            01S0206 03635000
*                                  ISTORFSR (OS/VS )                 */ 03636000
*      3 ATCFRSTR PTR,          /* PTR TO FREESTOR              01S0206 03637000
*                                  PROCESSOR -                  01S0206 03638000
*                                  ISTORCGS (DOS/VS)            01S0206 03639000
*                                  ISTORFSR (OS/VS )                 */ 03640000
*    2 ATCORCAF PTR,            /* PTR TO VTALLOC/FREE          01S0206 03641000
*                                  PROCESSOR -                  01S0206 03642000
*                                  ISTORCAF                          */ 03643000
*    2 ATCORCPX PTR,            /* PTR TO SMS BUFFER POOL       01S0206 03644000
*                                  EXPANSION PROCESSOR -        01S0206 03645000
*                                  ISTORCPX                          */ 03646000
*    2 ATCSMRQ PTR,             /* PTR TO REQSTORE              01S0206 03647000
*                                  PROCESSOR -                  01S0206 03648000
*                                  ISTORCRQ (DOS/VS)            01S0206 03649000
*                                  ISTORFBA (OS/VS )                 */ 03650000
*    2 ATCSMRS PTR,             /* PTR TO RELSTORE              01S0206 03651000
*                                  PROCESSOR -                  01S0206 03652000
*                                  ISTORCRT (DOS/VS)            01S0206 03653000
*                                  ISTORFBD (OS/VS )                 */ 03654000
*    2 ATCPUCRT PTR,            /* PTR TO PHYSICAL UNIT         01S0206 03655000
*                                  SERVICES ROUTING             01S0206 03656000
*                                  PROCESSOR -                  01S0206 03657000
*                                  ISTPUCRT                          */ 03658000
*    2 ATCADD PTR,              /* PTR TO ADD QAB               01S0206 03659000
*                                  PROCESSOR -                  01S0206 03660000
*                                  ISTRACAD                          */ 03661000
*    2 ATCRACIO PTR,            /* PTR TO I/O TRACE             01S0206 03662000
*                                  PROCESSOR -                  01S0206 03663000
*                                  ISTRACIO                  @D34CKMC*/ 03664000
*    2 ATCREMOV PTR,            /* PTR TO REMOVE QAB            01S0206 03665000
*                                  PROCESSOR -                  01S0206 03666000
*                                  ISTRACRE                          */ 03667000
*    2 ATCRACTI PTR,            /* PTR TO VTAM INTERNAL         01S0206 03668000
*                                  TRACE INITIALIZATION         01S0206 03669000
*                                  PROCESSOR -                  01S0206 03670000
*                                  ISTRACTI                  @D34CKMC*/ 03671000
*    2 ATCRACTR PTR,            /* PTR TO VTAM INTERNAL         01S0206 03672000
*                                  TRACE PROCESSOR -            01S0206 03673000
*                                  ISTRACTR                  @D34CKMC*/ 03674000
*    2 ATCTCLIM PTR,            /* TOLTEP I/O PAB DVT -         01S0206 03675000
*                                  ISTSC034                          */ 03676000
*    2 ATCCDADD PTR,            /* PTR TO CIDCTL (ADD) AND      01S0206 03677000
*                                  CIDCTL (ADDSNTPT)            01S0206 03678000
*                                  PROCESSOR -                  01S0206 03679000
*                                  ISTSDCCA                          */ 03680000
*    2 ATCCDDEL PTR,            /* PTR TO CIDCTL (DELETE)       01S0206 03681000
*                                  AND CIDCTL (DELSNTPT)        01S0206 03682000
*                                  PROCESSOR -                  01S0206 03683000
*                                  ISTSDCCD                          */ 03684000
*    2 ATCCDFND PTR,            /* PTR TO CIDCTL (FIND) AND     01S0206 03685000
*                                  CIDCTL (ICFIND)              01S0206 03686000
*                                  PROCESSOR -                  01S0206 03687000
*                                  ISTSDCCF                          */ 03688000
*    2 ATCCDFIN PTR,            /* PTR TO CIDCTL (FINISH)       01S0206 03689000
*                                  AND CIDCTL (ICFINISH)        01S0206 03690000
*                                  PROCESSOR -                  01S0206 03691000
*                                  ISTSDCRR                          */ 03692000
*    2 ATCCDFDN PTR,            /* PTR TO CIDCTL (FINDNCB)      01S0206 03693000
*                                  PROCESSOR -                  01S0206 03694000
*                                  ISTSDCCN                          */ 03695000
*    2 ATCCDCCP PTR,            /* PTR TO CIDCTL (PAFIND)       01S0206 03696000
*                                  PROCESSOR -                  01S0206 03697000
*                                  ISTSDCCP                          */ 03698000
*    2 ATCCDCNA PTR,            /* PTR TO CIDCTL (NAADD)        01S0206 03699000
*                                  PROCESSOR -                  01S0206 03700000
*                                  ISTSDCNA                          */ 03701000
*    2 ATCCDCND PTR,            /* PTR TO CIDCTL (NADELETE)     01S0206 03702000
*                                  PROCESSOR -                  01S0206 03703000
*                                  ISTSDCND                          */ 03704000
*    2 ATCCDCNF PTR,            /* PTR TO NETWORK ADDRESS       01S0206 03705000
*                                  FIND PROCESSOR -             01S0206 03706000
*                                  ISTSDCNF                          */ 03707000
*    2 ATCCDCNR PTR,            /* PTR TO FMCB FAST LOOKUP      01S0206 03708000
*                                  TABLE CLEANUP                01S0206 03709000
*                                  PROCESSOR -                  01S0206 03710000
*                                  ISTSDCNR                  @D14AKMC*/ 03711000
*    2 ATCDVLOD PTR,            /* PTR TO DEVICE NAMES          01S0206 03712000
*                                  TABLE -                      01S0206 03713000
*                                  ISTSDCOD                          */ 03714000
*    2 ATCTSVT PTR,             /* PTR TO THE TSC VECTOR        01S0206 03715000
*                                  TABLE -                      01S0206 03716000
*                                  ISTTSCVT                  @D34CKMC*/ 03717000
*    2 ATCTSCCI PTR,            /* PTR TO CHANNEL PROGRAM       01S0206 03718000
*                                  INITIALIZATION -             01S0206 03719000
*                                  ISTTSCCI                  @D34CKMC*/ 03720000
*    2 ATCTSCGR PTR,            /* PTR TO GENERAL RESPONSE      01S0206 03721000
*                                  ROUTINE -                    01S0206 03722000
*                                  ISTTSCGR                  @D34CKMC*/ 03723000
*    2 ATCTSCPR PTR,            /* PTR TO PATH CONTROL          01S0206 03724000
*                                  ROUTER -                     01S0206 03725000
*                                  ISTTSCPR                  @D34CKMC*/ 03726000
*    2 ATCTSCER PTR,            /* PTR TO ENABLED PATH          01S0206 03727000
*                                  CONTROL ROUTER -             01S0206 03728000
*                                  ISTTSCER                  @D34CKMC*/ 03729000
*    2 ATCTSCNS PTR,            /* PTR TO NO SESSION PAB        01S0206 03730000
*                                  PROCESSOR -                  01S0206 03731000
*                                  ISTTSCNS                  @D34CKMC*/ 03732000
*    2 ATCTSCEM PTR,            /* PTR TO ERROR MESSAGE         01S0206 03733000
*                                  PROCESSOR -                  01S0206 03734000
*                                  ISTTSCEM                  @D34CKMC*/ 03735000
*    2 ATCTSCWS PTR,            /* PTR TO COMMUNICATIONS        01S0206 03736000
*                                  CONTROLLER/CLUSTER           01S0206 03737000
*                                  CONTROLLER WRITE             01S0206 03738000
*                                  SCHEDULER -                  01S0206 03739000
*                                  ISTTSCWS                  @D34CKMC*/ 03740000
*    2 ATCTSCCB PTR,            /* PTR TO COMMUNICATIONS        01S0206 03741000
*                                  CONTROLLER/CLUSTER           01S0206 03742000
*                                  CONTROLLER CHANNEL           01S0206 03743000
*                                  PROGRAM BUILDER -            01S0206 03744000
*                                  ISTTSCCB                  @D34CKMC*/ 03745000
*    2 ATCTSCCE PTR,            /* PTR TO COMMUNICATIONS        01S0206 03746000
*                                  CONTROLLER/CLUSTER           01S0206 03747000
*                                  CONTROLLER CHANNEL           01S0206 03748000
*                                  END APPENDAGE -              01S0206 03749000
*                                  ISTTSCCE                  @D34CKMC*/ 03750000
*    2 ATCTSCFV PTR,            /* PTR TO TSC FIXED VECTOR TABLE -      03751000
*                                  ISTTSCFV                  @D14AKMC*/ 03752000
*    2 ATCTSCCF PTR,            /* PTR TO COMMUNICATIONS        01S0206 03753000
*                                  CONTROLLER/CLUSTER           01S0206 03754000
*                                  CONTROLLER UTILITY           01S0206 03755000
*                                  FUNCTION PROCESSOR -         01S0206 03756000
*                                  ISTTSCCF                  @D34CKMC*/ 03757000
*    2 ATCTSCLS PTR,            /* PTR TO LOCAL 3270 WRITE      01S0206 03758000
*                                  SCHEDULER -                  01S0206 03759000
*                                  ISTTSCLS                  @D34CKMC*/ 03760000
*    2 ATCTSCLB PTR,            /* PTR TO LOCAL 3270            01S0206 03761000
*                                  CHANNEL PROGRAM              01S0206 03762000
*                                  BUILDER -                    01S0206 03763000
*                                  ISTTSCLB                  @D34CKMC*/ 03764000
*    2 ATCTSCLE PTR,            /* PTR TO LOCAL 3270            01S0206 03765000
*                                  CHANNEL END APPENDAGE -      01S0206 03766000
*                                  ISTTSCLE                  @D34CKMC*/ 03767000
*    2 ATCTSCLF PTR,            /* PTR TO LOCAL 3270 UTILITY    01S0206 03768000
*                                  FUNCTION PROCESSOR -         01S0206 03769000
*                                  ISTTSCLF                  @D34CKMC*/ 03770000
*    2 ATCVTLOD PTR,            /* PTR TO VTAM LOAD LIST -      01S0206 03771000
*                                  ISTVTLOD                          */ 03772000
*    2 ATCLUDVT BDY(WORD),      /* LUCB PROCESS PAB DVT      @D34CKMC*/ 03773000
*      3 ATCTSCSR PTR,          /* PTR TO INBOUND SESSION       01S0206 03774000
*                                  ROUTER - ISTTSCSR         @D34CKMC*/ 03775000
*      3 ATCTSCCO PTR,          /* PTR TO COMMON SESSION        01S0206 03776000
*                                  CONTROL - ISTTSCCO        @D34CKMC*/ 03777000
*    2 ATCANYDT,                /* RECEIVE ANY DVT                   */ 03778000
*      3 ATCTSCAP PTR,          /* PTR TO RECEIVE ANY           01S0206 03779000
*                                  PROCESSOR -                  01S0206 03780000
*                                  ISTTSCAP                          */ 03781000
*    2 *,                       /* LQABS                     @D14AKMP*/ 03782000
*      3 ATCIOLQB PTR,          /* PTR TO SSCP I/O LQABS     @DM30909*/ 03783000
*      3 ATCLUIOQ PTR,          /* PTR TO LUS I/O LQAB       @D14AKMC*/ 03784000
*      3 ATCLUSMQ PTR,          /* PTR TO SERVICE               01S0206 03785000
*                                  MANAGER LQAB              @D14AKMC*/ 03786000
*      3 ATCMCQAB PTR,          /* PTR TO MISC CMD LQAB      @D14AKMC*/ 03787000
*      3 ATCPULQB PTR,          /* PTR TO PHYSICAL UNIT         01S0206 03788000
*                                  SERVICES LQAB             @D34CKMC*/ 03789000
*    2 ATCEPA PTR,              /* ENTRY POINT PTR TO           01S0206 03790000
*                                  LOADED MODULE                     */ 03791000
*    2 ATCPODVT,                /* PROGRAM OPERATOR             01S0206 03792000
*                                  INTERFACE DVT             @D14AKMP*/ 03793000
*      3 ATCCFCR2 PTR,          /* PTR TO PROGRAM OPERATOR      01S0206 03794000
*                                  INTERFACE ROUTINE -          01S0206 03795000
*                                  ISTCFCR2                  @D14AKMP*/ 03796000
*    2 ATCDWA PTR,              /* PTR TO TSC DISABLED WORK     01S0206 03797000
*                                  AREA (THIS WORK AREA IS      01S0206 03798000
*                                  USABLE ONLY BY PROCESSORS    01S0206 03799000
*                                  WHICH RUN WITH I/O           01S0206 03800000
*                                  INTERRUPTS DISABLED       @D34CKMC*/ 03801000
*    2 ATCTACB PTR,             /* PTR TO TOLTEP ACB                 */ 03802000
*    2 ATCTUBUF PTR,            /* PTR TO BUFFER CHAIN          01S0206 03803000
*                                  FOR TUNING STATISTICS             */ 03804000
*    2 ATCUSSPT PTR,            /* PTR TO DEFAULT USS           01S0206 03805000
*                                  DEFINITION TABLE -           01S0206 03806000
*                                  ISTINCDT                          */ 03807000
*    2 ATCMODTB PTR,            /* PTR TO SYSTEM LOGON          01S0206 03808000
*                                  MODE TABLE -                 01S0206 03809000
*                                  ISTINCLM                          */ 03810000
*    2 ATCTRCPT PTR,            /* PTR TO TRACE PARAMETER       01S0206 03811000
*                                  LIST                              */ 03812000
*    2 ATCTODVT PTR,            /* PTR TO THE TOLTEP DVT        01S0206 03813000
*                                  POINTED TO BY THE 3RD        01S0206 03814000
*                                  WORD OF THE TOLTEP PAB            */ 03815000
*    2 ATCITRT PTR,             /* PTR TO I/O TRACE TABLE            */ 03816000
*    2 ATCNODDS PTR,            /* PTR TO NODELST CHECKPOINT    01S0206 03817000
*                                  WORKAREA                          */ 03818000
*    2 ATCUEP PTR,              /* UECB PAB DUMMY PROCESSOR          */ 03819000
*    2 ATCMNT PTR,              /* PTR TO MAJOR NODE TABLE           */ 03820000
*    2 ATCACDA PTR,             /* PTR TO FIRST ACDEB ON        01S0206 03821000
*                                  ACDEB QUEUE                       */ 03822000
*    2 ATCBPDA PTR,             /* PTR TO BUFFER POOL           01S0206 03823000
*                                  DIRECTORY                         */ 03824000
*    2 ATCDLRPT PTR,            /* PTR TO DUMP/LOAD/RESTART     01S0206 03825000
*                                  WORKAREA                          */ 03826000
*    2 ATCSDVT PTR,             /* PTR TO SKELETON DVT -        01S0206 03827000
*                                  ISTDVCRC                          */ 03828000
*    2 ATCRDT PTR,              /* PTR TO RDT QUEUE ANCHOR      01S0206 03829000
*                                  BLOCK (QAB)                       */ 03830000
*    2 ATCSRT PTR,              /* PTR TO SRT DIRECTORY              */ 03831000
*    2 ATCMODQ PTR,             /* PTR TO MODIFY COMMAND        01S0206 03832000
*                                  OUTPUT QAB                        */ 03833000
*    2 ATCHALTQ PTR,            /* PTR TO HALT COMMAND          01S0206 03834000
*                                  OUTPUT QAB                        */ 03835000
*    2 ATCVARYQ PTR,            /* PTR TO VARY COMMAND          01S0206 03836000
*                                  OUTPUT QAB                        */ 03837000
*    2 ATCDSPLQ PTR,            /* PTR TO DISPLAY COMMAND       01S0206 03838000
*                                  OUTPUT QAB                        */ 03839000
*    2 ATCOCHA PTR,             /* PTR TO OPERATOR              01S0206 03840000
*                                  COMMUNICATIONS               01S0206 03841000
*                                  TABLE HEADER                      */ 03842000
*    2 ATCVPARM PTR,            /* PTR TO VARY PARAMETERS            */ 03843000
*    2 ATCECPRM PTR,            /* PTR TO ERP QAB ECB           01S0206 03844000
*                                  PARAMETERS                        */ 03845000
*    2 ATCHLTMS PTR,            /* PTR TO HALT COMMAND OR       01S0206 03846000
*                                  HALT RETURN MESSAGE               */ 03847000
*    2 ATCSIBQ PTR,             /* PTR TO FIRST SESSION         01S0206 03848000
*                                  INFORMATION BLOCK (SIB)      01S0206 03849000
*                                  ON SIB QUEUE              @D14AKMP*/ 03850000
*    2 ATCRDTH PTR,             /* PTR TO VTAM RDT HEADER            */ 03851000
*    2 ATCCONFT PTR,            /* PTR TO VTAM CONFIG TABLE          */ 03852000
*    2 ATCFDVT PTR,             /* ANCHOR FOR DVT QUEUE FOR     01S0206 03853000
*                                  OPEN/CLOSE PROCESSING             */ 03854000
*    2 ATCFEPT PTR,             /* ANCHOR FOR EPT QUEUE FOR     01S0206 03855000
*                                  OPEN/CLOSE PROCESSING             */ 03856000
*    2 ATCTSBUF FIXED,          /* THE NUMBER OF BYTES THAT     01S0206 03857000
*                                  CAN BE READ OR WRITTEN       01S0206 03858000
*                                  IN A TSC I/O BUFFER       @D34CKMC*/ 03859000
*    2 ATCNOP00                                                 01S0206 03860000
*       CHAR(4)                                                 01S0206 03861000
*        BDY(HWORD),            /* THIS AREA CONTAINS CODE      01S0206 03862000
*                                  FOR A DUMMY BOUNDARY         01S0206 03863000
*                                  FUNCTION -                   01S0206 03864000
*                                  SLR 15,15 SET 0 RC           01S0206 03865000
*                                  BR  14  AND RETURN        @D34CKMC*/ 03866000
*    2 ATCSTAT,                                                 01S0206 03867000
*      3 ATCSTAT1,              /* VTAM STATUS INDICATORS            */ 03868000
*        4  ATCSTART BIT(1),    /* 1=VTAM IS STARTING                */ 03869000
*        4  ATCACTIV BIT(1),    /* 1=VTAM IS ACTIVE                  */ 03870000
*        4  ATCSNHLT BIT(1),    /* 1=VTAM IS SESSION HALTING         */ 03871000
*        4  ATCQKHLT BIT(1),    /* 1=VTAM IS QUICK HALTING           */ 03872000
*        4  ATCNETSL BIT(1),    /* 1=NETSOL EQUALS YES WAS      01S0206 03873000
*                                    SPECIFIED ON COMMAND            */ 03874000
*        4  ATCINHLT BIT(1),    /* 1=VTAM IS INTERNALLY         01S0206 03875000
*                                    QUICK HALTING                   */ 03876000
*        4  ATCMDHLT BIT(1),    /* 1=VTAM COMMAND PROCESS       01S0206 03877000
*                                    HAS HALTED                      */ 03878000
*        4  ATCHIP BIT(1),      /* 1=HALT IN PROGRESS        @D14AKMP*/ 03879000
*      3 * CHAR(1),             /* NOT USED - AVAILABLE      @D14AKMP*/ 03880000
*      3 ATCPOFLG,              /* PROGRAM OPERATOR             01S0206 03881000
*                                  INTERFACE FLAGS                   */ 03882000
*        4 ATCPOUNS BIT(1),     /* 1=PRIMARY PROGRAM            01S0206 03883000
*                                    OPERATOR APPLICATION       01S0206 03884000
*                                    IS AUTHORIZED TO           01S0206 03885000
*                                    RECEIVE UNSOLICITED        01S0206 03886000
*                                    MESSAGES                        */ 03887000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03888000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03889000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03890000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03891000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03892000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03893000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03894000
*      3 ATCSTAT4,              /* VTAM STATUS BYTE-4                */ 03895000
*        4 ATCMTST BIT(1),      /* 1=MODIFY TEST IS IN PROCESS       */ 03896000
*        4 ATCNCSD BIT(1),      /* 1=NETWORK CONFIG SERVICES    01S0206 03897000
*                                    QUIESCED DURING HALT           */  03898000
*        4 ATCPRTAT BIT(1),     /* 1=TRACE PRINT ACTIVE,        01S0206 03899000
*                                  0=TRACE NOT ACTIVE        @DM42669*/ 03900000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03901000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03902000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03903000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03904000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03905000
*    2 ATCBITAN,                /* VTAM FLAG BITS            @D14AKMP*/ 03906000
*      3 * CHAR(1),             /*   NOT USED - AVAILABLE    @D14AKMP*/ 03907000
*      3 ATCFLAG2,              /* FLAG BYTE-2                       */ 03908000
*        4 ATCCDLRA BIT(1),     /* 1=CROSS DOMIAN LINKS ARE     01S0206 03909000
*                                    TO REMAIN ACTIVE                */ 03910000
*        4 ATCTUNAC BIT(1),     /* 1=TUNING STATISTICS IS       01S0206 03911000
*                                    ACTIVE                  @D34CKMC*/ 03912000
*        4 ATCTUNRQ BIT(1),     /* 1=TUNING STATISTICS          01S0206 03913000
*                                    TASK IS ATTACHED        @D34CKMC*/ 03914000
*        4 ATCTUNCL BIT(1),     /* 1=DISPLAY RECORD AT          01S0206 03915000
*                                    CONSOLE                 @D34CKMC*/ 03916000
*        4 ATCCRYPF BIT(1),     /* 1=BOTH VTAM AND SYSTEM       01S0206 03917000
*                                    FEATURE-02 ARE             01S0206 03918000
*                                    INSTALLED               @D34CKMP*/ 03919000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03920000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03921000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 03922000
*      3 * CHAR(1),             /*   NOT USED - AVAILABLE    @D14AKMP*/ 03923000
*      3 * CHAR(1),             /*   NOT USED - AVAILABLE    @D14AKMP*/ 03924000
*    2 ATCONID,                 /* POI HEADERS FOR INIT/TERM         */ 03925000
*      3 ATCSCNID CHAR(2),      /* START POI HEADER                  */ 03926000
*      3 ATCHCNID CHAR(2),      /* HALT POI HEADER                   */ 03927000
*    2 ATCSSCPA                                                 01S0206 03928000
*       FIXED(16) BDY(HWORD),   /* SSCP NETWORK ADDRESS              */ 03929000
*      3 ATCVTMID CHAR(2),      /* HOST MAJOR NODE ID                */ 03930000
*    2 ATCSAF CHAR(2),          /* HOST SUBAREA ADDRESS              */ 03931000
*    2 ATCPUNSA FIXED(16),      /* PUNS NETWORK ADDRESS              */ 03932000
*    2 ATCHOSTA FIXED(15),      /* HOST SUBAREA INPUT                */ 03933000
*    2 ATCTMINV CHAR(2),        /* TIME INTERVAL BETWEEN RECORDS     */ 03934000
*    2 ATCITLIM FIXED(16),      /* INITIATE TERMINATE LIMIT   DA14866*/ 03935000
*    2 ATCVOCLK                                                 01S0206 03936000
*       BDY(WORD)                                               01S0206 03937000
*        CHAR(LENGTH(ISTLOK)),  /* LOCK WORD FOR VOC LOCK            */ 03938000
*    2 ATCRDTLK                                                 01S0206 03939000
*       BDY(WORD)                                               01S0206 03940000
*        CHAR(LENGTH(ISTLOK)),  /* LOCK WORD FOR RDT LOCK            */ 03941000
*    2 ATCVDLOK                                                 01S0206 03942000
*       BDY(WORD)                                               01S0206 03943000
*        CHAR(LENGTH(ISTLOK)),  /* LOCK WORD FOR SSCP           01S0206 03944000
*                                  SERIALIZATION                     */ 03945000
*    2 ATCECMOD                                                 01S0206 03946000
*       CHAR(4) BDY(WORD),      /* ECB FOR MODIFY COMMAND PROCESSOR  */ 03947000
*    2 ATCECHLT                                                 01S0206 03948000
*       CHAR(4) BDY(WORD),      /* ECB FOR HALT COMMAND PROCESSOR    */ 03949000
*    2 ATCECVRY                                                 01S0206 03950000
*       CHAR(4) BDY(WORD),      /* ECB FOR VARY COMMAND PROCESSOR    */ 03951000
*    2 ATCECDSP                                                 01S0206 03952000
*       CHAR(4) BDY(WORD),      /* ECB FOR DISPLAY COMMAND PROCESSOR */ 03953000
*    2 ATCECSES                                                 01S0206 03954000
*       CHAR(4) BDY(WORD),      /* ECB TO HALT SESSION MODE          */ 03955000
*    2 ATCECOPC                                                 01S0206 03956000
*       CHAR(4) BDY(WORD),      /* ECB TO INDICATE OPERATOR     01S0206 03957000
*                                  CONTROL PROCESSING COMPLETE       */ 03958000
*    2 ATCECNET                                                 01S0206 03959000
*       CHAR(4) BDY(WORD),      /* ERP ECB FOR NETWORK CONFIG REQUEST*/ 03960000
*    2 ATCECTLP                                                 01S0206 03961000
*       CHAR(4) BDY(WORD),      /* ECB FOR TOLTEP                    */ 03962000
*    2 ATCACTRM FIXED(15),      /* COUNT OF ACTIVE TERMS             */ 03963000
*    2 ATCCIDM  BIT(16),        /* CID MASK                          */ 03964000
*    2 ATCMSGSP BIT(8),         /* USED FOR MSG SUPPRESSION          */ 03965000
*    2 ATCMAXID FIXED(8),       /* MAXIMUM NUMBER OF SUBAREAS   01S0206 03966000
*                                  IN THE MNT                        */ 03967000
*    2 ATCXRANG FIXED(8),       /* NUMBER OF BITS IN SUBAREA    01S0206 03968000
*                                  PORTION OF NETWORK ADDRESS        */ 03969000
*    2 * CHAR(1),               /* NOT USED - AVAILABLE      @D14AKMP*/ 03970000
*    2 ATCHPGM,                 /* BUFFER INFORMATION FOR       01S0206 03971000
*                                  ISTINCPD                          */ 03972000
*      3 ATCHBFNO FIXED(15),    /* NUMBER OF BUFFERS            01S0206 03973000
*                                  FOR READ CHANNEL PROGRAM          */ 03974000
*      3 ATCHBSIZ FIXED(15),    /* BUFFER SIZE IN BYTES              */ 03975000
*    2 ATCVLCNT                                                 01S0206 03976000
*       CHAR(4) BDY(HWORD),     /* VARY DEVICE ONLINE COUNTS         */ 03977000
*      3 ATCRNCNT FIXED(16),    /* 3704/3705 COUNT                   */ 03978000
*      3 ATCLCLCT FIXED(16),    /* 3270 COUNT                        */ 03979000
*    2 ATCRNO,                  /* REMOTE NETWORK OPERATOR      01S0206 03980000
*                                  INTERFACE AREA                    */ 03981000
*      3 * CHAR(1),             /* NOT USED - UNAVAILABLE            */ 03982000
*      3 ATCPOIA PTR(24),       /* PTR TO PROGRAM OPERATOR      01S0206 03983000
*                                  INTERFACE AREA                    */ 03984000
*    2 ATCNMCTR FIXED(15),      /* COUNT USED FOR GENERATING    01S0206 03985000
*                                  UNIQUE NETWORK NAMES              */ 03986000
*    2 *          CHAR(2),      /* NOT USED - AVAILABLE              */ 03987000
*    2 *,                       /* VTAM SHARED PROCESSOR INFO        */ 03988000
*      3 ATCSHRTN CHAR(8),      /* NAME OF VTAM SHARED PROCESSOR        03989000
*                                  TO BE LOADED                      */ 03990000
*      3 ATCSHRFG BIT(8),       /* ATTRIBUTE FLAGS                   */ 03991000
*        4 ATCLAST BIT(1),      /* 1=THIS IS LAST MODULE             */ 03992000
*      3 * CHAR(7),             /* NOT USED - UNAVAILABLE    @D14AKMP*/ 03993000
*    2 ATCNODEL CHAR(8),        /* START VTAM COMMAND           01S0206 03994000
*                                  (NODELST=PARAMETER)               */ 03995000
*    2 ATCONFIG CHAR(8),        /* START VTAM COMMAND           01S0206 03996000
*                                  (CONFIG=PARAMETER)                */ 03997000
*    2 ATCMROUT CHAR(9),        /* SAVE AREA FOR MESSAGE        01S0206 03998000
*                                  ROUTING INFORMATION               */ 03999000
*    2 * CHAR(3),               /* NOT USED - AVAILABLE      @D14AKMP*/ 04000000
*    2 ATCCFCDR PTR,            /* PTR TO DISPLAY PROCESSOR  @D14AKMC*/ 04001000
*    2 ATCDRULL FIXED(31),      /* DEFAULT RU SIZE FOR LU-LU SESSION    04002000
*                                                            @OZ31096*/ 04003000
*    2 ATCDRUSL FIXED(31),      /* DEFAULT RU SIZE FOR SSCP-LU SESSION  04004000
*                                                            @OZ31096*/ 04005000
*    2 ATCCSMT  PTR,            /* PTR TO CSMI ROUTING TABLE    01S0206 04006000
*                                  (ISTMGC00)                @D14AKMC*/ 04007000
*    2 ATCMACRT PTR,            /* PTR TO MAINTENANCE SERVICES  01S0206 04008000
*                                  LOAD MODULE (ISTMACRT)    @D14AKMC*/ 04009000
*    2 ATCMGCRT PTR,            /* PTR TO MANAGEMENT SERVICES   01S0206 04010000
*                                  LOAD MODULE (ISTMGCRT)    @D14AKMC*/ 04011000
*    2 ATCCPDVT,                /* SSCP/PUS/LUS I/O PAB DVT  @D14AKMC*/ 04012000
*      3 ATCTSCNI PTR,          /* PTR TO NETWORK SERVICESINBOUND       04013000
*                                  PROCESSOR - ISTTSCNI      @D14AKMC*/ 04014000
*      3 ATCINCIP PTR,          /* PTR TO SSCP/PUS/LUS INBOUND  01S0206 04015000
*                                  I/O PROCESSOR - ISTINCIP  @D14AKMC*/ 04016000
*    2 ATCNOSQ  PTR,            /* POINTER TO NETWORK SERVICES LQAB     04017000
*                                                            @D14AKMC*/ 04018000
*    2 ATCUSSVT PTR,            /* UTILITY VECTOR TABLE FOR     01S0206 04019000
*                                  COMMAND PARSING           @D14AKMC*/ 04020000
*    2 ATCSQCDS PTR,            /* POINTER TO SUPPLEMENTAL CPCKST       04021000
*                                  PROCESSOR                 @D14AKMC*/ 04022000
*    2 ATCITQLE PTR,            /* -> LAST ON I.T. QUEUE     @XA21978*/ 04023000
*    2 ATCQLOCK CHAR(LENGTH(ISTLOK)), /* QUEUE LOCK          @XA21978*/ 04024000
*    2 ATCCPCSM PTR,            /* ADDRESS OF ISTCPCSM       @XA21978*/ 04025000
*    2 ATCPAREA PTR,            /* -> POOL ANCHOR BLOCKS     @XA21978*/ 04026000
*    2 ATCSMPMD FIXED ABNL,     /* PACING COUNT              @DA14866*/ 04027000
*    2 ATCSEQNO FIXED,          /* COUNTER OF SESSION SERVICES  01S0206 04028000
*                                  REQUESTS                  @D14AKMC*/ 04029000
*    2 ATCSMSDQ,                /* INITIATE-TERMINATE QUEUE  @D14AKMC*/ 04030000
*      3 *        PTR,          /* PTR TO OLDEST Q. ELEMENT  @D14AKMC*/ 04031000
*      3 *        PTR,          /* PTR TO NEWEST Q. ELEMENT  @D14AKMC*/ 04032000
*      3 *        CHAR(LENGTH(ISTLOK)), /* QUEUE LOCK        @D14AKMC*/ 04033000
*    2 ATCRID BDY(DWORD) ABNL,  /* PROCESS CORRELATOR ID             */ 04034000
*      3 ATCCDRMA FIXED(16),    /* CDRM NETWORK ADDRESS              */ 04035000
*      3 * CHAR(6),             /* BITS 4-51 OF TOD CLOCK            */ 04036000
*    2 ATCCPCFE PTR,            /* PTR TO FRONT END ROUTER   @D14AKNL*/ 04037000
*    2 *        CHAR(60),       /* NOT USED - AVAILABLE      @D14AKNL*/ 04038000
*                                                               01S0206 04039000
*/*------------------------------------------------------------------*/ 04040000
*/*         O S / V S   C O M M O N   S E C T I O N                  */ 04041000
*/*------------------------------------------------------------------*/ 04042000
*    2 * CHAR(0) BDY(DWORD),    /* FORCE DWORD ALIGNMENT     @D14AKMP*/ 04043000
*    2 ATCZPAB2                                                 01S0206 04044000
*       BDY(DWORD)                                              01S0206 04045000
*        CHAR(LENGTH(ISTDYPAB)),/* MESSAGE ROUTER DYNAMIC       01S0206 04046000
*                                  PAB                               */ 04047000
*    2 *                                                        01S0206 04048000
*       BDY(DWORD)                                              01S0206 04049000
*        CHAR(LENGTH(ISTDYPAB)),/* NOT USED - AVAILABLE      @D14AKMC*/ 04050000
*    2 ATCLDAPP                                                 01S0206 04051000
*       BDY(DWORD)                                              01S0206 04052000
*        CHAR(20),              /* LOCAL 3270 APPENDAGE         01S0206 04053000
*                                  VECTOR                            */ 04054000
*      3 ATCCDTID PTR,          /* TASK ID OF VTAM              01S0206 04055000
*                                  (DUMP EOE)                        */ 04056000
*      3 ATCSMFRR PTR,          /* PTR TO SMS FRR               01S0206 04057000
*                                  (DUMMY SIOA)                      */ 04058000
*      3 ATCZLPCI PTR,          /* POINTER TO 3270 PCI       @G70AKMC*/ 04059000
*      3 ATCZLCEA PTR,          /* PTR TO 3270 CHANNEL END      01S0206 04060000
*                                  APPENDAGE                         */ 04061000
*      3 ATCZLAEA PTR,          /* PTR TO 3270 CHANNEL END      01S0206 04062000
*                                  APPENDAGE                         */ 04063000
*    2 * PTR,                   /* NOT USED - AVAILABLE      @D14AKMC*/ 04064000
*    2 ATCSQAFR BDY(DWORD),     /* DOUBLE WORD FOR COMPARE      01S0206 04065000
*                                  DOUBLE AND SWAP (CDS)        01S0206 04066000
*                                  SQA RELEASE                       */ 04067000
*      3 ATCORTBF PTR,          /* ANCHOR FOR TO-BE-FREED       01S0206 04068000
*                                  STORAGE QUEUE                     */ 04069000
*      3 ATCORTCB PTR,          /* PTR TO TCB OF TASK           01S0206 04070000
*                                  OWNING STORAGE QUEUE              */ 04071000
*        4 ATCORSRB PTR,        /* ADDR OF SMS SRB                   */ 04072000
*          5 ATCORQG                                            01S0206 04073000
*             BIT(1) ABNL,      /* SRB GATE FOR SMS                  */ 04074000
*    2 ATCICAPP                                                 01S0206 04075000
*       BDY(WORD)                                               01S0206 04076000
*        CHAR(20),              /* 3705 APPENDAGE VECTOR             */ 04077000
*      3 ATCCDRPH PTR,          /* PTR TO CLOSE DEB RPH         01S0206 04078000
*                                  (DUMMY EOA APP.)                  */ 04079000
*      3 ATCZSIOA PTR,          /* PTR TO 3705 START I/O        01S0206 04080000
*                                  APPENDAGE                         */ 04081000
*      3 ATCZCPCI PTR,          /* PTR TO 3705 PCI APPENDAGE @G70AKMC*/ 04082000
*      3 ATCZCEA PTR,           /* PTR TO 3705 CHANNEL END      01S0206 04083000
*                                  APPENDAGE                         */ 04084000
*      3 ATCZAEA PTR,           /* PTR TO 3705 CHANNEL END      01S0206 04085000
*                                  APPENDAGE                         */ 04086000
*    2 ATCDAPVT                                                 01S0206 04087000
*       BDY(WORD)                                               01S0206 04088000
*        CHAR(24),              /* DUMMY APPENDAGE VECTOR       01S0206 04089000
*                                  TABLE FOR LOAD/DUMMY              */ 04090000
*      3 ATCDEOEA PTR,          /* PTR TO DUMMY END OF          01S0206 04091000
*                                  EXTENT APPENDAGE                  */ 04092000
*      3 ATCDSIOA PTR,          /* PTR TO DUMMY END OF          01S0206 04093000
*                                  SIO APPENDAGE                     */ 04094000
*      3 ATCDPCIA PTR,          /* PTR TO DUMMY PCI             01S0206 04095000
*                                  APPENDAGE                         */ 04096000
*      3 ATCDCEA PTR,           /* PTR TO CHANNEL END           01S0206 04097000
*                                  APPENDAGE                         */ 04098000
*      3 ATCDXCEA PTR,          /* PTR TO ABNORMAL END          01S0206 04099000
*                                  APPENDAGE                         */ 04100000
*      3 ATCDAPDG CHAR(2),      /* DUMMY APPENDAGE                   */ 04101000
*    2 ATCAP11 PTR,             /* PTR TO ISTAPC11                   */ 04102000
*    2 ATCAP12 PTR,             /* PTR TO ISTAPC12                   */ 04103000
*    2 ATCAP31 PTR,             /* PTR TO ISTAPC31                   */ 04104000
*    2 ATCAP32 PTR,             /* PTR TO ISTAPC32                   */ 04105000
*    2 ATCAP34 PTR,             /* PTR TO ISTAPC34                   */ 04106000
*    2 ATCAP37 PTR,             /* PTR TO ISTAPC37                   */ 04107000
*    2 ATCAP38 PTR,             /* PTR TO ISTAPC38                   */ 04108000
*    2 ATCAP51 PTR,             /* PTR TO ISTAPC51                   */ 04109000
*    2 ATCAP52 PTR,             /* PTR TO ISTAPC52                   */ 04110000
*    2 ATCAP53 PTR,             /* PTR TO ISTAPC53                   */ 04111000
*    2 ATCAP54 PTR,             /* PTR TO ISTAPC54                   */ 04112000
*    2 ATCAP57 PTR,             /* PTR TO ISTAPC57                   */ 04113000
*    2 ATCAP58 PTR,             /* PTR TO ISTAPC58                   */ 04114000
*    2 ATCAP61 PTR,             /* PTR TO ISTAPC61                   */ 04115000
*    2 ATCAP63 PTR,             /* PTR TO ISTAPC63                   */ 04116000
*    2 ATCAP64 PTR,             /* PTR TO ISTAPC64                   */ 04117000
*    2 ATCAP65 PTR,             /* PTR TO ISTAPC65                   */ 04118000
*    2 ATCAP67 PTR,             /* PTR TO ISTAP67            @X60CWMC*/ 04119000
*    2 ATCINFDD PTR,            /* PTR TO ISTINFDD                   */ 04120000
*    2 ATCSMBQ PTR,             /* PTR TO QUEUED REQUESTS       01S0206 04121000
*                                  STORAGE MANAGEMENT           01S0206 04122000
*                                  SERVICES PROCESSOR -         01S0206 04123000
*                                  ISTORFBQ                  @D14AKMP*/ 04124000
*    2 ATCORFMG PTR,            /* PTR TO ISTORFMG                   */ 04125000
*    2 ATCORFPX PTR,            /* PTR TO ISTORFPX                   */ 04126000
*    2 ATCORFRL PTR,            /* PTR TO ISTORFRL                   */ 04127000
*    2 ATCCDTCB PTR,            /* PTR TO TCB (DUMMY PCI        01S0206 04128000
*                                  APPENDAGE                 @G70AKMC*/ 04129000
*    2 *        PTR,            /* NOT USED - AVAILABLE      @D14AKMC*/ 04130000
*    2 ATCTSCPC PTR,            /* PTR TO ISTTSCPC           @X60CWMC*/ 04131000
*    2 ATCSRBRT PTR,            /* PTR TO PROCESSOR             01S0206 04132000
*                                  UNDER SRB CONTROL                 */ 04133000
*    2 ATCGSRBQ PTR,            /* READY QUEUE FOR              01S0206 04134000
*                                  GLOBAL SRB BLOCKS                 */ 04135000
*      3 ATCGSRBG BIT(8),       /* READY QUEUE GATE BYTE             */ 04136000
*        4 ATCGSRBF BIT(1),     /* READY QUEUE GATE BIT              */ 04137000
*    2 ATCPRPH PTR,             /* PTR TO PREALLOCATED RPH           */ 04138000
*    2 ATCCMTCB PTR,            /* PTR TO COMMUNICATION         01S0206 04139000
*                                  TASK TCB                          */ 04140000
*    2 ATCICNCB PTR,            /* ANCHOR FOR ICNCB QUEUE            */ 04141000
*    2 ATCPXCRA PTR,            /* PTR TO CRA                        */ 04142000
*    2 ATCZDVTX PTR,            /* PTR TO TRUNK LINE            01S0206 04143000
*                                  DEACTIVATE ROUTINE                */ 04144000
*    2 ATCDMAPP PTR,            /* PTR TO DUMMY APPENDAGE       01S0206 04145000
*                                  ROUTINE FOR ABEND                 */ 04146000
*    2 ATCOROBT PTR,            /* ANCHOR FOR OBTAINED          01S0206 04147000
*                                  STORAGE QUEUE                     */ 04148000
*    2 ATCAIWT PTR,             /* PTR TO BYTE AFTER            01S0206 04149000
*                                  WAIT IN ISTAICCK                  */ 04150000
*    2 ATCTIMER PTR,            /* PTR TO TIMER SUBROUTINE           */ 04151000
*    2 ATCENFLG BIT(8),         /* ENHANCEMENT FLAGS                 */ 04152000
*      3 ATCDLDN BIT(1),        /* 1=DEVICE DEALLOCATION DONE        */ 04153000
*      3 ATCSRDN BIT(1),        /* 1=STORAGE FREEING DONE            */ 04154000
*      3 ATCABEN BIT(1) ABNL,   /* 1=VTAM IS ABNORMALLY TERMINATING  */ 04155000
*      3 ATCOPKL BIT(1) ABNL,   /* 1=OPERATOR IS REMOVING       01S0206 04156000
*                                    FROM THE SYSTEM                 */ 04157000
*      3 ATCSNUF BIT(1) ABNL,   /* 1=RECURSIVE VTAM ABEND       01S0206 04158000
*                                    DURING RESOURCE            01S0206 04159000
*                                    MANAGER OPERATION               */ 04160000
*    2 * CHAR(3),               /* RESERVED - AVAILABLE      @G70AKMC*/ 04161000
*    2 ATCCCOOC PTR,            /* ADDRESS IN ISTINCCO WHEN ABEND       04162000
*                                  OCCURS FOR OPEN/CLOSE ACB @G70AKMC*/ 04163000
*    2 * CHAR(48),              /* NOT USED - AVAILABLE      @X60CWMC*/ 04164000
*/*------------------------------------------------------------------*/ 04165000
*/*         O S / M V S   U N I Q U E   S E C T I O N                */ 04166000
*/*------------------------------------------------------------------*/ 04167000
*    2 *        CHAR(4),        /* RESERVED - AVAILABLE              */ 04168000
*    2 ATCVTBAM CHAR(3),        /* MAY BE NEEDED                     */ 04169000
*    2 *        BIT(8),         /* FLAGS                             */ 04170000
*      3 ATCVTMAB BIT(1) ABNL,  /* 1=CD LINKS ARE TO REMAIN ACTIVE   */ 04171000
*      3 *        BIT(7),       /* RESERVED - AVAILABLE              */ 04172000
*    2 ATCVTFLG BIT(32),                                        01S0206 04173000
*      3 ATCVTACT BIT(1),       /* 1=VTT ACTIVE                      */ 04174000
*      3 *        BIT(31),      /* RESERVED - AVAILABLE              */ 04175000
*    2 ATCHLTCB PTR,            /* ECB FOR HALTING VTAM              */ 04176000
*    2 ATCATA10 PTR,            /* ADDR OF ISTATM10                  */ 04177000
*    2 ATCCACXA PTR,            /* ADDR OF ISTCFCXA                  */ 04178000
*    2 ATCSMARA PTR,            /* ADDR OF ISTORFRA                  */ 04179000
*    2 ATCSMAID PTR,            /* ADDR OF ISTORFID                  */ 04180000
*    2 ATCTPWQA PTR,            /* ANCHOR FOR TPIOS WAIT QUEUE       */ 04181000
*    2 ATCSMAPR PTR,            /* ADDR OF ISTORFPR                  */ 04182000
*    2 ATCSMABF PTR,            /* ADDR OF ISTORFBF                  */ 04183000
*    2 ATCPSTA  PTR,            /* ANCHOR FOR ACTIVE PST QUEUE       */ 04184000
*    2 ATCAPBE  PTR,            /* ADDR OF ISTAICBE                  */ 04185000
*    2 ATCAP23  PTR,            /* ADDR OF ISTAPC23                  */ 04186000
*    2 ATCAPC25 PTR,            /* ADDR OF ISTAPC25                  */ 04187000
*    2 ATCAP41  PTR,            /* ADDR OF ISTAPC41                  */ 04188000
*    2 ATCAP55  PTR,            /* ADDR OF ISTAPC55                  */ 04189000
*    2 ATCAP56  PTR,            /* ADDR OF ISTAPC56                  */ 04190000
*    2 ATCAPC59 PTR,            /* ADDR OF ISTAPC59                  */ 04191000
*    2 ATCAP62  PTR,            /* ADDR OF ISTAPC62                  */ 04192000
*    2 ATCAP66  PTR,            /* ADDR OF ISTAPC66                  */ 04193000
*    2 ATCAP69  PTR,            /* ADDR OF ISTAPM69                  */ 04194000
*    2 ATCAP82  PTR,            /* ADDR OF ISTAPC82                  */ 04195000
*    2 ATCAP83  PTR,            /* ADDR OF ISTAPC83                  */ 04196000
*    2 ATCAP84  PTR,            /* ADDR OF ISTAPC84                  */ 04197000
*    2 ATCAP85  PTR,            /* ADDR OF ISTAPC85                  */ 04198000
*    2 ATCAP86  PTR,            /* ADDR OF ISTAPC86                  */ 04199000
*    2 ATCASCB  PTR,            /* ADDR OF VTAM ASCB                 */ 04200000
*    2 ATCMPLTA PTR,            /* ADDR OF MPST LIST TABLE           */ 04201000
*    2 ATCZR01  PTR,            /* ADDR OF ISTZRM01                  */ 04202000
*    2 ATCTPCP0 PTR,            /* ADDR OF ISTZFSAV                  */ 04203000
*    2 ATCTPCP1 PTR,            /* ADDR OF ISTZ19SV                  */ 04204000
*    2 ATCZFLAG BIT(8),         /* FLAG BYTE                         */ 04205000
*      3 ATCZF001 BIT(1),       /* 1=MDR RECORDING SUSPENDED         */ 04206000
*      3 *        BIT(7),       /* RESERVED - AVAILABLE              */ 04207000
*    2 ATCSTNSM CHAR(1),        /* USED TO DISABLE              01S0206 04208000
*                                  INTERRUPTS                @VS45687*/ 04209000
*    2 ATCSRBCT FIXED(16),      /* COUNT OF PREALLOCATED SRB AREAS   */ 04210000
*    2 ATCCRACT FIXED(16),      /* COUNT OF PREALLOCATED CRA AREAS   */ 04211000
*    2 ATCRPLCT FIXED(16),      /* COUNT OF PREALLOCATED CRPL AREAS  */ 04212000
*    2 ATCPXSRB PTR,            /* ADDR OF SRB FOR SCHED ISTORPFX    */ 04213000
*    2 ATCTPMMI PTR,            /* ADDR OF ISTCFMMI (MSG        01S0206 04214000
*                                  ISSUER FOR SRB MODE PROCESSORS)   */ 04215000
*    2 ATCVIOPM PTR,            /* ADDR OF ISTVIOPM                  */ 04216000
*    2 ATCLUFFD PTR,            /* ADDR OF ISTLUFFD                  */ 04217000
*    2 ATCCRA   CHAR(8) BDY(DWORD), /* AVAILABLE CRA                 */ 04218000
*      3 ATCCRAQ  PTR,          /* QUEUE OF AVAILABLE CRAS           */ 04219000
*      3 ATCCRACN FIXED,        /* COUNTS                            */ 04220000
*        4 ATCCRARC FIXED(16),  /* ENQUEUE COUNT TO ALLOW            */ 04221000
*                               /* MULTIPLE SIMUALTANIOUS            */ 04222000
*                               /* ENQUEUES AND DEQUEUES             */ 04223000
*        4 ATCCRAAC FIXED(16),  /* COUNT OF CRAS ON AVAIL QUEUE      */ 04224000
*    2 ATCSRB   CHAR(8) BDY(DWORD), /* AVAILABLE SRBS                */ 04225000
*      3 ATCSRBQ  PTR,          /* QUE OF AVAILABLE SRBS             */ 04226000
*      3 ATCSRBCN FIXED,        /* COUNTS                            */ 04227000
*        4 ATCSRBRC FIXED(16),  /* ENQUEUE COUNT TO ALLOW       01S0206 04228000
*                                  MULTIPLE SIMUALTANIOUS       01S0206 04229000
*                                  ENQUEUES AND DEQUEUES             */ 04230000
*        4 ATCSRBAC FIXED(16),  /* COUNT OF SRBS ON AVAIL QUEUE      */ 04231000
*    2 ATCCRPL  CHAR(8) BDY(DWORD), /* AVAILABLE CRPLS               */ 04232000
*      3 ATCCRPLQ PTR,          /* QUE OF AVAILABLE CRPLS            */ 04233000
*      3 ATCRPLCN FIXED,        /* COUNTS                            */ 04234000
*        4 ATCRPLRC FIXED(16),  /* ENQUEUE COUNT TO ALLOW       01S0206 04235000
*                                  MULTIPLE SIMUALTANIOUS            */ 04236000
*                               /* ENQUEUES AND DEQUEUES             */ 04237000
*        4 ATCRPLAC FIXED(16),  /* COUNT OF CRPLS ON AVAIL QUEUE     */ 04238000
*    2 ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),              01S0206 04239000
*                               /* PAB FOR VTAM TERM TASK            */ 04240000
*    2 ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),              01S0206 04241000
*                               /* TP MSG PAD FOR MVS                */ 04242000
*    2 ATCMXCSA FIXED(32),      /* MAX. SIZE CSA ALLOWED FOR VTAM       04243000
*                                  X'7FFFFFFF' = NO LIMIT    @D14AKMC*/ 04244000
*    2 ATCCACSA FIXED(32),      /* CURRENT ALLOCATION OF CSA FOR VTAM   04245000
*                                                            @D14AKMC*/ 04246000
*    2 ATCHWCSA FIXED(32),      /* CSA ALLOCATION               01S0206 04247000
*                                  HIGH WATER MARK           @G70AKMC*/ 04248000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 04249000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 04250000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 04251000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 04252000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 04253000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 04254000
*    2  ATCAOS CHAR(0)BDY(WORD);/* MVS ONLY FIELDS                   */ 04255000
*                                                               01S0206 04256000
*/*------------------------------------------------------------------*/ 04257000
*/*   O S / M V S   C O N S T A N T S   S E C T I O N                */ 04258000
*/*------------------------------------------------------------------*/ 04259000
*DCL                                                            01S0207 04260000
*  ATCABEND  BIT(8)CONSTANT('04'X), /* TO INIT ATCABEN               */ 04261000
*  ATCOPKLI  BIT(8)CONSTANT('02'X), /* TO INIT ATCOPKL               */ 04262000
*  ATCSNUFI  BIT(8)CONSTANT('01'X), /* TO INIT ATCSNUF               */ 04263000
*  ATCLVLVT CHAR(4)CONSTANT('VT41');/* TO INIT ATCVTLVL (ISTINCMX)      04264000
*                                                            @DM42230*/ 04265000
*/*   PROGRAM OPERATOR INTERFACE AREA                                */ 04266000
*/*  REVISIONS                                          001 05/28/75 */ 04267000
*DCL  1  ISTPOIA  BDY(WORD) BASED,                              01S0208 04268000
*        2 POICBID  CHAR(1),       /* POI IDENTIFIER                 */ 04269000
*        2 POILNGTH FIXED(8),      /* LENGTH IN BYTES                */ 04270000
*        2 POIRSVD  CHAR(2),       /* RESERVED                       */ 04271000
*        2 POIANCR,                                             01S0208 04272000
*          3 *        CHAR(1),                                  01S0208 04273000
*          3 POIPOCBQ PTR(24),     /* ADDRESS OF POCB QUEUE          */ 04274000
*        2 POIPRANC,                                            01S0208 04275000
*          3 *        CHAR(1),                                  01S0208 04276000
*          3 POIPRIMQ PTR(24);     /* ADDRESS OF PRIMARY POCB        */ 04277000
*DCL POITYPE  BIT(8) CONSTANT('45'X);/* CONTROL BLOCK ID FOR ISTPOIA */ 04278000
*   GEN(PRINT ON);                                              01S0210 04279000
         PRINT ON                                                       04280000
*                                                               01S0211 04281000
*/* END OF ATBUILD                                                   */ 04282000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPOMCB)                                 */ 04283000
*                                                               01S0211 04284000
*   GEN(PRINT OFF);                                             01S0211 04285000
         PRINT OFF                                                      04286000
*/* PREFIX FOR CRR                                                   */ 04287000
*/*                                                                  */ 04288000
*/* RELEASE 1 - JUNE 28, 1973                                        */ 04289000
*/*                                                                  */ 04290000
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */ 04291000
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */ 04292000
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */ 04293000
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/ 04294000
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */ 04295000
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */ 04296000
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */ 04297000
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */ 04298000
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */ 04299000
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION   04300000
*                                          FOR OLD CRR PTR           */ 04301000
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */ 04302000
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER      01S0212 04303000
*                                          DEFINITION OF OLD FRR PTR */ 04304000
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/ 04305000
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */ 04306000
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */ 04307000
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */ 04308000
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */ 04309000
*DCL PFIDTSC BIT(8) CONSTANT('83'X);  /* TSC                @DTSCDCR */ 04310000
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID           01S0217 04311000
*                                          PSS - VS1 AND 2           */ 04312000
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID           01S0218 04313000
*                                          TPIOS VS1 AND 2           */ 04314000
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID           01S0219 04315000
*                                          STORAGE MANAGEMENT DOS    */ 04316000
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */ 04317000
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */ 04318000
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */ 04319000
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */ 04320000
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */ 04321000
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */ 04322000
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID         01S0226 04323000
*                                          TPIOS - DOS               */ 04324000
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID         01S0227 04325000
*                                          CONTROL LAYER             */ 04326000
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID         01S0228 04327000
*                                          PSS - DOS                 */ 04328000
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID         01S0229 04329000
*                                          STORAGE MANAGEMENT        */ 04330000
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO    01S0230 04331000
*                                          PROCESSING (VS2)          */ 04332000
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */ 04333000
*DCL PFCIDCOM BIT(8) CONSTANT('42'X);   /* COMPONENT ID              */ 04334000
*/* CRR FOR COMMAND FACILITIES                                      */  04335000
*/*  REVISIONS                                         001 06/02/75 */  04336000
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */  04337000
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/  04338000
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */  04339000
*                                  /* FACILITIES ENTERED            */  04340000
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */  04341000
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */  04342000
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */  04343000
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */  04344000
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */  04345000
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */  04346000
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */  04347000
*                                  /* FACILITIES RUNNING            */  04348000
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */  04349000
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */  04350000
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */  04351000
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */  04352000
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */  04353000
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */  04354000
*DCL TIDCFCS1 BIT(8) CONSTANT('00'X); /* THREAD ID FOR ISTCFCS1     */  04355000
*DCL TIDCFCR1 BIT(8) CONSTANT('01'X); /* THREAD ID FOR ISTCFCR1     */  04356000
*DCL TIDCFCR2 BIT(8) CONSTANT('02'X); /* THREAD ID FOR ISTCFCR2     */  04357000
*/*   COMPONENT RECOVERY RECORD                                      */ 04358000
*/*                                                                  */ 04359000
*/*  NETWORKING                                        005 03/03/76  */ 04360000
*/*                                                                  */ 04361000
*DECLARE                                                        01S0237 04362000
* 1 ISTDCCRR BDY(WORD) BASED,                                   01S0237 04363000
*  2 CRRCRR CHAR(4),         /*CONTROL BLOCK ID AND LENGTH + 2 BYTES */ 04364000
*  2 CRRRSV22 CHAR(8),       /* RESERVED                             */ 04365000
*  2 CRRSPACE CHAR(*);       /* BASE FOR SAVE AREA (CRRSAREA)        */ 04366000
* DECLARE                                                       01S0238 04367000
* 1 CRRSAREA BASED (ADDR(CRRSPACE)), /* SAVE AREA AND WORKING STORAGE*/ 04368000
*  2 CRRSAVE CHAR(72),       /*SAVEAREA FOR CALLS EXTERNAL TO CONTROL   04369000
*                              LAYER                                 */ 04370000
*  2 CRRSAVE1 CHAR(72),      /*72 BYTE SAVE AREA FOR MOVE RTN        */ 04371000
*  2 CRRFSB PTR(31),         /*POINTER TO FSB                        */ 04372000
*  2 CRRMAS CHAR(8),         /*MODULE AUDIT SW FOR CONTROL LAYER     */ 04373000
*   3 CRRMAS1 CHAR(1),       /*MODULE AUDIT SWITCH                   */ 04374000
*    4 CRRM00 BIT(1),        /*ISTDCC01 - START1                     */ 04375000
*    4 CRRM01 BIT(1),        /*RESERVED                              */ 04376000
*    4 CRRM02 BIT(1),        /*ISTDCC02 - REQUEST FINISH             */ 04377000
*    4 CRRM10 BIT(1),        /*ISTDCC10 - SOLICIT LDO                */ 04378000
*    4 CRRM11 BIT(1),        /*ISTDCC11 - READ LDO                   */ 04379000
*    4 CRRM12 BIT(1),        /*ISTDCC12 - WRITE LDO                  */ 04380000
*    4 CRRM13 BIT(1),        /*ISTDCC13 - RESET LDO                  */ 04381000
*    4 CRRM20 BIT(1),        /*ISTDCC20 - SOLICIT MACRO PROCESSOR    */ 04382000
*   3 CRRMAS2 CHAR(1),       /*MODULE AUDIT SWITCH                   */ 04383000
*    4 CRRM21 BIT(1),        /*ISTDCC21 - READ MACRO PROCESSOR       */ 04384000
*    4 CRRM22 BIT(1),        /*ISTDCC22 - WRITE MACRO PROCESSOR      */ 04385000
*    4 CRRM23 BIT(1),        /*ISTDCC23 - RESET MACRO PROCESSOR      */ 04386000
*    4 CRRM24 BIT(1),        /*ISTDCC24 - SOLICIT ALL MACRO PROCESSOR*/ 04387000
*    4 CRRM25 BIT(1),        /*ISTDCC25 - READ ANY MACRO PROCESSOR   */ 04388000
*    4 CRRM30 BIT (1),       /*ISTDCC30 - FEEDBACK START             */ 04389000
*    4 CRRM31 BIT(1),        /*ISTDCC31 - ANALYZER                   */ 04390000
*    4 CRRM32 BIT(1),        /*ISTDCC32 - FEEDBACK FINISH            */ 04391000
*   3 CRRMAS3 CHAR(1),       /*MODULE AUDIT SWITCH                   */ 04392000
*    4 CRRM40 BIT(1),        /*ISTDCC40 - SOLICIT/READ LDO FDBK      */ 04393000
*    4 CRRM41 BIT(1),        /*ISTDCC41 = WRITE LDO FDBK             */ 04394000
*    4 CRRM42 BIT(1),        /*ISTDCC42- RESET LDO FDBK              */ 04395000
*    4 CRRM50 BIT(1),        /*ISTDCC50 SOLICIT/READ/WRITE/MACRO FDBK*/ 04396000
*    4 CRRM51 BIT(1),        /*ISTDCC51 - RESET MACRO FDBK           */ 04397000
*    4 CRRM75 BIT(1),        /*ISTDCC75 - FUNCT'NL RECOVERY RTN      */ 04398000
*    4 CRRM80 BIT(1),        /*ISTDCC80 - PURGE OUTBOUND             */ 04399000
*    4 CRRM81 BIT(1),        /*ISTDCC81 - PURGE INBOUND              */ 04400000
*   3 CRRMAS4 CHAR(1),       /* AUDIT TRAIL SWITCH                   */ 04401000
*    4 CRRM60 BIT(1),        /*ISTDCC60 - INPUT BUFFER MOVE          */ 04402000
*    4 CRRM61 BIT(1),        /*ISTDCC61 - MOVE FIXED TO PAGEABLE     */ 04403000
*    4 CRRM82 BIT(1),        /*ISTDCC82 - PREEMPT/RESTORE OUTBOUND   */ 04404000
*    4 CRRM83 BIT(1),        /*ISTDCC83 - PREEMPT/RESTORE INBOUND    */ 04405000
*    4 CRRM85 BIT(1),        /*ISTDCC85                              */ 04406000
*    4 CRRM3X BIT(1),        /*MODULE AUDIT SWITCH FOR ISTDCC3X      */ 04407000
*                            /* (ISTDCC35)                           */ 04408000
*    4 *      BIT(2),        /*RESERVED                              */ 04409000
*   3 CRRRMAS1 CHAR(1),      /*1ST. MODULE AUDIT BYTE                */ 04410000
*    4 CRRRM21  BIT(1),      /*RECEIVE OUTBOUND                      */ 04411000
*    4 CRRRM22  BIT(1),      /*SEND OUTBOUND                         */ 04412000
*    4 CRRRM23  BIT(1),      /*RESETSR OUTBOUND                      */ 04413000
*    4 CRRRM26  BIT(1),      /*SEND RESP                             */ 04414000
*    4 CRRRM30  BIT(1),      /*RECORD FEEDBACK START                 */ 04415000
*    4 CRRRM51  BIT(1),      /*RECORD INBOUND ROUTER                 */ 04416000
*    4 CRRRM52  BIT(1),      /*SYNCH FEEDBACK                        */ 04417000
*    4 CRRRM53  BIT(1),      /*SEND FEEDBACK                         */ 04418000
*   3 CRRRMAS2 CHAR(1),      /*2ND. MODULE AUDIT BYTE                */ 04419000
*    4 CRRRM54  BIT(1),      /*ASYNCH FEEDBACK                       */ 04420000
*    4 CRRRM55  BIT(1),      /*RESETSR FEEDBACK                      */ 04421000
*    4 CRRRM63  BIT(1),      /*HSKPANYQ                              */ 04422000
*    4 CRRRM65  BIT(1),      /*SETRQL                                */ 04423000
*    4 CRRRM80  BIT(1),      /*CLEAR OUTBOUND                        */ 04424000
*    4 CRRRM81  BIT(1),      /*CLEAR INBOUND                         */ 04425000
*    4 *        BIT(2),      /*RESERVED                              */ 04426000
*   3 CRRRMAS3 CHAR(1),      /*SESSION CONTROL MODULE AUDIT SWITCHES */ 04427000
*     4 CRRSMAS  CHAR(1),    /* ALIAS                                */ 04428000
*       5 CRRMSC01 BIT(1),   /* ISTSEC01                             */ 04429000
*       5 CRRMSC10 BIT(1),   /* ISTSEC10                             */ 04430000
*       5 CRRMSC21 BIT(1),   /* ISTSEC21                             */ 04431000
*       5 CRRMSC30 BIT(1),   /* ISTSEC30                             */ 04432000
*       5 CRRMSC40 BIT(1),   /* ISTSEC40                             */ 04433000
*       5 CRRMSC51 BIT(1),   /* ISTSEC51                             */ 04434000
*       5 CRRMSC11 BIT(1),   /* ISTSEC11                             */ 04435000
*       5 CRRMSC31 BIT(1),   /* ISTSEC31                             */ 04436000
*   3 CRRRMAS4 CHAR(1),      /*RESERVED                              */ 04437000
*  2 CRRATS CHAR(8),         /*AUDIT TRAIL SW FOR CONTROL LAYER      */ 04438000
*   3 CRRATS1 CHAR(1),       /*AUDIT TRAIL SWITCH                    */ 04439000
*    4 CRRC00 BIT(1),        /*ISTDCC00-START1                       */ 04440000
*    4 CRRC01 BIT(1),        /*RESERVED                              */ 04441000
*    4 CRRC02 BIT(1),        /*ISTDCC02 - REQUEST PROCESSOR FINISH   */ 04442000
*    4 CRRC10 BIT(1),        /*ISTDCC10 - SOLICIT LDO PROCESSOR      */ 04443000
*    4 CRRC11 BIT(1),        /*ISTDCC11 - READ LDO PROCESSOR         */ 04444000
*    4 CRRC12 BIT(1),        /*ISTDCC12 - WRITE LDO PROCESSOR        */ 04445000
*    4 CRRC13 BIT(1),        /*ISTDCC13 - RESET LDO PROCESSOR        */ 04446000
*    4 CRRC20 BIT(1),        /*ISTDCC20 - SOLICIT MACRO PROCESSOR    */ 04447000
*   3 CRRATS2 CHAR(1),       /*AUDIT TRAIL SWITCH                    */ 04448000
*    4 CRRC21 BIT(1),        /*ISTDCC21 - READ MACRO PROCESSOR       */ 04449000
*    4 CRRC22 BIT(1),        /*ISTDCC22 - WRITE MACRO PROCESSOR      */ 04450000
*    4 CRRC23 BIT(1),        /*ISTDCC23 - RESET MACRO PROCESSOR      */ 04451000
*    4 CRRC24 BIT(1),        /*ISTDCC24 - SOLICIT ALL                */ 04452000
*    4 CRRC25 BIT(1),        /*ISTDCC25 - READ ANY                   */ 04453000
*    4 CRRC30 BIT(1),        /*ISTDCC30 - FDBK PROCESSOR START       */ 04454000
*    4 CRRC31 BIT(1),        /*ISTDCC31 - ANALYZER                   */ 04455000
*    4 CRRC32 BIT(1),        /*ISTDCC32 - FDBK PROCESSOR FINISH      */ 04456000
*   3 CRRATS3 CHAR(1),       /*AUDIT TRAIL SWITCH                    */ 04457000
*    4 CRRC40 BIT(1),        /*ISTDCC40 - FDBK SOLICIT READ LDO      */ 04458000
*    4 CRRC41 BIT(1),        /*ISTDCC41 - FDBK WRITE LDO             */ 04459000
*    4 CRRC42 BIT(1),        /*ISTDCC42 - FDBK RESET DLO             */ 04460000
*    4 CRRC50 BIT(1),        /*ISTDCC50 - SOL/READ/WRITE MACRO FDBK  */ 04461000
*    4 CRRC51 BIT(1),        /*ISTDCC51 - RESET MACRO FDBK.          */ 04462000
*    4 CRRC75 BIT(1),        /*ISTDCC75 - FUNCTIONAL RECOVERY        */ 04463000
*    4 CRRC80 BIT(1),        /*ISTDCC80 - PURGE OUTBOUND             */ 04464000
*    4 CRRC81 BIT(1),        /*ISTDCC81 - PURGE INBOUND              */ 04465000
*   3 CRRATS4 CHAR(1),       /*AUDIT TRAIL SWITCH                    */ 04466000
*    4 CRRC60 BIT(1),        /*ISTDCC60 - INPUT BUFFER MOVE          */ 04467000
*    4 CRRC61 BIT(1),        /*ISTDCC61 - MOVE FIXED TO PAGEABLE     */ 04468000
*    4 CRRC82 BIT(1),        /*ISTDCC82 - PREEMPT/RESTORE OUTBOUND   */ 04469000
*    4 CRRC83 BIT(1),        /*ISTDCC83 - PREEMPT/RESTORE INBOUND    */ 04470000
*    4 CRRC85 BIT(1),        /*ISTDCC85                              */ 04471000
*    4 CRRC3X BIT(1),        /*AUDIT TRAIL SWITCH FOR ISTDCC3X       */ 04472000
*                            /*  (ISTDCC35)                          */ 04473000
*    4 *      BIT(2),        /*RESERVED                              */ 04474000
*   3 CRRRATS1 CHAR(1),      /*1ST. BYTE SWITCHES                    */ 04475000
*    4 CRRRC21  BIT(1),      /*RECEIVE OUTBOUND                      */ 04476000
*    4 CRRRC22  BIT(1),      /*SEND OUTBOUND                         */ 04477000
*    4 CRRRC23  BIT(1),      /*RESETSR OUTBOUND                      */ 04478000
*    4 CRRRC26  BIT(1),      /*SEND RESP                             */ 04479000
*    4 CRRRC30  BIT(1),      /*RECORD FEEDBACK START                 */ 04480000
*    4 CRRRC51  BIT(1),      /*RECORD INBOUND ROUTER                 */ 04481000
*    4 CRRRC52  BIT(1),      /*SYNCH FEEDBACK                        */ 04482000
*    4 CRRRC53  BIT(1),      /*SEND FEEDBACK                         */ 04483000
*   3 CRRRATS2 CHAR(1),      /*2ND. BYTE SWITCHES                    */ 04484000
*    4 CRRRC54  BIT(1),      /*ASYNCH FEEDBACK                       */ 04485000
*    4 CRRRC55  BIT(1),      /*RESETSR FEEDBACK                      */ 04486000
*    4 CRRRC63  BIT(1),      /*HSKPANYQ                              */ 04487000
*    4 CRRRC65  BIT(1),      /*SETRPL                                */ 04488000
*    4 CRRRC80  BIT(1),      /*CLEAR OUTBOUND                        */ 04489000
*    4 CRRRC81  BIT(1),      /*CLEAR INBOUND                         */ 04490000
*    4 CRRPLIC  BIT(1),      /* ON=PURGING LAST FSB IN CHAIN         */ 04491000
*    4 CRRSCBND BIT(1),      /*SESSION CONTROL INBOUND REQUEST BIND  */ 04492000
*   3 CRRRATS3 CHAR(1),      /* SC AUDIT TRAIL SWITCHES              */ 04493000
*    4 CRRSATS  CHAR(1),     /* ALIAS                                */ 04494000
*     5 CRRASC01 BIT(1),     /* ISTSEC01                             */ 04495000
*     5 CRRASC10 BIT(1),     /* ISTSEC10                             */ 04496000
*     5 CRRASC21 BIT(1),     /* ISTSEC21                             */ 04497000
*     5 CRRASC30 BIT(1),     /* ISTSEC30                             */ 04498000
*     5 CRRASC40 BIT(1),     /* ISTSEC40                             */ 04499000
*     5 CRRASC51 BIT(1),     /* ISTSEC51                             */ 04500000
*     5 CRRASC11 BIT(1),     /* ISTSEC11                             */ 04501000
*     5 CRRASC31 BIT(1),     /* ISTSEC31                             */ 04502000
*   3 CRRRATS4 CHAR(1),      /* RESERVED                             */ 04503000
*  2 CRRFLGS1 CHAR(1),       /* FLAG BYTE                            */ 04504000
*   3 CRRDOCUR BIT(1),       /*READ HAS OCCURRED FLAG                */ 04505000
*   3 CRRFLDOS BIT(1),       /*FIRST LDO SWITCH                      */ 04506000
*   3 CRRINIO BIT(1),        /*INITIATE I/O FLAG                     */ 04507000
*   3 CRRPREIO BIT(1),       /*AWAITING PREVIOUS I/O FLAG            */ 04508000
*   3 CRRFINI BIT(1),        /*GO TO FINISH RTN SWITCH               */ 04509000
*   3 CRRCPROC BIT(1),       /*CONTINUE PROCESSING FMCB              */ 04510000
*   3 CRRREQP BIT(1),        /*REQUEST PROCESSING                    */ 04511000
*   3 CRRSOLRQ BIT(1),       /*SOLICIT REQUEST FLAG                  */ 04512000
*  2 CRRFLGS2 CHAR(1),       /*FLAG BYTE                             */ 04513000
*   3 CRRDEXP BIT(1),        /*DATA EXPECTED FLAG FOR FMCB           */ 04514000
*   3 CRRPRGIP  BIT(1),      /*PURGE IN PROGRESS                     */ 04515000
*   3 CRRENDLW BIT(1),       /*END OF LCCW'S FLAG                    */ 04516000
*   3 CRRPOST BIT(1),        /*DO 'POSTING' FLAG                     */ 04517000
*   3 CRRELSRI BIT(1),       /*ERROR LOCK SET, RESET WAS ISSUED      */ 04518000
*   3 CRREXTS  BIT(1),       /*EXIT SCHEDULED                        */ 04519000
*   3 CRRDPROC BIT(1),       /*INDICATE INPUT DATA SHOULD            */ 04520000
*                            /*BE PROCESSED                          */ 04521000
*   3 CRRDFSB BIT(1),        /*FSB/FDB SHOULD BE DEQUEUED            */ 04522000
*  2 CRRFLGS3 CHAR(1),       /* FLAG BYTE                            */ 04523000
*   3 CRRDFDBK BIT(1),       /*FDBK START HAS TO BE INVOKED          */ 04524000
*   3 CRRDREQ BIT(1),        /*FDBK START HAS TO BE INVOKED          */ 04525000
*   3 CRRSTSPR BIT(1),       /* SATISFY SPECIFIC READ                */ 04526000
*   3 CRRDEBQ BIT(1),        /*FMCB ON ACBDEB Q FOR READ ANY         */ 04527000
*   3 CRRRSV08 BIT(1),       /* RESERVED                             */ 04528000
*   3 CRRSUBBK BIT(1),       /* AWAITING SUB-BLOCK PROCESSING        */ 04529000
*   3 CRRRESET BIT(1),       /* RESET OPERATION SWITCH               */ 04530000
*   3 CRRDLCCW BIT(1),       /* READ LCCW BUILT VIA SOLICIT          */ 04531000
*  2 CRRFLGS4 CHAR(1),       /*FLAG BYTE                             */ 04532000
*   3 CRRFMCLK BIT(1),       /* 1=CTLLOCK HELD - 0=NOT HELD          */ 04533000
*   3 CRRRSV04 BIT(7),       /*RESERVED                              */ 04534000
*  2  CRRFLGS CHAR(1),       /* BYTE FOR INDICATORS                  */ 04535000
*     3  CRRSW0 BIT(1),      /* MISC.SWITCH                          */ 04536000
*     3  CRRSW1 BIT(1),      /* MISC.SWITCH                          */ 04537000
*     3  CRRSW2 BIT(1),      /* MISC.SWITCH                          */ 04538000
*     3  CRRSW3 BIT(1),      /* MISC.SWITCH                          */ 04539000
*     3  CRRSW4 BIT(1),      /* INTERNAL CONTROL SWITCH              */ 04540000
*     3  CRRSW5 BIT(1),      /* INTERNAL CONTROL SWITCH              */ 04541000
*     3  CRRSW6 BIT(1),      /* INTERNAL CONTROL SWITCH              */ 04542000
*     3  CRRSW7 BIT(1),      /* INTERNAL CONTROL SWITCH              */ 04543000
*  2  CRRRFLG1 CHAR(1),      /* RECORD FLAGS                         */ 04544000
*     3  CRRRPLS  BIT(1),    /* RPL SATISFIED                        */ 04545000
*     3  CRRRPLOQ BIT(1),    /* RPL Q'ED                             */ 04546000
*     3  CRRRPSBD BIT(1),    /* FSB DISCARDED                        */ 04547000
*     3  CRRDBLCK BIT(1),    /* ACDIB LOCK HELD                      */ 04548000
*     3  CRRRTYPE BIT(4),    /* RPL TYPES                            */ 04549000
*      4 CRRDFASY BIT(1),    /* ASYN DATA                            */ 04550000
*      4 CRRRESP  BIT(1),    /* RESP DATA                            */ 04551000
*      4 CRRDFSYN BIT(1),    /* SYN DATA                             */ 04552000
*      4 CRRNSNA  BIT(1),    /* NON-RECORD DATA                      */ 04553000
*  2 CRRFDBK1 BIT(24),       /* PRIMARY FEEDBACK DATA                */ 04554000
*   3 CRRRTNCD BIT(8),       /* MAJOR RETURN CODE                    */ 04555000
*   3 CRRFDB2 BIT(8),        /* MINOR RETURN CODE                    */ 04556000
*    4 CRRERLK BIT(1),       /* ERROR LOCK SET FOR DEVICE            */ 04557000
*    4 CRRRVID BIT(1),       /* RVI RECEIVED FROM DEVICE             */ 04558000
*    4 CRRATND BIT(1),       /* ATTENTION RECEIVED FROM DEVICE       */ 04559000
*    4 CRRDVUNS BIT(1),      /* DEVICE IS NOT USABLE                 */ 04560000
*    4 CRRIOERR BIT(1),      /* ON - ERROR OCCURRED ON OUTPUT        */ 04561000
*                            /* OFF - ERROR OCCURRED ON INPUT        */ 04562000
*      /* NOTE - THE PREVIOUS BIT APPLIES ONLY WHEN ERROR OCCURRED   */ 04563000
*    4 CRRDLGFL BIT(1),      /* DIALOG INIT. FAILURE OR INTERRUPTION */ 04564000
*    4 CRRCUERR BIT(1),      /* CONTROL UNIT AND/OR CHANNEL ERROR    */ 04565000
*    4 CRRSTSAV BIT(1),      /* SENSE DATA IS AVAILABLE              */ 04566000
*   3 CRRFDB3 BIT(8),        /* DATA FLAGS                           */ 04567000
*    4 CRRUINPT BIT(1),      /* UNSOLICITED INPUT                    */ 04568000
*    4 CRRUNUSD BIT(1),      /* UNUSED                               */ 04569000
*    4 CRRRDEOB BIT(1),      /* DATA ENDED WITH EOB                  */ 04570000
*    4 CRRRDEOM BIT(1),      /* DATA ENDED WITH EOM                  */ 04571000
*    4 CRRRDEOT BIT(1),      /* DATA ENDED WITH EOT                  */ 04572000
*    4 CRRLGFRC BIT(1),      /* LOGOFF MESSAGE RECEIVED FROM DEVICE  */ 04573000
*    4 CRRRLG BIT(1),        /* LEADING GRAPHICS RECEIVED FROM DEVICE*/ 04574000
*    4 CRRRDSOH BIT(1),      /* BLOCK RECEIVED BEGINNING WITH SOH    */ 04575000
*  2 CRRRSV99 CHAR(1),       /* RESERVED                             */ 04576000
*  2 CRRDTACT FIXED(15),     /* FSB DATA COUNT                       */ 04577000
*  2 CRRFDBK2 BIT(32),       /* SECONDARY FEEDBACK DATA              */ 04578000
*   3 CRRDSB BIT(16),        /* SENSE DATA                           */ 04579000
*    4 CRRDSB1 BIT(8),       /* FIRST BYTE OF SENSE DATA             */ 04580000
*    4 CRRDSB2 BIT(8),       /* SECOND BYTE OF SENSE DATA            */ 04581000
*   3 CRRESR BIT(16),        /* EXTENDED SYSTEM RESPONSE             */ 04582000
*    4 CRRESR1 BIT(8),       /* FIRST BYTE OF EXTENDED SYS. RESP.    */ 04583000
*    4 CRRESR2 BIT(8),       /* SECOND BYTE OF EXTENDED SYS. RESP.   */ 04584000
*  2 CRRCLCCW PTR(31),       /*POINTER TO CURRENT LCCW               */ 04585000
*  2 CRRFMCB PTR(31),        /*POINTER TO FMCB                       */ 04586000
*  2 CRRCMDAD PTR(31),       /*ADDR 1ST LCCW OF WRITE CMD            */ 04587000
*  2 CRRLCPB PTR(31),        /*POINTER TO LCPB                       */ 04588000
*  2 CRRUECB  PTR(31),       /*PTR TO UECB                           */ 04589000
*  2 CRRCLDO PTR(31),        /*POINTER TO CURRENT LDO                */ 04590000
*  2 CRRTRBUF CHAR(8) BDY(WORD), /*PARAMETER LIST FOR I/O BUFFR TRACE*/ 04591000
*    3 CRRTRRES CHAR(3),     /*RESERVED                              */ 04592000
*    3 CRRBIND  CHAR(1),     /*TYPE OF BUFFER TRACE                  */ 04593000
*    3 CRRARPL  PTR(31),     /*POINTER TO APPLICATION RPL            */ 04594000
*  2 CRRVALCK PTR(31),       /* VALCHEK AREA LENGTH                  */ 04595000
*  2 CRRATCVT PTR(31),       /* POINTER TO ATCVT                     */ 04596000
*  2 CRRLCNT CHAR(2),        /*LCCW COUNT FIELD                      */ 04597000
*  2 CRRRES1 CHAR(2),        /*RESERVED                              */ 04598000
*  2 CRRRTN1 PTR(31),        /*RTN REG SAVE AREA                     */ 04599000
*  2 CRRRTN2 PTR(31),        /*RTN REG SAVE AREA                     */ 04600000
*  2 CRRRTN3 PTR(31),        /*RTN REG SAVE AREA                     */ 04601000
*  2 CRRRTN4 PTR(31),        /*RTN REG SAVE AREA                     */ 04602000
*  2 CRRRTN5 PTR(31),        /*RTN REG SAVE AREA                     */ 04603000
*  2 CRRRTN6 PTR(31),        /*RTN REG SAVE AREA                     */ 04604000
*  2 CRRRTN7 PTR(31),        /*RTN REG SAVE AREA                     */ 04605000
*  2 CRRRTN8 PTR(31),        /*RTN REG SAVE AREA                     */ 04606000
*  2 CRRRTN9 PTR(31),        /*RTN REG SAVE AREA                     */ 04607000
*  2 CRRRTN10 PTR(31),       /*RTN REG SAVE AREA                     */ 04608000
*  2 CRRRTN11 PTR(31),       /*RTN REG SAVE AREA                     */ 04609000
*  2 CRRRTN12 PTR(31),       /*RTN REG SAVE AREA                     */ 04610000
*      /***      INPUT BUFFER MOVE PARM LIST - ISTDCC60 -         ***/  04611000
*  2 CRRBARAD PTR(31),       /* AREA ADDRESS                         */ 04612000
*  2 CRRBLDAD PTR(31),       /*LDO ADDRESS                           */ 04613000
*  2 CRRBFLGS CHAR(1),        /* FLAGS                               */ 04614000
*   3 CRRBFLG1 BIT(1),        /* INTERNAL SWITCH                     */ 04615000
*   3 *        BIT(7),        /* NOT USED                            */ 04616000
*  2 CRRBRTCD FIXED(8),       /*RETURN CODE                          */ 04617000
*  2 CRRBLEN FIXED(16),       /* LENGTH                      @ZA35893*/ 04618000
*  2 CRRBTLEN FIXED(31),      /* TOTAL LENGTH                        */ 04619000
*  2  CRRLDOCT FIXED(15),     /* LDO COUNT                           */ 04620000
*  2  CRRXFNCD CHAR(1),       /* FUNCTION CODE FOR EXTENSION TO      */ 04621000
*                             /* ISTDCC30, (ISTDCC3X)                */ 04622000
*  2  CRRRVCR1 CHAR(1),       /* RESERVED */                    01S0238 04623000
*  2  CRRCID   CHAR(4),       /* CID OF REQUESTOR OR FOR AUTO RESP.  */ 04624000
*  2  CRRRVCR2 CHAR(4),       /* RESERVED */                    01S0238 04625000
*  2  CRRRVPT1 PTR(31),       /* RESERVED */                    01S0238 04626000
*  2  CRRRVPT2 PTR(31),       /* RESERVED */                    01S0238 04627000
*  2  CRRRVPT3 PTR(31),       /* RESERVED */                    01S0238 04628000
*  2  CRRRVPT4 PTR(31),       /* RESERVED */                    01S0238 04629000
*  2  CRRRVPT5 PTR(31);       /* RESERVED */                    01S0238 04630000
*   /*** CRRBRTCD - VALUES FOR RETURN CODE FROM ISTDCC60      ***/      04631000
* DCL CRRBRSUC FIXED(8) CONSTANT(0);  /* GOOD RETURN CODE ALL DATA      04632000
*                                        MOVED                       */ 04633000
* DCL CRRBMDAT FIXED(8) CONSTANT(4);  /* MORE DATA REMAINING RETURN     04634000
*                                        CODE                        */ 04635000
* DCL CRRBEROR FIXED(8) CONSTANT(8);  /* ERROR RETURN CODE           */ 04636000
*   /***   CONSTANTS   ***/                                     01S0242 04637000
* DCL CRRILDOP FIXED(8) CONSTANT(6);  /*INVALID LDO OPCODE           */ 04638000
* DCL CRRILSEQ FIXED(8) CONSTANT(7);   /*INVALID LDO SEQUENCE        */ 04639000
*                                      /*MORE THAN 1 SOL/READ        */ 04640000
*                                      /*LDO IN LCP                  */ 04641000
* DCL CRRDOFLD FIXED(8) CONSTANT(32);  /* DEVICE IS OFFLINE OR HAS   */ 04642000
*                                      /*  DISCONNECTED              */ 04643000
* DCL CRRDEVOF FIXED(8) CONSTANT(7);/* DEVICE OFFLINE OR DISCONNECTED*/ 04644000
* DCL CRRWANCR FIXED(8) CONSTANT(8);   /*WRITE NACK, WRITE NACK WITH    04645000
*                                         LG, WRITE ALT ACK, WRITE      04646000
*                                         RVI NOT CHAINED TO A READ  */ 04647000
* DCL CRRSANOD FIXED(8) CONSTANT(12);  /*SOLICIT ALL REQ AND NO DEVICE  04648000
*                                        CONNECTED                   */ 04649000
* DCL CRRSANDA FIXED(8) CONSTANT(13);  /*SOLICIT ALL REQ AND NO DEVICE  04650000
*                                        AVAILABLE TO SOLICIT        */ 04651000
* DCL CRRSTOOD FIXED(8) CONSTANT(14);  /*SOLICIT TO OUTPUT ONLY      */ 04652000
*                                      /*DEVICE TYPE                 */ 04653000
* DCL CRRBUFTE FIXED(8) CONSTANT(15);  /*REQUEST REJECTED DUE TO BUFFER 04654000
*                                        THRESHOLD EXCEEDED          */ 04655000
* DCL CRRRTOOD FIXED(8) CONSTANT(16);  /*READ TO AN OUTPUT ONLY      */ 04656000
*                                      /*DEVICE TYPE                 */ 04657000
* DCL CRRWTOI FIXED(8) CONSTANT(17);   /*WRITE TO INPUT ONLY         */ 04658000
*                                      /*DEVICE TYPE                 */ 04659000
* DCL CRREWNS FIXED(8) CONSTANT(18);   /*ERASE WRITE TO NON-2265     */ 04660000
*                                      /*OR 3270 DEVICE              */ 04661000
* DCL CRREWAU3 FIXED(8) CONSTANT(19);  /*ERASE WRITE ALL UNPRO       */ 04662000
*                                      /*TO NON-3270 DEVICE          */ 04663000
* DCL CRRCWTOO FIXED(8) CONSTANT(20);  /*CONV WRITE TO OUTPUT        */ 04664000
*                                      /*ONLY DEVICE                 */ 04665000
* DCL CRREWCNV FIXED(8) CONSTANT(21);  /* ERASE WRITE CONVERSATIONAL */ 04666000
* DCL CRRCCCPY FIXED(8) CONSTANT(22);  /*COMM CHAINED OR DATA CHAINED   04667000
*                                        COPY LDO TO 3270 DEVICE     */ 04668000
* DCL CRRIDA FIXED(8) CONSTANT(23);    /*INVALID DATA AREA ADDR      */ 04669000
*                                      /*OR LENGTH SPECIFIED         */ 04670000
* DCL CRRILDOA FIXED(8) CONSTANT(24);  /*INVALID LDO ADDRESS         */ 04671000
* DCL CRRJTOJ FIXED(8) CONSTANT(25);   /*JUMP LDO JUMPS TO           */ 04672000
*                                      /*JUMP LDO                    */ 04673000
* DCL CRRM100 FIXED(8) CONSTANT(26);   /*MORE THAN 100 NON-JUMP LDO'S   04674000
*                                        IN LCP                      */ 04675000
* DCL CRRRILCP FIXED(8) CONSTANT(27);  /*RESET LDO IMBEDDED WITHIN   */ 04676000
*                                      /*LCP                         */ 04677000
* DCL CRRCRIRT FIXED(8) CONSTANT(28);  /*INVALID MACRO REQUEST IN RPL*/ 04678000
* DCL CRRRIOCC FIXED(8) CONSTANT(29);  /* INVALID READ               */ 04679000
*                                      /* WITH COMMAND CHAINING      */ 04680000
* DCL CRREWBLK FIXED(8) CONSTANT(30);  /*ERASE WRITE ERROR      01S0265 04681000
*                                         IN BLOCK MODE              */ 04682000
* DCL CRRCRSDC FIXED(8) CONSTANT(31);  /* SOLICIT LDO HAS DATA CHAIN    04683000
*                                         FLAG SET                   */ 04684000
*  DCL CRRIRSTP FIXED(8) CONSTANT(33);  /* INVALID RESET TYPE IN RPL */ 04685000
*  DCL CRRIVACB FIXED(8) CONSTANT(34);  /* INVALID ACB               */ 04686000
*  DCL CRRIVEXL FIXED(8) CONSTANT(35);  /* INVALID EXIT LIST         */ 04687000
*  DCL CRRWRBLK FIXED(8) CONSTANT(36);  /*WRITE BLOCK TO 3270 DEVICE */ 04688000
*  DCL CRRMBTWD FIXED(8) CONSTANT(37);  /* READ MODIFIED OR READ BUF-   04689000
*                                          FER TO A NON-3270 DEVICE  */ 04690000
*  DCL CRRCPYNS FIXED(8) CONSTANT(38),  /* COPY TO NON-3270 DEVICE   */ 04691000
*      CRRWCNVR FIXED(8) CONSTANT(39),  /* WRITE CONV: REJCT DATA EXP*/ 04692000
*     CRRRDNFO FIXED(8) CONSTANT(40),  /* READ NOT THE FIRST OPERATION  04693000
*                                         TO A 3735                  */ 04694000
*     CRRCRJEL FIXED(8) CONSTANT(41),  /* RESET CONDITIONAL REJECTED    04695000
*                                        BECAUSE DEVICE ERROR LOCK SET* 04696000
*     CRRINVRM FIXED(8) CONSTANT(42),  /* INVALID READ MODL, NOT BLOCK, 04697000
*                                       MSG TRANSMISSION OR CONTINEOUS* 04698000
*     CRRRTRUN FIXED(8) CONSTANT(48),  /* DATA TRUNCATION OCCURRED  */  04699000
*    CRRSDQT  FIXED(8) CONSTANT(50), /* DFSYN ATTEMPT IN QUIESCE    */  04700000
*    CRRSDEX  FIXED(8) CONSTANT(51), /* RESPOND=EX ALONE IN RPL     */  04701000
*    CRRSDNP  FIXED(8) CONSTANT(52), /* PREV POST=SCHED NOT POSTED  */  04702000
*    CRRSCEM  FIXED(8) CONSTANT(53), /* CHAIN ERROR, MIDDLE/LAST REQ*/  04703000
*    CRRSCEF  FIXED(8) CONSTANT(54), /* CHAIN ERROR, 1ST OR ONLY REQ*/  04704000
*    CRRSNQC  FIXED(8) CONSTANT(55), /* SEND CTL=QC, QUIESCE NOT REQ*/  04705000
*    CRRSDNVC FIXED(8) CONSTANT(56), /* INVALID CTL=OPTION          */  04706000
*    CRRSDFR  FIXED(8) CONSTANT(57), /* SEND IN DATA FLOW RESET     */  04707000
*    CRRSNOS  FIXED(8) CONSTANT(58), /* SEND DATA FLOW CTL INVALID  */  04708000
*    CRRSNOVT FIXED(8) CONSTANT(59), /* RESP WITH 0 OUTSTANDING     */  04709000
*    CRRSNMC  FIXED(8) CONSTANT(60), /* CHASE WHEN CANCEL EXPECT    */  04710000
*    CRRSSEQ  FIXED(8) CONSTANT(61), /* SEQ. NR. NOT EXPECTED       */  04711000
*    CRRSINVS FIXED(8) CONSTANT(62), /* RESP=OPTION NOT MATCH RESP  */  04712000
*    CRRSINVR FIXED(8) CONSTANT(63), /* INVALID RESP FOR POST=RESP  */  04713000
*    CRRRNORT FIXED(8) CONSTANT(2),  /* NO RTYPE IN RPL             */  04714000
*    CRRNFMLK FIXED(8) CONSTANT(65), /* FMCB LOCK COULD NOT BE GOT  */  04715000
*    CRRRSTSR FIXED(8) CONSTANT(52), /* RESETSR IN PROGRESS         */  04716000
*    CRRIVREQ BIT(8) CONSTANT('67'X);/* REQUEST INVALID FOR THIS MODE*/ 04717000
*/*** MAJOR RETURN CODE CONSTANTS  --- CRRRTNCD                    ***/ 04718000
* DCL CRRNOERR BIT(8) CONSTANT('00'X), /* SUCCESSFUL COMPLETION      */ 04719000
*     CRRCBLKE BIT(8) CONSTANT('04'X), /* CONTROL BLOCK ERROR        */ 04720000
*     CRRLOGIC BIT(8) CONSTANT('08'X), /* LOGICAL ERROR              */ 04721000
*     CRRPHYSC BIT(8) CONSTANT('0C'X), /* PHYSICAL ERROR             */ 04722000
*     CRRNGRCC BIT(8) CONSTANT('10'X), /* NEGATIVE RESPONSE TO  01S0273 04723000
*                                         CONDITIONAL COMMAND        */ 04724000
*     CRRSPECC BIT(8) CONSTANT('14'X), /* SPECIAL CONDITION          */ 04725000
*     CRRCMDRT BIT(8) CONSTANT('18'X), /* OPERATION WAS RESET        */ 04726000
*     CRRPURGE BIT(8) CONSTANT('1C'X), /* OPERATION WAS PURGED       */ 04727000
*     CRRRLEX  BIT(8) CONSTANT('2C'X); /* RESPLIM EXCEEDED           */ 04728000
*DCL CRRTYPE BIT(8) CONSTANT('22'X);    /* TYPE CODE FOR DCCRR       */ 04729000
*DCL CRREXRQ  BIT(8) CONSTANT('30'X);   /* EXCEPTION REQUEST         */ 04730000
*DCL CRREXRS  BIT(8) CONSTANT('34'X);   /* EXCEPTION RESPONSE        */ 04731000
*DCL CRRNOIN  BIT(8) CONSTANT('38'X);   /* NO INPUT AVAILABLE        */ 04732000
*DCL CRRSYERR BIT(8) CONSTANT('24'X);   /* SYSTEM ERROR              */ 04733000
*/*                                                                  */ 04734000
*/* ***  ISTRCC26 PARAMETERS                                         */ 04735000
*/*                                                                  */ 04736000
*DCL CRRHOLD  BIT(8) CONSTANT('04'X);                           01S0279 04737000
*DCL CRRRHOLD BIT(8) CONSTANT('08'X);                           01S0280 04738000
*DCL CRRARESP BIT(8) CONSTANT('12'X);                           01S0281 04739000
*/*                                                                  */ 04740000
*/*  RU CONTROL BYTE EQUATES                                         */ 04741000
*/*                                                                  */ 04742000
*DCL CRRCNCL  BIT(8) CONSTANT('83'X);                           01S0282 04743000
*DCL CRRQC    BIT(8) CONSTANT('81'X);                           01S0283 04744000
*DCL CRRQEC   BIT(8) CONSTANT('80'X);                           01S0284 04745000
*DCL CRRCHASE BIT(8) CONSTANT('84'X);                           01S0285 04746000
*DCL CRRRELQ  BIT(8) CONSTANT('82'X);                           01S0286 04747000
*DCL CRRQI    BIT(8) CONSTANT('87'X);                           01S0287 04748000
*DCL CRRSHUTC BIT(8) CONSTANT('C1'X);                           01S0288 04749000
*DCL CRRHLDRU BIT(8) CONSTANT('01'X);   /* 'HOLD' CONTROL CODE       */ 04750000
*DCL CRRRHLDR BIT(8) CONSTANT('02'X);   /* 'RELEASE HOLD' CTL CODE   */ 04751000
*DCL CRRSHUTD BIT(8) CONSTANT('C0'X);   /* SHUTD CONTROL CODE        */ 04752000
*DCL CRRBID   BIT(8) CONSTANT('C8'X);   /* BID CONTROL CODE          */ 04753000
*DCL CRRLUS   BIT(8) CONSTANT('04'X);   /* LUS CONTROL CODE          */ 04754000
*DCL CRRRTR   BIT(8) CONSTANT('05'X);   /* RTR CONTROL CODE          */ 04755000
*DCL CRRSIGNL BIT(8) CONSTANT('C9'X);   /* SIGNAL CONTROL CODE       */ 04756000
*DCL CRRRSHTD BIT(8) CONSTANT('C2'X);   /* RSHUTD CONTROL CODE       */ 04757000
*/*   SESSION CONTROL EQUATES                                        */ 04758000
*DCL CRRSCID  BIT(8) CONSTANT('20'X);   /* SESSION CONTROL ID        */ 04759000
*DCL CRRSCFME BIT(8) CONSTANT('16'X);   /* SESSION CTL FME (ISTSEC40)*/ 04760000
*DCL CRRSCFD  BIT(8) CONSTANT('20'X);   /* SESSION CONTROL FUNCTION     04761000
*                                          DISABLE (ISTSEC40)        */ 04762000
*DCL CRRSCENA BIT(8) CONSTANT('28'X); /* SESS CTL SCIP EXIT NOT AVAIL*/ 04763000
*DCL CRRSCISR BIT(8) CONSTANT('2C'X); /* INSUFFICIENT SYSTEM RESOURCES* 04764000
*DCL CRRCLSIP BIT(8) CONSTANT('03'X);                           01S0302 04765000
*DCL CRRDNOP  BIT(8) CONSTANT('5F'X);                           01S0303 04766000
*DCL CRRINVAL BIT(8) CONSTANT('69'X);                           01S0304 04767000
*DCL CRRSINVC BIT(8) CONSTANT('38'X);                           01S0305 04768000
*DCL CRRSNOUT BIT(8) CONSTANT('3B'X);                           01S0306 04769000
*DCL CRRINVRT BIT(8) CONSTANT('6A'X);                           01S0307 04770000
*DCL CRRCIDNG BIT(8) CONSTANT('05'X); /* CID NO GOOD                  * 04771000
*DCL CRRRNO   BIT(8) CONSTANT('62'X); /* RESOURCE NOT OWNED          */ 04772000
*/*                                                                  */ 04773000
*DCL CRRFRFSB BIT(8) CONSTANT('04'X), /* FUNCTION CODE FOR FREEFSB   */ 04774000
*    CRRCKCNT BIT(8) CONSTANT('10'X), /* FUNCTION CODE FOR CKCONT    */ 04775000
*    CRRUNSXT BIT(8) CONSTANT('0C'X), /* FUNCTION CODE FOR UNSEXT    */ 04776000
*    CRRUCBNT BIT(8) CONSTANT('08'X), /* FUNCTION CODE FOR UECBINIT  */ 04777000
*    CRRCKATT BIT(8) CONSTANT('04'X), /* FUNCTION CODE FOR CKATT     */ 04778000
*    CRRCKUSD BIT(8) CONSTANT('00'X); /* FUNCTION CODE FOR CKUNSD    */ 04779000
*DCL CRRACINV BIT(8) CONSTANT('69'X), /* INVALID ACTION              */ 04780000
*    CRRSCFNR BIT(8) CONSTANT('24'X); /* ISTSEC40-FUNCTION NOT RECOG.*/ 04781000
*/* COMPONENT RECOVERY                                               */ 04782000
*/*                                                                  */ 04783000
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */ 04784000
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                       01S0312 04785000
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */ 04786000
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */ 04787000
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */ 04788000
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */ 04789000
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */ 04790000
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */ 04791000
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */ 04792000
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */ 04793000
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */ 04794000
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */ 04795000
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */ 04796000
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */ 04797000
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */ 04798000
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */ 04799000
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */ 04800000
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */ 04801000
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */ 04802000
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */ 04803000
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */ 04804000
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE      04805000
*                                          OPTION                    */ 04806000
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS      04807000
*                                          14 - 1                    */ 04808000
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */ 04809000
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */ 04810000
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */ 04811000
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */ 04812000
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS    01S0312 04813000
*                                          REGS 1 - 4                */ 04814000
*/*  NETWORKING                                         001 06/16/76 */ 04815000
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                01S0313 04816000
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */ 04817000
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */ 04818000
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */ 04819000
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */ 04820000
*        3  APC53E BIT(1),              /* ISTAPC53                  */ 04821000
*        3  APC54E BIT(1),                                      01S0313 04822000
*        3  APC56E BIT(1),                                      01S0313 04823000
*        3  APC57E BIT(1),                                      01S0313 04824000
*        3  APC58E BIT(1),                                      01S0313 04825000
*        3  APC31E BIT(1),                                      01S0313 04826000
*        3 * BIT(8),                    /* RESERVED                  */ 04827000
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */ 04828000
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */ 04829000
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */ 04830000
*        3  APC53R BIT(1),                                      01S0313 04831000
*        3  APC54R BIT(1),                                      01S0313 04832000
*        3  APC56R BIT(1),                                      01S0313 04833000
*        3  APC57R BIT(1),                                      01S0313 04834000
*        3  APC58R BIT(1),                                      01S0313 04835000
*        3  APC31R BIT(1),                                      01S0313 04836000
*        3  *      BIT(8),              /* RESERVED                  */ 04837000
*     2  APCPSTA PTR(31),               /* PST@                      */ 04838000
*     2  APCTCBA PTR(31),               /* TCB@                      */ 04839000
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */ 04840000
*        3 APCAUT   CHAR(1),            /*@ TO BR16 TO USER     01S0313 04841000
*                                         IF APAUTEX = 1     @X446900*/ 04842000
*          4 APCAUTEX BIT(1),           /*                   @X446900*/ 04843000
*          4 *        BIT(7),           /*                   @X446900*/ 04844000
*        3 APCRTRNA PTR(24),            /*                   @X446900*/ 04845000
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */ 04846000
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */ 04847000
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/ 04848000
*     2  APCSAVE CHAR(72),                                      01S0313 04849000
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */ 04850000
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */ 04851000
*        3  APCCOMF1 CHAR(2),                                   01S0313 04852000
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */ 04853000
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB* 04854000
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */ 04855000
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */ 04856000
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */ 04857000
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/ 04858000
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/ 04859000
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB* 04860000
*           4  APCAUTHE BIT(1),         /* AUTHORIZED EXIT IN CONTROL*/ 04861000
*           4  APCTSO   BIT(1),         /* ISTAPC54 HAS GIVEN CONTROL*/ 04862000
*                                       /* TO A USER EXIT VIA BALR   */ 04863000
*           4  * BIT(6),                /* RESERVED                  */ 04864000
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */ 04865000
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */ 04866000
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */ 04867000
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */ 04868000
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */ 04869000
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */ 04870000
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/ 04871000
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */ 04872000
*        3  *       BIT(5),       /* RESERVED                        */ 04873000
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */ 04874000
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */ 04875000
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */ 04876000
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */ 04877000
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */ 04878000
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */ 04879000
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */ 04880000
*        3    *      BIT(2),      /* RESERVED                        */ 04881000
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */ 04882000
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */ 04883000
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */ 04884000
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/ 04885000
*        3  * BIT(7),             /* RESERVED                        */ 04886000
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */ 04887000
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */ 04888000
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */ 04889000
*        3  *   BIT(6),           /* RESERVED                        */ 04890000
*     2  * CHAR(3),               /* RESERVED                        */ 04891000
*     2  APCSVRB  PTR(31),        /* ADDRESS OF SVRB UNDER WHICH     */ 04892000
*                                 /* CRA PROCESS IS RUNNING          */ 04893000
*     2  * CHAR(8);               /* RESERVED                        */ 04894000
*/*               COMPONENT RECOVERY AREA                            */ 04895000
*DCL 1  ISTCRA CHAR(1016) BASED BDY(DWORD),                     01S0314 04896000
*                                       /* COMPONENT RECOVERY AREA   */ 04897000
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */ 04898000
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */ 04899000
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */ 04900000
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */ 04901000
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND       01S0314 04902000
*                                          OWNERSHIP FLAGS           */ 04903000
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */ 04904000
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */ 04905000
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */ 04906000
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */ 04907000
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */ 04908000
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */ 04909000
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */ 04910000
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */ 04911000
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */ 04912000
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */ 04913000
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */ 04914000
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */ 04915000
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */ 04916000
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */ 04917000
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */ 04918000
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */ 04919000
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */ 04920000
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */ 04921000
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */ 04922000
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */ 04923000
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */ 04924000
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */ 04925000
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */ 04926000
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */ 04927000
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */ 04928000
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */ 04929000
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */ 04930000
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */ 04931000
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */ 04932000
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */ 04933000
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */ 04934000
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */ 04935000
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */ 04936000
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */ 04937000
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */ 04938000
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */ 04939000
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */ 04940000
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */ 04941000
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */ 04942000
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */ 04943000
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */ 04944000
*      3 CRALAPTR PTR(31),              /* RESERVED                  */ 04945000
*/*                                                                  */ 04946000
*/*   VS1/VS2 EXTENSION                                              */ 04947000
*/*                                                                  */ 04948000
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH  01S0314 04949000
*                                          THIS CRH                  */ 04950000
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */ 04951000
*    2 CRAPROCR BDY(DWORD),             /* PROCESS CRR: MAX SIZE IS  */ 04952000
*      3 * CHAR(1016-(LENGTH(CRABASIC)  /* PAGE SIZE - PAGE HEADER   */ 04953000
*                   + LENGTH(CRARPH)    /* MINUS SUM OF BASIC, RPH,  */ 04954000
*                   + LENGTH(CRAPSS)    /* PSS CRR,                  */ 04955000
*                   + LENGTH(CRASVC)    /* SAVE AREA,                */ 04956000
*                   + LENGTH(CRARSV01)  /* RESERVED FIELD ONE,       */ 04957000
*                   + LENGTH(CRARSV02)  /* RESERVED FIELD TWO,       */ 04958000
*                   + LENGTH(CRAIDS)    /* ID FIELD,                 */ 04959000
*                   + LENGTH(CRACHAIN))),/* AND CHAIN FIELD  @D434407*/ 04960000
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */ 04961000
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */ 04962000
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */ 04963000
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */ 04964000
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION* 04965000
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   * 04966000
*     2  CRARSV01 PTR(31),              /* RESERVED                  */ 04967000
*     2  CRARSV02 PTR(31),              /* RESERVED                  */ 04968000
*     2  CRAIDS   CHAR(8) BDY(WORD),    /* MEMORY IDENT              */ 04969000
*        3 *        CHAR(2),                                    01S0314 04970000
*        3 CRAASID  CHAR(2),            /* MEMORY ASID               */ 04971000
*        3 CRAID    CHAR(4),            /* CRA EBCDIC ACRONYM        */ 04972000
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE    04973000
*                                          CRA TO PREALLOCATE QUEUE     04974000
*                                          WHEN NOT IN USE           */ 04975000
*                                                               01S0314 04976000
*DCL CRACFCRR CHAR(LENGTH(ISTCFCRR))    /* REDEFINE CRAPROCR         */ 04977000
*         DEFINED(CRAPROCR);            /* FOR CFCRR         @D434407*/ 04978000
*DCL 1 * CHAR(*) DEFINED(CRAPROCR),     /* REDEFINE CRAPROCR @D434407*/ 04979000
*     2 * CHAR(LENGTH(ISTDCCRR)),       /* FOR CRRSA         @D434407*/ 04980000
*     2 CRACRRSA CHAR(LENGTH(CRRSAREA));/*                   @D434407*/ 04981000
*                                                               01S0316 04982000
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */ 04983000
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */ 04984000
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */ 04985000
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */ 04986000
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */ 04987000
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */ 04988000
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */ 04989000
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */ 04990000
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */ 04991000
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */ 04992000
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */ 04993000
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */ 04994000
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */ 04995000
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */ 04996000
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */ 04997000
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */ 04998000
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */ 04999000
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */ 05000000
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */ 05001000
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */ 05002000
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */ 05003000
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */ 05004000
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */ 05005000
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */ 05006000
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */ 05007000
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */ 05008000
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */ 05009000
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */ 05010000
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */ 05011000
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */ 05012000
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */ 05013000
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */ 05014000
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */ 05015000
*/*   PROGRAM OPERATOR MESSAGE HEADER                                */ 05016000
*DCL  1  ISTPOHD  BDY(WORD) BASED,                              01S0350 05017000
*        2 POHRSVD1 CHAR(1),       /* RESERVED                       */ 05018000
*        2 POHSTAT,                /* HEADER STATUS BITS             */ 05019000
*          3 POHEND   BIT(1),      /* END LINE 1=YES                 */ 05020000
*          3 POHDATA  BIT(1),      /* DATA LINE 1=YES                */ 05021000
*          3 POHLBL   BIT(1),      /* LABEL LINE 1=YES               */ 05022000
*          3 POHCNTRL BIT(1),      /* CONTROL LINE 1=YES             */ 05023000
*          3 POHRSVD2 BIT(2),      /* RESERVED                       */ 05024000
*          3 POHRREQ  BIT(1),      /* REPLY REQUESTED 1=YES          */ 05025000
*          3 POHGEN   BIT(1),      /* ID ORIGIN  0=GENERATED BY VTAM */ 05026000
*                                  /*            1=GENERATED BY POA  */ 05027000
*        2 POHID    FIXED(16);     /* MESSAGE IDENTIFIER             */ 05028000
*/*   PROGRAM OPERATOR MESSAGE CONTROL BLOCK                         */ 05029000
*/*  REVISIONS                                          001 05/28/75 */ 05030000
*DCL  1  ISTPOMCB BDY(WORD) BASED,                              01S0351 05031000
*        2 POMCBID  CHAR(1),       /* POMCB IDENTIFIER               */ 05032000
*        2 POMLNGTH FIXED(8),      /* LENGTH IN BYTES                */ 05033000
*        2 POMMSGLN FIXED(8),      /* MESSAGE LENGTH                 */ 05034000
*        2 POMRSVD1 CHAR(1),       /* RESERVED                       */ 05035000
*        2 POMRSVD2 PTR(31),       /* RESERVED FOR FUTURE PSS USE    */ 05036000
*        2 POMNEXT,                                             01S0351 05037000
*          3 *        CHAR(1),                                  01S0351 05038000
*          3 POMFWD   PTR(24),     /* ADDRESS OF NEXT POMCB          */ 05039000
*        2 POMREPQ,                                             01S0351 05040000
*          3 *        CHAR(1),                                  01S0351 05041000
*          3 POMPORCB PTR(24),     /* ADDRESS OF PORCB               */ 05042000
*        2 POMMHDR  CHAR(LENGTH(ISTPOHD)),  /* MESSAGE HEADER        */ 05043000
*        2 POMMSG   CHAR(120) BDY(WORD);    /* MESSAGE               */ 05044000
*DCL POMTYPE  BIT(8) CONSTANT('47'X);/* CONTROL BLOCK ID FOR ISTPOMEB*/ 05045000
*   GEN(PRINT ON);                                              01S0353 05046000
         PRINT ON                                                       05047000
*                                                               01S0354 05048000
*/* END OF ATBUILD                                                   */ 05049000
*/* ATBUILD (ISTPORCB,ISTPOCB,ISTDYPAB)                              */ 05050000
*                                                               01S0354 05051000
*   GEN(PRINT OFF);                                             01S0354 05052000
         PRINT OFF                                                      05053000
*/*   PROGRAM OPERATOR REPLY CONTROL BLOCK                           */ 05054000
*/*  REVISIONS                                          001 05/28/75 */ 05055000
*DCL  1  ISTPORCB BDY(WORD) BASED,                              01S0355 05056000
*        2 PORCBID  CHAR(1),       /* PORCB INDICATOR                */ 05057000
*        2 PORLNGTH FIXED(8),      /* LENGTH IN BYTES                */ 05058000
*        2 POREPID  CHAR(2),       /* REPLY ID                       */ 05059000
*        2 PORPSSQ  PTR(31),       /* ADDRESS OF NEXT PORCB          */ 05060000
*                                  /* FOR PSS USE                    */ 05061000
*        2 PORNEXT,                                             01S0355 05062000
*          3 *        CHAR(1),                                  01S0355 05063000
*          3 PORFWD   PTR(24),     /* ADDRESS OF NEXT PORCB          */ 05064000
*        2 PORPOMQ,                                             01S0355 05065000
*          3 *        CHAR(1),                                  01S0355 05066000
*          3 PORPOMCB PTR(24),     /* ADDRESS OF POMCB               */ 05067000
*        2 PORAREA  PTR(31),       /* ADDRESS OF REPLY AREA          */ 05068000
*        2 PORECB   PTR(31),       /* ADDRESS OF ECB                 */ 05069000
*        2 PORREPLN FIXED(8),      /* REPLY LENGTH                   */ 05070000
*        2 PORRSVD,                /* STATUS, RESERVED BITS          */ 05071000
*          3 PORRTPQ  BIT(1),      /* PORCB HAS BEEN TPQUEUED, 1=YES */ 05072000
*          3 *        BIT(7),      /* RESERVED                       */ 05073000
*        2 *        CHAR(2),       /* RESERVED                       */ 05074000
*        2 PORMSG   CHAR(126);     /* AREA TO STORE THE REPLY MESSAGE*/ 05075000
*DCL PORTYPE  BIT(8) CONSTANT('48'X);/* CONTROL BLOCK ID FOR ISTPORCB*/ 05076000
*/* ***** WTO PARAMETER FORMAT **** */                          01S0357 05077000
*                                                               01S0357 05078000
*DCL  1  ISTWPL BDY(WORD) BASED,                                01S0357 05079000
*        2  WPLLGH FIXED(15),           /* LENGTH OF MSG TEXT PLUS 4 */ 05080000
*        2  WPLMCSF BIT(16),            /* MCS FLAGS                 */ 05081000
*           3  WPLMCSF1 BIT(8),         /* FIRST FLAG BYTE           */ 05082000
*              4  WPLMCSFA BIT(1),      /* ROUTING CODES EXIST       */ 05083000
*              4  WPLMCSFB BIT(1),      /* QUEUE TO R0               */ 05084000
*              4  WPLMCSFC BIT(1),      /* COMMAND RESP.             */ 05085000
*              4  WPLMCSFD BIT(1),      /* MSG TYPE FIELD EXISTS     */ 05086000
*              4  WPLMCSFE BIT(1),      /* REPLY TO WTOR             */ 05087000
*              4  WPLMCSFF BIT(1),      /* BROADCAST                 */ 05088000
*              4  WPLMCSFG BIT(1),      /* HARD COPY                 */ 05089000
*              4  WPLMCSFH BIT(1),      /* QUEUE TO R0 ALWAYS        */ 05090000
*           3  WPLMCSF2 BIT(8),         /* SECOND FLAG BYTE          */ 05091000
*              4  WPLMCSFI BIT(1),      /* TIME STAMP                */ 05092000
*              4  WPLMCSFJ BIT(1),      /* MLWTO                     */ 05093000
*              4  WPLSTGFL BIT(1),      /* 1=GETVIS ISSUED           */ 05094000
*              4  WPLRSV01 BIT(2),      /* RESERVED                  */ 05095000
*              4  WPLMCSFN BIT(1),      /* BYPASS HARD COPY          */ 05096000
*              4  WPLRSV02 BIT(2),      /* RESERVED                  */ 05097000
*        2  WPLTXT CHAR(255);           /* MESSAGE TEXT              */ 05098000
*/* ***** WTOR PREFIX TO ISTWPL ****** */                       01S0358 05099000
*/* APPLIED DCR'S */                                            01S0358 05100000
*/* 1K1326 - MAR 15, 73 - DM */                                 01S0358 05101000
*DCL  1  ISTRWPL BDY(WORD) BASED,                               01S0358 05102000
*        2  RWPPRTR FIXED(32),                                  01S0358 05103000
*           3  RWPLRLN FIXED(8),       /* INPUT TEXT LENGTH         */  05104000
*           3  RWPRPTRA PTR(24),       /* INPUT BUFFER POINTER      */  05105000
*        2  RWPRECB PTR(31),           /* ECB POINTER               */  05106000
*           3  RWPSSECB FIXED(32),     /* USED TO TEST COMPLMTD ECB */  05107000
*        2  RWPWPL CHAR(LENGTH(ISTWPL)); /* CONTINUE WITH WTO FORMAT*/  05108000
*/* PROGRAM OPERATOR CONTROL BLOCK                                   */ 05109000
*/*  REVISIONS                                          001 05/28/75 */ 05110000
*DCL  1  ISTPOCB  BDY(WORD) BASED,                              01S0359 05111000
*        2 POCCBID  CHAR(1),       /* POCB IDENTIFIER                */ 05112000
*        2 POCLNGTH FIXED(8),      /* LENGTH IN BYTES                */ 05113000
*        2 POCVTMID FIXED(15),     /* VTAM ID COUNTER                */ 05114000
*        2 POCPSSQ  PTR(31),       /* ADDRESS OF NEXT POCB           */ 05115000
*                                  /* FOR PSS USE                    */ 05116000
*        2 POCNEXT,                                             01S0359 05117000
*          3 *        CHAR(1),                                  01S0359 05118000
*          3 POCFWD   PTR(24),     /* ADDRESS OF NEXT POCB           */ 05119000
*        2 POCDEB   PTR(31),       /* ADDRESS OF DEB PREFIX          */ 05120000
*        2 POCRCVQ,                                             01S0359 05121000
*          3 *        CHAR(1),                                  01S0359 05122000
*          3 POCMSGQ  PTR(24),     /* ADDRESS OF MESSAGE QUEUE       */ 05123000
*        2 POCREPQ,                                             01S0359 05124000
*          3 *        CHAR(1),                                  01S0359 05125000
*          3 POCAWTRQ PTR(24),     /* ADDRESS OF AWAITING REPLY QUE  */ 05126000
*        2 POCRPL   PTR(31),       /* ADDRESS OF RCVCMD RPL          */ 05127000
*        2 POCRPGEN BIT(104),      /* BIT STRING TO GENERATE AND KEEP*/ 05128000
*                                  /* TRACK OF REPLY ID'S            */ 05129000
*        2 POCRCNTR FIXED(8),      /* REPLY ID COUNTER               */ 05130000
*        2 POCSTAT,                /* POCB STATUS                    */ 05131000
*          3 POCACT   BIT(1),      /* POI ACTIVE 1 = YES             */ 05132000
*          3 POCINACT BIT(1),      /* POI INACTIVE 1 = YES           */ 05133000
*          3 POCQUI   BIT(1),      /* POI QUISCE 1 = YES             */ 05134000
*          3 *        BIT(5),      /* RESERVED                       */ 05135000
*        2 POCRSVD  CHAR(1),       /* RESERVED                       */ 05136000
*        2 POCWTOPL CHAR(LENGTH(ISTRWPL)) BDY(WORD);            01S0359 05137000
*                                  /* ISTWPL AND ISTRWPL PARM LISTS  */ 05138000
*DCL POCTYPE  BIT(8) CONSTANT('46'X); /* CONTROL BLOCK ID FOR ISTPOCB*/ 05139000
*   GEN(PRINT ON);                                              01S0361 05140000
         PRINT ON                                                       05141000
*                                                               01S0362 05142000
*/* END OF ATBUILD                                                   */ 05143000
*/************ INPUT REGISTER DECLARES ***********                   */ 05144000
*                                                               01S0362 05145000
*   DCL                                                         01S0362 05146000
*     CRPRPHPT REG(1) PTR(31) RSTD;                             01S0362 05147000
*   DCL                                                         01S0363 05148000
*     CRPOCWPT REG(4) PTR(31) RSTD;                             01S0363 05149000
*   DCL                                                         01S0364 05150000
*     CRPPOCB REG(6) PTR(31) RSTD;                              01S0364 05151000
*   DCL                                                         01S0365 05152000
*     BASEREG REG(12) PTR(31) RSTD;                             01S0365 05153000
*   DCL                                                         01S0366 05154000
*     CRPSVPT REG(13) PTR(31) RSTD;                             01S0366 05155000
*   DCL                                                         01S0367 05156000
*     CRPRTPT REG(14) PTR(31);                                  01S0367 05157000
*                                                               01S0367 05158000
*/************ CONTROL BLOCK SETUPS ************                     */ 05159000
*                                                               01S0368 05160000
*   RFY                                                         01S0368 05161000
*     ISTRPH BASED(CRPRPHPT);                                   01S0368 05162000
*   RFY                                                         01S0369 05163000
*     ISTOCW BASED(CRPOCWPT);                                   01S0369 05164000
*   RFY                                                         01S0370 05165000
*     ISTATCVT BASED(OCWACVT);                                  01S0370 05166000
*   RFY                                                         01S0371 05167000
*     ISTPOIA BASED(ATCPOIA);                                   01S0371 05168000
*   RFY                                                         01S0372 05169000
*     ISTPOCB BASED(CRPPOCB);                                   01S0372 05170000
*   RFY                                                         01S0373 05171000
*     ISTPORCB BASED(POCAWTRQ);                                 01S0373 05172000
*   RFY                                                         01S0374 05173000
*     ISTPOMCB BASED(PORPOMCB);                                 01S0374 05174000
*   RFY                                                         01S0375 05175000
*     IFGRPL BASED(OCWRPL);                                     01S0375 05176000
*   RFY                                                         01S0376 05177000
*     ISTDYPAB BASED(ADDR(ATCPOPAB));                           01S0376 05178000
*   RFY                                                         01S0377 05179000
*     ISTPAB BASED(ADDR(DYPPAB));                               01S0377 05180000
*   RFY                                                         01S0378 05181000
*     ISTPOPWA BASED(ADDR(OCWSAVE2));                           01S0378 05182000
*                                                               01S0378 05183000
*   /*****************************************************************/ 05184000
*   /*                                                               */ 05185000
*   /* LOCAL REGISTER DECLARES                                       */ 05186000
*   /*                                                               */ 05187000
*   /*****************************************************************/ 05188000
*                                                               01S0379 05189000
*   DCL                                                         01S0379 05190000
*     CRPPTR REG(10) PTR(31) RSTD;                              01S0379 05191000
*   DCL                                                         01S0380 05192000
*     CRPBASE REG(3) PTR(31);                                   01S0380 05193000
*   DCL                                                         01S0381 05194000
*     CRPPTRA REG(15) PTR(31);                                  01S0381 05195000
*   DCL                                                         01S0382 05196000
*     CRPMSGID REG(2) PTR(31);                                  01S0382 05197000
*   DCL                                                         01S0383 05198000
*     CRPSTRNG REG(8) PTR(31);                                  01S0383 05199000
*   DCL                                                         01S0384 05200000
*     CRPVARDT REG(3) PTR(31);                                  01S0384 05201000
*   DCL                                                         01S0385 05202000
*     CRPADBUF REG(7) PTR(31);                                  01S0385 05203000
*   DCL                                                         01S0386 05204000
*     CRPREG15 REG(15) FIXED;                                   01S0386 05205000
*                                                               01S0386 05206000
*   /*****************************************************************/ 05207000
*   /*                                                               */ 05208000
*   /* LOCAL CONSTANTS AND OVERLAYS                                  */ 05209000
*   /*                                                               */ 05210000
*   /*****************************************************************/ 05211000
*                                                               01S0387 05212000
*   DCL                                                         01S0387 05213000
*     ZERO CONSTANT(0);                                         01S0387 05214000
*   DCL                                                         01S0388 05215000
*     ONE FIXED CONSTANT(1);                                    01S0388 05216000
*   DCL                                                         01S0389 05217000
*     ON BIT(1) CONSTANT('1'B);                                 01S0389 05218000
*   DCL                                                         01S0390 05219000
*     OFF BIT(1) CONSTANT('0'B);                                01S0390 05220000
*   DCL                                                         01S0391 05221000
*     BLANK CHAR(1) CONSTANT(' ');                              01S0391 05222000
*   DCL                                                         01S0392 05223000
*     COMMA CHAR(1) CONSTANT(',');                              01S0392 05224000
*   DCL                                                         01S0393 05225000
*     TWO FIXED CONSTANT(2);                                    01S0393 05226000
*   DCL                                                         01S0394 05227000
*     CHAR0 CHAR(1) CONSTANT('0');                              01S0394 05228000
*   DCL                                                         01S0395 05229000
*     CHAR9 CHAR(1) CONSTANT('9');                              01S0395 05230000
*   DCL                                                         01S0396 05231000
*     QUOTE BIT(8) CONSTANT('7D'X);                             01S0396 05232000
*   DCL                                                         01S0397 05233000
*     CRPWRO2(8) FIXED STATIC INIT(128,64,32,16,8,4,2,1);       01S0397 05234000
*   DCL                                                         01S0398 05235000
*     1 CRPREGSV BDY(WORD) BASED(CRPSVPT),/* REG SAVEAREA OVERLAY    */ 05236000
*       3 * PTR(31),                                            01S0398 05237000
*       3 CPCSVBKP PTR(31),         /* SAVEAREA BACKWARD POINTER     */ 05238000
*       3 CPCSVFWP PTR(31),         /* SAVEAREA FORWARD POINTER      */ 05239000
*       3 *(15) PTR(31);                                        01S0398 05240000
*   DCL                                                         01S0399 05241000
*     1 CRPWKA BASED(ADDR(OCWSCPAD)),                           01S0399 05242000
*      2 CRPNULL FIXED,             /* SIGNIFIES NULL REPLY IF  01S0399 05243000
*                                      GREATER THAN TWO              */ 05244000
*      2 CRPR14SV PTR,              /* REG 14 SAVE AREA ACROSS CALLS */ 05245000
*      2 CRPINDEX FIXED,            /* INDEX INTO REPLY BUFFER       */ 05246000
*      2 CRPDW,                     /* DOUBLE WORD FOR PACKING       */ 05247000
*       3 CRPBGN FIXED,             /* BGN OF REPLY TEXT             */ 05248000
*       3 CRPBUFLN FIXED,           /* LENGTH OF TEXT                */ 05249000
*      2 CRPNUM CHAR(2),            /* REP CHAR IN REPLY BUFFER      */ 05250000
*      2 CRPSTSW,                   /* STRUCTURE SWICHES FOR CRP     */ 05251000
*       3 CRPFND BIT(1),            /* ENTITY BEING SOUGHT IS FOUND     05252000
*                                      1=YES                         */ 05253000
*       3 CRPERR BIT(1),            /* WE HAVE ENCOUNTERED A SYNTAX     05254000
*                                      ERROR                         */ 05255000
*       3 CRPSAME BIT(1),           /* HAVE ENCOUNTERED TWO QUOTES IN   05256000
*                                      A ROW                         */ 05257000
*       3 * BIT(5);                 /* RSVD                          */ 05258000
*   DCL                                                         01S0400 05259000
*     CRPR13SV DEF(CRPINDEX) PTR(31);/* SAVE AREA FOR REG13          */ 05260000
*   DCL                                                         01S0401 05261000
*     CRPCHARA CHAR(1) BASED;       /* REPRESENTS CHAR IN REPLY BUFF */ 05262000
*   DCL                                                         01S0402 05263000
*     CRPCHARB CHAR(1) BASED;       /* REP CHAR IN REPLY BUFF        */ 05264000
*   DCL                                                         01S0403 05265000
*     CRPCHARC CHAR(1) BASED;       /* REP CHAR IN REPLY BUFF        */ 05266000
         EJECT                                                          05267000
*                                                               01S0404 05268000
*   /*****************************************************************/ 05269000
*   /*                                                               */ 05270000
*   /* MAINLINE CODE OF ISTCFCRP -- POI REPLY PROCESS                */ 05271000
*   /*                                                               */ 05272000
*   /*****************************************************************/ 05273000
*                                                               01S0404 05274000
*   DO;                             /* CRRMAINT PROCNM(ISTCFCRP)COMP(   05275000
*                                      CF)FUNC(SUB)RPHADD((CRPRPHPT))*/ 05276000
*                                                               01S0405 05277000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTCFCRR)                        */ 05278000
*/* END OF ATBUILD                                                   */ 05279000
*                                                               01S0405 05280000
*     /***************************************************************/ 05281000
*     /*                                                             */ 05282000
*     /* ** AUDIT TRAIL BITS WERE DELETED                            */ 05283000
*     /*                                                             */ 05284000
*     /***************************************************************/ 05285000
*                                                               01S0405 05286000
*   END;                            /* CRRMAINT                      */ 05287000
*   DO UNTIL(POPTXPTR->CRPCHARA^=BLANK);                        01S0406 05288000
*                                                               01S0406 05289000
@DL00406 DS    0H                                               01S0407 05290000
*     /***************************************************************/ 05291000
*     /*                                                             */ 05292000
*     /* THE LOOP SEARCHES FOR THE FIRST NON-BLANK CHARACTER         */ 05293000
*     /* PRESUMABLY THE BEGINNING OF THE REPLY NUMBER                */ 05294000
*     /*                                                             */ 05295000
*     /***************************************************************/ 05296000
*                                                               01S0407 05297000
*     POPTXPTR=POPTXPTR+1;          /* SPACES TO THE NEXT CHAR       */ 05298000
         LA    @11,360                                          01S0407 05299000
         ALR   @11,CRPOCWPT                                     01S0407 05300000
         LA    @07,1                                            01S0407 05301000
         AL    @07,POPTXPTR(,@11)                               01S0407 05302000
         ST    @07,POPTXPTR(,@11)                               01S0407 05303000
*   END;                                                        01S0408 05304000
@DE00406 L     @11,POPTXPTR+360(,CRPOCWPT)                      01S0408 05305000
         CLI   CRPCHARA(@11),C' '                               01S0408 05306000
         BE    @DL00406                                         01S0408 05307000
*   RFY                                                         01S0409 05308000
*     CRPSTRNG RSTD;                                            01S0409 05309000
*   CRPSTRNG=POPTXPTR;              /* SAVES THE VALUE OF TEXT PTR   */ 05310000
         LR    CRPSTRNG,@11                                     01S0410 05311000
*   CRPNULL=ZERO;                   /* INITS VALUE FOR LOOP          */ 05312000
*                                                               01S0411 05313000
         SLR   @11,@11                                          01S0411 05314000
         ST    @11,CRPNULL+180(,CRPOCWPT)                       01S0411 05315000
*   /*****************************************************************/ 05316000
*   /*                                                               */ 05317000
*   /* THE FOLLOWING LOOP PICKS OUT THE REPLY ID ASSUMING THERE IS   */ 05318000
*   /* ONE                                                           */ 05319000
*   /*                                                               */ 05320000
*   /*****************************************************************/ 05321000
*                                                               01S0412 05322000
*   DO UNTIL(CRPSTRNG->CRPCHARA=COMMA|CRPNULL>TWO);             01S0412 05323000
@DL00412 DS    0H                                               01S0413 05324000
*     CRPSTRNG=CRPSTRNG+1;          /* SPACES TO NEXT CHAR           */ 05325000
         LA    @11,1                                            01S0413 05326000
         ALR   CRPSTRNG,@11                                     01S0413 05327000
*     CRPNULL=CRPNULL+1;            /* KEEPS COUNT OF LENGTH OF REPLY   05328000
*                                      ID                            */ 05329000
         LA    @09,180                                          01S0414 05330000
         ALR   @09,CRPOCWPT                                     01S0414 05331000
         AL    @11,CRPNULL(,@09)                                01S0414 05332000
         ST    @11,CRPNULL(,@09)                                01S0414 05333000
*   END;                                                        01S0415 05334000
@DE00412 CLI   CRPCHARA(CRPSTRNG),C','                          01S0415 05335000
         BE    @DC00412                                         01S0415 05336000
         L     @11,CRPNULL+180(,CRPOCWPT)                       01S0415 05337000
         CH    @11,@CH00073                                     01S0415 05338000
         BNH   @DL00412                                         01S0415 05339000
@DC00412 DS    0H                                               01S0416 05340000
*   RFY                                                         01S0416 05341000
*     CRPADBUF RSTD;                                            01S0416 05342000
*PLSBUG:                                                        01S0417 05343000
*   CRPADBUF=ADDR(POPMSG);          /* GIVES US START ADD            */ 05344000
PLSBUG   LA    @11,360                                          01S0417 05345000
         ALR   @11,CRPOCWPT                                     01S0417 05346000
         LA    CRPADBUF,POPMSG(,@11)                            01S0417 05347000
*   CRPINDEX=(POPTXPTR-CRPADBUF)+1; /* GIVES START INDEX OF REP ID   */ 05348000
         LA    @09,180                                          01S0418 05349000
         ALR   @09,CRPOCWPT                                     01S0418 05350000
         LA    @05,1                                            01S0418 05351000
         L     @00,POPTXPTR(,@11)                               01S0418 05352000
         SLR   @00,CRPADBUF                                     01S0418 05353000
         ALR   @00,@05                                          01S0418 05354000
         ST    @00,CRPINDEX(,@09)                               01S0418 05355000
*   IF CRPNULL=ONE THEN                                         01S0419 05356000
         C     @05,CRPNULL(,@09)                                01S0419 05357000
         BNE   @RF00419                                         01S0419 05358000
*     DO;                           /* THE ID IS ONE CHAR IN LENGTH  */ 05359000
*       POPMSG(CRPINDEX-ONE)=CHAR0; /* FILL IN LEADING ZERO          */ 05360000
         LR    @05,@00                                          01S0421 05361000
         ALR   @05,@11                                          01S0421 05362000
         MVI   POPMSG-2(@05),C'0'                               01S0421 05363000
*       CRPNUM=POPMSG(CRPINDEX-1:CRPINDEX);/* SETS VALUE OF REP ID   */ 05364000
         ALR   @11,@00                                          01S0422 05365000
         MVC   CRPNUM(2,@09),POPMSG-2(@11)                      01S0422 05366000
*     END;                                                      01S0423 05367000
*   ELSE                            /* WE HAVE AN ID OF LENGTH TWO(AT   05368000
*                                      LEAST)                        */ 05369000
*     CRPNUM=POPMSG(CRPINDEX:CRPINDEX+1);/* SET REP ID               */ 05370000
         B     @RC00419                                         01S0424 05371000
@RF00419 LA    @11,180                                          01S0424 05372000
         ALR   @11,CRPOCWPT                                     01S0424 05373000
         L     @09,CRPINDEX(,@11)                               01S0424 05374000
         ALR   @09,CRPOCWPT                                     01S0424 05375000
         MVC   CRPNUM(2,@11),POPMSG+359(@09)                    01S0424 05376000
*   CRPSTSW=ZERO;                                               01S0425 05377000
@RC00419 MVI   CRPSTSW+180(CRPOCWPT),X'00'                      01S0425 05378000
*   CALL CRPCBSH;                   /* WILL SEARCH FOR CORRESPONDING    05379000
*                                      PORCB                         */ 05380000
         BAL   @14,CRPCBSH                                      01S0426 05381000
*   RFY                                                         01S0427 05382000
*     ISTPORCB BASED(CRPPTR);                                   01S0427 05383000
*   IF(CRPFND=ON&PORRTPQ=OFF)       /* IF THE PORCB IS FOUND AND        05384000
*                                      REPLY                         */ 05385000
*/*                                   HAS NOT YET BEEN SATISFIED     */ 05386000
*                                                               01S0428 05387000
*     THEN                                                      01S0428 05388000
         TM    CRPFND+180(CRPOCWPT),B'10000000'                 01S0428 05389000
         BNO   @RF00428                                         01S0428 05390000
         TM    PORRTPQ(CRPPTR),B'10000000'                      01S0428 05391000
         BNZ   @RF00428                                         01S0428 05392000
*     DO;                                                       01S0429 05393000
*                                                               01S0429 05394000
*       /*************************************************************/ 05395000
*       /*                                                           */ 05396000
*       /* REST OF PROGRAM SYNTAX CHECKS THE TEXT AND MOVES IT INTO  */ 05397000
*       /* PORCB IF VALID, WE WILL THEREFORE NOW OBTAIN RDT LOCK     */ 05398000
*       /* EXCLUSIVE                                                 */ 05399000
*       /*                                                           */ 05400000
*       /*************************************************************/ 05401000
*                                                               01S0430 05402000
*       DO;                         /* TPUNLOCK (RDTLOCK)            */ 05403000
*                                                               01S0431 05404000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */ 05405000
*/* END OF ATBUILD                                                   */ 05406000
*                                                               01S0431 05407000
*         DO;                                                   01S0431 05408000
*           RFY                                                 01S0432 05409000
*            (GPR00P,                                           01S0432 05410000
*             GPR01P,                                           01S0432 05411000
*             GPR02P,                                           01S0432 05412000
*             GPR03P,                                           01S0432 05413000
*             GPR04P,                                           01S0432 05414000
*             GPR15P) RSTD;                                     01S0432 05415000
*         END;                                                  01S0433 05416000
*         DO;                                                   01S0434 05417000
*         END;                                                  01S0435 05418000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    05419000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              05420000
*         GPR15P=ATCLCPTR->ATCAP33;                             01S0437 05421000
         L     @11,ATCLCPTR                                     01S0437 05422000
         L     GPR15P,ATCAP33(,@11)                             01S0437 05423000
*         GPR02P=ADDR(ATCRDTLK);    /* SET PARAM - LOCKWORD PTR      */ 05424000
         L     GPR02P,OCWACVT(,CRPOCWPT)                        01S0438 05425000
         LA    GPR02P,ATCRDTLK(,GPR02P)                         01S0438 05426000
*         GPR04P=GPR01P->RPHCRR;    /* SET PARAM - ISTCRA PTR        */ 05427000
         L     GPR04P,RPHCRR(,GPR01P)                           01S0439 05428000
*         GPR00P=CRALMS03;          /* SET PARAM - LOCK LEVEL FLAG   */ 05429000
         LA    GPR00P,4                                         01S0440 05430000
*         GPR03P=ADDR(GPR04P->CRAL3PTR);/* SET PARAM - LOCK LEVEL PTR*/ 05431000
         LA    GPR03P,CRAL3PTR(,GPR04P)                         01S0441 05432000
*         DCL                                                   01S0442 05433000
*           FMZL0016 BASED(GPR15P) LABEL VALUERANGE(*);         01S0442 05434000
*         CALL FMZL0016;                                        01S0443 05435000
         BALR  @14,@15                                          01S0443 05436000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,      05437000
*             GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,  05438000
*             GPR09P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);        05439000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               05440000
*         DO;                                                   01S0445 05441000
*           RFY                                                 01S0446 05442000
*            (GPR00P,                                           01S0446 05443000
*             GPR01P,                                           01S0446 05444000
*             GPR02P,                                           01S0446 05445000
*             GPR03P,                                           01S0446 05446000
*             GPR04P,                                           01S0446 05447000
*             GPR15P) UNRSTD;                                   01S0446 05448000
*         END;                                                  01S0447 05449000
*       END;                        /* TPUNLOCK                      */ 05450000
*       DO;                         /* TPLOCK (RDTLOCK) TYPE(XCLSIVE)*/ 05451000
*         DO;                                                   01S0450 05452000
*         END;                                                  01S0451 05453000
*         DO;                                                   01S0452 05454000
*           RFY                                                 01S0453 05455000
*            (GPR00P,                                           01S0453 05456000
*             GPR01P,                                           01S0453 05457000
*             GPR02P,                                           01S0453 05458000
*             GPR03P,                                           01S0453 05459000
*             GPR04P,                                           01S0453 05460000
*             GPR15P) RSTD;                                     01S0453 05461000
*         END;                                                  01S0454 05462000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    05463000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              05464000
*         GPR02P=ADDR(ATCRDTLK);    /* SET PARAM - LOCKWORD PTR      */ 05465000
         L     GPR02P,OCWACVT(,CRPOCWPT)                        01S0456 05466000
         LA    GPR02P,ATCRDTLK(,GPR02P)                         01S0456 05467000
*         GPR04P=GPR01P->RPHCRR;    /* SET PARAM - ISTCRA PTR        */ 05468000
         L     GPR04P,RPHCRR(,GPR01P)                           01S0457 05469000
*         GPR00P=CRALMS03;          /* SET PARAM - LOCK LEVEL FLAG   */ 05470000
         LA    GPR00P,4                                         01S0458 05471000
*         GPR03P=ADDR(GPR04P->CRAL3PTR);/* SET PARAM - LOCK LEVEL PTR*/ 05472000
         LA    GPR03P,CRAL3PTR(,GPR04P)                         01S0459 05473000
*         GPR15P=ATCLCPTR->ATCAP36; /* ADDRESS OF LOCK ROUTINE       */ 05474000
         L     @11,ATCLCPTR                                     01S0460 05475000
         L     GPR15P,ATCAP36(,@11)                             01S0460 05476000
*         DCL                                                   01S0461 05477000
*           FMZL0030 BASED(GPR15P) LABEL VALUERANGE(*);         01S0461 05478000
*         CALL FMZL0030;                                        01S0462 05479000
         BALR  @14,@15                                          01S0462 05480000
*         GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,      05481000
*             GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,  05482000
*             GPR09P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);        05483000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               05484000
*         DO;                                                   01S0464 05485000
*           RFY                                                 01S0465 05486000
*            (GPR00P,                                           01S0465 05487000
*             GPR01P,                                           01S0465 05488000
*             GPR02P,                                           01S0465 05489000
*             GPR03P,                                           01S0465 05490000
*             GPR04P,                                           01S0465 05491000
*             GPR15P) UNRSTD;                                   01S0465 05492000
*         END;                                                  01S0466 05493000
*       END;                        /* TPLOCK                        */ 05494000
*       RFY                                                     01S0468 05495000
*         CRPREG15 RSTD;                                        01S0468 05496000
*       IF CRPREG15=ZERO THEN                                   01S0469 05497000
         LTR   CRPREG15,CRPREG15                                01S0469 05498000
         BNZ   @RF00469                                         01S0469 05499000
*         DO;                                                   01S0470 05500000
*           RFY                                                 01S0471 05501000
*             CRPREG15 UNRSTD;                                  01S0471 05502000
*           IF CRPNULL>TWO THEN                                 01S0472 05503000
         L     @11,CRPNULL+180(,CRPOCWPT)                       01S0472 05504000
         CH    @11,@CH00073                                     01S0472 05505000
         BH    @RT00472                                         01S0472 05506000
*             ;                     /* SIGNIFIES TEXT IS NULL=> NO      05507000
*                                      MOVE INTO PORCB               */ 05508000
*           ELSE                                                01S0474 05509000
*             DO;                                               01S0474 05510000
*               PORMSG(1)=' ';      /* BLANK OUT REPLY AREA          */ 05511000
         MVI   PORMSG(CRPPTR),C' '                              01S0475 05512000
*               IF PORREPLN>1 THEN  /* BLANK OUT REST OF BUFF        */ 05513000
         CLI   PORREPLN(CRPPTR),1                               01S0476 05514000
         BNH   @RF00476                                         01S0476 05515000
*                 MVC(PORMSG(2:PORREPLN),PORMSG(1:PORREPLN-1)); 01S0477 05516000
         SLR   @11,@11                                          01S0477 05517000
         IC    @11,PORREPLN(,CRPPTR)                            01S0477 05518000
         BCTR  @11,0                                            01S0477 05519000
         BCTR  @11,0                                            01S0477 05520000
         EX    @11,@SM03470                                     01S0477 05521000
*               ELSE                                            01S0478 05522000
*                 ;                 /* BLANKS NOT NEEDED             */ 05523000
@RF00476 DS    0H                                               01S0479 05524000
*               CRPSTRNG=CRPSTRNG+1;/* SPACE TO FIRST CHAR OF TEXT   */ 05525000
         AH    CRPSTRNG,@CH00061                                01S0479 05526000
*               IF CRPSTRNG->CRPCHARA=QUOTE/* DO WE HAVE TEXT IN        05527000
*                                      QUOTES                        */ 05528000
*                 THEN                                          01S0480 05529000
         CLI   CRPCHARA(CRPSTRNG),X'7D'                         01S0480 05530000
         BNE   @RF00480                                         01S0480 05531000
*                 DO;                                           01S0481 05532000
*                   CRPBGN=(CRPSTRNG-CRPADBUF)+TWO;/* PROVIDES INDEX    05533000
*                                      FOR BEGIN OF TEXT             */ 05534000
*                                                               01S0482 05535000
         LR    @11,CRPSTRNG                                     01S0482 05536000
         SLR   @11,CRPADBUF                                     01S0482 05537000
         AH    @11,@CH00073                                     01S0482 05538000
         ST    @11,CRPBGN+180(,CRPOCWPT)                        01S0482 05539000
*                   /*************************************************/ 05540000
*                   /*                                               */ 05541000
*                   /* FOLLOWING SUBROUTINE EDITS THE BUFFER OF      */ 05542000
*                   /* EXTRANEOUS QUOTES AND DETERMINES LENGTH OF    */ 05543000
*                   /* TEXT                                          */ 05544000
*                   /*                                               */ 05545000
*                   /*************************************************/ 05546000
*                                                               01S0483 05547000
*                   CALL CRPEDIT;                               01S0483 05548000
         BAL   @14,CRPEDIT                                      01S0483 05549000
*                   IF CRPBUFLN>PORREPLN THEN                   01S0484 05550000
         L     @11,CRPBUFLN+180(,CRPOCWPT)                      01S0484 05551000
         SLR   @09,@09                                          01S0484 05552000
         IC    @09,PORREPLN(,CRPPTR)                            01S0484 05553000
         CR    @11,@09                                          01S0484 05554000
         BNH   @RF00484                                         01S0484 05555000
*                     DO;           /* THE TEXT IS LONGER THAN IS       05556000
*                                      ALLOWED FOR                   */ 05557000
*                                                               01S0485 05558000
*                       /*********************************************/ 05559000
*                       /*                                           */ 05560000
*                       /* ERROR LOGIC (SYNTAX ERROR ) FOLLOWS       */ 05561000
*                       /*                                           */ 05562000
*                       /*********************************************/ 05563000
*                                                               01S0486 05564000
*                       RPLRTNCD='08'X;/* SET RPL RET CODE           */ 05565000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0486 05566000
         MVI   RPLRTNCD(@11),X'08'                              01S0486 05567000
*                       RPLFDB2='6E'X;/* SET RPL RET CODE            */ 05568000
         MVI   RPLFDB2(@11),X'6E'                               01S0487 05569000
*                       POPMSGID='193I';/* SET ERR MSG ID FOR TPMSG  */ 05570000
         MVC   POPMSGID+360(4,CRPOCWPT),@CC03399                01S0488 05571000
*                       CALL CRPMSG;/* TPMSG SUBROUTINE              */ 05572000
         BAL   @14,CRPMSG                                       01S0489 05573000
*                       CRPERR=ON;  /* SIGNAL TO PROG THAT WE HAVE      05574000
*                                      ERROR                         */ 05575000
         OI    CRPERR+180(CRPOCWPT),B'01000000'                 01S0490 05576000
*                     END;                                      01S0491 05577000
*                   ELSE                                        01S0492 05578000
*                     DO;                                       01S0492 05579000
*                                                               01S0492 05580000
         B     @RC00484                                         01S0492 05581000
@RF00484 DS    0H                                               01S0493 05582000
*                       /*********************************************/ 05583000
*                       /*                                           */ 05584000
*                       /* TEXT IS OF CORRECT LENGTH                 */ 05585000
*                       /*                                           */ 05586000
*                       /*********************************************/ 05587000
*                                                               01S0493 05588000
*                       CRPERR=OFF; /* NO ERROR HERE                 */ 05589000
*                                                               01S0493 05590000
         LA    @11,180                                          01S0493 05591000
         ALR   @11,CRPOCWPT                                     01S0493 05592000
         NI    CRPERR(@11),B'10111111'                          01S0493 05593000
*                       /*********************************************/ 05594000
*                       /*                                           */ 05595000
*                       /* MOVE REPLY TEXT INTO PORCB                */ 05596000
*                       /*                                           */ 05597000
*                       /*********************************************/ 05598000
*                                                               01S0494 05599000
*                       PORMSG(1:CRPBUFLN)=POPMSG(CRPBGN:CRPBGN+        05600000
*                           CRPBUFLN);                          01S0494 05601000
         L     @09,CRPBUFLN(,@11)                               01S0494 05602000
         BCTR  @09,0                                            01S0494 05603000
         L     @11,CRPBGN(,@11)                                 01S0494 05604000
         ALR   @11,CRPOCWPT                                     01S0494 05605000
         EX    @09,@SM03474                                     01S0494 05606000
*                     END;                                      01S0495 05607000
*                 END;                                          01S0496 05608000
*               ELSE                                            01S0497 05609000
*                 DO;               /* THERE IS NO QUOTE AFTER THE      05610000
*                                      REPLY ID                      */ 05611000
         B     @RC00480                                         01S0497 05612000
@RF00480 DS    0H                                               01S0498 05613000
*                   CRPBGN=(CRPSTRNG-CRPADBUF)+1;/* SET INDEX TO BGN    05614000
*                                      OF TEXT                       */ 05615000
*                                                               01S0498 05616000
         LA    @11,180                                          01S0498 05617000
         ALR   @11,CRPOCWPT                                     01S0498 05618000
         LR    @09,CRPSTRNG                                     01S0498 05619000
         SLR   @09,CRPADBUF                                     01S0498 05620000
         AH    @09,@CH00061                                     01S0498 05621000
         ST    @09,CRPBGN(,@11)                                 01S0498 05622000
*                   /*************************************************/ 05623000
*                   /*                                               */ 05624000
*                   /* LENGTH OF REPLY TEXT WILL BE COMPUTED         */ 05625000
*                   /*                                               */ 05626000
*                   /*************************************************/ 05627000
*                                                               01S0499 05628000
*                   CRPNULL=(((RPLRLEN-4)+CRPADBUF)-CRPSTRNG);  01S0499 05629000
         L     @09,OCWRPL(,CRPOCWPT)                            01S0499 05630000
         L     @09,RPLRLEN(,@09)                                01S0499 05631000
         SH    @09,@CH00053                                     01S0499 05632000
         ALR   @09,CRPADBUF                                     01S0499 05633000
         SLR   @09,CRPSTRNG                                     01S0499 05634000
         ST    @09,CRPNULL(,@11)                                01S0499 05635000
*                   IF CRPNULL>PORREPLN|CRPNULL=0/* TOO LONG? OR        05636000
*                                      INVALID NULL FORMAT           */ 05637000
*                     THEN                                      01S0500 05638000
         SLR   @11,@11                                          01S0500 05639000
         IC    @11,PORREPLN(,CRPPTR)                            01S0500 05640000
         CR    @09,@11                                          01S0500 05641000
         BH    @RT00500                                         01S0500 05642000
         LTR   @09,@09                                          01S0500 05643000
         BNZ   @RF00500                                         01S0500 05644000
@RT00500 DS    0H                                               01S0501 05645000
*                     DO;           /* ERROR FOUND                   */ 05646000
*                                                               01S0501 05647000
*                       /*********************************************/ 05648000
*                       /*                                           */ 05649000
*                       /* ERROR LOGIC (SYNTAX ERROR ) FOLLOWS       */ 05650000
*                       /*                                           */ 05651000
*                       /*********************************************/ 05652000
*                                                               01S0502 05653000
*                       RPLRTNCD='08'X;/* SET RPL RET CODE           */ 05654000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0502 05655000
         MVI   RPLRTNCD(@11),X'08'                              01S0502 05656000
*                       RPLFDB2='6E'X;/* SET RPL RET CODE            */ 05657000
         MVI   RPLFDB2(@11),X'6E'                               01S0503 05658000
*                       POPMSGID='193I';/* SET ERR MSG ID FOR TPMSG  */ 05659000
         MVC   POPMSGID+360(4,CRPOCWPT),@CC03399                01S0504 05660000
*                       CALL CRPMSG;/* TPMSG SUBROUTINE              */ 05661000
         BAL   @14,CRPMSG                                       01S0505 05662000
*                       CRPERR=ON;  /* SIGNAL TO PROG THAT WE HAVE      05663000
*                                      ERROR                         */ 05664000
         OI    CRPERR+180(CRPOCWPT),B'01000000'                 01S0506 05665000
*                     END;                                      01S0507 05666000
*                   ELSE                                        01S0508 05667000
*                     DO;                                       01S0508 05668000
         B     @RC00500                                         01S0508 05669000
@RF00500 DS    0H                                               01S0509 05670000
*                       CRPERR=OFF; /* NO ERROR FOUND                */ 05671000
*                                                               01S0509 05672000
         LA    @11,180                                          01S0509 05673000
         ALR   @11,CRPOCWPT                                     01S0509 05674000
         NI    CRPERR(@11),B'10111111'                          01S0509 05675000
*                       /*********************************************/ 05676000
*                       /*                                           */ 05677000
*                       /* PUTS THE MESSAGE TEXT INTO THE PORCB      */ 05678000
*                       /*                                           */ 05679000
*                       /*********************************************/ 05680000
*                                                               01S0510 05681000
*                       PORMSG(1:CRPNULL)=POPMSG(CRPBGN:CRPBGN+CRPNULL) 05682000
*                           ;                                   01S0510 05683000
         L     @09,CRPNULL(,@11)                                01S0510 05684000
         BCTR  @09,0                                            01S0510 05685000
         L     @11,CRPBGN(,@11)                                 01S0510 05686000
         ALR   @11,CRPOCWPT                                     01S0510 05687000
         EX    @09,@SM03474                                     01S0510 05688000
*                     END;                                      01S0511 05689000
*                 END;                                          01S0512 05690000
@RC00500 DS    0H                                               01S0513 05691000
*             END;                                              01S0513 05692000
@RC00480 DS    0H                                               01S0514 05693000
*           IF CRPERR^=ON           /* NO ERROR FOUND YET            */ 05694000
*             THEN                                              01S0514 05695000
@RT00472 LA    @11,180                                          01S0514 05696000
         ALR   @11,CRPOCWPT                                     01S0514 05697000
         TM    CRPERR(@11),B'01000000'                          01S0514 05698000
         BO    @RF00514                                         01S0514 05699000
*             DO;                                               01S0515 05700000
*                                                               01S0515 05701000
*               /*****************************************************/ 05702000
*               /*                                                   */ 05703000
*               /* FOLLOWING INSTRUCTIONS CONVERT THE REP ID TO      */ 05704000
*               /* DECIMAL SO THE APPROPRIATE BIT IN THE POCB CAN BE */ 05705000
*               /* TURNED OFF THIS WILL SIGNIFY THAT THIS REPLY HAS  */ 05706000
*               /* BEEN SATISFIED AND THEREFORE THE REP ID CAN BE    */ 05707000
*               /* USED AGAIN                                        */ 05708000
*               /*                                                   */ 05709000
*               /*****************************************************/ 05710000
*                                                               01S0516 05711000
*               PACK(CRPDW,POREPID);/* PACKS VALUE OF REP ID         */ 05712000
         PACK  CRPDW(8,@11),POREPID(2,CRPPTR)                   01S0516 05713000
*               RFY                                             01S0517 05714000
*                 CRPBASE RSTD;                                 01S0517 05715000
*               CVB(CRPBASE,CRPDW); /* CONVERTS VALUE TO BINARY      */ 05716000
         CVB   CRPBASE,CRPDW(,@11)                              01S0518 05717000
*               RFY                                             01S0519 05718000
*                 CRPREG15 RSTD;                                01S0519 05719000
*                                                               01S0519 05720000
*               /*****************************************************/ 05721000
*               /*                                                   */ 05722000
*               /* FOLLOWING RFY WILL POINT CRPCHARA TO THE BYTE CON-*/ 05723000
*               /* TAINING THE BIT TO BE TURNED OFF                  */ 05724000
*               /*                                                   */ 05725000
*               /*****************************************************/ 05726000
*                                                               01S0520 05727000
*               RFY                                             01S0520 05728000
*                 CRPCHARA BASED(EVAL(ADDR(POCRPGEN)+CRPBASE/8));       05729000
*               CRPREG15=CRPWRO2((CRPBASE//8)+1);/* DETERMINES WHICH    05730000
*                                      BIT SEQUENCE WILL BE USED TO     05731000
*                                      TURN OFF CORRECT BIT WITH AN     05732000
*                                      AND                           */ 05733000
         LR    @14,CRPBASE                                      01S0521 05734000
         SRDA  @14,32                                           01S0521 05735000
         D     @14,@CF00059                                     01S0521 05736000
         SLA   @14,2                                            01S0521 05737000
         L     CRPREG15,CRPWRO2(@14)                            01S0521 05738000
*               CRPREG15=255-CRPREG15;/* LOAD THE ONE'S COMPLEMENT   */ 05739000
         LA    @14,255                                          01S0522 05740000
         SLR   @14,CRPREG15                                     01S0522 05741000
         LR    CRPREG15,@14                                     01S0522 05742000
*               CRPCHARA=CRPCHARA&CRPREG15;/* AND TO TURN OFF BIT    */ 05743000
         LA    @14,POCRPGEN(,CRPPOCB)                           01S0523 05744000
         LR    @11,CRPBASE                                      01S0523 05745000
         SRL   @11,3                                            01S0523 05746000
         ALR   @11,@14                                          01S0523 05747000
         LR    @09,CRPBASE                                      01S0523 05748000
         SRL   @09,3                                            01S0523 05749000
         ALR   @14,@09                                          01S0523 05750000
         SLR   @09,@09                                          01S0523 05751000
         IC    @09,CRPCHARA(,@14)                               01S0523 05752000
         NR    @09,CRPREG15                                     01S0523 05753000
         STC   @09,CRPCHARA(,@11)                               01S0523 05754000
*               RFY                                             01S0524 05755000
*                 CRPREG15 UNRSTD;                              01S0524 05756000
*                                                               01S0524 05757000
*               /*****************************************************/ 05758000
*               /*                                                   */ 05759000
*               /* WE WILL NOW TPQUE THE PORCB AS A WORK ELEMENT TO  */ 05760000
*               /* THE POI DYPPAB TO CLEAN IT UP AND POST VTAM THE   */ 05761000
*               /* MESSAGE TEXT WILL ALSO BE MOVED FROM IT TO VTAM   */ 05762000
*               /* REPLY AREA                                        */ 05763000
*               /*                                                   */ 05764000
*               /*****************************************************/ 05765000
*                                                               01S0525 05766000
*               POMFWD=CRPPOCB;     /* SAVE POCB PTR TO PASS IT TO      05767000
*                                      CFCR2,THE REP PURGE ROUTINE   */ 05768000
         ICM   @11,7,PORPOMCB(CRPPTR)                           01S0525 05769000
         STCM  CRPPOCB,7,POMFWD(@11)                            01S0525 05770000
*               DO;                 /* TPQUE (CRPPTR,DYPPAB) NORM    */ 05771000
*                 DO;                                           01S0527 05772000
*                   RFY                                         01S0528 05773000
*                    (GPR00P,                                   01S0528 05774000
*                     GPR01P,                                   01S0528 05775000
*                     GPR04P,                                   01S0528 05776000
*                     GPR05P,                                   01S0528 05777000
*                     GPR15P) RSTD;                             01S0528 05778000
*                 END;                                          01S0529 05779000
*                 DO;                                           01S0530 05780000
*                 END;                                          01S0531 05781000
*                 GEN REFS(GPR01P) SETS(RPHWORK)                01S0532 05782000
*                     (STM GPR02P,GPR08P,RPHWORK(GPR01P));      01S0532 05783000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              05784000
*                 GPR00P=0;                                     01S0533 05785000
         SLR   GPR00P,GPR00P                                    01S0533 05786000
*                 GPR15P=ADDR(DYPPAB);                          01S0534 05787000
         L     GPR15P,OCWACVT(,CRPOCWPT)                        01S0534 05788000
         LA    GPR15P,DYPPAB+184(,GPR15P)                       01S0534 05789000
*                 GPR04P=CRPPTR;    /* WORK ELE PTR                  */ 05790000
         LR    GPR04P,CRPPTR                                    01S0535 05791000
*                 GPR05P=GPR15P;    /* PASS PAB PTR                  */ 05792000
         LR    GPR05P,GPR15P                                    01S0536 05793000
*                 CALL ATCLCPTR->ATCAP37->ISTAPC37;             01S0537 05794000
         L     @11,ATCLCPTR                                     01S0537 05795000
         L     @15,ATCAP37(,@11)                                01S0537 05796000
         BALR  @14,@15                                          01S0537 05797000
*                 GEN(DC BL2'00000')                            01S0538 05798000
*                 NOSETS NOREFS;                                01S0538 05799000
         DC BL2'00000'                                                  05800000
*                 DO;                                           01S0539 05801000
*                   RFY                                         01S0540 05802000
*                    (GPR00P,                                   01S0540 05803000
*                     GPR01P,                                   01S0540 05804000
*                     GPR04P,                                   01S0540 05805000
*                     GPR05P,                                   01S0540 05806000
*                     GPR15P) UNRSTD;                           01S0540 05807000
*                 END;                                          01S0541 05808000
*               END;                /* TPQUE                         */ 05809000
*               PORRTPQ=ON;         /* SHOWS THAT REPLY HAS ALREADY     05810000
*                                      BEEN SATISFIED                */ 05811000
         OI    PORRTPQ(CRPPTR),B'10000000'                      01S0543 05812000
*               RPLRTNCD='00'X;     /* SET SUCCESSFUL RET CODE       */ 05813000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0544 05814000
         MVI   RPLRTNCD(@11),X'00'                              01S0544 05815000
*               RPLFDB2='00'X;      /* SET SUCCESSFUL RET CODES      */ 05816000
         MVI   RPLFDB2(@11),X'00'                               01S0545 05817000
*             END;                                              01S0546 05818000
*           ELSE                                                01S0547 05819000
*             ;                                                 01S0547 05820000
*                                                               01S0547 05821000
@RF00514 DS    0H                                               01S0548 05822000
*/*   WE WILL NOW RESTORE THE RDT LOCK TO SHARED                     */ 05823000
*                                                               01S0548 05824000
*           DO;                     /* TPUNLOCK (RDTLOCK)            */ 05825000
*                                                               01S0549 05826000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */ 05827000
*/* END OF ATBUILD                                                   */ 05828000
*                                                               01S0549 05829000
*             DO;                                               01S0549 05830000
*               RFY                                             01S0550 05831000
*                (GPR00P,                                       01S0550 05832000
*                 GPR01P,                                       01S0550 05833000
*                 GPR02P,                                       01S0550 05834000
*                 GPR03P,                                       01S0550 05835000
*                 GPR04P,                                       01S0550 05836000
*                 GPR15P) RSTD;                                 01S0550 05837000
*             END;                                              01S0551 05838000
*             DO;                                               01S0552 05839000
*             END;                                              01S0553 05840000
*             GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK) 05841000
*                 ;                                             01S0554 05842000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              05843000
*             GPR15P=ATCLCPTR->ATCAP33;                         01S0555 05844000
         L     @11,ATCLCPTR                                     01S0555 05845000
         L     GPR15P,ATCAP33(,@11)                             01S0555 05846000
*             GPR02P=ADDR(ATCRDTLK);/* SET PARAM - LOCKWORD PTR      */ 05847000
         L     GPR02P,OCWACVT(,CRPOCWPT)                        01S0556 05848000
         LA    GPR02P,ATCRDTLK(,GPR02P)                         01S0556 05849000
*             GPR04P=GPR01P->RPHCRR;/* SET PARAM - ISTCRA PTR        */ 05850000
         L     GPR04P,RPHCRR(,GPR01P)                           01S0557 05851000
*             GPR00P=CRALMS03;      /* SET PARAM - LOCK LEVEL FLAG   */ 05852000
         LA    GPR00P,4                                         01S0558 05853000
*             GPR03P=ADDR(GPR04P->CRAL3PTR);/* SET PARAM - LOCK LEVEL   05854000
*                                      PTR                           */ 05855000
         LA    GPR03P,CRAL3PTR(,GPR04P)                         01S0559 05856000
*             DCL                                               01S0560 05857000
*               FMZL0058 BASED(GPR15P) LABEL VALUERANGE(*);     01S0560 05858000
*             CALL FMZL0058;                                    01S0561 05859000
         BALR  @14,@15                                          01S0561 05860000
*             GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,  05861000
*                 GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,     05862000
*                 GPR08P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,     05863000
*                 GPR15P);                                      01S0562 05864000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               05865000
*             DO;                                               01S0563 05866000
*               RFY                                             01S0564 05867000
*                (GPR00P,                                       01S0564 05868000
*                 GPR01P,                                       01S0564 05869000
*                 GPR02P,                                       01S0564 05870000
*                 GPR03P,                                       01S0564 05871000
*                 GPR04P,                                       01S0564 05872000
*                 GPR15P) UNRSTD;                               01S0564 05873000
*             END;                                              01S0565 05874000
*           END;                    /* TPUNLOCK                      */ 05875000
*           DO;                     /* TPLOCK (RDTLOCK) TYPE(SHARE)  */ 05876000
*             DO;                                               01S0568 05877000
*             END;                                              01S0569 05878000
*             DO;                                               01S0570 05879000
*               RFY                                             01S0571 05880000
*                (GPR00P,                                       01S0571 05881000
*                 GPR01P,                                       01S0571 05882000
*                 GPR02P,                                       01S0571 05883000
*                 GPR03P,                                       01S0571 05884000
*                 GPR04P,                                       01S0571 05885000
*                 GPR15P) RSTD;                                 01S0571 05886000
*             END;                                              01S0572 05887000
*             GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK) 05888000
*                 ;                                             01S0573 05889000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              05890000
*             GPR02P=ADDR(ATCRDTLK);/* SET PARAM - LOCKWORD PTR      */ 05891000
         L     GPR02P,OCWACVT(,CRPOCWPT)                        01S0574 05892000
         LA    GPR02P,ATCRDTLK(,GPR02P)                         01S0574 05893000
*             GPR04P=GPR01P->RPHCRR;/* SET PARAM - ISTCRA PTR        */ 05894000
         L     GPR04P,RPHCRR(,GPR01P)                           01S0575 05895000
*             GPR00P=CRALMS03;      /* SET PARAM - LOCK LEVEL FLAG   */ 05896000
         LA    GPR00P,4                                         01S0576 05897000
*             GPR03P=ADDR(GPR04P->CRAL3PTR);/* SET PARAM - LOCK LEVEL   05898000
*                                      PTR                           */ 05899000
         LA    GPR03P,CRAL3PTR(,GPR04P)                         01S0577 05900000
*             GPR15P=ATCLCPTR->ATCAP35;/* ADDRESS OF LOCK ROUTINE    */ 05901000
         L     @11,ATCLCPTR                                     01S0578 05902000
         L     GPR15P,ATCAP35(,@11)                             01S0578 05903000
*             DCL                                               01S0579 05904000
*               FMZL0072 BASED(GPR15P) LABEL VALUERANGE(*);     01S0579 05905000
*             CALL FMZL0072;                                    01S0580 05906000
         BALR  @14,@15                                          01S0580 05907000
*             GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,  05908000
*                 GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,     05909000
*                 GPR08P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,     05910000
*                 GPR15P);                                      01S0581 05911000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               05912000
*             DO;                                               01S0582 05913000
*               RFY                                             01S0583 05914000
*                (GPR00P,                                       01S0583 05915000
*                 GPR01P,                                       01S0583 05916000
*                 GPR02P,                                       01S0583 05917000
*                 GPR03P,                                       01S0583 05918000
*                 GPR04P,                                       01S0583 05919000
*                 GPR15P) UNRSTD;                               01S0583 05920000
*             END;                                              01S0584 05921000
*           END;                    /* TPLOCK                        */ 05922000
*           RFY                                                 01S0586 05923000
*             CRPREG15 RSTD;                                    01S0586 05924000
*           IF CRPREG15=ZERO THEN                               01S0587 05925000
         LTR   CRPREG15,CRPREG15                                01S0587 05926000
         BZ    @RT00587                                         01S0587 05927000
*             ;                     /* TPLOCK SUCCESSFUL             */ 05928000
*           ELSE                                                01S0589 05929000
*             DO;                                               01S0589 05930000
*               RPLRTNCD='24'X;     /* TPLOCK NOT ABLE TO BE RESTORED*/ 05931000
         L     @14,OCWRPL(,CRPOCWPT)                            01S0590 05932000
         MVI   RPLRTNCD(@14),X'24'                              01S0590 05933000
*               RPLFDB2='06'X;                                  01S0591 05934000
         MVI   RPLFDB2(@14),X'06'                               01S0591 05935000
*             END;                                              01S0592 05936000
*           RFY                                                 01S0593 05937000
*             CRPREG15 UNRSTD;                                  01S0593 05938000
@RT00587 DS    0H                                               01S0594 05939000
*         END;                                                  01S0594 05940000
*       ELSE                                                    01S0595 05941000
*         DO;                                                   01S0595 05942000
         B     @RC00469                                         01S0595 05943000
@RF00469 DS    0H                                               01S0596 05944000
*           RPLRTNCD='24'X;         /* TPLOCK NOT OBTAINED COULD NOT    05945000
*                                      CONTINUE PROCESS              */ 05946000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0596 05947000
         MVI   RPLRTNCD(@11),X'24'                              01S0596 05948000
*           RPLFDB2='06'X;                                      01S0597 05949000
         MVI   RPLFDB2(@11),X'06'                               01S0597 05950000
*         END;                                                  01S0598 05951000
*     END;                                                      01S0599 05952000
*   ELSE                                                        01S0600 05953000
*                                                               01S0600 05954000
*/* EITHER THE REPLY HAS ALREADY BEEN SATISFIED OR  NOT FOUND        */ 05955000
*                                                               01S0600 05956000
*     IF CRPFND=OFF THEN                                        01S0600 05957000
         B     @RC00428                                         01S0600 05958000
@RF00428 LA    @11,180                                          01S0600 05959000
         ALR   @11,CRPOCWPT                                     01S0600 05960000
         TM    CRPFND(@11),B'10000000'                          01S0600 05961000
         BNZ   @RF00600                                         01S0600 05962000
*       DO;                                                     01S0601 05963000
*         IF(CRPNUM(1)<CHAR0|CRPNUM(1)>CHAR9|CRPNUM(2)<CHAR0|CRPNUM(2)> 05964000
*             CHAR9) THEN                                       01S0602 05965000
         CLI   CRPNUM(@11),C'0'                                 01S0602 05966000
         BL    @RT00602                                         01S0602 05967000
         CLI   CRPNUM(@11),C'9'                                 01S0602 05968000
         BH    @RT00602                                         01S0602 05969000
         CLI   CRPNUM+1(@11),C'0'                               01S0602 05970000
         BL    @RT00602                                         01S0602 05971000
         CLI   CRPNUM+1(@11),C'9'                               01S0602 05972000
         BNH   @RF00602                                         01S0602 05973000
@RT00602 DS    0H                                               01S0603 05974000
*           DO;                     /* THE REPLY ID IS NON-NUMERIC      05975000
*                                      AND INVALID                   */ 05976000
*             RPLRTNCD='08'X;       /* RPL ERROR CODE                */ 05977000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0604 05978000
         MVI   RPLRTNCD(@11),X'08'                              01S0604 05979000
*             RPLFDB2='6E'X;        /* RPL ERROR CODE                */ 05980000
         MVI   RPLFDB2(@11),X'6E'                               01S0605 05981000
*             POPMSGID='195I';      /* SET MSG ID FOR TPMSG          */ 05982000
         MVC   POPMSGID+360(4,CRPOCWPT),@CC03409                01S0606 05983000
*             CALL CRPMSG;                                      01S0607 05984000
         BAL   @14,CRPMSG                                       01S0607 05985000
*           END;                                                01S0608 05986000
*         ELSE                                                  01S0609 05987000
*           DO;                     /* REPLY DOES NOT EXIST          */ 05988000
         B     @RC00602                                         01S0609 05989000
@RF00602 DS    0H                                               01S0610 05990000
*             RPLRTNCD='08'X;       /* RPL ERROR CODE                */ 05991000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0610 05992000
         MVI   RPLRTNCD(@11),X'08'                              01S0610 05993000
*             RPLFDB2='6E'X;        /* RPL ERROR CODE                */ 05994000
         MVI   RPLFDB2(@11),X'6E'                               01S0611 05995000
*             POPMSGID='194I';      /* SET MSGID FOR TPMSG           */ 05996000
         MVC   POPMSGID+360(4,CRPOCWPT),@CC03410                01S0612 05997000
*             CALL CRPMSG;                                      01S0613 05998000
         BAL   @14,CRPMSG                                       01S0613 05999000
*           END;                                                01S0614 06000000
*       END;                                                    01S0615 06001000
*     ELSE                                                      01S0616 06002000
*       DO;                         /* THE REPLY MUST HAVE ALREADY      06003000
*                                      BEEN SATISFIED                */ 06004000
         B     @RC00600                                         01S0616 06005000
@RF00600 DS    0H                                               01S0617 06006000
*         RPLRTNCD='08'X;           /* RPL ERROR CODE                */ 06007000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0617 06008000
         MVI   RPLRTNCD(@11),X'08'                              01S0617 06009000
*         RPLFDB2='6E'X;            /* RPL ERROR CODE                */ 06010000
         MVI   RPLFDB2(@11),X'6E'                               01S0618 06011000
*         POPMSGID='194I';          /* SET MSG ID FOR TPMSG          */ 06012000
         MVC   POPMSGID+360(4,CRPOCWPT),@CC03410                01S0619 06013000
*         CALL CRPMSG;                                          01S0620 06014000
         BAL   @14,CRPMSG                                       01S0620 06015000
*       END;                                                    01S0621 06016000
         EJECT                                                          06017000
*CRPMSG:                                                        01S0622 06018000
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                            01S0622 06019000
*                                                               01S0622 06020000
         B     @PB00002                                         01S0622 06021000
CRPMSG   DS    0H                                               01S0623 06022000
*   /*****************************************************************/ 06023000
*   /*                                                               */ 06024000
*   /* THIS ROUTINE SETS UP AREAS TO ISSUE A TPMSG. AREAS ARE        */ 06025000
*   /* INITIALIZED IN POPWA                                          */ 06026000
*   /*                                                               */ 06027000
*   /*****************************************************************/ 06028000
*                                                               01S0623 06029000
*   RFY                                                         01S0623 06030000
*    (CRPRTPT,                                                  01S0623 06031000
*     CRPSVPT) RSTD;                                            01S0623 06032000
*   CRPR14SV=CRPRTPT;               /* REG 14 IS SAVED FOR RETURN @  */ 06033000
         LA    @15,180                                          01S0624 06034000
         ALR   @15,CRPOCWPT                                     01S0624 06035000
         ST    CRPRTPT,CRPR14SV(,@15)                           01S0624 06036000
*   CRPR13SV=CRPSVPT;               /* REG 13 SAVE AREA @ IS SAVED   */ 06037000
         ST    CRPSVPT,CRPR13SV(,@15)                           01S0625 06038000
*   RFY                                                         01S0626 06039000
*     CRPRTPT UNRSTD;                                           01S0626 06040000
*   CRPSVPT=ADDR(POPSAVE);          /* PROVIDES SAVE AREA FOR TPMSG  */ 06041000
         LA    @11,360                                          01S0627 06042000
         ALR   @11,CRPOCWPT                                     01S0627 06043000
         LA    CRPSVPT,POPSAVE(,@11)                            01S0627 06044000
*   RFY                                                         01S0628 06045000
*    (CRPMSGID,                                                 01S0628 06046000
*     CRPVARDT) RSTD;                                           01S0628 06047000
*   CRPMSGID=ADDR(POPMSGID);        /* SET POINTER TO MSG ID         */ 06048000
         LA    CRPMSGID,POPMSGID(,@11)                          01S0629 06049000
*   CRPVARDT=ADDR(CRPNUM);          /* SET PTR TO VAR DATA           */ 06050000
         LA    CRPVARDT,CRPNUM(,@15)                            01S0630 06051000
*   DO;                             /* TPMSG MSGID((CRPMSGID))MSG((CR   06052000
*                                      PVARDT))OPTIONS(POPTPOPT)PLARE   06053000
*                                      A(POPPLA)                     */ 06054000
*     DO;                                                       01S0632 06055000
*       RFY                                                     01S0633 06056000
*        (GPR01P,                                               01S0633 06057000
*         GPR13P) RSTD;                                         01S0633 06058000
*     END;                                                      01S0634 06059000
*     DCL                                                       01S0635 06060000
*       1 * BASED(GPR01P),                                      01S0635 06061000
*        2 CMZID086 PTR(31),                                    01S0635 06062000
*        2 *,                                                   01S0635 06063000
*         3 CMZRL086 PTR(8),                                    01S0635 06064000
*         3 CMZRA086 PTR(24) BDY(BYTE),                         01S0635 06065000
*        2 CMZEA086 PTR(31),                                    01S0635 06066000
*        2 CMZVP086 PTR(31);                                    01S0635 06067000
*                                                               01S0635 06068000
*/*XREGSET  PID('PLAREA')PPARM(POPPLA)RREG(,GPR01P)                  */ 06069000
*                                                               01S0636 06070000
*     DO;                                                       01S0636 06071000
*       GPR01P=ADDR(POPPLA);        /* SET RREG SYMBOL TO ADDRESS OF    06072000
*                                      PPARM OPERAND                 */ 06073000
         LA    GPR01P,POPPLA(,@11)                              01S0637 06074000
*     END;                          /* XREGSET                       */ 06075000
*     CMZID086=0;                                               01S0639 06076000
         SLR   @09,@09                                          01S0639 06077000
         ST    @09,CMZID086(,GPR01P)                            01S0639 06078000
*     CMZRL086=0;                                               01S0640 06079000
         MVI   CMZRL086(GPR01P),X'00'                           01S0640 06080000
*     CMZRA086=0;                                               01S0641 06081000
         STCM  @09,7,CMZRA086(GPR01P)                           01S0641 06082000
*     CMZEA086=0;                                               01S0642 06083000
         ST    @09,CMZEA086(,GPR01P)                            01S0642 06084000
*     CMZVP086=0;                                               01S0643 06085000
         ST    @09,CMZVP086(,GPR01P)                            01S0643 06086000
*     CMZID086=CRPMSGID;                                        01S0644 06087000
         ST    CRPMSGID,CMZID086(,GPR01P)                       01S0644 06088000
*     CMZVP086=CRPVARDT;                                        01S0645 06089000
         ST    CRPVARDT,CMZVP086(,GPR01P)                       01S0645 06090000
*     DCL                                                       01S0646 06091000
*       CMZSA086(18) PTR(31) BASED(GPR13P);                     01S0646 06092000
*     CMZSA086(5)=ADDR(POPTPOPT);                               01S0647 06093000
         LA    @11,POPTPOPT(,@11)                               01S0647 06094000
         ST    @11,CMZSA086+16(,GPR13P)                         01S0647 06095000
*     DO;                                                       01S0648 06096000
*       RFY                                                     01S0649 06097000
*        (GPR15P) RSTD;                                         01S0649 06098000
*     END;                                                      01S0650 06099000
*     DO;                           /* LISATCVT                 01S0651 06100000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 06101000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 06102000
         L     GPR15P,ATCLCPTR                                  01S0652 06103000
*     END;                          /* LISATCVT                      */ 06104000
*     DCL                                                       01S0654 06105000
*       CMTA086 BASED(GPR15P) ENTRY VALUERANGE(*);              01S0654 06106000
*     GPR15P=GPR15P->ATCMSGP;                                   01S0655 06107000
         L     GPR15P,ATCMSGP(,GPR15P)                          01S0655 06108000
*     CALL CMTA086;                                             01S0656 06109000
         BALR  @14,@15                                          01S0656 06110000
*     DO;                                                       01S0657 06111000
*       RFY                                                     01S0658 06112000
*        (GPR01P,                                               01S0658 06113000
*         GPR13P,                                               01S0658 06114000
*         GPR15P) UNRSTD;                                       01S0658 06115000
*     END;                                                      01S0659 06116000
*   END;                            /* TPMSG                         */ 06117000
*   RFY                                                         01S0661 06118000
*    (CRPMSGID,                                                 01S0661 06119000
*     CRPVARDT) UNRSTD;                                         01S0661 06120000
*   RFY                                                         01S0662 06121000
*     CRPRTPT RSTD;                                             01S0662 06122000
*   CRPRPHPT=OCWRPH;                /* RESTORE RPH ADD               */ 06123000
         L     CRPRPHPT,OCWRPH(,CRPOCWPT)                       01S0663 06124000
*   CRPRTPT=CRPR14SV;               /* RESTORE RET @                 */ 06125000
         LA    @11,180                                          01S0664 06126000
         ALR   @11,CRPOCWPT                                     01S0664 06127000
         L     CRPRTPT,CRPR14SV(,@11)                           01S0664 06128000
*   CRPSVPT=CRPR13SV;               /* RESTORE SAVE AREA @           */ 06129000
         L     CRPSVPT,CRPR13SV(,@11)                           01S0665 06130000
*   RETURN;                                                     01S0666 06131000
@EL00002 DS    0H                                               01S0666 06132000
@EF00002 DS    0H                                               01S0666 06133000
@ER00002 BR    @14                                              01S0666 06134000
*   RFY                                                         01S0667 06135000
*     CRPRTPT UNRSTD;                                           01S0667 06136000
*   END CRPMSG;                                                 01S0668 06137000
         EJECT                                                          06138000
*CRPEDIT:                                                       01S0669 06139000
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                            01S0669 06140000
CRPEDIT  DS    0H                                               01S0670 06141000
*   RFY                                                         01S0670 06142000
*     CRPRTPT RSTD;                                             01S0670 06143000
*   CRPR14SV=CRPRTPT;                                           01S0671 06144000
         LA    @15,180                                          01S0671 06145000
         ALR   @15,CRPOCWPT                                     01S0671 06146000
         ST    CRPRTPT,CRPR14SV(,@15)                           01S0671 06147000
*   RFY                                                         01S0672 06148000
*     CRPRTPT UNRSTD;                                           01S0672 06149000
*   RFY                                                         01S0673 06150000
*    (CRPBASE,                                                  01S0673 06151000
*     CRPPTRA) RSTD;                                            01S0673 06152000
*   RFY                                                         01S0674 06153000
*     CRPCHARA BASED(CRPPTRA);                                  01S0674 06154000
*   RFY                                                         01S0675 06155000
*     CRPCHARB BASED(CRPBASE);                                  01S0675 06156000
*   RFY                                                         01S0676 06157000
*     CRPCHARC BASED(CRPSTRNG);     /* THIS WILL BE THE ACTUAL TEXT     06158000
*                                      PTR                           */ 06159000
*/*                                               AFTER IT IS EDITED */ 06160000
*                                                               01S0677 06161000
*   CRPPTRA=CRPSTRNG+TWO;           /* SET TO SECOND CHAR IN TEXT    */ 06162000
         LA    CRPPTRA,2                                        01S0677 06163000
         ALR   CRPPTRA,CRPSTRNG                                 01S0677 06164000
*   CRPBASE=CRPSTRNG+ONE;           /* SET TO FIRST CHAR IN TEXT     */ 06165000
         LA    CRPBASE,1                                        01S0678 06166000
         ALR   CRPBASE,CRPSTRNG                                 01S0678 06167000
*   CRPSTRNG=CRPBASE;               /* SET TO FIRST CHAR IN TEXT     */ 06168000
         LR    CRPSTRNG,CRPBASE                                 01S0679 06169000
*   CRPFND=OFF;                     /* INIT BIT                      */ 06170000
*   CRPSAME=OFF;                    /* SIGNALS THAT WE HAVE FOUND TWO   06171000
*                                      CONSECUTIVE QUOTES            */ 06172000
         LA    @14,180                                          01S0681 06173000
         ALR   @14,CRPOCWPT                                     01S0681 06174000
         NI    CRPFND(@14),B'01011111'                          01S0681 06175000
*   CRPBUFLN=ZERO;                                              01S0682 06176000
*                                                               01S0682 06177000
         SLR   @11,@11                                          01S0682 06178000
         ST    @11,CRPBUFLN(,@14)                               01S0682 06179000
*   /*****************************************************************/ 06180000
*   /*                                                               */ 06181000
*   /* THE FOLLOWING LOOP WILL USE THREE POINTERS: TWO TO TELL US    */ 06182000
*   /* WHEN WE HAVE HIT UPON A DOUBLE QUOTE COMBIN-                  */ 06183000
*   /* NATION(CHARA,CHARB) AND THE THIRD TO KEEP TRACK OF WHERE WE   */ 06184000
*   /* ARE IN ACTUAL TEXT. THERE WILL ALSO BE A A TOTAL TEXT CTR SO  */ 06185000
*   /* THAT WE DONT EXCEED 126 CHARS                                 */ 06186000
*   /*                                                               */ 06187000
*   /*****************************************************************/ 06188000
*                                                               01S0683 06189000
*   DO WHILE(CRPFND=OFF&CRPBUFLN<=RPLRLEN);                     01S0683 06190000
         B     @DE00683                                         01S0683 06191000
@DL00683 DS    0H                                               01S0684 06192000
*     IF(CRPCHARA=QUOTE&CRPCHARB=QUOTE) THEN                    01S0684 06193000
         CLI   CRPCHARA(CRPPTRA),X'7D'                          01S0684 06194000
         BNE   @RF00684                                         01S0684 06195000
         CLI   CRPCHARB(CRPBASE),X'7D'                          01S0684 06196000
         BNE   @RF00684                                         01S0684 06197000
*       DO;                         /* WE HAVE A DOUBLE QUOTE TO BE     06198000
*                                      REDUCED TO A SINGLE QUOTE     */ 06199000
*         CRPSAME=ON;               /* SIGNAL FOR DOUBLE QUOTE       */ 06200000
         OI    CRPSAME+180(CRPOCWPT),B'00100000'                01S0686 06201000
*         CRPPTRA=CRPPTRA+ONE;      /* ADVANCE PTR                   */ 06202000
         LA    @14,1                                            01S0687 06203000
         ALR   CRPPTRA,@14                                      01S0687 06204000
*         CRPBASE=CRPBASE+ONE;      /* ADVANCE PTR                   */ 06205000
         ALR   CRPBASE,@14                                      01S0688 06206000
*       END;                                                    01S0689 06207000
*     ELSE                                                      01S0690 06208000
*       ;                                                       01S0690 06209000
@RF00684 DS    0H                                               01S0691 06210000
*     CRPCHARC=CRPCHARB;            /* IF THEY DIFFER(IE WE HAVE HIT    06211000
*                                      DOU. QUOTE) THEN THIS WILL       06212000
*                                      EDIT BUFFER CORRECTLY         */ 06213000
         MVC   CRPCHARC(1,CRPSTRNG),CRPCHARB(CRPBASE)           01S0691 06214000
*     IF CRPSAME=OFF&CRPCHARC=QUOTE /* END OF BUFFER TEXT?           */ 06215000
*       THEN                                                    01S0692 06216000
         LA    @14,180                                          01S0692 06217000
         ALR   @14,CRPOCWPT                                     01S0692 06218000
         TM    CRPSAME(@14),B'00100000'                         01S0692 06219000
         BNZ   @RF00692                                         01S0692 06220000
         CLI   CRPCHARC(CRPSTRNG),X'7D'                         01S0692 06221000
         BNE   @RF00692                                         01S0692 06222000
*       CRPFND=ON;                  /* WE WANT TO EXIT LOOP          */ 06223000
         OI    CRPFND(@14),B'10000000'                          01S0693 06224000
*     ELSE                                                      01S0694 06225000
*       DO;                         /* ADVANCE ALL POINTERS AND 01S0694 06226000
*                                      REINIT FLAGS                  */ 06227000
         B     @RC00692                                         01S0694 06228000
@RF00692 DS    0H                                               01S0695 06229000
*         CRPSAME=OFF;                                          01S0695 06230000
         NI    CRPSAME+180(CRPOCWPT),B'11011111'                01S0695 06231000
*         CRPPTRA=CRPPTRA+ONE;                                  01S0696 06232000
         LA    @14,1                                            01S0696 06233000
         ALR   CRPPTRA,@14                                      01S0696 06234000
*         CRPBASE=CRPBASE+ONE;                                  01S0697 06235000
         ALR   CRPBASE,@14                                      01S0697 06236000
*         CRPSTRNG=CRPSTRNG+ONE;                                01S0698 06237000
         ALR   CRPSTRNG,@14                                     01S0698 06238000
*       END;                                                    01S0699 06239000
*     CRPBUFLN=((CRPBASE-CRPADBUF)+ONE);/* COMPUTE TOTAL LENGTH SO      06240000
*                                      FAR                           */ 06241000
@RC00692 LR    @14,CRPBASE                                      01S0700 06242000
         SLR   @14,CRPADBUF                                     01S0700 06243000
         AH    @14,@CH00061                                     01S0700 06244000
         ST    @14,CRPBUFLN+180(,CRPOCWPT)                      01S0700 06245000
*   END;                                                        01S0701 06246000
@DE00683 LA    @14,180                                          01S0701 06247000
         ALR   @14,CRPOCWPT                                     01S0701 06248000
         TM    CRPFND(@14),B'10000000'                          01S0701 06249000
         BNZ   @DC00683                                         01S0701 06250000
         L     @11,OCWRPL(,CRPOCWPT)                            01S0701 06251000
         L     @14,CRPBUFLN(,@14)                               01S0701 06252000
         C     @14,RPLRLEN(,@11)                                01S0701 06253000
         BNH   @DL00683                                         01S0701 06254000
@DC00683 DS    0H                                               01S0702 06255000
*   CRPBUFLN=(CRPSTRNG-CRPADBUF)-(CRPBGN-ONE);/* ACTUAL LEN OF TEXT  */ 06256000
         LA    @14,180                                          01S0702 06257000
         ALR   @14,CRPOCWPT                                     01S0702 06258000
         LR    @11,CRPSTRNG                                     01S0702 06259000
         SLR   @11,CRPADBUF                                     01S0702 06260000
         L     @09,CRPBGN(,@14)                                 01S0702 06261000
         BCTR  @09,0                                            01S0702 06262000
         SLR   @11,@09                                          01S0702 06263000
         ST    @11,CRPBUFLN(,@14)                               01S0702 06264000
*   RFY                                                         01S0703 06265000
*    (CRPBASE,                                                  01S0703 06266000
*     CRPPTRA) UNRSTD;                                          01S0703 06267000
*   RFY                                                         01S0704 06268000
*     CRPRTPT RSTD;                                             01S0704 06269000
*   CRPRTPT=CRPR14SV;               /* RESTORE RETURN @              */ 06270000
         LA    @11,180                                          01S0705 06271000
         ALR   @11,CRPOCWPT                                     01S0705 06272000
         L     CRPRTPT,CRPR14SV(,@11)                           01S0705 06273000
*   RETURN;                                                     01S0706 06274000
@EL00003 DS    0H                                               01S0706 06275000
@EF00003 DS    0H                                               01S0706 06276000
@ER00003 BR    @14                                              01S0706 06277000
*   RFY                                                         01S0707 06278000
*     CRPRTPT UNRSTD;                                           01S0707 06279000
*   END CRPEDIT;                                                01S0708 06280000
         EJECT                                                          06281000
*CRPCBSH:                                                       01S0709 06282000
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                            01S0709 06283000
*                                                               01S0709 06284000
CRPCBSH  DS    0H                                               01S0710 06285000
*   /*****************************************************************/ 06286000
*   /*                                                               */ 06287000
*   /* THIS SUBROUTINE SEARCHES FOR A PROCB WITH A MATCHING REPLY    */ 06288000
*   /* NUMBER                                                        */ 06289000
*   /*                                                               */ 06290000
*   /*****************************************************************/ 06291000
*                                                               01S0710 06292000
*   RFY                                                         01S0710 06293000
*     CRPRTPT RSTD;                                             01S0710 06294000
*   CRPR14SV=CRPRTPT;                                           01S0711 06295000
         LA    @15,180                                          01S0711 06296000
         ALR   @15,CRPOCWPT                                     01S0711 06297000
         ST    CRPRTPT,CRPR14SV(,@15)                           01S0711 06298000
*   RFY                                                         01S0712 06299000
*     CRPRTPT UNRSTD;                                           01S0712 06300000
*   RFY                                                         01S0713 06301000
*     CRPBASE RSTD;                                             01S0713 06302000
*   IF POCAWTRQ=ZERO                /* NO AWAITING REPLIES           */ 06303000
*     THEN                                                      01S0714 06304000
         ICM   @11,7,POCAWTRQ(CRPPOCB)                          01S0714 06305000
         BNZ   @RF00714                                         01S0714 06306000
*     CRPFND=OFF;                   /* IT WAS NOT FOUND              */ 06307000
         NI    CRPFND(@15),B'01111111'                          01S0715 06308000
*   ELSE                                                        01S0716 06309000
*     DO;                                                       01S0716 06310000
         B     @RC00714                                         01S0716 06311000
@RF00714 DS    0H                                               01S0717 06312000
*       CRPPTR=POCAWTRQ;            /* SET PTR TO AWAIT. REP. QUEUE  */ 06313000
         SLR   CRPPTR,CRPPTR                                    01S0717 06314000
         ICM   CRPPTR,7,POCAWTRQ(CRPPOCB)                       01S0717 06315000
*       CRPBASE=CRPPTR;                                         01S0718 06316000
         LR    CRPBASE,CRPPTR                                   01S0718 06317000
*       RFY                                                     01S0719 06318000
*         ISTPORCB BASED(CRPPTR);                               01S0719 06319000
*                                                               01S0719 06320000
*       /*************************************************************/ 06321000
*       /*                                                           */ 06322000
*       /* THIS LOOP SEARCHES QUEUE FOR MATCH IN REP ID IF MATCH IS  */ 06323000
*       /* FOUND, PORCB ADDRESS WILL BE IN CRPPTR                    */ 06324000
*       /*                                                           */ 06325000
*       /*************************************************************/ 06326000
*                                                               01S0720 06327000
*       DO UNTIL(PORFWD=ZERO|CRPFND=ON);                        01S0720 06328000
@DL00720 DS    0H                                               01S0721 06329000
*         CRPPTR=CRPBASE;                                       01S0721 06330000
         LR    CRPPTR,CRPBASE                                   01S0721 06331000
*         IF CRPNUM=POREPID         /* IF THE REP IDS MATCH          */ 06332000
*           THEN                                                01S0722 06333000
         LA    @11,180                                          01S0722 06334000
         ALR   @11,CRPOCWPT                                     01S0722 06335000
         CLC   CRPNUM(2,@11),POREPID(CRPPTR)                    01S0722 06336000
         BNE   @RF00722                                         01S0722 06337000
*           CRPFND=ON;              /* WE WANT TO EXIT LOOP          */ 06338000
         OI    CRPFND(@11),B'10000000'                          01S0723 06339000
*         ELSE                                                  01S0724 06340000
*           CRPBASE=PORFWD;         /* POINT TO NEXT PORCB           */ 06341000
         B     @RC00722                                         01S0724 06342000
@RF00722 SLR   CRPBASE,CRPBASE                                  01S0724 06343000
         ICM   CRPBASE,7,PORFWD(CRPPTR)                         01S0724 06344000
*       END;                                                    01S0725 06345000
@RC00722 DS    0H                                               01S0725 06346000
@DE00720 ICM   @11,7,PORFWD(CRPPTR)                             01S0725 06347000
         BZ    @DC00720                                         01S0725 06348000
         TM    CRPFND+180(CRPOCWPT),B'10000000'                 01S0725 06349000
         BNO   @DL00720                                         01S0725 06350000
@DC00720 DS    0H                                               01S0726 06351000
*     END;                                                      01S0726 06352000
*   RFY                                                         01S0727 06353000
*     CRPBASE UNRSTD;                                           01S0727 06354000
@RC00714 DS    0H                                               01S0728 06355000
*   RFY                                                         01S0728 06356000
*     CRPRTPT RSTD;                                             01S0728 06357000
*   CRPRTPT=CRPR14SV;               /* RESTORE RET @                 */ 06358000
         L     CRPRTPT,CRPR14SV+180(,CRPOCWPT)                  01S0729 06359000
*   RETURN;                                                     01S0730 06360000
@EL00004 DS    0H                                               01S0730 06361000
@EF00004 DS    0H                                               01S0730 06362000
@ER00004 BR    @14                                              01S0730 06363000
*   RFY                                                         01S0731 06364000
*     CRPRTPT UNRSTD;                                           01S0731 06365000
*   END CRPCBSH;                                                01S0732 06366000
@PB00004 DS    0H                                               01S0733 06367000
*   DO;                             /* TPEPILOG                      */ 06368000
*     GEN(PRINT OFF);                                           01S0734 06369000
         PRINT OFF                                                      06370000
*     DO;                                                       01S0735 06371000
*       DCL                                                     01S0736 06372000
*         GPR00F FIXED(31) REG(00),                             01S0736 06373000
*         GPR00P PTR(31) REG(00),                               01S0736 06374000
*         GPR01F FIXED(31) REG(01),                             01S0736 06375000
*         GPR01P PTR(31) REG(01),                               01S0736 06376000
*         GPR02F FIXED(31) REG(02),                             01S0736 06377000
*         GPR02P PTR(31) REG(02),                               01S0736 06378000
*         GPR03F FIXED(31) REG(03),                             01S0736 06379000
*         GPR03P PTR(31) REG(03),                               01S0736 06380000
*         GPR04F FIXED(31) REG(04),                             01S0736 06381000
*         GPR04P PTR(31) REG(04),                               01S0736 06382000
*         GPR05F FIXED(31) REG(05),                             01S0736 06383000
*         GPR05P PTR(31) REG(05),                               01S0736 06384000
*         GPR06F FIXED(31) REG(06),                             01S0736 06385000
*         GPR06P PTR(31) REG(06),                               01S0736 06386000
*         GPR07F FIXED(31) REG(07),                             01S0736 06387000
*         GPR07P PTR(31) REG(07),                               01S0736 06388000
*         GPR08F FIXED(31) REG(08),                             01S0736 06389000
*         GPR08P PTR(31) REG(08),                               01S0736 06390000
*         GPR09F FIXED(31) REG(09),                             01S0736 06391000
*         GPR09P PTR(31) REG(09),                               01S0736 06392000
*         GPR10F FIXED(31) REG(10),                             01S0736 06393000
*         GPR10P PTR(31) REG(10),                               01S0736 06394000
*         GPR11F FIXED(31) REG(11),                             01S0736 06395000
*         GPR11P PTR(31) REG(11),                               01S0736 06396000
*         GPR12F FIXED(31) REG(12),                             01S0736 06397000
*         GPR12P PTR(31) REG(12),                               01S0736 06398000
*         GPR13F FIXED(31) REG(13),                             01S0736 06399000
*         GPR13P PTR(31) REG(13),                               01S0736 06400000
*         GPR14F FIXED(31) REG(14),                             01S0736 06401000
*         GPR14P PTR(31) REG(14),                               01S0736 06402000
*         GPR15F FIXED(31) REG(15),                             01S0736 06403000
*         GPR15P PTR(31) REG(15);                               01S0736 06404000
*     END;                                                      01S0737 06405000
*     DECLARE                                                   01S0738 06406000
*       EMCR0 PTR REG(0),                                       01S0738 06407000
*       EMCR1 PTR REG(1),                                       01S0738 06408000
*       EMCR2 PTR REG(2),                                       01S0738 06409000
*       EMCR3 PTR REG(3),                                       01S0738 06410000
*       EMCR4 PTR REG(4),                                       01S0738 06411000
*       EMCR5 PTR REG(5),                                       01S0738 06412000
*       EMCR6 PTR REG(6),                                       01S0738 06413000
*       EMCR7 PTR REG(7),                                       01S0738 06414000
*       EMCR8 PTR REG(8),                                       01S0738 06415000
*       EMCR9 PTR REG(9),                                       01S0738 06416000
*       EMCR10 PTR REG(10),                                     01S0738 06417000
*       EMCR11 PTR REG(11),                                     01S0738 06418000
*       EMCR12 PTR REG(12),                                     01S0738 06419000
*       EMCR13 PTR REG(13),                                     01S0738 06420000
*       EMCR14 PTR REG(14),                                     01S0738 06421000
*       EMCR15 PTR REG(15);                                     01S0738 06422000
*     DO;                                                       01S0739 06423000
*       DCL                                                     01S0740 06424000
*         ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE    */ 06425000
*       DCL                                                     01S0741 06426000
*         ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE    */ 06427000
*     END;                                                      01S0742 06428000
*     GEN(PRINT ON);                                            01S0743 06429000
         PRINT ON                                                       06430000
*   END;                            /* TPEPILOG                      */ 06431000
*   END ISTCFCRP                                                01S0745 06432000
*                                                               01S0745 06433000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 06434000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 06435000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 06436000
*/*%INCLUDE SYSLIB  (IFGRPLVS)                                       */ 06437000
*/*%INCLUDE SYSLIB  (ISTRPLEX)                                       */ 06438000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 06439000
*                                                               01S0745 06440000
*       ;                                                       01S0745 06441000
@EL00001 DS    0H                                               01S0745 06442000
@EF00001 DS    0H                                               01S0745 06443000
@ER00001 LM    @14,@12,12(@13)                                  01S0745 06444000
         BR    @14                                              01S0745 06445000
@DATA    DS    0H                                                       06446000
@CH00061 DC    H'1'                                                     06447000
@CH00073 DC    H'2'                                                     06448000
@CH00053 DC    H'4'                                                     06449000
@SM03470 MVC   PORMSG+1(0,CRPPTR),PORMSG(CRPPTR)                        06450000
@SM03474 MVC   PORMSG(0,CRPPTR),POPMSG+359(@11)                         06451000
@DATD    DSECT                                                          06452000
         DS    0F                                                       06453000
ISTCFCRP CSECT                                                          06454000
         DS    0F                                                       06455000
@CF00059 DC    F'8'                                                     06456000
@DATD    DSECT                                                          06457000
         DS    0D                                                       06458000
CVTPTR   DS    A                                                        06459000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                06460000
@ENDDATD EQU   *                                                        06461000
ISTCFCRP CSECT                                                          06462000
         DS    0F                                                       06463000
@SIZDATD DC    AL1(0)                                                   06464000
         DC    AL3(@ENDDATD-@DATD)                                      06465000
         DS    0D                                                       06466000
@CC03399 DC    C'193I'                                                  06467000
@CC03409 DC    C'195I'                                                  06468000
@CC03410 DC    C'194I'                                                  06469000
CRPWRO2  DC    F'128'                                                   06470000
         DC    F'64'                                                    06471000
         DC    F'32'                                                    06472000
         DC    F'16'                                                    06473000
         DC    F'8'                                                     06474000
         DC    F'4'                                                     06475000
         DC    F'2'                                                     06476000
         DC    F'1'                                                     06477000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       06478000
@01      EQU   01                                                       06479000
@02      EQU   02                                                       06480000
@03      EQU   03                                                       06481000
@04      EQU   04                                                       06482000
@05      EQU   05                                                       06483000
@06      EQU   06                                                       06484000
@07      EQU   07                                                       06485000
@08      EQU   08                                                       06486000
@09      EQU   09                                                       06487000
@10      EQU   10                                                       06488000
@11      EQU   11                                                       06489000
@12      EQU   12                                                       06490000
@13      EQU   13                                                       06491000
@14      EQU   14                                                       06492000
@15      EQU   15                                                       06493000
RPHPTR   EQU   @01                                                      06494000
CRPRPHPT EQU   @01                                                      06495000
CRPOCWPT EQU   @04                                                      06496000
CRPPOCB  EQU   @06                                                      06497000
BASEREG  EQU   @12                                                      06498000
CRPSVPT  EQU   @13                                                      06499000
CRPRTPT  EQU   @14                                                      06500000
CRPPTR   EQU   @10                                                      06501000
CRPBASE  EQU   @03                                                      06502000
CRPPTRA  EQU   @15                                                      06503000
CRPMSGID EQU   @02                                                      06504000
CRPSTRNG EQU   @08                                                      06505000
CRPVARDT EQU   @03                                                      06506000
CRPADBUF EQU   @07                                                      06507000
CRPREG15 EQU   @15                                                      06508000
GPR00P   EQU   @00                                                      06509000
GPR01P   EQU   @01                                                      06510000
GPR02P   EQU   @02                                                      06511000
GPR03P   EQU   @03                                                      06512000
GPR04P   EQU   @04                                                      06513000
GPR15P   EQU   @15                                                      06514000
GPR05P   EQU   @05                                                      06515000
GPR06P   EQU   @06                                                      06516000
GPR07P   EQU   @07                                                      06517000
GPR08P   EQU   @08                                                      06518000
GPR09P   EQU   @09                                                      06519000
GPR10P   EQU   @10                                                      06520000
GPR11P   EQU   @11                                                      06521000
GPR12P   EQU   @12                                                      06522000
GPR13P   EQU   @13                                                      06523000
GPR14P   EQU   @14                                                      06524000
EMCR0    EQU   @00                                                      06525000
EMCR1    EQU   @01                                                      06526000
EMCR10   EQU   @10                                                      06527000
EMCR11   EQU   @11                                                      06528000
EMCR12   EQU   @12                                                      06529000
EMCR13   EQU   @13                                                      06530000
EMCR14   EQU   @14                                                      06531000
EMCR15   EQU   @15                                                      06532000
EMCR2    EQU   @02                                                      06533000
EMCR3    EQU   @03                                                      06534000
EMCR4    EQU   @04                                                      06535000
EMCR5    EQU   @05                                                      06536000
EMCR6    EQU   @06                                                      06537000
EMCR7    EQU   @07                                                      06538000
EMCR8    EQU   @08                                                      06539000
EMCR9    EQU   @09                                                      06540000
GPR00F   EQU   @00                                                      06541000
GPR01F   EQU   @01                                                      06542000
GPR02F   EQU   @02                                                      06543000
GPR03F   EQU   @03                                                      06544000
GPR04F   EQU   @04                                                      06545000
GPR05F   EQU   @05                                                      06546000
GPR06F   EQU   @06                                                      06547000
GPR07F   EQU   @07                                                      06548000
GPR08F   EQU   @08                                                      06549000
GPR09F   EQU   @09                                                      06550000
GPR10F   EQU   @10                                                      06551000
GPR11F   EQU   @11                                                      06552000
GPR12F   EQU   @12                                                      06553000
GPR13F   EQU   @13                                                      06554000
GPR14F   EQU   @14                                                      06555000
GPR15F   EQU   @15                                                      06556000
ATCLCPTR EQU   1032                                                     06557000
CVTMAP   EQU   0                                                        06558000
CVTDAR   EQU   CVTMAP+72                                                06559000
CVTFLGS1 EQU   CVTDAR                                                   06560000
CVTDCB   EQU   CVTMAP+116                                               06561000
CVTIERLC EQU   CVTMAP+144                                               06562000
CVTOPTA  EQU   CVTMAP+182                                               06563000
CVTOPTB  EQU   CVTMAP+183                                               06564000
CVTGTF   EQU   CVTMAP+236                                               06565000
CVTGTFST EQU   CVTGTF                                                   06566000
CVTGTFS  EQU   CVTGTFST                                                 06567000
CVTSTATE EQU   CVTGTFST                                                 06568000
CVTTMODE EQU   CVTGTFST                                                 06569000
CVTFORM  EQU   CVTGTFST                                                 06570000
CVTAQAVT EQU   CVTMAP+240                                               06571000
CVTTCMFG EQU   CVTAQAVT                                                 06572000
CVTVOLM2 EQU   CVTMAP+244                                               06573000
CVTTATA  EQU   CVTVOLM2                                                 06574000
CVTTSKS  EQU   CVTTATA                                                  06575000
CVTVOLF2 EQU   CVTTSKS                                                  06576000
CVTTAT   EQU   CVTTATA+1                                                06577000
CVTATER  EQU   CVTMAP+248                                               06578000
CVTEXT1  EQU   CVTMAP+252                                               06579000
CVTPURG  EQU   CVTMAP+260                                               06580000
CVTQMSG  EQU   CVTMAP+268                                               06581000
CVTDMSR  EQU   CVTMAP+272                                               06582000
CVTRSV37 EQU   CVTDMSR                                                  06583000
CVTDMSRF EQU   CVTRSV37                                                 06584000
CVTERPV  EQU   CVTMAP+316                                               06585000
CVTINTLA EQU   CVTMAP+320                                               06586000
CVTAPF   EQU   CVTMAP+324                                               06587000
CVTEXT2  EQU   CVTMAP+328                                               06588000
CVTHJES  EQU   CVTMAP+332                                               06589000
CVTPGSIA EQU   CVTMAP+348                                               06590000
CVTA1F1  EQU   CVTMAP+356                                               06591000
CVTSYSK  EQU   CVTMAP+357                                               06592000
CVTVOLM1 EQU   CVTMAP+380                                               06593000
CVTVOLF1 EQU   CVTVOLM1                                                 06594000
CVTXTNT1 EQU   0                                                        06595000
CVTXTNT2 EQU   0                                                        06596000
CVTDSSV  EQU   CVTXTNT2                                                 06597000
CVTFLGBT EQU   CVTXTNT2+5                                               06598000
CVTQID   EQU   CVTXTNT2+24                                              06599000
CVTRV400 EQU   CVTXTNT2+52                                              06600000
CVTRV409 EQU   CVTXTNT2+53                                              06601000
CVTATCVT EQU   CVTXTNT2+64                                              06602000
CVTRV429 EQU   CVTXTNT2+84                                              06603000
CVTRV438 EQU   CVTXTNT2+85                                              06604000
CVTRV457 EQU   CVTXTNT2+112                                             06605000
CVTRV466 EQU   CVTXTNT2+113                                             06606000
CVTFIX   EQU   0                                                        06607000
CVTRELNO EQU   CVTFIX+252                                               06608000
IFGRPL   EQU   0                                                        06609000
RPLCOMN  EQU   IFGRPL                                                   06610000
RPLIDWD  EQU   RPLCOMN                                                  06611000
RPLLEN   EQU   RPLIDWD+3                                                06612000
RPLECB   EQU   RPLCOMN+8                                                06613000
RPLFDBWD EQU   RPLCOMN+12                                               06614000
RPLFDBK  EQU   RPLFDBWD+1                                               06615000
RPLRTNCD EQU   RPLFDBK                                                  06616000
RPLCNDCD EQU   RPLFDBK+1                                                06617000
RPLCMPON EQU   RPLCNDCD                                                 06618000
RPLFDB2  EQU   RPLCMPON                                                 06619000
RPLERRCD EQU   RPLCNDCD+1                                               06620000
RPLFDB3  EQU   RPLERRCD                                                 06621000
RPLKEYLE EQU   RPLCOMN+16                                               06622000
RPLARG   EQU   RPLCOMN+36                                               06623000
RPLOPTCD EQU   RPLCOMN+40                                               06624000
RPLOPT1  EQU   RPLOPTCD                                                 06625000
RPLECBSW EQU   RPLOPT1                                                  06626000
RPLOPT2  EQU   RPLOPTCD+1                                               06627000
RPLADR   EQU   RPLOPT2                                                  06628000
RPLOPT3  EQU   RPLOPTCD+2                                               06629000
RPLOPT4  EQU   RPLOPTCD+3                                               06630000
RPLNXTRP EQU   RPLCOMN+44                                               06631000
RPLRLEN  EQU   RPLCOMN+48                                               06632000
RPLOPTC2 EQU   RPLCOMN+56                                               06633000
RPLOPT5  EQU   RPLOPTC2                                                 06634000
RPLWRTYP EQU   RPLOPT5                                                  06635000
RPLOPT6  EQU   RPLOPTC2+1                                               06636000
RPLUNTYP EQU   RPLOPT6                                                  06637000
RPLOPT7  EQU   RPLOPTC2+2                                               06638000
RPLCNOPT EQU   RPLOPT7                                                  06639000
RPLOPT8  EQU   RPLOPTC2+3                                               06640000
RPLRBAR  EQU   RPLCOMN+60                                               06641000
RPLAIXID EQU   RPLRBAR+2                                                06642000
RPLEXTDS EQU   RPLCOMN+68                                               06643000
RPLEXTD1 EQU   RPLEXTDS                                                 06644000
RPLVTEXT EQU   IFGRPL+76                                                06645000
RPLFDBK2 EQU   RPLVTEXT+12                                              06646000
RPLSSNSI EQU   RPLFDBK2                                                 06647000
RPLDSB   EQU   RPLSSNSI                                                 06648000
RPLDSB1  EQU   RPLDSB                                                   06649000
RPLSSEI  EQU   RPLDSB1                                                  06650000
RPLDSB2  EQU   RPLDSB+1                                                 06651000
RPLUSNSI EQU   RPLFDBK2+2                                               06652000
RPLOPTC3 EQU   RPLVTEXT+20                                              06653000
RPLOPT9  EQU   RPLOPTC3                                                 06654000
RPLOPT10 EQU   RPLOPTC3+1                                               06655000
RPLOPT11 EQU   RPLOPTC3+2                                               06656000
RPLOPT12 EQU   RPLOPTC3+3                                               06657000
RPLOSENS EQU   RPLVTEXT+24                                              06658000
RPLSSNSO EQU   RPLOSENS                                                 06659000
RPLSSEO  EQU   RPLSSNSO                                                 06660000
RPLOF16  EQU   0                                                        06661000
RPLRH3   EQU   RPLOF16                                                  06662000
RPLSRTYP EQU   RPLOF16+1                                                06663000
RPLSTYPE EQU   RPLSRTYP                                                 06664000
RPLRTYPE EQU   RPLSRTYP                                                 06665000
RPLCHN   EQU   RPLOF16+2                                                06666000
RPLVTFL1 EQU   RPLOF16+3                                                06667000
RPLVTFL2 EQU   RPLOF16+4                                                06668000
RPLPOSTV EQU   RPLVTFL2                                                 06669000
RPLRESP  EQU   RPLVTFL2                                                 06670000
RPLCNTRL EQU   RPLOF16+5                                                06671000
RPLCNTDF EQU   RPLCNTRL                                                 06672000
RPLCNTDC EQU   RPLCNTRL+1                                               06673000
RPLCNTSC EQU   RPLCNTRL+2                                               06674000
RPLOF56  EQU   0                                                        06675000
RPLO5    EQU   RPLOF56                                                  06676000
RPLOF60  EQU   0                                                        06677000
RPLOBSQ  EQU   RPLOF60+4                                                06678000
RPLIBSQ  EQU   RPLOF60+5                                                06679000
ISTPROCD EQU   0                                                        06680000
PROPROC  EQU   ISTPROCD                                                 06681000
PROPROC1 EQU   PROPROC                                                  06682000
PROPROC2 EQU   PROPROC+1                                                06683000
PROPROC3 EQU   PROPROC+2                                                06684000
PROPROC4 EQU   PROPROC+3                                                06685000
PROPROCS EQU   0                                                        06686000
PROSETMS EQU   PROPROCS+1                                               06687000
PROSETM2 EQU   PROSETMS                                                 06688000
PROSETM3 EQU   PROSETMS+1                                               06689000
PROSETM4 EQU   PROSETMS+2                                               06690000
ISTDEVCH EQU   0                                                        06691000
DEVSHCH  EQU   ISTDEVCH                                                 06692000
DEVCHAR  EQU   DEVSHCH                                                  06693000
DEVTCODE EQU   ISTDEVCH+1                                               06694000
DEVFLAGS EQU   ISTDEVCH+3                                               06695000
DEVFCCTL EQU   DEVFLAGS                                                 06696000
DEVCHAR3 EQU   DEVFLAGS                                                 06697000
DEVMODE  EQU   ISTDEVCH+5                                               06698000
ISTBIND  EQU   0                                                        06699000
BINFMTY  EQU   ISTBIND                                                  06700000
BINPRIP  EQU   ISTBIND+3                                                06701000
BINSECP  EQU   ISTBIND+4                                                06702000
BINCMNP  EQU   ISTBIND+5                                                06703000
BINCMNP2 EQU   ISTBIND+6                                                06704000
BINTSU   EQU   ISTBIND+7                                                06705000
BINAPACE EQU   BINTSU                                                   06706000
BINRPACE EQU   BINTSU+1                                                 06707000
BINRUSZ  EQU   BINTSU+2                                                 06708000
BINSRUSZ EQU   BINRUSZ                                                  06709000
BINPRUSZ EQU   BINRUSZ+1                                                06710000
BINSPACE EQU   BINTSU+4                                                 06711000
BINBPACE EQU   BINTSU+5                                                 06712000
BINPRSVC EQU   ISTBIND+13                                               06713000
BINLUP   EQU   BINPRSVC                                                 06714000
BINPSCHR EQU   BINPRSVC+1                                               06715000
BINCRYPT EQU   ISTBIND+25                                               06716000
BINCRYRL EQU   0                                                        06717000
BINCRCTL EQU   BINCRYRL                                                 06718000
BINCRPFL EQU   BINCRYRL+1                                               06719000
BINPNAU  EQU   0                                                        06720000
BINAUNML EQU   BINPNAU                                                  06721000
BINAUNM  EQU   BINPNAU+1                                                06722000
BINUSEDT EQU   0                                                        06723000
BINUSDTL EQU   BINUSEDT                                                 06724000
BINUSDTA EQU   BINUSEDT+1                                               06725000
BINURC   EQU   0                                                        06726000
BINURCL  EQU   BINURC                                                   06727000
BINURCD  EQU   BINURC+1                                                 06728000
BINSLUNM EQU   0                                                        06729000
ISTCSL   EQU   0                                                        06730000
CSLRDEF  EQU   ISTCSL                                                   06731000
CSLRDTE  EQU   CSLRDEF                                                  06732000
CSLNDEF  EQU   ISTCSL+4                                                 06733000
CSLNIB   EQU   CSLNDEF                                                  06734000
CSLDDEF  EQU   ISTCSL+8                                                 06735000
CSLDATA  EQU   CSLDDEF                                                  06736000
ISTNIB   EQU   0                                                        06737000
NIBFLGS  EQU   ISTNIB+40                                                06738000
NIBFLG1  EQU   NIBFLGS                                                  06739000
ISTCSP   EQU   0                                                        06740000
CSPOPT   EQU   ISTCSP+2                                                 06741000
CSPOPT1  EQU   CSPOPT                                                   06742000
CSPOPT2  EQU   CSPOPT+1                                                 06743000
CSPSRC   EQU   ISTCSP+4                                                 06744000
CSPDEST  EQU   ISTCSP+8                                                 06745000
CSPRSCE  EQU   ISTCSP+12                                                06746000
CSPFUNCT EQU   ISTCSP+40                                                06747000
CSPMEN1  EQU   CSPFUNCT                                                 06748000
CSPMEN2  EQU   CSPFUNCT+1                                               06749000
ISTOCW   EQU   0                                                        06750000
OCWRPL   EQU   ISTOCW+12                                                06751000
OCWRPH   EQU   ISTOCW+16                                                06752000
OCWACVT  EQU   ISTOCW+24                                                06753000
OCWLRDTE EQU   ISTOCW+44                                                06754000
OCWDRDTE EQU   OCWLRDTE                                                 06755000
OCWODRC  EQU   ISTOCW+96                                                06756000
OCWSVCOD EQU   ISTOCW+98                                                06757000
OCWSVCCL EQU   ISTOCW+100                                               06758000
OCWDNIB  EQU   ISTOCW+116                                               06759000
OCWDSPLY EQU   OCWDNIB                                                  06760000
OCWSCPAD EQU   ISTOCW+180                                               06761000
OCWSWTA  EQU   ISTOCW+208                                               06762000
OCWSWTB  EQU   ISTOCW+209                                               06763000
OCWSWTC  EQU   ISTOCW+210                                               06764000
OCWSWTD  EQU   ISTOCW+211                                               06765000
OCWSAVE2 EQU   ISTOCW+360                                               06766000
OCWLCPBA EQU   ISTOCW+720                                               06767000
OCWSWTRD EQU   ISTOCW+754                                               06768000
OCWSWTE  EQU   ISTOCW+755                                               06769000
OCWCRYPF EQU   ISTOCW+756                                               06770000
OCWLOCKS EQU   ISTOCW+764                                               06771000
OCWCID   EQU   ISTOCW+768                                               06772000
OCWSAF   EQU   OCWCID                                                   06773000
OCWDAF   EQU   OCWCID+2                                                 06774000
OCWIOCNT EQU   ISTOCW+784                                               06775000
OCWSHPL  EQU   ISTOCW+808                                               06776000
OCWBIND  EQU   ISTOCW+820                                               06777000
OCWFLG1  EQU   ISTOCW+871                                               06778000
ISTPOPWA EQU   0                                                        06779000
POPTPOPT EQU   ISTPOPWA+3                                               06780000
POPMSG   EQU   ISTPOPWA+12                                              06781000
POPPLA   EQU   ISTPOPWA+140                                             06782000
POPSAVE  EQU   ISTPOPWA+156                                             06783000
POPMSGID EQU   ISTPOPWA+228                                             06784000
POPTXPTR EQU   ISTPOPWA+232                                             06785000
ISTLOK   EQU   0                                                        06786000
LOKCHN   EQU   ISTLOK+1                                                 06787000
LOKCHNG  EQU   LOKCHN                                                   06788000
@NM00069 EQU   LOKCHNG+2                                                06789000
ISTPAB   EQU   0                                                        06790000
PABWQCHN EQU   ISTPAB                                                   06791000
PABWEQA  EQU   PABWQCHN                                                 06792000
PABCHAIN EQU   PABWQCHN+4                                               06793000
PABRUNNG EQU   PABCHAIN                                                 06794000
PABRPHFG EQU   ISTPAB+12                                                06795000
PABFLAGS EQU   PABRPHFG                                                 06796000
PABERLCK EQU   PABFLAGS                                                 06797000
PABERRLK EQU   PABERLCK                                                 06798000
PABEND   EQU   ISTPAB+16                                                06799000
ISTDYPAB EQU   0                                                        06800000
DYPCHAIN EQU   ISTDYPAB+4                                               06801000
DYPPACMD EQU   ISTDYPAB+12                                              06802000
DYPPAB   EQU   ISTDYPAB+16                                              06803000
ISTRPH   EQU   0                                                        06804000
RPHCNTL  EQU   ISTRPH                                                   06805000
RPHFLAGS EQU   RPHCNTL+2                                                06806000
RPHFSTLC EQU   RPHFLAGS                                                 06807000
RPHFLGB  EQU   RPHCNTL+3                                                06808000
RPHRPHA  EQU   ISTRPH+4                                                 06809000
RPHTSKID EQU   ISTRPH+8                                                 06810000
RPHRESMA EQU   ISTRPH+16                                                06811000
RPHWPFLG EQU   RPHRESMA                                                 06812000
RPHWEA   EQU   ISTRPH+24                                                06813000
RPHCSPA  EQU   RPHWEA                                                   06814000
RPHSRPRM EQU   ISTRPH+28                                                06815000
RPHCRR   EQU   ISTRPH+32                                                06816000
RPHPABQA EQU   ISTRPH+36                                                06817000
RPHWORK  EQU   ISTRPH+40                                                06818000
RPHSAVE1 EQU   RPHWORK                                                  06819000
RPHSBITS EQU   RPHSAVE1+1                                               06820000
ISTATCVT EQU   0                                                        06821000
ATCRPTCH EQU   ISTATCVT                                                 06822000
ATCITFLD EQU   ISTATCVT+8                                               06823000
ATCITCDS EQU   ATCITFLD+8                                               06824000
ATCITFLG EQU   ATCITCDS+4                                               06825000
ATCITRA1 EQU   ATCITFLG+2                                               06826000
ATCSMPAB EQU   ISTATCVT+88                                              06827000
ATCVDPAB EQU   ISTATCVT+152                                             06828000
ATCPOPAB EQU   ISTATCVT+184                                             06829000
ATCLDTIL EQU   ISTATCVT+408                                             06830000
ATCAP33  EQU   ISTATCVT+448                                             06831000
ATCAP35  EQU   ISTATCVT+452                                             06832000
ATCAP36  EQU   ISTATCVT+456                                             06833000
ATCMSGP  EQU   ISTATCVT+476                                             06834000
ATCGTSTR EQU   ISTATCVT+608                                             06835000
ATCLUDVT EQU   ISTATCVT+768                                             06836000
ATCANYDT EQU   ISTATCVT+776                                             06837000
@NM00079 EQU   ISTATCVT+780                                             06838000
ATCPODVT EQU   ISTATCVT+804                                             06839000
ATCSTAT  EQU   ISTATCVT+936                                             06840000
ATCSTAT1 EQU   ATCSTAT                                                  06841000
ATCPOFLG EQU   ATCSTAT+2                                                06842000
ATCSTAT4 EQU   ATCSTAT+3                                                06843000
ATCBITAN EQU   ISTATCVT+940                                             06844000
ATCFLAG2 EQU   ATCBITAN+1                                               06845000
ATCONID  EQU   ISTATCVT+944                                             06846000
ATCSSCPA EQU   ISTATCVT+948                                             06847000
ATCRDTLK EQU   ISTATCVT+964                                             06848000
ATCHPGM  EQU   ISTATCVT+1012                                            06849000
ATCVLCNT EQU   ISTATCVT+1016                                            06850000
ATCRNO   EQU   ISTATCVT+1020                                            06851000
ATCPOIA  EQU   ATCRNO+1                                                 06852000
@NM00102 EQU   ISTATCVT+1028                                            06853000
ATCSHRFG EQU   @NM00102+8                                               06854000
ATCCPDVT EQU   ISTATCVT+1096                                            06855000
ATCSMSDQ EQU   ISTATCVT+1140                                            06856000
ATCRID   EQU   ISTATCVT+1152                                            06857000
ATCLDAPP EQU   ISTATCVT+1288                                            06858000
ATCSQAFR EQU   ISTATCVT+1312                                            06859000
ATCORTCB EQU   ATCSQAFR+4                                               06860000
ATCORSRB EQU   ATCORTCB                                                 06861000
ATCICAPP EQU   ISTATCVT+1320                                            06862000
ATCDAPVT EQU   ISTATCVT+1340                                            06863000
ATCAP34  EQU   ISTATCVT+1380                                            06864000
ATCAP37  EQU   ISTATCVT+1384                                            06865000
ATCGSRBQ EQU   ISTATCVT+1472                                            06866000
ATCGSRBG EQU   ATCGSRBQ                                                 06867000
ATCENFLG EQU   ISTATCVT+1512                                            06868000
@NM00117 EQU   ISTATCVT+1575                                            06869000
ATCVTFLG EQU   ISTATCVT+1576                                            06870000
ATCZFLAG EQU   ISTATCVT+1696                                            06871000
ATCCRA   EQU   ISTATCVT+1720                                            06872000
ATCCRACN EQU   ATCCRA+4                                                 06873000
ATCSRB   EQU   ISTATCVT+1728                                            06874000
ATCSRBCN EQU   ATCSRB+4                                                 06875000
ATCCRPL  EQU   ISTATCVT+1736                                            06876000
ATCRPLCN EQU   ATCCRPL+4                                                06877000
ISTPOIA  EQU   0                                                        06878000
POIANCR  EQU   ISTPOIA+4                                                06879000
POIPRANC EQU   ISTPOIA+8                                                06880000
ISTPFCRR EQU   0                                                        06881000
PFCCRR   EQU   ISTPFCRR                                                 06882000
PFCCRRID EQU   PFCCRR                                                   06883000
PFCCRRLN EQU   PFCCRR+2                                                 06884000
PFCHDR   EQU   ISTPFCRR+4                                               06885000
PFCCRRO  EQU   PFCHDR                                                   06886000
PFCFRRO  EQU   PFCHDR+4                                                 06887000
ISTCFCRR EQU   0                                                        06888000
CFCAUDIT EQU   ISTCFCRR                                                 06889000
CFCNTRD  EQU   CFCAUDIT                                                 06890000
CFCCRT   EQU   CFCAUDIT+1                                               06891000
ISTDCCRR EQU   0                                                        06892000
CRRSPACE EQU   ISTDCCRR+12                                              06893000
CRRSAREA EQU   0                                                        06894000
CRRMAS   EQU   CRRSAREA+148                                             06895000
CRRMAS1  EQU   CRRMAS                                                   06896000
CRRMAS2  EQU   CRRMAS+1                                                 06897000
CRRMAS3  EQU   CRRMAS+2                                                 06898000
CRRMAS4  EQU   CRRMAS+3                                                 06899000
CRRRMAS1 EQU   CRRMAS+4                                                 06900000
CRRRMAS2 EQU   CRRMAS+5                                                 06901000
CRRRMAS3 EQU   CRRMAS+6                                                 06902000
CRRSMAS  EQU   CRRRMAS3                                                 06903000
CRRATS   EQU   CRRSAREA+156                                             06904000
CRRATS1  EQU   CRRATS                                                   06905000
CRRATS2  EQU   CRRATS+1                                                 06906000
CRRATS3  EQU   CRRATS+2                                                 06907000
CRRATS4  EQU   CRRATS+3                                                 06908000
CRRRATS1 EQU   CRRATS+4                                                 06909000
CRRRATS2 EQU   CRRATS+5                                                 06910000
CRRRATS3 EQU   CRRATS+6                                                 06911000
CRRSATS  EQU   CRRRATS3                                                 06912000
CRRFLGS1 EQU   CRRSAREA+164                                             06913000
CRRFLGS2 EQU   CRRSAREA+165                                             06914000
CRRFLGS3 EQU   CRRSAREA+166                                             06915000
CRRFLGS4 EQU   CRRSAREA+167                                             06916000
CRRFLGS  EQU   CRRSAREA+168                                             06917000
CRRRFLG1 EQU   CRRSAREA+169                                             06918000
CRRRTYPE EQU   CRRRFLG1                                                 06919000
CRRFDBK1 EQU   CRRSAREA+170                                             06920000
CRRFDB2  EQU   CRRFDBK1+1                                               06921000
CRRFDB3  EQU   CRRFDBK1+2                                               06922000
CRRFDBK2 EQU   CRRSAREA+176                                             06923000
CRRDSB   EQU   CRRFDBK2                                                 06924000
CRRESR   EQU   CRRFDBK2+2                                               06925000
CRRTRBUF EQU   CRRSAREA+204                                             06926000
CRRBFLGS EQU   CRRSAREA+280                                             06927000
ISTASCRR EQU   0                                                        06928000
ASCFLAGS EQU   ISTASCRR+16                                              06929000
ASCFLG1  EQU   ASCFLAGS                                                 06930000
ASCFLG2  EQU   ASCFLAGS+2                                               06931000
ASCFLG3  EQU   ASCFLAGS+4                                               06932000
ASCUSRGS EQU   ISTASCRR+28                                              06933000
ISTAPCRR EQU   0                                                        06934000
APCATFLG EQU   ISTAPCRR+16                                              06935000
APCRFLG  EQU   ISTAPCRR+18                                              06936000
APCRTRN  EQU   ISTAPCRR+28                                              06937000
APCAUT   EQU   APCRTRN                                                  06938000
APCSAVE  EQU   ISTAPCRR+44                                              06939000
APCCOMF  EQU   ISTAPCRR+116                                             06940000
APCCOMF1 EQU   APCCOMF                                                  06941000
APC31FLG EQU   ISTAPCRR+132                                             06942000
APC52FLG EQU   ISTAPCRR+133                                             06943000
APC53FLG EQU   ISTAPCRR+134                                             06944000
APC54FLG EQU   ISTAPCRR+135                                             06945000
APC57FLG EQU   ISTAPCRR+136                                             06946000
ISTCRA   EQU   0                                                        06947000
CRABASIC EQU   ISTCRA                                                   06948000
CRAHDR   EQU   CRABASIC                                                 06949000
CRALKACT EQU   CRABASIC+8                                               06950000
CRAL3PTR EQU   CRABASIC+20                                              06951000
CRARPH   EQU   ISTCRA+52                                                06952000
CRAPSS   EQU   ISTCRA+160                                               06953000
CRAPROCR EQU   ISTCRA+312                                               06954000
CRASVC   EQU   ISTCRA+924                                               06955000
CRABUFA  EQU   CRASVC+68                                                06956000
CRARSV01 EQU   ISTCRA+996                                               06957000
CRARSV02 EQU   ISTCRA+1000                                              06958000
CRAIDS   EQU   ISTCRA+1004                                              06959000
CRACHAIN EQU   ISTCRA+1012                                              06960000
ISTPOHD  EQU   0                                                        06961000
POHSTAT  EQU   ISTPOHD+1                                                06962000
ISTPOMCB EQU   0                                                        06963000
POMNEXT  EQU   ISTPOMCB+8                                               06964000
POMFWD   EQU   POMNEXT+1                                                06965000
POMREPQ  EQU   ISTPOMCB+12                                              06966000
ISTPORCB EQU   0                                                        06967000
POREPID  EQU   ISTPORCB+2                                               06968000
PORNEXT  EQU   ISTPORCB+8                                               06969000
PORFWD   EQU   PORNEXT+1                                                06970000
PORPOMQ  EQU   ISTPORCB+12                                              06971000
PORPOMCB EQU   PORPOMQ+1                                                06972000
PORREPLN EQU   ISTPORCB+24                                              06973000
PORRSVD  EQU   ISTPORCB+25                                              06974000
PORRTPQ  EQU   PORRSVD                                                  06975000
PORMSG   EQU   ISTPORCB+28                                              06976000
ISTWPL   EQU   0                                                        06977000
WPLMCSF  EQU   ISTWPL+2                                                 06978000
WPLMCSF1 EQU   WPLMCSF                                                  06979000
WPLMCSF2 EQU   WPLMCSF+1                                                06980000
ISTRWPL  EQU   0                                                        06981000
RWPPRTR  EQU   ISTRWPL                                                  06982000
RWPRECB  EQU   ISTRWPL+4                                                06983000
ISTPOCB  EQU   0                                                        06984000
POCNEXT  EQU   ISTPOCB+8                                                06985000
POCRCVQ  EQU   ISTPOCB+16                                               06986000
POCREPQ  EQU   ISTPOCB+20                                               06987000
POCAWTRQ EQU   POCREPQ+1                                                06988000
POCRPGEN EQU   ISTPOCB+28                                               06989000
POCSTAT  EQU   ISTPOCB+42                                               06990000
CRPREGSV EQU   0                                                        06991000
CRPWKA   EQU   0                                                        06992000
CRPNULL  EQU   CRPWKA                                                   06993000
CRPR14SV EQU   CRPWKA+4                                                 06994000
CRPINDEX EQU   CRPWKA+8                                                 06995000
CRPDW    EQU   CRPWKA+12                                                06996000
CRPBGN   EQU   CRPDW                                                    06997000
CRPBUFLN EQU   CRPDW+4                                                  06998000
CRPNUM   EQU   CRPWKA+20                                                06999000
CRPSTSW  EQU   CRPWKA+22                                                07000000
CRPFND   EQU   CRPSTSW                                                  07001000
CRPERR   EQU   CRPSTSW                                                  07002000
CRPSAME  EQU   CRPSTSW                                                  07003000
CRPCHARA EQU   0                                                        07004000
CRPCHARB EQU   0                                                        07005000
CRPCHARC EQU   0                                                        07006000
FMZL0016 EQU   0                                                        07007000
FMZL0030 EQU   0                                                        07008000
ISTAPC37 EQU   0                                                        07009000
FMZL0058 EQU   0                                                        07010000
FMZL0072 EQU   0                                                        07011000
@NM00160 EQU   0                                                        07012000
CMZID086 EQU   @NM00160                                                 07013000
@NM00161 EQU   @NM00160+4                                               07014000
CMZRL086 EQU   @NM00161                                                 07015000
CMZRA086 EQU   @NM00161+1                                               07016000
CMZEA086 EQU   @NM00160+8                                               07017000
CMZVP086 EQU   @NM00160+12                                              07018000
CMZSA086 EQU   0                                                        07019000
CMTA086  EQU   0                                                        07020000
ISTAPC34 EQU   0                                                        07021000
ISTRPL   EQU   0                                                        07022000
ISTXDYP  EQU   0                                                        07023000
ISTXPAB  EQU   0                                                        07024000
CVTS01   EQU   CVTPGSIA                                                 07025000
CVTLPDIA EQU   CVTS01+12                                                07026000
CVTDIRST EQU   CVTLPDIA                                                 07027000
CVTSLIDA EQU   CVTS01+24                                                07028000
CVTCTLFG EQU   CVTS01+50                                                07029000
CVTRV210 EQU   CVTS01+424                                               07030000
CVTRV219 EQU   CVTS01+425                                               07031000
CVTRV228 EQU   CVTS01+426                                               07032000
CVTRV237 EQU   CVTS01+427                                               07033000
CVTMFRTR EQU   CVTS01+452                                               07034000
CVTRV262 EQU   CVTS01+468                                               07035000
CVTRV271 EQU   CVTS01+469                                               07036000
CVTRV280 EQU   CVTS01+470                                               07037000
CVTRV289 EQU   CVTS01+471                                               07038000
CVTGSDA  EQU   CVTS01+600                                               07039000
BINLUP1  EQU   BINPSCHR                                                 07040000
BINLUS   EQU   BINPSCHR                                                 07041000
BINFMF1  EQU   BINLUS                                                   07042000
@NM00038 EQU   BINFMF1                                                  07043000
BINDSPF1 EQU   BINLUS+2                                                 07044000
BINMEDIA EQU   BINLUS+4                                                 07045000
BINLUP2  EQU   BINPSCHR                                                 07046000
BINSCRSZ EQU   BINLUP2+5                                                07047000
BINLUP3  EQU   BINPSCHR                                                 07048000
BINBFRSZ EQU   BINLUP3+5                                                07049000
BINBDESC EQU   BINLUP3+9                                                07050000
BINLUP4  EQU   BINPSCHR                                                 07051000
BINPSNDO EQU   BINLUP4                                                  07052000
BINPDSPP EQU   BINPSNDO                                                 07053000
BINADSPP EQU   BINPSNDO+1                                               07054000
BINFMHUP EQU   BINPSNDO+3                                               07055000
BINSSNDO EQU   BINLUP4+4                                                07056000
BINCSO   EQU   BINLUP4+8                                                07057000
BINCSOR  EQU   BINCSO                                                   07058000
BINGENCO EQU   BINLUP4+9                                                07059000
PABXTNSN EQU   PABEND                                                   07060000
@NM00145 EQU   CRAPROCR                                                 07061000
CRPR13SV EQU   CRPINDEX                                                 07062000
CRACFCRR EQU   CRAPROCR                                                 07063000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    07064000
CRACRRSA EQU   @NM00145+12                                              07065000
@NM00146 EQU   @NM00145                                                 07066000
@NM00071 EQU   PABXTNSN+12                                              07067000
PABNPSSQ EQU   PABXTNSN+8                                               07068000
PABLOCK  EQU   PABXTNSN+4                                               07069000
PABLAST  EQU   PABXTNSN                                                 07070000
BINRSV35 EQU   BINLUP4+10                                               07071000
BINRVS34 EQU   BINGENCO                                                 07072000
BINAAO   EQU   BINGENCO                                                 07073000
BINIAO   EQU   BINGENCO                                                 07074000
BINRSV33 EQU   BINGENCO                                                 07075000
BINWSDF  EQU   BINGENCO                                                 07076000
BINRSV32 EQU   BINGENCO                                                 07077000
BINCSOC2 EQU   BINCSO                                                   07078000
BINCSOC1 EQU   BINCSO                                                   07079000
BINRSV31 EQU   BINCSOR                                                  07080000
BINRSV30 EQU   BINCSOR                                                  07081000
BINCSOAI EQU   BINCSOR                                                  07082000
BINCSOE  EQU   BINCSOR                                                  07083000
BINFMHUS EQU   BINSSNDO+3                                               07084000
BINCSLS  EQU   BINSSNDO+2                                               07085000
BINADSPS EQU   BINSSNDO+1                                               07086000
BINPDSPS EQU   BINSSNDO                                                 07087000
BINKIXS  EQU   BINFMHUP                                                 07088000
BINQFDO  EQU   BINFMHUP                                                 07089000
BINWPFMO EQU   BINFMHUP                                                 07090000
BINPDIRO EQU   BINFMHUP                                                 07091000
BINCOMPO EQU   BINFMHUP                                                 07092000
BINDSSTO EQU   BINFMHUP                                                 07093000
BINSSDAT EQU   BINFMHUP                                                 07094000
BINCSLP  EQU   BINPSNDO+2                                               07095000
BINRSV29 EQU   BINADSPP                                                 07096000
BINADSRF EQU   BINADSPP                                                 07097000
BINADSSF EQU   BINADSPP                                                 07098000
BINADSBE EQU   BINADSPP                                                 07099000
BINADSEC EQU   BINADSPP                                                 07100000
BINADSCD EQU   BINADSPP                                                 07101000
BINADSEP EQU   BINADSPP                                                 07102000
BINPEP   EQU   BINPDSPP                                                 07103000
BINDPP   EQU   BINPDSPP                                                 07104000
BINRSV28 EQU   BINPDSPP                                                 07105000
@NM00049 EQU   BINLUP3+10                                               07106000
BINBFSIZ EQU   BINBDESC                                                 07107000
@NM00048 EQU   BINBDESC                                                 07108000
BINBDRAC EQU   BINBFRSZ+3                                               07109000
BINBFRAR EQU   BINBFRSZ+2                                               07110000
BINBFRDC EQU   BINBFRSZ+1                                               07111000
BINBFRDR EQU   BINBFRSZ                                                 07112000
@NM00047 EQU   BINLUP3                                                  07113000
@NM00046 EQU   BINLUP2+10                                               07114000
BINPRESZ EQU   BINLUP2+9                                                07115000
BINSALTC EQU   BINSCRSZ+3                                               07116000
BINSALTR EQU   BINSCRSZ+2                                               07117000
BINSPRIC EQU   BINSCRSZ+1                                               07118000
BINSPRIR EQU   BINSCRSZ                                                 07119000
@NM00045 EQU   BINLUP2+1                                                07120000
@NM00044 EQU   BINLUP2                                                  07121000
BINSEDS  EQU   BINLUP2                                                  07122000
@NM00043 EQU   BINMEDIA                                                 07123000
BINCDEDS EQU   BINMEDIA                                                 07124000
BINXDOCF EQU   BINMEDIA                                                 07125000
BINXCDF  EQU   BINMEDIA                                                 07126000
BINDISK  EQU   BINMEDIA                                                 07127000
BINXCHNG EQU   BINMEDIA                                                 07128000
BINCARD  EQU   BINMEDIA                                                 07129000
BINDOCMT EQU   BINMEDIA                                                 07130000
@NM00042 EQU   BINDSPF1+1                                               07131000
BINUAALT EQU   BINDSPF1+1                                               07132000
BINUAINT EQU   BINDSPF1+1                                               07133000
BINTRNDS EQU   BINDSPF1                                                 07134000
@NM00041 EQU   BINDSPF1                                                 07135000
BINSLD   EQU   BINDSPF1                                                 07136000
BINVSDS  EQU   BINDSPF1                                                 07137000
BINVTDS  EQU   BINDSPF1                                                 07138000
BINHFDS  EQU   BINDSPF1                                                 07139000
BININTR  EQU   BINDSPF1                                                 07140000
@NM00040 EQU   @NM00038+1                                               07141000
BINXFPD  EQU   @NM00038+1                                               07142000
BINCSDS  EQU   @NM00038+1                                               07143000
BINQDSI  EQU   @NM00038+1                                               07144000
@NM00039 EQU   @NM00038+1                                               07145000
BINARRR  EQU   @NM00038                                                 07146000
BINSIDS  EQU   @NM00038                                                 07147000
BINSAI   EQU   @NM00038                                                 07148000
BINSDSI  EQU   @NM00038                                                 07149000
BINKDDSI EQU   @NM00038                                                 07150000
BINPDIR  EQU   BINFMF1                                                  07151000
BINCMPCT EQU   BINFMF1                                                  07152000
BINDESTS EQU   BINFMF1                                                  07153000
BINSLUS1 EQU   BINLUP1+6                                                07154000
BINPLUS1 EQU   BINLUP1+1                                                07155000
BINDSP1  EQU   BINLUP1                                                  07156000
BINFMHS1 EQU   BINLUP1                                                  07157000
CVTRV628 EQU   CVTS01+728                                               07158000
CVTRV627 EQU   CVTS01+724                                               07159000
CVTRV626 EQU   CVTS01+720                                               07160000
CVTRV625 EQU   CVTS01+716                                               07161000
CVTRV624 EQU   CVTS01+712                                               07162000
CVTRV623 EQU   CVTS01+708                                               07163000
CVTRV622 EQU   CVTS01+704                                               07164000
CVTRV621 EQU   CVTS01+700                                               07165000
CVTIHASU EQU   CVTS01+696                                               07166000
CVTSUSP  EQU   CVTS01+692                                               07167000
CVTT6SVC EQU   CVTS01+688                                               07168000
CVTCDAL  EQU   CVTS01+684                                               07169000
CVTTCTL  EQU   CVTS01+680                                               07170000
CVTRSUME EQU   CVTS01+676                                               07171000
CVTJTERM EQU   CVTS01+672                                               07172000
CVTASMRM EQU   CVTS01+668                                               07173000
CVTTCASP EQU   CVTS01+664                                               07174000
CVT0PT03 EQU   CVTS01+660                                               07175000
CVT0PT0E EQU   CVTS01+656                                               07176000
CVTRV609 EQU   CVTS01+652                                               07177000
CVTCGK   EQU   CVTS01+648                                               07178000
CVTRAC   EQU   CVTS01+644                                               07179000
CVTRV606 EQU   CVTS01+640                                               07180000
CVTRV605 EQU   CVTS01+636                                               07181000
CVTRV604 EQU   CVTS01+632                                               07182000
CVTEFF02 EQU   CVTS01+628                                               07183000
CVTCBBR  EQU   CVTS01+624                                               07184000
CVTSSCR  EQU   CVTS01+620                                               07185000
CVTEVENT EQU   CVTS01+616                                               07186000
CVTCRCA  EQU   CVTS01+612                                               07187000
CVTTPIO  EQU   CVTS01+608                                               07188000
CVTADV   EQU   CVTS01+604                                               07189000
CVTGSDAB EQU   CVTGSDA                                                  07190000
CVTQV3   EQU   CVTS01+596                                               07191000
CVTQV2   EQU   CVTS01+592                                               07192000
CVTQV1   EQU   CVTS01+588                                               07193000
CVTRPT   EQU   CVTS01+584                                               07194000
CVTSSRB  EQU   CVTS01+580                                               07195000
CVTCSDRL EQU   CVTS01+576                                               07196000
CVTEXP1  EQU   CVTS01+572                                               07197000
CVTRMPMT EQU   CVTS01+568                                               07198000
CVTRMPTT EQU   CVTS01+564                                               07199000
CVTVPSA  EQU   CVTS01+560                                               07200000
CVTVSTOP EQU   CVTS01+556                                               07201000
CVTGTFR8 EQU   CVTS01+552                                               07202000
CVTQUIT  EQU   CVTS01+548                                               07203000
CVTVACR  EQU   CVTS01+544                                               07204000
CVTWTCB  EQU   CVTS01+540                                               07205000
CVTSTPRS EQU   CVTS01+536                                               07206000
CVT0PT02 EQU   CVTS01+532                                               07207000
CVTDARCM EQU   CVTS01+528                                               07208000
CVTIRECM EQU   CVTS01+524                                               07209000
CVTJRECM EQU   CVTS01+520                                               07210000
CVTVEMS0 EQU   CVTS01+516                                               07211000
CVTSPFRR EQU   CVTS01+512                                               07212000
CVTRLSTG EQU   CVTS01+508                                               07213000
CVT0TC0A EQU   CVTS01+504                                               07214000
CVTGMBR  EQU   CVTS01+500                                               07215000
CVTLFRM  EQU   CVTS01+496                                               07216000
CVTRMBR  EQU   CVTS01+492                                               07217000
CVTVIOP  EQU   CVTS01+488                                               07218000
CVTRV307 EQU   CVTS01+486                                               07219000
CVTRV306 EQU   CVTS01+484                                               07220000
CVTRV305 EQU   CVTS01+482                                               07221000
CVTRV304 EQU   CVTS01+480                                               07222000
CVTRV303 EQU   CVTS01+478                                               07223000
CVTRV302 EQU   CVTS01+476                                               07224000
CVTTRCA  EQU   CVTS01+472                                               07225000
CVTRV297 EQU   CVTRV289                                                 07226000
CVTRV296 EQU   CVTRV289                                                 07227000
CVTRV295 EQU   CVTRV289                                                 07228000
CVTRV294 EQU   CVTRV289                                                 07229000
CVTRV293 EQU   CVTRV289                                                 07230000
CVTRV292 EQU   CVTRV289                                                 07231000
CVTRV291 EQU   CVTRV289                                                 07232000
CVTRV290 EQU   CVTRV289                                                 07233000
CVTRV288 EQU   CVTRV280                                                 07234000
CVTRV287 EQU   CVTRV280                                                 07235000
CVTRV286 EQU   CVTRV280                                                 07236000
CVTRV285 EQU   CVTRV280                                                 07237000
CVTRV284 EQU   CVTRV280                                                 07238000
CVTRV283 EQU   CVTRV280                                                 07239000
CVTRV282 EQU   CVTRV280                                                 07240000
CVTRV281 EQU   CVTRV280                                                 07241000
CVTRV279 EQU   CVTRV271                                                 07242000
CVTRV278 EQU   CVTRV271                                                 07243000
CVTRV277 EQU   CVTRV271                                                 07244000
CVTRV276 EQU   CVTRV271                                                 07245000
CVTRV275 EQU   CVTRV271                                                 07246000
CVTRV274 EQU   CVTRV271                                                 07247000
CVTRV273 EQU   CVTRV271                                                 07248000
CVTRV272 EQU   CVTRV271                                                 07249000
CVTRV270 EQU   CVTRV262                                                 07250000
CVTRV269 EQU   CVTRV262                                                 07251000
CVTRV268 EQU   CVTRV262                                                 07252000
CVTRV267 EQU   CVTRV262                                                 07253000
CVTRV266 EQU   CVTRV262                                                 07254000
CVTRV265 EQU   CVTRV262                                                 07255000
CVTRV264 EQU   CVTRV262                                                 07256000
CVTRV263 EQU   CVTRV262                                                 07257000
CVTVFP   EQU   CVTS01+464                                               07258000
CVTVSI   EQU   CVTS01+460                                               07259000
CVTVPSIB EQU   CVTS01+456                                               07260000
CVTMFACT EQU   CVTMFRTR                                                 07261000
CVTMFCTL EQU   CVTS01+448                                               07262000
CVTPVBP  EQU   CVTS01+444                                               07263000
CVTPWI   EQU   CVTS01+440                                               07264000
CVTRV254 EQU   CVTS01+438                                               07265000
CVTRV253 EQU   CVTS01+436                                               07266000
CVTRV252 EQU   CVTS01+434                                               07267000
CVTRV251 EQU   CVTS01+433                                               07268000
CVTRV250 EQU   CVTS01+432                                               07269000
CVTRV249 EQU   CVTS01+431                                               07270000
CVTRV248 EQU   CVTS01+430                                               07271000
CVTRV247 EQU   CVTS01+429                                               07272000
CVTRV246 EQU   CVTS01+428                                               07273000
CVTRV245 EQU   CVTRV237                                                 07274000
CVTRV244 EQU   CVTRV237                                                 07275000
CVTRV243 EQU   CVTRV237                                                 07276000
CVTRV242 EQU   CVTRV237                                                 07277000
CVTRV241 EQU   CVTRV237                                                 07278000
CVTRV240 EQU   CVTRV237                                                 07279000
CVTRV239 EQU   CVTRV237                                                 07280000
CVTRV238 EQU   CVTRV237                                                 07281000
CVTRV236 EQU   CVTRV228                                                 07282000
CVTRV235 EQU   CVTRV228                                                 07283000
CVTRV234 EQU   CVTRV228                                                 07284000
CVTRV233 EQU   CVTRV228                                                 07285000
CVTRV232 EQU   CVTRV228                                                 07286000
CVTRV231 EQU   CVTRV228                                                 07287000
CVTRV230 EQU   CVTRV228                                                 07288000
CVTRV229 EQU   CVTRV228                                                 07289000
CVTRV227 EQU   CVTRV219                                                 07290000
CVTRV226 EQU   CVTRV219                                                 07291000
CVTRV225 EQU   CVTRV219                                                 07292000
CVTRV224 EQU   CVTRV219                                                 07293000
CVTRV223 EQU   CVTRV219                                                 07294000
CVTRV222 EQU   CVTRV219                                                 07295000
CVTRV221 EQU   CVTRV219                                                 07296000
CVTRV220 EQU   CVTRV219                                                 07297000
CVTRV218 EQU   CVTRV210                                                 07298000
CVTRV217 EQU   CVTRV210                                                 07299000
CVTRV216 EQU   CVTRV210                                                 07300000
CVTRV215 EQU   CVTRV210                                                 07301000
CVTRV214 EQU   CVTRV210                                                 07302000
CVTRV213 EQU   CVTRV210                                                 07303000
CVTRV212 EQU   CVTRV210                                                 07304000
CVTRV211 EQU   CVTRV210                                                 07305000
CVTLCCAT EQU   CVTS01+420                                               07306000
CVTPCCAT EQU   CVTS01+416                                               07307000
CVTIPCRP EQU   CVTS01+412                                               07308000
CVTIPCRI EQU   CVTS01+408                                               07309000
CVTIPCDS EQU   CVTS01+404                                               07310000
CVTAIDVT EQU   CVTS01+400                                               07311000
CVTSSAP  EQU   CVTS01+396                                               07312000
CVTEHCIR EQU   CVTS01+392                                               07313000
CVTEHDEF EQU   CVTS01+388                                               07314000
CVTDAIR  EQU   CVTS01+384                                               07315000
CVTPERFM EQU   CVTS01+380                                               07316000
CVT044R2 EQU   CVTS01+376                                               07317000
CVTFETCH EQU   CVTS01+372                                               07318000
CVTRSTWD EQU   CVTS01+368                                               07319000
CVTSPOST EQU   CVTS01+364                                               07320000
CVTIOBP  EQU   CVTS01+360                                               07321000
CVTASMVT EQU   CVTS01+356                                               07322000
CVTRECRQ EQU   CVTS01+352                                               07323000
CVTWSAC  EQU   CVTS01+348                                               07324000
CVTRV149 EQU   CVTS01+344                                               07325000
CVTWSAL  EQU   CVTS01+340                                               07326000
CVTSPSA  EQU   CVTS01+336                                               07327000
CVTGLMN  EQU   CVTS01+332                                               07328000
CVTVEAC0 EQU   CVTS01+328                                               07329000
CVT062R1 EQU   CVTS01+324                                               07330000
CVTRPOST EQU   CVTS01+320                                               07331000
CVTDQIQE EQU   CVTS01+316                                               07332000
CVTCSD   EQU   CVTS01+312                                               07333000
CVTLKRMA EQU   CVTS01+308                                               07334000
CVTRSPIE EQU   CVTS01+304                                               07335000
CVTRENQ  EQU   CVTS01+300                                               07336000
CVTLQCB  EQU   CVTS01+296                                               07337000
CVTFQCB  EQU   CVTS01+292                                               07338000
CVTQCS01 EQU   CVTS01+288                                               07339000
CVTAPFT  EQU   CVTS01+284                                               07340000
CVTPARRL EQU   CVTS01+280                                               07341000
CVTVWAIT EQU   CVTS01+276                                               07342000
CVTGSPL  EQU   CVTS01+272                                               07343000
CVTLSMQ  EQU   CVTS01+268                                               07344000
CVTGSMQ  EQU   CVTS01+264                                               07345000
CVTEXPRO EQU   CVTS01+260                                               07346000
CVTOPCTP EQU   CVTS01+256                                               07347000
CVTSIC   EQU   CVTS01+252                                               07348000
CVTTPIOS EQU   CVTS01+248                                               07349000
CVTRTMS  EQU   CVTS01+244                                               07350000
CVTSDBF  EQU   CVTS01+240                                               07351000
CVTSCBP  EQU   CVTS01+236                                               07352000
CVTSDMP  EQU   CVTS01+232                                               07353000
CVTSV60  EQU   CVTS01+228                                               07354000
CVTRTMCT EQU   CVTS01+224                                               07355000
CVTASCBL EQU   CVTS01+220                                               07356000
CVTASCBH EQU   CVTS01+216                                               07357000
CVTGDA   EQU   CVTS01+212                                               07358000
CVTASVT  EQU   CVTS01+208                                               07359000
CVTVVMDI EQU   CVTS01+204                                               07360000
CVTAQTOP EQU   CVTS01+200                                               07361000
CVTIOSCS EQU   CVTS01+196                                               07362000
CVTSDRM  EQU   CVTS01+192                                               07363000
CVTOPTE  EQU   CVTS01+188                                               07364000
CVTSTXU  EQU   CVTS01+184                                               07365000
CVTQUIS  EQU   CVTS01+180                                               07366000
CVTPARS  EQU   CVTS01+176                                               07367000
CVTS1EE  EQU   CVTS01+172                                               07368000
CVTFRAS  EQU   CVTS01+168                                               07369000
CVTQSAS  EQU   CVTS01+164                                               07370000
CVTCRAS  EQU   CVTS01+160                                               07371000
CVTCRMN  EQU   CVTS01+156                                               07372000
CVTDELCP EQU   CVTS01+152                                               07373000
CVTFRECL EQU   CVTS01+148                                               07374000
CVTGETCL EQU   CVTS01+144                                               07375000
CVTBLDCP EQU   CVTS01+140                                               07376000
CVTAUTHL EQU   CVTS01+136                                               07377000
CVTSCAN  EQU   CVTS01+132                                               07378000
CVTRV144 EQU   CVTS01+130                                               07379000
CVTMAXMP EQU   CVTS01+128                                               07380000
CVTSTCK  EQU   CVTS01+124                                               07381000
CVTRV139 EQU   CVTS01+123                                               07382000
CVTDSSAC EQU   CVTS01+122                                               07383000
CVTRV513 EQU   CVTS01+121                                               07384000
CVTIOSPL EQU   CVTS01+120                                               07385000
CVTPTGT  EQU   CVTS01+116                                               07386000
CVTCSPIE EQU   CVTS01+112                                               07387000
CVTSMFEX EQU   CVTS01+108                                               07388000
CVTOLT0A EQU   CVTS01+104                                               07389000
CVTSRBRT EQU   CVTS01+100                                               07390000
CVTPUTL  EQU   CVTS01+96                                                07391000
CVTASCRL EQU   CVTS01+92                                                07392000
CVTASCRF EQU   CVTS01+88                                                07393000
CVTRV326 EQU   CVTS01+84                                                07394000
CVTRV325 EQU   CVTS01+80                                                07395000
CVTRV324 EQU   CVTS01+76                                                07396000
CVT0VL01 EQU   CVTS01+72                                                07397000
CVTSHRVM EQU   CVTS01+68                                                07398000
CVTRV332 EQU   CVTS01+64                                                07399000
CVTTAS   EQU   CVTS01+60                                                07400000
CVTRSCN  EQU   CVTS01+56                                                07401000
CVTTRAC2 EQU   CVTS01+54                                                07402000
CVTTRACE EQU   CVTS01+52                                                07403000
CVTAPG   EQU   CVTS01+51                                                07404000
CVTSDTRC EQU   CVTCTLFG                                                 07405000
CVTGTRCE EQU   CVTCTLFG                                                 07406000
CVTNOMP  EQU   CVTCTLFG                                                 07407000
CVTRSV79 EQU   CVTCTLFG                                                 07408000
CVTDSTAT EQU   CVTCTLFG                                                 07409000
CVTRSV78 EQU   CVTCTLFG                                                 07410000
CVTRV333 EQU   CVTCTLFG                                                 07411000
CVTRV323 EQU   CVTCTLFG                                                 07412000
CVTSPVLK EQU   CVTS01+49                                                07413000
CVTRSV77 EQU   CVTS01+48                                                07414000
CVTRV331 EQU   CVTS01+44                                                07415000
CVTRV330 EQU   CVTS01+40                                                07416000
CVTRV329 EQU   CVTS01+36                                                07417000
CVTRV328 EQU   CVTS01+32                                                07418000
CVTRV322 EQU   CVTS01+28                                                07419000
CVTSLID  EQU   CVTSLIDA+1                                               07420000
CVTSYLK  EQU   CVTSLIDA                                                 07421000
CVTRV321 EQU   CVTS01+20                                                07422000
CVTRV320 EQU   CVTS01+16                                                07423000
CVTLPDIR EQU   CVTLPDIA+1                                               07424000
CVTRSV69 EQU   CVTDIRST                                                 07425000
CVTRSV68 EQU   CVTDIRST                                                 07426000
CVTRSV67 EQU   CVTDIRST                                                 07427000
CVTRSV66 EQU   CVTDIRST                                                 07428000
CVTRSV65 EQU   CVTDIRST                                                 07429000
CVTRSV64 EQU   CVTDIRST                                                 07430000
CVTRSV63 EQU   CVTDIRST                                                 07431000
CVTDICOM EQU   CVTDIRST                                                 07432000
CVTPVTP  EQU   CVTS01+8                                                 07433000
CVTLPDSR EQU   CVTS01+4                                                 07434000
CVTGETL  EQU   CVTS01                                                   07435000
@NM00159 EQU   CRPSTSW                                                  07436000
@NM00158 EQU   CRPREGSV+12                                              07437000
CPCSVFWP EQU   CRPREGSV+8                                               07438000
CPCSVBKP EQU   CRPREGSV+4                                               07439000
@NM00157 EQU   CRPREGSV                                                 07440000
POCWTOPL EQU   ISTPOCB+44                                               07441000
POCRSVD  EQU   ISTPOCB+43                                               07442000
@NM00156 EQU   POCSTAT                                                  07443000
POCQUI   EQU   POCSTAT                                                  07444000
POCINACT EQU   POCSTAT                                                  07445000
POCACT   EQU   POCSTAT                                                  07446000
POCRCNTR EQU   ISTPOCB+41                                               07447000
POCRPL   EQU   ISTPOCB+24                                               07448000
@NM00155 EQU   POCREPQ                                                  07449000
POCMSGQ  EQU   POCRCVQ+1                                                07450000
@NM00154 EQU   POCRCVQ                                                  07451000
POCDEB   EQU   ISTPOCB+12                                               07452000
POCFWD   EQU   POCNEXT+1                                                07453000
@NM00153 EQU   POCNEXT                                                  07454000
POCPSSQ  EQU   ISTPOCB+4                                                07455000
POCVTMID EQU   ISTPOCB+2                                                07456000
POCLNGTH EQU   ISTPOCB+1                                                07457000
POCCBID  EQU   ISTPOCB                                                  07458000
RWPWPL   EQU   ISTRWPL+8                                                07459000
RWPSSECB EQU   RWPRECB                                                  07460000
RWPRPTRA EQU   RWPPRTR+1                                                07461000
RWPLRLN  EQU   RWPPRTR                                                  07462000
WPLTXT   EQU   ISTWPL+4                                                 07463000
WPLRSV02 EQU   WPLMCSF2                                                 07464000
WPLMCSFN EQU   WPLMCSF2                                                 07465000
WPLRSV01 EQU   WPLMCSF2                                                 07466000
WPLSTGFL EQU   WPLMCSF2                                                 07467000
WPLMCSFJ EQU   WPLMCSF2                                                 07468000
WPLMCSFI EQU   WPLMCSF2                                                 07469000
WPLMCSFH EQU   WPLMCSF1                                                 07470000
WPLMCSFG EQU   WPLMCSF1                                                 07471000
WPLMCSFF EQU   WPLMCSF1                                                 07472000
WPLMCSFE EQU   WPLMCSF1                                                 07473000
WPLMCSFD EQU   WPLMCSF1                                                 07474000
WPLMCSFC EQU   WPLMCSF1                                                 07475000
WPLMCSFB EQU   WPLMCSF1                                                 07476000
WPLMCSFA EQU   WPLMCSF1                                                 07477000
WPLLGH   EQU   ISTWPL                                                   07478000
@NM00152 EQU   ISTPORCB+26                                              07479000
@NM00151 EQU   PORRSVD                                                  07480000
PORECB   EQU   ISTPORCB+20                                              07481000
PORAREA  EQU   ISTPORCB+16                                              07482000
@NM00150 EQU   PORPOMQ                                                  07483000
@NM00149 EQU   PORNEXT                                                  07484000
PORPSSQ  EQU   ISTPORCB+4                                               07485000
PORLNGTH EQU   ISTPORCB+1                                               07486000
PORCBID  EQU   ISTPORCB                                                 07487000
POMMSG   EQU   ISTPOMCB+20                                              07488000
POMMHDR  EQU   ISTPOMCB+16                                              07489000
POMPORCB EQU   POMREPQ+1                                                07490000
@NM00148 EQU   POMREPQ                                                  07491000
@NM00147 EQU   POMNEXT                                                  07492000
POMRSVD2 EQU   ISTPOMCB+4                                               07493000
POMRSVD1 EQU   ISTPOMCB+3                                               07494000
POMMSGLN EQU   ISTPOMCB+2                                               07495000
POMLNGTH EQU   ISTPOMCB+1                                               07496000
POMCBID  EQU   ISTPOMCB                                                 07497000
POHID    EQU   ISTPOHD+2                                                07498000
POHGEN   EQU   POHSTAT                                                  07499000
POHRREQ  EQU   POHSTAT                                                  07500000
POHRSVD2 EQU   POHSTAT                                                  07501000
POHCNTRL EQU   POHSTAT                                                  07502000
POHLBL   EQU   POHSTAT                                                  07503000
POHDATA  EQU   POHSTAT                                                  07504000
POHEND   EQU   POHSTAT                                                  07505000
POHRSVD1 EQU   ISTPOHD                                                  07506000
CRAID    EQU   CRAIDS+4                                                 07507000
CRAASID  EQU   CRAIDS+2                                                 07508000
@NM00144 EQU   CRAIDS                                                   07509000
CRABFTBA EQU   CRABUFA                                                  07510000
CRAMASK  EQU   CRASVC+64                                                07511000
CRAHSIZ  EQU   CRASVC+60                                                07512000
CRAASCRR EQU   CRASVC                                                   07513000
@NM00143 EQU   CRAPROCR                                                 07514000
CRALAPTR EQU   CRABASIC+48                                              07515000
CRAL9PTR EQU   CRABASIC+44                                              07516000
CRAL8PTR EQU   CRABASIC+40                                              07517000
CRAL7PTR EQU   CRABASIC+36                                              07518000
CRAL6PTR EQU   CRABASIC+32                                              07519000
CRAL5PTR EQU   CRABASIC+28                                              07520000
CRAL4PTR EQU   CRABASIC+24                                              07521000
CRAL2PTR EQU   CRABASIC+16                                              07522000
CRAL1PTR EQU   CRABASIC+12                                              07523000
CRALEV01 EQU   CRALKACT+3                                               07524000
CRALEV02 EQU   CRALKACT+3                                               07525000
CRALEV03 EQU   CRALKACT+3                                               07526000
CRALEV04 EQU   CRALKACT+3                                               07527000
CRALEV05 EQU   CRALKACT+3                                               07528000
CRALEV06 EQU   CRALKACT+3                                               07529000
CRALEV07 EQU   CRALKACT+3                                               07530000
CRALEV08 EQU   CRALKACT+3                                               07531000
CRALEV09 EQU   CRALKACT+2                                               07532000
CRALEV10 EQU   CRALKACT+2                                               07533000
CRALEV11 EQU   CRALKACT+2                                               07534000
CRALEV12 EQU   CRALKACT+2                                               07535000
CRALEV13 EQU   CRALKACT+2                                               07536000
CRALEV14 EQU   CRALKACT+2                                               07537000
CRALEV15 EQU   CRALKACT+2                                               07538000
CRALEV16 EQU   CRALKACT+2                                               07539000
CRALEV17 EQU   CRALKACT+1                                               07540000
CRALEV18 EQU   CRALKACT+1                                               07541000
CRALEV19 EQU   CRALKACT+1                                               07542000
CRALEV20 EQU   CRALKACT+1                                               07543000
CRALEV21 EQU   CRALKACT+1                                               07544000
CRALEV22 EQU   CRALKACT+1                                               07545000
CRALEV23 EQU   CRALKACT+1                                               07546000
CRALEV24 EQU   CRALKACT+1                                               07547000
CRALEV25 EQU   CRALKACT                                                 07548000
CRALEV26 EQU   CRALKACT                                                 07549000
CRALEV27 EQU   CRALKACT                                                 07550000
CRALEV28 EQU   CRALKACT                                                 07551000
CRALEV29 EQU   CRALKACT                                                 07552000
CRALEV30 EQU   CRALKACT                                                 07553000
CRALEV31 EQU   CRALKACT                                                 07554000
CRALEV32 EQU   CRALKACT                                                 07555000
CRAFRR   EQU   CRAHDR+4                                                 07556000
CRACRR   EQU   CRAHDR                                                   07557000
@NM00142 EQU   ISTAPCRR+144                                             07558000
APCSVRB  EQU   ISTAPCRR+140                                             07559000
@NM00141 EQU   ISTAPCRR+137                                             07560000
@NM00140 EQU   APC57FLG                                                 07561000
APCNREL  EQU   APC57FLG                                                 07562000
APCRECRA EQU   APC57FLG                                                 07563000
@NM00139 EQU   APC54FLG                                                 07564000
APCRLST  EQU   APC54FLG                                                 07565000
APCPR153 EQU   APC53FLG                                                 07566000
@NM00138 EQU   APC52FLG                                                 07567000
APCWKF   EQU   APC52FLG                                                 07568000
APCNWF   EQU   APC52FLG                                                 07569000
APCRDQ   EQU   APC52FLG                                                 07570000
APCQENQ  EQU   APC52FLG                                                 07571000
APCSMSR  EQU   APC52FLG                                                 07572000
APCCKRQ  EQU   APC52FLG                                                 07573000
@NM00137 EQU   APC31FLG                                                 07574000
APCSORT  EQU   APC31FLG                                                 07575000
APCRESCH EQU   APC31FLG                                                 07576000
APCTPXIT EQU   APC31FLG                                                 07577000
APCSWTWD EQU   ISTAPCRR+128                                             07578000
APCSAV2  EQU   ISTAPCRR+124                                             07579000
APCSAV1  EQU   ISTAPCRR+120                                             07580000
APCRETCD EQU   APCCOMF+2                                                07581000
@NM00136 EQU   APCCOMF1+1                                               07582000
APCTSO   EQU   APCCOMF1+1                                               07583000
APCAUTHE EQU   APCCOMF1+1                                               07584000
APCZLBER EQU   APCCOMF1                                                 07585000
APCEXIT  EQU   APCCOMF1                                                 07586000
APCRELR  EQU   APCCOMF1                                                 07587000
APCIRB2  EQU   APCCOMF1                                                 07588000
APCIRB1  EQU   APCCOMF1                                                 07589000
APCSMCR  EQU   APCCOMF1                                                 07590000
APCUETSK EQU   APCCOMF1                                                 07591000
APCSSTSK EQU   APCCOMF1                                                 07592000
APCESTAL EQU   APCSAVE                                                  07593000
APCFRRPM EQU   ISTAPCRR+40                                              07594000
APCQWFO  EQU   ISTAPCRR+36                                              07595000
APCPABSV EQU   ISTAPCRR+32                                              07596000
APCRTRNA EQU   APCRTRN+1                                                07597000
@NM00135 EQU   APCAUT                                                   07598000
APCAUTEX EQU   APCAUT                                                   07599000
APCTCBA  EQU   ISTAPCRR+24                                              07600000
APCPSTA  EQU   ISTAPCRR+20                                              07601000
@NM00134 EQU   APCRFLG+1                                                07602000
APC31R   EQU   APCRFLG                                                  07603000
APC58R   EQU   APCRFLG                                                  07604000
APC57R   EQU   APCRFLG                                                  07605000
APC56R   EQU   APCRFLG                                                  07606000
APC54R   EQU   APCRFLG                                                  07607000
APC53R   EQU   APCRFLG                                                  07608000
APC52R   EQU   APCRFLG                                                  07609000
APC51R   EQU   APCRFLG                                                  07610000
@NM00133 EQU   APCATFLG+1                                               07611000
APC31E   EQU   APCATFLG                                                 07612000
APC58E   EQU   APCATFLG                                                 07613000
APC57E   EQU   APCATFLG                                                 07614000
APC56E   EQU   APCATFLG                                                 07615000
APC54E   EQU   APCATFLG                                                 07616000
APC53E   EQU   APCATFLG                                                 07617000
APC52E   EQU   APCATFLG                                                 07618000
APC51E   EQU   APCATFLG                                                 07619000
APCHDRSV EQU   ISTAPCRR                                                 07620000
ASCPSREG EQU   ISTASCRR+44                                              07621000
ASCUSR01 EQU   ASCUSRGS+12                                              07622000
ASCUSR00 EQU   ASCUSRGS+8                                               07623000
ASCUSR15 EQU   ASCUSRGS+4                                               07624000
ASCUSR14 EQU   ASCUSRGS                                                 07625000
ASCETRYA EQU   ISTASCRR+24                                              07626000
ASCKEY   EQU   ISTASCRR+23                                              07627000
ASCAUDIT EQU   ASCFLG3                                                  07628000
ASCFBDUD EQU   ASCFLG3                                                  07629000
ASCLLKF  EQU   ASCFLG3                                                  07630000
ASCKEYF  EQU   ASCFLG3                                                  07631000
ASCFBDAL EQU   ASCFLG3                                                  07632000
ASCFSRGT EQU   ASCFLG3                                                  07633000
ASCICR   EQU   ASCFLG2                                                  07634000
ASCFSRIC EQU   ASCFLG2                                                  07635000
ASCFBDIC EQU   ASCFLG2                                                  07636000
ASCFBAIC EQU   ASCFLG2                                                  07637000
ASCPASTR EQU   ASCFLG1                                                  07638000
ASCFSR   EQU   ASCFLG1                                                  07639000
ASCFBD   EQU   ASCFLG1                                                  07640000
ASCFBA   EQU   ASCFLG1                                                  07641000
ASCPFCRR EQU   ISTASCRR                                                 07642000
CRRRVPT5 EQU   CRRSAREA+316                                             07643000
CRRRVPT4 EQU   CRRSAREA+312                                             07644000
CRRRVPT3 EQU   CRRSAREA+308                                             07645000
CRRRVPT2 EQU   CRRSAREA+304                                             07646000
CRRRVPT1 EQU   CRRSAREA+300                                             07647000
CRRRVCR2 EQU   CRRSAREA+296                                             07648000
CRRCID   EQU   CRRSAREA+292                                             07649000
CRRRVCR1 EQU   CRRSAREA+291                                             07650000
CRRXFNCD EQU   CRRSAREA+290                                             07651000
CRRLDOCT EQU   CRRSAREA+288                                             07652000
CRRBTLEN EQU   CRRSAREA+284                                             07653000
CRRBLEN  EQU   CRRSAREA+282                                             07654000
CRRBRTCD EQU   CRRSAREA+281                                             07655000
@NM00132 EQU   CRRBFLGS                                                 07656000
CRRBFLG1 EQU   CRRBFLGS                                                 07657000
CRRBLDAD EQU   CRRSAREA+276                                             07658000
CRRBARAD EQU   CRRSAREA+272                                             07659000
CRRRTN12 EQU   CRRSAREA+268                                             07660000
CRRRTN11 EQU   CRRSAREA+264                                             07661000
CRRRTN10 EQU   CRRSAREA+260                                             07662000
CRRRTN9  EQU   CRRSAREA+256                                             07663000
CRRRTN8  EQU   CRRSAREA+252                                             07664000
CRRRTN7  EQU   CRRSAREA+248                                             07665000
CRRRTN6  EQU   CRRSAREA+244                                             07666000
CRRRTN5  EQU   CRRSAREA+240                                             07667000
CRRRTN4  EQU   CRRSAREA+236                                             07668000
CRRRTN3  EQU   CRRSAREA+232                                             07669000
CRRRTN2  EQU   CRRSAREA+228                                             07670000
CRRRTN1  EQU   CRRSAREA+224                                             07671000
CRRRES1  EQU   CRRSAREA+222                                             07672000
CRRLCNT  EQU   CRRSAREA+220                                             07673000
CRRATCVT EQU   CRRSAREA+216                                             07674000
CRRVALCK EQU   CRRSAREA+212                                             07675000
CRRARPL  EQU   CRRTRBUF+4                                               07676000
CRRBIND  EQU   CRRTRBUF+3                                               07677000
CRRTRRES EQU   CRRTRBUF                                                 07678000
CRRCLDO  EQU   CRRSAREA+200                                             07679000
CRRUECB  EQU   CRRSAREA+196                                             07680000
CRRLCPB  EQU   CRRSAREA+192                                             07681000
CRRCMDAD EQU   CRRSAREA+188                                             07682000
CRRFMCB  EQU   CRRSAREA+184                                             07683000
CRRCLCCW EQU   CRRSAREA+180                                             07684000
CRRESR2  EQU   CRRESR+1                                                 07685000
CRRESR1  EQU   CRRESR                                                   07686000
CRRDSB2  EQU   CRRDSB+1                                                 07687000
CRRDSB1  EQU   CRRDSB                                                   07688000
CRRDTACT EQU   CRRSAREA+174                                             07689000
CRRRSV99 EQU   CRRSAREA+173                                             07690000
CRRRDSOH EQU   CRRFDB3                                                  07691000
CRRRLG   EQU   CRRFDB3                                                  07692000
CRRLGFRC EQU   CRRFDB3                                                  07693000
CRRRDEOT EQU   CRRFDB3                                                  07694000
CRRRDEOM EQU   CRRFDB3                                                  07695000
CRRRDEOB EQU   CRRFDB3                                                  07696000
CRRUNUSD EQU   CRRFDB3                                                  07697000
CRRUINPT EQU   CRRFDB3                                                  07698000
CRRSTSAV EQU   CRRFDB2                                                  07699000
CRRCUERR EQU   CRRFDB2                                                  07700000
CRRDLGFL EQU   CRRFDB2                                                  07701000
CRRIOERR EQU   CRRFDB2                                                  07702000
CRRDVUNS EQU   CRRFDB2                                                  07703000
CRRATND  EQU   CRRFDB2                                                  07704000
CRRRVID  EQU   CRRFDB2                                                  07705000
CRRERLK  EQU   CRRFDB2                                                  07706000
CRRRTNCD EQU   CRRFDBK1                                                 07707000
CRRNSNA  EQU   CRRRTYPE                                                 07708000
CRRDFSYN EQU   CRRRTYPE                                                 07709000
CRRRESP  EQU   CRRRTYPE                                                 07710000
CRRDFASY EQU   CRRRTYPE                                                 07711000
CRRDBLCK EQU   CRRRFLG1                                                 07712000
CRRRPSBD EQU   CRRRFLG1                                                 07713000
CRRRPLOQ EQU   CRRRFLG1                                                 07714000
CRRRPLS  EQU   CRRRFLG1                                                 07715000
CRRSW7   EQU   CRRFLGS                                                  07716000
CRRSW6   EQU   CRRFLGS                                                  07717000
CRRSW5   EQU   CRRFLGS                                                  07718000
CRRSW4   EQU   CRRFLGS                                                  07719000
CRRSW3   EQU   CRRFLGS                                                  07720000
CRRSW2   EQU   CRRFLGS                                                  07721000
CRRSW1   EQU   CRRFLGS                                                  07722000
CRRSW0   EQU   CRRFLGS                                                  07723000
CRRRSV04 EQU   CRRFLGS4                                                 07724000
CRRFMCLK EQU   CRRFLGS4                                                 07725000
CRRDLCCW EQU   CRRFLGS3                                                 07726000
CRRRESET EQU   CRRFLGS3                                                 07727000
CRRSUBBK EQU   CRRFLGS3                                                 07728000
CRRRSV08 EQU   CRRFLGS3                                                 07729000
CRRDEBQ  EQU   CRRFLGS3                                                 07730000
CRRSTSPR EQU   CRRFLGS3                                                 07731000
CRRDREQ  EQU   CRRFLGS3                                                 07732000
CRRDFDBK EQU   CRRFLGS3                                                 07733000
CRRDFSB  EQU   CRRFLGS2                                                 07734000
CRRDPROC EQU   CRRFLGS2                                                 07735000
CRREXTS  EQU   CRRFLGS2                                                 07736000
CRRELSRI EQU   CRRFLGS2                                                 07737000
CRRPOST  EQU   CRRFLGS2                                                 07738000
CRRENDLW EQU   CRRFLGS2                                                 07739000
CRRPRGIP EQU   CRRFLGS2                                                 07740000
CRRDEXP  EQU   CRRFLGS2                                                 07741000
CRRSOLRQ EQU   CRRFLGS1                                                 07742000
CRRREQP  EQU   CRRFLGS1                                                 07743000
CRRCPROC EQU   CRRFLGS1                                                 07744000
CRRFINI  EQU   CRRFLGS1                                                 07745000
CRRPREIO EQU   CRRFLGS1                                                 07746000
CRRINIO  EQU   CRRFLGS1                                                 07747000
CRRFLDOS EQU   CRRFLGS1                                                 07748000
CRRDOCUR EQU   CRRFLGS1                                                 07749000
CRRRATS4 EQU   CRRATS+7                                                 07750000
CRRASC31 EQU   CRRSATS                                                  07751000
CRRASC11 EQU   CRRSATS                                                  07752000
CRRASC51 EQU   CRRSATS                                                  07753000
CRRASC40 EQU   CRRSATS                                                  07754000
CRRASC30 EQU   CRRSATS                                                  07755000
CRRASC21 EQU   CRRSATS                                                  07756000
CRRASC10 EQU   CRRSATS                                                  07757000
CRRASC01 EQU   CRRSATS                                                  07758000
CRRSCBND EQU   CRRRATS2                                                 07759000
CRRPLIC  EQU   CRRRATS2                                                 07760000
CRRRC81  EQU   CRRRATS2                                                 07761000
CRRRC80  EQU   CRRRATS2                                                 07762000
CRRRC65  EQU   CRRRATS2                                                 07763000
CRRRC63  EQU   CRRRATS2                                                 07764000
CRRRC55  EQU   CRRRATS2                                                 07765000
CRRRC54  EQU   CRRRATS2                                                 07766000
CRRRC53  EQU   CRRRATS1                                                 07767000
CRRRC52  EQU   CRRRATS1                                                 07768000
CRRRC51  EQU   CRRRATS1                                                 07769000
CRRRC30  EQU   CRRRATS1                                                 07770000
CRRRC26  EQU   CRRRATS1                                                 07771000
CRRRC23  EQU   CRRRATS1                                                 07772000
CRRRC22  EQU   CRRRATS1                                                 07773000
CRRRC21  EQU   CRRRATS1                                                 07774000
@NM00131 EQU   CRRATS4                                                  07775000
CRRC3X   EQU   CRRATS4                                                  07776000
CRRC85   EQU   CRRATS4                                                  07777000
CRRC83   EQU   CRRATS4                                                  07778000
CRRC82   EQU   CRRATS4                                                  07779000
CRRC61   EQU   CRRATS4                                                  07780000
CRRC60   EQU   CRRATS4                                                  07781000
CRRC81   EQU   CRRATS3                                                  07782000
CRRC80   EQU   CRRATS3                                                  07783000
CRRC75   EQU   CRRATS3                                                  07784000
CRRC51   EQU   CRRATS3                                                  07785000
CRRC50   EQU   CRRATS3                                                  07786000
CRRC42   EQU   CRRATS3                                                  07787000
CRRC41   EQU   CRRATS3                                                  07788000
CRRC40   EQU   CRRATS3                                                  07789000
CRRC32   EQU   CRRATS2                                                  07790000
CRRC31   EQU   CRRATS2                                                  07791000
CRRC30   EQU   CRRATS2                                                  07792000
CRRC25   EQU   CRRATS2                                                  07793000
CRRC24   EQU   CRRATS2                                                  07794000
CRRC23   EQU   CRRATS2                                                  07795000
CRRC22   EQU   CRRATS2                                                  07796000
CRRC21   EQU   CRRATS2                                                  07797000
CRRC20   EQU   CRRATS1                                                  07798000
CRRC13   EQU   CRRATS1                                                  07799000
CRRC12   EQU   CRRATS1                                                  07800000
CRRC11   EQU   CRRATS1                                                  07801000
CRRC10   EQU   CRRATS1                                                  07802000
CRRC02   EQU   CRRATS1                                                  07803000
CRRC01   EQU   CRRATS1                                                  07804000
CRRC00   EQU   CRRATS1                                                  07805000
CRRRMAS4 EQU   CRRMAS+7                                                 07806000
CRRMSC31 EQU   CRRSMAS                                                  07807000
CRRMSC11 EQU   CRRSMAS                                                  07808000
CRRMSC51 EQU   CRRSMAS                                                  07809000
CRRMSC40 EQU   CRRSMAS                                                  07810000
CRRMSC30 EQU   CRRSMAS                                                  07811000
CRRMSC21 EQU   CRRSMAS                                                  07812000
CRRMSC10 EQU   CRRSMAS                                                  07813000
CRRMSC01 EQU   CRRSMAS                                                  07814000
@NM00130 EQU   CRRRMAS2                                                 07815000
CRRRM81  EQU   CRRRMAS2                                                 07816000
CRRRM80  EQU   CRRRMAS2                                                 07817000
CRRRM65  EQU   CRRRMAS2                                                 07818000
CRRRM63  EQU   CRRRMAS2                                                 07819000
CRRRM55  EQU   CRRRMAS2                                                 07820000
CRRRM54  EQU   CRRRMAS2                                                 07821000
CRRRM53  EQU   CRRRMAS1                                                 07822000
CRRRM52  EQU   CRRRMAS1                                                 07823000
CRRRM51  EQU   CRRRMAS1                                                 07824000
CRRRM30  EQU   CRRRMAS1                                                 07825000
CRRRM26  EQU   CRRRMAS1                                                 07826000
CRRRM23  EQU   CRRRMAS1                                                 07827000
CRRRM22  EQU   CRRRMAS1                                                 07828000
CRRRM21  EQU   CRRRMAS1                                                 07829000
@NM00129 EQU   CRRMAS4                                                  07830000
CRRM3X   EQU   CRRMAS4                                                  07831000
CRRM85   EQU   CRRMAS4                                                  07832000
CRRM83   EQU   CRRMAS4                                                  07833000
CRRM82   EQU   CRRMAS4                                                  07834000
CRRM61   EQU   CRRMAS4                                                  07835000
CRRM60   EQU   CRRMAS4                                                  07836000
CRRM81   EQU   CRRMAS3                                                  07837000
CRRM80   EQU   CRRMAS3                                                  07838000
CRRM75   EQU   CRRMAS3                                                  07839000
CRRM51   EQU   CRRMAS3                                                  07840000
CRRM50   EQU   CRRMAS3                                                  07841000
CRRM42   EQU   CRRMAS3                                                  07842000
CRRM41   EQU   CRRMAS3                                                  07843000
CRRM40   EQU   CRRMAS3                                                  07844000
CRRM32   EQU   CRRMAS2                                                  07845000
CRRM31   EQU   CRRMAS2                                                  07846000
CRRM30   EQU   CRRMAS2                                                  07847000
CRRM25   EQU   CRRMAS2                                                  07848000
CRRM24   EQU   CRRMAS2                                                  07849000
CRRM23   EQU   CRRMAS2                                                  07850000
CRRM22   EQU   CRRMAS2                                                  07851000
CRRM21   EQU   CRRMAS2                                                  07852000
CRRM20   EQU   CRRMAS1                                                  07853000
CRRM13   EQU   CRRMAS1                                                  07854000
CRRM12   EQU   CRRMAS1                                                  07855000
CRRM11   EQU   CRRMAS1                                                  07856000
CRRM10   EQU   CRRMAS1                                                  07857000
CRRM02   EQU   CRRMAS1                                                  07858000
CRRM01   EQU   CRRMAS1                                                  07859000
CRRM00   EQU   CRRMAS1                                                  07860000
CRRFSB   EQU   CRRSAREA+144                                             07861000
CRRSAVE1 EQU   CRRSAREA+72                                              07862000
CRRSAVE  EQU   CRRSAREA                                                 07863000
CRRRSV22 EQU   ISTDCCRR+4                                               07864000
CRRCRR   EQU   ISTDCCRR                                                 07865000
CCFRSVD1 EQU   CFCCRT                                                   07866000
CCFCR2   EQU   CFCCRT                                                   07867000
CCFCRP   EQU   CFCCRT                                                   07868000
CCFCR1   EQU   CFCCRT                                                   07869000
CCFCS2   EQU   CFCCRT                                                   07870000
CCFCS1   EQU   CFCCRT                                                   07871000
NCFRSVD  EQU   CFCNTRD                                                  07872000
NCFCR2   EQU   CFCNTRD                                                  07873000
NCFCRP   EQU   CFCNTRD                                                  07874000
NCFCR1   EQU   CFCNTRD                                                  07875000
NCFCS2   EQU   CFCNTRD                                                  07876000
NCFCS1   EQU   CFCNTRD                                                  07877000
PFCRSV01 EQU   ISTPFCRR+13                                              07878000
PFCFTA   EQU   ISTPFCRR+12                                              07879000
CRRFRR   EQU   PFCFRRO                                                  07880000
CRRCHAIN EQU   PFCCRRO                                                  07881000
CRRLEN   EQU   PFCCRRLN                                                 07882000
PFCRSV10 EQU   PFCCRR+1                                                 07883000
CRRID    EQU   PFCCRRID                                                 07884000
POIPRIMQ EQU   POIPRANC+1                                               07885000
@NM00128 EQU   POIPRANC                                                 07886000
POIPOCBQ EQU   POIANCR+1                                                07887000
@NM00127 EQU   POIANCR                                                  07888000
POIRSVD  EQU   ISTPOIA+2                                                07889000
POILNGTH EQU   ISTPOIA+1                                                07890000
POICBID  EQU   ISTPOIA                                                  07891000
ATCAOS   EQU   ISTATCVT+1868                                            07892000
@NM00126 EQU   ISTATCVT+1860                                            07893000
@NM00125 EQU   ISTATCVT+1852                                            07894000
@NM00124 EQU   ISTATCVT+1844                                            07895000
@NM00123 EQU   ISTATCVT+1836                                            07896000
@NM00122 EQU   ISTATCVT+1828                                            07897000
@NM00121 EQU   ISTATCVT+1820                                            07898000
ATCHWCSA EQU   ISTATCVT+1816                                            07899000
ATCCACSA EQU   ISTATCVT+1812                                            07900000
ATCMXCSA EQU   ISTATCVT+1808                                            07901000
ATCTPMPB EQU   ISTATCVT+1776                                            07902000
ATCTRMPB EQU   ISTATCVT+1744                                            07903000
ATCRPLAC EQU   ATCRPLCN+2                                               07904000
ATCRPLRC EQU   ATCRPLCN                                                 07905000
ATCCRPLQ EQU   ATCCRPL                                                  07906000
ATCSRBAC EQU   ATCSRBCN+2                                               07907000
ATCSRBRC EQU   ATCSRBCN                                                 07908000
ATCSRBQ  EQU   ATCSRB                                                   07909000
ATCCRAAC EQU   ATCCRACN+2                                               07910000
ATCCRARC EQU   ATCCRACN                                                 07911000
ATCCRAQ  EQU   ATCCRA                                                   07912000
ATCLUFFD EQU   ISTATCVT+1716                                            07913000
ATCVIOPM EQU   ISTATCVT+1712                                            07914000
ATCTPMMI EQU   ISTATCVT+1708                                            07915000
ATCPXSRB EQU   ISTATCVT+1704                                            07916000
ATCRPLCT EQU   ISTATCVT+1702                                            07917000
ATCCRACT EQU   ISTATCVT+1700                                            07918000
ATCSRBCT EQU   ISTATCVT+1698                                            07919000
ATCSTNSM EQU   ISTATCVT+1697                                            07920000
@NM00120 EQU   ATCZFLAG                                                 07921000
ATCZF001 EQU   ATCZFLAG                                                 07922000
ATCTPCP1 EQU   ISTATCVT+1692                                            07923000
ATCTPCP0 EQU   ISTATCVT+1688                                            07924000
ATCZR01  EQU   ISTATCVT+1684                                            07925000
ATCMPLTA EQU   ISTATCVT+1680                                            07926000
ATCASCB  EQU   ISTATCVT+1676                                            07927000
ATCAP86  EQU   ISTATCVT+1672                                            07928000
ATCAP85  EQU   ISTATCVT+1668                                            07929000
ATCAP84  EQU   ISTATCVT+1664                                            07930000
ATCAP83  EQU   ISTATCVT+1660                                            07931000
ATCAP82  EQU   ISTATCVT+1656                                            07932000
ATCAP69  EQU   ISTATCVT+1652                                            07933000
ATCAP66  EQU   ISTATCVT+1648                                            07934000
ATCAP62  EQU   ISTATCVT+1644                                            07935000
ATCAPC59 EQU   ISTATCVT+1640                                            07936000
ATCAP56  EQU   ISTATCVT+1636                                            07937000
ATCAP55  EQU   ISTATCVT+1632                                            07938000
ATCAP41  EQU   ISTATCVT+1628                                            07939000
ATCAPC25 EQU   ISTATCVT+1624                                            07940000
ATCAP23  EQU   ISTATCVT+1620                                            07941000
ATCAPBE  EQU   ISTATCVT+1616                                            07942000
ATCPSTA  EQU   ISTATCVT+1612                                            07943000
ATCSMABF EQU   ISTATCVT+1608                                            07944000
ATCSMAPR EQU   ISTATCVT+1604                                            07945000
ATCTPWQA EQU   ISTATCVT+1600                                            07946000
ATCSMAID EQU   ISTATCVT+1596                                            07947000
ATCSMARA EQU   ISTATCVT+1592                                            07948000
ATCCACXA EQU   ISTATCVT+1588                                            07949000
ATCATA10 EQU   ISTATCVT+1584                                            07950000
ATCHLTCB EQU   ISTATCVT+1580                                            07951000
@NM00119 EQU   ATCVTFLG                                                 07952000
ATCVTACT EQU   ATCVTFLG                                                 07953000
@NM00118 EQU   @NM00117                                                 07954000
ATCVTMAB EQU   @NM00117                                                 07955000
ATCVTBAM EQU   ISTATCVT+1572                                            07956000
@NM00116 EQU   ISTATCVT+1568                                            07957000
@NM00115 EQU   ISTATCVT+1520                                            07958000
ATCCCOOC EQU   ISTATCVT+1516                                            07959000
@NM00114 EQU   ISTATCVT+1513                                            07960000
ATCSNUF  EQU   ATCENFLG                                                 07961000
ATCOPKL  EQU   ATCENFLG                                                 07962000
ATCABEN  EQU   ATCENFLG                                                 07963000
ATCSRDN  EQU   ATCENFLG                                                 07964000
ATCDLDN  EQU   ATCENFLG                                                 07965000
ATCTIMER EQU   ISTATCVT+1508                                            07966000
ATCAIWT  EQU   ISTATCVT+1504                                            07967000
ATCOROBT EQU   ISTATCVT+1500                                            07968000
ATCDMAPP EQU   ISTATCVT+1496                                            07969000
ATCZDVTX EQU   ISTATCVT+1492                                            07970000
ATCPXCRA EQU   ISTATCVT+1488                                            07971000
ATCICNCB EQU   ISTATCVT+1484                                            07972000
ATCCMTCB EQU   ISTATCVT+1480                                            07973000
ATCPRPH  EQU   ISTATCVT+1476                                            07974000
ATCGSRBF EQU   ATCGSRBG                                                 07975000
ATCSRBRT EQU   ISTATCVT+1468                                            07976000
ATCTSCPC EQU   ISTATCVT+1464                                            07977000
@NM00113 EQU   ISTATCVT+1460                                            07978000
ATCCDTCB EQU   ISTATCVT+1456                                            07979000
ATCORFRL EQU   ISTATCVT+1452                                            07980000
ATCORFPX EQU   ISTATCVT+1448                                            07981000
ATCORFMG EQU   ISTATCVT+1444                                            07982000
ATCSMBQ  EQU   ISTATCVT+1440                                            07983000
ATCINFDD EQU   ISTATCVT+1436                                            07984000
ATCAP67  EQU   ISTATCVT+1432                                            07985000
ATCAP65  EQU   ISTATCVT+1428                                            07986000
ATCAP64  EQU   ISTATCVT+1424                                            07987000
ATCAP63  EQU   ISTATCVT+1420                                            07988000
ATCAP61  EQU   ISTATCVT+1416                                            07989000
ATCAP58  EQU   ISTATCVT+1412                                            07990000
ATCAP57  EQU   ISTATCVT+1408                                            07991000
ATCAP54  EQU   ISTATCVT+1404                                            07992000
ATCAP53  EQU   ISTATCVT+1400                                            07993000
ATCAP52  EQU   ISTATCVT+1396                                            07994000
ATCAP51  EQU   ISTATCVT+1392                                            07995000
ATCAP38  EQU   ISTATCVT+1388                                            07996000
ATCAP32  EQU   ISTATCVT+1376                                            07997000
ATCAP31  EQU   ISTATCVT+1372                                            07998000
ATCAP12  EQU   ISTATCVT+1368                                            07999000
ATCAP11  EQU   ISTATCVT+1364                                            08000000
ATCDAPDG EQU   ATCDAPVT+20                                              08001000
ATCDXCEA EQU   ATCDAPVT+16                                              08002000
ATCDCEA  EQU   ATCDAPVT+12                                              08003000
ATCDPCIA EQU   ATCDAPVT+8                                               08004000
ATCDSIOA EQU   ATCDAPVT+4                                               08005000
ATCDEOEA EQU   ATCDAPVT                                                 08006000
ATCZAEA  EQU   ATCICAPP+16                                              08007000
ATCZCEA  EQU   ATCICAPP+12                                              08008000
ATCZCPCI EQU   ATCICAPP+8                                               08009000
ATCZSIOA EQU   ATCICAPP+4                                               08010000
ATCCDRPH EQU   ATCICAPP                                                 08011000
ATCORQG  EQU   ATCORSRB                                                 08012000
ATCORTBF EQU   ATCSQAFR                                                 08013000
@NM00112 EQU   ISTATCVT+1308                                            08014000
ATCZLAEA EQU   ATCLDAPP+16                                              08015000
ATCZLCEA EQU   ATCLDAPP+12                                              08016000
ATCZLPCI EQU   ATCLDAPP+8                                               08017000
ATCSMFRR EQU   ATCLDAPP+4                                               08018000
ATCCDTID EQU   ATCLDAPP                                                 08019000
@NM00111 EQU   ISTATCVT+1256                                            08020000
ATCZPAB2 EQU   ISTATCVT+1224                                            08021000
@NM00110 EQU   ISTATCVT+1224                                            08022000
@NM00109 EQU   ISTATCVT+1164                                            08023000
ATCCPCFE EQU   ISTATCVT+1160                                            08024000
@NM00108 EQU   ATCRID+2                                                 08025000
ATCCDRMA EQU   ATCRID                                                   08026000
@NM00107 EQU   ATCSMSDQ+8                                               08027000
@NM00106 EQU   ATCSMSDQ+4                                               08028000
@NM00105 EQU   ATCSMSDQ                                                 08029000
ATCSEQNO EQU   ISTATCVT+1136                                            08030000
ATCSMPMD EQU   ISTATCVT+1132                                            08031000
ATCPAREA EQU   ISTATCVT+1128                                            08032000
ATCCPCSM EQU   ISTATCVT+1124                                            08033000
ATCQLOCK EQU   ISTATCVT+1120                                            08034000
ATCITQLE EQU   ISTATCVT+1116                                            08035000
ATCSQCDS EQU   ISTATCVT+1112                                            08036000
ATCUSSVT EQU   ISTATCVT+1108                                            08037000
ATCNOSQ  EQU   ISTATCVT+1104                                            08038000
ATCINCIP EQU   ATCCPDVT+4                                               08039000
ATCTSCNI EQU   ATCCPDVT                                                 08040000
ATCMGCRT EQU   ISTATCVT+1092                                            08041000
ATCMACRT EQU   ISTATCVT+1088                                            08042000
ATCCSMT  EQU   ISTATCVT+1084                                            08043000
ATCDRUSL EQU   ISTATCVT+1080                                            08044000
ATCDRULL EQU   ISTATCVT+1076                                            08045000
ATCCFCDR EQU   ISTATCVT+1072                                            08046000
@NM00104 EQU   ISTATCVT+1069                                            08047000
ATCMROUT EQU   ISTATCVT+1060                                            08048000
ATCONFIG EQU   ISTATCVT+1052                                            08049000
ATCNODEL EQU   ISTATCVT+1044                                            08050000
@NM00103 EQU   @NM00102+9                                               08051000
ATCLAST  EQU   ATCSHRFG                                                 08052000
ATCSHRTN EQU   @NM00102                                                 08053000
@NM00101 EQU   ISTATCVT+1026                                            08054000
ATCNMCTR EQU   ISTATCVT+1024                                            08055000
@NM00100 EQU   ATCRNO                                                   08056000
ATCLCLCT EQU   ATCVLCNT+2                                               08057000
ATCRNCNT EQU   ATCVLCNT                                                 08058000
ATCHBSIZ EQU   ATCHPGM+2                                                08059000
ATCHBFNO EQU   ATCHPGM                                                  08060000
@NM00099 EQU   ISTATCVT+1011                                            08061000
ATCXRANG EQU   ISTATCVT+1010                                            08062000
ATCMAXID EQU   ISTATCVT+1009                                            08063000
ATCMSGSP EQU   ISTATCVT+1008                                            08064000
ATCCIDM  EQU   ISTATCVT+1006                                            08065000
ATCACTRM EQU   ISTATCVT+1004                                            08066000
ATCECTLP EQU   ISTATCVT+1000                                            08067000
ATCECNET EQU   ISTATCVT+996                                             08068000
ATCECOPC EQU   ISTATCVT+992                                             08069000
ATCECSES EQU   ISTATCVT+988                                             08070000
ATCECDSP EQU   ISTATCVT+984                                             08071000
ATCECVRY EQU   ISTATCVT+980                                             08072000
ATCECHLT EQU   ISTATCVT+976                                             08073000
ATCECMOD EQU   ISTATCVT+972                                             08074000
ATCVDLOK EQU   ISTATCVT+968                                             08075000
ATCVOCLK EQU   ISTATCVT+960                                             08076000
ATCITLIM EQU   ISTATCVT+958                                             08077000
ATCTMINV EQU   ISTATCVT+956                                             08078000
ATCHOSTA EQU   ISTATCVT+954                                             08079000
ATCPUNSA EQU   ISTATCVT+952                                             08080000
ATCSAF   EQU   ISTATCVT+950                                             08081000
ATCVTMID EQU   ATCSSCPA                                                 08082000
ATCHCNID EQU   ATCONID+2                                                08083000
ATCSCNID EQU   ATCONID                                                  08084000
@NM00098 EQU   ATCBITAN+3                                               08085000
@NM00097 EQU   ATCBITAN+2                                               08086000
@NM00096 EQU   ATCFLAG2                                                 08087000
@NM00095 EQU   ATCFLAG2                                                 08088000
@NM00094 EQU   ATCFLAG2                                                 08089000
ATCCRYPF EQU   ATCFLAG2                                                 08090000
ATCTUNCL EQU   ATCFLAG2                                                 08091000
ATCTUNRQ EQU   ATCFLAG2                                                 08092000
ATCTUNAC EQU   ATCFLAG2                                                 08093000
ATCCDLRA EQU   ATCFLAG2                                                 08094000
@NM00093 EQU   ATCBITAN                                                 08095000
@NM00092 EQU   ATCSTAT4                                                 08096000
@NM00091 EQU   ATCSTAT4                                                 08097000
@NM00090 EQU   ATCSTAT4                                                 08098000
@NM00089 EQU   ATCSTAT4                                                 08099000
@NM00088 EQU   ATCSTAT4                                                 08100000
ATCPRTAT EQU   ATCSTAT4                                                 08101000
ATCNCSD  EQU   ATCSTAT4                                                 08102000
ATCMTST  EQU   ATCSTAT4                                                 08103000
@NM00087 EQU   ATCPOFLG                                                 08104000
@NM00086 EQU   ATCPOFLG                                                 08105000
@NM00085 EQU   ATCPOFLG                                                 08106000
@NM00084 EQU   ATCPOFLG                                                 08107000
@NM00083 EQU   ATCPOFLG                                                 08108000
@NM00082 EQU   ATCPOFLG                                                 08109000
@NM00081 EQU   ATCPOFLG                                                 08110000
ATCPOUNS EQU   ATCPOFLG                                                 08111000
@NM00080 EQU   ATCSTAT+1                                                08112000
ATCHIP   EQU   ATCSTAT1                                                 08113000
ATCMDHLT EQU   ATCSTAT1                                                 08114000
ATCINHLT EQU   ATCSTAT1                                                 08115000
ATCNETSL EQU   ATCSTAT1                                                 08116000
ATCQKHLT EQU   ATCSTAT1                                                 08117000
ATCSNHLT EQU   ATCSTAT1                                                 08118000
ATCACTIV EQU   ATCSTAT1                                                 08119000
ATCSTART EQU   ATCSTAT1                                                 08120000
ATCNOP00 EQU   ISTATCVT+932                                             08121000
ATCTSBUF EQU   ISTATCVT+928                                             08122000
ATCFEPT  EQU   ISTATCVT+924                                             08123000
ATCFDVT  EQU   ISTATCVT+920                                             08124000
ATCCONFT EQU   ISTATCVT+916                                             08125000
ATCRDTH  EQU   ISTATCVT+912                                             08126000
ATCSIBQ  EQU   ISTATCVT+908                                             08127000
ATCHLTMS EQU   ISTATCVT+904                                             08128000
ATCECPRM EQU   ISTATCVT+900                                             08129000
ATCVPARM EQU   ISTATCVT+896                                             08130000
ATCOCHA  EQU   ISTATCVT+892                                             08131000
ATCDSPLQ EQU   ISTATCVT+888                                             08132000
ATCVARYQ EQU   ISTATCVT+884                                             08133000
ATCHALTQ EQU   ISTATCVT+880                                             08134000
ATCMODQ  EQU   ISTATCVT+876                                             08135000
ATCSRT   EQU   ISTATCVT+872                                             08136000
ATCRDT   EQU   ISTATCVT+868                                             08137000
ATCSDVT  EQU   ISTATCVT+864                                             08138000
ATCDLRPT EQU   ISTATCVT+860                                             08139000
ATCBPDA  EQU   ISTATCVT+856                                             08140000
ATCACDA  EQU   ISTATCVT+852                                             08141000
ATCMNT   EQU   ISTATCVT+848                                             08142000
ATCUEP   EQU   ISTATCVT+844                                             08143000
ATCNODDS EQU   ISTATCVT+840                                             08144000
ATCITRT  EQU   ISTATCVT+836                                             08145000
ATCTODVT EQU   ISTATCVT+832                                             08146000
ATCTRCPT EQU   ISTATCVT+828                                             08147000
ATCMODTB EQU   ISTATCVT+824                                             08148000
ATCUSSPT EQU   ISTATCVT+820                                             08149000
ATCTUBUF EQU   ISTATCVT+816                                             08150000
ATCTACB  EQU   ISTATCVT+812                                             08151000
ATCDWA   EQU   ISTATCVT+808                                             08152000
ATCCFCR2 EQU   ATCPODVT                                                 08153000
ATCEPA   EQU   ISTATCVT+800                                             08154000
ATCPULQB EQU   @NM00079+16                                              08155000
ATCMCQAB EQU   @NM00079+12                                              08156000
ATCLUSMQ EQU   @NM00079+8                                               08157000
ATCLUIOQ EQU   @NM00079+4                                               08158000
ATCIOLQB EQU   @NM00079                                                 08159000
ATCTSCAP EQU   ATCANYDT                                                 08160000
ATCTSCCO EQU   ATCLUDVT+4                                               08161000
ATCTSCSR EQU   ATCLUDVT                                                 08162000
ATCVTLOD EQU   ISTATCVT+764                                             08163000
ATCTSCLF EQU   ISTATCVT+760                                             08164000
ATCTSCLE EQU   ISTATCVT+756                                             08165000
ATCTSCLB EQU   ISTATCVT+752                                             08166000
ATCTSCLS EQU   ISTATCVT+748                                             08167000
ATCTSCCF EQU   ISTATCVT+744                                             08168000
ATCTSCFV EQU   ISTATCVT+740                                             08169000
ATCTSCCE EQU   ISTATCVT+736                                             08170000
ATCTSCCB EQU   ISTATCVT+732                                             08171000
ATCTSCWS EQU   ISTATCVT+728                                             08172000
ATCTSCEM EQU   ISTATCVT+724                                             08173000
ATCTSCNS EQU   ISTATCVT+720                                             08174000
ATCTSCER EQU   ISTATCVT+716                                             08175000
ATCTSCPR EQU   ISTATCVT+712                                             08176000
ATCTSCGR EQU   ISTATCVT+708                                             08177000
ATCTSCCI EQU   ISTATCVT+704                                             08178000
ATCTSVT  EQU   ISTATCVT+700                                             08179000
ATCDVLOD EQU   ISTATCVT+696                                             08180000
ATCCDCNR EQU   ISTATCVT+692                                             08181000
ATCCDCNF EQU   ISTATCVT+688                                             08182000
ATCCDCND EQU   ISTATCVT+684                                             08183000
ATCCDCNA EQU   ISTATCVT+680                                             08184000
ATCCDCCP EQU   ISTATCVT+676                                             08185000
ATCCDFDN EQU   ISTATCVT+672                                             08186000
ATCCDFIN EQU   ISTATCVT+668                                             08187000
ATCCDFND EQU   ISTATCVT+664                                             08188000
ATCCDDEL EQU   ISTATCVT+660                                             08189000
ATCCDADD EQU   ISTATCVT+656                                             08190000
ATCTCLIM EQU   ISTATCVT+652                                             08191000
ATCRACTR EQU   ISTATCVT+648                                             08192000
ATCRACTI EQU   ISTATCVT+644                                             08193000
ATCREMOV EQU   ISTATCVT+640                                             08194000
ATCRACIO EQU   ISTATCVT+636                                             08195000
ATCADD   EQU   ISTATCVT+632                                             08196000
ATCPUCRT EQU   ISTATCVT+628                                             08197000
ATCSMRS  EQU   ISTATCVT+624                                             08198000
ATCSMRQ  EQU   ISTATCVT+620                                             08199000
ATCORCPX EQU   ISTATCVT+616                                             08200000
ATCORCAF EQU   ISTATCVT+612                                             08201000
ATCFRSTR EQU   ATCGTSTR                                                 08202000
ATCSTMA  EQU   ISTATCVT+604                                             08203000
ATCSRTAD EQU   ISTATCVT+600                                             08204000
ATCOCRT  EQU   ISTATCVT+596                                             08205000
ATCOCCFS EQU   ISTATCVT+592                                             08206000
ATCOCCFP EQU   ISTATCVT+588                                             08207000
ATCSRTDF EQU   ISTATCVT+584                                             08208000
ATCLUCRT EQU   ISTATCVT+580                                             08209000
ATCINCY5 EQU   ISTATCVT+576                                             08210000
ATCINCW3 EQU   ISTATCVT+572                                             08211000
ATCINCU6 EQU   ISTATCVT+568                                             08212000
ATCINCTQ EQU   ISTATCVT+564                                             08213000
ATCINCS1 EQU   ISTATCVT+560                                             08214000
ATCSRTAB EQU   ISTATCVT+556                                             08215000
ATCINCRD EQU   ISTATCVT+552                                             08216000
ATCINCPH EQU   ISTATCVT+548                                             08217000
ATCINCLQ EQU   ISTATCVT+544                                             08218000
ATCNOCRT EQU   ISTATCVT+540                                             08219000
ATCINCF1 EQU   ISTATCVT+536                                             08220000
ATCINCCI EQU   ISTATCVT+532                                             08221000
ATCINCCO EQU   ISTATCVT+528                                             08222000
ATCBLDLA EQU   ISTATCVT+524                                             08223000
ATCALOAD EQU   ISTATCVT+520                                             08224000
ATCADEL  EQU   ISTATCVT+516                                             08225000
ATCESC02 EQU   ISTATCVT+512                                             08226000
ATCESC01 EQU   ISTATCVT+508                                             08227000
ATCDEC01 EQU   ISTATCVT+504                                             08228000
ATCDEC00 EQU   ISTATCVT+500                                             08229000
ATCCPCRT EQU   ISTATCVT+496                                             08230000
ATCMSGM  EQU   ISTATCVT+492                                             08231000
ATCCPCFR EQU   ISTATCVT+488                                             08232000
ATCCPCGR EQU   ISTATCVT+484                                             08233000
ATCCPCPP EQU   ISTATCVT+480                                             08234000
ATCCPCNT EQU   ISTATCVT+472                                             08235000
ATCAUTHA EQU   ISTATCVT+468                                             08236000
ATCACCTA EQU   ISTATCVT+464                                             08237000
ATCAP39  EQU   ISTATCVT+460                                             08238000
ATCAPCR5 EQU   ISTATCVT+444                                             08239000
ATCAICPT EQU   ISTATCVT+440                                             08240000
ATCAPI   EQU   ISTATCVT+436                                             08241000
ATCAICTN EQU   ISTATCVT+432                                             08242000
ATCACC01 EQU   ISTATCVT+428                                             08243000
ATCACC00 EQU   ISTATCVT+424                                             08244000
ATCLDECB EQU   ATCLDTIL+12                                              08245000
ATCLDLCK EQU   ATCLDTIL+8                                               08246000
ATCLDLST EQU   ATCLDTIL+4                                               08247000
ATCLDNCS EQU   ATCLDTIL                                                 08248000
ATCNOSPB EQU   ISTATCVT+376                                             08249000
ATCNSPAB EQU   ISTATCVT+344                                             08250000
ATCLUSRT EQU   ISTATCVT+312                                             08251000
ATCPUIOP EQU   ISTATCVT+280                                             08252000
ATCPUPAB EQU   ISTATCVT+248                                             08253000
ATCPXPAB EQU   ISTATCVT+216                                             08254000
@NM00078 EQU   ATCVDPAB+16                                              08255000
ATCFEPAB EQU   ATCVDPAB                                                 08256000
ATCTCIPB EQU   ISTATCVT+120                                             08257000
ATCCSPAB EQU   ATCSMPAB+16                                              08258000
@NM00077 EQU   ATCSMPAB                                                 08259000
ATCTMRPB EQU   ISTATCVT+56                                              08260000
ATCITPAB EQU   ISTATCVT+24                                              08261000
@NM00076 EQU   ATCITRA1                                                 08262000
ATCITSCP EQU   ATCITRA1                                                 08263000
ATCITMSG EQU   ATCITRA1                                                 08264000
ATCITPIU EQU   ATCITRA1                                                 08265000
ATCITSMS EQU   ATCITRA1                                                 08266000
ATCITPSS EQU   ATCITRA1                                                 08267000
ATCITLCK EQU   ATCITRA1                                                 08268000
ATCITAPI EQU   ATCITRA1                                                 08269000
ATCITCNT EQU   ATCITFLG                                                 08270000
ATCITRPH EQU   ATCITCDS                                                 08271000
ATCITTBL EQU   ATCITFLD+4                                               08272000
ATCITPRM EQU   ATCITFLD                                                 08273000
ATCPTCHA EQU   ATCRPTCH+4                                               08274000
ATCVTLVL EQU   ATCRPTCH                                                 08275000
RPHUPSTA EQU   ISTRPH+104                                               08276000
RPHSAV16 EQU   RPHWORK+60                                               08277000
RPHSAV15 EQU   RPHWORK+56                                               08278000
RPHSAV14 EQU   RPHWORK+52                                               08279000
RPHSAV13 EQU   RPHWORK+48                                               08280000
RPHSAV12 EQU   RPHWORK+44                                               08281000
RPHSAV11 EQU   RPHWORK+40                                               08282000
RPHSAV10 EQU   RPHWORK+36                                               08283000
RPHSAVE9 EQU   RPHWORK+32                                               08284000
RPHSAVE8 EQU   RPHWORK+28                                               08285000
RPHSAVE7 EQU   RPHWORK+24                                               08286000
RPHSAVE6 EQU   RPHWORK+20                                               08287000
RPHSAVE5 EQU   RPHWORK+16                                               08288000
RPHSAVE4 EQU   RPHWORK+12                                               08289000
RPHSAVE3 EQU   RPHWORK+8                                                08290000
RPHSAVE2 EQU   RPHWORK+4                                                08291000
RPHSHALF EQU   RPHSAVE1+2                                               08292000
RPHSBIT8 EQU   RPHSBITS                                                 08293000
RPHSBIT7 EQU   RPHSBITS                                                 08294000
RPHSBIT6 EQU   RPHSBITS                                                 08295000
RPHSBIT5 EQU   RPHSBITS                                                 08296000
RPHSBIT4 EQU   RPHSBITS                                                 08297000
RPHSBIT3 EQU   RPHSBITS                                                 08298000
RPHSBIT2 EQU   RPHSBITS                                                 08299000
RPHSBIT1 EQU   RPHSBITS                                                 08300000
RPHSBYTE EQU   RPHSAVE1                                                 08301000
RPHPABQP EQU   RPHPABQA+1                                               08302000
RPHPABFG EQU   RPHPABQA                                                 08303000
RPHSRP34 EQU   RPHSRPRM+2                                               08304000
RPHSRP12 EQU   RPHSRPRM                                                 08305000
RPHWEGT  EQU   RPHCSPA                                                  08306000
RPHMAJCB EQU   ISTRPH+21                                                08307000
RPHPABOF EQU   ISTRPH+20                                                08308000
RPHRESUM EQU   RPHRESMA+1                                               08309000
@NM00075 EQU   RPHWPFLG                                                 08310000
RPHPURGE EQU   RPHWPFLG                                                 08311000
RPHPT    EQU   RPHWPFLG                                                 08312000
RPHWT    EQU   RPHWPFLG                                                 08313000
RPHRSKEY EQU   RPHWPFLG                                                 08314000
RPHDVTA  EQU   ISTRPH+12                                                08315000
RPHTIK   EQU   RPHTSKID+3                                               08316000
@NM00074 EQU   RPHTSKID                                                 08317000
RPHRPHAP EQU   RPHRPHA+1                                                08318000
@NM00073 EQU   RPHRPHA                                                  08319000
RPHGATE  EQU   RPHRPHA                                                  08320000
RPHABEND EQU   RPHFLGB                                                  08321000
RPHUWAIT EQU   RPHFLGB                                                  08322000
RPHRLCRA EQU   RPHFLGB                                                  08323000
@NM00072 EQU   RPHFLGB                                                  08324000
RPHPGCMP EQU   RPHFLGB                                                  08325000
RPHFBAPS EQU   RPHFLGB                                                  08326000
RPHBSSP  EQU   RPHFLGB                                                  08327000
RPHLOCK  EQU   RPHFLGB                                                  08328000
RPHFNFLG EQU   RPHFSTLC                                                 08329000
RPHMLTCP EQU   RPHFLAGS                                                 08330000
RPHSMCLR EQU   RPHFLAGS                                                 08331000
RPHSMTYP EQU   RPHFLAGS                                                 08332000
RPHSMQ   EQU   RPHFLAGS                                                 08333000
RPHAPTYP EQU   RPHFLAGS                                                 08334000
RPHSPGIN EQU   RPHFLAGS                                                 08335000
RPHOGIND EQU   RPHFLAGS                                                 08336000
RPHLNGTH EQU   RPHCNTL+1                                                08337000
RPHTYPE  EQU   RPHCNTL                                                  08338000
DYPOCRPH EQU   DYPPACMD                                                 08339000
DYPTSKID EQU   ISTDYPAB+8                                               08340000
DYPPACTB EQU   DYPCHAIN                                                 08341000
DYPFLGS  EQU   ISTDYPAB+2                                               08342000
DYPLNGTH EQU   ISTDYPAB+1                                               08343000
DYPTYPE  EQU   ISTDYPAB                                                 08344000
PABRPHA  EQU   PABRPHFG+1                                               08345000
PABNODQ  EQU   PABFLAGS                                                 08346000
PABINHBT EQU   PABFLAGS                                                 08347000
PABERLOK EQU   PABERRLK                                                 08348000
PABSSN   EQU   PABFLAGS                                                 08349000
PABDYNAM EQU   PABFLAGS                                                 08350000
PABXTND  EQU   PABFLAGS                                                 08351000
PABPRIOR EQU   PABFLAGS                                                 08352000
PABAPYP  EQU   PABFLAGS                                                 08353000
PABDVTA  EQU   ISTPAB+9                                                 08354000
PABOFFST EQU   ISTPAB+8                                                 08355000
PABCHNGP EQU   PABCHAIN+1                                               08356000
PABRSV02 EQU   PABCHAIN                                                 08357000
PABDELAY EQU   PABCHAIN                                                 08358000
PABQUED  EQU   PABRUNNG                                                 08359000
PABRESET EQU   PABCHAIN                                                 08360000
PABUNCON EQU   PABCHAIN                                                 08361000
PABCDP   EQU   PABCHAIN                                                 08362000
PABRESCH EQU   PABCHAIN                                                 08363000
PABCHNG  EQU   PABCHAIN                                                 08364000
PABWEQP  EQU   PABWEQA+1                                                08365000
PABRSV01 EQU   PABWEQA                                                  08366000
PABWEQG  EQU   PABWEQA                                                  08367000
LOKXCL   EQU   @NM00069                                                 08368000
LOKPRY   EQU   @NM00069                                                 08369000
@NM00070 EQU   @NM00069                                                 08370000
@NM00068 EQU   LOKCHNG                                                  08371000
LOKCT    EQU   ISTLOK                                                   08372000
@NM00067 EQU   ISTPOPWA+138                                             08373000
POPDEB   EQU   POPTPOPT+5                                               08374000
POPHDR   EQU   POPTPOPT+1                                               08375000
POPSTAT  EQU   POPTPOPT                                                 08376000
@NM00066 EQU   ISTPOPWA                                                 08377000
OCWEND   EQU   ISTOCW+872                                               08378000
@NM00065 EQU   OCWFLG1                                                  08379000
OCWEXIT  EQU   OCWFLG1                                                  08380000
OCWSENSE EQU   ISTOCW+867                                               08381000
OCWBNDSZ EQU   ISTOCW+865                                               08382000
OCWBINDD EQU   OCWBIND+37                                               08383000
OCWBINDA EQU   OCWBIND+1                                                08384000
OCWBINDC EQU   OCWBIND                                                  08385000
OCWSHPLC EQU   OCWSHPL+8                                                08386000
OCWSHPLB EQU   OCWSHPL+4                                                08387000
OCWSHPLA EQU   OCWSHPL                                                  08388000
OCWBNDRU EQU   ISTOCW+804                                               08389000
OCWELCP  EQU   ISTOCW+800                                               08390000
OCWPACEN EQU   ISTOCW+799                                               08391000
OCWRH    EQU   ISTOCW+796                                               08392000
OCWFMCT  EQU   ISTOCW+792                                               08393000
OCWODOA  EQU   ISTOCW+788                                               08394000
OCWSCHIO EQU   OCWIOCNT                                                 08395000
OCWPROCD EQU   ISTOCW+780                                               08396000
OCWCCRPH EQU   ISTOCW+776                                               08397000
OCWPABCT EQU   ISTOCW+772                                               08398000
OCWPRIM  EQU   OCWDAF                                                   08399000
OCWSEC   EQU   OCWSAF                                                   08400000
OCWRULEN EQU   ISTOCW+766                                               08401000
OCWRSV0A EQU   ISTOCW+765                                               08402000
OCWRSV82 EQU   OCWLOCKS                                                 08403000
OCWMLOCK EQU   OCWLOCKS                                                 08404000
OCWALOCK EQU   OCWLOCKS                                                 08405000
OCWDLOCK EQU   OCWLOCKS                                                 08406000
OCWCLOCK EQU   OCWLOCKS                                                 08407000
OCWELOCK EQU   OCWLOCKS                                                 08408000
OCWRLOCK EQU   OCWLOCKS                                                 08409000
OCWVLOCK EQU   OCWLOCKS                                                 08410000
OCWACE   EQU   ISTOCW+760                                               08411000
OCWIOMIN EQU   ISTOCW+759                                               08412000
OCWIOMAJ EQU   ISTOCW+758                                               08413000
OCWBHSID EQU   ISTOCW+757                                               08414000
@NM00064 EQU   OCWCRYPF                                                 08415000
OCWSPRSS EQU   OCWCRYPF                                                 08416000
OCWCTRNP EQU   OCWCRYPF                                                 08417000
OCWCSEL  EQU   OCWCRYPF                                                 08418000
OCWCRYPT EQU   OCWCRYPF                                                 08419000
OCWSWTE7 EQU   OCWSWTE                                                  08420000
OCWSWTE6 EQU   OCWSWTE                                                  08421000
OCWSWTE5 EQU   OCWSWTE                                                  08422000
OCWSWTE4 EQU   OCWSWTE                                                  08423000
OCWSWTE3 EQU   OCWSWTE                                                  08424000
OCWLKSRL EQU   OCWSWTE                                                  08425000
OCWLCPBC EQU   OCWSWTE                                                  08426000
OCWSKEL  EQU   OCWSWTE                                                  08427000
OCWSWTR7 EQU   OCWSWTRD                                                 08428000
OCWSWTR6 EQU   OCWSWTRD                                                 08429000
OCWSWTR5 EQU   OCWSWTRD                                                 08430000
OCWDPDVT EQU   OCWSWTRD                                                 08431000
OCWEPTLP EQU   OCWSWTRD                                                 08432000
OCWCPARE EQU   OCWSWTRD                                                 08433000
OCWCLEN  EQU   OCWSWTRD                                                 08434000
OCWSRDVT EQU   OCWSWTRD                                                 08435000
OCWCLCD2 EQU   ISTOCW+752                                               08436000
OCWCLCD1 EQU   ISTOCW+750                                               08437000
OCWLALEN EQU   ISTOCW+748                                               08438000
OCWSDVTA EQU   ISTOCW+744                                               08439000
OCWOENIB EQU   ISTOCW+740                                               08440000
OCWSORTP EQU   ISTOCW+736                                               08441000
OCWMDVT  EQU   ISTOCW+732                                               08442000
OCWSDVT  EQU   ISTOCW+728                                               08443000
OCWRUPE  EQU   ISTOCW+724                                               08444000
OCWTSCB  EQU   OCWLCPBA                                                 08445000
OCWR14SV EQU   ISTOCW+648                                               08446000
OCWSAVE5 EQU   ISTOCW+576                                               08447000
OCWSAVE4 EQU   ISTOCW+504                                               08448000
OCWSAVE3 EQU   ISTOCW+432                                               08449000
OCWSAVE1 EQU   ISTOCW+288                                               08450000
OCWCSPL  EQU   ISTOCW+228                                               08451000
OCWRSVD  EQU   ISTOCW+222                                               08452000
OCWNA    EQU   ISTOCW+220                                               08453000
OCWLUCBA EQU   ISTOCW+216                                               08454000
OCWVPAB  EQU   ISTOCW+212                                               08455000
OCWSWTD7 EQU   OCWSWTD                                                  08456000
OCWSWTD6 EQU   OCWSWTD                                                  08457000
OCWSWTD5 EQU   OCWSWTD                                                  08458000
OCWENSS  EQU   OCWSWTD                                                  08459000
OCWPGDON EQU   OCWSWTD                                                  08460000
OCWSTCTL EQU   OCWSWTD                                                  08461000
OCWNPOST EQU   OCWSWTD                                                  08462000
OCWCLDEB EQU   OCWSWTD                                                  08463000
OCWVARY  EQU   OCWSWTC                                                  08464000
OCWPRMTR EQU   OCWSWTC                                                  08465000
OCWPBH   EQU   OCWSWTC                                                  08466000
OCWRBH   EQU   OCWSWTC                                                  08467000
OCWCKACE EQU   OCWSWTC                                                  08468000
OCWODCLS EQU   OCWSWTC                                                  08469000
OCWSWTC1 EQU   OCWSWTC                                                  08470000
OCWSPCLS EQU   OCWSWTC                                                  08471000
@NM00063 EQU   OCWSWTB                                                  08472000
OCWRECD  EQU   OCWSWTB                                                  08473000
OCWOLOCK EQU   OCWSWTB                                                  08474000
OCWCOREQ EQU   OCWSWTB                                                  08475000
OCWDOPHY EQU   OCWSWTB                                                  08476000
OCWCLOOP EQU   OCWSWTB                                                  08477000
OCWSNA   EQU   OCWSWTB                                                  08478000
OCWSESS  EQU   OCWSWTB                                                  08479000
OCWNODLT EQU   OCWSWTA                                                  08480000
OCWODCL  EQU   OCWSWTA                                                  08481000
OCWGODST EQU   OCWSWTA                                                  08482000
OCWSORT  EQU   OCWSWTA                                                  08483000
OCWGOCNT EQU   OCWSWTA                                                  08484000
OCWNOCON EQU   OCWSWTA                                                  08485000
OCWSRT   EQU   OCWSWTA                                                  08486000
OCWGTLST EQU   OCWSWTA                                                  08487000
OCWSTEPN EQU   OCWDSPLY+8                                               08488000
OCWJOBNM EQU   OCWDSPLY                                                 08489000
OCWCONNO EQU   ISTOCW+114                                               08490000
OCWDSTNO EQU   ISTOCW+112                                               08491000
OCWSVCID EQU   ISTOCW+108                                               08492000
OCWSVSNS EQU   ISTOCW+104                                               08493000
OCWCSID  EQU   ISTOCW+102                                               08494000
OCWSVCEC EQU   OCWSVCCL+1                                               08495000
OCWSVCRC EQU   OCWSVCCL                                                 08496000
OCWSVEC  EQU   OCWSVCOD+1                                               08497000
OCWSVRC  EQU   OCWSVCOD                                                 08498000
OCWEC    EQU   OCWODRC+1                                                08499000
OCWRC    EQU   OCWODRC                                                  08500000
OCWODFST EQU   ISTOCW+92                                                08501000
OCWODNAS EQU   ISTOCW+88                                                08502000
OCWODLST EQU   ISTOCW+84                                                08503000
OCWCPOST EQU   ISTOCW+80                                                08504000
OCWRSCE  EQU   ISTOCW+72                                                08505000
OCWACDEB EQU   ISTOCW+68                                                08506000
OCWNCB   EQU   ISTOCW+64                                                08507000
OCWFMCB  EQU   ISTOCW+60                                                08508000
OCWEPTAB EQU   ISTOCW+56                                                08509000
OCWARDTE EQU   ISTOCW+52                                                08510000
OCWNIB   EQU   ISTOCW+48                                                08511000
OCWDRHOB EQU   OCWDRDTE                                                 08512000
OCWCSL   EQU   ISTOCW+28                                                08513000
OCWPAB   EQU   ISTOCW+20                                                08514000
OCWCHAIN EQU   ISTOCW+8                                                 08515000
OCWPBCHN EQU   ISTOCW+4                                                 08516000
OCWTLEN  EQU   ISTOCW+2                                                 08517000
OCWSLEN  EQU   ISTOCW+1                                                 08518000
OCWID    EQU   ISTOCW                                                   08519000
CSPUECBA EQU   ISTCSP+56                                                08520000
CSPCEA   EQU   ISTCSP+52                                                08521000
CSPCE    EQU   ISTCSP+48                                                08522000
CSPUCBCT EQU   ISTCSP+46                                                08523000
CSPCECT  EQU   ISTCSP+44                                                08524000
CSPRSV   EQU   ISTCSP+42                                                08525000
CSPJS    EQU   CSPMEN2                                                  08526000
@NM00062 EQU   CSPMEN2                                                  08527000
CSPCL    EQU   CSPMEN2                                                  08528000
CSPRL    EQU   CSPMEN2                                                  08529000
@NM00061 EQU   CSPMEN2                                                  08530000
CSPAC    EQU   CSPMEN2                                                  08531000
@NM00060 EQU   CSPMEN2                                                  08532000
@NM00059 EQU   CSPMEN2                                                  08533000
CSPLE    EQU   CSPMEN1                                                  08534000
CSPQU    EQU   CSPMEN1                                                  08535000
@NM00058 EQU   CSPMEN1                                                  08536000
CSPCV    EQU   CSPMEN1                                                  08537000
@NM00057 EQU   CSPMEN1                                                  08538000
CSPLO    EQU   CSPMEN1                                                  08539000
CSPAD    EQU   CSPMEN1                                                  08540000
CSPAE    EQU   CSPMEN1                                                  08541000
@NM00056 EQU   ISTCSP+36                                                08542000
CSPUNMPT EQU   ISTCSP+32                                                08543000
@NM00055 EQU   ISTCSP+26                                                08544000
CSPID    EQU   ISTCSP+24                                                08545000
CSPNO    EQU   ISTCSP+22                                                08546000
CSPCC    EQU   ISTCSP+21                                                08547000
CSPQID   EQU   ISTCSP+20                                                08548000
CSPDATA  EQU   ISTCSP+16                                                08549000
CSPCSL   EQU   CSPRSCE                                                  08550000
CSPTARG  EQU   CSPDEST                                                  08551000
CSPPRIM  EQU   CSPSRC                                                   08552000
CSPRLRQ  EQU   CSPOPT2                                                  08553000
CSPNONTF EQU   CSPOPT2                                                  08554000
CSPWASQD EQU   CSPOPT2                                                  08555000
CSPACQS  EQU   CSPOPT2                                                  08556000
CSPACES  EQU   CSPOPT2                                                  08557000
CSPNOREL EQU   CSPOPT2                                                  08558000
CSPCOREQ EQU   CSPOPT2                                                  08559000
CSPSTAP  EQU   CSPOPT2                                                  08560000
CSPRESP  EQU   CSPOPT1                                                  08561000
CSPLIFOS EQU   CSPOPT1                                                  08562000
CSPLIFOP EQU   CSPOPT1                                                  08563000
CSPSINIT EQU   CSPOPT1                                                  08564000
CSPDEACT EQU   CSPOPT1                                                  08565000
CSPLOGI  EQU   CSPOPT1                                                  08566000
CSPQ     EQU   CSPOPT1                                                  08567000
@NM00054 EQU   CSPOPT1                                                  08568000
CSPIDX   EQU   ISTCSP                                                   08569000
NIBRESV  EQU   ISTNIB+60                                                08570000
NIBNDAR  EQU   ISTNIB+56                                                08571000
NIBLMODE EQU   ISTNIB+48                                                08572000
NIBEXLST EQU   ISTNIB+44                                                08573000
NIBLIMIT EQU   ISTNIB+42                                                08574000
@NM00053 EQU   ISTNIB+41                                                08575000
@NM00052 EQU   NIBFLG1                                                  08576000
NIBTREQ  EQU   NIBFLG1                                                  08577000
NIBTSEL  EQU   NIBFLG1                                                  08578000
NIBNACLQ EQU   NIBFLG1                                                  08579000
NIBSHLTP EQU   NIBFLG1                                                  08580000
NIBSDAPP EQU   NIBFLG1                                                  08581000
NIBCON   EQU   NIBFLG1                                                  08582000
NIBLAST  EQU   NIBFLG1                                                  08583000
NIBPROCD EQU   ISTNIB+36                                                08584000
NIBDEVCH EQU   ISTNIB+28                                                08585000
NIBMODE  EQU   ISTNIB+20                                                08586000
NIBSYM   EQU   ISTNIB+12                                                08587000
NIBUSER  EQU   ISTNIB+8                                                 08588000
NIBCID   EQU   ISTNIB+4                                                 08589000
NIBLEN   EQU   ISTNIB+3                                                 08590000
NIBCONDN EQU   ISTNIB+2                                                 08591000
NIBRSV01 EQU   ISTNIB+1                                                 08592000
NIBID    EQU   ISTNIB                                                   08593000
@NM00051 EQU   ISTCSL+12                                                08594000
CSLDATAF EQU   CSLDATA                                                  08595000
CSLNIBF  EQU   CSLNIB                                                   08596000
CSLRDTPT EQU   CSLRDTE+1                                                08597000
@NM00050 EQU   CSLRDTE                                                  08598000
CSLRDTEF EQU   CSLRDTE                                                  08599000
BINSNMD  EQU   BINSLUNM+1                                               08600000
BINSNML  EQU   BINSLUNM                                                 08601000
BINCRKEY EQU   BINCRYRL+2                                               08602000
BINCCIPH EQU   BINCRPFL                                                 08603000
BINCRSV1 EQU   BINCRPFL                                                 08604000
BINCKEYT EQU   BINCRPFL                                                 08605000
BINCLEN  EQU   BINCRCTL                                                 08606000
BINCSESS EQU   BINCRCTL                                                 08607000
BINCEUMB EQU   BINCRCTL                                                 08608000
BINUSE   EQU   ISTBIND+36                                               08609000
BINUSEL  EQU   ISTBIND+35                                               08610000
BINPRIM  EQU   ISTBIND+27                                               08611000
BINPRIML EQU   ISTBIND+26                                               08612000
BINLUTYP EQU   BINLUP                                                   08613000
@NM00037 EQU   BINLUP                                                   08614000
BINBPACM EQU   BINBPACE                                                 08615000
@NM00036 EQU   BINBPACE                                                 08616000
BINSPACM EQU   BINSPACE                                                 08617000
@NM00035 EQU   BINSPACE                                                 08618000
BINPS1ST EQU   BINSPACE                                                 08619000
BINPRUSE EQU   BINPRUSZ                                                 08620000
BINPRUSM EQU   BINPRUSZ                                                 08621000
BINSRUSE EQU   BINSRUSZ                                                 08622000
BINSRUSM EQU   BINSRUSZ                                                 08623000
BINRPACM EQU   BINRPACE                                                 08624000
@NM00034 EQU   BINRPACE                                                 08625000
BINAPACM EQU   BINAPACE                                                 08626000
@NM00033 EQU   BINAPACE                                                 08627000
BINSP2ST EQU   BINAPACE                                                 08628000
BINCONR  EQU   BINCMNP2                                                 08629000
BINRCHN  EQU   BINCMNP2                                                 08630000
BINMDIBK EQU   BINCMNP2                                                 08631000
BINBKFS  EQU   BINCMNP2                                                 08632000
BINRCVR  EQU   BINCMNP2                                                 08633000
BINFMTRM EQU   BINCMNP2                                                 08634000
@NM00032 EQU   BINCMNP                                                  08635000
BINALT   EQU   BINCMNP                                                  08636000
BINBKTR  EQU   BINCMNP                                                  08637000
BINBRAK  EQU   BINCMNP                                                  08638000
BINFMHD  EQU   BINCMNP                                                  08639000
@NM00031 EQU   BINCMNP                                                  08640000
BINSSEB  EQU   BINSECP                                                  08641000
BINSCMP  EQU   BINSECP                                                  08642000
@NM00030 EQU   BINSECP                                                  08643000
BINSCHNR EQU   BINSECP                                                  08644000
BINSMCH  EQU   BINSECP                                                  08645000
BINSCHN  EQU   BINSECP                                                  08646000
BINPSEB  EQU   BINPRIP                                                  08647000
BINPCMP  EQU   BINPRIP                                                  08648000
@NM00029 EQU   BINPRIP                                                  08649000
BINPCHNR EQU   BINPRIP                                                  08650000
BINPMCH  EQU   BINPRIP                                                  08651000
BINPCHN  EQU   BINPRIP                                                  08652000
BINTS    EQU   ISTBIND+2                                                08653000
BINFM    EQU   ISTBIND+1                                                08654000
BINTYPE  EQU   BINFMTY                                                  08655000
BINFMT   EQU   BINFMTY                                                  08656000
DEVRSV01 EQU   ISTDEVCH+7                                               08657000
DEVAUXTP EQU   ISTDEVCH+6                                               08658000
DEVADVFE EQU   DEVMODE                                                  08659000
@NM00028 EQU   DEVMODE                                                  08660000
DEVBASIC EQU   DEVMODE                                                  08661000
DEVREC   EQU   DEVMODE                                                  08662000
DEVPHYSA EQU   ISTDEVCH+4                                               08663000
DEVCSLPN EQU   DEVCHAR3                                                 08664000
DEVCSTCL EQU   DEVCHAR3                                                 08665000
DEVCCHEK EQU   DEVCHAR3                                                 08666000
DEVCATTN EQU   DEVCHAR3                                                 08667000
DEVCSWL  EQU   DEVFCCTL                                                 08668000
DEVCRVB  EQU   DEVFCCTL                                                 08669000
DEVCSSL  EQU   DEVFCCTL                                                 08670000
DEVCBSC  EQU   DEVFCCTL                                                 08671000
DEVMCODE EQU   ISTDEVCH+2                                               08672000
DEVCHAR2 EQU   DEVTCODE                                                 08673000
DEVSPOLL EQU   DEVCHAR                                                  08674000
DEVCCTL  EQU   DEVCHAR                                                  08675000
DEVNNSPT EQU   DEVCHAR                                                  08676000
DEVSPS   EQU   DEVCHAR                                                  08677000
DEVSUBND EQU   DEVCHAR                                                  08678000
DEVCONVR EQU   DEVCHAR                                                  08679000
DEVOTPUT EQU   DEVCHAR                                                  08680000
DEVINPUT EQU   DEVCHAR                                                  08681000
PROSRDEF EQU   PROSETM4                                                 08682000
PRORSV47 EQU   PROSETM4                                                 08683000
PROSCON  EQU   PROSETM4                                                 08684000
PRORSV46 EQU   PROSETM3                                                 08685000
PROSMONT EQU   PROSETM3                                                 08686000
PRORSV45 EQU   PROSETM3                                                 08687000
PROSNTO  EQU   PROSETM3                                                 08688000
PRORSV44 EQU   PROSETM3                                                 08689000
PRORSV43 EQU   PROSETM2                                                 08690000
PROSNTFL EQU   PROSETM2                                                 08691000
PRORSV42 EQU   PROSETM2                                                 08692000
PRORSV41 EQU   PROPROCS                                                 08693000
PROMODC  EQU   PROPROC4                                                 08694000
PROMODT  EQU   PROPROC4                                                 08695000
PROMODM  EQU   PROPROC4                                                 08696000
PROMODB  EQU   PROPROC4                                                 08697000
PRORSV14 EQU   PROPROC4                                                 08698000
PRORSV13 EQU   PROPROC4                                                 08699000
PRORSV12 EQU   PROPROC4                                                 08700000
PROEIB   EQU   PROPROC4                                                 08701000
PROMONT3 EQU   PROPROC3                                                 08702000
PROMONT2 EQU   PROPROC3                                                 08703000
PROMONIT EQU   PROPROC3                                                 08704000
PROSUBLK EQU   PROPROC3                                                 08705000
PRONTO   EQU   PROPROC3                                                 08706000
PROLGIN  EQU   PROPROC3                                                 08707000
PROERPI  EQU   PROPROC3                                                 08708000
PRORSV07 EQU   PROPROC3                                                 08709000
PROCFTX  EQU   PROPROC2                                                 08710000
PROEMLC  EQU   PROPROC2                                                 08711000
PRONTFL  EQU   PROPROC2                                                 08712000
PROFIFOR EQU   PROPROC2                                                 08713000
PROSYSR  EQU   PROPROC2                                                 08714000
PROLGOT  EQU   PROPROC2                                                 08715000
PROERPO  EQU   PROPROC2                                                 08716000
PRONEGBD EQU   PROPROC2                                                 08717000
PRORPLC  EQU   PROPROC1                                                 08718000
PROCS    EQU   PROPROC1                                                 08719000
PROCA    EQU   PROPROC1                                                 08720000
PRORESPX EQU   PROPROC1                                                 08721000
PRODFASY EQU   PROPROC1                                                 08722000
PROXPOPT EQU   PROPROC1                                                 08723000
PROTRUNC EQU   PROPROC1                                                 08724000
PROASYIP EQU   PROPROC1                                                 08725000
RPLSEQNO EQU   RPLOF60+6                                                08726000
@NM00027 EQU   RPLIBSQ                                                  08727000
RPLIINV  EQU   RPLIBSQ                                                  08728000
RPLINEG  EQU   RPLIBSQ                                                  08729000
RPLIPOS  EQU   RPLIBSQ                                                  08730000
RPLIIGN  EQU   RPLIBSQ                                                  08731000
RPLIRSET EQU   RPLIBSQ                                                  08732000
RPLITST  EQU   RPLIBSQ                                                  08733000
RPLISET  EQU   RPLIBSQ                                                  08734000
@NM00026 EQU   RPLOBSQ                                                  08735000
RPLOINV  EQU   RPLOBSQ                                                  08736000
RPLONEG  EQU   RPLOBSQ                                                  08737000
RPLOPOS  EQU   RPLOBSQ                                                  08738000
RPLOIGN  EQU   RPLOBSQ                                                  08739000
RPLORSET EQU   RPLOBSQ                                                  08740000
RPLOTST  EQU   RPLOBSQ                                                  08741000
RPLOSET  EQU   RPLOBSQ                                                  08742000
RPLIBSQV EQU   RPLOF60+2                                                08743000
RPLOBSQV EQU   RPLOF60                                                  08744000
@NM00025 EQU   RPLO5                                                    08745000
RPLTNFY  EQU   RPLO5                                                    08746000
@NM00024 EQU   RPLO5                                                    08747000
@NM00023 EQU   RPLCNTSC                                                 08748000
RPLRSHUT EQU   RPLCNTSC                                                 08749000
RPLRQR   EQU   RPLCNTSC                                                 08750000
RPLSHUTC EQU   RPLCNTSC                                                 08751000
RPLSHUTD EQU   RPLCNTSC                                                 08752000
RPLSTSN  EQU   RPLCNTSC                                                 08753000
RPLCLEAR EQU   RPLCNTSC                                                 08754000
RPLSDT   EQU   RPLCNTSC                                                 08755000
RPLBIS   EQU   RPLCNTDC                                                 08756000
RPLSBI   EQU   RPLCNTDC                                                 08757000
RPLTUNBD EQU   RPLCNTDC                                                 08758000
RPLTBIND EQU   RPLCNTDC                                                 08759000
RPLSIGNL EQU   RPLCNTDC                                                 08760000
RPLLUS   EQU   RPLCNTDC                                                 08761000
RPLRTR   EQU   RPLCNTDC                                                 08762000
RPLBID   EQU   RPLCNTDC                                                 08763000
@NM00022 EQU   RPLCNTDF                                                 08764000
RPLQI    EQU   RPLCNTDF                                                 08765000
RPLRELQ  EQU   RPLCNTDF                                                 08766000
RPLCHASE EQU   RPLCNTDF                                                 08767000
RPLQEC   EQU   RPLCNTDF                                                 08768000
RPLQC    EQU   RPLCNTDF                                                 08769000
RPLCNCEL EQU   RPLCNTDF                                                 08770000
RPLDATA  EQU   RPLCNTDF                                                 08771000
RPLRRN   EQU   RPLRESP                                                  08772000
RPLNFME  EQU   RPLRESP                                                  08773000
RPLEX    EQU   RPLRESP                                                  08774000
RPLQRI   EQU   RPLRESP                                                  08775000
@NM00021 EQU   RPLPOSTV                                                 08776000
RPLSCHED EQU   RPLPOSTV                                                 08777000
@NM00020 EQU   RPLVTFL1                                                 08778000
RPLTLGAC EQU   RPLVTFL1                                                 08779000
RPLTNDSP EQU   RPLVTFL1                                                 08780000
RPLAUTUS EQU   RPLVTFL1                                                 08781000
RPLVTUSE EQU   RPLVTFL1                                                 08782000
@NM00019 EQU   RPLVTFL1                                                 08783000
@NM00018 EQU   RPLCHN                                                   08784000
RPLONLY  EQU   RPLCHN                                                   08785000
RPLLAST  EQU   RPLCHN                                                   08786000
RPLMIDLE EQU   RPLCHN                                                   08787000
RPLFIRST EQU   RPLCHN                                                   08788000
@NM00017 EQU   RPLRTYPE                                                 08789000
RPLDFASY EQU   RPLRTYPE                                                 08790000
RPLNFSYN EQU   RPLRTYPE                                                 08791000
RPLRRESP EQU   RPLRTYPE                                                 08792000
@NM00016 EQU   RPLSTYPE                                                 08793000
RPLSRESP EQU   RPLSTYPE                                                 08794000
@NM00015 EQU   RPLRH3                                                   08795000
RPLCSI   EQU   RPLRH3                                                   08796000
RPLCHREQ EQU   RPLRH3                                                   08797000
RPLCMD   EQU   RPLRH3                                                   08798000
RPLEB    EQU   RPLRH3                                                   08799000
RPLBB    EQU   RPLRH3                                                   08800000
RPLSIGDA EQU   RPLVTEXT+32                                              08801000
RPLSAV13 EQU   RPLVTEXT+28                                              08802000
RPLUSNSO EQU   RPLOSENS+2                                               08803000
RPLSSMO  EQU   RPLSSNSO+1                                               08804000
@NM00014 EQU   RPLSSEO                                                  08805000
RPLRRO   EQU   RPLSSEO                                                  08806000
RPLFIO   EQU   RPLSSEO                                                  08807000
RPLSTATO EQU   RPLSSEO                                                  08808000
RPLCPMO  EQU   RPLSSEO                                                  08809000
@NM00013 EQU   RPLSSEO                                                  08810000
RPLFMHDR EQU   RPLOPT12                                                 08811000
@NM00012 EQU   RPLOPT12                                                 08812000
@NM00011 EQU   RPLOPT12                                                 08813000
@NM00010 EQU   RPLOPT12                                                 08814000
RPLNIBTK EQU   RPLOPT12                                                 08815000
RPLTRUNC EQU   RPLOPT12                                                 08816000
RPLKEEP  EQU   RPLOPT12                                                 08817000
@NM00009 EQU   RPLOPT12                                                 08818000
RPLRSVE8 EQU   RPLOPT11                                                 08819000
RPLRSVE7 EQU   RPLOPT11                                                 08820000
RPLRSVE6 EQU   RPLOPT11                                                 08821000
RPLRSVE5 EQU   RPLOPT11                                                 08822000
RPLRSVE4 EQU   RPLOPT11                                                 08823000
RPLSTOP  EQU   RPLOPT11                                                 08824000
RPLSTART EQU   RPLOPT11                                                 08825000
RPLQUIES EQU   RPLOPT11                                                 08826000
RPLRSVI6 EQU   RPLOPT10                                                 08827000
RPLRSVI5 EQU   RPLOPT10                                                 08828000
RPLRSVI4 EQU   RPLOPT10                                                 08829000
RPLRSVI3 EQU   RPLOPT10                                                 08830000
RPLTSKY  EQU   RPLOPT10                                                 08831000
RPLSPARM EQU   RPLOPT10                                                 08832000
RPLDSPLY EQU   RPLOPT10                                                 08833000
RPLBSCID EQU   RPLOPT10                                                 08834000
RPLTOPL  EQU   RPLOPT9                                                  08835000
RPLCIDE  EQU   RPLOPT9                                                  08836000
RPLRNNM  EQU   RPLOPT9                                                  08837000
RPLAPPST EQU   RPLOPT9                                                  08838000
RPLCOUNT EQU   RPLOPT9                                                  08839000
RPLTERMS EQU   RPLOPT9                                                  08840000
RPLDEVCH EQU   RPLOPT9                                                  08841000
RPLLOGON EQU   RPLOPT9                                                  08842000
RPLUSFLD EQU   RPLVTEXT+16                                              08843000
RPLESR2  EQU   RPLUSNSI+1                                               08844000
RPLESR1  EQU   RPLUSNSI                                                 08845000
RPLSSMI  EQU   RPLDSB2                                                  08846000
@NM00008 EQU   RPLSSEI                                                  08847000
RPLRRI   EQU   RPLSSEI                                                  08848000
RPLFII   EQU   RPLSSEI                                                  08849000
RPLSTATI EQU   RPLSSEI                                                  08850000
RPLCPMI  EQU   RPLSSEI                                                  08851000
RPLPATHI EQU   RPLSSEI                                                  08852000
RPLARCLN EQU   RPLVTEXT+8                                               08853000
RPLAARLN EQU   RPLVTEXT+4                                               08854000
RPLAAREA EQU   RPLVTEXT                                                 08855000
RPLERMSA EQU   RPLCOMN+72                                               08856000
RPLEMLEN EQU   RPLCOMN+70                                               08857000
RPLACTIV EQU   RPLCOMN+69                                               08858000
RPLBRANC EQU   RPLEXTD1                                                 08859000
RPLNIB   EQU   RPLEXTD1                                                 08860000
RPLTCRYP EQU   RPLEXTD1                                                 08861000
@NM00007 EQU   RPLEXTD1                                                 08862000
RPLEXIT  EQU   RPLEXTD1                                                 08863000
RPLNEXIT EQU   RPLEXTD1                                                 08864000
RPLEXSCH EQU   RPLEXTD1                                                 08865000
RPLDDDD  EQU   RPLRBAR+4                                                08866000
@NM00006 EQU   RPLRBAR+3                                                08867000
@NM00005 EQU   RPLAIXID                                                 08868000
RPLAXPKP EQU   RPLAIXID                                                 08869000
RPLAIXPC EQU   RPLRBAR                                                  08870000
RPLRSV88 EQU   RPLOPT8                                                  08871000
RPLUNCON EQU   RPLOPT8                                                  08872000
RPLACTV  EQU   RPLOPT8                                                  08873000
RPLSESS  EQU   RPLOPT8                                                  08874000
RPLPEND  EQU   RPLOPT8                                                  08875000
RPLODPRM EQU   RPLOPT8                                                  08876000
RPLODACP EQU   RPLOPT8                                                  08877000
RPLODACQ EQU   RPLOPT8                                                  08878000
RPLRSV78 EQU   RPLOPT7                                                  08879000
RPLTCRNO EQU   RPLOPT7                                                  08880000
RPLRLSOP EQU   RPLOPT7                                                  08881000
RPLTPOST EQU   RPLOPT7                                                  08882000
RPLQOPT  EQU   RPLOPT7                                                  08883000
RPLCNIMM EQU   RPLCNOPT                                                 08884000
RPLCNANY EQU   RPLCNOPT                                                 08885000
RPLCNALL EQU   RPLCNOPT                                                 08886000
RPLRSV68 EQU   RPLOPT6                                                  08887000
RPLRSV67 EQU   RPLOPT6                                                  08888000
RPLLOCK  EQU   RPLOPT6                                                  08889000
RPLNCOND EQU   RPLOPT6                                                  08890000
RPLCOND  EQU   RPLOPT6                                                  08891000
RPLEOT   EQU   RPLUNTYP                                                 08892000
RPLEOM   EQU   RPLUNTYP                                                 08893000
RPLEOB   EQU   RPLUNTYP                                                 08894000
RPLWROPT EQU   RPLOPT5                                                  08895000
RPLNODE  EQU   RPLOPT5                                                  08896000
RPLERACE EQU   RPLWRTYP                                                 08897000
RPLEAU   EQU   RPLWRTYP                                                 08898000
RPLNERAS EQU   RPLWRTYP                                                 08899000
RPLPSOPT EQU   RPLOPT5                                                  08900000
@NM00004 EQU   RPLOPT5                                                  08901000
RPLDLGIN EQU   RPLOPT5                                                  08902000
RPLBUFL  EQU   RPLCOMN+52                                               08903000
RPLCHAIN EQU   RPLNXTRP                                                 08904000
@NM00003 EQU   RPLOPT4                                                  08905000
RPLMKFRM EQU   RPLOPT4                                                  08906000
RPLENDTR EQU   RPLOPT4                                                  08907000
RPLALIGN EQU   RPLOPT3                                                  08908000
RPLFMT   EQU   RPLOPT3                                                  08909000
RPLFLD   EQU   RPLOPT3                                                  08910000
RPLVFY   EQU   RPLOPT3                                                  08911000
RPLBLK   EQU   RPLOPT3                                                  08912000
RPLSFORM EQU   RPLOPT3                                                  08913000
RPLEODS  EQU   RPLOPT3                                                  08914000
RPLNSP   EQU   RPLOPT2                                                  08915000
RPLUPD   EQU   RPLOPT2                                                  08916000
RPLWAITX EQU   RPLOPT2                                                  08917000
RPLLRD   EQU   RPLOPT2                                                  08918000
RPLBWD   EQU   RPLOPT2                                                  08919000
RPLCNV   EQU   RPLOPT2                                                  08920000
RPLADD   EQU   RPLADR                                                   08921000
RPLKEY   EQU   RPLOPT2                                                  08922000
RPLECBIN EQU   RPLECBSW                                                 08923000
RPLGEN   EQU   RPLOPT1                                                  08924000
RPLKGE   EQU   RPLOPT1                                                  08925000
RPLASY   EQU   RPLOPT1                                                  08926000
RPLSKP   EQU   RPLOPT1                                                  08927000
RPLSEQ   EQU   RPLOPT1                                                  08928000
RPLDIR   EQU   RPLOPT1                                                  08929000
RPLLOC   EQU   RPLOPT1                                                  08930000
RPLDAF   EQU   RPLARG+2                                                 08931000
RPLSAF   EQU   RPLARG                                                   08932000
RPLAREA  EQU   RPLCOMN+32                                               08933000
RPLTCBPT EQU   RPLCOMN+28                                               08934000
RPLDACB  EQU   RPLCOMN+24                                               08935000
RPLCCHAR EQU   RPLCOMN+20                                               08936000
RPLSTRID EQU   RPLCOMN+18                                               08937000
RPLKEYL  EQU   RPLKEYLE                                                 08938000
RPLRDSOH EQU   RPLFDB3                                                  08939000
RPLRLG   EQU   RPLFDB3                                                  08940000
RPLLGFRC EQU   RPLFDB3                                                  08941000
RPLREOT  EQU   RPLFDB3                                                  08942000
RPLREOM  EQU   RPLFDB3                                                  08943000
RPLREOB  EQU   RPLFDB3                                                  08944000
RPLSV32  EQU   RPLFDB3                                                  08945000
RPLUINPT EQU   RPLFDB3                                                  08946000
RPLSTSAV EQU   RPLFDB2                                                  08947000
RPLCUERR EQU   RPLFDB2                                                  08948000
RPLDLGFL EQU   RPLFDB2                                                  08949000
RPLIOERR EQU   RPLFDB2                                                  08950000
RPLDVUNS EQU   RPLFDB2                                                  08951000
RPLATND  EQU   RPLFDB2                                                  08952000
RPLRVID  EQU   RPLFDB2                                                  08953000
RPLERLK  EQU   RPLFDB2                                                  08954000
RPLERREG EQU   RPLRTNCD                                                 08955000
RPLSTAT  EQU   RPLFDBWD                                                 08956000
RPLPOST  EQU   RPLECB                                                   08957000
RPLWAIT  EQU   RPLECB                                                   08958000
RPLPLHPT EQU   RPLCOMN+4                                                08959000
RPLLEN2  EQU   RPLLEN                                                   08960000
RPLREQ   EQU   RPLIDWD+2                                                08961000
RPLSTYP  EQU   RPLIDWD+1                                                08962000
RPLID    EQU   RPLIDWD                                                  08963000
CVTLEVL  EQU   CVTRELNO+2                                               08964000
CVTNUMB  EQU   CVTRELNO                                                 08965000
CVTMDL   EQU   CVTFIX+250                                               08966000
@NM00002 EQU   CVTFIX+248                                               08967000
@NM00001 EQU   CVTFIX                                                   08968000
CVTRV482 EQU   CVTXTNT2+128                                             08969000
CVTRV481 EQU   CVTXTNT2+124                                             08970000
CVTRV480 EQU   CVTXTNT2+120                                             08971000
CVTRV479 EQU   CVTXTNT2+118                                             08972000
CVTRV478 EQU   CVTXTNT2+117                                             08973000
CVTRV477 EQU   CVTXTNT2+116                                             08974000
CVTRV476 EQU   CVTXTNT2+115                                             08975000
CVTRV475 EQU   CVTXTNT2+114                                             08976000
CVTRV474 EQU   CVTRV466                                                 08977000
CVTRV473 EQU   CVTRV466                                                 08978000
CVTRV472 EQU   CVTRV466                                                 08979000
CVTRV471 EQU   CVTRV466                                                 08980000
CVTRV470 EQU   CVTRV466                                                 08981000
CVTRV469 EQU   CVTRV466                                                 08982000
CVTRV468 EQU   CVTRV466                                                 08983000
CVTRV467 EQU   CVTRV466                                                 08984000
CVTRV465 EQU   CVTRV457                                                 08985000
CVTRV464 EQU   CVTRV457                                                 08986000
CVTRV463 EQU   CVTRV457                                                 08987000
CVTRV462 EQU   CVTRV457                                                 08988000
CVTRV461 EQU   CVTRV457                                                 08989000
CVTRV460 EQU   CVTRV457                                                 08990000
CVTRV459 EQU   CVTRV457                                                 08991000
CVTRV458 EQU   CVTRV457                                                 08992000
CVTRV456 EQU   CVTXTNT2+108                                             08993000
CVTRV455 EQU   CVTXTNT2+104                                             08994000
CVTRV454 EQU   CVTXTNT2+100                                             08995000
CVTRV453 EQU   CVTXTNT2+96                                              08996000
CVTRV452 EQU   CVTXTNT2+94                                              08997000
CVTRV451 EQU   CVTXTNT2+92                                              08998000
CVTRV450 EQU   CVTXTNT2+90                                              08999000
CVTRV449 EQU   CVTXTNT2+88                                              09000000
CVTRV448 EQU   CVTXTNT2+87                                              09001000
CVTRV447 EQU   CVTXTNT2+86                                              09002000
CVTRV446 EQU   CVTRV438                                                 09003000
CVTRV445 EQU   CVTRV438                                                 09004000
CVTRV444 EQU   CVTRV438                                                 09005000
CVTRV443 EQU   CVTRV438                                                 09006000
CVTRV442 EQU   CVTRV438                                                 09007000
CVTRV441 EQU   CVTRV438                                                 09008000
CVTRV440 EQU   CVTRV438                                                 09009000
CVTRV439 EQU   CVTRV438                                                 09010000
CVTRV437 EQU   CVTRV429                                                 09011000
CVTRV436 EQU   CVTRV429                                                 09012000
CVTRV435 EQU   CVTRV429                                                 09013000
CVTRV434 EQU   CVTRV429                                                 09014000
CVTRV433 EQU   CVTRV429                                                 09015000
CVTRV432 EQU   CVTRV429                                                 09016000
CVTRV431 EQU   CVTRV429                                                 09017000
CVTRV430 EQU   CVTRV429                                                 09018000
CVTRV428 EQU   CVTXTNT2+80                                              09019000
CVTRV427 EQU   CVTXTNT2+76                                              09020000
CVTRV426 EQU   CVTXTNT2+72                                              09021000
CVTRV425 EQU   CVTXTNT2+68                                              09022000
CVTATACT EQU   CVTATCVT                                                 09023000
CVTRV423 EQU   CVTXTNT2+62                                              09024000
CVTRV422 EQU   CVTXTNT2+60                                              09025000
CVTRV421 EQU   CVTXTNT2+58                                              09026000
CVTRV420 EQU   CVTXTNT2+56                                              09027000
CVTRV419 EQU   CVTXTNT2+55                                              09028000
CVTRV418 EQU   CVTXTNT2+54                                              09029000
CVTRV417 EQU   CVTRV409                                                 09030000
CVTRV416 EQU   CVTRV409                                                 09031000
CVTRV415 EQU   CVTRV409                                                 09032000
CVTRV414 EQU   CVTRV409                                                 09033000
CVTRV413 EQU   CVTRV409                                                 09034000
CVTRV412 EQU   CVTRV409                                                 09035000
CVTRV411 EQU   CVTRV409                                                 09036000
CVTRV410 EQU   CVTRV409                                                 09037000
CVTRV408 EQU   CVTRV400                                                 09038000
CVTRV407 EQU   CVTRV400                                                 09039000
CVTRV406 EQU   CVTRV400                                                 09040000
CVTRV405 EQU   CVTRV400                                                 09041000
CVTRV404 EQU   CVTRV400                                                 09042000
CVTRV403 EQU   CVTRV400                                                 09043000
CVTRV402 EQU   CVTRV400                                                 09044000
CVTRV401 EQU   CVTRV400                                                 09045000
CVTICB   EQU   CVTXTNT2+48                                              09046000
CVTSKTA  EQU   CVTXTNT2+44                                              09047000
CVTCCVT  EQU   CVTXTNT2+40                                              09048000
CVTRSV98 EQU   CVTXTNT2+36                                              09049000
CVTRSV97 EQU   CVTXTNT2+34                                              09050000
CVTRSV96 EQU   CVTXTNT2+32                                              09051000
CVTOLTEP EQU   CVTXTNT2+28                                              09052000
CVTQIDA  EQU   CVTQID+1                                                 09053000
CVTRSV95 EQU   CVTQID                                                   09054000
CVTRSV94 EQU   CVTXTNT2+20                                              09055000
CVTRSV93 EQU   CVTXTNT2+16                                              09056000
CVTRSV92 EQU   CVTXTNT2+12                                              09057000
CVTDEBVR EQU   CVTXTNT2+8                                               09058000
CVTRSV91 EQU   CVTXTNT2+6                                               09059000
CVTRSV9H EQU   CVTFLGBT                                                 09060000
CVTRSV9G EQU   CVTFLGBT                                                 09061000
CVTRSV9F EQU   CVTFLGBT                                                 09062000
CVTRSV9E EQU   CVTFLGBT                                                 09063000
CVTRSV9D EQU   CVTFLGBT                                                 09064000
CVTBAH   EQU   CVTFLGBT                                                 09065000
CVTVME   EQU   CVTFLGBT                                                 09066000
CVTNPE   EQU   CVTFLGBT                                                 09067000
CVTNUCLS EQU   CVTXTNT2+4                                               09068000
CVTDSSVA EQU   CVTDSSV+1                                                09069000
CVTRSV89 EQU   CVTDSSV                                                  09070000
CVTRSV88 EQU   CVTXTNT1+8                                               09071000
CVTRSV87 EQU   CVTXTNT1+4                                               09072000
CVTFACHN EQU   CVTXTNT1                                                 09073000
CVTRV488 EQU   CVTMAP+412                                               09074000
CVTRV487 EQU   CVTMAP+408                                               09075000
CVTRV486 EQU   CVTMAP+404                                               09076000
CVTRV485 EQU   CVTMAP+400                                               09077000
CVTACTAP EQU   CVTMAP+396                                               09078000
CVTAUTH  EQU   CVTMAP+392                                               09079000
CVTRV490 EQU   CVTMAP+388                                               09080000
CVTSU    EQU   CVTMAP+384                                               09081000
CVTVOLT1 EQU   CVTVOLM1+1                                               09082000
CVTVOLI1 EQU   CVTVOLF1                                                 09083000
CVTSTOA  EQU   CVTMAP+376                                               09084000
CVTRSV58 EQU   CVTMAP+374                                               09085000
CVTRSV57 EQU   CVTMAP+372                                               09086000
CVTDDCE  EQU   CVTMAP+368                                               09087000
CVTPNWFR EQU   CVTMAP+364                                               09088000
CVTSMF   EQU   CVTMAP+360                                               09089000
CVTSULK  EQU   CVTMAP+358                                               09090000
CVTSLKO  EQU   CVTSYSK                                                  09091000
CVTSLKP  EQU   CVTSYSK                                                  09092000
CVTSLKQ  EQU   CVTSYSK                                                  09093000
CVTSLKR  EQU   CVTSYSK                                                  09094000
CVTRSV56 EQU   CVTSYSK                                                  09095000
CVTRSV55 EQU   CVTSYSK                                                  09096000
CVTRSV54 EQU   CVTSYSK                                                  09097000
CVTRSV53 EQU   CVTSYSK                                                  09098000
CVTRSV52 EQU   CVTA1F1                                                  09099000
CVTRSV51 EQU   CVTA1F1                                                  09100000
CVTRSV50 EQU   CVTA1F1                                                  09101000
CVTRSV49 EQU   CVTA1F1                                                  09102000
CVTRSV48 EQU   CVTA1F1                                                  09103000
CVTRSV47 EQU   CVTA1F1                                                  09104000
CVTSRSW  EQU   CVTA1F1                                                  09105000
CVTPFSW  EQU   CVTA1F1                                                  09106000
CVTPCVT  EQU   CVTMAP+352                                               09107000
CVTRSV46 EQU   CVTMAP+344                                               09108000
CVTRSV45 EQU   CVTMAP+340                                               09109000
CVTRSV44 EQU   CVTMAP+338                                               09110000
CVTRSV43 EQU   CVTMAP+336                                               09111000
CVTHJESA EQU   CVTHJES+1                                                09112000
CVTRSV42 EQU   CVTHJES                                                  09113000
CVTEXT2A EQU   CVTEXT2+1                                                09114000
CVTRSV41 EQU   CVTEXT2                                                  09115000
CVTAPFA  EQU   CVTAPF+1                                                 09116000
CVTRSV40 EQU   CVTAPF                                                   09117000
CVTRV518 EQU   CVTINTLA                                                 09118000
CVTRV517 EQU   CVTERPV                                                  09119000
CVTEORM  EQU   CVTMAP+312                                               09120000
CVTMCHPR EQU   CVTMAP+308                                               09121000
CVTTZ    EQU   CVTMAP+304                                               09122000
CVTJEPS  EQU   CVTMAP+300                                               09123000
CVTJESCT EQU   CVTMAP+296                                               09124000
CVTMODE  EQU   CVTMAP+292                                               09125000
CVTPTRV  EQU   CVTMAP+288                                               09126000
CVTREAL  EQU   CVTMAP+284                                               09127000
CVTRSV39 EQU   CVTMAP+280                                               09128000
CVTRSV38 EQU   CVTMAP+276                                               09129000
CVTDMSRA EQU   CVTDMSR+1                                                09130000
CVTRV634 EQU   CVTDMSRF                                                 09131000
CVTRV633 EQU   CVTDMSRF                                                 09132000
CVTRV632 EQU   CVTDMSRF                                                 09133000
CVTRV631 EQU   CVTDMSRF                                                 09134000
CVTRV630 EQU   CVTDMSRF                                                 09135000
CVTRV629 EQU   CVTDMSRF                                                 09136000
CVTUDUMP EQU   CVTDMSRF                                                 09137000
CVTSDUMP EQU   CVTDMSRF                                                 09138000
CVTQMSGA EQU   CVTQMSG+1                                                09139000
CVTRSV36 EQU   CVTQMSG                                                  09140000
CVTAMFF  EQU   CVTMAP+264                                               09141000
CVTPURGA EQU   CVTPURG+1                                                09142000
CVTRSV35 EQU   CVTPURG                                                  09143000
CVTCBSP  EQU   CVTMAP+256                                               09144000
CVTATERA EQU   CVTATER+1                                                09145000
CVTSYST  EQU   CVTATER                                                  09146000
CVTVOLT2 EQU   CVTTAT                                                   09147000
CVTVOLI2 EQU   CVTVOLF2                                                 09148000
CVTAQAVB EQU   CVTAQAVT+1                                               09149000
CVTRSV34 EQU   CVTTCMFG                                                 09150000
CVTRSV33 EQU   CVTTCMFG                                                 09151000
CVTRSV32 EQU   CVTTCMFG                                                 09152000
CVTRSV31 EQU   CVTTCMFG                                                 09153000
CVTRSV30 EQU   CVTTCMFG                                                 09154000
CVTRSV29 EQU   CVTTCMFG                                                 09155000
CVTLDEV  EQU   CVTTCMFG                                                 09156000
CVTTCRDY EQU   CVTTCMFG                                                 09157000
CVTGTFA  EQU   CVTGTF+1                                                 09158000
CVTRSV27 EQU   CVTGTFST                                                 09159000
CVTRNIO  EQU   CVTGTFST                                                 09160000
CVTUSR   EQU   CVTGTFST                                                 09161000
CVTRV318 EQU   CVTFORM                                                  09162000
CVTRV317 EQU   CVTTMODE                                                 09163000
CVTRV316 EQU   CVTSTATE                                                 09164000
CVTRV315 EQU   CVTGTFS                                                  09165000
CVTGTFAV EQU   CVTGTFS                                                  09166000
CVT0SCR1 EQU   CVTMAP+232                                               09167000
CVTRV515 EQU   CVTMAP+228                                               09168000
CVTRMS   EQU   CVTMAP+224                                               09169000
CVTPATCH EQU   CVTMAP+220                                               09170000
CVTTSCE  EQU   CVTMAP+216                                               09171000
CVTLNKSC EQU   CVTMAP+214                                               09172000
CVTQABST EQU   CVTMAP+212                                               09173000
CVTMDLDS EQU   CVTMAP+208                                               09174000
CVTUSER  EQU   CVTMAP+204                                               09175000
CVTABEND EQU   CVTMAP+200                                               09176000
CVTSMCA  EQU   CVTMAP+196                                               09177000
CVTRSV18 EQU   CVTMAP+192                                               09178000
CVTQLPAQ EQU   CVTMAP+188                                               09179000
CVTQCDSR EQU   CVTMAP+184                                               09180000
CVTVS1B  EQU   CVTOPTB                                                  09181000
CVTVS1A  EQU   CVTOPTB                                                  09182000
CVTFP    EQU   CVTOPTB                                                  09183000
CVTAPTHR EQU   CVTOPTB                                                  09184000
CVTNLOG  EQU   CVTOPTB                                                  09185000
CVTTOD   EQU   CVTOPTB                                                  09186000
CVTCTIMS EQU   CVTOPTB                                                  09187000
CVTPROT  EQU   CVTOPTB                                                  09188000
CVTXPFP  EQU   CVTOPTA                                                  09189000
CVTASCII EQU   CVTOPTA                                                  09190000
CVTRSV13 EQU   CVTOPTA                                                  09191000
CVTRSV12 EQU   CVTOPTA                                                  09192000
CVTNIP   EQU   CVTOPTA                                                  09193000
CVTDDR   EQU   CVTOPTA                                                  09194000
CVTAPR   EQU   CVTOPTA                                                  09195000
CVTCCH   EQU   CVTOPTA                                                  09196000
CVTSNCTR EQU   CVTMAP+180                                               09197000
CVTQMWR  EQU   CVTMAP+176                                               09198000
CVTQOCR  EQU   CVTMAP+172                                               09199000
CVT1EF00 EQU   CVTMAP+168                                               09200000
CVTMZ00  EQU   CVTMAP+164                                               09201000
CVTHEAD  EQU   CVTMAP+160                                               09202000
CVTRSV11 EQU   CVTMAP+156                                               09203000
CVT0PT01 EQU   CVTMAP+152                                               09204000
CVTMSER  EQU   CVTMAP+148                                               09205000
CVTRV516 EQU   CVTIERLC                                                 09206000
CVTILCH  EQU   CVTMAP+140                                               09207000
CVT0DS   EQU   CVTMAP+136                                               09208000
CVTFBOSV EQU   CVTMAP+132                                               09209000
CVTNUCB  EQU   CVTMAP+128                                               09210000
CVTIXAVL EQU   CVTMAP+124                                               09211000
CVTIOQET EQU   CVTMAP+120                                               09212000
CVTDCBA  EQU   CVTMAP+117                                               09213000
CVTMVS2  EQU   CVTDCB                                                   09214000
CVT6DAT  EQU   CVTDCB                                                   09215000
CVT4MPS  EQU   CVTDCB                                                   09216000
CVTRSV09 EQU   CVTDCB                                                   09217000
CVT4MS1  EQU   CVTDCB                                                   09218000
CVT2SPS  EQU   CVTDCB                                                   09219000
CVT1SSS  EQU   CVTDCB                                                   09220000
CVTRSV08 EQU   CVTDCB                                                   09221000
CVTSTB   EQU   CVTMAP+112                                               09222000
CVTQTD00 EQU   CVTMAP+108                                               09223000
CVTQTE00 EQU   CVTMAP+104                                               09224000
CVTCUCB  EQU   CVTMAP+100                                               09225000
CVTSJQ   EQU   CVTMAP+96                                                09226000
CVTPBLDL EQU   CVTMAP+92                                                09227000
CVTTPC   EQU   CVTMAP+88                                                09228000
CVTSVDCB EQU   CVTMAP+84                                                09229000
CVTBRET  EQU   CVTMAP+82                                                09230000
CVTEXIT  EQU   CVTMAP+80                                                09231000
CVT0FN00 EQU   CVTMAP+76                                                09232000
CVTDARA  EQU   CVTDAR+1                                                 09233000
CVTRSV07 EQU   CVTFLGS1                                                 09234000
CVTRSV06 EQU   CVTFLGS1                                                 09235000
CVTRSV05 EQU   CVTFLGS1                                                 09236000
CVTRSV04 EQU   CVTFLGS1                                                 09237000
CVTRSV03 EQU   CVTFLGS1                                                 09238000
CVTRSV02 EQU   CVTFLGS1                                                 09239000
CVTRSV01 EQU   CVTFLGS1                                                 09240000
CVTDMPLK EQU   CVTFLGS1                                                 09241000
CVTXITP  EQU   CVTMAP+68                                                09242000
CVTZDTAB EQU   CVTMAP+64                                                09243000
CVTMSLT  EQU   CVTMAP+60                                                09244000
CVTDATE  EQU   CVTMAP+56                                                09245000
CVTBTERM EQU   CVTMAP+52                                                09246000
CVTSYSAD EQU   CVTMAP+48                                                09247000
CVTXTLER EQU   CVTMAP+44                                                09248000
CVTILK2  EQU   CVTMAP+40                                                09249000
CVTILK1  EQU   CVTMAP+36                                                09250000
CVTPRLTV EQU   CVTMAP+32                                                09251000
CVTPCNVT EQU   CVTMAP+28                                                09252000
CVT0VL00 EQU   CVTMAP+24                                                09253000
CVTXAPG  EQU   CVTMAP+20                                                09254000
CVTBUF   EQU   CVTMAP+16                                                09255000
CVTJOB   EQU   CVTMAP+12                                                09256000
CVTLINK  EQU   CVTMAP+8                                                 09257000
CVT0EF00 EQU   CVTMAP+4                                                 09258000
CVTTCBP  EQU   CVTMAP                                                   09259000
CVT      EQU   CVTMAP                                                   09260000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      09261000
@RC00484 EQU   @RC00480                                                 09262000
@PB00003 EQU   @PB00004                                                 09263000
@PB00002 EQU   @PB00003                                                 09264000
@RC00600 EQU   @PB00002                                                 09265000
@RC00428 EQU   @PB00002                                                 09266000
@RC00469 EQU   @RC00428                                                 09267000
@RC00602 EQU   @RC00600                                                 09268000
@ENDDATA EQU   *                                                        09269000
         END   ISTCFCRP,(C'PLS2142',0702,79038)                         09270000
