         TITLE 'RESOURCE MANAGER-ISTCC014'                              00001000
*         IBM DISK OPERATING SYSTEM                                     00002000
*         TOLTEP-5745-SC-TLT                                            00003000
          ISEQ 73,80                                                    00004000
ISTCC014 CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'ISTCC014  79.078'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00012000
         BALR  @12,0                                               0002 00013000
@PSTART  DS    0H                                                  0002 00014000
         USING @PSTART,@12                                         0002 00015000
         ST    @13,@SA00001+4                                      0002 00016000
         LA    @14,@SA00001                                        0002 00017000
         ST    @14,8(,@13)                                         0002 00018000
         LR    @13,@14                                             0002 00019000
         PRINT OFF                                                      00020000
         PRINT ON                                                       00021000
         PRINT OFF                                                      00022000
         PRINT ON                                                       00023000
*                                                                  0105 00024000
*/********************************************************************  00025000
*                                                                    */ 00026000
*/*      SAVE  CALLERS REG 13 IN T.W.A                               */ 00027000
*/********************************************************************/ 00028000
*                                                                  0106 00029000
*   BASEREG=R12;                    /* SVEBASE REG FOR C14C0020      */ 00030000
         ST    R12,BASEREG                                         0106 00031000
*   SAVEDR13=R13;                   /* SAVE FOR LATER        @DA04678*/ 00032000
         ST    R13,SAVEDR13                                        0107 00033000
*   GEN;                                                           0108 00034000
         L     R4,L4(R13)               /* PICK UP CALLERS SAVE REG  */ 00035000
L4        EQU   4                                                       00036000
L12      EQU   12                                                       00037000
L16       EQU   16                                                      00038000
L20       EQU   20                                                      00039000
*   IF $TEP2ND='1'B                 /* IS THIS THIRD PASS THOUGH     */ 00040000
*     THEN                                                         0109 00041000
         TM    $TEP2ND(WAPTR),B'00000001'                          0109 00042000
         BNO   @RF00109                                            0109 00043000
*     DO;                                                          0110 00044000
*       $TEP3RD='1'B;               /* SET 3RD IND                   */ 00045000
         OI    $TEP3RD(WAPTR),B'10000000'                          0111 00046000
*       $R13PR3=R4;                 /* SAVE RETURN REG               */ 00047000
         ST    R4,$R13PR3(,WAPTR)                                  0112 00048000
*     END;                                                         0113 00049000
*   ELSE                            /* IF NOT 3RD CHK FOR 2ND/1ST    */ 00050000
*     IF $TEP1ST='1'B               /* IS THIS A CALL FROM           */ 00051000
*       THEN                        /* TOLTEP AS A RESULT OF AN      */ 00052000
         B     @RC00109                                            0114 00053000
@RF00109 TM    $TEP1ST(WAPTR),B'00000010'                          0114 00054000
         BNO   @RF00114                                            0114 00055000
*       DO;                         /* OLT MACRO CALL                */ 00056000
*         $R13PTRT=R4;              /* IF YES SAVE R13 IN DIFFT      */ 00057000
         ST    R4,$R13PTRT(,WAPTR)                                 0116 00058000
*         $TEP2ND='1'B;             /* AREA & SET RECALL BIT ON      */ 00059000
         OI    $TEP2ND(WAPTR),B'00000001'                          0117 00060000
*       END;                                                       0118 00061000
*     ELSE                          /* IF NOT THE SECOND PASS        */ 00062000
*       DO;                         /* THRU SAVE R13 IN NORMAL       */ 00063000
         B     @RC00114                                            0119 00064000
@RF00114 DS    0H                                                  0120 00065000
*         $R13PTR=R4;               /* SPOT                          */ 00066000
         ST    R4,$R13PTR(,WAPTR)                                  0120 00067000
*         $TEP1ST='1'B;             /* SET ON FIRST CALL BIT         */ 00068000
         OI    $TEP1ST(WAPTR),B'00000010'                          0121 00069000
*         IF $TCECM='0'B&           /* TEST FOR 1ST OLT OR           */ 00070000
*             FLAGS='00'X           /* TCEC CALL                     */ 00071000
*           THEN                    /* IF OLT CALL SET BIT ON        */ 00072000
         TM    $TCECM(WAPTR),B'00000001'                           0122 00073000
         BNZ   @RF00122                                            0122 00074000
         CLI   FLAGS(R1),X'00'                                     0122 00075000
         BNE   @RF00122                                            0122 00076000
*           $OLTMACC='1'B;                                         0123 00077000
         OI    $OLTMACC(WAPTR),B'00100000'                         0123 00078000
*         ELSE                      /* IF NO SET BIT OFF             */ 00079000
*           $OLTMACC='0'B;                                         0124 00080000
         B     @RC00122                                            0124 00081000
@RF00122 NI    $OLTMACC(WAPTR),B'11011111'                         0124 00082000
*       END;                                                       0125 00083000
@RC00122 DS    0H                                                  0126 00084000
*   R3=$RCA;                        /* GET PTR TO RES.COMM.AREA      */ 00085000
@RC00114 DS    0H                                                  0126 00086000
@RC00109 L     R3,$RCA(,WAPTR)                                     0126 00087000
*   $INBND='1'B;                    /* SET INBOUND SWITCH            */ 00088000
         OI    $INBND(WAPTR),B'00100000'                           0127 00089000
*   R2=SAVEDR2;                     /* RESET*R2*TO*LAST*USED******   */ 00090000
         L     R2,SAVEDR2                                          0128 00091000
*   IF R2^=0                        /* IF*ZERO*START*OVER*AGAIN***   */ 00092000
*     THEN                          /* IF*NOT*ZERO*START*WHERE****   */ 00093000
         LTR   R2,R2                                               0129 00094000
         BNZ   @RT00129                                            0129 00095000
*     GOTO C14C0002;                /* LAST*LEFT*OFF**************   */ 00096000
*C14C0001:                                                         0131 00097000
*   ;                                                              0131 00098000
C14C0001 DS    0H                                                  0132 00099000
*   R2=$FSTAREA;                    /* SET R2 TO BASE OF T.W.A.      */ 00100000
         L     R2,$FSTAREA(,RCAPTR)                                0132 00101000
*   IF R2=0 THEN                                                   0133 00102000
         LTR   R2,R2                                               0133 00103000
         BNZ   @RF00133                                            0133 00104000
*     DO;                           /* IF NO TWA, THEN PROCESS IS  0134 00105000
*                                      ENDING AND WE SHOULD EXIT.  0134 00106000
*                                                            @XA15990*/ 00107000
*       R13=SAVEDR13;               /* RESTORE R13           @XA15990*/ 00108000
         L     R13,SAVEDR13                                        0135 00109000
*       RETURN;                     /* RETURN TO CALLER      @XA15990*/ 00110000
@EL00001 L     @13,4(,@13)                                         0136 00111000
@EF00001 DS    0H                                                  0136 00112000
@ER00001 LM    @14,@12,12(@13)                                     0136 00113000
         BR    @14                                                 0136 00114000
*     END;                          /*                       @XA15990*/ 00115000
*   BUSYCNT=0;                      /* SET BUSY COUNT BACK TO ZERO   */ 00116000
@RF00133 SLR   @11,@11                                             0138 00117000
         STH   @11,BUSYCNT                                         0138 00118000
*C14C0002:                                                         0139 00119000
*   ;                                                              0139 00120000
C14C0002 DS    0H                                                  0140 00121000
*   $CURRTWA=R2;                    /* SAVE CURRENT USER ADDRESS     */ 00122000
         ST    R2,$CURRTWA(,RCAPTR)                                0140 00123000
*   R15=R13;                        /* SAVE CALLERS SAVE REG         */ 00124000
         LR    R15,R13                                             0141 00125000
*   R13=ADDR(SVECC014(1));          /* PICK UP MY SAVE REG AREA      */ 00126000
         LA    R13,SVECC014(,WAPTR)                                0142 00127000
*   SVECC014(2)=R15;                /* CHAIN AREAS TOGETHER          */ 00128000
         ST    R15,SVECC014+4(,WAPTR)                              0143 00129000
*   BACKSAVE(3)=R13;                                               0144 00130000
         ST    R13,BACKSAVE+8(,R15)                                0144 00131000
*   R4=ATCLCPTR;                    /*                        @MAK4WX*/ 00132000
         L     R4,ATCLCPTR                                         0145 00133000
*   RESPECIFY                                                      0146 00134000
*     ISTATCVT BASED(R4);                                          0146 00135000
*   IF ATCMTST='1'B                 /* ** IS A CONSOLE INIT WANTED   */ 00136000
*     THEN                          /* ** IF YES GOTO SIM LOGON      */ 00137000
         TM    ATCMTST(R4),B'10000000'                             0147 00138000
         BNO   @RF00147                                            0147 00139000
*     DO;                           /* **                            */ 00140000
*       ATCECTLP=0;                 /* SET ECB TO 0                  */ 00141000
         SLR   @11,@11                                             0149 00142000
         ST    @11,ATCECTLP(,R4)                                   0149 00143000
*       CALL I00C0070;              /* ** I00C0070                   */ 00144000
         L     @15,@CV01973                                        0150 00145000
         BALR  @14,@15                                             0150 00146000
*/***** FOLOWING LINE DELETED BY APAR 0X23476 OZ38432 DY20612  ****  */ 00147000
*/*                   ATCMTST='0'B                                   */ 00148000
*                                                                  0151 00149000
*     END;                                                         0151 00150000
*   R14=ADDR(C14C0004);             /* SET RETURN ADDRESS            */ 00151000
@RF00147 LA    R14,C14C0004                                        0152 00152000
*   IF $HOLD='1'B                   /* CHECK TO STOP SCHEDULING      */ 00153000
*     THEN                          /* IF BIT ON SKIP THIS TEST      */ 00154000
         TM    $HOLD(WAPTR),B'00000001'                            0153 00155000
         BO    @RT00153                                            0153 00156000
*     GOTO C14C0004;                                               0154 00157000
*   IF $EOJ='1'B&                   /* IF CANCEL,LOGOFF,CT I/O ER    */ 00158000
*       $LOGOFFE='0'B&              /* & LOGOFF ROUT NOT ENTERED     */ 00159000
*       $ABTERM='0'B                /* & ABTERM ROUT NOT ENTERED     */ 00160000
*     THEN                          /* BIT WILL BE ON AND TEST IS    */ 00161000
         TM    $EOJ(WAPTR),B'00000010'                             0155 00162000
         BNO   @RF00155                                            0155 00163000
         TM    $LOGOFFE(WAPTR),B'00100000'                         0155 00164000
         BNZ   @RF00155                                            0155 00165000
         TM    $ABTERM(WAPTR),B'00000010'                          0155 00166000
         BNZ   @RF00155                                            0155 00167000
*     DO;                           /* TO BE DROPPED                 */ 00168000
*       R15=ADDR(C14C0020);         /* EXIT TO LOGOFF                */ 00169000
         LA    R15,C14C0020                                        0157 00170000
*       GEN(BR    R15);             /* ROUTINE TO EXIT               */ 00171000
         BR    R15                                                      00172000
*     END;                                                         0159 00173000
*   IF $EXIOWAT='1'B                /* FOR ALL API REQ               */ 00174000
*     THEN                          /* TO BE RETURNED                */ 00175000
@RF00155 TM    $EXIOWAT(WAPTR),B'00100000'                         0160 00176000
         BNO   @RF00160                                            0160 00177000
*     DO;                           /* BY VTAM IF YES                */ 00178000
*       R4=$R13PTR;                 /* GIVE CONTROL BK               */ 00179000
         L     R4,$R13PTR(,WAPTR)                                  0162 00180000
*       GEN(LM    R0,R1,L20(R4));   /* TO EXIO AFTER                 */ 00181000
         LM    R0,R1,L20(R4)                                            00182000
*       R14=ADDR(C14C0007);         /* RESETTING R0 &                */ 00183000
         LA    R14,C14C0007                                        0164 00184000
*       R15=ADDR(ISTSC027);         /* R1                            */ 00185000
         L     R15,@CV01985                                        0165 00186000
*       GEN(BR    R15);             /*                               */ 00187000
         BR    R15                                                      00188000
*     END;                          /*                               */ 00189000
*   IF $REQSTOR='1'B                /* IS SOMEONE WAITING FOR        */ 00190000
*     THEN                          /* STORAGE YES GO TRY AGAIN      */ 00191000
@RF00160 TM    $REQSTOR(WAPTR),B'00010000'                         0168 00192000
         BO    @RT00168                                            0168 00193000
*     GOTO C14C0035;                /* TO GET IT                     */ 00194000
*   IF $ENDTEST='1'B                /* WAS A VARY DETECTED           */ 00195000
*     THEN                          /* FOR THIS TEST IF YES          */ 00196000
         TM    $ENDTEST(WAPTR),B'00001000'                         0170 00197000
         BNO   @RF00170                                            0170 00198000
*     DO;                           /* RESET ALL BITS SO TO          */ 00199000
*       $TEP1ST='0'B;               /* SIMULATE A CANCEL             */ 00200000
*       $TEP2ND='0'B;               /* TEST TO STOP HERE &           */ 00201000
         NI    $TEP1ST(WAPTR),B'11111100'                          0173 00202000
*       $TEP3RD='0'B;               /* GO BACK FOR 105D-ASIF         */ 00203000
         NI    $TEP3RD(WAPTR),B'01111111'                          0174 00204000
*       $REQSTOR='0'B;              /* OLT ISSUED A DTERM            */ 00205000
         NI    $REQSTOR(WAPTR),B'11101111'                         0175 00206000
*       $ENDTEST='0'B;              /*                               */ 00207000
         NI    $ENDTEST(WAPTR),B'11110111'                         0176 00208000
*       $OLTMACC='0'B;              /*                               */ 00209000
         NI    $OLTMACC(WAPTR),B'11011111'                         0177 00210000
*       $ACTOPND='0'B;                                             0178 00211000
*       $CLSSACT='0'B;                                             0179 00212000
         NI    $ACTOPND(WAPTR),B'11111010'                         0179 00213000
*       $WAITFLG='0'B;                                             0180 00214000
         NI    $WAITFLG(WAPTR),B'10111111'                         0180 00215000
*       $POSTFLG='0'B;                                             0181 00216000
         NI    $POSTFLG(WAPTR),B'10111111'                         0181 00217000
*       $CIREQ='0'B;                /*                               */ 00218000
         NI    $CIREQ(WAPTR),B'11111110'                           0182 00219000
*       $SNDRFLG='0'B;              /* WAITING ON SEND        @DM0908*/ 00220000
*       $RCVRFLG='0'B;              /* WAITING ON RECEIVE     @DM0908*/ 00221000
         NI    $SNDRFLG(WAPTR),B'11111001'                         0184 00222000
*       $VARYINP='1'B;              /* SET ON VARY IN PROC           */ 00223000
         OI    $VARYINP(WAPTR),B'00000100'                         0185 00224000
*       R0=4;                       /* BIT                           */ 00225000
         LA    R0,4                                                0186 00226000
*       R15=ADDR(ISTCC010);         /* GOTO DTERM                    */ 00227000
         L     R15,@CV01971                                        0187 00228000
*       GEN(BR    R15);             /*                               */ 00229000
         BR    R15                                                      00230000
*     END;                          /*                               */ 00231000
*   IF $ACTOPND='1'B                /* TEST IS OPEN PENDING          */ 00232000
*     THEN                          /* IF YES GOTO S30C1000 FOR      */ 00233000
@RF00170 TM    $ACTOPND(WAPTR),B'00000001'                         0190 00234000
         BNO   @RF00190                                            0190 00235000
*     DO;                           /* TIME CHECK                    */ 00236000
*       R14=ADDR(C14C0007);         /* SET RTN POINT                 */ 00237000
         LA    R14,C14C0007                                        0192 00238000
*       R15=ADDR(S30C1000);                                        0193 00239000
         L     R15,@CV01980                                        0193 00240000
*       GEN(BR    R15);                                            0194 00241000
         BR    R15                                                      00242000
*     END;                                                         0195 00243000
*   IF $CLSSACT='1'B THEN                                          0196 00244000
@RF00190 TM    $CLSSACT(WAPTR),B'00000100'                         0196 00245000
         BNO   @RF00196                                            0196 00246000
*     DO;                           /* IF ON, WAIT FOR RELEASE       */ 00247000
*       R14=ADDR(C14C0007);         /* SET RTN POINT                 */ 00248000
         LA    R14,C14C0007                                        0198 00249000
*       R15=ADDR(S31C0480);         /* POINT TO ENTRY POINT          */ 00250000
         L     R15,@CV01981                                        0199 00251000
*       GEN(BR    R15);             /* CALL FUNCTION TO CHECK TIME   */ 00252000
         BR    R15                                                      00253000
*     END;                                                         0201 00254000
*   IF $WAITFLG='1'B                /* IF BIT ON TEST IS WAITING     */ 00255000
*       &$POSTFLG='0'B              /* & NOT BUSY                    */ 00256000
*     THEN                          /* POSSIBLE ON A TIME LOOP       */ 00257000
@RF00196 TM    $WAITFLG(WAPTR),B'01000000'                         0202 00258000
         BNO   @RF00202                                            0202 00259000
         TM    $POSTFLG(WAPTR),B'01000000'                         0202 00260000
         BNZ   @RF00202                                            0202 00261000
*     DO;                           /* EXIT TO WAITIO FOR TIME       */ 00262000
*       CALL S2FC1000;              /* GO TO WAITIO FOR CHECKS       */ 00263000
         L     @15,@CV01975                                        0204 00264000
         BALR  @14,@15                                             0204 00265000
*       IF $WAITFLG='0'B THEN       /* IF WAITIO DONE                */ 00266000
         TM    $WAITFLG(WAPTR),B'01000000'                         0205 00267000
         BZ    @RT00205                                            0205 00268000
*         GO TO C14C006A;                                          0206 00269000
*       GOTO C14C0007;                                             0207 00270000
         B     C14C0007                                            0207 00271000
*     END;                                                         0208 00272000
*C14C0003:                                                         0209 00273000
*   IF $POSTFLG='1'B                /* IF BIT ON TEST IS NOT RDY     */ 00274000
*     THEN                          /* TO SATISFY SOME OUTSTANDNG    */ 00275000
@RF00202 DS    0H                                                  0209 00276000
C14C0003 TM    $POSTFLG(WAPTR),B'01000000'                         0209 00277000
         BO    @RT00209                                            0209 00278000
*     GOTO C14C0004;                /* REQUEST GO ON TO NXT USER     */ 00279000
*   IF $SNDRFLG='1'B|$RCVRFLG='1'B THEN/* RECALL SEND OR RECEIVE   0211 00280000
*                                                            @D32JPFR*/ 00281000
         TM    $SNDRFLG(WAPTR),B'00000110'                         0211 00282000
         BZ    @RF00211                                            0211 00283000
*     DO;                           /* YES                   @D32JPFR*/ 00284000
*       R4=$R13PTR;                 /* OLT SAVE AREA PTR     @D32JPFR*/ 00285000
         L     R4,$R13PTR(,WAPTR)                                  0213 00286000
*       GEN(LM R0,R1,L20(R4));      /* RESTORE REGS          @D32JPFR*/ 00287000
         LM R0,R1,L20(R4)                                               00288000
*       R15=ADDR(ISTSC033);         /* GET ADDR OF RTN TO CALL     0215 00289000
*                                                            @D32JPFR*/ 00290000
         L     R15,@CV01984                                        0215 00291000
*       IF $SNDRFLG='1'B THEN       /* GET ADDR OF RTN TO CALL     0216 00292000
*                                                            @D32JPFR*/ 00293000
         TM    $SNDRFLG(WAPTR),B'00000100'                         0216 00294000
         BNO   @RF00216                                            0216 00295000
*         R15=ADDR(ISTSC025);       /* BAD GUESS, DO OTHER MOD     0217 00296000
*                                                            @D32JPFR*/ 00297000
         L     R15,@CV01983                                        0217 00298000
*       GEN(BALR R14,R15);          /* CALL FUNCTION         @D32JPFR*/ 00299000
@RF00216 DS    0H                                                  0218 00300000
         BALR R14,R15                                                   00301000
*       IF $SNDRFLG='0'B&$RCVRFLG='0'B THEN/* DID THE FUNCTION COMP     00302000
*                                                            @D32JPFR*/ 00303000
         TM    $SNDRFLG(WAPTR),B'00000110'                         0219 00304000
         BZ    @RT00219                                            0219 00305000
*         GO TO C14C006A;           /* YES, REDUCE COUNT     @D32JPFR*/ 00306000
*       GO TO C14C0007;             /* NO, CHECK NEXT USER   @D32JPFR*/ 00307000
         B     C14C0007                                            0221 00308000
*     END;                          /* END OF SEND/RECEIVE RECALL  0222 00309000
*                                                            @D32JPFR*/ 00310000
*   IF $RECAL11='1'B                /* RECALL ISTCC011               */ 00311000
*     THEN                          /* IF YES MSGIO HAS ORIG MSG     */ 00312000
@RF00211 TM    $RECAL11(WAPTR),B'10000000'                         0223 00313000
         BNO   @RF00223                                            0223 00314000
*     DO;                           /* TO PUT OUT                    */ 00315000
*       R13=SAVEDR13;               /* USE ORIG AREA         @DA04678*/ 00316000
         L     R13,SAVEDR13                                        0225 00317000
*       CALL ISTCC011;              /* CALL TO START MSGS    @D32JPFR*/ 00318000
         L     @15,@CV01972                                        0226 00319000
         BALR  @14,@15                                             0226 00320000
*       IF $RECAL11='0'B THEN       /* RECALL ISTCC011 LATER?      0227 00321000
*                                                            @D32JPFR*/ 00322000
         TM    $RECAL11(WAPTR),B'10000000'                         0227 00323000
         BZ    @RT00227                                            0227 00324000
*         GO TO C14C006A;           /* NO,REDUCE COUNT       @D32JPFR*/ 00325000
*       GO TO C14C0007;             /* CHECK NEXT USER       @D32JPFR*/ 00326000
         B     C14C0007                                            0229 00327000
*     END;                                                         0230 00328000
*   IF $TWOWAY='1'B                 /* TEST FOR TWOWAY NEEDED FOR    */ 00329000
*     THEN                          /* ALTERNATE PRINTER             */ 00330000
@RF00223 TM    $TWOWAY(WAPTR),B'01000000'                          0231 00331000
         BNO   @RF00231                                            0231 00332000
*     DO;                           /* IF YES PUT REPLY TO AP        */ 00333000
*       $TWOWAY='0'B;               /* RESET BIT INDICATOR           */ 00334000
         NI    $TWOWAY(WAPTR),B'10111111'                          0233 00335000
*       $COUTAD=$CINADR;            /* SET OUTPUT ADDR               */ 00336000
         L     @11,$CINADR(,WAPTR)                                 0234 00337000
         ST    @11,$COUTAD(,WAPTR)                                 0234 00338000
*       R5=$COUTAD;                 /* SET OUTPUT SIZE               */ 00339000
         LR    R5,@11                                              0235 00340000
*       R5=R5-1;                                                   0236 00341000
         BCTR  R5,0                                                0236 00342000
*       R15=REPLYSZE;                                              0237 00343000
         SLR   R15,R15                                             0237 00344000
         IC    R15,REPLYSZE(,R5)                                   0237 00345000
*       $COUTCT=R15;                                               0238 00346000
         ST    R15,$COUTCT(,WAPTR)                                 0238 00347000
*       $CINADR=0;                  /* SET INDICATOR FOR             */ 00348000
         SLR   @11,@11                                             0239 00349000
         ST    @11,$CINADR(,WAPTR)                                 0239 00350000
*       $CINCT=0;                   /* ONE WAY OUTPUT                */ 00351000
         ST    @11,$CINCT(,WAPTR)                                  0240 00352000
*       $C2WAY='0'B;                                               0241 00353000
         NI    $C2WAY(WAPTR),B'01111111'                           0241 00354000
*       $PRTONLY='1'B;              /* SET ON AP ONLY BIT            */ 00355000
         OI    $PRTONLY(WAPTR),B'00001000'                         0242 00356000
*       R15=ADDR(ISTCC011);         /* GOTO PUT OUT REPLY            */ 00357000
         L     R15,@CV01972                                        0243 00358000
*       GEN(BR    R15);             /* RETURN IN R14 ALRDY           */ 00359000
         BR    R15                                                      00360000
*       GO TO C14C0003;             /* CHECK TO SEE IF WRITE DONE    */ 00361000
         B     C14C0003                                            0245 00362000
*     END;                                                         0246 00363000
*                                                                  0246 00364000
*/********************************************************************/ 00365000
*/*      TEST WORK AREA READY TO USE                                 */ 00366000
*/********************************************************************/ 00367000
*                                                                  0247 00368000
*   IF $INBND='1'B                  /* IS REQUEST FROM OLT/TOLTEP    */ 00369000
*     THEN                          /* FOR SOME SERVICE MACRO        */ 00370000
@RF00231 TM    $INBND(WAPTR),B'00100000'                           0247 00371000
         BNO   @RF00247                                            0247 00372000
*     DO;                           /* I.E. INBOUND IF YES           */ 00373000
*       $INBND='0'B;                /* TURN OFF BIT                  */ 00374000
         NI    $INBND(WAPTR),B'11011111'                           0249 00375000
*       IF $TEP3RD='1'B             /* IS THIS THIRD CALL            */ 00376000
*         THEN                                                     0250 00377000
         TM    $TEP3RD(WAPTR),B'10000000'                          0250 00378000
         BNO   @RF00250                                            0250 00379000
*         R4=$R13PR3;               /* YES GET R4 SET                */ 00380000
         L     R4,$R13PR3(,WAPTR)                                  0251 00381000
*       ELSE                        /* IF NO CHK 2ND/1ST             */ 00382000
*         IF $TEP2ND='1'B           /* IS THIS 2ND CALL              */ 00383000
*           THEN                    /* YES R13 SAVED                 */ 00384000
         B     @RC00250                                            0252 00385000
@RF00250 TM    $TEP2ND(WAPTR),B'00000001'                          0252 00386000
         BNO   @RF00252                                            0252 00387000
*           R4=$R13PTRT;            /* IN DIFF SPOT                  */ 00388000
         L     R4,$R13PTRT(,WAPTR)                                 0253 00389000
*         ELSE                      /* NO SAVED IN NORM              */ 00390000
*           R4=$R13PTR;             /* SPOT                          */ 00391000
         B     @RC00252                                            0254 00392000
@RF00252 L     R4,$R13PTR(,WAPTR)                                  0254 00393000
*       GEN(LM    R0,R1,L20(R4));   /* RESTORE 0,1                   */ 00394000
@RC00252 DS    0H                                                  0255 00395000
@RC00250 DS    0H                                                  0255 00396000
         LM    R0,R1,L20(R4)                                            00397000
*       GOTO C14C0010;              /* EXIT TO MACRO ROUTER          */ 00398000
         B     C14C0010                                            0256 00399000
*     END;                                                         0257 00400000
*   IF $TEP3RD='1'B                 /* IS THIS THIRD CALL            */ 00401000
*     THEN                                                         0258 00402000
@RF00247 TM    $TEP3RD(WAPTR),B'10000000'                          0258 00403000
         BNO   @RF00258                                            0258 00404000
*     DO;                           /* IF YES DO THE FOLLOWING       */ 00405000
*       $TEP3RD='0'B;               /* SET IND OFF                   */ 00406000
         NI    $TEP3RD(WAPTR),B'01111111'                          0260 00407000
*       SVECC014(2)=$R13PR3;        /* SET R13 IN SAVE AREA          */ 00408000
         L     @11,$R13PR3(,WAPTR)                                 0261 00409000
         ST    @11,SVECC014+4(,WAPTR)                              0261 00410000
*       RETURN;                                                    0262 00411000
         B     @EL00001                                            0262 00412000
*     END;                                                         0263 00413000
*   IF $TEP2ND='1'B                 /* IS RTN TO BE TO OLT &/        */ 00414000
*     THEN                          /* CALLER(1ST) OR TO THE         */ 00415000
@RF00258 TM    $TEP2ND(WAPTR),B'00000001'                          0264 00416000
         BNO   @RF00264                                            0264 00417000
*     DO;                           /* 2ND CALLER                    */ 00418000
*       $TEP2ND='0'B;               /* 2ND CALLER SET BIT OFF        */ 00419000
         NI    $TEP2ND(WAPTR),B'11111110'                          0266 00420000
*       SVECC014(2)=$R13PTRT;       /* RESET R13                     */ 00421000
         L     @11,$R13PTRT(,WAPTR)                                0267 00422000
         ST    @11,SVECC014+4(,WAPTR)                              0267 00423000
*       RETURN;                                                    0268 00424000
         B     @EL00001                                            0268 00425000
*     END;                                                         0269 00426000
*   IF $NOTRRCH='0'B                /* IS THIS A RTN FROM DPRINT     */ 00427000
*     THEN                          /* FORMS PRINT OR MULTI LINE     */ 00428000
@RF00264 TM    $NOTRRCH(WAPTR),B'00000010'                         0270 00429000
         BNZ   @RF00270                                            0270 00430000
*     DO;                           /* NO--SEE ABOUT TRACING         */ 00431000
*       IF $OLTMACC='1'B            /* IS RETURN TO BE TRACED        */ 00432000
*         THEN                      /* YES MAYBE IT IS OLT CALL      */ 00433000
         TM    $OLTMACC(WAPTR),B'00100000'                         0272 00434000
         BNO   @RF00272                                            0272 00435000
*         DO;                       /* IF NOT ON EXEC CALL           */ 00436000
*           $OLTMACC='0'B;          /* SET BIT OFF                   */ 00437000
         NI    $OLTMACC(WAPTR),B'11011111'                         0274 00438000
*           GEN(BAL   R14,C14C0015);                               0275 00439000
         BAL   R14,C14C0015                                             00440000
*         END;                                                     0276 00441000
*       IF $CIREQ='1'B&             /* HAS A CI BEEN REQ             */ 00442000
*           $TESTMDE(1)='0'B&       /* AND CT NOT IN TEST MODE       */ 00443000
*           $OLTACT='1'B&           /* AND OLT ACTIVE AND NOT        */ 00444000
*           $CLEANUP='0'B           /* IN CLEANUP                    */ 00445000
*         THEN                      /* IF YES SET UP TO              */ 00446000
@RF00272 TM    $CIREQ(WAPTR),B'00000001'                           0277 00447000
         BNO   @RF00277                                            0277 00448000
         TM    $TESTMDE(WAPTR),B'00000010'                         0277 00449000
         BNZ   @RF00277                                            0277 00450000
         TM    $OLTACT(WAPTR),B'00000001'                          0277 00451000
         BNO   @RF00277                                            0277 00452000
         TM    $CLEANUP(WAPTR),B'00000100'                         0277 00453000
         BNZ   @RF00277                                            0277 00454000
*         DO;                       /* CHECK TO SEE IF LINE IS IN  0278 00455000
*                                      TEST MODE                     */ 00456000
*           DO J=3 TO $DEVCNTS;     /* CHECK TESTDEVICES             */ 00457000
         LA    J,3                                                 0279 00458000
         B     @DE00279                                            0279 00459000
@DL00279 DS    0H                                                  0280 00460000
*             IF $TESTMDE(J)='1'B&  /* IS TERMINAL IN TEST MODE      */ 00461000
*                 $LINENME(J)=$LINENME(1)/* AND ON SAVE LINE AS CT   */ 00462000
*               THEN                                               0280 00463000
         LR    @11,J                                               0280 00464000
         MH    @11,@CH00404                                        0280 00465000
         ST    @11,@TF00001                                        0280 00466000
         ALR   @11,WAPTR                                           0280 00467000
         TM    $TESTMDE-68(@11),B'00000010'                        0280 00468000
         BNO   @RF00280                                            0280 00469000
         LR    @11,WAPTR                                           0280 00470000
         AL    @11,@TF00001                                        0280 00471000
         CLC   $LINENME-68(8,@11),$LINENME(WAPTR)                  0280 00472000
         BE    @RT00280                                            0280 00473000
*               GO TO C14C0033;     /* IN TEST MODE, WAIT ON       0281 00474000
*                                      COMMUNICATION INTERVAL        */ 00475000
*           END;                    /* END OF LOOP CHECKING CT LINE     00476000
*                                      IN TEST                       */ 00477000
@RF00280 AL    J,@CF00101                                          0282 00478000
@DE00279 CH    J,$DEVCNTS(,WAPTR)                                  0282 00479000
         BNH   @DL00279                                            0282 00480000
*           GO TO C14C0006;         /* FORCE COMMUNICATION INTERVAL  */ 00481000
         B     C14C0006                                            0283 00482000
*         END;                      /* END OF CHECK FOR COMMUNICATION   00483000
*                                      INTERVAL                      */ 00484000
*C14C0033:                                                         0285 00485000
*       ;                           /* DO NEXT CHECK                 */ 00486000
@RF00277 DS    0H                                                  0285 00487000
C14C0033 DS    0H                                                  0286 00488000
*       IF $CIREQ='1'B&             /* IF OLT NOT ACT                */ 00489000
*           $LGON='1'B              /* CHK FOR 1ST TIME              */ 00490000
*         THEN                      /* IF 1ST TIME GO TO             */ 00491000
         TM    $CIREQ(WAPTR),B'00000001'                           0286 00492000
         BNO   @RF00286                                            0286 00493000
         TM    $LGON(WAPTR),B'01000000'                            0286 00494000
         BO    @RT00286                                            0286 00495000
*         GOTO C14C0006;            /* SERVICE REQ                   */ 00496000
*       $TEP1ST='0'B;               /* SET 1ST TIME BIT OFF          */ 00497000
@RF00286 NI    $TEP1ST(WAPTR),B'11111101'                          0288 00498000
*     END;                                                         0289 00499000
*   SAVEDR2=$TFWDPTR;               /*                               */ 00500000
@RF00270 L     @11,$TFWDPTR(,WAPTR)                                0290 00501000
         ST    @11,SAVEDR2                                         0290 00502000
*   SVECC014(2)=$R13PTR;            /* IF NO RTN TO CALLE            */ 00503000
         L     @11,$R13PTR(,WAPTR)                                 0291 00504000
         ST    @11,SVECC014+4(,WAPTR)                              0291 00505000
*   RETURN;                         /* R13 IS PICKED UP FROM T.W.A &    00506000
*                                      USED TO RESTORE REGS & CONTROL*/ 00507000
         B     @EL00001                                            0292 00508000
*/********************************************************************/ 00509000
*                                                                  0293 00510000
*                                                                  0293 00511000
*/********************************************************************/ 00512000
*/*      ADD  1 TO BUSY COUNT  & TEST FOR EVERY BODY BUSY            */ 00513000
*/********************************************************************/ 00514000
*                                                                  0293 00515000
*C14C0004:                                                         0293 00516000
*   ;                               /*                               */ 00517000
C14C0004 DS    0H                                                  0294 00518000
*   BUSYCNT=BUSYCNT+1;              /* ADD 1 TO # TEST BUSY          */ 00519000
         LA    @11,1                                               0294 00520000
         AH    @11,BUSYCNT                                         0294 00521000
         STH   @11,BUSYCNT                                         0294 00522000
*   IF BUSYCNT<$USECNT              /* IF # BUSY IS LESS THAN        */ 00523000
*     THEN                          /* # OF USERS                    */ 00524000
         CH    @11,$USECNT(,RCAPTR)                                0295 00525000
         BL    @RT00295                                            0295 00526000
*     GOTO C14C0005;                /* GO ON WITH LOOP               */ 00527000
*   R1=5;                           /* SET THE NUMBER OF SECONDS TO     00528000
*                                      WAIT IF NOTING HAPPENS        */ 00529000
         LA    R1,5                                                0297 00530000
*   R13=SAVEDR13;                   /* USE ORIG AREA         @DA04678*/ 00531000
         L     R13,SAVEDR13                                        0298 00532000
*   CALL I00C0300;                  /* CALL RESIDENT MODULE TO SET 0299 00533000
*                                      TIMER                         */ 00534000
         L     @15,@CV01982                                        0299 00535000
         BALR  @14,@15                                             0299 00536000
*   R1=ADDR($TLTECB2);              /* PICK UP ADDRESS OF ECB        */ 00537000
         LA    R1,$TLTECB2(,RCAPTR)                                0300 00538000
*   CALL I00C1002;                  /* WAIT ON ECB           @D32JPPW*/ 00539000
         L     @15,@CV02009                                        0301 00540000
         BALR  @14,@15                                             0301 00541000
*   BUSYCNT=0;                      /* SET COUNT BACK TO ZERO        */ 00542000
         SLR   @11,@11                                             0302 00543000
         STH   @11,BUSYCNT                                         0302 00544000
*/********************************************************************/ 00545000
*                                                                  0303 00546000
*                                                                  0303 00547000
*/********************************************************************/ 00548000
*/*      GET NXT AREA PTR & LOOP                                     */ 00549000
*/********************************************************************/ 00550000
*                                                                  0303 00551000
*C14C0005:                                                         0303 00552000
*   ;                               /*                               */ 00553000
C14C0005 DS    0H                                                  0304 00554000
*   R4=$TFWDPTR;                    /* PICK UP NXT AREA PTR          */ 00555000
         L     R4,$TFWDPTR(,WAPTR)                                 0304 00556000
*   IF R4=0                         /* TEST FOR LAST TABLE ON        */ 00557000
*     THEN                          /* CHAIN FWD PTR=0               */ 00558000
         LTR   R4,R4                                               0305 00559000
         BZ    @RT00305                                            0305 00560000
*     GOTO C14C0001;                /* IF YES GO TO 1ST AREA         */ 00561000
*   R2=R4;                          /* IF NO SET R2 &                */ 00562000
         LR    R2,R4                                               0307 00563000
*   GOTO C14C0002;                  /* LOOP                          */ 00564000
         B     C14C0002                                            0308 00565000
*/********************************************************************/ 00566000
*/*       COMMUNICATION INTERVAL REQUESTED                           */ 00567000
*/********************************************************************/ 00568000
*                                                                  0309 00569000
*C14C0006:                                                         0309 00570000
*   ;                                                              0309 00571000
C14C0006 DS    0H                                                  0310 00572000
*   $CIREQ='0'B;                    /* RESET CIREQ BIT               */ 00573000
         NI    $CIREQ(WAPTR),B'11111110'                           0310 00574000
*   R13=ADDR(SVECC014(19));         /* GET NEW SAVE AREA             */ 00575000
         LA    R13,SVECC014+72(,WAPTR)                             0311 00576000
*   R14=ADDR(C14C0005);             /* SET RETURN POINT              */ 00577000
         LA    R14,C14C0005                                        0312 00578000
*   R15=ADDR(ISTIC002);             /* GET PTR TO CI MODULE          */ 00579000
         L     R15,@CV01974                                        0313 00580000
*   GEN(BR    R15);                                                0314 00581000
         BR    R15                                                      00582000
*C14C006A:                                                         0315 00583000
*   BUSYCNT=BUSYCNT-1;              /* REDUCE THE CURRENT BUSY COUNT    00584000
*                                                            @D32JPFR*/ 00585000
*                                                                  0315 00586000
C14C006A LH    @11,BUSYCNT                                         0315 00587000
         BCTR  @11,0                                               0315 00588000
         STH   @11,BUSYCNT                                         0315 00589000
*   /*****************************************************************/ 00590000
*   /*                                                               */ 00591000
*   /* ROUTINE TO SET RTN CODE AND REG 0 1 FROM TIME ROUTINES        */ 00592000
*   /*                                                               */ 00593000
*   /*****************************************************************/ 00594000
*                                                                  0316 00595000
*C14C0007:                                                         0316 00596000
*   ;                                                              0316 00597000
C14C0007 DS    0H                                                  0317 00598000
*   IF $TEP3RD='1'B                 /* IS THIS THIRD CALL            */ 00599000
*     THEN                                                         0317 00600000
         TM    $TEP3RD(WAPTR),B'10000000'                          0317 00601000
         BNO   @RF00317                                            0317 00602000
*     R4=$R13PR3;                   /* SET R4 WITH THIRD SAVE AREA   */ 00603000
         L     R4,$R13PR3(,WAPTR)                                  0318 00604000
*   ELSE                            /* IF NOT CHK FOR 2ND/1ST        */ 00605000
*     IF $TEP2ND='1'B               /* IS THIS 2ND CALL              */ 00606000
*       THEN                                                       0319 00607000
         B     @RC00317                                            0319 00608000
@RF00317 TM    $TEP2ND(WAPTR),B'00000001'                          0319 00609000
         BNO   @RF00319                                            0319 00610000
*       R4=$R13PTRT;                /* SET UP PTR TO SAVE AREA       */ 00611000
         L     R4,$R13PTRT(,WAPTR)                                 0320 00612000
*     ELSE                                                         0321 00613000
*       R4=$R13PTR;                                                0321 00614000
         B     @RC00319                                            0321 00615000
@RF00319 L     R4,$R13PTR(,WAPTR)                                  0321 00616000
*   GEN(ST    R15,L16(R4));         /* RESET REG IN SAVE AREA        */ 00617000
@RC00319 DS    0H                                                  0322 00618000
@RC00317 DS    0H                                                  0322 00619000
         ST    R15,L16(R4)                                              00620000
*   R14=ADDR(C14C0004);             /* RESET R14 TO ORIG RTN POINT   */ 00621000
         LA    R14,C14C0004                                        0323 00622000
*   GOTO C14C0004;                  /* RETURN AND CHECK $POSTFLG     */ 00623000
         B     C14C0004                                            0324 00624000
*                                                                  0325 00625000
*/********************************************************************/ 00626000
*/*      MACRO ROUTER  R1 HAS PTR TO INPUT PARM                      */ 00627000
*/********************************************************************/ 00628000
*                                                                  0325 00629000
*C14C0010:                                                         0325 00630000
*   ;                                                              0325 00631000
C14C0010 DS    0H                                                  0326 00632000
*   IF $TCECM='1'B                  /* TEST FOR SHORT FORM OF        */ 00633000
*     THEN                          /* CECUM-(TCEC MACRO)            */ 00634000
         TM    $TCECM(WAPTR),B'00000001'                           0326 00635000
         BNO   @RF00326                                            0326 00636000
*     DO;                           /* IF YES                        */ 00637000
*       R14=ADDR(C14C0014);         /* SET RTN POINT                 */ 00638000
         LA    R14,C14C0014                                        0328 00639000
*       R15=ADDR(ISTSC020);         /* SET PTR TO CECUM              */ 00640000
         L     R15,@CV01976                                        0329 00641000
*       GEN(BR    R15);             /* EXIT TO CECUM                 */ 00642000
         BR    R15                                                      00643000
*     END;                                                         0331 00644000
*                                                                  0331 00645000
*/********************************************************************/ 00646000
*/*      NORMAL MACRO CALL                                           */ 00647000
*/********************************************************************/ 00648000
*                                                                  0332 00649000
*   $MACID=IDVAL;                   /* SET ID FOR TRACE USE          */ 00650000
@RF00326 MVC   $MACID(2,WAPTR),IDVAL(R1)                           0332 00651000
*   IF LEVEL<2                      /* CHECK MACRO LEVEL FOR 0       */ 00652000
*     THEN                          /* OR 1 BOTH NOT SUPPORTED       */ 00653000
         CLI   LEVEL(R1),2                                         0333 00654000
         BL    @RT00333                                            0333 00655000
*     GOTO C14C0011;                /* IF LESS THAN 2 IS ERROR       */ 00656000
*   IF IDVAL(1:2)='40'              /* IS REQUESTED SERVICE $MODE    */ 00657000
*     THEN                          /* IF YES CANNOT RTN TO OLT      */ 00658000
         CLC   IDVAL(2,R1),@CC02018                                0335 00659000
         BE    @RT00335                                            0335 00660000
*     GOTO C14C0013;                /* MUST GOTO DTERM IMMEDIATLY    */ 00661000
*/********************************************************************/ 00662000
*/*      DO LOOP SEARCH SERVICE MACRO TABLE TO GIVE CONTROL TO ROUTN */ 00663000
*/********************************************************************/ 00664000
*                                                                  0337 00665000
*   R5=ADDR(MACRTBLE);              /* GET PTR TO TABLE              */ 00666000
         LA    R5,MACRTBLE                                         0337 00667000
*   DO I=1 TO 20 BY 1;                                             0338 00668000
         LA    @11,1                                               0338 00669000
         STH   @11,I                                               0338 00670000
@DL00338 DS    0H                                                  0339 00671000
*     IF IDVAL=SMID(I)              /* COMPARE INPUT ID TO TABLE     */ 00672000
*       THEN                        /* IF EQUAL GOTO INDICATED       */ 00673000
         SLA   @11,3                                               0339 00674000
         ST    @11,@TF00001                                        0339 00675000
         ALR   @11,R5                                              0339 00676000
         AL    @11,@CF02096                                        0339 00677000
         CLC   IDVAL(2,R1),SMID(@11)                               0339 00678000
         BNE   @RF00339                                            0339 00679000
*       DO;                         /* ROUTINE                       */ 00680000
*         IF SMLLEVL(I)>LEVEL       /* TEST LOW LIMIT                */ 00681000
*           THEN                    /* IF YES ERROR                  */ 00682000
         SLR   @11,@11                                             0341 00683000
         IC    @11,LEVEL(,R1)                                      0341 00684000
         L     @10,@TF00001                                        0341 00685000
         AL    @10,@CF02097                                        0341 00686000
         SLR   @09,@09                                             0341 00687000
         IC    @09,SMLLEVL-2(@10,R5)                               0341 00688000
         CR    @11,@09                                             0341 00689000
         BL    @RT00341                                            0341 00690000
*           GOTO C14C0011;                                         0342 00691000
*         IF LEVEL>SMHLEVL(I)       /* TEST HI LIMIT                 */ 00692000
*           THEN                    /* IF YES ERROR                  */ 00693000
         L     @10,@TF00001                                        0343 00694000
         AL    @10,@CF02098                                        0343 00695000
         SLR   @09,@09                                             0343 00696000
         IC    @09,SMHLEVL-3(@10,R5)                               0343 00697000
         CR    @11,@09                                             0343 00698000
         BH    @RT00343                                            0343 00699000
*           GOTO C14C0011;                                         0344 00700000
*         R14=ADDR(C14C0014);       /* SET RTN POINT                 */ 00701000
         LA    R14,C14C0014                                        0345 00702000
*         R15=SMPTR(I);             /* SET ENTRY PTR                 */ 00703000
         L     @11,@TF00001                                        0346 00704000
         AL    @11,@CF02099                                        0346 00705000
         L     R15,SMPTR-4(@11,R5)                                 0346 00706000
*         GEN(BR    R15);           /* GOTO SUBROUTINE               */ 00707000
         BR    R15                                                      00708000
*       END;                                                       0348 00709000
*   END;                            /* END OF DO LOOP                */ 00710000
@RF00339 LA    @11,1                                               0349 00711000
         AH    @11,I                                               0349 00712000
         STH   @11,I                                               0349 00713000
         C     @11,@CF00406                                        0349 00714000
         BNH   @DL00338                                            0349 00715000
*/********************************************************************/ 00716000
*/*      EXIT FROM LOOP IF MACRO NOT FOUND I.E. NOT SUPPORTED        */ 00717000
*/********************************************************************/ 00718000
*                                                                  0350 00719000
*C14C0011:                                                         0350 00720000
*   ;                                                              0350 00721000
C14C0011 DS    0H                                                  0351 00722000
*   R15=4;                          /* SET ERROR INDICATION          */ 00723000
         LA    R15,4                                               0351 00724000
*   GOTO C14C0014;                  /* FOR TRACE                     */ 00725000
         B     C14C0014                                            0352 00726000
*/********************************************************************/ 00727000
*/*     $MODE  MACRO ISSUED                                          */ 00728000
*/********************************************************************/ 00729000
*                                                                  0353 00730000
*C14C0013:                                                         0353 00731000
*   ;                                                              0353 00732000
C14C0013 DS    0H                                                  0354 00733000
*   R15=255;                        /* CODE FOR MODE                 */ 00734000
         LA    R15,255                                             0354 00735000
*/********************************************************************/ 00736000
*/*      EXIT                                                        */ 00737000
*/********************************************************************/ 00738000
*                                                                  0355 00739000
*C14C0014:                                                         0355 00740000
*   ;                                                              0355 00741000
C14C0014 DS    0H                                                  0356 00742000
*   IF $TEP3RD='1'B                 /* IS THIS THE THIRD CALL        */ 00743000
*     THEN                                                         0356 00744000
         TM    $TEP3RD(WAPTR),B'10000000'                          0356 00745000
         BNO   @RF00356                                            0356 00746000
*     R4=$R13PR3;                   /* YES SET R4                    */ 00747000
         L     R4,$R13PR3(,WAPTR)                                  0357 00748000
*   ELSE                            /* NO CHK FOR 2ND/1ST            */ 00749000
*     IF $TEP2ND='1'B               /* TEST FOR SECOND CALLER        */ 00750000
*       THEN                        /* IF YES PICK UP R13 FROM       */ 00751000
         B     @RC00356                                            0358 00752000
@RF00356 TM    $TEP2ND(WAPTR),B'00000001'                          0358 00753000
         BNO   @RF00358                                            0358 00754000
*       R4=$R13PTRT;                /* SPOT                          */ 00755000
         L     R4,$R13PTRT(,WAPTR)                                 0359 00756000
*     ELSE                          /* IF NO PICK UP R13 FROM        */ 00757000
*       R4=$R13PTR;                 /* NORMAL SPOT                   */ 00758000
         B     @RC00358                                            0360 00759000
@RF00358 L     R4,$R13PTR(,WAPTR)                                  0360 00760000
*   GEN(STM   R15,R1,L16(R4));      /* SAVE REGS                     */ 00761000
@RC00358 DS    0H                                                  0361 00762000
@RC00356 DS    0H                                                  0361 00763000
         STM   R15,R1,L16(R4)                                           00764000
*   GOTO C14C0005;                  /* RETURN TO REC MNGR            */ 00765000
         B     C14C0005                                            0362 00766000
*/********************************************************************/ 00767000
*/*      EXIT TO TRACE ROUTINE                                       */ 00768000
*/********************************************************************/ 00769000
*                                                                  0363 00770000
*C14C0015:                                                         0363 00771000
*   ;                               /*                               */ 00772000
C14C0015 DS    0H                                                  0364 00773000
*   R4=R14;                         /* SAVE RETURN ADDR              */ 00774000
         LR    R4,R14                                              0364 00775000
*   R5=R13;                         /* SAVE POINTER TO ORIG SAVE     */ 00776000
         LR    R5,R13                                              0365 00777000
*   R13=ADDR(SVECC014(19));         /* SET PTR TO SAVE AREA          */ 00778000
         LA    R13,SVECC014+72(,WAPTR)                             0366 00779000
*   R15=ADDR(ISTCC012);             /* SET POINTER TO TRACE          */ 00780000
         L     R15,@CV01978                                        0367 00781000
*   GEN(BALR  R14,R15);             /* BALR TO TRACE                 */ 00782000
         BALR  R14,R15                                                  00783000
*   R14=R4;                         /* RESET RETURN ADDR             */ 00784000
         LR    R14,R4                                              0369 00785000
*   R13=R5;                         /* RESET ORIG SAVE PTR           */ 00786000
         LR    R13,R5                                              0370 00787000
*   IF R0=0                         /* TEST RET FROM TRACE           */ 00788000
*     THEN                          /* IF 0 RET TO RESOURCE MNGR     */ 00789000
         LTR   R0,R0                                               0371 00790000
         BNZ   @RF00371                                            0371 00791000
*     GEN(BR    R14);               /* IF NOT 0 EXIT TO SCHED        */ 00792000
         BR    R14                                                      00793000
*   $OLTMACC='0'B;                  /* CLEAN UP ANY BITS SET         */ 00794000
@RF00371 DS    0H                                                  0374 00795000
*   $TEP1ST='0'B;                   /* SO AS NOT TO CONFUSE FLOW     */ 00796000
*   $TEP2ND='0'B;                   /* THROUGH RES MNGER             */ 00797000
         NI    $OLTMACC(WAPTR),B'11011100'                         0375 00798000
*   $TEP3RD='0'B;                                                  0376 00799000
         NI    $TEP3RD(WAPTR),B'01111111'                          0376 00800000
*   R15=ADDR(ISTCC010);             /*                               */ 00801000
         L     R15,@CV01971                                        0377 00802000
*   GEN(BR    R15);                 /*                               */ 00803000
         BR    R15                                                      00804000
*/********************************************************************/ 00805000
*                                                                  0379 00806000
*                                                                  0379 00807000
*/********************************************************************/ 00808000
*/*      LOGOFF (ENTRY WHEN CANCEL,LOGOFF,OR ABEND ENCOUNTERED       */ 00809000
*/********************************************************************/ 00810000
*                                                                  0379 00811000
*C14C0020:                                                         0379 00812000
*   ;                                                              0379 00813000
C14C0020 DS    0H                                                  0380 00814000
*   GEN;                                                           0380 00815000
         USING *,R15                                                    00816000
         L     R12,BASEREG              /* PICK UP SAVED BASE        */ 00817000
         DROP  R15                                                      00818000
*   R15=R13;                        /* SET UP SPECIAL SAVE           */ 00819000
         LR    R15,R13                                             0381 00820000
*   R13=ADDR(SVEIC002);             /* AND CHAIN THEM TOGETHER       */ 00821000
         LA    R13,SVEIC002(,WAPTR)                                0382 00822000
*   SVEIC002(2)=R15;                                               0383 00823000
         ST    R15,SVEIC002+4(,WAPTR)                              0383 00824000
*   BACKSAVE(3)=R13;                                               0384 00825000
         ST    R13,BACKSAVE+8(,R15)                                0384 00826000
*   $LOGOFFE='1'B;                  /* SET LOGOFF ENTERED BIT        */ 00827000
         OI    $LOGOFFE(WAPTR),B'00100000'                         0385 00828000
*   R3=$RCA;                        /* GET PTR TO R.C.A.             */ 00829000
         L     R3,$RCA(,WAPTR)                                     0386 00830000
*   $HOLD='0'B;                     /* RESET BIT TO CANCEL           */ 00831000
         NI    $HOLD(WAPTR),B'11111110'                            0387 00832000
*   $TEP1ST='0'B;                   /* THIS TEST IS OVER             */ 00833000
*   $TEP2ND='0'B;                                                  0389 00834000
         NI    $TEP1ST(WAPTR),B'11111100'                          0389 00835000
*   $TEP3RD='0'B;                                                  0390 00836000
         NI    $TEP3RD(WAPTR),B'01111111'                          0390 00837000
*   $REQSTOR='0'B;                  /* OLT ISSUED A DTERM            */ 00838000
         NI    $REQSTOR(WAPTR),B'11101111'                         0391 00839000
*   $ENDTEST='0'B;                  /*                               */ 00840000
         NI    $ENDTEST(WAPTR),B'11110111'                         0392 00841000
*   $OLTMACC='0'B;                  /*                               */ 00842000
         NI    $OLTMACC(WAPTR),B'11011111'                         0393 00843000
*   $ACTOPND='0'B;                                                 0394 00844000
*   $CLSSACT='0'B;                                                 0395 00845000
         NI    $ACTOPND(WAPTR),B'11111010'                         0395 00846000
*   $WAITFLG='0'B;                                                 0396 00847000
         NI    $WAITFLG(WAPTR),B'10111111'                         0396 00848000
*   $POSTFLG='0'B;                                                 0397 00849000
         NI    $POSTFLG(WAPTR),B'10111111'                         0397 00850000
*   $CIREQ='0'B;                    /*                               */ 00851000
         NI    $CIREQ(WAPTR),B'11111110'                           0398 00852000
*   $SNDRFLG='0'B;                  /* WAITING ON SEND        @DM0908*/ 00853000
*   $RCVRFLG='0'B;                  /* WAITING ON RECEIVE     @DM0908*/ 00854000
         NI    $SNDRFLG(WAPTR),B'11111001'                         0400 00855000
*   R15=ADDR(ISTTC035);             /* GO TO DTERM                   */ 00856000
         L     R15,@CV01977                                        0401 00857000
*   GEN(BALR  R14,R15);                                            0402 00858000
         BALR  R14,R15                                                  00859000
*   R1=R2;                          /* SET PTR TO VFRMAIN            */ 00860000
         LR    R1,R2                                               0403 00861000
*/*VFRMAIN  SIZE(34816)STORAGE((1))SUBPOOL(0)                        */ 00862000
*                                                                  0404 00863000
*   DO;                                                            0404 00864000
*     DO;                           /* CMZMREG (0) RESTRICT          */ 00865000
*       RFY                                                        0406 00866000
*        (GPR00P) RSTD;                                            0406 00867000
*     END;                          /* CMZMREG PUT VALUE PASSED AS 0407 00868000
*                                      SIZE PARM IN THREE LOW-ORDER     00869000
*                                      BYTES OF REG 0                */ 00870000
*     GPR00F=34816&'00FFFFFF'X;                                    0408 00871000
         L     GPR00F,@CF02030                                     0408 00872000
*     DO;                           /* CMZMREG (0,15) RESTRICT       */ 00873000
*       RFY                                                        0410 00874000
*        (GPR15P) RSTD;                                            0410 00875000
*     END;                          /* CMZMREG PUT SUBPOOL PARM IN 0411 00876000
*                                      HIGH- ORDER BYTE OF REG 15    */ 00877000
*     GPR15F=0;                                                    0412 00878000
         SLR   GPR15F,GPR15F                                       0412 00879000
*     SLL(GPR15P,24);               /* COMBINE SUBPOOL AND SIZE IN 0413 00880000
*                                      REGISTER 0                    */ 00881000
         SLL   GPR15P,24                                           0413 00882000
*     GPR00P=GPR00P|GPR15P;                                        0414 00883000
         OR    GPR00P,GPR15P                                       0414 00884000
*     DO;                           /* CMZMREG (0,15) RELEASE        */ 00885000
*       RFY                                                        0416 00886000
*        (GPR15P) UNRSTD;                                          0416 00887000
*     END;                          /* CMZMREG DECLARE AND RESTRICT     00888000
*                                      REG 1                         */ 00889000
*     DO;                           /* CMZMREG (1) RESTRICT          */ 00890000
*       RFY                                                        0419 00891000
*        (GPR01P) RSTD;                                            0419 00892000
*     END;                          /* CMZMREG INVOKE XREGSET MACRO     00893000
*                                      TO CHECK STORAGE PARM AND PUT    00894000
*                                      ADDR IN REGISTER 1            */ 00895000
*/*XREGSET  PID('STORAGE')PPARM((1))RREG(1,GPR01P)                   */ 00896000
*                                                                  0421 00897000
*     DO;                                                          0421 00898000
*                                                                  0421 00899000
*/*PARM ALREADY IN PROPER REGISTER                                   */ 00900000
*                                                                  0422 00901000
*     END;                          /* XREGSET INVOKE FREEMAIN MACRO */ 00902000
*     GEN;                                                         0423 00903000
         FREEMAIN R,LV=(0),A=(1)                                        00904000
*                                   /* UNRESTRICT REG 1              */ 00905000
*     DO;                           /* CMZMREG (1) RELEASE           */ 00906000
*       RFY                                                        0425 00907000
*        (GPR01P) UNRSTD;                                          0425 00908000
*     END;                          /* CMZMREG UNRESTRICT REG 0      */ 00909000
*     DO;                           /* CMZMREG (0) RELEASE           */ 00910000
*       RFY                                                        0428 00911000
*        (GPR00P) UNRSTD;                                          0428 00912000
*     END;                          /* CMZMREG                       */ 00913000
*   END;                            /* VFRMAIN                       */ 00914000
*   R2=$FSTAREA;                    /* GET PTR TO FIRST TWA          */ 00915000
         L     R2,$FSTAREA(,RCAPTR)                                0431 00916000
*   $USECNT=$USECNT-1;              /* DECREMENT NUMBER OF USERS     */ 00917000
         LH    @11,$USECNT(,RCAPTR)                                0432 00918000
         BCTR  @11,0                                               0432 00919000
         STH   @11,$USECNT(,RCAPTR)                                0432 00920000
*   IF R2=0                         /* ANY MORE WORK                 */ 00921000
*     THEN                          /* IF NO MORE USERS              */ 00922000
         SLR   @11,@11                                             0433 00923000
         CR    R2,@11                                              0433 00924000
         BNE   @RF00433                                            0433 00925000
*     DO;                           /* SET FIELDS IN RCA TO ZERO     */ 00926000
*       $USECNT=0;                  /* RESET NUMBER OF USERS         */ 00927000
         STH   @11,$USECNT(,RCAPTR)                                0435 00928000
*       $UPDATE='0'B;                                              0436 00929000
*       $CUTESTB='0'B;              /* INDICATE CUTEST HAS ENDED     */ 00930000
         NI    $UPDATE(RCAPTR),B'01101111'                         0437 00931000
*       $FSTAREA=0;                                                0438 00932000
         ST    @11,$FSTAREA(,RCAPTR)                               0438 00933000
*       $LSTAREA=0;                                                0439 00934000
         ST    @11,$LSTAREA(,RCAPTR)                               0439 00935000
*       $TOLTEP=0;                                                 0440 00936000
         ST    @11,$TOLTEP(,RCAPTR)                                0440 00937000
*       $ABEND=0;                                                  0441 00938000
         ST    @11,$ABEND(,RCAPTR)                                 0441 00939000
*       $CLEANP=0;                                                 0442 00940000
         ST    @11,$CLEANP(,RCAPTR)                                0442 00941000
*       R15=ADDR(I00C0005);                                        0443 00942000
         L     R15,@CV01979                                        0443 00943000
*       GEN(BR    R15);                                            0444 00944000
         BR    R15                                                      00945000
*     END;                                                         0445 00946000
*   ELSE                            /* IF MORE USERS                 */ 00947000
*     DO;                           /* SET UP TO LOOP BACK TO TOP    */ 00948000
         B     @RC00433                                            0446 00949000
@RF00433 DS    0H                                                  0447 00950000
*       R13=ADDR(SVECC014(1));      /* SET SAVE PTR                  */ 00951000
         LA    R13,SVECC014(,WAPTR)                                0447 00952000
*       GOTO C14C0001;                                             0448 00953000
         B     C14C0001                                            0448 00954000
*     END;                                                         0449 00955000
*                                                                  0449 00956000
*/********************************************************************/ 00957000
*                                                                  0450 00958000
*                                                                  0450 00959000
*/********************************************************************/ 00960000
*/*      GET STORAGE ROUTINE                                         */ 00961000
*/********************************************************************/ 00962000
*                                                                  0450 00963000
*C14C0030:                                                         0450 00964000
*   ;                                                              0450 00965000
@RC00433 DS    0H                                                  0450 00966000
C14C0030 DS    0H                                                  0451 00967000
*   GEN;                                                           0451 00968000
         USING *,R15                    /* SET BASE                  */ 00969000
         STM   R14,R12,L12(R13)         /* SAVE CALLERS REGS         */ 00970000
         L     R12,BASEREG              /* PICK UP BASE              */ 00971000
         DROP  R15                      /* DROP 15 BASE              */ 00972000
*   SVECC014(20)=R13;               /* SAVE SAVE PTR                 */ 00973000
         ST    R13,SVECC014+76(,WAPTR)                             0452 00974000
*   R13=ADDR(SVECC014(19));         /* SET R13 TO MY SAVE            */ 00975000
         LA    R13,SVECC014+72(,WAPTR)                             0453 00976000
*C14C0035:                                                         0454 00977000
*   ;                                                              0454 00978000
C14C0035 DS    0H                                                  0455 00979000
*   GEN(STM R0,R13,GTSTSAVE);                                      0455 00980000
         STM R0,R13,GTSTSAVE                                            00981000
*   DO;                             /* GETSTOR SIZE($RQSTSZE)TYPE(PAG   00982000
*                                      EABLE)ADSPACE(COMMON)KEY(VTAM)   00983000
*                                      FETCHP(NO)SAVE(NO)CLEAR(YES)  */ 00984000
*                                                                  0457 00985000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 00986000
*/* END OF ATBUILD                                                   */ 00987000
*                                                                  0457 00988000
*     DO;                                                          0457 00989000
*     END;                                                         0458 00990000
*     DO;                                                          0459 00991000
*       RFY                                                        0460 00992000
*        (GPR00P,                                                  0460 00993000
*         GPR01P,                                                  0460 00994000
*         GPR02P,                                                  0460 00995000
*         GPR03P) RSTD;                                            0460 00996000
*     END;                                                         0461 00997000
*     GPR00F=$RQSTSZE;              /* SIZE IN REG0                  */ 00998000
         LH    GPR00F,$RQSTSZE(,WAPTR)                             0462 00999000
*     DCL                                                          0463 01000000
*       1 CMZA0031 FIXED(31) STATIC LOCAL,                         0463 01001000
*        2 * FIXED(8) INIT(32),     /* OPTION FLAGS                  */ 01002000
*        2 * FIXED(8) INIT(96),     /* STORAGE KEY                   */ 01003000
*        2 * FIXED(8) INIT(241),    /* SUBPOOL NUMBER                */ 01004000
*        2 * FIXED(8) INIT('00'X);  /* REQUEST TYPE                  */ 01005000
*     GPR03F=CMZA0031;                                             0464 01006000
         L     GPR03F,CMZA0031                                     0464 01007000
*     DO;                           /* LISATCVT                    0465 01008000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 01009000
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 01010000
         L     GPR02P,ATCLCPTR                                     0466 01011000
*     END;                          /* LISATCVT                      */ 01012000
*     CALL GPR02P->ATCGTSTR;        /* CALL ISTORFSR                 */ 01013000
         L     @15,ATCGTSTR(,GPR02P)                               0468 01014000
         BALR  @14,@15                                             0468 01015000
*     DO;                                                          0469 01016000
*       RFY                                                        0470 01017000
*        (GPR00P,                                                  0470 01018000
*         GPR01P,                                                  0470 01019000
*         GPR02P,                                                  0470 01020000
*         GPR03P) UNRSTD;                                          0470 01021000
*     END;                                                         0471 01022000
*   END;                            /* GETSTOR                       */ 01023000
*   R14=R3;                         /* SAVE PTR TO AREA              */ 01024000
         LR    R14,R3                                              0473 01025000
*   GEN(LM R0,R13,GTSTSAVE);                                       0474 01026000
         LM R0,R13,GTSTSAVE                                             01027000
*   $RQSTPTR=R14;                   /* STORE PTR AWAY                */ 01028000
         ST    R14,$RQSTPTR(,WAPTR)                                0475 01029000
*   IF R15=0                        /* CHK RETURN CODE               */ 01030000
*     THEN                          /* IF ZERO RESTORE REGS          */ 01031000
         LTR   R15,R15                                             0476 01032000
         BNZ   @RF00476                                            0476 01033000
*     DO;                           /* & RNT TO CALLER               */ 01034000
*       $REQSTOR='0'B;              /* PTR TO GOTTEN AREA IN         */ 01035000
         NI    $REQSTOR(WAPTR),B'11101111'                         0478 01036000
*       R13=SVECC014(20);           /* $RQSTPTR                      */ 01037000
         L     R13,SVECC014+76(,WAPTR)                             0479 01038000
*       GEN(LM    R14,R12,L12(R13));                               0480 01039000
         LM    R14,R12,L12(R13)                                         01040000
*       GEN(BR    R14);                                            0481 01041000
         BR    R14                                                      01042000
*     END;                                                         0482 01043000
*   ELSE                                                           0483 01044000
*     DO;                           /* IF NOT ZERO NO CORE AVAIL     */ 01045000
         B     @RC00476                                            0483 01046000
@RF00476 DS    0H                                                  0484 01047000
*       $REQSTOR='1'B;              /* SET BIT TO RETRY LATER        */ 01048000
         OI    $REQSTOR(WAPTR),B'00010000'                         0484 01049000
*       R3=$RCA;                    /* RESET R3                      */ 01050000
         L     R3,$RCA(,WAPTR)                                     0485 01051000
*       GOTO C14C0004;              /* GO TO LOOP                    */ 01052000
         B     C14C0004                                            0486 01053000
*     END;                                                         0487 01054000
*   GEN(EJECT);                                                    0488 01055000
@RC00476 DS    0H                                                  0488 01056000
         EJECT                                                          01057000
*                                                                  0489 01058000
*/********************************************************************/ 01059000
*/*      MACRO TABLE  PASSED ID  RELATED TO ADDR                     */ 01060000
*/********************************************************************/ 01061000
*                                                                  0489 01062000
*   GEN(DS    0D);                                                 0489 01063000
         DS    0D                                                       01064000
*MACRTBLE:                                                         0490 01065000
*   ;                                                              0490 01066000
MACRTBLE DS    0H                                                  0491 01067000
*   GEN;                                                           0491 01068000
*                                                                  0491 01069000
         DC    C'37'                                                    01070000
         DC    X'0202'                                                  01071000
         DC    V(ISTSC020)          MACRO CALL IS TO CECOM              01072000
         DC    C'41'                                                    01073000
         DC    X'0202'                                                  01074000
         DC    V(ISTSC021)          MACRO CALL IS TO CONVERT            01075000
         DC    C'AJ'                                                    01076000
         DC    X'0202'                                                  01077000
         DC    V(ISTSC022)          MACRO CALL IS TO $CUTEST            01078000
         DC    C'AA'                                                    01079000
         DC    X'0202'                                                  01080000
         DC    V(ISTSC023)          MACRO CALL IS TO DDATE              01081000
         DC    C'39'                                                    01082000
         DC    X'0202'                                                  01083000
         DC    V(ISTSC024)          MACRO CALL IS TO DPRINT             01084000
         DC    C'AB'                                                    01085000
         DC    X'0202'                                                  01086000
         DC    V(ISTSC026)          MACRO CALL IS TO DTIME              01087000
         DC    C'35'                                                    01088000
         DC    X'0203'                                                  01089000
         DC    V(ISTSC027)          MACRO CALL IS TO EXIO               01090000
         DC    C'43'                                                    01091000
         DC    X'0202'                                                  01092000
         DC    V(ISTSC028)          MACRO CALL IS TO FREECORE           01093000
         DC    C'16'                                                    01094000
         DC    X'0202'                                                  01095000
         DC    V(ISTSC029)          MACRO CALL IS TO GETCONFG           01096000
         DC    C'21'                                                    01097000
         DC    X'0202'                                                  01098000
         DC    V(ISTSC02A)          MACRO CALL IS TO GRAB               01099000
         DC    C'AC'                                                    01100000
         DC    X'0202'                                                  01101000
         DC    V(ISTSC02B)          MACRO CALL IS TO LETGO              01102000
         DC    C'42'                                                    01103000
         DC    X'0203'                                                  01104000
         DC    V(ISTSC02C)          MACRO CALL IS TO MORECORE           01105000
         DC    C'28'                                                    01106000
         DC    X'0202'                                                  01107000
         DC    V(ISTSC02D)          MACRO CALL IS TO PLINK              01108000
         DC    C'47'                                                    01109000
         DC    X'0202'                                                  01110000
         DC    V(ISTSC02E)          MACRO CALL IS TO ROUTINE            01111000
         DC    C'36'                                                    01112000
         DC    X'0203'                                                  01113000
         DC    V(ISTSC02F)          MACRO CALL IS TO WAITIO             01114000
         DC    C'30'                                                    01115000
         DC    X'0202'                                                  01116000
         DC    V(S30C0010)          MACRO CALL IS TO ACQUIRE            01117000
         DC    C'44'                                                    01118000
         DC    X'0202'                                                  01119000
         DC    V(ISTSC032)          MACRO CALL IS TO DIO                01120000
         DC    C'31'                                                    01121000
         DC    X'0202'                                                  01122000
         DC    V(ISTSC031)          MACRO CALL TO RELEASE               01123000
         DC    C'25'                                           @D32JPFR 01124000
         DC    X'0202'                                         @D32JPFR 01125000
         DC    V(ISTSC025)          MACRO CALL TO SEND         @D32JPFR 01126000
         DC    C'33'                                           @D32JPFR 01127000
         DC    X'0202'                                         @D32JPFR 01128000
         DC    V(ISTSC025)          MACRO CALL TO RECEIVE      @D32JPFR 01129000
*/********************************************************************/ 01130000
*                                                                  0492 01131000
*   DO;                             /* TPEPILOG                      */ 01132000
*     GEN(PRINT OFF);                                              0493 01133000
         PRINT OFF                                                      01134000
*     DO;                                                          0494 01135000
*       DCL                                                        0495 01136000
*         GPR00F FIXED(31) REG(00),                                0495 01137000
*         GPR00P PTR(31) REG(00),                                  0495 01138000
*         GPR01F FIXED(31) REG(01),                                0495 01139000
*         GPR01P PTR(31) REG(01),                                  0495 01140000
*         GPR02F FIXED(31) REG(02),                                0495 01141000
*         GPR02P PTR(31) REG(02),                                  0495 01142000
*         GPR03F FIXED(31) REG(03),                                0495 01143000
*         GPR03P PTR(31) REG(03),                                  0495 01144000
*         GPR04F FIXED(31) REG(04),                                0495 01145000
*         GPR04P PTR(31) REG(04),                                  0495 01146000
*         GPR05F FIXED(31) REG(05),                                0495 01147000
*         GPR05P PTR(31) REG(05),                                  0495 01148000
*         GPR06F FIXED(31) REG(06),                                0495 01149000
*         GPR06P PTR(31) REG(06),                                  0495 01150000
*         GPR07F FIXED(31) REG(07),                                0495 01151000
*         GPR07P PTR(31) REG(07),                                  0495 01152000
*         GPR08F FIXED(31) REG(08),                                0495 01153000
*         GPR08P PTR(31) REG(08),                                  0495 01154000
*         GPR09F FIXED(31) REG(09),                                0495 01155000
*         GPR09P PTR(31) REG(09),                                  0495 01156000
*         GPR10F FIXED(31) REG(10),                                0495 01157000
*         GPR10P PTR(31) REG(10),                                  0495 01158000
*         GPR11F FIXED(31) REG(11),                                0495 01159000
*         GPR11P PTR(31) REG(11),                                  0495 01160000
*         GPR12F FIXED(31) REG(12),                                0495 01161000
*         GPR12P PTR(31) REG(12),                                  0495 01162000
*         GPR13F FIXED(31) REG(13),                                0495 01163000
*         GPR13P PTR(31) REG(13),                                  0495 01164000
*         GPR14F FIXED(31) REG(14),                                0495 01165000
*         GPR14P PTR(31) REG(14),                                  0495 01166000
*         GPR15F FIXED(31) REG(15),                                0495 01167000
*         GPR15P PTR(31) REG(15);                                  0495 01168000
*     END;                                                         0496 01169000
*     GEN(PRINT ON);                                               0497 01170000
         PRINT ON                                                       01171000
*   END;                            /* TPEPILOG                      */ 01172000
*   DO;                             /* ATDSPLY                       */ 01173000
*   END;                            /* ATDSPLY                       */ 01174000
*   END                                                            0501 01175000
*                                                                  0501 01176000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01177000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01178000
*                                                                  0501 01179000
*       ;                                                          0501 01180000
         B     @EL00001                                            0501 01181000
@DATA    DS    0H                                                       01182000
@CH00404 DC    H'68'                                                    01183000
         DS    0F                                                       01184000
@SA00001 DS    18F                                                      01185000
@TF00001 DS    F                                                        01186000
         DS    0F                                                       01187000
@CF00101 DC    F'1'                                                     01188000
@CF00406 DC    F'20'                                                    01189000
@CF02030 DC    F'34816'                                                 01190000
@CF02096 DC    F'-8'                                                    01191000
@CF02097 DC    F'-6'                                                    01192000
@CF02098 DC    F'-5'                                                    01193000
@CF02099 DC    F'-4'                                                    01194000
@CV01971 DC    V(ISTCC010)                                              01195000
@CV01972 DC    V(ISTCC011)                                              01196000
@CV01973 DC    V(I00C0070)                                              01197000
@CV01974 DC    V(ISTIC002)                                              01198000
@CV01975 DC    V(S2FC1000)                                              01199000
@CV01976 DC    V(ISTSC020)                                              01200000
@CV01977 DC    V(ISTTC035)                                              01201000
@CV01978 DC    V(ISTCC012)                                              01202000
@CV01979 DC    V(I00C0005)                                              01203000
@CV01980 DC    V(S30C1000)                                              01204000
@CV01981 DC    V(S31C0480)                                              01205000
@CV01982 DC    V(I00C0300)                                              01206000
@CV01983 DC    V(ISTSC025)                                              01207000
@CV01984 DC    V(ISTSC033)                                              01208000
@CV01985 DC    V(ISTSC027)                                              01209000
@CV02009 DC    V(I00C1002)                                              01210000
         DS    0D                                                       01211000
BASEREG  DC    F'0'                                                     01212000
SAVEDR2  DC    F'0'                                                     01213000
SAVEDR13 DC    F'0'                                                     01214000
CMZA0031 DS    FL4                                                      01215000
         ORG   CMZA0031                                                 01216000
@NM00112 DC    AL1(32)                                                  01217000
@NM00113 DC    AL1(96)                                                  01218000
@NM00114 DC    AL1(241)                                                 01219000
@NM00115 DC    XL1'00'                                                  01220000
         ORG   CMZA0031+4                                               01221000
BUSYCNT  DC    H'0'                                                     01222000
I        DC    H'0'                                                     01223000
X        DC    H'0'                                                     01224000
@CC02018 DC    C'40'                                                    01225000
PATCH    DC    40F'0'                                                   01226000
GTSTSAVE DS    14F                                                      01227000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01228000
@01      EQU   01                                                       01229000
@02      EQU   02                                                       01230000
@03      EQU   03                                                       01231000
@04      EQU   04                                                       01232000
@05      EQU   05                                                       01233000
@06      EQU   06                                                       01234000
@07      EQU   07                                                       01235000
@08      EQU   08                                                       01236000
@09      EQU   09                                                       01237000
@10      EQU   10                                                       01238000
@11      EQU   11                                                       01239000
@12      EQU   12                                                       01240000
@13      EQU   13                                                       01241000
@14      EQU   14                                                       01242000
@15      EQU   15                                                       01243000
J        EQU   @10                                                      01244000
RCAPTR   EQU   @03                                                      01245000
R0       EQU   @00                                                      01246000
R1       EQU   @01                                                      01247000
R2       EQU   @02                                                      01248000
R3       EQU   @03                                                      01249000
R4       EQU   @04                                                      01250000
R5       EQU   @05                                                      01251000
R12      EQU   @12                                                      01252000
R13      EQU   @13                                                      01253000
R14      EQU   @14                                                      01254000
R15      EQU   @15                                                      01255000
WAPTR    EQU   @02                                                      01256000
RPHPTR   EQU   @01                                                      01257000
GPR00P   EQU   @00                                                      01258000
GPR00F   EQU   @00                                                      01259000
GPR15P   EQU   @15                                                      01260000
GPR15F   EQU   @15                                                      01261000
GPR01P   EQU   @01                                                      01262000
GPR02P   EQU   @02                                                      01263000
GPR03P   EQU   @03                                                      01264000
GPR03F   EQU   @03                                                      01265000
GPR01F   EQU   @01                                                      01266000
GPR02F   EQU   @02                                                      01267000
GPR04F   EQU   @04                                                      01268000
GPR04P   EQU   @04                                                      01269000
GPR05F   EQU   @05                                                      01270000
GPR05P   EQU   @05                                                      01271000
GPR06F   EQU   @06                                                      01272000
GPR06P   EQU   @06                                                      01273000
GPR07F   EQU   @07                                                      01274000
GPR07P   EQU   @07                                                      01275000
GPR08F   EQU   @08                                                      01276000
GPR08P   EQU   @08                                                      01277000
GPR09F   EQU   @09                                                      01278000
GPR09P   EQU   @09                                                      01279000
GPR10F   EQU   @10                                                      01280000
GPR10P   EQU   @10                                                      01281000
GPR11F   EQU   @11                                                      01282000
GPR11P   EQU   @11                                                      01283000
GPR12F   EQU   @12                                                      01284000
GPR12P   EQU   @12                                                      01285000
GPR13F   EQU   @13                                                      01286000
GPR13P   EQU   @13                                                      01287000
GPR14F   EQU   @14                                                      01288000
GPR14P   EQU   @14                                                      01289000
R10      EQU   @10                                                      01290000
R11      EQU   @11                                                      01291000
R6       EQU   @06                                                      01292000
R7       EQU   @07                                                      01293000
R8       EQU   @08                                                      01294000
R9       EQU   @09                                                      01295000
         ENTRY C14C0020                                                 01296000
         ENTRY C14C0030                                                 01297000
ATCLCPTR EQU   1032                                                     01298000
$RCAAREA EQU   0                                                        01299000
$POINTER EQU   $RCAAREA+100                                             01300000
$TOLTEP  EQU   $POINTER                                                 01301000
$FSTAREA EQU   $POINTER+8                                               01302000
$LSTAREA EQU   $POINTER+12                                              01303000
$ABEND   EQU   $POINTER+16                                              01304000
$CLEANP  EQU   $POINTER+20                                              01305000
$TLTECB2 EQU   $POINTER+28                                              01306000
$TRTBLA  EQU   $POINTER+124                                             01307000
$CURRTWA EQU   $POINTER+140                                             01308000
$CONSTNT EQU   $RCAAREA+244                                             01309000
$USECNT  EQU   $CONSTNT                                                 01310000
$RCAFLG  EQU   $RCAAREA+604                                             01311000
$UPDATE  EQU   $RCAFLG                                                  01312000
$CUTESTB EQU   $RCAFLG                                                  01313000
TOLTEPWA EQU   0                                                        01314000
$SCTTBLE EQU   TOLTEPWA                                                 01315000
$TESTOPT EQU   $SCTTBLE+2                                               01316000
$ERROPT  EQU   $SCTTBLE+3                                               01317000
$PDEVFLG EQU   $SCTTBLE+10                                              01318000
$CDSFLGS EQU   $SCTTBLE+11                                              01319000
$CDS8T19 EQU   $SCTTBLE+20                                              01320000
$EXECFLG EQU   $SCTTBLE+33                                              01321000
$CLEANUP EQU   $EXECFLG                                                 01322000
$OLTFLGS EQU   $SCTTBLE+36                                              01323000
$OLTFLG2 EQU   $SCTTBLE+37                                              01324000
$TOTFLG1 EQU   $SCTTBLE+38                                              01325000
$ROUTMSK EQU   $SCTTBLE+40                                              01326000
$CDA     EQU   TOLTEPWA+100                                             01327000
$TFWDPTR EQU   $CDA+8                                                   01328000
$RCA     EQU   $CDA+44                                                  01329000
$OLTPTR  EQU   $CDA+52                                                  01330000
$HIMOREC EQU   $CDA+60                                                  01331000
$R13PTR  EQU   $CDA+80                                                  01332000
$R13PTRT EQU   $CDA+84                                                  01333000
$COMMFLG EQU   TOLTEPWA+224                                             01334000
$FLAG1   EQU   $COMMFLG                                                 01335000
$TEP3RD  EQU   $FLAG1                                                   01336000
$OLTACT  EQU   $FLAG1                                                   01337000
$FLAG2   EQU   $COMMFLG+1                                               01338000
$FLAG3   EQU   $COMMFLG+2                                               01339000
$LOGOFFE EQU   $FLAG3                                                   01340000
$REQSTOR EQU   $FLAG3                                                   01341000
$PRTONLY EQU   $FLAG3                                                   01342000
$FLAG4   EQU   $COMMFLG+3                                               01343000
$CLSSACT EQU   $FLAG4                                                   01344000
$ACTOPND EQU   $FLAG4                                                   01345000
$FLAG5   EQU   $COMMFLG+4                                               01346000
$EOJ     EQU   $FLAG5                                                   01347000
$CANCEL  EQU   $EOJ                                                     01348000
$FLAG6   EQU   $COMMFLG+5                                               01349000
$RECAL11 EQU   $FLAG6                                                   01350000
$ABNDBIT EQU   $FLAG6                                                   01351000
$ABTERM  EQU   $ABNDBIT                                                 01352000
$CIREQ   EQU   $FLAG6                                                   01353000
$FLAG7   EQU   $COMMFLG+6                                               01354000
$EXIOWAT EQU   $FLAG7                                                   01355000
$SNDRFLG EQU   $FLAG7                                                   01356000
$RCVRFLG EQU   $FLAG7                                                   01357000
$FLAG8   EQU   $COMMFLG+7                                               01358000
$TWOWAY  EQU   $FLAG8                                                   01359000
$TCECM   EQU   $FLAG8                                                   01360000
$FLAG9   EQU   $COMMFLG+8                                               01361000
$NOTRRCH EQU   $FLAG9                                                   01362000
$HOLD    EQU   $FLAG9                                                   01363000
$FLAG10  EQU   $COMMFLG+9                                               01364000
$WAITFLG EQU   $FLAG10                                                  01365000
$INBND   EQU   $FLAG10                                                  01366000
$FLAG11  EQU   $COMMFLG+10                                              01367000
$FLAG12  EQU   $COMMFLG+11                                              01368000
$POSTFLG EQU   $FLAG12                                                  01369000
$ENDTEST EQU   $FLAG12                                                  01370000
$VARYINP EQU   $FLAG12                                                  01371000
$FLAG13  EQU   $COMMFLG+12                                              01372000
$LGON    EQU   $FLAG13                                                  01373000
$OLTMACC EQU   $FLAG13                                                  01374000
$TEP1ST  EQU   $FLAG13                                                  01375000
$TEP2ND  EQU   $FLAG13                                                  01376000
$DEVTBLE EQU   TOLTEPWA+240                                             01377000
$DEVCDS  EQU   $DEVTBLE                                                 01378000
$DEVUNAD EQU   $DEVCDS                                                  01379000
@NM00039 EQU   $DEVUNAD+2                                               01380000
$DEVFEAT EQU   $DEVCDS+4                                                01381000
$DEVCDSF EQU   $DEVCDS+9                                                01382000
$DEVSDCF EQU   $DEVCDS+10                                               01383000
$$SYMNME EQU   $DEVCDS+12                                               01384000
$DEVFLG1 EQU   $DEVTBLE+20                                              01385000
$EVNCPLT EQU   $DEVFLG1                                                 01386000
$ATTNEXP EQU   $DEVFLG1                                                 01387000
$INTOCC  EQU   $DEVFLG1                                                 01388000
$DEVFLG2 EQU   $DEVTBLE+21                                              01389000
$TESTMDE EQU   $DEVFLG2                                                 01390000
$DEVTECB EQU   $DEVTBLE+22                                              01391000
$OPIS    EQU   $DEVTECB                                                 01392000
$OPND    EQU   $DEVTECB+2                                               01393000
$DEVFLG3 EQU   $DEVTBLE+27                                              01394000
$SIOFLG  EQU   $DEVFLG3                                                 01395000
$IFTOUT  EQU   $DEVTBLE+36                                              01396000
$DEVSESP EQU   $IFTOUT                                                  01397000
$SSCPDAF EQU   $IFTOUT+6                                                01398000
$LDNCBPT EQU   $DEVTBLE+48                                              01399000
$RNINFO  EQU   $DEVTBLE+56                                              01400000
$LINENME EQU   $RNINFO                                                  01401000
$DEVFLG5 EQU   $RNINFO+8                                                01402000
$DEVFLG4 EQU   $DEVTBLE+65                                              01403000
$DEVCNTS EQU   TOLTEPWA+1464                                            01404000
$SLTBL   EQU   TOLTEPWA+1468                                            01405000
$RUNTEST EQU   $SLTBL+13                                                01406000
$TESTFLG EQU   $SLTBL+21                                                01407000
$SECLST  EQU   $SLTBL+22                                                01408000
#EXITA   EQU   TOLTEPWA+2632                                            01409000
$CCOMDAT EQU   TOLTEPWA+2644                                            01410000
$COUTAD  EQU   $CCOMDAT                                                 01411000
$COUTCT  EQU   $CCOMDAT+4                                               01412000
$CINADR  EQU   $CCOMDAT+8                                               01413000
$CINCT   EQU   $CCOMDAT+12                                              01414000
$CFLGS   EQU   $CCOMDAT+16                                              01415000
$C2WAY   EQU   $CFLGS                                                   01416000
$MACID   EQU   TOLTEPWA+2661                                            01417000
$24FEMSG EQU   TOLTEPWA+2681                                            01418000
$24CATMG EQU   $24FEMSG+11                                              01419000
@NM00048 EQU   TOLTEPWA+2776                                            01420000
$OUNTPTR EQU   @NM00048+4                                               01421000
$NSPTR   EQU   $OUNTPTR                                                 01422000
$NSCNT   EQU   @NM00048+10                                              01423000
$ENXX    EQU   @NM00048+15                                              01424000
$IMITX   EQU   $ENXX                                                    01425000
$RQSTPTR EQU   TOLTEPWA+2808                                            01426000
$RQSTSZE EQU   TOLTEPWA+2812                                            01427000
$R13PR3  EQU   TOLTEPWA+2972                                            01428000
SVESC033 EQU   TOLTEPWA+3160                                            01429000
SVECC013 EQU   TOLTEPWA+3232                                            01430000
SVECC014 EQU   TOLTEPWA+3376                                            01431000
SVEIC002 EQU   TOLTEPWA+3520                                            01432000
SVEIC003 EQU   TOLTEPWA+3592                                            01433000
SVESC022 EQU   TOLTEPWA+3736                                            01434000
SVECC011 EQU   TOLTEPWA+4024                                            01435000
ISTAVT   EQU   0                                                        01436000
ISTRETRG EQU   ISTAVT+44                                                01437000
ISTLOK   EQU   0                                                        01438000
LOKCHN   EQU   ISTLOK+1                                                 01439000
LOKCHNG  EQU   LOKCHN                                                   01440000
@NM00052 EQU   LOKCHNG+2                                                01441000
ISTPAB   EQU   0                                                        01442000
PABWQCHN EQU   ISTPAB                                                   01443000
PABWEQA  EQU   PABWQCHN                                                 01444000
PABCHAIN EQU   PABWQCHN+4                                               01445000
PABRUNNG EQU   PABCHAIN                                                 01446000
PABRPHFG EQU   ISTPAB+12                                                01447000
PABFLAGS EQU   PABRPHFG                                                 01448000
PABERLCK EQU   PABFLAGS                                                 01449000
PABERRLK EQU   PABERLCK                                                 01450000
PABEND   EQU   ISTPAB+16                                                01451000
ISTDYPAB EQU   0                                                        01452000
DYPCHAIN EQU   ISTDYPAB+4                                               01453000
DYPPACMD EQU   ISTDYPAB+12                                              01454000
ISTRPH   EQU   0                                                        01455000
RPHCNTL  EQU   ISTRPH                                                   01456000
RPHFLAGS EQU   RPHCNTL+2                                                01457000
RPHFSTLC EQU   RPHFLAGS                                                 01458000
RPHFLGB  EQU   RPHCNTL+3                                                01459000
RPHRPHA  EQU   ISTRPH+4                                                 01460000
RPHTSKID EQU   ISTRPH+8                                                 01461000
RPHRESMA EQU   ISTRPH+16                                                01462000
RPHWPFLG EQU   RPHRESMA                                                 01463000
RPHWEA   EQU   ISTRPH+24                                                01464000
RPHCSPA  EQU   RPHWEA                                                   01465000
RPHSRPRM EQU   ISTRPH+28                                                01466000
RPHPABQA EQU   ISTRPH+36                                                01467000
RPHWORK  EQU   ISTRPH+40                                                01468000
RPHSAVE1 EQU   RPHWORK                                                  01469000
RPHSBITS EQU   RPHSAVE1+1                                               01470000
ISTATCVT EQU   0                                                        01471000
ATCRPTCH EQU   ISTATCVT                                                 01472000
ATCITFLD EQU   ISTATCVT+8                                               01473000
ATCITCDS EQU   ATCITFLD+8                                               01474000
ATCITFLG EQU   ATCITCDS+4                                               01475000
ATCITRA1 EQU   ATCITFLG+2                                               01476000
ATCSMPAB EQU   ISTATCVT+88                                              01477000
ATCVDPAB EQU   ISTATCVT+152                                             01478000
ATCLDTIL EQU   ISTATCVT+408                                             01479000
ATCGTSTR EQU   ISTATCVT+608                                             01480000
ATCLUDVT EQU   ISTATCVT+768                                             01481000
ATCANYDT EQU   ISTATCVT+776                                             01482000
@NM00062 EQU   ISTATCVT+780                                             01483000
ATCPODVT EQU   ISTATCVT+804                                             01484000
ATCSTAT  EQU   ISTATCVT+936                                             01485000
ATCSTAT1 EQU   ATCSTAT                                                  01486000
ATCPOFLG EQU   ATCSTAT+2                                                01487000
ATCSTAT4 EQU   ATCSTAT+3                                                01488000
ATCMTST  EQU   ATCSTAT4                                                 01489000
ATCBITAN EQU   ISTATCVT+940                                             01490000
ATCFLAG2 EQU   ATCBITAN+1                                               01491000
ATCONID  EQU   ISTATCVT+944                                             01492000
ATCSSCPA EQU   ISTATCVT+948                                             01493000
ATCECTLP EQU   ISTATCVT+1000                                            01494000
ATCHPGM  EQU   ISTATCVT+1012                                            01495000
ATCVLCNT EQU   ISTATCVT+1016                                            01496000
ATCRNO   EQU   ISTATCVT+1020                                            01497000
@NM00085 EQU   ISTATCVT+1028                                            01498000
ATCSHRFG EQU   @NM00085+8                                               01499000
ATCCPDVT EQU   ISTATCVT+1096                                            01500000
ATCSMSDQ EQU   ISTATCVT+1140                                            01501000
ATCRID   EQU   ISTATCVT+1152                                            01502000
ATCLDAPP EQU   ISTATCVT+1288                                            01503000
ATCSQAFR EQU   ISTATCVT+1312                                            01504000
ATCORTCB EQU   ATCSQAFR+4                                               01505000
ATCORSRB EQU   ATCORTCB                                                 01506000
ATCICAPP EQU   ISTATCVT+1320                                            01507000
ATCDAPVT EQU   ISTATCVT+1340                                            01508000
ATCGSRBQ EQU   ISTATCVT+1472                                            01509000
ATCGSRBG EQU   ATCGSRBQ                                                 01510000
ATCENFLG EQU   ISTATCVT+1512                                            01511000
@NM00100 EQU   ISTATCVT+1575                                            01512000
ATCVTFLG EQU   ISTATCVT+1576                                            01513000
ATCZFLAG EQU   ISTATCVT+1696                                            01514000
ATCCRA   EQU   ISTATCVT+1720                                            01515000
ATCCRACN EQU   ATCCRA+4                                                 01516000
ATCSRB   EQU   ISTATCVT+1728                                            01517000
ATCSRBCN EQU   ATCSRB+4                                                 01518000
ATCCRPL  EQU   ISTATCVT+1736                                            01519000
ATCRPLCN EQU   ATCCRPL+4                                                01520000
CVTMAP   EQU   0                                                        01521000
CVTDAR   EQU   CVTMAP+72                                                01522000
CVTFLGS1 EQU   CVTDAR                                                   01523000
CVTDCB   EQU   CVTMAP+116                                               01524000
CVTIERLC EQU   CVTMAP+144                                               01525000
CVTOPTA  EQU   CVTMAP+182                                               01526000
CVTOPTB  EQU   CVTMAP+183                                               01527000
CVTGTF   EQU   CVTMAP+236                                               01528000
CVTGTFST EQU   CVTGTF                                                   01529000
CVTGTFS  EQU   CVTGTFST                                                 01530000
CVTSTATE EQU   CVTGTFST                                                 01531000
CVTTMODE EQU   CVTGTFST                                                 01532000
CVTFORM  EQU   CVTGTFST                                                 01533000
CVTAQAVT EQU   CVTMAP+240                                               01534000
CVTTCMFG EQU   CVTAQAVT                                                 01535000
CVTVOLM2 EQU   CVTMAP+244                                               01536000
CVTTATA  EQU   CVTVOLM2                                                 01537000
CVTTSKS  EQU   CVTTATA                                                  01538000
CVTVOLF2 EQU   CVTTSKS                                                  01539000
CVTTAT   EQU   CVTTATA+1                                                01540000
CVTATER  EQU   CVTMAP+248                                               01541000
CVTEXT1  EQU   CVTMAP+252                                               01542000
CVTPURG  EQU   CVTMAP+260                                               01543000
CVTQMSG  EQU   CVTMAP+268                                               01544000
CVTDMSR  EQU   CVTMAP+272                                               01545000
CVTRSV37 EQU   CVTDMSR                                                  01546000
CVTDMSRF EQU   CVTRSV37                                                 01547000
CVTERPV  EQU   CVTMAP+316                                               01548000
CVTINTLA EQU   CVTMAP+320                                               01549000
CVTAPF   EQU   CVTMAP+324                                               01550000
CVTEXT2  EQU   CVTMAP+328                                               01551000
CVTHJES  EQU   CVTMAP+332                                               01552000
CVTPGSIA EQU   CVTMAP+348                                               01553000
CVTA1F1  EQU   CVTMAP+356                                               01554000
CVTSYSK  EQU   CVTMAP+357                                               01555000
CVTVOLM1 EQU   CVTMAP+380                                               01556000
CVTVOLF1 EQU   CVTVOLM1                                                 01557000
CVTXTNT1 EQU   0                                                        01558000
CVTXTNT2 EQU   0                                                        01559000
CVTDSSV  EQU   CVTXTNT2                                                 01560000
CVTFLGBT EQU   CVTXTNT2+5                                               01561000
CVTQID   EQU   CVTXTNT2+24                                              01562000
CVTRV400 EQU   CVTXTNT2+52                                              01563000
CVTRV409 EQU   CVTXTNT2+53                                              01564000
CVTATCVT EQU   CVTXTNT2+64                                              01565000
CVTRV429 EQU   CVTXTNT2+84                                              01566000
CVTRV438 EQU   CVTXTNT2+85                                              01567000
CVTRV457 EQU   CVTXTNT2+112                                             01568000
CVTRV466 EQU   CVTXTNT2+113                                             01569000
CVTFIX   EQU   0                                                        01570000
CVTRELNO EQU   CVTFIX+252                                               01571000
INPARM   EQU   0                                                        01572000
FLAGS    EQU   INPARM                                                   01573000
LEVEL    EQU   INPARM+1                                                 01574000
IDVAL    EQU   INPARM+2                                                 01575000
SMVECTOR EQU   0                                                        01576000
SMID     EQU   SMVECTOR                                                 01577000
SMLLEVL  EQU   SMVECTOR+2                                               01578000
SMHLEVL  EQU   SMVECTOR+3                                               01579000
SMPTR    EQU   SMVECTOR+4                                               01580000
BACKSAVE EQU   0                                                        01581000
REPLYSZE EQU   0                                                        01582000
$TRTBL   EQU   0                                                        01583000
#EXIT    EQU   0                                                        01584000
ISTXDYP  EQU   0                                                        01585000
ISTXPAB  EQU   0                                                        01586000
PABXTNSN EQU   PABEND                                                   01587000
CVTS01   EQU   CVTPGSIA                                                 01588000
CVTLPDIA EQU   CVTS01+12                                                01589000
CVTDIRST EQU   CVTLPDIA                                                 01590000
CVTSLIDA EQU   CVTS01+24                                                01591000
CVTCTLFG EQU   CVTS01+50                                                01592000
CVTRV210 EQU   CVTS01+424                                               01593000
CVTRV219 EQU   CVTS01+425                                               01594000
CVTRV228 EQU   CVTS01+426                                               01595000
CVTRV237 EQU   CVTS01+427                                               01596000
CVTMFRTR EQU   CVTS01+452                                               01597000
CVTRV262 EQU   CVTS01+468                                               01598000
CVTRV271 EQU   CVTS01+469                                               01599000
CVTRV280 EQU   CVTS01+470                                               01600000
CVTRV289 EQU   CVTS01+471                                               01601000
CVTGSDA  EQU   CVTS01+600                                               01602000
SVECC012 EQU   SVESC022                                                 01603000
SVEIC00A EQU   SVEIC003                                                 01604000
SVEIC004 EQU   SVEIC003                                                 01605000
SVEIC005 EQU   SVEIC003                                                 01606000
SVESC02A EQU   SVESC022                                                 01607000
SVESC02B EQU   SVESC022                                                 01608000
SVESC02D EQU   SVESC022                                                 01609000
SVESC02E EQU   SVESC022                                                 01610000
SVESC02F EQU   SVECC013                                                 01611000
SVESC024 EQU   SVESC022                                                 01612000
SVESC027 EQU   SVESC022                                                 01613000
SVESC029 EQU   SVESC033                                                 01614000
SVESC031 EQU   SVECC013                                                 01615000
SVESC032 EQU   SVECC011                                                 01616000
SVETC037 EQU   SVEIC003                                                 01617000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01618000
CVTRV628 EQU   CVTS01+728                                               01619000
CVTRV627 EQU   CVTS01+724                                               01620000
CVTRV626 EQU   CVTS01+720                                               01621000
CVTRV625 EQU   CVTS01+716                                               01622000
CVTRV624 EQU   CVTS01+712                                               01623000
CVTRV623 EQU   CVTS01+708                                               01624000
CVTRV622 EQU   CVTS01+704                                               01625000
CVTRV621 EQU   CVTS01+700                                               01626000
CVTIHASU EQU   CVTS01+696                                               01627000
CVTSUSP  EQU   CVTS01+692                                               01628000
CVTT6SVC EQU   CVTS01+688                                               01629000
CVTCDAL  EQU   CVTS01+684                                               01630000
CVTTCTL  EQU   CVTS01+680                                               01631000
CVTRSUME EQU   CVTS01+676                                               01632000
CVTJTERM EQU   CVTS01+672                                               01633000
CVTASMRM EQU   CVTS01+668                                               01634000
CVTTCASP EQU   CVTS01+664                                               01635000
CVT0PT03 EQU   CVTS01+660                                               01636000
CVT0PT0E EQU   CVTS01+656                                               01637000
CVTRV609 EQU   CVTS01+652                                               01638000
CVTCGK   EQU   CVTS01+648                                               01639000
CVTRAC   EQU   CVTS01+644                                               01640000
CVTRV606 EQU   CVTS01+640                                               01641000
CVTRV605 EQU   CVTS01+636                                               01642000
CVTRV604 EQU   CVTS01+632                                               01643000
CVTEFF02 EQU   CVTS01+628                                               01644000
CVTCBBR  EQU   CVTS01+624                                               01645000
CVTSSCR  EQU   CVTS01+620                                               01646000
CVTEVENT EQU   CVTS01+616                                               01647000
CVTCRCA  EQU   CVTS01+612                                               01648000
CVTTPIO  EQU   CVTS01+608                                               01649000
CVTADV   EQU   CVTS01+604                                               01650000
CVTGSDAB EQU   CVTGSDA                                                  01651000
CVTQV3   EQU   CVTS01+596                                               01652000
CVTQV2   EQU   CVTS01+592                                               01653000
CVTQV1   EQU   CVTS01+588                                               01654000
CVTRPT   EQU   CVTS01+584                                               01655000
CVTSSRB  EQU   CVTS01+580                                               01656000
CVTCSDRL EQU   CVTS01+576                                               01657000
CVTEXP1  EQU   CVTS01+572                                               01658000
CVTRMPMT EQU   CVTS01+568                                               01659000
CVTRMPTT EQU   CVTS01+564                                               01660000
CVTVPSA  EQU   CVTS01+560                                               01661000
CVTVSTOP EQU   CVTS01+556                                               01662000
CVTGTFR8 EQU   CVTS01+552                                               01663000
CVTQUIT  EQU   CVTS01+548                                               01664000
CVTVACR  EQU   CVTS01+544                                               01665000
CVTWTCB  EQU   CVTS01+540                                               01666000
CVTSTPRS EQU   CVTS01+536                                               01667000
CVT0PT02 EQU   CVTS01+532                                               01668000
CVTDARCM EQU   CVTS01+528                                               01669000
CVTIRECM EQU   CVTS01+524                                               01670000
CVTJRECM EQU   CVTS01+520                                               01671000
CVTVEMS0 EQU   CVTS01+516                                               01672000
CVTSPFRR EQU   CVTS01+512                                               01673000
CVTRLSTG EQU   CVTS01+508                                               01674000
CVT0TC0A EQU   CVTS01+504                                               01675000
CVTGMBR  EQU   CVTS01+500                                               01676000
CVTLFRM  EQU   CVTS01+496                                               01677000
CVTRMBR  EQU   CVTS01+492                                               01678000
CVTVIOP  EQU   CVTS01+488                                               01679000
CVTRV307 EQU   CVTS01+486                                               01680000
CVTRV306 EQU   CVTS01+484                                               01681000
CVTRV305 EQU   CVTS01+482                                               01682000
CVTRV304 EQU   CVTS01+480                                               01683000
CVTRV303 EQU   CVTS01+478                                               01684000
CVTRV302 EQU   CVTS01+476                                               01685000
CVTTRCA  EQU   CVTS01+472                                               01686000
CVTRV297 EQU   CVTRV289                                                 01687000
CVTRV296 EQU   CVTRV289                                                 01688000
CVTRV295 EQU   CVTRV289                                                 01689000
CVTRV294 EQU   CVTRV289                                                 01690000
CVTRV293 EQU   CVTRV289                                                 01691000
CVTRV292 EQU   CVTRV289                                                 01692000
CVTRV291 EQU   CVTRV289                                                 01693000
CVTRV290 EQU   CVTRV289                                                 01694000
CVTRV288 EQU   CVTRV280                                                 01695000
CVTRV287 EQU   CVTRV280                                                 01696000
CVTRV286 EQU   CVTRV280                                                 01697000
CVTRV285 EQU   CVTRV280                                                 01698000
CVTRV284 EQU   CVTRV280                                                 01699000
CVTRV283 EQU   CVTRV280                                                 01700000
CVTRV282 EQU   CVTRV280                                                 01701000
CVTRV281 EQU   CVTRV280                                                 01702000
CVTRV279 EQU   CVTRV271                                                 01703000
CVTRV278 EQU   CVTRV271                                                 01704000
CVTRV277 EQU   CVTRV271                                                 01705000
CVTRV276 EQU   CVTRV271                                                 01706000
CVTRV275 EQU   CVTRV271                                                 01707000
CVTRV274 EQU   CVTRV271                                                 01708000
CVTRV273 EQU   CVTRV271                                                 01709000
CVTRV272 EQU   CVTRV271                                                 01710000
CVTRV270 EQU   CVTRV262                                                 01711000
CVTRV269 EQU   CVTRV262                                                 01712000
CVTRV268 EQU   CVTRV262                                                 01713000
CVTRV267 EQU   CVTRV262                                                 01714000
CVTRV266 EQU   CVTRV262                                                 01715000
CVTRV265 EQU   CVTRV262                                                 01716000
CVTRV264 EQU   CVTRV262                                                 01717000
CVTRV263 EQU   CVTRV262                                                 01718000
CVTVFP   EQU   CVTS01+464                                               01719000
CVTVSI   EQU   CVTS01+460                                               01720000
CVTVPSIB EQU   CVTS01+456                                               01721000
CVTMFACT EQU   CVTMFRTR                                                 01722000
CVTMFCTL EQU   CVTS01+448                                               01723000
CVTPVBP  EQU   CVTS01+444                                               01724000
CVTPWI   EQU   CVTS01+440                                               01725000
CVTRV254 EQU   CVTS01+438                                               01726000
CVTRV253 EQU   CVTS01+436                                               01727000
CVTRV252 EQU   CVTS01+434                                               01728000
CVTRV251 EQU   CVTS01+433                                               01729000
CVTRV250 EQU   CVTS01+432                                               01730000
CVTRV249 EQU   CVTS01+431                                               01731000
CVTRV248 EQU   CVTS01+430                                               01732000
CVTRV247 EQU   CVTS01+429                                               01733000
CVTRV246 EQU   CVTS01+428                                               01734000
CVTRV245 EQU   CVTRV237                                                 01735000
CVTRV244 EQU   CVTRV237                                                 01736000
CVTRV243 EQU   CVTRV237                                                 01737000
CVTRV242 EQU   CVTRV237                                                 01738000
CVTRV241 EQU   CVTRV237                                                 01739000
CVTRV240 EQU   CVTRV237                                                 01740000
CVTRV239 EQU   CVTRV237                                                 01741000
CVTRV238 EQU   CVTRV237                                                 01742000
CVTRV236 EQU   CVTRV228                                                 01743000
CVTRV235 EQU   CVTRV228                                                 01744000
CVTRV234 EQU   CVTRV228                                                 01745000
CVTRV233 EQU   CVTRV228                                                 01746000
CVTRV232 EQU   CVTRV228                                                 01747000
CVTRV231 EQU   CVTRV228                                                 01748000
CVTRV230 EQU   CVTRV228                                                 01749000
CVTRV229 EQU   CVTRV228                                                 01750000
CVTRV227 EQU   CVTRV219                                                 01751000
CVTRV226 EQU   CVTRV219                                                 01752000
CVTRV225 EQU   CVTRV219                                                 01753000
CVTRV224 EQU   CVTRV219                                                 01754000
CVTRV223 EQU   CVTRV219                                                 01755000
CVTRV222 EQU   CVTRV219                                                 01756000
CVTRV221 EQU   CVTRV219                                                 01757000
CVTRV220 EQU   CVTRV219                                                 01758000
CVTRV218 EQU   CVTRV210                                                 01759000
CVTRV217 EQU   CVTRV210                                                 01760000
CVTRV216 EQU   CVTRV210                                                 01761000
CVTRV215 EQU   CVTRV210                                                 01762000
CVTRV214 EQU   CVTRV210                                                 01763000
CVTRV213 EQU   CVTRV210                                                 01764000
CVTRV212 EQU   CVTRV210                                                 01765000
CVTRV211 EQU   CVTRV210                                                 01766000
CVTLCCAT EQU   CVTS01+420                                               01767000
CVTPCCAT EQU   CVTS01+416                                               01768000
CVTIPCRP EQU   CVTS01+412                                               01769000
CVTIPCRI EQU   CVTS01+408                                               01770000
CVTIPCDS EQU   CVTS01+404                                               01771000
CVTAIDVT EQU   CVTS01+400                                               01772000
CVTSSAP  EQU   CVTS01+396                                               01773000
CVTEHCIR EQU   CVTS01+392                                               01774000
CVTEHDEF EQU   CVTS01+388                                               01775000
CVTDAIR  EQU   CVTS01+384                                               01776000
CVTPERFM EQU   CVTS01+380                                               01777000
CVT044R2 EQU   CVTS01+376                                               01778000
CVTFETCH EQU   CVTS01+372                                               01779000
CVTRSTWD EQU   CVTS01+368                                               01780000
CVTSPOST EQU   CVTS01+364                                               01781000
CVTIOBP  EQU   CVTS01+360                                               01782000
CVTASMVT EQU   CVTS01+356                                               01783000
CVTRECRQ EQU   CVTS01+352                                               01784000
CVTWSAC  EQU   CVTS01+348                                               01785000
CVTRV149 EQU   CVTS01+344                                               01786000
CVTWSAL  EQU   CVTS01+340                                               01787000
CVTSPSA  EQU   CVTS01+336                                               01788000
CVTGLMN  EQU   CVTS01+332                                               01789000
CVTVEAC0 EQU   CVTS01+328                                               01790000
CVT062R1 EQU   CVTS01+324                                               01791000
CVTRPOST EQU   CVTS01+320                                               01792000
CVTDQIQE EQU   CVTS01+316                                               01793000
CVTCSD   EQU   CVTS01+312                                               01794000
CVTLKRMA EQU   CVTS01+308                                               01795000
CVTRSPIE EQU   CVTS01+304                                               01796000
CVTRENQ  EQU   CVTS01+300                                               01797000
CVTLQCB  EQU   CVTS01+296                                               01798000
CVTFQCB  EQU   CVTS01+292                                               01799000
CVTQCS01 EQU   CVTS01+288                                               01800000
CVTAPFT  EQU   CVTS01+284                                               01801000
CVTPARRL EQU   CVTS01+280                                               01802000
CVTVWAIT EQU   CVTS01+276                                               01803000
CVTGSPL  EQU   CVTS01+272                                               01804000
CVTLSMQ  EQU   CVTS01+268                                               01805000
CVTGSMQ  EQU   CVTS01+264                                               01806000
CVTEXPRO EQU   CVTS01+260                                               01807000
CVTOPCTP EQU   CVTS01+256                                               01808000
CVTSIC   EQU   CVTS01+252                                               01809000
CVTTPIOS EQU   CVTS01+248                                               01810000
CVTRTMS  EQU   CVTS01+244                                               01811000
CVTSDBF  EQU   CVTS01+240                                               01812000
CVTSCBP  EQU   CVTS01+236                                               01813000
CVTSDMP  EQU   CVTS01+232                                               01814000
CVTSV60  EQU   CVTS01+228                                               01815000
CVTRTMCT EQU   CVTS01+224                                               01816000
CVTASCBL EQU   CVTS01+220                                               01817000
CVTASCBH EQU   CVTS01+216                                               01818000
CVTGDA   EQU   CVTS01+212                                               01819000
CVTASVT  EQU   CVTS01+208                                               01820000
CVTVVMDI EQU   CVTS01+204                                               01821000
CVTAQTOP EQU   CVTS01+200                                               01822000
CVTIOSCS EQU   CVTS01+196                                               01823000
CVTSDRM  EQU   CVTS01+192                                               01824000
CVTOPTE  EQU   CVTS01+188                                               01825000
CVTSTXU  EQU   CVTS01+184                                               01826000
CVTQUIS  EQU   CVTS01+180                                               01827000
CVTPARS  EQU   CVTS01+176                                               01828000
CVTS1EE  EQU   CVTS01+172                                               01829000
CVTFRAS  EQU   CVTS01+168                                               01830000
CVTQSAS  EQU   CVTS01+164                                               01831000
CVTCRAS  EQU   CVTS01+160                                               01832000
CVTCRMN  EQU   CVTS01+156                                               01833000
CVTDELCP EQU   CVTS01+152                                               01834000
CVTFRECL EQU   CVTS01+148                                               01835000
CVTGETCL EQU   CVTS01+144                                               01836000
CVTBLDCP EQU   CVTS01+140                                               01837000
CVTAUTHL EQU   CVTS01+136                                               01838000
CVTSCAN  EQU   CVTS01+132                                               01839000
CVTRV144 EQU   CVTS01+130                                               01840000
CVTMAXMP EQU   CVTS01+128                                               01841000
CVTSTCK  EQU   CVTS01+124                                               01842000
CVTRV139 EQU   CVTS01+123                                               01843000
CVTDSSAC EQU   CVTS01+122                                               01844000
CVTRV513 EQU   CVTS01+121                                               01845000
CVTIOSPL EQU   CVTS01+120                                               01846000
CVTPTGT  EQU   CVTS01+116                                               01847000
CVTCSPIE EQU   CVTS01+112                                               01848000
CVTSMFEX EQU   CVTS01+108                                               01849000
CVTOLT0A EQU   CVTS01+104                                               01850000
CVTSRBRT EQU   CVTS01+100                                               01851000
CVTPUTL  EQU   CVTS01+96                                                01852000
CVTASCRL EQU   CVTS01+92                                                01853000
CVTASCRF EQU   CVTS01+88                                                01854000
CVTRV326 EQU   CVTS01+84                                                01855000
CVTRV325 EQU   CVTS01+80                                                01856000
CVTRV324 EQU   CVTS01+76                                                01857000
CVT0VL01 EQU   CVTS01+72                                                01858000
CVTSHRVM EQU   CVTS01+68                                                01859000
CVTRV332 EQU   CVTS01+64                                                01860000
CVTTAS   EQU   CVTS01+60                                                01861000
CVTRSCN  EQU   CVTS01+56                                                01862000
CVTTRAC2 EQU   CVTS01+54                                                01863000
CVTTRACE EQU   CVTS01+52                                                01864000
CVTAPG   EQU   CVTS01+51                                                01865000
CVTSDTRC EQU   CVTCTLFG                                                 01866000
CVTGTRCE EQU   CVTCTLFG                                                 01867000
CVTNOMP  EQU   CVTCTLFG                                                 01868000
CVTRSV79 EQU   CVTCTLFG                                                 01869000
CVTDSTAT EQU   CVTCTLFG                                                 01870000
CVTRSV78 EQU   CVTCTLFG                                                 01871000
CVTRV333 EQU   CVTCTLFG                                                 01872000
CVTRV323 EQU   CVTCTLFG                                                 01873000
CVTSPVLK EQU   CVTS01+49                                                01874000
CVTRSV77 EQU   CVTS01+48                                                01875000
CVTRV331 EQU   CVTS01+44                                                01876000
CVTRV330 EQU   CVTS01+40                                                01877000
CVTRV329 EQU   CVTS01+36                                                01878000
CVTRV328 EQU   CVTS01+32                                                01879000
CVTRV322 EQU   CVTS01+28                                                01880000
CVTSLID  EQU   CVTSLIDA+1                                               01881000
CVTSYLK  EQU   CVTSLIDA                                                 01882000
CVTRV321 EQU   CVTS01+20                                                01883000
CVTRV320 EQU   CVTS01+16                                                01884000
CVTLPDIR EQU   CVTLPDIA+1                                               01885000
CVTRSV69 EQU   CVTDIRST                                                 01886000
CVTRSV68 EQU   CVTDIRST                                                 01887000
CVTRSV67 EQU   CVTDIRST                                                 01888000
CVTRSV66 EQU   CVTDIRST                                                 01889000
CVTRSV65 EQU   CVTDIRST                                                 01890000
CVTRSV64 EQU   CVTDIRST                                                 01891000
CVTRSV63 EQU   CVTDIRST                                                 01892000
CVTDICOM EQU   CVTDIRST                                                 01893000
CVTPVTP  EQU   CVTS01+8                                                 01894000
CVTLPDSR EQU   CVTS01+4                                                 01895000
CVTGETL  EQU   CVTS01                                                   01896000
@NM00054 EQU   PABXTNSN+12                                              01897000
PABNPSSQ EQU   PABXTNSN+8                                               01898000
PABLOCK  EQU   PABXTNSN+4                                               01899000
PABLAST  EQU   PABXTNSN                                                 01900000
CVTLEVL  EQU   CVTRELNO+2                                               01901000
CVTNUMB  EQU   CVTRELNO                                                 01902000
CVTMDL   EQU   CVTFIX+250                                               01903000
@NM00111 EQU   CVTFIX+248                                               01904000
@NM00110 EQU   CVTFIX                                                   01905000
CVTRV482 EQU   CVTXTNT2+128                                             01906000
CVTRV481 EQU   CVTXTNT2+124                                             01907000
CVTRV480 EQU   CVTXTNT2+120                                             01908000
CVTRV479 EQU   CVTXTNT2+118                                             01909000
CVTRV478 EQU   CVTXTNT2+117                                             01910000
CVTRV477 EQU   CVTXTNT2+116                                             01911000
CVTRV476 EQU   CVTXTNT2+115                                             01912000
CVTRV475 EQU   CVTXTNT2+114                                             01913000
CVTRV474 EQU   CVTRV466                                                 01914000
CVTRV473 EQU   CVTRV466                                                 01915000
CVTRV472 EQU   CVTRV466                                                 01916000
CVTRV471 EQU   CVTRV466                                                 01917000
CVTRV470 EQU   CVTRV466                                                 01918000
CVTRV469 EQU   CVTRV466                                                 01919000
CVTRV468 EQU   CVTRV466                                                 01920000
CVTRV467 EQU   CVTRV466                                                 01921000
CVTRV465 EQU   CVTRV457                                                 01922000
CVTRV464 EQU   CVTRV457                                                 01923000
CVTRV463 EQU   CVTRV457                                                 01924000
CVTRV462 EQU   CVTRV457                                                 01925000
CVTRV461 EQU   CVTRV457                                                 01926000
CVTRV460 EQU   CVTRV457                                                 01927000
CVTRV459 EQU   CVTRV457                                                 01928000
CVTRV458 EQU   CVTRV457                                                 01929000
CVTRV456 EQU   CVTXTNT2+108                                             01930000
CVTRV455 EQU   CVTXTNT2+104                                             01931000
CVTRV454 EQU   CVTXTNT2+100                                             01932000
CVTRV453 EQU   CVTXTNT2+96                                              01933000
CVTRV452 EQU   CVTXTNT2+94                                              01934000
CVTRV451 EQU   CVTXTNT2+92                                              01935000
CVTRV450 EQU   CVTXTNT2+90                                              01936000
CVTRV449 EQU   CVTXTNT2+88                                              01937000
CVTRV448 EQU   CVTXTNT2+87                                              01938000
CVTRV447 EQU   CVTXTNT2+86                                              01939000
CVTRV446 EQU   CVTRV438                                                 01940000
CVTRV445 EQU   CVTRV438                                                 01941000
CVTRV444 EQU   CVTRV438                                                 01942000
CVTRV443 EQU   CVTRV438                                                 01943000
CVTRV442 EQU   CVTRV438                                                 01944000
CVTRV441 EQU   CVTRV438                                                 01945000
CVTRV440 EQU   CVTRV438                                                 01946000
CVTRV439 EQU   CVTRV438                                                 01947000
CVTRV437 EQU   CVTRV429                                                 01948000
CVTRV436 EQU   CVTRV429                                                 01949000
CVTRV435 EQU   CVTRV429                                                 01950000
CVTRV434 EQU   CVTRV429                                                 01951000
CVTRV433 EQU   CVTRV429                                                 01952000
CVTRV432 EQU   CVTRV429                                                 01953000
CVTRV431 EQU   CVTRV429                                                 01954000
CVTRV430 EQU   CVTRV429                                                 01955000
CVTRV428 EQU   CVTXTNT2+80                                              01956000
CVTRV427 EQU   CVTXTNT2+76                                              01957000
CVTRV426 EQU   CVTXTNT2+72                                              01958000
CVTRV425 EQU   CVTXTNT2+68                                              01959000
CVTATACT EQU   CVTATCVT                                                 01960000
CVTRV423 EQU   CVTXTNT2+62                                              01961000
CVTRV422 EQU   CVTXTNT2+60                                              01962000
CVTRV421 EQU   CVTXTNT2+58                                              01963000
CVTRV420 EQU   CVTXTNT2+56                                              01964000
CVTRV419 EQU   CVTXTNT2+55                                              01965000
CVTRV418 EQU   CVTXTNT2+54                                              01966000
CVTRV417 EQU   CVTRV409                                                 01967000
CVTRV416 EQU   CVTRV409                                                 01968000
CVTRV415 EQU   CVTRV409                                                 01969000
CVTRV414 EQU   CVTRV409                                                 01970000
CVTRV413 EQU   CVTRV409                                                 01971000
CVTRV412 EQU   CVTRV409                                                 01972000
CVTRV411 EQU   CVTRV409                                                 01973000
CVTRV410 EQU   CVTRV409                                                 01974000
CVTRV408 EQU   CVTRV400                                                 01975000
CVTRV407 EQU   CVTRV400                                                 01976000
CVTRV406 EQU   CVTRV400                                                 01977000
CVTRV405 EQU   CVTRV400                                                 01978000
CVTRV404 EQU   CVTRV400                                                 01979000
CVTRV403 EQU   CVTRV400                                                 01980000
CVTRV402 EQU   CVTRV400                                                 01981000
CVTRV401 EQU   CVTRV400                                                 01982000
CVTICB   EQU   CVTXTNT2+48                                              01983000
CVTSKTA  EQU   CVTXTNT2+44                                              01984000
CVTCCVT  EQU   CVTXTNT2+40                                              01985000
CVTRSV98 EQU   CVTXTNT2+36                                              01986000
CVTRSV97 EQU   CVTXTNT2+34                                              01987000
CVTRSV96 EQU   CVTXTNT2+32                                              01988000
CVTOLTEP EQU   CVTXTNT2+28                                              01989000
CVTQIDA  EQU   CVTQID+1                                                 01990000
CVTRSV95 EQU   CVTQID                                                   01991000
CVTRSV94 EQU   CVTXTNT2+20                                              01992000
CVTRSV93 EQU   CVTXTNT2+16                                              01993000
CVTRSV92 EQU   CVTXTNT2+12                                              01994000
CVTDEBVR EQU   CVTXTNT2+8                                               01995000
CVTRSV91 EQU   CVTXTNT2+6                                               01996000
CVTRSV9H EQU   CVTFLGBT                                                 01997000
CVTRSV9G EQU   CVTFLGBT                                                 01998000
CVTRSV9F EQU   CVTFLGBT                                                 01999000
CVTRSV9E EQU   CVTFLGBT                                                 02000000
CVTRSV9D EQU   CVTFLGBT                                                 02001000
CVTBAH   EQU   CVTFLGBT                                                 02002000
CVTVME   EQU   CVTFLGBT                                                 02003000
CVTNPE   EQU   CVTFLGBT                                                 02004000
CVTNUCLS EQU   CVTXTNT2+4                                               02005000
CVTDSSVA EQU   CVTDSSV+1                                                02006000
CVTRSV89 EQU   CVTDSSV                                                  02007000
CVTRSV88 EQU   CVTXTNT1+8                                               02008000
CVTRSV87 EQU   CVTXTNT1+4                                               02009000
CVTFACHN EQU   CVTXTNT1                                                 02010000
CVTRV488 EQU   CVTMAP+412                                               02011000
CVTRV487 EQU   CVTMAP+408                                               02012000
CVTRV486 EQU   CVTMAP+404                                               02013000
CVTRV485 EQU   CVTMAP+400                                               02014000
CVTACTAP EQU   CVTMAP+396                                               02015000
CVTAUTH  EQU   CVTMAP+392                                               02016000
CVTRV490 EQU   CVTMAP+388                                               02017000
CVTSU    EQU   CVTMAP+384                                               02018000
CVTVOLT1 EQU   CVTVOLM1+1                                               02019000
CVTVOLI1 EQU   CVTVOLF1                                                 02020000
CVTSTOA  EQU   CVTMAP+376                                               02021000
CVTRSV58 EQU   CVTMAP+374                                               02022000
CVTRSV57 EQU   CVTMAP+372                                               02023000
CVTDDCE  EQU   CVTMAP+368                                               02024000
CVTPNWFR EQU   CVTMAP+364                                               02025000
CVTSMF   EQU   CVTMAP+360                                               02026000
CVTSULK  EQU   CVTMAP+358                                               02027000
CVTSLKO  EQU   CVTSYSK                                                  02028000
CVTSLKP  EQU   CVTSYSK                                                  02029000
CVTSLKQ  EQU   CVTSYSK                                                  02030000
CVTSLKR  EQU   CVTSYSK                                                  02031000
CVTRSV56 EQU   CVTSYSK                                                  02032000
CVTRSV55 EQU   CVTSYSK                                                  02033000
CVTRSV54 EQU   CVTSYSK                                                  02034000
CVTRSV53 EQU   CVTSYSK                                                  02035000
CVTRSV52 EQU   CVTA1F1                                                  02036000
CVTRSV51 EQU   CVTA1F1                                                  02037000
CVTRSV50 EQU   CVTA1F1                                                  02038000
CVTRSV49 EQU   CVTA1F1                                                  02039000
CVTRSV48 EQU   CVTA1F1                                                  02040000
CVTRSV47 EQU   CVTA1F1                                                  02041000
CVTSRSW  EQU   CVTA1F1                                                  02042000
CVTPFSW  EQU   CVTA1F1                                                  02043000
CVTPCVT  EQU   CVTMAP+352                                               02044000
CVTRSV46 EQU   CVTMAP+344                                               02045000
CVTRSV45 EQU   CVTMAP+340                                               02046000
CVTRSV44 EQU   CVTMAP+338                                               02047000
CVTRSV43 EQU   CVTMAP+336                                               02048000
CVTHJESA EQU   CVTHJES+1                                                02049000
CVTRSV42 EQU   CVTHJES                                                  02050000
CVTEXT2A EQU   CVTEXT2+1                                                02051000
CVTRSV41 EQU   CVTEXT2                                                  02052000
CVTAPFA  EQU   CVTAPF+1                                                 02053000
CVTRSV40 EQU   CVTAPF                                                   02054000
CVTRV518 EQU   CVTINTLA                                                 02055000
CVTRV517 EQU   CVTERPV                                                  02056000
CVTEORM  EQU   CVTMAP+312                                               02057000
CVTMCHPR EQU   CVTMAP+308                                               02058000
CVTTZ    EQU   CVTMAP+304                                               02059000
CVTJEPS  EQU   CVTMAP+300                                               02060000
CVTJESCT EQU   CVTMAP+296                                               02061000
CVTMODE  EQU   CVTMAP+292                                               02062000
CVTPTRV  EQU   CVTMAP+288                                               02063000
CVTREAL  EQU   CVTMAP+284                                               02064000
CVTRSV39 EQU   CVTMAP+280                                               02065000
CVTRSV38 EQU   CVTMAP+276                                               02066000
CVTDMSRA EQU   CVTDMSR+1                                                02067000
CVTRV634 EQU   CVTDMSRF                                                 02068000
CVTRV633 EQU   CVTDMSRF                                                 02069000
CVTRV632 EQU   CVTDMSRF                                                 02070000
CVTRV631 EQU   CVTDMSRF                                                 02071000
CVTRV630 EQU   CVTDMSRF                                                 02072000
CVTRV629 EQU   CVTDMSRF                                                 02073000
CVTUDUMP EQU   CVTDMSRF                                                 02074000
CVTSDUMP EQU   CVTDMSRF                                                 02075000
CVTQMSGA EQU   CVTQMSG+1                                                02076000
CVTRSV36 EQU   CVTQMSG                                                  02077000
CVTAMFF  EQU   CVTMAP+264                                               02078000
CVTPURGA EQU   CVTPURG+1                                                02079000
CVTRSV35 EQU   CVTPURG                                                  02080000
CVTCBSP  EQU   CVTMAP+256                                               02081000
CVTATERA EQU   CVTATER+1                                                02082000
CVTSYST  EQU   CVTATER                                                  02083000
CVTVOLT2 EQU   CVTTAT                                                   02084000
CVTVOLI2 EQU   CVTVOLF2                                                 02085000
CVTAQAVB EQU   CVTAQAVT+1                                               02086000
CVTRSV34 EQU   CVTTCMFG                                                 02087000
CVTRSV33 EQU   CVTTCMFG                                                 02088000
CVTRSV32 EQU   CVTTCMFG                                                 02089000
CVTRSV31 EQU   CVTTCMFG                                                 02090000
CVTRSV30 EQU   CVTTCMFG                                                 02091000
CVTRSV29 EQU   CVTTCMFG                                                 02092000
CVTLDEV  EQU   CVTTCMFG                                                 02093000
CVTTCRDY EQU   CVTTCMFG                                                 02094000
CVTGTFA  EQU   CVTGTF+1                                                 02095000
CVTRSV27 EQU   CVTGTFST                                                 02096000
CVTRNIO  EQU   CVTGTFST                                                 02097000
CVTUSR   EQU   CVTGTFST                                                 02098000
CVTRV318 EQU   CVTFORM                                                  02099000
CVTRV317 EQU   CVTTMODE                                                 02100000
CVTRV316 EQU   CVTSTATE                                                 02101000
CVTRV315 EQU   CVTGTFS                                                  02102000
CVTGTFAV EQU   CVTGTFS                                                  02103000
CVT0SCR1 EQU   CVTMAP+232                                               02104000
CVTRV515 EQU   CVTMAP+228                                               02105000
CVTRMS   EQU   CVTMAP+224                                               02106000
CVTPATCH EQU   CVTMAP+220                                               02107000
CVTTSCE  EQU   CVTMAP+216                                               02108000
CVTLNKSC EQU   CVTMAP+214                                               02109000
CVTQABST EQU   CVTMAP+212                                               02110000
CVTMDLDS EQU   CVTMAP+208                                               02111000
CVTUSER  EQU   CVTMAP+204                                               02112000
CVTABEND EQU   CVTMAP+200                                               02113000
CVTSMCA  EQU   CVTMAP+196                                               02114000
CVTRSV18 EQU   CVTMAP+192                                               02115000
CVTQLPAQ EQU   CVTMAP+188                                               02116000
CVTQCDSR EQU   CVTMAP+184                                               02117000
CVTVS1B  EQU   CVTOPTB                                                  02118000
CVTVS1A  EQU   CVTOPTB                                                  02119000
CVTFP    EQU   CVTOPTB                                                  02120000
CVTAPTHR EQU   CVTOPTB                                                  02121000
CVTNLOG  EQU   CVTOPTB                                                  02122000
CVTTOD   EQU   CVTOPTB                                                  02123000
CVTCTIMS EQU   CVTOPTB                                                  02124000
CVTPROT  EQU   CVTOPTB                                                  02125000
CVTXPFP  EQU   CVTOPTA                                                  02126000
CVTASCII EQU   CVTOPTA                                                  02127000
CVTRSV13 EQU   CVTOPTA                                                  02128000
CVTRSV12 EQU   CVTOPTA                                                  02129000
CVTNIP   EQU   CVTOPTA                                                  02130000
CVTDDR   EQU   CVTOPTA                                                  02131000
CVTAPR   EQU   CVTOPTA                                                  02132000
CVTCCH   EQU   CVTOPTA                                                  02133000
CVTSNCTR EQU   CVTMAP+180                                               02134000
CVTQMWR  EQU   CVTMAP+176                                               02135000
CVTQOCR  EQU   CVTMAP+172                                               02136000
CVT1EF00 EQU   CVTMAP+168                                               02137000
CVTMZ00  EQU   CVTMAP+164                                               02138000
CVTHEAD  EQU   CVTMAP+160                                               02139000
CVTRSV11 EQU   CVTMAP+156                                               02140000
CVT0PT01 EQU   CVTMAP+152                                               02141000
CVTMSER  EQU   CVTMAP+148                                               02142000
CVTRV516 EQU   CVTIERLC                                                 02143000
CVTILCH  EQU   CVTMAP+140                                               02144000
CVT0DS   EQU   CVTMAP+136                                               02145000
CVTFBOSV EQU   CVTMAP+132                                               02146000
CVTNUCB  EQU   CVTMAP+128                                               02147000
CVTIXAVL EQU   CVTMAP+124                                               02148000
CVTIOQET EQU   CVTMAP+120                                               02149000
CVTDCBA  EQU   CVTMAP+117                                               02150000
CVTMVS2  EQU   CVTDCB                                                   02151000
CVT6DAT  EQU   CVTDCB                                                   02152000
CVT4MPS  EQU   CVTDCB                                                   02153000
CVTRSV09 EQU   CVTDCB                                                   02154000
CVT4MS1  EQU   CVTDCB                                                   02155000
CVT2SPS  EQU   CVTDCB                                                   02156000
CVT1SSS  EQU   CVTDCB                                                   02157000
CVTRSV08 EQU   CVTDCB                                                   02158000
CVTSTB   EQU   CVTMAP+112                                               02159000
CVTQTD00 EQU   CVTMAP+108                                               02160000
CVTQTE00 EQU   CVTMAP+104                                               02161000
CVTCUCB  EQU   CVTMAP+100                                               02162000
CVTSJQ   EQU   CVTMAP+96                                                02163000
CVTPBLDL EQU   CVTMAP+92                                                02164000
CVTTPC   EQU   CVTMAP+88                                                02165000
CVTSVDCB EQU   CVTMAP+84                                                02166000
CVTBRET  EQU   CVTMAP+82                                                02167000
CVTEXIT  EQU   CVTMAP+80                                                02168000
CVT0FN00 EQU   CVTMAP+76                                                02169000
CVTDARA  EQU   CVTDAR+1                                                 02170000
CVTRSV07 EQU   CVTFLGS1                                                 02171000
CVTRSV06 EQU   CVTFLGS1                                                 02172000
CVTRSV05 EQU   CVTFLGS1                                                 02173000
CVTRSV04 EQU   CVTFLGS1                                                 02174000
CVTRSV03 EQU   CVTFLGS1                                                 02175000
CVTRSV02 EQU   CVTFLGS1                                                 02176000
CVTRSV01 EQU   CVTFLGS1                                                 02177000
CVTDMPLK EQU   CVTFLGS1                                                 02178000
CVTXITP  EQU   CVTMAP+68                                                02179000
CVTZDTAB EQU   CVTMAP+64                                                02180000
CVTMSLT  EQU   CVTMAP+60                                                02181000
CVTDATE  EQU   CVTMAP+56                                                02182000
CVTBTERM EQU   CVTMAP+52                                                02183000
CVTSYSAD EQU   CVTMAP+48                                                02184000
CVTXTLER EQU   CVTMAP+44                                                02185000
CVTILK2  EQU   CVTMAP+40                                                02186000
CVTILK1  EQU   CVTMAP+36                                                02187000
CVTPRLTV EQU   CVTMAP+32                                                02188000
CVTPCNVT EQU   CVTMAP+28                                                02189000
CVT0VL00 EQU   CVTMAP+24                                                02190000
CVTXAPG  EQU   CVTMAP+20                                                02191000
CVTBUF   EQU   CVTMAP+16                                                02192000
CVTJOB   EQU   CVTMAP+12                                                02193000
CVTLINK  EQU   CVTMAP+8                                                 02194000
CVT0EF00 EQU   CVTMAP+4                                                 02195000
CVTTCBP  EQU   CVTMAP                                                   02196000
CVT      EQU   CVTMAP                                                   02197000
ATCAOS   EQU   ISTATCVT+1868                                            02198000
@NM00109 EQU   ISTATCVT+1860                                            02199000
@NM00108 EQU   ISTATCVT+1852                                            02200000
@NM00107 EQU   ISTATCVT+1844                                            02201000
@NM00106 EQU   ISTATCVT+1836                                            02202000
@NM00105 EQU   ISTATCVT+1828                                            02203000
@NM00104 EQU   ISTATCVT+1820                                            02204000
ATCHWCSA EQU   ISTATCVT+1816                                            02205000
ATCCACSA EQU   ISTATCVT+1812                                            02206000
ATCMXCSA EQU   ISTATCVT+1808                                            02207000
ATCTPMPB EQU   ISTATCVT+1776                                            02208000
ATCTRMPB EQU   ISTATCVT+1744                                            02209000
ATCRPLAC EQU   ATCRPLCN+2                                               02210000
ATCRPLRC EQU   ATCRPLCN                                                 02211000
ATCCRPLQ EQU   ATCCRPL                                                  02212000
ATCSRBAC EQU   ATCSRBCN+2                                               02213000
ATCSRBRC EQU   ATCSRBCN                                                 02214000
ATCSRBQ  EQU   ATCSRB                                                   02215000
ATCCRAAC EQU   ATCCRACN+2                                               02216000
ATCCRARC EQU   ATCCRACN                                                 02217000
ATCCRAQ  EQU   ATCCRA                                                   02218000
ATCLUFFD EQU   ISTATCVT+1716                                            02219000
ATCVIOPM EQU   ISTATCVT+1712                                            02220000
ATCTPMMI EQU   ISTATCVT+1708                                            02221000
ATCPXSRB EQU   ISTATCVT+1704                                            02222000
ATCRPLCT EQU   ISTATCVT+1702                                            02223000
ATCCRACT EQU   ISTATCVT+1700                                            02224000
ATCSRBCT EQU   ISTATCVT+1698                                            02225000
ATCSTNSM EQU   ISTATCVT+1697                                            02226000
@NM00103 EQU   ATCZFLAG                                                 02227000
ATCZF001 EQU   ATCZFLAG                                                 02228000
ATCTPCP1 EQU   ISTATCVT+1692                                            02229000
ATCTPCP0 EQU   ISTATCVT+1688                                            02230000
ATCZR01  EQU   ISTATCVT+1684                                            02231000
ATCMPLTA EQU   ISTATCVT+1680                                            02232000
ATCASCB  EQU   ISTATCVT+1676                                            02233000
ATCAP86  EQU   ISTATCVT+1672                                            02234000
ATCAP85  EQU   ISTATCVT+1668                                            02235000
ATCAP84  EQU   ISTATCVT+1664                                            02236000
ATCAP83  EQU   ISTATCVT+1660                                            02237000
ATCAP82  EQU   ISTATCVT+1656                                            02238000
ATCAP69  EQU   ISTATCVT+1652                                            02239000
ATCAP66  EQU   ISTATCVT+1648                                            02240000
ATCAP62  EQU   ISTATCVT+1644                                            02241000
ATCAPC59 EQU   ISTATCVT+1640                                            02242000
ATCAP56  EQU   ISTATCVT+1636                                            02243000
ATCAP55  EQU   ISTATCVT+1632                                            02244000
ATCAP41  EQU   ISTATCVT+1628                                            02245000
ATCAPC25 EQU   ISTATCVT+1624                                            02246000
ATCAP23  EQU   ISTATCVT+1620                                            02247000
ATCAPBE  EQU   ISTATCVT+1616                                            02248000
ATCPSTA  EQU   ISTATCVT+1612                                            02249000
ATCSMABF EQU   ISTATCVT+1608                                            02250000
ATCSMAPR EQU   ISTATCVT+1604                                            02251000
ATCTPWQA EQU   ISTATCVT+1600                                            02252000
ATCSMAID EQU   ISTATCVT+1596                                            02253000
ATCSMARA EQU   ISTATCVT+1592                                            02254000
ATCCACXA EQU   ISTATCVT+1588                                            02255000
ATCATA10 EQU   ISTATCVT+1584                                            02256000
ATCHLTCB EQU   ISTATCVT+1580                                            02257000
@NM00102 EQU   ATCVTFLG                                                 02258000
ATCVTACT EQU   ATCVTFLG                                                 02259000
@NM00101 EQU   @NM00100                                                 02260000
ATCVTMAB EQU   @NM00100                                                 02261000
ATCVTBAM EQU   ISTATCVT+1572                                            02262000
@NM00099 EQU   ISTATCVT+1568                                            02263000
@NM00098 EQU   ISTATCVT+1520                                            02264000
ATCCCOOC EQU   ISTATCVT+1516                                            02265000
@NM00097 EQU   ISTATCVT+1513                                            02266000
ATCSNUF  EQU   ATCENFLG                                                 02267000
ATCOPKL  EQU   ATCENFLG                                                 02268000
ATCABEN  EQU   ATCENFLG                                                 02269000
ATCSRDN  EQU   ATCENFLG                                                 02270000
ATCDLDN  EQU   ATCENFLG                                                 02271000
ATCTIMER EQU   ISTATCVT+1508                                            02272000
ATCAIWT  EQU   ISTATCVT+1504                                            02273000
ATCOROBT EQU   ISTATCVT+1500                                            02274000
ATCDMAPP EQU   ISTATCVT+1496                                            02275000
ATCZDVTX EQU   ISTATCVT+1492                                            02276000
ATCPXCRA EQU   ISTATCVT+1488                                            02277000
ATCICNCB EQU   ISTATCVT+1484                                            02278000
ATCCMTCB EQU   ISTATCVT+1480                                            02279000
ATCPRPH  EQU   ISTATCVT+1476                                            02280000
ATCGSRBF EQU   ATCGSRBG                                                 02281000
ATCSRBRT EQU   ISTATCVT+1468                                            02282000
ATCTSCPC EQU   ISTATCVT+1464                                            02283000
@NM00096 EQU   ISTATCVT+1460                                            02284000
ATCCDTCB EQU   ISTATCVT+1456                                            02285000
ATCORFRL EQU   ISTATCVT+1452                                            02286000
ATCORFPX EQU   ISTATCVT+1448                                            02287000
ATCORFMG EQU   ISTATCVT+1444                                            02288000
ATCSMBQ  EQU   ISTATCVT+1440                                            02289000
ATCINFDD EQU   ISTATCVT+1436                                            02290000
ATCAP67  EQU   ISTATCVT+1432                                            02291000
ATCAP65  EQU   ISTATCVT+1428                                            02292000
ATCAP64  EQU   ISTATCVT+1424                                            02293000
ATCAP63  EQU   ISTATCVT+1420                                            02294000
ATCAP61  EQU   ISTATCVT+1416                                            02295000
ATCAP58  EQU   ISTATCVT+1412                                            02296000
ATCAP57  EQU   ISTATCVT+1408                                            02297000
ATCAP54  EQU   ISTATCVT+1404                                            02298000
ATCAP53  EQU   ISTATCVT+1400                                            02299000
ATCAP52  EQU   ISTATCVT+1396                                            02300000
ATCAP51  EQU   ISTATCVT+1392                                            02301000
ATCAP38  EQU   ISTATCVT+1388                                            02302000
ATCAP37  EQU   ISTATCVT+1384                                            02303000
ATCAP34  EQU   ISTATCVT+1380                                            02304000
ATCAP32  EQU   ISTATCVT+1376                                            02305000
ATCAP31  EQU   ISTATCVT+1372                                            02306000
ATCAP12  EQU   ISTATCVT+1368                                            02307000
ATCAP11  EQU   ISTATCVT+1364                                            02308000
ATCDAPDG EQU   ATCDAPVT+20                                              02309000
ATCDXCEA EQU   ATCDAPVT+16                                              02310000
ATCDCEA  EQU   ATCDAPVT+12                                              02311000
ATCDPCIA EQU   ATCDAPVT+8                                               02312000
ATCDSIOA EQU   ATCDAPVT+4                                               02313000
ATCDEOEA EQU   ATCDAPVT                                                 02314000
ATCZAEA  EQU   ATCICAPP+16                                              02315000
ATCZCEA  EQU   ATCICAPP+12                                              02316000
ATCZCPCI EQU   ATCICAPP+8                                               02317000
ATCZSIOA EQU   ATCICAPP+4                                               02318000
ATCCDRPH EQU   ATCICAPP                                                 02319000
ATCORQG  EQU   ATCORSRB                                                 02320000
ATCORTBF EQU   ATCSQAFR                                                 02321000
@NM00095 EQU   ISTATCVT+1308                                            02322000
ATCZLAEA EQU   ATCLDAPP+16                                              02323000
ATCZLCEA EQU   ATCLDAPP+12                                              02324000
ATCZLPCI EQU   ATCLDAPP+8                                               02325000
ATCSMFRR EQU   ATCLDAPP+4                                               02326000
ATCCDTID EQU   ATCLDAPP                                                 02327000
@NM00094 EQU   ISTATCVT+1256                                            02328000
ATCZPAB2 EQU   ISTATCVT+1224                                            02329000
@NM00093 EQU   ISTATCVT+1224                                            02330000
@NM00092 EQU   ISTATCVT+1164                                            02331000
ATCCPCFE EQU   ISTATCVT+1160                                            02332000
@NM00091 EQU   ATCRID+2                                                 02333000
ATCCDRMA EQU   ATCRID                                                   02334000
@NM00090 EQU   ATCSMSDQ+8                                               02335000
@NM00089 EQU   ATCSMSDQ+4                                               02336000
@NM00088 EQU   ATCSMSDQ                                                 02337000
ATCSEQNO EQU   ISTATCVT+1136                                            02338000
ATCSMPMD EQU   ISTATCVT+1132                                            02339000
ATCPAREA EQU   ISTATCVT+1128                                            02340000
ATCCPCSM EQU   ISTATCVT+1124                                            02341000
ATCQLOCK EQU   ISTATCVT+1120                                            02342000
ATCITQLE EQU   ISTATCVT+1116                                            02343000
ATCSQCDS EQU   ISTATCVT+1112                                            02344000
ATCUSSVT EQU   ISTATCVT+1108                                            02345000
ATCNOSQ  EQU   ISTATCVT+1104                                            02346000
ATCINCIP EQU   ATCCPDVT+4                                               02347000
ATCTSCNI EQU   ATCCPDVT                                                 02348000
ATCMGCRT EQU   ISTATCVT+1092                                            02349000
ATCMACRT EQU   ISTATCVT+1088                                            02350000
ATCCSMT  EQU   ISTATCVT+1084                                            02351000
ATCDRUSL EQU   ISTATCVT+1080                                            02352000
ATCDRULL EQU   ISTATCVT+1076                                            02353000
ATCCFCDR EQU   ISTATCVT+1072                                            02354000
@NM00087 EQU   ISTATCVT+1069                                            02355000
ATCMROUT EQU   ISTATCVT+1060                                            02356000
ATCONFIG EQU   ISTATCVT+1052                                            02357000
ATCNODEL EQU   ISTATCVT+1044                                            02358000
@NM00086 EQU   @NM00085+9                                               02359000
ATCLAST  EQU   ATCSHRFG                                                 02360000
ATCSHRTN EQU   @NM00085                                                 02361000
@NM00084 EQU   ISTATCVT+1026                                            02362000
ATCNMCTR EQU   ISTATCVT+1024                                            02363000
ATCPOIA  EQU   ATCRNO+1                                                 02364000
@NM00083 EQU   ATCRNO                                                   02365000
ATCLCLCT EQU   ATCVLCNT+2                                               02366000
ATCRNCNT EQU   ATCVLCNT                                                 02367000
ATCHBSIZ EQU   ATCHPGM+2                                                02368000
ATCHBFNO EQU   ATCHPGM                                                  02369000
@NM00082 EQU   ISTATCVT+1011                                            02370000
ATCXRANG EQU   ISTATCVT+1010                                            02371000
ATCMAXID EQU   ISTATCVT+1009                                            02372000
ATCMSGSP EQU   ISTATCVT+1008                                            02373000
ATCCIDM  EQU   ISTATCVT+1006                                            02374000
ATCACTRM EQU   ISTATCVT+1004                                            02375000
ATCECNET EQU   ISTATCVT+996                                             02376000
ATCECOPC EQU   ISTATCVT+992                                             02377000
ATCECSES EQU   ISTATCVT+988                                             02378000
ATCECDSP EQU   ISTATCVT+984                                             02379000
ATCECVRY EQU   ISTATCVT+980                                             02380000
ATCECHLT EQU   ISTATCVT+976                                             02381000
ATCECMOD EQU   ISTATCVT+972                                             02382000
ATCVDLOK EQU   ISTATCVT+968                                             02383000
ATCRDTLK EQU   ISTATCVT+964                                             02384000
ATCVOCLK EQU   ISTATCVT+960                                             02385000
ATCITLIM EQU   ISTATCVT+958                                             02386000
ATCTMINV EQU   ISTATCVT+956                                             02387000
ATCHOSTA EQU   ISTATCVT+954                                             02388000
ATCPUNSA EQU   ISTATCVT+952                                             02389000
ATCSAF   EQU   ISTATCVT+950                                             02390000
ATCVTMID EQU   ATCSSCPA                                                 02391000
ATCHCNID EQU   ATCONID+2                                                02392000
ATCSCNID EQU   ATCONID                                                  02393000
@NM00081 EQU   ATCBITAN+3                                               02394000
@NM00080 EQU   ATCBITAN+2                                               02395000
@NM00079 EQU   ATCFLAG2                                                 02396000
@NM00078 EQU   ATCFLAG2                                                 02397000
@NM00077 EQU   ATCFLAG2                                                 02398000
ATCCRYPF EQU   ATCFLAG2                                                 02399000
ATCTUNCL EQU   ATCFLAG2                                                 02400000
ATCTUNRQ EQU   ATCFLAG2                                                 02401000
ATCTUNAC EQU   ATCFLAG2                                                 02402000
ATCCDLRA EQU   ATCFLAG2                                                 02403000
@NM00076 EQU   ATCBITAN                                                 02404000
@NM00075 EQU   ATCSTAT4                                                 02405000
@NM00074 EQU   ATCSTAT4                                                 02406000
@NM00073 EQU   ATCSTAT4                                                 02407000
@NM00072 EQU   ATCSTAT4                                                 02408000
@NM00071 EQU   ATCSTAT4                                                 02409000
ATCPRTAT EQU   ATCSTAT4                                                 02410000
ATCNCSD  EQU   ATCSTAT4                                                 02411000
@NM00070 EQU   ATCPOFLG                                                 02412000
@NM00069 EQU   ATCPOFLG                                                 02413000
@NM00068 EQU   ATCPOFLG                                                 02414000
@NM00067 EQU   ATCPOFLG                                                 02415000
@NM00066 EQU   ATCPOFLG                                                 02416000
@NM00065 EQU   ATCPOFLG                                                 02417000
@NM00064 EQU   ATCPOFLG                                                 02418000
ATCPOUNS EQU   ATCPOFLG                                                 02419000
@NM00063 EQU   ATCSTAT+1                                                02420000
ATCHIP   EQU   ATCSTAT1                                                 02421000
ATCMDHLT EQU   ATCSTAT1                                                 02422000
ATCINHLT EQU   ATCSTAT1                                                 02423000
ATCNETSL EQU   ATCSTAT1                                                 02424000
ATCQKHLT EQU   ATCSTAT1                                                 02425000
ATCSNHLT EQU   ATCSTAT1                                                 02426000
ATCACTIV EQU   ATCSTAT1                                                 02427000
ATCSTART EQU   ATCSTAT1                                                 02428000
ATCNOP00 EQU   ISTATCVT+932                                             02429000
ATCTSBUF EQU   ISTATCVT+928                                             02430000
ATCFEPT  EQU   ISTATCVT+924                                             02431000
ATCFDVT  EQU   ISTATCVT+920                                             02432000
ATCCONFT EQU   ISTATCVT+916                                             02433000
ATCRDTH  EQU   ISTATCVT+912                                             02434000
ATCSIBQ  EQU   ISTATCVT+908                                             02435000
ATCHLTMS EQU   ISTATCVT+904                                             02436000
ATCECPRM EQU   ISTATCVT+900                                             02437000
ATCVPARM EQU   ISTATCVT+896                                             02438000
ATCOCHA  EQU   ISTATCVT+892                                             02439000
ATCDSPLQ EQU   ISTATCVT+888                                             02440000
ATCVARYQ EQU   ISTATCVT+884                                             02441000
ATCHALTQ EQU   ISTATCVT+880                                             02442000
ATCMODQ  EQU   ISTATCVT+876                                             02443000
ATCSRT   EQU   ISTATCVT+872                                             02444000
ATCRDT   EQU   ISTATCVT+868                                             02445000
ATCSDVT  EQU   ISTATCVT+864                                             02446000
ATCDLRPT EQU   ISTATCVT+860                                             02447000
ATCBPDA  EQU   ISTATCVT+856                                             02448000
ATCACDA  EQU   ISTATCVT+852                                             02449000
ATCMNT   EQU   ISTATCVT+848                                             02450000
ATCUEP   EQU   ISTATCVT+844                                             02451000
ATCNODDS EQU   ISTATCVT+840                                             02452000
ATCITRT  EQU   ISTATCVT+836                                             02453000
ATCTODVT EQU   ISTATCVT+832                                             02454000
ATCTRCPT EQU   ISTATCVT+828                                             02455000
ATCMODTB EQU   ISTATCVT+824                                             02456000
ATCUSSPT EQU   ISTATCVT+820                                             02457000
ATCTUBUF EQU   ISTATCVT+816                                             02458000
ATCTACB  EQU   ISTATCVT+812                                             02459000
ATCDWA   EQU   ISTATCVT+808                                             02460000
ATCCFCR2 EQU   ATCPODVT                                                 02461000
ATCEPA   EQU   ISTATCVT+800                                             02462000
ATCPULQB EQU   @NM00062+16                                              02463000
ATCMCQAB EQU   @NM00062+12                                              02464000
ATCLUSMQ EQU   @NM00062+8                                               02465000
ATCLUIOQ EQU   @NM00062+4                                               02466000
ATCIOLQB EQU   @NM00062                                                 02467000
ATCTSCAP EQU   ATCANYDT                                                 02468000
ATCTSCCO EQU   ATCLUDVT+4                                               02469000
ATCTSCSR EQU   ATCLUDVT                                                 02470000
ATCVTLOD EQU   ISTATCVT+764                                             02471000
ATCTSCLF EQU   ISTATCVT+760                                             02472000
ATCTSCLE EQU   ISTATCVT+756                                             02473000
ATCTSCLB EQU   ISTATCVT+752                                             02474000
ATCTSCLS EQU   ISTATCVT+748                                             02475000
ATCTSCCF EQU   ISTATCVT+744                                             02476000
ATCTSCFV EQU   ISTATCVT+740                                             02477000
ATCTSCCE EQU   ISTATCVT+736                                             02478000
ATCTSCCB EQU   ISTATCVT+732                                             02479000
ATCTSCWS EQU   ISTATCVT+728                                             02480000
ATCTSCEM EQU   ISTATCVT+724                                             02481000
ATCTSCNS EQU   ISTATCVT+720                                             02482000
ATCTSCER EQU   ISTATCVT+716                                             02483000
ATCTSCPR EQU   ISTATCVT+712                                             02484000
ATCTSCGR EQU   ISTATCVT+708                                             02485000
ATCTSCCI EQU   ISTATCVT+704                                             02486000
ATCTSVT  EQU   ISTATCVT+700                                             02487000
ATCDVLOD EQU   ISTATCVT+696                                             02488000
ATCCDCNR EQU   ISTATCVT+692                                             02489000
ATCCDCNF EQU   ISTATCVT+688                                             02490000
ATCCDCND EQU   ISTATCVT+684                                             02491000
ATCCDCNA EQU   ISTATCVT+680                                             02492000
ATCCDCCP EQU   ISTATCVT+676                                             02493000
ATCCDFDN EQU   ISTATCVT+672                                             02494000
ATCCDFIN EQU   ISTATCVT+668                                             02495000
ATCCDFND EQU   ISTATCVT+664                                             02496000
ATCCDDEL EQU   ISTATCVT+660                                             02497000
ATCCDADD EQU   ISTATCVT+656                                             02498000
ATCTCLIM EQU   ISTATCVT+652                                             02499000
ATCRACTR EQU   ISTATCVT+648                                             02500000
ATCRACTI EQU   ISTATCVT+644                                             02501000
ATCREMOV EQU   ISTATCVT+640                                             02502000
ATCRACIO EQU   ISTATCVT+636                                             02503000
ATCADD   EQU   ISTATCVT+632                                             02504000
ATCPUCRT EQU   ISTATCVT+628                                             02505000
ATCSMRS  EQU   ISTATCVT+624                                             02506000
ATCSMRQ  EQU   ISTATCVT+620                                             02507000
ATCORCPX EQU   ISTATCVT+616                                             02508000
ATCORCAF EQU   ISTATCVT+612                                             02509000
ATCFRSTR EQU   ATCGTSTR                                                 02510000
ATCSTMA  EQU   ISTATCVT+604                                             02511000
ATCSRTAD EQU   ISTATCVT+600                                             02512000
ATCOCRT  EQU   ISTATCVT+596                                             02513000
ATCOCCFS EQU   ISTATCVT+592                                             02514000
ATCOCCFP EQU   ISTATCVT+588                                             02515000
ATCSRTDF EQU   ISTATCVT+584                                             02516000
ATCLUCRT EQU   ISTATCVT+580                                             02517000
ATCINCY5 EQU   ISTATCVT+576                                             02518000
ATCINCW3 EQU   ISTATCVT+572                                             02519000
ATCINCU6 EQU   ISTATCVT+568                                             02520000
ATCINCTQ EQU   ISTATCVT+564                                             02521000
ATCINCS1 EQU   ISTATCVT+560                                             02522000
ATCSRTAB EQU   ISTATCVT+556                                             02523000
ATCINCRD EQU   ISTATCVT+552                                             02524000
ATCINCPH EQU   ISTATCVT+548                                             02525000
ATCINCLQ EQU   ISTATCVT+544                                             02526000
ATCNOCRT EQU   ISTATCVT+540                                             02527000
ATCINCF1 EQU   ISTATCVT+536                                             02528000
ATCINCCI EQU   ISTATCVT+532                                             02529000
ATCINCCO EQU   ISTATCVT+528                                             02530000
ATCBLDLA EQU   ISTATCVT+524                                             02531000
ATCALOAD EQU   ISTATCVT+520                                             02532000
ATCADEL  EQU   ISTATCVT+516                                             02533000
ATCESC02 EQU   ISTATCVT+512                                             02534000
ATCESC01 EQU   ISTATCVT+508                                             02535000
ATCDEC01 EQU   ISTATCVT+504                                             02536000
ATCDEC00 EQU   ISTATCVT+500                                             02537000
ATCCPCRT EQU   ISTATCVT+496                                             02538000
ATCMSGM  EQU   ISTATCVT+492                                             02539000
ATCCPCFR EQU   ISTATCVT+488                                             02540000
ATCCPCGR EQU   ISTATCVT+484                                             02541000
ATCCPCPP EQU   ISTATCVT+480                                             02542000
ATCMSGP  EQU   ISTATCVT+476                                             02543000
ATCCPCNT EQU   ISTATCVT+472                                             02544000
ATCAUTHA EQU   ISTATCVT+468                                             02545000
ATCACCTA EQU   ISTATCVT+464                                             02546000
ATCAP39  EQU   ISTATCVT+460                                             02547000
ATCAP36  EQU   ISTATCVT+456                                             02548000
ATCAP35  EQU   ISTATCVT+452                                             02549000
ATCAP33  EQU   ISTATCVT+448                                             02550000
ATCAPCR5 EQU   ISTATCVT+444                                             02551000
ATCAICPT EQU   ISTATCVT+440                                             02552000
ATCAPI   EQU   ISTATCVT+436                                             02553000
ATCAICTN EQU   ISTATCVT+432                                             02554000
ATCACC01 EQU   ISTATCVT+428                                             02555000
ATCACC00 EQU   ISTATCVT+424                                             02556000
ATCLDECB EQU   ATCLDTIL+12                                              02557000
ATCLDLCK EQU   ATCLDTIL+8                                               02558000
ATCLDLST EQU   ATCLDTIL+4                                               02559000
ATCLDNCS EQU   ATCLDTIL                                                 02560000
ATCNOSPB EQU   ISTATCVT+376                                             02561000
ATCNSPAB EQU   ISTATCVT+344                                             02562000
ATCLUSRT EQU   ISTATCVT+312                                             02563000
ATCPUIOP EQU   ISTATCVT+280                                             02564000
ATCPUPAB EQU   ISTATCVT+248                                             02565000
ATCPXPAB EQU   ISTATCVT+216                                             02566000
ATCPOPAB EQU   ISTATCVT+184                                             02567000
@NM00061 EQU   ATCVDPAB+16                                              02568000
ATCFEPAB EQU   ATCVDPAB                                                 02569000
ATCTCIPB EQU   ISTATCVT+120                                             02570000
ATCCSPAB EQU   ATCSMPAB+16                                              02571000
@NM00060 EQU   ATCSMPAB                                                 02572000
ATCTMRPB EQU   ISTATCVT+56                                              02573000
ATCITPAB EQU   ISTATCVT+24                                              02574000
@NM00059 EQU   ATCITRA1                                                 02575000
ATCITSCP EQU   ATCITRA1                                                 02576000
ATCITMSG EQU   ATCITRA1                                                 02577000
ATCITPIU EQU   ATCITRA1                                                 02578000
ATCITSMS EQU   ATCITRA1                                                 02579000
ATCITPSS EQU   ATCITRA1                                                 02580000
ATCITLCK EQU   ATCITRA1                                                 02581000
ATCITAPI EQU   ATCITRA1                                                 02582000
ATCITCNT EQU   ATCITFLG                                                 02583000
ATCITRPH EQU   ATCITCDS                                                 02584000
ATCITTBL EQU   ATCITFLD+4                                               02585000
ATCITPRM EQU   ATCITFLD                                                 02586000
ATCPTCHA EQU   ATCRPTCH+4                                               02587000
ATCVTLVL EQU   ATCRPTCH                                                 02588000
RPHUPSTA EQU   ISTRPH+104                                               02589000
RPHSAV16 EQU   RPHWORK+60                                               02590000
RPHSAV15 EQU   RPHWORK+56                                               02591000
RPHSAV14 EQU   RPHWORK+52                                               02592000
RPHSAV13 EQU   RPHWORK+48                                               02593000
RPHSAV12 EQU   RPHWORK+44                                               02594000
RPHSAV11 EQU   RPHWORK+40                                               02595000
RPHSAV10 EQU   RPHWORK+36                                               02596000
RPHSAVE9 EQU   RPHWORK+32                                               02597000
RPHSAVE8 EQU   RPHWORK+28                                               02598000
RPHSAVE7 EQU   RPHWORK+24                                               02599000
RPHSAVE6 EQU   RPHWORK+20                                               02600000
RPHSAVE5 EQU   RPHWORK+16                                               02601000
RPHSAVE4 EQU   RPHWORK+12                                               02602000
RPHSAVE3 EQU   RPHWORK+8                                                02603000
RPHSAVE2 EQU   RPHWORK+4                                                02604000
RPHSHALF EQU   RPHSAVE1+2                                               02605000
RPHSBIT8 EQU   RPHSBITS                                                 02606000
RPHSBIT7 EQU   RPHSBITS                                                 02607000
RPHSBIT6 EQU   RPHSBITS                                                 02608000
RPHSBIT5 EQU   RPHSBITS                                                 02609000
RPHSBIT4 EQU   RPHSBITS                                                 02610000
RPHSBIT3 EQU   RPHSBITS                                                 02611000
RPHSBIT2 EQU   RPHSBITS                                                 02612000
RPHSBIT1 EQU   RPHSBITS                                                 02613000
RPHSBYTE EQU   RPHSAVE1                                                 02614000
RPHPABQP EQU   RPHPABQA+1                                               02615000
RPHPABFG EQU   RPHPABQA                                                 02616000
RPHCRR   EQU   ISTRPH+32                                                02617000
RPHSRP34 EQU   RPHSRPRM+2                                               02618000
RPHSRP12 EQU   RPHSRPRM                                                 02619000
RPHWEGT  EQU   RPHCSPA                                                  02620000
RPHMAJCB EQU   ISTRPH+21                                                02621000
RPHPABOF EQU   ISTRPH+20                                                02622000
RPHRESUM EQU   RPHRESMA+1                                               02623000
@NM00058 EQU   RPHWPFLG                                                 02624000
RPHPURGE EQU   RPHWPFLG                                                 02625000
RPHPT    EQU   RPHWPFLG                                                 02626000
RPHWT    EQU   RPHWPFLG                                                 02627000
RPHRSKEY EQU   RPHWPFLG                                                 02628000
RPHDVTA  EQU   ISTRPH+12                                                02629000
RPHTIK   EQU   RPHTSKID+3                                               02630000
@NM00057 EQU   RPHTSKID                                                 02631000
RPHRPHAP EQU   RPHRPHA+1                                                02632000
@NM00056 EQU   RPHRPHA                                                  02633000
RPHGATE  EQU   RPHRPHA                                                  02634000
RPHABEND EQU   RPHFLGB                                                  02635000
RPHUWAIT EQU   RPHFLGB                                                  02636000
RPHRLCRA EQU   RPHFLGB                                                  02637000
@NM00055 EQU   RPHFLGB                                                  02638000
RPHPGCMP EQU   RPHFLGB                                                  02639000
RPHFBAPS EQU   RPHFLGB                                                  02640000
RPHBSSP  EQU   RPHFLGB                                                  02641000
RPHLOCK  EQU   RPHFLGB                                                  02642000
RPHFNFLG EQU   RPHFSTLC                                                 02643000
RPHMLTCP EQU   RPHFLAGS                                                 02644000
RPHSMCLR EQU   RPHFLAGS                                                 02645000
RPHSMTYP EQU   RPHFLAGS                                                 02646000
RPHSMQ   EQU   RPHFLAGS                                                 02647000
RPHAPTYP EQU   RPHFLAGS                                                 02648000
RPHSPGIN EQU   RPHFLAGS                                                 02649000
RPHOGIND EQU   RPHFLAGS                                                 02650000
RPHLNGTH EQU   RPHCNTL+1                                                02651000
RPHTYPE  EQU   RPHCNTL                                                  02652000
DYPPAB   EQU   ISTDYPAB+16                                              02653000
DYPOCRPH EQU   DYPPACMD                                                 02654000
DYPTSKID EQU   ISTDYPAB+8                                               02655000
DYPPACTB EQU   DYPCHAIN                                                 02656000
DYPFLGS  EQU   ISTDYPAB+2                                               02657000
DYPLNGTH EQU   ISTDYPAB+1                                               02658000
DYPTYPE  EQU   ISTDYPAB                                                 02659000
PABRPHA  EQU   PABRPHFG+1                                               02660000
PABNODQ  EQU   PABFLAGS                                                 02661000
PABINHBT EQU   PABFLAGS                                                 02662000
PABERLOK EQU   PABERRLK                                                 02663000
PABSSN   EQU   PABFLAGS                                                 02664000
PABDYNAM EQU   PABFLAGS                                                 02665000
PABXTND  EQU   PABFLAGS                                                 02666000
PABPRIOR EQU   PABFLAGS                                                 02667000
PABAPYP  EQU   PABFLAGS                                                 02668000
PABDVTA  EQU   ISTPAB+9                                                 02669000
PABOFFST EQU   ISTPAB+8                                                 02670000
PABCHNGP EQU   PABCHAIN+1                                               02671000
PABRSV02 EQU   PABCHAIN                                                 02672000
PABDELAY EQU   PABCHAIN                                                 02673000
PABQUED  EQU   PABRUNNG                                                 02674000
PABRESET EQU   PABCHAIN                                                 02675000
PABUNCON EQU   PABCHAIN                                                 02676000
PABCDP   EQU   PABCHAIN                                                 02677000
PABRESCH EQU   PABCHAIN                                                 02678000
PABCHNG  EQU   PABCHAIN                                                 02679000
PABWEQP  EQU   PABWEQA+1                                                02680000
PABRSV01 EQU   PABWEQA                                                  02681000
PABWEQG  EQU   PABWEQA                                                  02682000
LOKXCL   EQU   @NM00052                                                 02683000
LOKPRY   EQU   @NM00052                                                 02684000
@NM00053 EQU   @NM00052                                                 02685000
@NM00051 EQU   LOKCHNG                                                  02686000
LOKCT    EQU   ISTLOK                                                   02687000
ISTRETR7 EQU   ISTRETRG+4                                               02688000
ISTRETR6 EQU   ISTRETRG                                                 02689000
ISTRSV01 EQU   ISTAVT+42                                                02690000
ISTPDAVP EQU   ISTAVT+38                                                02691000
ISTVTTP  EQU   ISTAVT+36                                                02692000
ISTAGTWT EQU   ISTAVT+34                                                02693000
ISTATRT  EQU   ISTAVT+32                                                02694000
ISTARID  EQU   ISTAVT+30                                                02695000
ISTX1    EQU   ISTAVT+29                                                02696000
ISTPHNM  EQU   ISTAVT+24                                                02697000
ISTAPSEX EQU   ISTAVT+20                                                02698000
ISTVTTIK EQU   ISTAVT+18                                                02699000
AVTASID  EQU   ISTAVT+16                                                02700000
ISTAPSTA EQU   ISTAVT+12                                                02701000
ISTAS53  EQU   ISTAVT+8                                                 02702000
ISTAS49  EQU   ISTAVT+4                                                 02703000
ISTACVT  EQU   ISTAVT                                                   02704000
SVECC010 EQU   TOLTEPWA+3952                                            02705000
SVETC035 EQU   TOLTEPWA+3880                                            02706000
SVESC030 EQU   TOLTEPWA+3808                                            02707000
SVESC020 EQU   TOLTEPWA+3664                                            02708000
SVESC120 EQU   TOLTEPWA+3304                                            02709000
SVESC025 EQU   TOLTEPWA+3088                                            02710000
@NM00050 EQU   TOLTEPWA+2980                                            02711000
$RPLERR  EQU   TOLTEPWA+2977                                            02712000
@NM00049 EQU   TOLTEPWA+2976                                            02713000
$CEINT2  EQU   TOLTEPWA+2968                                            02714000
$CEINT1  EQU   TOLTEPWA+2964                                            02715000
$MSGGET  EQU   TOLTEPWA+2960                                            02716000
$ACQLIST EQU   TOLTEPWA+2956                                            02717000
$R4SAVE1 EQU   TOLTEPWA+2952                                            02718000
$CLSISS  EQU   TOLTEPWA+2950                                            02719000
$CLSCNT  EQU   TOLTEPWA+2948                                            02720000
$CUTABLE EQU   TOLTEPWA+2868                                            02721000
$BUFSZ2  EQU   TOLTEPWA+2864                                            02722000
$RESID2  EQU   TOLTEPWA+2860                                            02723000
$OLTCCW2 EQU   TOLTEPWA+2856                                            02724000
$ENDBFR2 EQU   TOLTEPWA+2852                                            02725000
$1STBFR2 EQU   TOLTEPWA+2848                                            02726000
$TECB2   EQU   TOLTEPWA+2844                                            02727000
$BUFSZ1  EQU   TOLTEPWA+2840                                            02728000
$RESID1  EQU   TOLTEPWA+2836                                            02729000
$OLTCCW1 EQU   TOLTEPWA+2832                                            02730000
$ENDBFR1 EQU   TOLTEPWA+2828                                            02731000
$1STBFR1 EQU   TOLTEPWA+2824                                            02732000
$TECB1   EQU   TOLTEPWA+2820                                            02733000
$WAITIME EQU   TOLTEPWA+2816                                            02734000
$TRTN#   EQU   TOLTEPWA+2815                                            02735000
$WIODEV  EQU   TOLTEPWA+2814                                            02736000
$R4SAVE  EQU   TOLTEPWA+2804                                            02737000
$PARTADR EQU   TOLTEPWA+2800                                            02738000
$TBSDATA EQU   TOLTEPWA+2796                                            02739000
$CTWIDTH EQU   TOLTEPWA+2795                                            02740000
$CTLINE  EQU   TOLTEPWA+2794                                            02741000
$APWIDTH EQU   TOLTEPWA+2793                                            02742000
$APLINE  EQU   TOLTEPWA+2792                                            02743000
$INDEX   EQU   $IMITX                                                   02744000
$UMXX    EQU   @NM00048+14                                              02745000
$NSXX    EQU   @NM00048+12                                              02746000
$ATACNT  EQU   $NSCNT                                                   02747000
$CTR     EQU   @NM00048+8                                               02748000
$ATAPTR  EQU   $NSPTR                                                   02749000
$DDRPTR  EQU   @NM00048                                                 02750000
$DTORESP EQU   TOLTEPWA+2712                                            02751000
$APNAME  EQU   TOLTEPWA+2704                                            02752000
$24SYMNE EQU   $24CATMG+4                                               02753000
$24DEVAD EQU   $24CATMG                                                 02754000
$24RTN#  EQU   $24FEMSG+8                                               02755000
$ESECTID EQU   $24FEMSG                                                 02756000
$24FLGS  EQU   TOLTEPWA+2680                                            02757000
$24SAVE2 EQU   TOLTEPWA+2676                                            02758000
$24SAVE1 EQU   TOLTEPWA+2672                                            02759000
$24UNADR EQU   TOLTEPWA+2668                                            02760000
$24SAV13 EQU   TOLTEPWA+2664                                            02761000
$24RETCD EQU   TOLTEPWA+2663                                            02762000
$CSPARE  EQU   $CFLGS                                                   02763000
ROOTLOC  EQU   TOLTEPWA+2640                                            02764000
$RETREG  EQU   TOLTEPWA+2636                                            02765000
$WORK    EQU   TOLTEPWA+2376                                            02766000
$EXTA    EQU   TOLTEPWA+2320                                            02767000
$PASSONA EQU   TOLTEPWA+2264                                            02768000
$TRMINPT EQU   TOLTEPWA+2184                                            02769000
$INBUFR  EQU   TOLTEPWA+2104                                            02770000
$BUFFER  EQU   TOLTEPWA+1976                                            02771000
$TLTRPL3 EQU   TOLTEPWA+1856                                            02772000
$TLTRPL2 EQU   TOLTEPWA+1736                                            02773000
$TLTRPL1 EQU   TOLTEPWA+1616                                            02774000
@NM00047 EQU   $SLTBL+135                                               02775000
$HIGHRTN EQU   $SLTBL+134                                               02776000
$PRIMADR EQU   $SLTBL+130                                               02777000
$CTSTPT  EQU   $SLTBL+128                                               02778000
$TSTCNT  EQU   $SLTBL+126                                               02779000
$SECFLGS EQU   $SECLST+3                                                02780000
$SECTION EQU   $SECLST                                                  02781000
$SECACT  EQU   $TESTFLG                                                 02782000
$CANTRUN EQU   $TESTFLG                                                 02783000
$FINAL   EQU   $TESTFLG                                                 02784000
$TESTSUF EQU   $RUNTEST+5                                               02785000
$TESTNUM EQU   $RUNTEST+1                                               02786000
$LETPRF  EQU   $RUNTEST                                                 02787000
$SYMBOLC EQU   $SLTBL+5                                                 02788000
$FAMILY  EQU   $SLTBL                                                   02789000
$CDEVPT  EQU   TOLTEPWA+1466                                            02790000
$FEEDBCK EQU   $DEVTBLE+66                                              02791000
$WTISUED EQU   $DEVFLG4                                                 02792000
$EXIOISD EQU   $DEVFLG4                                                 02793000
$REMWRIT EQU   $DEVFLG4                                                 02794000
$REMDONE EQU   $DEVFLG4                                                 02795000
$2NDUSED EQU   $DEVFLG4                                                 02796000
$1STUSED EQU   $DEVFLG4                                                 02797000
$IGLXIFB EQU   $DEVFLG4                                                 02798000
$EXIOLV3 EQU   $DEVFLG4                                                 02799000
@NM00046 EQU   $DEVFLG5                                                 02800000
$DVBASIC EQU   $DEVFLG5                                                 02801000
$ASCII   EQU   $DEVFLG5                                                 02802000
$DEVLU   EQU   $DEVFLG5                                                 02803000
$OPNDFAL EQU   $DEVFLG5                                                 02804000
$ACQNCB  EQU   $DEVFLG5                                                 02805000
$REMOTE  EQU   $DEVFLG5                                                 02806000
$ENDNODE EQU   $DEVFLG5                                                 02807000
$CID     EQU   $DEVTBLE+52                                              02808000
$DVCOL   EQU   $LDNCBPT+2                                               02809000
$DVROW   EQU   $LDNCBPT                                                 02810000
$NCSPLP  EQU   $DEVTBLE+44                                              02811000
$DVLN    EQU   $SSCPDAF                                                 02812000
$DAF     EQU   $DEVSESP+4                                               02813000
$VARYPAB EQU   $DEVSESP                                                 02814000
$SYSMN   EQU   $DEVTBLE+28                                              02815000
@NM00045 EQU   $DEVFLG3                                                 02816000
$CLRSNT  EQU   $DEVFLG3                                                 02817000
$OLTERR  EQU   $DEVFLG3                                                 02818000
$SRTEST  EQU   $DEVFLG3                                                 02819000
$DVSNDOK EQU   $SIOFLG                                                  02820000
$POLLREQ EQU   $DEVFLG3                                                 02821000
$ACQRED  EQU   $DEVFLG3                                                 02822000
$NOTDEV  EQU   $DEVFLG3                                                 02823000
$DVINCT  EQU   $DEVTBLE+26                                              02824000
$DVBRKST EQU   $OPND+1                                                  02825000
$DVBRKSN EQU   $OPND                                                    02826000
$DVSEQNO EQU   $OPIS                                                    02827000
$CEINTRP EQU   $DEVFLG2                                                 02828000
$DEVALOC EQU   $DEVFLG2                                                 02829000
$ALLDATA EQU   $DEVFLG2                                                 02830000
$ENDCNTL EQU   $DEVFLG2                                                 02831000
$CTLDEV  EQU   $DEVFLG2                                                 02832000
$NOCDS   EQU   $DEVFLG2                                                 02833000
$DATAIN  EQU   $DEVFLG2                                                 02834000
$PRIMARY EQU   $DEVFLG1                                                 02835000
$DVCTBYT EQU   $INTOCC                                                  02836000
$DEVACT  EQU   $DEVFLG1                                                 02837000
$DVLGMDE EQU   $ATTNEXP                                                 02838000
$DVSPRM  EQU   $EVNCPLT                                                 02839000
$GRABBED EQU   $DEVFLG1                                                 02840000
$CATASTR EQU   $DEVFLG1                                                 02841000
$LETGO   EQU   $DEVFLG1                                                 02842000
$CURELEM EQU   $$SYMNME+4                                               02843000
$MSGOTSD EQU   $$SYMNME                                                 02844000
$EXTDEV  EQU   $DEVCDS+11                                               02845000
@NM00044 EQU   $DEVSDCF                                                 02846000
$NOTPRIM EQU   $DEVSDCF                                                 02847000
@NM00043 EQU   $DEVCDSF                                                 02848000
@NM00042 EQU   $DEVCDSF                                                 02849000
@NM00041 EQU   $DEVCDSF                                                 02850000
$CDSNAME EQU   $DEVCDSF                                                 02851000
$EXTRN   EQU   $DEVCDSF                                                 02852000
$CEVOLUM EQU   $DEVCDSF                                                 02853000
$SHARD   EQU   $DEVCDSF                                                 02854000
$DEVFPM  EQU   $DEVCDSF                                                 02855000
$DEVCNT  EQU   $DEVCDS+8                                                02856000
$DEVTYPE EQU   $DEVFEAT+3                                               02857000
$DEVCLAS EQU   $DEVFEAT+2                                               02858000
$DEVFRRS EQU   $DEVFEAT+1                                               02859000
$DEVMOD  EQU   $DEVFEAT                                                 02860000
$DEVRDGT EQU   @NM00039+1                                               02861000
$DEVCTLU EQU   @NM00039+1                                               02862000
$DEVCHAN EQU   @NM00039                                                 02863000
@NM00040 EQU   @NM00039                                                 02864000
$CTINDX  EQU   $DEVUNAD                                                 02865000
$FLAG16  EQU   $COMMFLG+15                                              02866000
$FLAG15  EQU   $COMMFLG+14                                              02867000
$FLAG14  EQU   $COMMFLG+13                                              02868000
$CATMSG  EQU   $FLAG13                                                  02869000
$PRMPTSW EQU   $FLAG13                                                  02870000
$DEVENT  EQU   $FLAG13                                                  02871000
$CTLOGON EQU   $FLAG13                                                  02872000
@NM00038 EQU   $FLAG12                                                  02873000
$VRYHRD  EQU   $FLAG12                                                  02874000
$VRYSFT  EQU   $FLAG12                                                  02875000
$OPTMSG  EQU   $FLAG12                                                  02876000
$FEORCAT EQU   $FLAG11                                                  02877000
@NM00037 EQU   $FLAG11                                                  02878000
@NM00036 EQU   $FLAG10                                                  02879000
$DPRINT  EQU   $FLAG10                                                  02880000
@NM00035 EQU   $FLAG9                                                   02881000
$COPY    EQU   $FLAG9                                                   02882000
$LSTLNSW EQU   $FLAG9                                                   02883000
$MULLNSW EQU   $FLAG9                                                   02884000
$REMSW   EQU   $FLAG9                                                   02885000
$IGRES   EQU   $FLAG9                                                   02886000
$VS2     EQU   $FLAG8                                                   02887000
$VS1     EQU   $FLAG8                                                   02888000
$EDOS    EQU   $FLAG8                                                   02889000
@NM00034 EQU   $FLAG8                                                   02890000
@NM00033 EQU   $FLAG8                                                   02891000
$RCVMSG  EQU   $FLAG7                                                   02892000
$LDOIS   EQU   $FLAG7                                                   02893000
$DCONTCT EQU   $FLAG7                                                   02894000
$2NDDATA EQU   $FLAG7                                                   02895000
$1STDATA EQU   $FLAG7                                                   02896000
$FSTMCIS EQU   $FLAG6                                                   02897000
$DISCREQ EQU   $FLAG6                                                   02898000
$DISCISS EQU   $FLAG6                                                   02899000
$CHANGE  EQU   $FLAG6                                                   02900000
$CTERROR EQU   $FLAG6                                                   02901000
@NM00032 EQU   $FLAG5                                                   02902000
$PROGCK  EQU   $CANCEL                                                  02903000
$PRINTAP EQU   $FLAG5                                                   02904000
@NM00031 EQU   $FLAG5                                                   02905000
$MSG922  EQU   $FLAG5                                                   02906000
$CT924   EQU   $FLAG5                                                   02907000
$FSTCAT  EQU   $FLAG5                                                   02908000
$FSTFE   EQU   $FLAG5                                                   02909000
$ACQCUTT EQU   $FLAG4                                                   02910000
$BACKINT EQU   $FLAG4                                                   02911000
$DMSGSW  EQU   $FLAG4                                                   02912000
$TSTDEVP EQU   $FLAG4                                                   02913000
$APRQPER EQU   $FLAG4                                                   02914000
$OPCOM   EQU   $FLAG4                                                   02915000
$NEWAP   EQU   $FLAG3                                                   02916000
$ALTPRTR EQU   $FLAG3                                                   02917000
$OPTERR  EQU   $FLAG3                                                   02918000
$TSTERR  EQU   $FLAG3                                                   02919000
$DEVERR  EQU   $FLAG3                                                   02920000
$PARTIAL EQU   $FLAG2                                                   02921000
$NRMTERM EQU   $FLAG2                                                   02922000
$VALDTST EQU   $FLAG2                                                   02923000
$VALDDEV EQU   $FLAG2                                                   02924000
$DBLSLSH EQU   $FLAG2                                                   02925000
$NDR     EQU   $FLAG2                                                   02926000
@NM00030 EQU   $FLAG2                                                   02927000
$FTTHR   EQU   $FLAG2                                                   02928000
$NORELDV EQU   $FLAG1                                                   02929000
@NM00029 EQU   $FLAG1                                                   02930000
$OPTCHNG EQU   $FLAG1                                                   02931000
$DEVCHNG EQU   $FLAG1                                                   02932000
$TESTCNG EQU   $FLAG1                                                   02933000
$CNSLFG  EQU   $FLAG1                                                   02934000
@NM00028 EQU   $CDA+120                                                 02935000
$CUCNT   EQU   $CDA+118                                                 02936000
@NM00027 EQU   $CDA+117                                                 02937000
$PRTFORM EQU   $CDA+116                                                 02938000
$OPISCNT EQU   $CDA+114                                                 02939000
$OPNDCNT EQU   $CDA+112                                                 02940000
$GETMSZE EQU   $CDA+110                                                 02941000
$GRCNTS  EQU   $CDA+108                                                 02942000
$CTLCNT  EQU   $CDA+106                                                 02943000
$ACTLVL  EQU   $CDA+105                                                 02944000
$PRNTLVL EQU   $CDA+104                                                 02945000
$ERRCNTA EQU   $CDA+102                                                 02946000
$TLCNT   EQU   $CDA+100                                                 02947000
$TIMEALW EQU   $CDA+96                                                  02948000
$PTRAREA EQU   $CDA+92                                                  02949000
$GETMPTR EQU   $CDA+88                                                  02950000
$TEPEND  EQU   $CDA+76                                                  02951000
$PLINKDL EQU   $CDA+72                                                  02952000
$TEPBEGN EQU   $CDA+68                                                  02953000
$FRELPTR EQU   $CDA+64                                                  02954000
$HIGHADR EQU   $HIMOREC                                                 02955000
$LOMOREC EQU   $CDA+56                                                  02956000
$LOWADDR EQU   $OLTPTR                                                  02957000
$ENDCOMM EQU   $CDA+48                                                  02958000
$COMMON  EQU   $RCA                                                     02959000
$SLASHAD EQU   $CDA+32                                                  02960000
$PASSON  EQU   $CDA+28                                                  02961000
$TOLBRTB EQU   $CDA+24                                                  02962000
$SCTPTR8 EQU   $CDA+20                                                  02963000
$SCTPTR  EQU   $CDA+16                                                  02964000
$TBWDPTR EQU   $CDA+12                                                  02965000
@NM00026 EQU   $CDA                                                     02966000
@NM00025 EQU   $SCTTBLE+98                                              02967000
$SCTLWTC EQU   $SCTTBLE+96                                              02968000
$SCTLWTA EQU   $SCTTBLE+92                                              02969000
#EXT     EQU   $SCTTBLE+88                                              02970000
#PASS    EQU   $SCTTBLE+84                                              02971000
#TABLE   EQU   $SCTTBLE+80                                              02972000
#MSGIDAC EQU   $SCTTBLE+78                                              02973000
@NM00024 EQU   $SCTTBLE+71                                              02974000
$RETMASK EQU   $SCTTBLE+70                                              02975000
$R249255 EQU   $ROUTMSK+29                                              02976000
$R241248 EQU   $ROUTMSK+28                                              02977000
$R233240 EQU   $ROUTMSK+27                                              02978000
$R225232 EQU   $ROUTMSK+26                                              02979000
$R217224 EQU   $ROUTMSK+25                                              02980000
$R209216 EQU   $ROUTMSK+24                                              02981000
$R201208 EQU   $ROUTMSK+23                                              02982000
$R193200 EQU   $ROUTMSK+22                                              02983000
$R185192 EQU   $ROUTMSK+21                                              02984000
$R177184 EQU   $ROUTMSK+20                                              02985000
$R169176 EQU   $ROUTMSK+19                                              02986000
$R161168 EQU   $ROUTMSK+18                                              02987000
$R153160 EQU   $ROUTMSK+17                                              02988000
$R145152 EQU   $ROUTMSK+16                                              02989000
$R137144 EQU   $ROUTMSK+15                                              02990000
$R129136 EQU   $ROUTMSK+14                                              02991000
$R121128 EQU   $ROUTMSK+13                                              02992000
$R113120 EQU   $ROUTMSK+12                                              02993000
$R105112 EQU   $ROUTMSK+11                                              02994000
$R097104 EQU   $ROUTMSK+10                                              02995000
$R089096 EQU   $ROUTMSK+9                                               02996000
$R081088 EQU   $ROUTMSK+8                                               02997000
$R073080 EQU   $ROUTMSK+7                                               02998000
$R065072 EQU   $ROUTMSK+6                                               02999000
$R057064 EQU   $ROUTMSK+5                                               03000000
$R049056 EQU   $ROUTMSK+4                                               03001000
$R041048 EQU   $ROUTMSK+3                                               03002000
$R033040 EQU   $ROUTMSK+2                                               03003000
$R025032 EQU   $ROUTMSK+1                                               03004000
$R017024 EQU   $ROUTMSK                                                 03005000
$TOTFLG2 EQU   $SCTTBLE+39                                              03006000
@NM00023 EQU   $TOTFLG1                                                 03007000
@NM00022 EQU   $TOTFLG1                                                 03008000
@NM00021 EQU   $TOTFLG1                                                 03009000
$CURELOD EQU   $TOTFLG1                                                 03010000
$CTEQTT  EQU   $TOTFLG1                                                 03011000
@NM00020 EQU   $TOTFLG1                                                 03012000
@NM00019 EQU   $TOTFLG1                                                 03013000
$LINESHR EQU   $TOTFLG1                                                 03014000
@NM00018 EQU   $OLTFLG2                                                 03015000
@NM00017 EQU   $OLTFLG2                                                 03016000
@NM00016 EQU   $OLTFLG2                                                 03017000
@NM00015 EQU   $OLTFLG2                                                 03018000
@NM00014 EQU   $OLTFLG2                                                 03019000
@NM00013 EQU   $OLTFLG2                                                 03020000
@NM00012 EQU   $OLTFLG2                                                 03021000
$TALK    EQU   $OLTFLG2                                                 03022000
$DYCOM   EQU   $OLTFLGS                                                 03023000
@NM00011 EQU   $OLTFLGS                                                 03024000
$TRACE   EQU   $OLTFLGS                                                 03025000
$RETCODE EQU   $OLTFLGS                                                 03026000
$CONTCB  EQU   $OLTFLGS                                                 03027000
$RETAIN  EQU   $OLTFLGS                                                 03028000
$CLEANRT EQU   $OLTFLGS                                                 03029000
$MANINTV EQU   $OLTFLGS                                                 03030000
$OLTSIZE EQU   $SCTTBLE+34                                              03031000
$QSCTMOD EQU   $EXECFLG                                                 03032000
$CTRLMOD EQU   $EXECFLG                                                 03033000
$LSTPDEV EQU   $EXECFLG                                                 03034000
$ERRCNT  EQU   $EXECFLG                                                 03035000
$RTNSLCT EQU   $EXECFLG                                                 03036000
$MULTDEV EQU   $EXECFLG                                                 03037000
@NM00010 EQU   $EXECFLG                                                 03038000
$RMSKCNT EQU   $SCTTBLE+32                                              03039000
$SYNAME  EQU   $CDS8T19+4                                               03040000
$EXTSIG  EQU   $CDS8T19+3                                               03041000
$CDFLGS  EQU   $CDS8T19+1                                               03042000
$CDSCNT  EQU   $CDS8T19                                                 03043000
$PDEVDSC EQU   $SCTTBLE+16                                              03044000
$PDEVADR EQU   $SCTTBLE+12                                              03045000
$COMMCN  EQU   $CDSFLGS                                                 03046000
$CUSTSYM EQU   $CDSFLGS                                                 03047000
$TWOCHSW EQU   $CDSFLGS                                                 03048000
$SYMNAME EQU   $CDSFLGS                                                 03049000
$EXTINTC EQU   $CDSFLGS                                                 03050000
$CEVOL   EQU   $CDSFLGS                                                 03051000
$SHARED  EQU   $CDSFLGS                                                 03052000
$FPM     EQU   $CDSFLGS                                                 03053000
$LASTSUB EQU   $PDEVFLG                                                 03054000
@NM00009 EQU   $PDEVFLG                                                 03055000
@NM00008 EQU   $PDEVFLG                                                 03056000
@NM00007 EQU   $PDEVFLG                                                 03057000
$LASTDEV EQU   $PDEVFLG                                                 03058000
@NM00006 EQU   $PDEVFLG                                                 03059000
$EXFILPT EQU   $PDEVFLG                                                 03060000
$FPMOLD  EQU   $PDEVFLG                                                 03061000
$TSSSYM  EQU   $SCTTBLE+8                                               03062000
$SCTLEVL EQU   $SCTTBLE+7                                               03063000
$DRIVER  EQU   $SCTTBLE+6                                               03064000
$RT0916  EQU   $SCTTBLE+5                                               03065000
$RT0108  EQU   $SCTTBLE+4                                               03066000
$LOOPTST EQU   $ERROPT                                                  03067000
$LOOPERR EQU   $ERROPT                                                  03068000
$NERRPRT EQU   $ERROPT                                                  03069000
$NOCNTRL EQU   $ERROPT                                                  03070000
$ALTPRNT EQU   $ERROPT                                                  03071000
$CATERR  EQU   $ERROPT                                                  03072000
$ASTERIK EQU   $ERROPT                                                  03073000
$TESTERR EQU   $ERROPT                                                  03074000
$FSTCOMM EQU   $TESTOPT                                                 03075000
$INDEFLP EQU   $TESTOPT                                                 03076000
$NOPRT   EQU   $TESTOPT                                                 03077000
$PARAPRT EQU   $TESTOPT                                                 03078000
@NM00005 EQU   $TESTOPT                                                 03079000
$ERRLPCT EQU   $SCTTBLE                                                 03080000
$TLTEND  EQU   $RCAAREA+945                                             03081000
$CNSLID  EQU   $RCAAREA+936                                             03082000
$EXITSAV EQU   $RCAAREA+864                                             03083000
$TRASCII EQU   $RCAAREA+608                                             03084000
@NM00004 EQU   $RCAAREA+605                                             03085000
$VTAMEND EQU   $RCAFLG                                                  03086000
$TPPOSTD EQU   $RCAFLG                                                  03087000
$NEWCT   EQU   $RCAFLG                                                  03088000
$ABNDALL EQU   $RCAFLG                                                  03089000
$CONSOLE EQU   $RCAFLG                                                  03090000
$TPLOGON EQU   $RCAFLG                                                  03091000
$DEVAREA EQU   $RCAAREA+600                                             03092000
$CTDVAR  EQU   $RCAAREA+596                                             03093000
$BUFFS   EQU   $RCAAREA+464                                             03094000
$TLTNIB  EQU   $CONSTNT+140                                             03095000
$TLTPRPL EQU   $CONSTNT+20                                              03096000
@NM00003 EQU   $CONSTNT+4                                               03097000
@NM00002 EQU   $CONSTNT+2                                               03098000
$CTNAME  EQU   $POINTER+132                                             03099000
$CTARGX  EQU   $POINTER+128                                             03100000
$COMINT  EQU   $POINTER+120                                             03101000
$QUEHNDL EQU   $POINTER+116                                             03102000
@NM00001 EQU   $POINTER+36                                              03103000
$RTNPTR  EQU   $POINTER+32                                              03104000
$TLTECB1 EQU   $POINTER+24                                              03105000
$CVTSAVE EQU   $POINTER+4                                               03106000
$TLTACB  EQU   $RCAAREA                                                 03107000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03108000
@RT00129 EQU   C14C0002                                                 03109000
@RT00153 EQU   C14C0004                                                 03110000
@RT00168 EQU   C14C0035                                                 03111000
@RT00205 EQU   C14C006A                                                 03112000
@RT00209 EQU   C14C0004                                                 03113000
@RT00219 EQU   C14C006A                                                 03114000
@RF00219 EQU   C14C0007                                                 03115000
@RT00227 EQU   C14C006A                                                 03116000
@RT00280 EQU   C14C0033                                                 03117000
@RT00286 EQU   C14C0006                                                 03118000
@RT00295 EQU   C14C0005                                                 03119000
@RT00305 EQU   C14C0001                                                 03120000
@RT00333 EQU   C14C0011                                                 03121000
@RT00335 EQU   C14C0013                                                 03122000
@RT00341 EQU   C14C0011                                                 03123000
@RT00343 EQU   C14C0011                                                 03124000
@ENDDATA EQU   *                                                        03125000
         END   ISTCC014,(C'PLS2135',0702,79078)                         03126000
