         TITLE 'DUMMY MODULE- ISTEC000'                                 00001000
*                                                                  0001 00002000
ISTEC000 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTEC000  78.336'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*/********************************************************************/ 00013000
*/*         DUMMY MODULE USED TO MARK THE END OF ISTOLTEP            */ 00014000
*/*01* CHANGE-ACTIVITY=AS FOLLOWS                                    */ 00015000
*/*      CHANGE DESCRIPTIONS                                         */ 00016000
*/*      NEW MODULE-FIRST REL 29 @DL29H00                            */ 00017000
*/********************************************************************/ 00018000
*                                                                  0002 00019000
*   END;                                                           0002 00020000
@EL00001 DS    0H                                                  0002 00021000
@EF00001 DS    0H                                                  0002 00022000
@ER00001 BR    @14                                                 0002 00023000
@DATA    DS    0H                                                       00024000
         DS    0F                                                       00025000
         DS    0F                                                       00026000
         DS    0D                                                       00027000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00028000
@01      EQU   01                                                       00029000
@02      EQU   02                                                       00030000
@03      EQU   03                                                       00031000
@04      EQU   04                                                       00032000
@05      EQU   05                                                       00033000
@06      EQU   06                                                       00034000
@07      EQU   07                                                       00035000
@08      EQU   08                                                       00036000
@09      EQU   09                                                       00037000
@10      EQU   10                                                       00038000
@11      EQU   11                                                       00039000
@12      EQU   12                                                       00040000
@13      EQU   13                                                       00041000
@14      EQU   14                                                       00042000
@15      EQU   15                                                       00043000
@ENDDATA EQU   *                                                        00044000
         END   ISTEC000,(C'PLS1217',0702,78336)                         00045000
