         TITLE 'EXECUTION SEQUENCE CONTROLLER'                          00001000
         PRINT OFF                                                      00002000
         PRINT ON                                                       00003000
ISTESC01   CSECT                                                        00004000
  USING ISTESC01,CESCBASE                                               00005000
*DVTPTR = RPHDVTA;                   /* COVER DVT */               0032 00006000
         L     DVTPTR,RPHDVTA(,RPHPTR)                             0032 00007000
*IF DVTEXITF = ON                    /* IS THIS AN EXIT ENTRY? */  0033 00008000
*   THEN                                                           0033 00009000
         TM    DVTEXITF(DVTPTR),B'10000000'                        0033 00010000
         BNO   @RF00033                                            0033 00011000
*         DO; /* TPEXIT  NORM */                                   0034 00012000
*                                                                  0035 00013000
*                                                                  0035 00014000
*         DO;                                                      0035 00015000
*         END;                                                     0036 00016000
*                                                                  0037 00017000
*                                                                  0037 00018000
*         DO;                                                      0037 00019000
*         RFY (GPR15P) RSTD;                                       0038 00020000
*         END;                                                     0039 00021000
*                                                                  0040 00022000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0040 00023000
*GEN (PRINT OFF);                                                  0040 00024000
         PRINT OFF                                                      00025000
*/* PROCESS ANCHOR BLOCK                                              * 00026000
*/*  REVISIONS                                         004 11/17/75  */ 00027000
*/*  REVISIONS                           DCR 4566.00 10/10/78 @D11AKJY* 00028000
*DCL  1  ISTPAB BDY(DWORD) BASED,                                  0041 00029000
*       2  PABWQCHN CHAR(8) BDY(DWORD), /* CPS SWAP FIELD FOR NEQ&CHN * 00030000
*        3  PABWEQA PTR(31) BDY(WORD), /* WORK ELEMENT QUEUE ADDRESS  * 00031000
*           4  PABWEQG BIT(1),         /* GATING BIT                  * 00032000
*           4  PABRSV01 BIT(7),        /* RESERVED                    * 00033000
*           4  PABWEQP PTR(24),        /* WKEL PTR                    * 00034000
*        3  PABCHAIN PTR(31) BDY(WORD), /* APS CHAIN                  * 00035000
*           4  PABCHNG BIT(1),         /* GATING BIT                  * 00036000
*           4  PABRESCH BIT(1),        /* RESCHEDULE PAB AT        0041 00037000
*                                         TPEXIT                      * 00038000
*           4  PABCDP BIT(1),          /* CLOSE DST/CHANGE IN PROGRESS* 00039000
*           4  PABUNCON BIT(1),        /* UNCONDITIONALLY RESCHEDULE    00040000
*                                         PAB AT TPEXIT               * 00041000
*           4  PABRESET BIT(1),        /* RESET ISSUED ON THIS PAB    * 00042000
*           4  PABRUNNG BIT(1),        /* PAB RUNNING                 * 00043000
*              5  PABQUED  BIT(1),     /* PAB IS QUED ON APT          * 00044000
*           4  PABDELAY BIT(1),        /* DELAY OPTION USED           * 00045000
*           4  PABRSV02 BIT(1),        /* RESERVED                    * 00046000
*           4  PABCHNGP PTR(24),       /* PSS CHAIN PTR               * 00047000
*        2  PABOFFST PTR(8),           /* OFFSET FROM CONTROL BLOCK   * 00048000
*        2  PABDVTA PTR(24),           /* DVT ADDRESS                 * 00049000
*        2  PABRPHFG PTR(31),          /* SCHED FLAGS AND RPH         * 00050000
*           3  PABFLAGS BIT(8),        /* SCHEDULING FLAGS            * 00051000
*              4  PABAPYP BIT(1),      /* APPLICATION IS A USER EXIT  * 00052000
*              4  PABPRIOR BIT(1),     /* IMMEDIATE PRIORITY          * 00053000
*              4  PABXTND  BIT(1),     /* 1=PAB EXTENSION IS PRESENT    00054000
*                                                             @D11AKJY* 00055000
*              4  PABDYNAM BIT(1),     /* DYNAMIC                     * 00056000
*              4  PABSSN BIT(1),       /* SYSTEM SERVICES             * 00057000
*              4  PABERLCK BIT(1),     /* PAB ERROR LOCK FLAG         * 00058000
*                 5  PABERRLK BIT(1),  /* ERROR LOCK                  * 00059000
*                    6  PABERLOK BIT(1), /* ERROR LOCK                * 00060000
*/*    ABNORMAL TO ALLOW VARY COMPARE AND SWAP                        * 00061000
*              4  PABINHBT BIT(1) ABNL,/* 1=INHIBIT TRAFFIC,0=NO      * 00062000
*              4  PABNODQ BIT(1),      /* DO NOT DEQ WORK ELEMENT     * 00063000
*                                      /* NOT USED BY DOS             * 00064000
*           3  PABRPHA PTR(24),        /* RPL HEADER ADDRESS          * 00065000
*        2  PABEND CHAR(*);            /*                     @D11AKJY* 00066000
*DCL 1  PABXTNSN DEF(PABEND),          /* PAB EXTENSION - PRESENT ONLY  00067000
*                                         IF PABXTND=1        @D11AKJY* 00068000
*      2  PABLAST PTR,                 /* PTR TO YOUNGEST ELEMENT ON    00069000
*                                         PAB WKE QUEUE       @D11AKJY* 00070000
*      2  PABLOCK CHAR(LENGTH(ISTLOK)),/* QUEUE LOCK          @D11AKJY* 00071000
*      2  PABNPSSQ PTR,                /* NON-PSS QUE ANCHOR  @D11AKJY* 00072000
*      2  * CHAR(4);                   /* RESERVED --- TO PRESERVE 0042 00073000
*                                         ALIGNMENT           @D11AKJY* 00074000
*/* LENGTH(ISTXPAB) GIVES LENGTH OF EXTENDED PAB              @D11AKJY* 00075000
*DCL ISTXPAB CHAR(LENGTH(ISTPAB)+LENGTH(PABXTNSN)) BASED;          0043 00076000
*                                                                  0043 00077000
*DCL PABWEQG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABWEQG OFF     * 00078000
*    PABWEQG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABWEQG ON      * 00079000
*    PABCHNG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABCHNG OFF     * 00080000
*    PABCHNG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABCHNG ON      * 00081000
*    PABRESC0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PABRESCH OFF    * 00082000
*    PABRESC1 BIT(32) CONSTANT('40000000'X),  /* TURN PABRESCH ON     * 00083000
*    PABCDP0  BIT(32) CONSTANT ('DFFFFFFF'X), /* TURN PABCDP OFF      * 00084000
*    PABCDP1  BIT(32) CONSTANT ('20000000'X), /* TURN PABCDP ON       * 00085000
*    PABERLK0 BIT(32) CONSTANT('FBFFFFFF'X),  /* TURN PABERRLK ON     * 00086000
*    PABERLK1 BIT(32) CONSTANT('04000000'X),  /* TURN PABERRLK OFF    * 00087000
*    PABUNCO0 BIT(32) CONSTANT('EFFFFFFF'X),  /* TURN PABUNCON OFF    * 00088000
*    PABUNCO1 BIT(32) CONSTANT('10000000'X),  /* TURN PABUNCON ON     * 00089000
*    PABPRIR0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PAB PRIOR OFF   * 00090000
*    PABPRIR1 BIT(32) CONSTANT('40000000'X),  /* TURN PAB PRIOR ON    * 00091000
*    PABRST0  BIT(32) CONSTANT('F7FFFFFF'X),  /* TURN PABRESET OFF    * 00092000
*    PABRST1  BIT(32) CONSTANT('08000000'X),  /* TURN PABRESET ON     * 00093000
*    PABDLAY0 BIT(32) CONSTANT('FDFFFFFF'X),  /* TURN PAB DELAY OFF   * 00094000
*    PABDLAY1 BIT(32) CONSTANT('02000000'X);  /* TURN PAB DELAY ON    * 00095000
*/*     DYNAMIC PAB                                                  */ 00096000
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE                */ 00097000
*       2  DYPTYPE CHAR(1),        /* CONTROL BLOCK TYPE CODE        */ 00098000
*       2  DYPLNGTH PTR(8),        /* CONTROL BLOCK LENGTH (BYTES)   */ 00099000
*       2 DYPFLGS CHAR(2),         /* FLAGS                          */ 00100000
*       2 DYPCHAIN PTR(31),        /* CHAIN POINTER                  */ 00101000
*         3 DYPPACTB PTR(31),      /* POINTER TO PACE TABLE          */ 00102000
*       2 DYPTSKID PTR(31),        /* TASKID OR PTR TO PSS TABLES    */ 00103000
*       2 DYPPACMD PTR(31),        /* POINTER TO PACING MODULE       */ 00104000
*         3 DYPOCRPH PTR(31),      /* POINTER TO ISTOCCCC'S RPH DURING  00105000
*                                     ASYCHRONOUS CLSDST PROCESSING  */ 00106000
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF PAB   */ 00107000
*DCL DYTYP BIT(8) CONSTANT('11'X); /* TYPE                           */ 00108000
*/* LENGTH(ISTXDYP) GIVES LENGTH OF EXTENDED DYPAB                   */ 00109000
*/*                                    DCR 4566.00 10/10/78  @D11AKJY*/ 00110000
*DCL ISTXDYP CHAR(LENGTH(ISTDYPAB)+LENGTH(PABXTNSN)) BASED;/*@D11AKJY*/ 00111000
*/********************************************************************/ 00112000
*/*                                                                  */ 00113000
*/*  MACRO-NAME: ISTATCVT                                            */ 00114000
*/*                                                                  */ 00115000
*/*  MACRO-DESCRIPTIVE-NAME: VTAM COMMUNICATIONS VECTOR TABLE        */ 00116000
*/*                          MAPPING MACRO                           */ 00117000
*/*                                                                  */ 00118000
*/*  MACRO-COPYRIGHT: NONE                                           */ 00119000
*/*                                                                  */ 00120000
*/*  MACRO-STATUS: VTAM RELEASE 4.0 - XXXXXX UNIQUE                  */ 00121000
*/*                                                                  */ 00122000
*/*  MACRO-FUNCTION: TO PROVIDE A VTAM PL/S MAPPING FOR THE          */ 00123000
*/*                  VTAM COMMUNICATIONS VECTOR TABLE                */ 00124000
*/*                                                                  */ 00125000
*/*  MACRO-NOTES: AT A MINIMUM, THE FOLLOWING VTAM PROCESSORS        */ 00126000
*/*               MUST BE RECOMPILED WHEN THE SIZE OF THE            */ 00127000
*/*               VTAM CVT CHANGES:                                  */ 00128000
*/*                                                                  */ 00129000
*/*                    XXXXXXXX                                      */ 00130000
*/*                                                                  */ 00131000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 00132000
*/*                                                                  */ 00133000
*/*    REQUIRED-INNER-MAPS: ISTDYPAB ISTPAB   ISTLOK                 */ 00134000
*/*                                                                  */ 00135000
*/*    REQUIRED-BY: NONE                                             */ 00136000
*/*                                                                  */ 00137000
*/*  MACRO-DATE-CREATED: NOTKNOWN                                    */ 00138000
*/*                                                                  */ 00139000
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */ 00140000
*/*        01 - 09/05/77 - FOR SNA4 D4477.03, D4478.01, AND          */ 00141000
*/*                                 D4480.00                 @D14AKMC*/ 00142000
*/*        02 - 10/20/77 - FOR SNA4 D4478.08                 @D14AKMP*/ 00143000
*/*        03 - 01/04/78 - FOR SNA4 D4487.01, D4506.00       @D14AKMC*/ 00144000
*/*        04 - 01/10/78 - FOR SNA4 D4500.00                 @D14AKMC*/ 00145000
*/*        05 - 02/17/78 - FOR SNA4 DM41522                  @D14AKMC*/ 00146000
*/*        06 - 03/16/78 - FOR SNA4 D4487.02                 @D14AKMC*/ 00147000
*/*        07 - 04/06/78 - FOR SNA4 D4517.00                 @D14AKMC*/ 00148000
*/*        08 - 04/11/78 - FOR SNA4 D4517.03                 @D14AKMC*/ 00149000
*/*        09 - 05/11/78 - FOR SNA4 D4536.01,4550.01,4536.00 @D14AKMC*/ 00150000
*/*        10 - 05/18/78 - FOR SNA4 D4527.05                 @D14AKMC*/ 00151000
*/*        11 - 05/23/78 - FOR SNA4 D4536.06                 @D14AKMC*/ 00152000
*/*        12 - 07/12/78 - FOR SNA4 OX21978                  @D14AKMC*/ 00153000
*/*        13 - 07/27/78 - FOR SNA4 D4575.00 AND D4578.00    @D14AKMC*/ 00154000
*/*        14 - 07/31/78 - FOR SNA4 D4572.00                 @D14AKMC*/ 00155000
*/*        15 - 09/08/78 - FOR SNA4 D4602.00                 @D14AKMC*/ 00156000
*/*        16 - 09/18/78 - FOR SNA4 D4587.00                 @D14AKMC*/ 00157000
*/*        17 - 09/28/78 - FOR SNA4 D4610.00 & D4551.00      @G70AKMC*/ 00158000
*/*                                 AND DM42669                      */ 00159000
*/*        18 - 10/12/78 - FOR SNA4 D4566.01                 @D14AKNL*/ 00160000
*/*                                                                  */ 00161000
*/********************************************************************/ 00162000
*DCL ATCLCPTR PTR LOCATION(1032); /* LOCATION OF OS/MVS VTAM CVT     */ 00163000
*                                                                  0048 00164000
*/*------------------------------------------------------------------*/ 00165000
*/*   S Y S T E M   I N D E P E N D E N T   S E C T I O N            */ 00166000
*/*------------------------------------------------------------------*/ 00167000
*DCL                                                               0049 00168000
*  1 ISTATCVT BDY(DWORD) BASED(ATCLCPTR),                          0049 00169000
*    2 ATCRPTCH BDY(DWORD),     /* VTAM RELEASE AND PATCH          0049 00170000
*                                  AREA ADDRESS              @D14AKMP*/ 00171000
*      3 ATCVTLVL CHAR(4),      /* VTAM RELEASE LEVEL                */ 00172000
*      3 ATCPTCHA PTR,          /* PTR TO VTAM PATCH AREA            */ 00173000
*    2 ATCITFLD BDY(DWORD),     /* VTAM INTERNAL TRACE             0049 00174000
*                                  FIELDS                    @D14AKMP*/ 00175000
*      3 ATCITPRM CHAR(4),      /* VIT START PARAMETERS MAPPED BY  0049 00176000
*                                  NCSPLITF                  @G70AKMC*/ 00177000
*      3 ATCITTBL PTR,          /* PTR TO INTERNAL TRACE           0049 00178000
*                                  TABLE                     @D34CKMC*/ 00179000
*      3 ATCITCDS CHAR(8) BDY(DWORD), /* CDS FIELD FOR             0049 00180000
*                                  INTERNAL TRACE            @D34CKMC*/ 00181000
*        4 ATCITRPH PTR,        /* PTR TO INTERNAL TRACE           0049 00182000
*                                  RPH                       @D34CKMC*/ 00183000
*        4 ATCITFLG CHAR(4) BDY(WORD), /* INT TRACE FLAGS    @D34CKMC*/ 00184000
*          5 ATCITCNT FIXED(15),/* INT TRACE USE COUNT       @D34CKMC*/ 00185000
*          5 ATCITRA1 BIT(16),  /* TRACING FLAGS FOR               0049 00186000
*                                  INTERNAL TRACE (MUST            0049 00187000
*                                  BE IN SAME ORDER AS             0049 00188000
*                                  NCSPL FLAGS <NCSITFL1>)   @G70AKMC*/ 00189000
*            6 ATCITAPI BIT(1), /* 1=API TRACE ACTIVE        @D34CKMC*/ 00190000
*            6 ATCITLCK BIT(1), /* 1=LOCKING TRACE ACTIVE    @D34CKMC*/ 00191000
*            6 ATCITPSS BIT(1), /* 1=PSS TRACE ACTIVE        @D34CKMC*/ 00192000
*            6 ATCITSMS BIT(1), /* 1=SMS TRACE ACTIVE        @D34CKMC*/ 00193000
*            6 ATCITPIU BIT(1), /* 1=PIU TRACE ACTIVE        @D436810*/ 00194000
*            6 ATCITMSG BIT(1), /* 1=MSG TRACE ACTIVE        @D436810*/ 00195000
*            6 ATCITSCP BIT(1), /* 1=SSCP TRACE ACTIVE       @D436810*/ 00196000
*            6 * BIT(9),        /* RESERVED FOR TRACING      @G70AKMC*/ 00197000
*    2 ATCITPAB                                                    0049 00198000
*       BDY(DWORD)                                                 0049 00199000
*        CHAR(LENGTH(ISTDYPAB)),/* VTAM INTERNAL TRACE             0049 00200000
*                                  DYNAMIC PAB               @D34CKMC*/ 00201000
*    2 ATCTMRPB                                                    0049 00202000
*       BDY(DWORD)                                                 0049 00203000
*        CHAR(LENGTH(ISTDYPAB)),/* VTAM TIMER SERVICES PAB   @D433021*/ 00204000
*    2 ATCSMPAB                                                    0049 00205000
*       BDY(DWORD)                                                 0049 00206000
*        CHAR(LENGTH(ISTDYPAB)),/* SSCP DYNAMIC PAB          @D14AKMC*/ 00207000
*      3 *        CHAR(16),     /* NOT USED - UNAVAILABLE    @D14AKMC*/ 00208000
*      3 ATCCSPAB                                                  0049 00209000
*         CHAR(LENGTH(ISTPAB)), /* CONFIGURATION SERVICES          0049 00210000
*                                  PAB                       @D14AKMP*/ 00211000
*    2 ATCTCIPB                                                    0049 00212000
*       BDY(DWORD)                                                 0049 00213000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS        0049 00214000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 00215000
*    2 ATCVDPAB                                                    0049 00216000
*       BDY(DWORD)                                                 0049 00217000
*        CHAR(LENGTH(ISTDYPAB)),/* SSCP COMMAND PROCESSING   @D14AKNL*/ 00218000
*      3 ATCFEPAB CHAR(LENGTH(ISTPAB))                             0049 00219000
*         BDY(DWORD),           /* FRONT END ROUTER PAB FOR        0049 00220000
*                                  EXTENDED PABS             @D14AKNL*/ 00221000
*      3 *        CHAR(LENGTH(ISTPAB))                             0049 00222000
*         BDY(DWORD),           /* SSCP COMMAND PROCESSING         0049 00223000
*                                  PAB                       @D14AKNL*/ 00224000
*    2 ATCPOPAB                                                    0049 00225000
*       BDY(DWORD)                                                 0049 00226000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS        0049 00227000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 00228000
*    2 ATCPXPAB                                                    0049 00229000
*       BDY(DWORD)                                                 0049 00230000
*        CHAR(LENGTH(ISTDYPAB)),/* DYNAMIC BUFFER POOL             0049 00231000
*                                  EXPANSION DYNAMIC PAB             */ 00232000
*    2 ATCPUPAB                                                    0049 00233000
*       BDY(DWORD)                                                 0049 00234000
*        CHAR(LENGTH(ISTDYPAB)),/* PHYSICAL UNIT SERVICES          0049 00235000
*                                  DYNAMIC PAB                       */ 00236000
*    2 ATCPUIOP                                                    0049 00237000
*       BDY(DWORD)                                                 0049 00238000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS        0049 00239000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 00240000
*    2 ATCLUSRT                                                    0049 00241000
*       BDY(DWORD)                                                 0049 00242000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS        0049 00243000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 00244000
*    2 ATCNSPAB                                                    0049 00245000
*       BDY(DWORD)                                                 0049 00246000
*        CHAR(LENGTH(ISTDYPAB)),/* NOTE-THE DYPAB HEADER IS        0049 00247000
*                                  USED AS AN EXTENDED PAB   @D14AKNL*/ 00248000
*    2 ATCNOSPB                                                    0049 00249000
*       BDY(DWORD)                                                 0049 00250000
*        CHAR(LENGTH(ISTDYPAB)),                                   0049 00251000
*                           /* NETWORK OPERATOR SERVICES PAB @D14AKMC*/ 00252000
*    2 ATCLDTIL BDY(DWORD),     /* DUMP/LOAD/RESTART TASK          0049 00253000
*                                  INTERFACE LIST            @D14AKMP*/ 00254000
*      3 ATCLDNCS PTR,          /* DUMP/LOAD/RESTART WORK          0049 00255000
*                                  QUEUE ANCHOR              @D14AKMP*/ 00256000
*      3 ATCLDLST PTR,          /* PTR TO LAST ELEMENT ON Q. @D14AKMC*/ 00257000
*      3 ATCLDLCK CHAR(LENGTH(ISTLOK)), /* QUEUE LOCK        @D14AKMC*/ 00258000
*      3 ATCLDECB CHAR(4),      /* DUMP/LOAD/RESTART               0049 00259000
*                                  SUBTASK ECB                       */ 00260000
*    2 ATCACC00 PTR,            /* PTR TO ACTIVATE(PART-1)         0049 00261000
*                                  PROCESSOR -                     0049 00262000
*                                  ISTACC00                  @D14AKMC*/ 00263000
*    2 ATCACC01 PTR,            /* PTR TO ACTIVATE(PART-2)         0049 00264000
*                                  PROCESSOR -                     0049 00265000
*                                  ISTACC01                  @D14AKMC*/ 00266000
*    2 ATCAICTN PTR,            /* PTR TO APPLICATION              0049 00267000
*                                  PROGRAM INTERFACE               0049 00268000
*                                  (API) TRANSLATION               0049 00269000
*                                  PROCESSOR -                     0049 00270000
*                                  ISTAICTN                          */ 00271000
*    2 ATCAPI PTR,              /* PTR TO API PROGRAM              0049 00272000
*                                  INTERFACE ROUTING               0049 00273000
*                                  PROCESSOR -                     0049 00274000
*                                  ISTAICIR                          */ 00275000
*    2 ATCAICPT PTR,            /* PTR TO API POSTING              0049 00276000
*                                  PROCESSOR -                     0049 00277000
*                                  ISTAICPT                          */ 00278000
*    2 ATCAPCR5 PTR,            /* PTR TO CHECKPOINT/RESTART       0049 00279000
*                                  ROUTING PROCESSOR -             0049 00280000
*                                  ISTAPCR5                          */ 00281000
*    2 ATCAP33 PTR,             /* PTR TO TPUNLOCK                 0049 00282000
*                                  PROCESSOR -                     0049 00283000
*                                  ISTAPC33                          */ 00284000
*    2 ATCAP35 PTR,             /* PTR TO TPLOCK SHARED            0049 00285000
*                                  PROCESSOR -                     0049 00286000
*                                  ISTAPC35                          */ 00287000
*    2 ATCAP36 PTR,             /* PTR TO TPLOCK EXCLUSIVE         0049 00288000
*                                  PROCESSOR -                     0049 00289000
*                                  ISTAPC36                          */ 00290000
*    2 ATCAP39 PTR,             /* PTR TO TPUNLOCK ALL             0049 00291000
*                                  PROCESSOR -                     0049 00292000
*                                  ISTAPC39                          */ 00293000
*    2 ATCACCTA PTR,            /* PTR TO INSTALLATION             0049 00294000
*                                  ACCOUNTING ROUTINE -            0049 00295000
*                                  ISTAUCAG                          */ 00296000
*    2 ATCAUTHA PTR,            /* PTR TO INSTALLATION             0049 00297000
*                                  AUTHORIZATION ROUTINE -         0049 00298000
*                                  ISTAUCAT                          */ 00299000
*    2 ATCCPCNT PTR,            /* PTR TO CPNFY                    0049 00300000
*                                  PROCESSOR -                     0049 00301000
*                                  ISTCPCNT                  @D14AKMC*/ 00302000
*    2 ATCMSGP PTR,             /* PTR TO TPMSG                    0049 00303000
*                                  PROCESSOR -                     0049 00304000
*                                  ISTCFCTM                          */ 00305000
*    2 ATCCPCPP PTR,            /* PTR TO CPPOST/CPPURGE           0049 00306000
*                                  PROCESSOR -                     0049 00307000
*                                  ISTCPCPP                  @D14AKMP*/ 00308000
*    2 ATCCPCGR PTR,            /* PTR TO GETRUPE                  0049 00309000
*                                  PROCESSOR -                     0049 00310000
*                                  ISTCPCGR                          */ 00311000
*    2 ATCCPCFR PTR,            /* PTR TO FREERUPE                 0049 00312000
*                                  PROCESSOR -                     0049 00313000
*                                  ISTCPCFR                          */ 00314000
*    2 ATCMSGM PTR,             /* PTR TO TPMSG                    0049 00315000
*                                  MESSAGE CSECT -                 0049 00316000
*                                  ISTCFCMM                  @D14AKMC*/ 00317000
*    2 ATCCPCRT PTR,            /* PTR TO SESSION SERVICES         0049 00318000
*                                  ROUTING PROCESSOR -             0049 00319000
*                                  ISTCPCRT                          */ 00320000
*    2 ATCDEC00 PTR,            /* PTR TO DEACTIVATE(PART-1)       0049 00321000
*                                  PROCESSOR -                     0049 00322000
*                                  ISTDEC00                  @D14AKMC*/ 00323000
*    2 ATCDEC01 PTR,            /* PTR TO DEACTIVATE(PART-2)       0049 00324000
*                                  PROCESSOR -                     0049 00325000
*                                  ISTDEC01                  @D14AKMC*/ 00326000
*    2 ATCESC01 PTR,            /* PTR TO TPESC                    0049 00327000
*                                  PROCESSOR -                     0049 00328000
*                                  ISTESC01                          */ 00329000
*    2 ATCESC02 PTR,            /* PTR TO TPDVTS                   0049 00330000
*                                  PROCESSOR -                     0049 00331000
*                                  ISTESC02                          */ 00332000
*    2 ATCADEL PTR,             /* PTR TO ADELETE                  0049 00333000
*                                  PROCESSOR -                     0049 00334000
*                                  ISTINCAD                          */ 00335000
*    2 ATCALOAD PTR,            /* PTR TO ALOAD                    0049 00336000
*                                  PROCESSOR -                     0049 00337000
*                                  ISTINCAL                          */ 00338000
*    2 ATCBLDLA PTR,            /* PTR TO BLDL                     0049 00339000
*                                  PROCESSOR -                     0049 00340000
*                                  ISTINCBL                          */ 00341000
*    2 ATCINCCO PTR,            /* PTR TO CPCALL OUTBOUND          0049 00342000
*                                  PROCESSOR -                     0049 00343000
*                                  ISTINCCO                          */ 00344000
*    2 ATCINCCI PTR,            /* PTR TO CPCALL INBOUND           0049 00345000
*                                  PROCESSOR -                     0049 00346000
*                                  ISTINCCI                          */ 00347000
*    2 ATCINCF1 PTR,            /* PTR TO SEND REQUEST UNIT        0049 00348000
*                                  INTERFACE PROCESSOR -           0049 00349000
*                                  ISTINCF1                  @D14AKMC*/ 00350000
*    2 ATCNOCRT PTR,            /* PTR TO ISTNOCRT           @D14AKMC*/ 00351000
*    2 ATCINCLQ PTR,            /* PTR TO CPFIND, ALIAS            0049 00352000
*                                  RDTADD/FIND/DEL                 0049 00353000
*                                  PROCESSOR -                     0049 00354000
*                                  ISTINCLQ                          */ 00355000
*    2 ATCINCPH PTR,            /* PTR TO INIT/TERM                0049 00356000
*                                  KEYWORD SCAN                    0049 00357000
*                                  PROCESSOR -                     0049 00358000
*                                  ISTINCPH                  @D14AKMC*/ 00359000
*    2 ATCINCRD PTR,            /* PTR TO INIT/TERM CARD           0049 00360000
*                                  READ PROCESSOR -                0049 00361000
*                                  ISTINCRD                  @D14AKMC*/ 00362000
*    2 ATCSRTAB PTR,            /* PTR TO LOGON MODE TABLE         0049 00363000
*                                  SEARCH PROCESSOR -              0049 00364000
*                                  ISTINCSH                          */ 00365000
*    2 ATCINCS1 PTR,            /* PTR TO SSCP/PUNS/LUS            0049 00366000
*                                  SEND RESPONSE                   0049 00367000
*                                  PROCESSOR -                     0049 00368000
*                                  ISTINCS1                          */ 00369000
*    2 ATCINCTQ PTR,            /* PTR TO TIMER SERVICES           0049 00370000
*                                  PROCESSOR -                     0049 00371000
*                                  ISTINCTQ                  @D34CKMC*/ 00372000
*    2 ATCINCU6 PTR,            /* PTR TO USS MESSAGE              0049 00373000
*                                  BUILD PROCESSOR -               0049 00374000
*                                  ISTINCU6                  @D14AKMC*/ 00375000
*    2 ATCINCW3 PTR,            /* PTR TO GETNCSPL/FRENCSPL        0049 00376000
*                                  PROCESSOR -                     0049 00377000
*                                  ISTINCW3                          */ 00378000
*    2 ATCINCY5 PTR,            /* PTR TO DISCONNECTION            0049 00379000
*                                  PROCESSOR -                     0049 00380000
*                                  ISTINCY5                  @D14AKMC*/ 00381000
*    2 ATCLUCRT PTR,            /* PTR TO LOGICAL UNIT             0049 00382000
*                                  SERVICES ROUTING                0049 00383000
*                                  PROCESSOR -                     0049 00384000
*                                  ISTLUCRT                          */ 00385000
*    2 ATCSRTDF PTR,            /* PTR TO SRTDEL/FIND              0049 00386000
*                                  PROCESSOR -                     0049 00387000
*                                  ISTOCCDF                          */ 00388000
*    2 ATCOCCFP PTR,            /* PTR TO FMCBADD/DEL              0049 00389000
*                                  PROCESSOR -                     0049 00390000
*                                  ISTOCCFP                          */ 00391000
*    2 ATCOCCFS PTR,            /* PTR TO LUCB LIE                 0049 00392000
*                                  PROCESSOR -                     0049 00393000
*                                  ISTOCCFS                  @D14AKMC*/ 00394000
*    2 ATCOCRT PTR,             /* PTR TO OPEN/CLOSE               0049 00395000
*                                  ROUTING PROCESSOR -             0049 00396000
*                                  ISTOCCRT                          */ 00397000
*    2 ATCSRTAD PTR,            /* PTR TO SRTADD                   0049 00398000
*                                  PROCESSOR -                     0049 00399000
*                                  ISTOCCSA                          */ 00400000
*    2 ATCSTMA PTR,             /* PTR TO STORAGE MANAGEMENT       0049 00401000
*                                  INITIALIZATION                  0049 00402000
*                                  PROCESSOR -                     0049 00403000
*                                  ISTORCBP (DOS/VS)               0049 00404000
*                                  ISTORFPO (OS/VS )                 */ 00405000
*    2 ATCGTSTR PTR,            /* PTR TO GETSTOR                  0049 00406000
*                                  PROCESSOR -                     0049 00407000
*                                  ISTORCGS (DOS/VS)               0049 00408000
*                                  ISTORFSR (OS/VS )                 */ 00409000
*      3 ATCFRSTR PTR,          /* PTR TO FREESTOR                 0049 00410000
*                                  PROCESSOR -                     0049 00411000
*                                  ISTORCGS (DOS/VS)               0049 00412000
*                                  ISTORFSR (OS/VS )                 */ 00413000
*    2 ATCORCAF PTR,            /* PTR TO VTALLOC/FREE             0049 00414000
*                                  PROCESSOR -                     0049 00415000
*                                  ISTORCAF                          */ 00416000
*    2 ATCORCPX PTR,            /* PTR TO SMS BUFFER POOL          0049 00417000
*                                  EXPANSION PROCESSOR -           0049 00418000
*                                  ISTORCPX                          */ 00419000
*    2 ATCSMRQ PTR,             /* PTR TO REQSTORE                 0049 00420000
*                                  PROCESSOR -                     0049 00421000
*                                  ISTORCRQ (DOS/VS)               0049 00422000
*                                  ISTORFBA (OS/VS )                 */ 00423000
*    2 ATCSMRS PTR,             /* PTR TO RELSTORE                 0049 00424000
*                                  PROCESSOR -                     0049 00425000
*                                  ISTORCRT (DOS/VS)               0049 00426000
*                                  ISTORFBD (OS/VS )                 */ 00427000
*    2 ATCPUCRT PTR,            /* PTR TO PHYSICAL UNIT            0049 00428000
*                                  SERVICES ROUTING                0049 00429000
*                                  PROCESSOR -                     0049 00430000
*                                  ISTPUCRT                          */ 00431000
*    2 ATCADD PTR,              /* PTR TO ADD QAB                  0049 00432000
*                                  PROCESSOR -                     0049 00433000
*                                  ISTRACAD                          */ 00434000
*    2 ATCRACIO PTR,            /* PTR TO I/O TRACE                0049 00435000
*                                  PROCESSOR -                     0049 00436000
*                                  ISTRACIO                  @D34CKMC*/ 00437000
*    2 ATCREMOV PTR,            /* PTR TO REMOVE QAB               0049 00438000
*                                  PROCESSOR -                     0049 00439000
*                                  ISTRACRE                          */ 00440000
*    2 ATCRACTI PTR,            /* PTR TO VTAM INTERNAL            0049 00441000
*                                  TRACE INITIALIZATION            0049 00442000
*                                  PROCESSOR -                     0049 00443000
*                                  ISTRACTI                  @D34CKMC*/ 00444000
*    2 ATCRACTR PTR,            /* PTR TO VTAM INTERNAL            0049 00445000
*                                  TRACE PROCESSOR -               0049 00446000
*                                  ISTRACTR                  @D34CKMC*/ 00447000
*    2 ATCTCLIM PTR,            /* TOLTEP I/O PAB DVT -            0049 00448000
*                                  ISTSC034                          */ 00449000
*    2 ATCCDADD PTR,            /* PTR TO CIDCTL (ADD) AND         0049 00450000
*                                  CIDCTL (ADDSNTPT)               0049 00451000
*                                  PROCESSOR -                     0049 00452000
*                                  ISTSDCCA                          */ 00453000
*    2 ATCCDDEL PTR,            /* PTR TO CIDCTL (DELETE)          0049 00454000
*                                  AND CIDCTL (DELSNTPT)           0049 00455000
*                                  PROCESSOR -                     0049 00456000
*                                  ISTSDCCD                          */ 00457000
*    2 ATCCDFND PTR,            /* PTR TO CIDCTL (FIND) AND        0049 00458000
*                                  CIDCTL (ICFIND)                 0049 00459000
*                                  PROCESSOR -                     0049 00460000
*                                  ISTSDCCF                          */ 00461000
*    2 ATCCDFIN PTR,            /* PTR TO CIDCTL (FINISH)          0049 00462000
*                                  AND CIDCTL (ICFINISH)           0049 00463000
*                                  PROCESSOR -                     0049 00464000
*                                  ISTSDCRR                          */ 00465000
*    2 ATCCDFDN PTR,            /* PTR TO CIDCTL (FINDNCB)         0049 00466000
*                                  PROCESSOR -                     0049 00467000
*                                  ISTSDCCN                          */ 00468000
*    2 ATCCDCCP PTR,            /* PTR TO CIDCTL (PAFIND)          0049 00469000
*                                  PROCESSOR -                     0049 00470000
*                                  ISTSDCCP                          */ 00471000
*    2 ATCCDCNA PTR,            /* PTR TO CIDCTL (NAADD)           0049 00472000
*                                  PROCESSOR -                     0049 00473000
*                                  ISTSDCNA                          */ 00474000
*    2 ATCCDCND PTR,            /* PTR TO CIDCTL (NADELETE)        0049 00475000
*                                  PROCESSOR -                     0049 00476000
*                                  ISTSDCND                          */ 00477000
*    2 ATCCDCNF PTR,            /* PTR TO NETWORK ADDRESS          0049 00478000
*                                  FIND PROCESSOR -                0049 00479000
*                                  ISTSDCNF                          */ 00480000
*    2 ATCCDCNR PTR,            /* PTR TO FMCB FAST LOOKUP         0049 00481000
*                                  TABLE CLEANUP                   0049 00482000
*                                  PROCESSOR -                     0049 00483000
*                                  ISTSDCNR                  @D14AKMC*/ 00484000
*    2 ATCDVLOD PTR,            /* PTR TO DEVICE NAMES             0049 00485000
*                                  TABLE -                         0049 00486000
*                                  ISTSDCOD                          */ 00487000
*    2 ATCTSVT PTR,             /* PTR TO THE TSC VECTOR           0049 00488000
*                                  TABLE -                         0049 00489000
*                                  ISTTSCVT                  @D34CKMC*/ 00490000
*    2 ATCTSCCI PTR,            /* PTR TO CHANNEL PROGRAM          0049 00491000
*                                  INITIALIZATION -                0049 00492000
*                                  ISTTSCCI                  @D34CKMC*/ 00493000
*    2 ATCTSCGR PTR,            /* PTR TO GENERAL RESPONSE         0049 00494000
*                                  ROUTINE -                       0049 00495000
*                                  ISTTSCGR                  @D34CKMC*/ 00496000
*    2 ATCTSCPR PTR,            /* PTR TO PATH CONTROL             0049 00497000
*                                  ROUTER -                        0049 00498000
*                                  ISTTSCPR                  @D34CKMC*/ 00499000
*    2 ATCTSCER PTR,            /* PTR TO ENABLED PATH             0049 00500000
*                                  CONTROL ROUTER -                0049 00501000
*                                  ISTTSCER                  @D34CKMC*/ 00502000
*    2 ATCTSCNS PTR,            /* PTR TO NO SESSION PAB           0049 00503000
*                                  PROCESSOR -                     0049 00504000
*                                  ISTTSCNS                  @D34CKMC*/ 00505000
*    2 ATCTSCEM PTR,            /* PTR TO ERROR MESSAGE            0049 00506000
*                                  PROCESSOR -                     0049 00507000
*                                  ISTTSCEM                  @D34CKMC*/ 00508000
*    2 ATCTSCWS PTR,            /* PTR TO COMMUNICATIONS           0049 00509000
*                                  CONTROLLER/CLUSTER              0049 00510000
*                                  CONTROLLER WRITE                0049 00511000
*                                  SCHEDULER -                     0049 00512000
*                                  ISTTSCWS                  @D34CKMC*/ 00513000
*    2 ATCTSCCB PTR,            /* PTR TO COMMUNICATIONS           0049 00514000
*                                  CONTROLLER/CLUSTER              0049 00515000
*                                  CONTROLLER CHANNEL              0049 00516000
*                                  PROGRAM BUILDER -               0049 00517000
*                                  ISTTSCCB                  @D34CKMC*/ 00518000
*    2 ATCTSCCE PTR,            /* PTR TO COMMUNICATIONS           0049 00519000
*                                  CONTROLLER/CLUSTER              0049 00520000
*                                  CONTROLLER CHANNEL              0049 00521000
*                                  END APPENDAGE -                 0049 00522000
*                                  ISTTSCCE                  @D34CKMC*/ 00523000
*    2 ATCTSCFV PTR,            /* PTR TO TSC FIXED VECTOR TABLE - 0049 00524000
*                                  ISTTSCFV                  @D14AKMC*/ 00525000
*    2 ATCTSCCF PTR,            /* PTR TO COMMUNICATIONS           0049 00526000
*                                  CONTROLLER/CLUSTER              0049 00527000
*                                  CONTROLLER UTILITY              0049 00528000
*                                  FUNCTION PROCESSOR -            0049 00529000
*                                  ISTTSCCF                  @D34CKMC*/ 00530000
*    2 ATCTSCLS PTR,            /* PTR TO LOCAL 3270 WRITE         0049 00531000
*                                  SCHEDULER -                     0049 00532000
*                                  ISTTSCLS                  @D34CKMC*/ 00533000
*    2 ATCTSCLB PTR,            /* PTR TO LOCAL 3270               0049 00534000
*                                  CHANNEL PROGRAM                 0049 00535000
*                                  BUILDER -                       0049 00536000
*                                  ISTTSCLB                  @D34CKMC*/ 00537000
*    2 ATCTSCLE PTR,            /* PTR TO LOCAL 3270               0049 00538000
*                                  CHANNEL END APPENDAGE -         0049 00539000
*                                  ISTTSCLE                  @D34CKMC*/ 00540000
*    2 ATCTSCLF PTR,            /* PTR TO LOCAL 3270 UTILITY       0049 00541000
*                                  FUNCTION PROCESSOR -            0049 00542000
*                                  ISTTSCLF                  @D34CKMC*/ 00543000
*    2 ATCVTLOD PTR,            /* PTR TO VTAM LOAD LIST -         0049 00544000
*                                  ISTVTLOD                          */ 00545000
*    2 ATCLUDVT BDY(WORD),      /* LUCB PROCESS PAB DVT      @D34CKMC*/ 00546000
*      3 ATCTSCSR PTR,          /* PTR TO INBOUND SESSION          0049 00547000
*                                  ROUTER - ISTTSCSR         @D34CKMC*/ 00548000
*      3 ATCTSCCO PTR,          /* PTR TO COMMON SESSION           0049 00549000
*                                  CONTROL - ISTTSCCO        @D34CKMC*/ 00550000
*    2 ATCANYDT,                /* RECEIVE ANY DVT                   */ 00551000
*      3 ATCTSCAP PTR,          /* PTR TO RECEIVE ANY              0049 00552000
*                                  PROCESSOR -                     0049 00553000
*                                  ISTTSCAP                          */ 00554000
*    2 *,                       /* LQABS                     @D14AKMP*/ 00555000
*      3 ATCIOLQB PTR,          /* PTR TO SSCP I/O LQABS     @DM30909*/ 00556000
*      3 ATCLUIOQ PTR,          /* PTR TO LUS I/O LQAB       @D14AKMC*/ 00557000
*      3 ATCLUSMQ PTR,          /* PTR TO SERVICE                  0049 00558000
*                                  MANAGER LQAB              @D14AKMC*/ 00559000
*      3 ATCMCQAB PTR,          /* PTR TO MISC CMD LQAB      @D14AKMC*/ 00560000
*      3 ATCPULQB PTR,          /* PTR TO PHYSICAL UNIT            0049 00561000
*                                  SERVICES LQAB             @D34CKMC*/ 00562000
*    2 ATCEPA PTR,              /* ENTRY POINT PTR TO              0049 00563000
*                                  LOADED MODULE                     */ 00564000
*    2 ATCPODVT,                /* PROGRAM OPERATOR                0049 00565000
*                                  INTERFACE DVT             @D14AKMP*/ 00566000
*      3 ATCCFCR2 PTR,          /* PTR TO PROGRAM OPERATOR         0049 00567000
*                                  INTERFACE ROUTINE -             0049 00568000
*                                  ISTCFCR2                  @D14AKMP*/ 00569000
*    2 ATCDWA PTR,              /* PTR TO TSC DISABLED WORK        0049 00570000
*                                  AREA (THIS WORK AREA IS         0049 00571000
*                                  USABLE ONLY BY PROCESSORS       0049 00572000
*                                  WHICH RUN WITH I/O              0049 00573000
*                                  INTERRUPTS DISABLED       @D34CKMC*/ 00574000
*    2 ATCTACB PTR,             /* PTR TO TOLTEP ACB                 */ 00575000
*    2 ATCTUBUF PTR,            /* PTR TO BUFFER CHAIN             0049 00576000
*                                  FOR TUNING STATISTICS             */ 00577000
*    2 ATCUSSPT PTR,            /* PTR TO DEFAULT USS              0049 00578000
*                                  DEFINITION TABLE -              0049 00579000
*                                  ISTINCDT                          */ 00580000
*    2 ATCMODTB PTR,            /* PTR TO SYSTEM LOGON             0049 00581000
*                                  MODE TABLE -                    0049 00582000
*                                  ISTINCLM                          */ 00583000
*    2 ATCTRCPT PTR,            /* PTR TO TRACE PARAMETER          0049 00584000
*                                  LIST                              */ 00585000
*    2 ATCTODVT PTR,            /* PTR TO THE TOLTEP DVT           0049 00586000
*                                  POINTED TO BY THE 3RD           0049 00587000
*                                  WORD OF THE TOLTEP PAB            */ 00588000
*    2 ATCITRT PTR,             /* PTR TO I/O TRACE TABLE            */ 00589000
*    2 ATCNODDS PTR,            /* PTR TO NODELST CHECKPOINT       0049 00590000
*                                  WORKAREA                          */ 00591000
*    2 ATCUEP PTR,              /* UECB PAB DUMMY PROCESSOR          */ 00592000
*    2 ATCMNT PTR,              /* PTR TO MAJOR NODE TABLE           */ 00593000
*    2 ATCACDA PTR,             /* PTR TO FIRST ACDEB ON           0049 00594000
*                                  ACDEB QUEUE                       */ 00595000
*    2 ATCBPDA PTR,             /* PTR TO BUFFER POOL              0049 00596000
*                                  DIRECTORY                         */ 00597000
*    2 ATCDLRPT PTR,            /* PTR TO DUMP/LOAD/RESTART        0049 00598000
*                                  WORKAREA                          */ 00599000
*    2 ATCSDVT PTR,             /* PTR TO SKELETON DVT -           0049 00600000
*                                  ISTDVCRC                          */ 00601000
*    2 ATCRDT PTR,              /* PTR TO RDT QUEUE ANCHOR         0049 00602000
*                                  BLOCK (QAB)                       */ 00603000
*    2 ATCSRT PTR,              /* PTR TO SRT DIRECTORY              */ 00604000
*    2 ATCMODQ PTR,             /* PTR TO MODIFY COMMAND           0049 00605000
*                                  OUTPUT QAB                        */ 00606000
*    2 ATCHALTQ PTR,            /* PTR TO HALT COMMAND             0049 00607000
*                                  OUTPUT QAB                        */ 00608000
*    2 ATCVARYQ PTR,            /* PTR TO VARY COMMAND             0049 00609000
*                                  OUTPUT QAB                        */ 00610000
*    2 ATCDSPLQ PTR,            /* PTR TO DISPLAY COMMAND          0049 00611000
*                                  OUTPUT QAB                        */ 00612000
*    2 ATCOCHA PTR,             /* PTR TO OPERATOR                 0049 00613000
*                                  COMMUNICATIONS                  0049 00614000
*                                  TABLE HEADER                      */ 00615000
*    2 ATCVPARM PTR,            /* PTR TO VARY PARAMETERS            */ 00616000
*    2 ATCECPRM PTR,            /* PTR TO ERP QAB ECB              0049 00617000
*                                  PARAMETERS                        */ 00618000
*    2 ATCHLTMS PTR,            /* PTR TO HALT COMMAND OR          0049 00619000
*                                  HALT RETURN MESSAGE               */ 00620000
*    2 ATCSIBQ PTR,             /* PTR TO FIRST SESSION            0049 00621000
*                                  INFORMATION BLOCK (SIB)         0049 00622000
*                                  ON SIB QUEUE              @D14AKMP*/ 00623000
*    2 ATCRDTH PTR,             /* PTR TO VTAM RDT HEADER            */ 00624000
*    2 ATCCONFT PTR,            /* PTR TO VTAM CONFIG TABLE          */ 00625000
*    2 ATCFDVT PTR,             /* ANCHOR FOR DVT QUEUE FOR        0049 00626000
*                                  OPEN/CLOSE PROCESSING             */ 00627000
*    2 ATCFEPT PTR,             /* ANCHOR FOR EPT QUEUE FOR        0049 00628000
*                                  OPEN/CLOSE PROCESSING             */ 00629000
*    2 ATCTSBUF FIXED,          /* THE NUMBER OF BYTES THAT        0049 00630000
*                                  CAN BE READ OR WRITTEN          0049 00631000
*                                  IN A TSC I/O BUFFER       @D34CKMC*/ 00632000
*    2 ATCNOP00                                                    0049 00633000
*       CHAR(4)                                                    0049 00634000
*        BDY(HWORD),            /* THIS AREA CONTAINS CODE         0049 00635000
*                                  FOR A DUMMY BOUNDARY            0049 00636000
*                                  FUNCTION -                      0049 00637000
*                                  SLR 15,15 SET 0 RC              0049 00638000
*                                  BR  14  AND RETURN        @D34CKMC*/ 00639000
*    2 ATCSTAT,                                                    0049 00640000
*      3 ATCSTAT1,              /* VTAM STATUS INDICATORS            */ 00641000
*        4  ATCSTART BIT(1),    /* 1=VTAM IS STARTING                */ 00642000
*        4  ATCACTIV BIT(1),    /* 1=VTAM IS ACTIVE                  */ 00643000
*        4  ATCSNHLT BIT(1),    /* 1=VTAM IS SESSION HALTING         */ 00644000
*        4  ATCQKHLT BIT(1),    /* 1=VTAM IS QUICK HALTING           */ 00645000
*        4  ATCNETSL BIT(1),    /* 1=NETSOL EQUALS YES WAS         0049 00646000
*                                    SPECIFIED ON COMMAND            */ 00647000
*        4  ATCINHLT BIT(1),    /* 1=VTAM IS INTERNALLY            0049 00648000
*                                    QUICK HALTING                   */ 00649000
*        4  ATCMDHLT BIT(1),    /* 1=VTAM COMMAND PROCESS          0049 00650000
*                                    HAS HALTED                      */ 00651000
*        4  ATCHIP BIT(1),      /* 1=HALT IN PROGRESS        @D14AKMP*/ 00652000
*      3 * CHAR(1),             /* NOT USED - AVAILABLE      @D14AKMP*/ 00653000
*      3 ATCPOFLG,              /* PROGRAM OPERATOR                0049 00654000
*                                  INTERFACE FLAGS                   */ 00655000
*        4 ATCPOUNS BIT(1),     /* 1=PRIMARY PROGRAM               0049 00656000
*                                    OPERATOR APPLICATION          0049 00657000
*                                    IS AUTHORIZED TO              0049 00658000
*                                    RECEIVE UNSOLICITED           0049 00659000
*                                    MESSAGES                        */ 00660000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00661000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00662000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00663000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00664000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00665000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00666000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00667000
*      3 ATCSTAT4,              /* VTAM STATUS BYTE-4                */ 00668000
*        4 ATCMTST BIT(1),      /* 1=MODIFY TEST IS IN PROCESS       */ 00669000
*        4 ATCNCSD BIT(1),      /* 1=NETWORK CONFIG SERVICES       0049 00670000
*                                    QUIESCED DURING HALT           */  00671000
*        4 ATCPRTAT BIT(1),     /* 1=TRACE PRINT ACTIVE,           0049 00672000
*                                  0=TRACE NOT ACTIVE        @DM42669*/ 00673000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00674000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00675000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00676000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00677000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00678000
*    2 ATCBITAN,                /* VTAM FLAG BITS            @D14AKMP*/ 00679000
*      3 * CHAR(1),             /*   NOT USED - AVAILABLE    @D14AKMP*/ 00680000
*      3 ATCFLAG2,              /* FLAG BYTE-2                       */ 00681000
*        4 ATCCDLRA BIT(1),     /* 1=CROSS DOMIAN LINKS ARE        0049 00682000
*                                    TO REMAIN ACTIVE                */ 00683000
*        4 ATCTUNAC BIT(1),     /* 1=TUNING STATISTICS IS          0049 00684000
*                                    ACTIVE                  @D34CKMC*/ 00685000
*        4 ATCTUNRQ BIT(1),     /* 1=TUNING STATISTICS             0049 00686000
*                                    TASK IS ATTACHED        @D34CKMC*/ 00687000
*        4 ATCTUNCL BIT(1),     /* 1=DISPLAY RECORD AT             0049 00688000
*                                    CONSOLE                 @D34CKMC*/ 00689000
*        4 ATCCRYPF BIT(1),     /* 1=BOTH VTAM AND SYSTEM          0049 00690000
*                                    FEATURE-02 ARE                0049 00691000
*                                    INSTALLED               @D34CKMP*/ 00692000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00693000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00694000
*        4 * BIT(1),            /*   NOT USED - AVAILABLE            */ 00695000
*      3 * CHAR(1),             /*   NOT USED - AVAILABLE    @D14AKMP*/ 00696000
*      3 * CHAR(1),             /*   NOT USED - AVAILABLE    @D14AKMP*/ 00697000
*    2 ATCONID,                 /* POI HEADERS FOR INIT/TERM         */ 00698000
*      3 ATCSCNID CHAR(2),      /* START POI HEADER                  */ 00699000
*      3 ATCHCNID CHAR(2),      /* HALT POI HEADER                   */ 00700000
*    2 ATCSSCPA                                                    0049 00701000
*       FIXED(16) BDY(HWORD),   /* SSCP NETWORK ADDRESS              */ 00702000
*      3 ATCVTMID CHAR(2),      /* HOST MAJOR NODE ID                */ 00703000
*    2 ATCSAF CHAR(2),          /* HOST SUBAREA ADDRESS              */ 00704000
*    2 ATCPUNSA FIXED(16),      /* PUNS NETWORK ADDRESS              */ 00705000
*    2 ATCHOSTA FIXED(15),      /* HOST SUBAREA INPUT                */ 00706000
*    2 ATCTMINV CHAR(2),        /* TIME INTERVAL BETWEEN RECORDS     */ 00707000
*    2 ATCITLIM FIXED(16),      /* INITIATE TERMINATE LIMIT   DA14866*/ 00708000
*    2 ATCVOCLK                                                    0049 00709000
*       BDY(WORD)                                                  0049 00710000
*        CHAR(LENGTH(ISTLOK)),  /* LOCK WORD FOR VOC LOCK            */ 00711000
*    2 ATCRDTLK                                                    0049 00712000
*       BDY(WORD)                                                  0049 00713000
*        CHAR(LENGTH(ISTLOK)),  /* LOCK WORD FOR RDT LOCK            */ 00714000
*    2 ATCVDLOK                                                    0049 00715000
*       BDY(WORD)                                                  0049 00716000
*        CHAR(LENGTH(ISTLOK)),  /* LOCK WORD FOR SSCP              0049 00717000
*                                  SERIALIZATION                     */ 00718000
*    2 ATCECMOD                                                    0049 00719000
*       CHAR(4) BDY(WORD),      /* ECB FOR MODIFY COMMAND PROCESSOR  */ 00720000
*    2 ATCECHLT                                                    0049 00721000
*       CHAR(4) BDY(WORD),      /* ECB FOR HALT COMMAND PROCESSOR    */ 00722000
*    2 ATCECVRY                                                    0049 00723000
*       CHAR(4) BDY(WORD),      /* ECB FOR VARY COMMAND PROCESSOR    */ 00724000
*    2 ATCECDSP                                                    0049 00725000
*       CHAR(4) BDY(WORD),      /* ECB FOR DISPLAY COMMAND PROCESSOR */ 00726000
*    2 ATCECSES                                                    0049 00727000
*       CHAR(4) BDY(WORD),      /* ECB TO HALT SESSION MODE          */ 00728000
*    2 ATCECOPC                                                    0049 00729000
*       CHAR(4) BDY(WORD),      /* ECB TO INDICATE OPERATOR        0049 00730000
*                                  CONTROL PROCESSING COMPLETE       */ 00731000
*    2 ATCECNET                                                    0049 00732000
*       CHAR(4) BDY(WORD),      /* ERP ECB FOR NETWORK CONFIG REQUEST*/ 00733000
*    2 ATCECTLP                                                    0049 00734000
*       CHAR(4) BDY(WORD),      /* ECB FOR TOLTEP                    */ 00735000
*    2 ATCACTRM FIXED(15),      /* COUNT OF ACTIVE TERMS             */ 00736000
*    2 ATCCIDM  BIT(16),        /* CID MASK                          */ 00737000
*    2 ATCMSGSP BIT(8),         /* USED FOR MSG SUPPRESSION          */ 00738000
*    2 ATCMAXID FIXED(8),       /* MAXIMUM NUMBER OF SUBAREAS      0049 00739000
*                                  IN THE MNT                        */ 00740000
*    2 ATCXRANG FIXED(8),       /* NUMBER OF BITS IN SUBAREA       0049 00741000
*                                  PORTION OF NETWORK ADDRESS        */ 00742000
*    2 * CHAR(1),               /* NOT USED - AVAILABLE      @D14AKMP*/ 00743000
*    2 ATCHPGM,                 /* BUFFER INFORMATION FOR          0049 00744000
*                                  ISTINCPD                          */ 00745000
*      3 ATCHBFNO FIXED(15),    /* NUMBER OF BUFFERS               0049 00746000
*                                  FOR READ CHANNEL PROGRAM          */ 00747000
*      3 ATCHBSIZ FIXED(15),    /* BUFFER SIZE IN BYTES              */ 00748000
*    2 ATCVLCNT                                                    0049 00749000
*       CHAR(4) BDY(HWORD),     /* VARY DEVICE ONLINE COUNTS         */ 00750000
*      3 ATCRNCNT FIXED(16),    /* 3704/3705 COUNT                   */ 00751000
*      3 ATCLCLCT FIXED(16),    /* 3270 COUNT                        */ 00752000
*    2 ATCRNO,                  /* REMOTE NETWORK OPERATOR         0049 00753000
*                                  INTERFACE AREA                    */ 00754000
*      3 * CHAR(1),             /* NOT USED - UNAVAILABLE            */ 00755000
*      3 ATCPOIA PTR(24),       /* PTR TO PROGRAM OPERATOR         0049 00756000
*                                  INTERFACE AREA                    */ 00757000
*    2 ATCNMCTR FIXED(15),      /* COUNT USED FOR GENERATING       0049 00758000
*                                  UNIQUE NETWORK NAMES              */ 00759000
*    2 *          CHAR(2),      /* NOT USED - AVAILABLE              */ 00760000
*    2 *,                       /* VTAM SHARED PROCESSOR INFO        */ 00761000
*      3 ATCSHRTN CHAR(8),      /* NAME OF VTAM SHARED PROCESSOR   0049 00762000
*                                  TO BE LOADED                      */ 00763000
*      3 ATCSHRFG BIT(8),       /* ATTRIBUTE FLAGS                   */ 00764000
*        4 ATCLAST BIT(1),      /* 1=THIS IS LAST MODULE             */ 00765000
*      3 * CHAR(7),             /* NOT USED - UNAVAILABLE    @D14AKMP*/ 00766000
*    2 ATCNODEL CHAR(8),        /* START VTAM COMMAND              0049 00767000
*                                  (NODELST=PARAMETER)               */ 00768000
*    2 ATCONFIG CHAR(8),        /* START VTAM COMMAND              0049 00769000
*                                  (CONFIG=PARAMETER)                */ 00770000
*    2 ATCMROUT CHAR(9),        /* SAVE AREA FOR MESSAGE           0049 00771000
*                                  ROUTING INFORMATION               */ 00772000
*    2 * CHAR(3),               /* NOT USED - AVAILABLE      @D14AKMP*/ 00773000
*    2 ATCCFCDR PTR,            /* PTR TO DISPLAY PROCESSOR  @D14AKMC*/ 00774000
*    2 ATCDRULL FIXED(31),      /* DEFAULT RU SIZE FOR LU-LU SESSION    00775000
*                                                            @OZ31096*/ 00776000
*    2 ATCDRUSL FIXED(31),      /* DEFAULT RU SIZE FOR SSCP-LU SESSION  00777000
*                                                            @OZ31096*/ 00778000
*    2 ATCCSMT  PTR,            /* PTR TO CSMI ROUTING TABLE       0049 00779000
*                                  (ISTMGC00)                @D14AKMC*/ 00780000
*    2 ATCMACRT PTR,            /* PTR TO MAINTENANCE SERVICES     0049 00781000
*                                  LOAD MODULE (ISTMACRT)    @D14AKMC*/ 00782000
*    2 ATCMGCRT PTR,            /* PTR TO MANAGEMENT SERVICES      0049 00783000
*                                  LOAD MODULE (ISTMGCRT)    @D14AKMC*/ 00784000
*    2 ATCCPDVT,                /* SSCP/PUS/LUS I/O PAB DVT  @D14AKMC*/ 00785000
*      3 ATCTSCNI PTR,          /* PTR TO NETWORK SERVICESINBOUND  0049 00786000
*                                  PROCESSOR - ISTTSCNI      @D14AKMC*/ 00787000
*      3 ATCINCIP PTR,          /* PTR TO SSCP/PUS/LUS INBOUND     0049 00788000
*                                  I/O PROCESSOR - ISTINCIP  @D14AKMC*/ 00789000
*    2 ATCNOSQ  PTR,            /* POINTER TO NETWORK SERVICES LQAB     00790000
*                                                            @D14AKMC*/ 00791000
*    2 ATCUSSVT PTR,            /* UTILITY VECTOR TABLE FOR        0049 00792000
*                                  COMMAND PARSING           @D14AKMC*/ 00793000
*    2 ATCSQCDS PTR,            /* POINTER TO SUPPLEMENTAL CPCKST  0049 00794000
*                                  PROCESSOR                 @D14AKMC*/ 00795000
*    2 ATCITQLE PTR,            /* -> LAST ON I.T. QUEUE     @XA21978*/ 00796000
*    2 ATCQLOCK CHAR(LENGTH(ISTLOK)), /* QUEUE LOCK          @XA21978*/ 00797000
*    2 ATCCPCSM PTR,            /* ADDRESS OF ISTCPCSM       @XA21978*/ 00798000
*    2 ATCPAREA PTR,            /* -> POOL ANCHOR BLOCKS     @XA21978*/ 00799000
*    2 ATCSMPMD FIXED ABNL,     /* PACING COUNT              @DA14866*/ 00800000
*    2 ATCSEQNO FIXED,          /* COUNTER OF SESSION SERVICES     0049 00801000
*                                  REQUESTS                  @D14AKMC*/ 00802000
*    2 ATCSMSDQ,                /* INITIATE-TERMINATE QUEUE  @D14AKMC*/ 00803000
*      3 *        PTR,          /* PTR TO OLDEST Q. ELEMENT  @D14AKMC*/ 00804000
*      3 *        PTR,          /* PTR TO NEWEST Q. ELEMENT  @D14AKMC*/ 00805000
*      3 *        CHAR(LENGTH(ISTLOK)), /* QUEUE LOCK        @D14AKMC*/ 00806000
*    2 ATCRID BDY(DWORD) ABNL,  /* PROCESS CORRELATOR ID             */ 00807000
*      3 ATCCDRMA FIXED(16),    /* CDRM NETWORK ADDRESS              */ 00808000
*      3 * CHAR(6),             /* BITS 4-51 OF TOD CLOCK            */ 00809000
*    2 ATCCPCFE PTR,            /* PTR TO FRONT END ROUTER   @D14AKNL*/ 00810000
*    2 *        CHAR(60),       /* NOT USED - AVAILABLE      @D14AKNL*/ 00811000
*                                                                  0049 00812000
*/*------------------------------------------------------------------*/ 00813000
*/*         O S / V S   C O M M O N   S E C T I O N                  */ 00814000
*/*------------------------------------------------------------------*/ 00815000
*    2 * CHAR(0) BDY(DWORD),    /* FORCE DWORD ALIGNMENT     @D14AKMP*/ 00816000
*    2 ATCZPAB2                                                    0049 00817000
*       BDY(DWORD)                                                 0049 00818000
*        CHAR(LENGTH(ISTDYPAB)),/* MESSAGE ROUTER DYNAMIC          0049 00819000
*                                  PAB                               */ 00820000
*    2 *                                                           0049 00821000
*       BDY(DWORD)                                                 0049 00822000
*        CHAR(LENGTH(ISTDYPAB)),/* NOT USED - AVAILABLE      @D14AKMC*/ 00823000
*    2 ATCLDAPP                                                    0049 00824000
*       BDY(DWORD)                                                 0049 00825000
*        CHAR(20),              /* LOCAL 3270 APPENDAGE            0049 00826000
*                                  VECTOR                            */ 00827000
*      3 ATCCDTID PTR,          /* TASK ID OF VTAM                 0049 00828000
*                                  (DUMP EOE)                        */ 00829000
*      3 ATCSMFRR PTR,          /* PTR TO SMS FRR                  0049 00830000
*                                  (DUMMY SIOA)                      */ 00831000
*      3 ATCZLPCI PTR,          /* POINTER TO 3270 PCI       @G70AKMC*/ 00832000
*      3 ATCZLCEA PTR,          /* PTR TO 3270 CHANNEL END         0049 00833000
*                                  APPENDAGE                         */ 00834000
*      3 ATCZLAEA PTR,          /* PTR TO 3270 CHANNEL END         0049 00835000
*                                  APPENDAGE                         */ 00836000
*    2 * PTR,                   /* NOT USED - AVAILABLE      @D14AKMC*/ 00837000
*    2 ATCSQAFR BDY(DWORD),     /* DOUBLE WORD FOR COMPARE         0049 00838000
*                                  DOUBLE AND SWAP (CDS)           0049 00839000
*                                  SQA RELEASE                       */ 00840000
*      3 ATCORTBF PTR,          /* ANCHOR FOR TO-BE-FREED          0049 00841000
*                                  STORAGE QUEUE                     */ 00842000
*      3 ATCORTCB PTR,          /* PTR TO TCB OF TASK              0049 00843000
*                                  OWNING STORAGE QUEUE              */ 00844000
*        4 ATCORSRB PTR,        /* ADDR OF SMS SRB                   */ 00845000
*          5 ATCORQG                                               0049 00846000
*             BIT(1) ABNL,      /* SRB GATE FOR SMS                  */ 00847000
*    2 ATCICAPP                                                    0049 00848000
*       BDY(WORD)                                                  0049 00849000
*        CHAR(20),              /* 3705 APPENDAGE VECTOR             */ 00850000
*      3 ATCCDRPH PTR,          /* PTR TO CLOSE DEB RPH            0049 00851000
*                                  (DUMMY EOA APP.)                  */ 00852000
*      3 ATCZSIOA PTR,          /* PTR TO 3705 START I/O           0049 00853000
*                                  APPENDAGE                         */ 00854000
*      3 ATCZCPCI PTR,          /* PTR TO 3705 PCI APPENDAGE @G70AKMC*/ 00855000
*      3 ATCZCEA PTR,           /* PTR TO 3705 CHANNEL END         0049 00856000
*                                  APPENDAGE                         */ 00857000
*      3 ATCZAEA PTR,           /* PTR TO 3705 CHANNEL END         0049 00858000
*                                  APPENDAGE                         */ 00859000
*    2 ATCDAPVT                                                    0049 00860000
*       BDY(WORD)                                                  0049 00861000
*        CHAR(24),              /* DUMMY APPENDAGE VECTOR          0049 00862000
*                                  TABLE FOR LOAD/DUMMY              */ 00863000
*      3 ATCDEOEA PTR,          /* PTR TO DUMMY END OF             0049 00864000
*                                  EXTENT APPENDAGE                  */ 00865000
*      3 ATCDSIOA PTR,          /* PTR TO DUMMY END OF             0049 00866000
*                                  SIO APPENDAGE                     */ 00867000
*      3 ATCDPCIA PTR,          /* PTR TO DUMMY PCI                0049 00868000
*                                  APPENDAGE                         */ 00869000
*      3 ATCDCEA PTR,           /* PTR TO CHANNEL END              0049 00870000
*                                  APPENDAGE                         */ 00871000
*      3 ATCDXCEA PTR,          /* PTR TO ABNORMAL END             0049 00872000
*                                  APPENDAGE                         */ 00873000
*      3 ATCDAPDG CHAR(2),      /* DUMMY APPENDAGE                   */ 00874000
*    2 ATCAP11 PTR,             /* PTR TO ISTAPC11                   */ 00875000
*    2 ATCAP12 PTR,             /* PTR TO ISTAPC12                   */ 00876000
*    2 ATCAP31 PTR,             /* PTR TO ISTAPC31                   */ 00877000
*    2 ATCAP32 PTR,             /* PTR TO ISTAPC32                   */ 00878000
*    2 ATCAP34 PTR,             /* PTR TO ISTAPC34                   */ 00879000
*    2 ATCAP37 PTR,             /* PTR TO ISTAPC37                   */ 00880000
*    2 ATCAP38 PTR,             /* PTR TO ISTAPC38                   */ 00881000
*    2 ATCAP51 PTR,             /* PTR TO ISTAPC51                   */ 00882000
*    2 ATCAP52 PTR,             /* PTR TO ISTAPC52                   */ 00883000
*    2 ATCAP53 PTR,             /* PTR TO ISTAPC53                   */ 00884000
*    2 ATCAP54 PTR,             /* PTR TO ISTAPC54                   */ 00885000
*    2 ATCAP57 PTR,             /* PTR TO ISTAPC57                   */ 00886000
*    2 ATCAP58 PTR,             /* PTR TO ISTAPC58                   */ 00887000
*    2 ATCAP61 PTR,             /* PTR TO ISTAPC61                   */ 00888000
*    2 ATCAP63 PTR,             /* PTR TO ISTAPC63                   */ 00889000
*    2 ATCAP64 PTR,             /* PTR TO ISTAPC64                   */ 00890000
*    2 ATCAP65 PTR,             /* PTR TO ISTAPC65                   */ 00891000
*    2 ATCAP67 PTR,             /* PTR TO ISTAP67            @X60CWMC*/ 00892000
*    2 ATCINFDD PTR,            /* PTR TO ISTINFDD                   */ 00893000
*    2 ATCSMBQ PTR,             /* PTR TO QUEUED REQUESTS          0049 00894000
*                                  STORAGE MANAGEMENT              0049 00895000
*                                  SERVICES PROCESSOR -            0049 00896000
*                                  ISTORFBQ                  @D14AKMP*/ 00897000
*    2 ATCORFMG PTR,            /* PTR TO ISTORFMG                   */ 00898000
*    2 ATCORFPX PTR,            /* PTR TO ISTORFPX                   */ 00899000
*    2 ATCORFRL PTR,            /* PTR TO ISTORFRL                   */ 00900000
*    2 ATCCDTCB PTR,            /* PTR TO TCB (DUMMY PCI           0049 00901000
*                                  APPENDAGE                 @G70AKMC*/ 00902000
*    2 *        PTR,            /* NOT USED - AVAILABLE      @D14AKMC*/ 00903000
*    2 ATCTSCPC PTR,            /* PTR TO ISTTSCPC           @X60CWMC*/ 00904000
*    2 ATCSRBRT PTR,            /* PTR TO PROCESSOR                0049 00905000
*                                  UNDER SRB CONTROL                 */ 00906000
*    2 ATCGSRBQ PTR,            /* READY QUEUE FOR                 0049 00907000
*                                  GLOBAL SRB BLOCKS                 */ 00908000
*      3 ATCGSRBG BIT(8),       /* READY QUEUE GATE BYTE             */ 00909000
*        4 ATCGSRBF BIT(1),     /* READY QUEUE GATE BIT              */ 00910000
*    2 ATCPRPH PTR,             /* PTR TO PREALLOCATED RPH           */ 00911000
*    2 ATCCMTCB PTR,            /* PTR TO COMMUNICATION            0049 00912000
*                                  TASK TCB                          */ 00913000
*    2 ATCICNCB PTR,            /* ANCHOR FOR ICNCB QUEUE            */ 00914000
*    2 ATCPXCRA PTR,            /* PTR TO CRA                        */ 00915000
*    2 ATCZDVTX PTR,            /* PTR TO TRUNK LINE               0049 00916000
*                                  DEACTIVATE ROUTINE                */ 00917000
*    2 ATCDMAPP PTR,            /* PTR TO DUMMY APPENDAGE          0049 00918000
*                                  ROUTINE FOR ABEND                 */ 00919000
*    2 ATCOROBT PTR,            /* ANCHOR FOR OBTAINED             0049 00920000
*                                  STORAGE QUEUE                     */ 00921000
*    2 ATCAIWT PTR,             /* PTR TO BYTE AFTER               0049 00922000
*                                  WAIT IN ISTAICCK                  */ 00923000
*    2 ATCTIMER PTR,            /* PTR TO TIMER SUBROUTINE           */ 00924000
*    2 ATCENFLG BIT(8),         /* ENHANCEMENT FLAGS                 */ 00925000
*      3 ATCDLDN BIT(1),        /* 1=DEVICE DEALLOCATION DONE        */ 00926000
*      3 ATCSRDN BIT(1),        /* 1=STORAGE FREEING DONE            */ 00927000
*      3 ATCABEN BIT(1) ABNL,   /* 1=VTAM IS ABNORMALLY TERMINATING  */ 00928000
*      3 ATCOPKL BIT(1) ABNL,   /* 1=OPERATOR IS REMOVING          0049 00929000
*                                    FROM THE SYSTEM                 */ 00930000
*      3 ATCSNUF BIT(1) ABNL,   /* 1=RECURSIVE VTAM ABEND          0049 00931000
*                                    DURING RESOURCE               0049 00932000
*                                    MANAGER OPERATION               */ 00933000
*    2 * CHAR(3),               /* RESERVED - AVAILABLE      @G70AKMC*/ 00934000
*    2 ATCCCOOC PTR,            /* ADDRESS IN ISTINCCO WHEN ABEND  0049 00935000
*                                  OCCURS FOR OPEN/CLOSE ACB @G70AKMC*/ 00936000
*    2 * CHAR(48),              /* NOT USED - AVAILABLE      @X60CWMC*/ 00937000
*/*------------------------------------------------------------------*/ 00938000
*/*         O S / M V S   U N I Q U E   S E C T I O N                */ 00939000
*/*------------------------------------------------------------------*/ 00940000
*    2 *        CHAR(4),        /* RESERVED - AVAILABLE              */ 00941000
*    2 ATCVTBAM CHAR(3),        /* MAY BE NEEDED                     */ 00942000
*    2 *        BIT(8),         /* FLAGS                             */ 00943000
*      3 ATCVTMAB BIT(1) ABNL,  /* 1=CD LINKS ARE TO REMAIN ACTIVE   */ 00944000
*      3 *        BIT(7),       /* RESERVED - AVAILABLE              */ 00945000
*    2 ATCVTFLG BIT(32),                                           0049 00946000
*      3 ATCVTACT BIT(1),       /* 1=VTT ACTIVE                      */ 00947000
*      3 *        BIT(31),      /* RESERVED - AVAILABLE              */ 00948000
*    2 ATCHLTCB PTR,            /* ECB FOR HALTING VTAM              */ 00949000
*    2 ATCATA10 PTR,            /* ADDR OF ISTATM10                  */ 00950000
*    2 ATCCACXA PTR,            /* ADDR OF ISTCFCXA                  */ 00951000
*    2 ATCSMARA PTR,            /* ADDR OF ISTORFRA                  */ 00952000
*    2 ATCSMAID PTR,            /* ADDR OF ISTORFID                  */ 00953000
*    2 ATCTPWQA PTR,            /* ANCHOR FOR TPIOS WAIT QUEUE       */ 00954000
*    2 ATCSMAPR PTR,            /* ADDR OF ISTORFPR                  */ 00955000
*    2 ATCSMABF PTR,            /* ADDR OF ISTORFBF                  */ 00956000
*    2 ATCPSTA  PTR,            /* ANCHOR FOR ACTIVE PST QUEUE       */ 00957000
*    2 ATCAPBE  PTR,            /* ADDR OF ISTAICBE                  */ 00958000
*    2 ATCAP23  PTR,            /* ADDR OF ISTAPC23                  */ 00959000
*    2 ATCAPC25 PTR,            /* ADDR OF ISTAPC25                  */ 00960000
*    2 ATCAP41  PTR,            /* ADDR OF ISTAPC41                  */ 00961000
*    2 ATCAP55  PTR,            /* ADDR OF ISTAPC55                  */ 00962000
*    2 ATCAP56  PTR,            /* ADDR OF ISTAPC56                  */ 00963000
*    2 ATCAPC59 PTR,            /* ADDR OF ISTAPC59                  */ 00964000
*    2 ATCAP62  PTR,            /* ADDR OF ISTAPC62                  */ 00965000
*    2 ATCAP66  PTR,            /* ADDR OF ISTAPC66                  */ 00966000
*    2 ATCAP69  PTR,            /* ADDR OF ISTAPM69                  */ 00967000
*    2 ATCAP82  PTR,            /* ADDR OF ISTAPC82                  */ 00968000
*    2 ATCAP83  PTR,            /* ADDR OF ISTAPC83                  */ 00969000
*    2 ATCAP84  PTR,            /* ADDR OF ISTAPC84                  */ 00970000
*    2 ATCAP85  PTR,            /* ADDR OF ISTAPC85                  */ 00971000
*    2 ATCAP86  PTR,            /* ADDR OF ISTAPC86                  */ 00972000
*    2 ATCASCB  PTR,            /* ADDR OF VTAM ASCB                 */ 00973000
*    2 ATCMPLTA PTR,            /* ADDR OF MPST LIST TABLE           */ 00974000
*    2 ATCZR01  PTR,            /* ADDR OF ISTZRM01                  */ 00975000
*    2 ATCTPCP0 PTR,            /* ADDR OF ISTZFSAV                  */ 00976000
*    2 ATCTPCP1 PTR,            /* ADDR OF ISTZ19SV                  */ 00977000
*    2 ATCZFLAG BIT(8),         /* FLAG BYTE                         */ 00978000
*      3 ATCZF001 BIT(1),       /* 1=MDR RECORDING SUSPENDED         */ 00979000
*      3 *        BIT(7),       /* RESERVED - AVAILABLE              */ 00980000
*    2 ATCSTNSM CHAR(1),        /* USED TO DISABLE                 0049 00981000
*                                  INTERRUPTS                @VS45687*/ 00982000
*    2 ATCSRBCT FIXED(16),      /* COUNT OF PREALLOCATED SRB AREAS   */ 00983000
*    2 ATCCRACT FIXED(16),      /* COUNT OF PREALLOCATED CRA AREAS   */ 00984000
*    2 ATCRPLCT FIXED(16),      /* COUNT OF PREALLOCATED CRPL AREAS  */ 00985000
*    2 ATCPXSRB PTR,            /* ADDR OF SRB FOR SCHED ISTORPFX    */ 00986000
*    2 ATCTPMMI PTR,            /* ADDR OF ISTCFMMI (MSG           0049 00987000
*                                  ISSUER FOR SRB MODE PROCESSORS)   */ 00988000
*    2 ATCVIOPM PTR,            /* ADDR OF ISTVIOPM                  */ 00989000
*    2 ATCLUFFD PTR,            /* ADDR OF ISTLUFFD                  */ 00990000
*    2 ATCCRA   CHAR(8) BDY(DWORD), /* AVAILABLE CRA                 */ 00991000
*      3 ATCCRAQ  PTR,          /* QUEUE OF AVAILABLE CRAS           */ 00992000
*      3 ATCCRACN FIXED,        /* COUNTS                            */ 00993000
*        4 ATCCRARC FIXED(16),  /* ENQUEUE COUNT TO ALLOW            */ 00994000
*                               /* MULTIPLE SIMUALTANIOUS            */ 00995000
*                               /* ENQUEUES AND DEQUEUES             */ 00996000
*        4 ATCCRAAC FIXED(16),  /* COUNT OF CRAS ON AVAIL QUEUE      */ 00997000
*    2 ATCSRB   CHAR(8) BDY(DWORD), /* AVAILABLE SRBS                */ 00998000
*      3 ATCSRBQ  PTR,          /* QUE OF AVAILABLE SRBS             */ 00999000
*      3 ATCSRBCN FIXED,        /* COUNTS                            */ 01000000
*        4 ATCSRBRC FIXED(16),  /* ENQUEUE COUNT TO ALLOW          0049 01001000
*                                  MULTIPLE SIMUALTANIOUS          0049 01002000
*                                  ENQUEUES AND DEQUEUES             */ 01003000
*        4 ATCSRBAC FIXED(16),  /* COUNT OF SRBS ON AVAIL QUEUE      */ 01004000
*    2 ATCCRPL  CHAR(8) BDY(DWORD), /* AVAILABLE CRPLS               */ 01005000
*      3 ATCCRPLQ PTR,          /* QUE OF AVAILABLE CRPLS            */ 01006000
*      3 ATCRPLCN FIXED,        /* COUNTS                            */ 01007000
*        4 ATCRPLRC FIXED(16),  /* ENQUEUE COUNT TO ALLOW          0049 01008000
*                                  MULTIPLE SIMUALTANIOUS            */ 01009000
*                               /* ENQUEUES AND DEQUEUES             */ 01010000
*        4 ATCRPLAC FIXED(16),  /* COUNT OF CRPLS ON AVAIL QUEUE     */ 01011000
*    2 ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                 0049 01012000
*                               /* PAB FOR VTAM TERM TASK            */ 01013000
*    2 ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                 0049 01014000
*                               /* TP MSG PAD FOR MVS                */ 01015000
*    2 ATCMXCSA FIXED(32),      /* MAX. SIZE CSA ALLOWED FOR VTAM  0049 01016000
*                                  X'7FFFFFFF' = NO LIMIT    @D14AKMC*/ 01017000
*    2 ATCCACSA FIXED(32),      /* CURRENT ALLOCATION OF CSA FOR VTAM   01018000
*                                                            @D14AKMC*/ 01019000
*    2 *        CHAR(4),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 01020000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 01021000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 01022000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 01023000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 01024000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 01025000
*    2 *        CHAR(8),        /* RESERVED - AVAIALABLE     @G35CKMC*/ 01026000
*    2  ATCAOS CHAR(0)BDY(WORD);/* MVS ONLY FIELDS                   */ 01027000
*                                                                  0049 01028000
*/*------------------------------------------------------------------*/ 01029000
*/*   O S / M V S   C O N S T A N T S   S E C T I O N                */ 01030000
*/*------------------------------------------------------------------*/ 01031000
*DCL                                                               0050 01032000
*  ATCABEND  BIT(8)CONSTANT('04'X), /* TO INIT ATCABEN               */ 01033000
*  ATCOPKLI  BIT(8)CONSTANT('02'X), /* TO INIT ATCOPKL               */ 01034000
*  ATCSNUFI  BIT(8)CONSTANT('01'X), /* TO INIT ATCSNUF               */ 01035000
*  ATCLVLVT CHAR(4)CONSTANT('VT41');/* TO INIT ATCVTLVL (ISTINCMX) 0050 01036000
*                                                            @DM42230*/ 01037000
*GEN (PRINT ON);                                                   0051 01038000
         PRINT ON                                                       01039000
*                                                                  0052 01040000
*/* END OF ATBUILD */                                              0052 01041000
*                                                                  0052 01042000
*         DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */            0052 01043000
*           GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/            0053 01044000
         L     GPR15P,ATCLCPTR                                     0053 01045000
*         END; /*LISATCVT*/                                        0054 01046000
*                                                                  0054 01047000
*                                                                  0054 01048000
*         DO;                                                      0055 01049000
*         RFY (GPR00P) RSTD;                                       0056 01050000
*         END;                                                     0057 01051000
*           GPR00F=4;    /* SET PARAMETER REGISTER TO 4 */         0058 01052000
         LA    GPR00F,4                                            0058 01053000
*           GPR15P=GPR15P->ATCAP31;                                0059 01054000
         L     GPR15P,ATCAP31(,GPR15P)                             0059 01055000
*           DCL FMZL0003 BASED(GPR15P) LABEL VALUERANGE(*);        0060 01056000
*           CALL FMZL0003;                                         0061 01057000
*                                                                  0061 01058000
*                                                                  0061 01059000
         BALR  @14,@15                                             0061 01060000
*         DO;                                                      0062 01061000
*         RFY (GPR00P,GPR15P) UNRSTD;                              0063 01062000
*         END;                                                     0064 01063000
*                                                                  0065 01064000
*                                                                  0065 01065000
*         END;/* TPEXIT */               /* YES, EXIT */           0065 01066000
*   ELSE DO;                         /* NO,LINK TO NXT PROC */     0066 01067000
         B     @RC00033                                            0066 01068000
@RF00033 DS    0H                                                  0067 01069000
*        CPROCPTR = DVTPROC;         /* GET PROCESSOR ADDRESS */   0067 01070000
         L     CPROCPTR,DVTPROC(,DVTPTR)                           0067 01071000
*                                    /* UPDATE DVT PTR */          0068 01072000
*        GENERATE SETS(DVTPTR)  (LA    DVTPTR,4(DVTPTR));          0068 01073000
         LA    DVTPTR,4(DVTPTR)                                         01074000
*        RPHDVTA=DVTPTR;                                           0069 01075000
         ST    DVTPTR,RPHDVTA(,RPHPTR)                             0069 01076000
*        CALL PROCESS;               /* GO TO PROCESSOR */         0070 01077000
         BALR  @14,@15                                             0070 01078000
*        END;                                                      0071 01079000
*                                                                  0071 01080000
* GEN(DC C'ISTESC01  78.336');                                     0072 01081000
*                                                                  0072 01082000
@RC00033 DS    0H                                                  0072 01083000
         DC C'ISTESC01  78.336'                                         01084000
* DO; /* TPEPILOG   */                                             0073 01085000
*                                                                  0074 01086000
* GEN (PRINT OFF);                                                 0074 01087000
*                                                                  0074 01088000
         PRINT OFF                                                      01089000
* DO;                                                              0075 01090000
* DCL GPR00F FIXED(31) REG(00),GPR00P PTR(31) REG(00),GPR01F FIXED(31)  01091000
*EG(01),GPR01P PTR(31) REG(01),GPR02F FIXED(31) REG(02),GPR02P PTR(31)  01092000
*EG(02),GPR03F FIXED(31) REG(03),GPR03P PTR(31) REG(03),GPR04F FIXED(31 01093000
* REG(04),GPR04P PTR(31) REG(04),GPR05F FIXED(31) REG(05),GPR05P PTR(31 01094000
* REG(05),GPR06F FIXED(31) REG(06),GPR06P PTR(31) REG(06),GPR07F FIXED( 01095000
*1) REG(07),GPR07P PTR(31) REG(07),GPR08F FIXED(31) REG(08),GPR08P PTR( 01096000
*1) REG(08),GPR09F FIXED(31) REG(09),GPR09P PTR(31) REG(09),GPR10F FIXE 01097000
*(31) REG(10),GPR10P PTR(31) REG(10),GPR11F FIXED(31) REG(11),GPR11P PT 01098000
*(31) REG(11),GPR12F FIXED(31) REG(12),GPR12P PTR(31) REG(12),GPR13F FI 01099000
*ED(31) REG(13),GPR13P PTR(31) REG(13),GPR14F FIXED(31) REG(14),GPR14P  01100000
*TR(31) REG(14),GPR15F FIXED(31) REG(15),GPR15P PTR(31) REG(15);   0076 01101000
* END;                                                             0077 01102000
*                                                                  0078 01103000
* GEN (PRINT ON);                                                  0078 01104000
         PRINT ON                                                       01105000
* END;/* TPEPILOG */                                               0079 01106000
*END                                                               0080 01107000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 01108000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 01109000
*;                                                                 0080 01110000
@DATA    DS    0H                                                       01111000
@DATD    DSECT                                                          01112000
         DS    0F                                                       01113000
ISTESC01 CSECT                                                          01114000
         DS    0F                                                       01115000
@DATD    DSECT                                                          01116000
         DS    0D                                                       01117000
CVTPTR   DS    A                                                        01118000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01119000
@ENDDATD EQU   *                                                        01120000
ISTESC01 CSECT                                                          01121000
         DS    0F                                                       01122000
@SIZDATD DC    AL1(0)                                                   01123000
         DC    AL3(@ENDDATD-@DATD)                                      01124000
         DS    0D                                                       01125000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01126000
@01      EQU   01                                                       01127000
@02      EQU   02                                                       01128000
@03      EQU   03                                                       01129000
@04      EQU   04                                                       01130000
@05      EQU   05                                                       01131000
@06      EQU   06                                                       01132000
@07      EQU   07                                                       01133000
@08      EQU   08                                                       01134000
@09      EQU   09                                                       01135000
@10      EQU   10                                                       01136000
@11      EQU   11                                                       01137000
@12      EQU   12                                                       01138000
@13      EQU   13                                                       01139000
@14      EQU   14                                                       01140000
@15      EQU   15                                                       01141000
RPHPTR   EQU   @01                                                      01142000
DVTPTR   EQU   @14                                                      01143000
CPROCPTR EQU   @15                                                      01144000
CESCBASE EQU   @15                                                      01145000
GPR15P   EQU   @15                                                      01146000
GPR00P   EQU   @00                                                      01147000
GPR00F   EQU   @00                                                      01148000
GPR01F   EQU   @01                                                      01149000
GPR01P   EQU   @01                                                      01150000
GPR02F   EQU   @02                                                      01151000
GPR02P   EQU   @02                                                      01152000
GPR03F   EQU   @03                                                      01153000
GPR03P   EQU   @03                                                      01154000
GPR04F   EQU   @04                                                      01155000
GPR04P   EQU   @04                                                      01156000
GPR05F   EQU   @05                                                      01157000
GPR05P   EQU   @05                                                      01158000
GPR06F   EQU   @06                                                      01159000
GPR06P   EQU   @06                                                      01160000
GPR07F   EQU   @07                                                      01161000
GPR07P   EQU   @07                                                      01162000
GPR08F   EQU   @08                                                      01163000
GPR08P   EQU   @08                                                      01164000
GPR09F   EQU   @09                                                      01165000
GPR09P   EQU   @09                                                      01166000
GPR10F   EQU   @10                                                      01167000
GPR10P   EQU   @10                                                      01168000
GPR11F   EQU   @11                                                      01169000
GPR11P   EQU   @11                                                      01170000
GPR12F   EQU   @12                                                      01171000
GPR12P   EQU   @12                                                      01172000
GPR13F   EQU   @13                                                      01173000
GPR13P   EQU   @13                                                      01174000
GPR14F   EQU   @14                                                      01175000
GPR14P   EQU   @14                                                      01176000
GPR15F   EQU   @15                                                      01177000
ATCLCPTR EQU   1032                                                     01178000
CVTMAP   EQU   0                                                        01179000
CVTDAR   EQU   CVTMAP+72                                                01180000
CVTFLGS1 EQU   CVTDAR                                                   01181000
CVTDCB   EQU   CVTMAP+116                                               01182000
CVTIERLC EQU   CVTMAP+144                                               01183000
CVTOPTA  EQU   CVTMAP+182                                               01184000
CVTOPTB  EQU   CVTMAP+183                                               01185000
CVTGTF   EQU   CVTMAP+236                                               01186000
CVTGTFST EQU   CVTGTF                                                   01187000
CVTGTFS  EQU   CVTGTFST                                                 01188000
CVTSTATE EQU   CVTGTFST                                                 01189000
CVTTMODE EQU   CVTGTFST                                                 01190000
CVTFORM  EQU   CVTGTFST                                                 01191000
CVTAQAVT EQU   CVTMAP+240                                               01192000
CVTTCMFG EQU   CVTAQAVT                                                 01193000
CVTVOLM2 EQU   CVTMAP+244                                               01194000
CVTTATA  EQU   CVTVOLM2                                                 01195000
CVTTSKS  EQU   CVTTATA                                                  01196000
CVTVOLF2 EQU   CVTTSKS                                                  01197000
CVTTAT   EQU   CVTTATA+1                                                01198000
CVTATER  EQU   CVTMAP+248                                               01199000
CVTEXT1  EQU   CVTMAP+252                                               01200000
CVTPURG  EQU   CVTMAP+260                                               01201000
CVTQMSG  EQU   CVTMAP+268                                               01202000
CVTDMSR  EQU   CVTMAP+272                                               01203000
CVTRSV37 EQU   CVTDMSR                                                  01204000
CVTDMSRF EQU   CVTRSV37                                                 01205000
CVTERPV  EQU   CVTMAP+316                                               01206000
CVTINTLA EQU   CVTMAP+320                                               01207000
CVTAPF   EQU   CVTMAP+324                                               01208000
CVTEXT2  EQU   CVTMAP+328                                               01209000
CVTHJES  EQU   CVTMAP+332                                               01210000
CVTPGSIA EQU   CVTMAP+348                                               01211000
CVTA1F1  EQU   CVTMAP+356                                               01212000
CVTSYSK  EQU   CVTMAP+357                                               01213000
CVTVOLM1 EQU   CVTMAP+380                                               01214000
CVTVOLF1 EQU   CVTVOLM1                                                 01215000
CVTXTNT1 EQU   0                                                        01216000
CVTXTNT2 EQU   0                                                        01217000
CVTDSSV  EQU   CVTXTNT2                                                 01218000
CVTFLGBT EQU   CVTXTNT2+5                                               01219000
CVTQID   EQU   CVTXTNT2+24                                              01220000
CVTRV400 EQU   CVTXTNT2+52                                              01221000
CVTRV409 EQU   CVTXTNT2+53                                              01222000
CVTATCVT EQU   CVTXTNT2+64                                              01223000
CVTRV429 EQU   CVTXTNT2+84                                              01224000
CVTRV438 EQU   CVTXTNT2+85                                              01225000
CVTRV457 EQU   CVTXTNT2+112                                             01226000
CVTRV466 EQU   CVTXTNT2+113                                             01227000
CVTFIX   EQU   0                                                        01228000
CVTRELNO EQU   CVTFIX+252                                               01229000
ISTRPH   EQU   0                                                        01230000
RPHCNTL  EQU   ISTRPH                                                   01231000
RPHFLAGS EQU   RPHCNTL+2                                                01232000
RPHFSTLC EQU   RPHFLAGS                                                 01233000
RPHFLGB  EQU   RPHCNTL+3                                                01234000
RPHRPHA  EQU   ISTRPH+4                                                 01235000
RPHTSKID EQU   ISTRPH+8                                                 01236000
RPHDVTA  EQU   ISTRPH+12                                                01237000
RPHRESMA EQU   ISTRPH+16                                                01238000
RPHWPFLG EQU   RPHRESMA                                                 01239000
RPHWEA   EQU   ISTRPH+24                                                01240000
RPHCSPA  EQU   RPHWEA                                                   01241000
RPHSRPRM EQU   ISTRPH+28                                                01242000
RPHPABQA EQU   ISTRPH+36                                                01243000
RPHWORK  EQU   ISTRPH+40                                                01244000
RPHSAVE1 EQU   RPHWORK                                                  01245000
RPHSBITS EQU   RPHSAVE1+1                                               01246000
ISTLOK   EQU   0                                                        01247000
LOKCHN   EQU   ISTLOK+1                                                 01248000
LOKCHNG  EQU   LOKCHN                                                   01249000
@NM00008 EQU   LOKCHNG+2                                                01250000
ISTDVT   EQU   0                                                        01251000
DVTHDR   EQU   ISTDVT                                                   01252000
DVTHFGA  EQU   DVTHDR+8                                                 01253000
ISTDVTE  EQU   0                                                        01254000
DVTPROC  EQU   ISTDVTE                                                  01255000
DVTFLAG1 EQU   DVTPROC                                                  01256000
DVTEXITF EQU   DVTFLAG1                                                 01257000
PROCESS  EQU   0                                                        01258000
ISTPAB   EQU   0                                                        01259000
PABWQCHN EQU   ISTPAB                                                   01260000
PABWEQA  EQU   PABWQCHN                                                 01261000
PABCHAIN EQU   PABWQCHN+4                                               01262000
PABRUNNG EQU   PABCHAIN                                                 01263000
PABRPHFG EQU   ISTPAB+12                                                01264000
PABFLAGS EQU   PABRPHFG                                                 01265000
PABERLCK EQU   PABFLAGS                                                 01266000
PABERRLK EQU   PABERLCK                                                 01267000
PABEND   EQU   ISTPAB+16                                                01268000
ISTDYPAB EQU   0                                                        01269000
DYPCHAIN EQU   ISTDYPAB+4                                               01270000
DYPPACMD EQU   ISTDYPAB+12                                              01271000
ISTATCVT EQU   0                                                        01272000
ATCRPTCH EQU   ISTATCVT                                                 01273000
ATCITFLD EQU   ISTATCVT+8                                               01274000
ATCITCDS EQU   ATCITFLD+8                                               01275000
ATCITFLG EQU   ATCITCDS+4                                               01276000
ATCITRA1 EQU   ATCITFLG+2                                               01277000
ATCSMPAB EQU   ISTATCVT+88                                              01278000
ATCVDPAB EQU   ISTATCVT+152                                             01279000
ATCLDTIL EQU   ISTATCVT+408                                             01280000
ATCGTSTR EQU   ISTATCVT+608                                             01281000
ATCLUDVT EQU   ISTATCVT+768                                             01282000
ATCANYDT EQU   ISTATCVT+776                                             01283000
@NM00014 EQU   ISTATCVT+780                                             01284000
ATCPODVT EQU   ISTATCVT+804                                             01285000
ATCSTAT  EQU   ISTATCVT+936                                             01286000
ATCSTAT1 EQU   ATCSTAT                                                  01287000
ATCPOFLG EQU   ATCSTAT+2                                                01288000
ATCSTAT4 EQU   ATCSTAT+3                                                01289000
ATCBITAN EQU   ISTATCVT+940                                             01290000
ATCFLAG2 EQU   ATCBITAN+1                                               01291000
ATCONID  EQU   ISTATCVT+944                                             01292000
ATCSSCPA EQU   ISTATCVT+948                                             01293000
ATCHPGM  EQU   ISTATCVT+1012                                            01294000
ATCVLCNT EQU   ISTATCVT+1016                                            01295000
ATCRNO   EQU   ISTATCVT+1020                                            01296000
@NM00037 EQU   ISTATCVT+1028                                            01297000
ATCSHRFG EQU   @NM00037+8                                               01298000
ATCCPDVT EQU   ISTATCVT+1096                                            01299000
ATCSMSDQ EQU   ISTATCVT+1140                                            01300000
ATCRID   EQU   ISTATCVT+1152                                            01301000
ATCLDAPP EQU   ISTATCVT+1288                                            01302000
ATCSQAFR EQU   ISTATCVT+1312                                            01303000
ATCORTCB EQU   ATCSQAFR+4                                               01304000
ATCORSRB EQU   ATCORTCB                                                 01305000
ATCICAPP EQU   ISTATCVT+1320                                            01306000
ATCDAPVT EQU   ISTATCVT+1340                                            01307000
ATCAP31  EQU   ISTATCVT+1372                                            01308000
ATCGSRBQ EQU   ISTATCVT+1472                                            01309000
ATCGSRBG EQU   ATCGSRBQ                                                 01310000
ATCENFLG EQU   ISTATCVT+1512                                            01311000
@NM00052 EQU   ISTATCVT+1575                                            01312000
ATCVTFLG EQU   ISTATCVT+1576                                            01313000
ATCZFLAG EQU   ISTATCVT+1696                                            01314000
ATCCRA   EQU   ISTATCVT+1720                                            01315000
ATCCRACN EQU   ATCCRA+4                                                 01316000
ATCSRB   EQU   ISTATCVT+1728                                            01317000
ATCSRBCN EQU   ATCSRB+4                                                 01318000
ATCCRPL  EQU   ISTATCVT+1736                                            01319000
ATCRPLCN EQU   ATCCRPL+4                                                01320000
FMZL0003 EQU   0                                                        01321000
ISTXDYP  EQU   0                                                        01322000
ISTXPAB  EQU   0                                                        01323000
CVTS01   EQU   CVTPGSIA                                                 01324000
CVTLPDIA EQU   CVTS01+12                                                01325000
CVTDIRST EQU   CVTLPDIA                                                 01326000
CVTSLIDA EQU   CVTS01+24                                                01327000
CVTCTLFG EQU   CVTS01+50                                                01328000
CVTRV210 EQU   CVTS01+424                                               01329000
CVTRV219 EQU   CVTS01+425                                               01330000
CVTRV228 EQU   CVTS01+426                                               01331000
CVTRV237 EQU   CVTS01+427                                               01332000
CVTMFRTR EQU   CVTS01+452                                               01333000
CVTRV262 EQU   CVTS01+468                                               01334000
CVTRV271 EQU   CVTS01+469                                               01335000
CVTRV280 EQU   CVTS01+470                                               01336000
CVTRV289 EQU   CVTS01+471                                               01337000
CVTGSDA  EQU   CVTS01+600                                               01338000
PABXTNSN EQU   PABEND                                                   01339000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01340000
@NM00010 EQU   PABXTNSN+12                                              01341000
PABNPSSQ EQU   PABXTNSN+8                                               01342000
PABLOCK  EQU   PABXTNSN+4                                               01343000
PABLAST  EQU   PABXTNSN                                                 01344000
CVTRV628 EQU   CVTS01+728                                               01345000
CVTRV627 EQU   CVTS01+724                                               01346000
CVTRV626 EQU   CVTS01+720                                               01347000
CVTRV625 EQU   CVTS01+716                                               01348000
CVTRV624 EQU   CVTS01+712                                               01349000
CVTRV623 EQU   CVTS01+708                                               01350000
CVTRV622 EQU   CVTS01+704                                               01351000
CVTRV621 EQU   CVTS01+700                                               01352000
CVTIHASU EQU   CVTS01+696                                               01353000
CVTSUSP  EQU   CVTS01+692                                               01354000
CVTT6SVC EQU   CVTS01+688                                               01355000
CVTCDAL  EQU   CVTS01+684                                               01356000
CVTTCTL  EQU   CVTS01+680                                               01357000
CVTRSUME EQU   CVTS01+676                                               01358000
CVTJTERM EQU   CVTS01+672                                               01359000
CVTASMRM EQU   CVTS01+668                                               01360000
CVTTCASP EQU   CVTS01+664                                               01361000
CVT0PT03 EQU   CVTS01+660                                               01362000
CVT0PT0E EQU   CVTS01+656                                               01363000
CVTRV609 EQU   CVTS01+652                                               01364000
CVTCGK   EQU   CVTS01+648                                               01365000
CVTRAC   EQU   CVTS01+644                                               01366000
CVTRV606 EQU   CVTS01+640                                               01367000
CVTRV605 EQU   CVTS01+636                                               01368000
CVTRV604 EQU   CVTS01+632                                               01369000
CVTEFF02 EQU   CVTS01+628                                               01370000
CVTCBBR  EQU   CVTS01+624                                               01371000
CVTSSCR  EQU   CVTS01+620                                               01372000
CVTEVENT EQU   CVTS01+616                                               01373000
CVTCRCA  EQU   CVTS01+612                                               01374000
CVTTPIO  EQU   CVTS01+608                                               01375000
CVTADV   EQU   CVTS01+604                                               01376000
CVTGSDAB EQU   CVTGSDA                                                  01377000
CVTQV3   EQU   CVTS01+596                                               01378000
CVTQV2   EQU   CVTS01+592                                               01379000
CVTQV1   EQU   CVTS01+588                                               01380000
CVTRPT   EQU   CVTS01+584                                               01381000
CVTSSRB  EQU   CVTS01+580                                               01382000
CVTCSDRL EQU   CVTS01+576                                               01383000
CVTEXP1  EQU   CVTS01+572                                               01384000
CVTRMPMT EQU   CVTS01+568                                               01385000
CVTRMPTT EQU   CVTS01+564                                               01386000
CVTVPSA  EQU   CVTS01+560                                               01387000
CVTVSTOP EQU   CVTS01+556                                               01388000
CVTGTFR8 EQU   CVTS01+552                                               01389000
CVTQUIT  EQU   CVTS01+548                                               01390000
CVTVACR  EQU   CVTS01+544                                               01391000
CVTWTCB  EQU   CVTS01+540                                               01392000
CVTSTPRS EQU   CVTS01+536                                               01393000
CVT0PT02 EQU   CVTS01+532                                               01394000
CVTDARCM EQU   CVTS01+528                                               01395000
CVTIRECM EQU   CVTS01+524                                               01396000
CVTJRECM EQU   CVTS01+520                                               01397000
CVTVEMS0 EQU   CVTS01+516                                               01398000
CVTSPFRR EQU   CVTS01+512                                               01399000
CVTRLSTG EQU   CVTS01+508                                               01400000
CVT0TC0A EQU   CVTS01+504                                               01401000
CVTGMBR  EQU   CVTS01+500                                               01402000
CVTLFRM  EQU   CVTS01+496                                               01403000
CVTRMBR  EQU   CVTS01+492                                               01404000
CVTVIOP  EQU   CVTS01+488                                               01405000
CVTRV307 EQU   CVTS01+486                                               01406000
CVTRV306 EQU   CVTS01+484                                               01407000
CVTRV305 EQU   CVTS01+482                                               01408000
CVTRV304 EQU   CVTS01+480                                               01409000
CVTRV303 EQU   CVTS01+478                                               01410000
CVTRV302 EQU   CVTS01+476                                               01411000
CVTTRCA  EQU   CVTS01+472                                               01412000
CVTRV297 EQU   CVTRV289                                                 01413000
CVTRV296 EQU   CVTRV289                                                 01414000
CVTRV295 EQU   CVTRV289                                                 01415000
CVTRV294 EQU   CVTRV289                                                 01416000
CVTRV293 EQU   CVTRV289                                                 01417000
CVTRV292 EQU   CVTRV289                                                 01418000
CVTRV291 EQU   CVTRV289                                                 01419000
CVTRV290 EQU   CVTRV289                                                 01420000
CVTRV288 EQU   CVTRV280                                                 01421000
CVTRV287 EQU   CVTRV280                                                 01422000
CVTRV286 EQU   CVTRV280                                                 01423000
CVTRV285 EQU   CVTRV280                                                 01424000
CVTRV284 EQU   CVTRV280                                                 01425000
CVTRV283 EQU   CVTRV280                                                 01426000
CVTRV282 EQU   CVTRV280                                                 01427000
CVTRV281 EQU   CVTRV280                                                 01428000
CVTRV279 EQU   CVTRV271                                                 01429000
CVTRV278 EQU   CVTRV271                                                 01430000
CVTRV277 EQU   CVTRV271                                                 01431000
CVTRV276 EQU   CVTRV271                                                 01432000
CVTRV275 EQU   CVTRV271                                                 01433000
CVTRV274 EQU   CVTRV271                                                 01434000
CVTRV273 EQU   CVTRV271                                                 01435000
CVTRV272 EQU   CVTRV271                                                 01436000
CVTRV270 EQU   CVTRV262                                                 01437000
CVTRV269 EQU   CVTRV262                                                 01438000
CVTRV268 EQU   CVTRV262                                                 01439000
CVTRV267 EQU   CVTRV262                                                 01440000
CVTRV266 EQU   CVTRV262                                                 01441000
CVTRV265 EQU   CVTRV262                                                 01442000
CVTRV264 EQU   CVTRV262                                                 01443000
CVTRV263 EQU   CVTRV262                                                 01444000
CVTVFP   EQU   CVTS01+464                                               01445000
CVTVSI   EQU   CVTS01+460                                               01446000
CVTVPSIB EQU   CVTS01+456                                               01447000
CVTMFACT EQU   CVTMFRTR                                                 01448000
CVTMFCTL EQU   CVTS01+448                                               01449000
CVTPVBP  EQU   CVTS01+444                                               01450000
CVTPWI   EQU   CVTS01+440                                               01451000
CVTRV254 EQU   CVTS01+438                                               01452000
CVTRV253 EQU   CVTS01+436                                               01453000
CVTRV252 EQU   CVTS01+434                                               01454000
CVTRV251 EQU   CVTS01+433                                               01455000
CVTRV250 EQU   CVTS01+432                                               01456000
CVTRV249 EQU   CVTS01+431                                               01457000
CVTRV248 EQU   CVTS01+430                                               01458000
CVTRV247 EQU   CVTS01+429                                               01459000
CVTRV246 EQU   CVTS01+428                                               01460000
CVTRV245 EQU   CVTRV237                                                 01461000
CVTRV244 EQU   CVTRV237                                                 01462000
CVTRV243 EQU   CVTRV237                                                 01463000
CVTRV242 EQU   CVTRV237                                                 01464000
CVTRV241 EQU   CVTRV237                                                 01465000
CVTRV240 EQU   CVTRV237                                                 01466000
CVTRV239 EQU   CVTRV237                                                 01467000
CVTRV238 EQU   CVTRV237                                                 01468000
CVTRV236 EQU   CVTRV228                                                 01469000
CVTRV235 EQU   CVTRV228                                                 01470000
CVTRV234 EQU   CVTRV228                                                 01471000
CVTRV233 EQU   CVTRV228                                                 01472000
CVTRV232 EQU   CVTRV228                                                 01473000
CVTRV231 EQU   CVTRV228                                                 01474000
CVTRV230 EQU   CVTRV228                                                 01475000
CVTRV229 EQU   CVTRV228                                                 01476000
CVTRV227 EQU   CVTRV219                                                 01477000
CVTRV226 EQU   CVTRV219                                                 01478000
CVTRV225 EQU   CVTRV219                                                 01479000
CVTRV224 EQU   CVTRV219                                                 01480000
CVTRV223 EQU   CVTRV219                                                 01481000
CVTRV222 EQU   CVTRV219                                                 01482000
CVTRV221 EQU   CVTRV219                                                 01483000
CVTRV220 EQU   CVTRV219                                                 01484000
CVTRV218 EQU   CVTRV210                                                 01485000
CVTRV217 EQU   CVTRV210                                                 01486000
CVTRV216 EQU   CVTRV210                                                 01487000
CVTRV215 EQU   CVTRV210                                                 01488000
CVTRV214 EQU   CVTRV210                                                 01489000
CVTRV213 EQU   CVTRV210                                                 01490000
CVTRV212 EQU   CVTRV210                                                 01491000
CVTRV211 EQU   CVTRV210                                                 01492000
CVTLCCAT EQU   CVTS01+420                                               01493000
CVTPCCAT EQU   CVTS01+416                                               01494000
CVTIPCRP EQU   CVTS01+412                                               01495000
CVTIPCRI EQU   CVTS01+408                                               01496000
CVTIPCDS EQU   CVTS01+404                                               01497000
CVTAIDVT EQU   CVTS01+400                                               01498000
CVTSSAP  EQU   CVTS01+396                                               01499000
CVTEHCIR EQU   CVTS01+392                                               01500000
CVTEHDEF EQU   CVTS01+388                                               01501000
CVTDAIR  EQU   CVTS01+384                                               01502000
CVTPERFM EQU   CVTS01+380                                               01503000
CVT044R2 EQU   CVTS01+376                                               01504000
CVTFETCH EQU   CVTS01+372                                               01505000
CVTRSTWD EQU   CVTS01+368                                               01506000
CVTSPOST EQU   CVTS01+364                                               01507000
CVTIOBP  EQU   CVTS01+360                                               01508000
CVTASMVT EQU   CVTS01+356                                               01509000
CVTRECRQ EQU   CVTS01+352                                               01510000
CVTWSAC  EQU   CVTS01+348                                               01511000
CVTRV149 EQU   CVTS01+344                                               01512000
CVTWSAL  EQU   CVTS01+340                                               01513000
CVTSPSA  EQU   CVTS01+336                                               01514000
CVTGLMN  EQU   CVTS01+332                                               01515000
CVTVEAC0 EQU   CVTS01+328                                               01516000
CVT062R1 EQU   CVTS01+324                                               01517000
CVTRPOST EQU   CVTS01+320                                               01518000
CVTDQIQE EQU   CVTS01+316                                               01519000
CVTCSD   EQU   CVTS01+312                                               01520000
CVTLKRMA EQU   CVTS01+308                                               01521000
CVTRSPIE EQU   CVTS01+304                                               01522000
CVTRENQ  EQU   CVTS01+300                                               01523000
CVTLQCB  EQU   CVTS01+296                                               01524000
CVTFQCB  EQU   CVTS01+292                                               01525000
CVTQCS01 EQU   CVTS01+288                                               01526000
CVTAPFT  EQU   CVTS01+284                                               01527000
CVTPARRL EQU   CVTS01+280                                               01528000
CVTVWAIT EQU   CVTS01+276                                               01529000
CVTGSPL  EQU   CVTS01+272                                               01530000
CVTLSMQ  EQU   CVTS01+268                                               01531000
CVTGSMQ  EQU   CVTS01+264                                               01532000
CVTEXPRO EQU   CVTS01+260                                               01533000
CVTOPCTP EQU   CVTS01+256                                               01534000
CVTSIC   EQU   CVTS01+252                                               01535000
CVTTPIOS EQU   CVTS01+248                                               01536000
CVTRTMS  EQU   CVTS01+244                                               01537000
CVTSDBF  EQU   CVTS01+240                                               01538000
CVTSCBP  EQU   CVTS01+236                                               01539000
CVTSDMP  EQU   CVTS01+232                                               01540000
CVTSV60  EQU   CVTS01+228                                               01541000
CVTRTMCT EQU   CVTS01+224                                               01542000
CVTASCBL EQU   CVTS01+220                                               01543000
CVTASCBH EQU   CVTS01+216                                               01544000
CVTGDA   EQU   CVTS01+212                                               01545000
CVTASVT  EQU   CVTS01+208                                               01546000
CVTVVMDI EQU   CVTS01+204                                               01547000
CVTAQTOP EQU   CVTS01+200                                               01548000
CVTIOSCS EQU   CVTS01+196                                               01549000
CVTSDRM  EQU   CVTS01+192                                               01550000
CVTOPTE  EQU   CVTS01+188                                               01551000
CVTSTXU  EQU   CVTS01+184                                               01552000
CVTQUIS  EQU   CVTS01+180                                               01553000
CVTPARS  EQU   CVTS01+176                                               01554000
CVTS1EE  EQU   CVTS01+172                                               01555000
CVTFRAS  EQU   CVTS01+168                                               01556000
CVTQSAS  EQU   CVTS01+164                                               01557000
CVTCRAS  EQU   CVTS01+160                                               01558000
CVTCRMN  EQU   CVTS01+156                                               01559000
CVTDELCP EQU   CVTS01+152                                               01560000
CVTFRECL EQU   CVTS01+148                                               01561000
CVTGETCL EQU   CVTS01+144                                               01562000
CVTBLDCP EQU   CVTS01+140                                               01563000
CVTAUTHL EQU   CVTS01+136                                               01564000
CVTSCAN  EQU   CVTS01+132                                               01565000
CVTRV144 EQU   CVTS01+130                                               01566000
CVTMAXMP EQU   CVTS01+128                                               01567000
CVTSTCK  EQU   CVTS01+124                                               01568000
CVTRV139 EQU   CVTS01+123                                               01569000
CVTDSSAC EQU   CVTS01+122                                               01570000
CVTRV513 EQU   CVTS01+121                                               01571000
CVTIOSPL EQU   CVTS01+120                                               01572000
CVTPTGT  EQU   CVTS01+116                                               01573000
CVTCSPIE EQU   CVTS01+112                                               01574000
CVTSMFEX EQU   CVTS01+108                                               01575000
CVTOLT0A EQU   CVTS01+104                                               01576000
CVTSRBRT EQU   CVTS01+100                                               01577000
CVTPUTL  EQU   CVTS01+96                                                01578000
CVTASCRL EQU   CVTS01+92                                                01579000
CVTASCRF EQU   CVTS01+88                                                01580000
CVTRV326 EQU   CVTS01+84                                                01581000
CVTRV325 EQU   CVTS01+80                                                01582000
CVTRV324 EQU   CVTS01+76                                                01583000
CVT0VL01 EQU   CVTS01+72                                                01584000
CVTSHRVM EQU   CVTS01+68                                                01585000
CVTRV332 EQU   CVTS01+64                                                01586000
CVTTAS   EQU   CVTS01+60                                                01587000
CVTRSCN  EQU   CVTS01+56                                                01588000
CVTTRAC2 EQU   CVTS01+54                                                01589000
CVTTRACE EQU   CVTS01+52                                                01590000
CVTAPG   EQU   CVTS01+51                                                01591000
CVTSDTRC EQU   CVTCTLFG                                                 01592000
CVTGTRCE EQU   CVTCTLFG                                                 01593000
CVTNOMP  EQU   CVTCTLFG                                                 01594000
CVTRSV79 EQU   CVTCTLFG                                                 01595000
CVTDSTAT EQU   CVTCTLFG                                                 01596000
CVTRSV78 EQU   CVTCTLFG                                                 01597000
CVTRV333 EQU   CVTCTLFG                                                 01598000
CVTRV323 EQU   CVTCTLFG                                                 01599000
CVTSPVLK EQU   CVTS01+49                                                01600000
CVTRSV77 EQU   CVTS01+48                                                01601000
CVTRV331 EQU   CVTS01+44                                                01602000
CVTRV330 EQU   CVTS01+40                                                01603000
CVTRV329 EQU   CVTS01+36                                                01604000
CVTRV328 EQU   CVTS01+32                                                01605000
CVTRV322 EQU   CVTS01+28                                                01606000
CVTSLID  EQU   CVTSLIDA+1                                               01607000
CVTSYLK  EQU   CVTSLIDA                                                 01608000
CVTRV321 EQU   CVTS01+20                                                01609000
CVTRV320 EQU   CVTS01+16                                                01610000
CVTLPDIR EQU   CVTLPDIA+1                                               01611000
CVTRSV69 EQU   CVTDIRST                                                 01612000
CVTRSV68 EQU   CVTDIRST                                                 01613000
CVTRSV67 EQU   CVTDIRST                                                 01614000
CVTRSV66 EQU   CVTDIRST                                                 01615000
CVTRSV65 EQU   CVTDIRST                                                 01616000
CVTRSV64 EQU   CVTDIRST                                                 01617000
CVTRSV63 EQU   CVTDIRST                                                 01618000
CVTDICOM EQU   CVTDIRST                                                 01619000
CVTPVTP  EQU   CVTS01+8                                                 01620000
CVTLPDSR EQU   CVTS01+4                                                 01621000
CVTGETL  EQU   CVTS01                                                   01622000
ATCAOS   EQU   ISTATCVT+1868                                            01623000
@NM00062 EQU   ISTATCVT+1860                                            01624000
@NM00061 EQU   ISTATCVT+1852                                            01625000
@NM00060 EQU   ISTATCVT+1844                                            01626000
@NM00059 EQU   ISTATCVT+1836                                            01627000
@NM00058 EQU   ISTATCVT+1828                                            01628000
@NM00057 EQU   ISTATCVT+1820                                            01629000
@NM00056 EQU   ISTATCVT+1816                                            01630000
ATCCACSA EQU   ISTATCVT+1812                                            01631000
ATCMXCSA EQU   ISTATCVT+1808                                            01632000
ATCTPMPB EQU   ISTATCVT+1776                                            01633000
ATCTRMPB EQU   ISTATCVT+1744                                            01634000
ATCRPLAC EQU   ATCRPLCN+2                                               01635000
ATCRPLRC EQU   ATCRPLCN                                                 01636000
ATCCRPLQ EQU   ATCCRPL                                                  01637000
ATCSRBAC EQU   ATCSRBCN+2                                               01638000
ATCSRBRC EQU   ATCSRBCN                                                 01639000
ATCSRBQ  EQU   ATCSRB                                                   01640000
ATCCRAAC EQU   ATCCRACN+2                                               01641000
ATCCRARC EQU   ATCCRACN                                                 01642000
ATCCRAQ  EQU   ATCCRA                                                   01643000
ATCLUFFD EQU   ISTATCVT+1716                                            01644000
ATCVIOPM EQU   ISTATCVT+1712                                            01645000
ATCTPMMI EQU   ISTATCVT+1708                                            01646000
ATCPXSRB EQU   ISTATCVT+1704                                            01647000
ATCRPLCT EQU   ISTATCVT+1702                                            01648000
ATCCRACT EQU   ISTATCVT+1700                                            01649000
ATCSRBCT EQU   ISTATCVT+1698                                            01650000
ATCSTNSM EQU   ISTATCVT+1697                                            01651000
@NM00055 EQU   ATCZFLAG                                                 01652000
ATCZF001 EQU   ATCZFLAG                                                 01653000
ATCTPCP1 EQU   ISTATCVT+1692                                            01654000
ATCTPCP0 EQU   ISTATCVT+1688                                            01655000
ATCZR01  EQU   ISTATCVT+1684                                            01656000
ATCMPLTA EQU   ISTATCVT+1680                                            01657000
ATCASCB  EQU   ISTATCVT+1676                                            01658000
ATCAP86  EQU   ISTATCVT+1672                                            01659000
ATCAP85  EQU   ISTATCVT+1668                                            01660000
ATCAP84  EQU   ISTATCVT+1664                                            01661000
ATCAP83  EQU   ISTATCVT+1660                                            01662000
ATCAP82  EQU   ISTATCVT+1656                                            01663000
ATCAP69  EQU   ISTATCVT+1652                                            01664000
ATCAP66  EQU   ISTATCVT+1648                                            01665000
ATCAP62  EQU   ISTATCVT+1644                                            01666000
ATCAPC59 EQU   ISTATCVT+1640                                            01667000
ATCAP56  EQU   ISTATCVT+1636                                            01668000
ATCAP55  EQU   ISTATCVT+1632                                            01669000
ATCAP41  EQU   ISTATCVT+1628                                            01670000
ATCAPC25 EQU   ISTATCVT+1624                                            01671000
ATCAP23  EQU   ISTATCVT+1620                                            01672000
ATCAPBE  EQU   ISTATCVT+1616                                            01673000
ATCPSTA  EQU   ISTATCVT+1612                                            01674000
ATCSMABF EQU   ISTATCVT+1608                                            01675000
ATCSMAPR EQU   ISTATCVT+1604                                            01676000
ATCTPWQA EQU   ISTATCVT+1600                                            01677000
ATCSMAID EQU   ISTATCVT+1596                                            01678000
ATCSMARA EQU   ISTATCVT+1592                                            01679000
ATCCACXA EQU   ISTATCVT+1588                                            01680000
ATCATA10 EQU   ISTATCVT+1584                                            01681000
ATCHLTCB EQU   ISTATCVT+1580                                            01682000
@NM00054 EQU   ATCVTFLG                                                 01683000
ATCVTACT EQU   ATCVTFLG                                                 01684000
@NM00053 EQU   @NM00052                                                 01685000
ATCVTMAB EQU   @NM00052                                                 01686000
ATCVTBAM EQU   ISTATCVT+1572                                            01687000
@NM00051 EQU   ISTATCVT+1568                                            01688000
@NM00050 EQU   ISTATCVT+1520                                            01689000
ATCCCOOC EQU   ISTATCVT+1516                                            01690000
@NM00049 EQU   ISTATCVT+1513                                            01691000
ATCSNUF  EQU   ATCENFLG                                                 01692000
ATCOPKL  EQU   ATCENFLG                                                 01693000
ATCABEN  EQU   ATCENFLG                                                 01694000
ATCSRDN  EQU   ATCENFLG                                                 01695000
ATCDLDN  EQU   ATCENFLG                                                 01696000
ATCTIMER EQU   ISTATCVT+1508                                            01697000
ATCAIWT  EQU   ISTATCVT+1504                                            01698000
ATCOROBT EQU   ISTATCVT+1500                                            01699000
ATCDMAPP EQU   ISTATCVT+1496                                            01700000
ATCZDVTX EQU   ISTATCVT+1492                                            01701000
ATCPXCRA EQU   ISTATCVT+1488                                            01702000
ATCICNCB EQU   ISTATCVT+1484                                            01703000
ATCCMTCB EQU   ISTATCVT+1480                                            01704000
ATCPRPH  EQU   ISTATCVT+1476                                            01705000
ATCGSRBF EQU   ATCGSRBG                                                 01706000
ATCSRBRT EQU   ISTATCVT+1468                                            01707000
ATCTSCPC EQU   ISTATCVT+1464                                            01708000
@NM00048 EQU   ISTATCVT+1460                                            01709000
ATCCDTCB EQU   ISTATCVT+1456                                            01710000
ATCORFRL EQU   ISTATCVT+1452                                            01711000
ATCORFPX EQU   ISTATCVT+1448                                            01712000
ATCORFMG EQU   ISTATCVT+1444                                            01713000
ATCSMBQ  EQU   ISTATCVT+1440                                            01714000
ATCINFDD EQU   ISTATCVT+1436                                            01715000
ATCAP67  EQU   ISTATCVT+1432                                            01716000
ATCAP65  EQU   ISTATCVT+1428                                            01717000
ATCAP64  EQU   ISTATCVT+1424                                            01718000
ATCAP63  EQU   ISTATCVT+1420                                            01719000
ATCAP61  EQU   ISTATCVT+1416                                            01720000
ATCAP58  EQU   ISTATCVT+1412                                            01721000
ATCAP57  EQU   ISTATCVT+1408                                            01722000
ATCAP54  EQU   ISTATCVT+1404                                            01723000
ATCAP53  EQU   ISTATCVT+1400                                            01724000
ATCAP52  EQU   ISTATCVT+1396                                            01725000
ATCAP51  EQU   ISTATCVT+1392                                            01726000
ATCAP38  EQU   ISTATCVT+1388                                            01727000
ATCAP37  EQU   ISTATCVT+1384                                            01728000
ATCAP34  EQU   ISTATCVT+1380                                            01729000
ATCAP32  EQU   ISTATCVT+1376                                            01730000
ATCAP12  EQU   ISTATCVT+1368                                            01731000
ATCAP11  EQU   ISTATCVT+1364                                            01732000
ATCDAPDG EQU   ATCDAPVT+20                                              01733000
ATCDXCEA EQU   ATCDAPVT+16                                              01734000
ATCDCEA  EQU   ATCDAPVT+12                                              01735000
ATCDPCIA EQU   ATCDAPVT+8                                               01736000
ATCDSIOA EQU   ATCDAPVT+4                                               01737000
ATCDEOEA EQU   ATCDAPVT                                                 01738000
ATCZAEA  EQU   ATCICAPP+16                                              01739000
ATCZCEA  EQU   ATCICAPP+12                                              01740000
ATCZCPCI EQU   ATCICAPP+8                                               01741000
ATCZSIOA EQU   ATCICAPP+4                                               01742000
ATCCDRPH EQU   ATCICAPP                                                 01743000
ATCORQG  EQU   ATCORSRB                                                 01744000
ATCORTBF EQU   ATCSQAFR                                                 01745000
@NM00047 EQU   ISTATCVT+1308                                            01746000
ATCZLAEA EQU   ATCLDAPP+16                                              01747000
ATCZLCEA EQU   ATCLDAPP+12                                              01748000
ATCZLPCI EQU   ATCLDAPP+8                                               01749000
ATCSMFRR EQU   ATCLDAPP+4                                               01750000
ATCCDTID EQU   ATCLDAPP                                                 01751000
@NM00046 EQU   ISTATCVT+1256                                            01752000
ATCZPAB2 EQU   ISTATCVT+1224                                            01753000
@NM00045 EQU   ISTATCVT+1224                                            01754000
@NM00044 EQU   ISTATCVT+1164                                            01755000
ATCCPCFE EQU   ISTATCVT+1160                                            01756000
@NM00043 EQU   ATCRID+2                                                 01757000
ATCCDRMA EQU   ATCRID                                                   01758000
@NM00042 EQU   ATCSMSDQ+8                                               01759000
@NM00041 EQU   ATCSMSDQ+4                                               01760000
@NM00040 EQU   ATCSMSDQ                                                 01761000
ATCSEQNO EQU   ISTATCVT+1136                                            01762000
ATCSMPMD EQU   ISTATCVT+1132                                            01763000
ATCPAREA EQU   ISTATCVT+1128                                            01764000
ATCCPCSM EQU   ISTATCVT+1124                                            01765000
ATCQLOCK EQU   ISTATCVT+1120                                            01766000
ATCITQLE EQU   ISTATCVT+1116                                            01767000
ATCSQCDS EQU   ISTATCVT+1112                                            01768000
ATCUSSVT EQU   ISTATCVT+1108                                            01769000
ATCNOSQ  EQU   ISTATCVT+1104                                            01770000
ATCINCIP EQU   ATCCPDVT+4                                               01771000
ATCTSCNI EQU   ATCCPDVT                                                 01772000
ATCMGCRT EQU   ISTATCVT+1092                                            01773000
ATCMACRT EQU   ISTATCVT+1088                                            01774000
ATCCSMT  EQU   ISTATCVT+1084                                            01775000
ATCDRUSL EQU   ISTATCVT+1080                                            01776000
ATCDRULL EQU   ISTATCVT+1076                                            01777000
ATCCFCDR EQU   ISTATCVT+1072                                            01778000
@NM00039 EQU   ISTATCVT+1069                                            01779000
ATCMROUT EQU   ISTATCVT+1060                                            01780000
ATCONFIG EQU   ISTATCVT+1052                                            01781000
ATCNODEL EQU   ISTATCVT+1044                                            01782000
@NM00038 EQU   @NM00037+9                                               01783000
ATCLAST  EQU   ATCSHRFG                                                 01784000
ATCSHRTN EQU   @NM00037                                                 01785000
@NM00036 EQU   ISTATCVT+1026                                            01786000
ATCNMCTR EQU   ISTATCVT+1024                                            01787000
ATCPOIA  EQU   ATCRNO+1                                                 01788000
@NM00035 EQU   ATCRNO                                                   01789000
ATCLCLCT EQU   ATCVLCNT+2                                               01790000
ATCRNCNT EQU   ATCVLCNT                                                 01791000
ATCHBSIZ EQU   ATCHPGM+2                                                01792000
ATCHBFNO EQU   ATCHPGM                                                  01793000
@NM00034 EQU   ISTATCVT+1011                                            01794000
ATCXRANG EQU   ISTATCVT+1010                                            01795000
ATCMAXID EQU   ISTATCVT+1009                                            01796000
ATCMSGSP EQU   ISTATCVT+1008                                            01797000
ATCCIDM  EQU   ISTATCVT+1006                                            01798000
ATCACTRM EQU   ISTATCVT+1004                                            01799000
ATCECTLP EQU   ISTATCVT+1000                                            01800000
ATCECNET EQU   ISTATCVT+996                                             01801000
ATCECOPC EQU   ISTATCVT+992                                             01802000
ATCECSES EQU   ISTATCVT+988                                             01803000
ATCECDSP EQU   ISTATCVT+984                                             01804000
ATCECVRY EQU   ISTATCVT+980                                             01805000
ATCECHLT EQU   ISTATCVT+976                                             01806000
ATCECMOD EQU   ISTATCVT+972                                             01807000
ATCVDLOK EQU   ISTATCVT+968                                             01808000
ATCRDTLK EQU   ISTATCVT+964                                             01809000
ATCVOCLK EQU   ISTATCVT+960                                             01810000
ATCITLIM EQU   ISTATCVT+958                                             01811000
ATCTMINV EQU   ISTATCVT+956                                             01812000
ATCHOSTA EQU   ISTATCVT+954                                             01813000
ATCPUNSA EQU   ISTATCVT+952                                             01814000
ATCSAF   EQU   ISTATCVT+950                                             01815000
ATCVTMID EQU   ATCSSCPA                                                 01816000
ATCHCNID EQU   ATCONID+2                                                01817000
ATCSCNID EQU   ATCONID                                                  01818000
@NM00033 EQU   ATCBITAN+3                                               01819000
@NM00032 EQU   ATCBITAN+2                                               01820000
@NM00031 EQU   ATCFLAG2                                                 01821000
@NM00030 EQU   ATCFLAG2                                                 01822000
@NM00029 EQU   ATCFLAG2                                                 01823000
ATCCRYPF EQU   ATCFLAG2                                                 01824000
ATCTUNCL EQU   ATCFLAG2                                                 01825000
ATCTUNRQ EQU   ATCFLAG2                                                 01826000
ATCTUNAC EQU   ATCFLAG2                                                 01827000
ATCCDLRA EQU   ATCFLAG2                                                 01828000
@NM00028 EQU   ATCBITAN                                                 01829000
@NM00027 EQU   ATCSTAT4                                                 01830000
@NM00026 EQU   ATCSTAT4                                                 01831000
@NM00025 EQU   ATCSTAT4                                                 01832000
@NM00024 EQU   ATCSTAT4                                                 01833000
@NM00023 EQU   ATCSTAT4                                                 01834000
ATCPRTAT EQU   ATCSTAT4                                                 01835000
ATCNCSD  EQU   ATCSTAT4                                                 01836000
ATCMTST  EQU   ATCSTAT4                                                 01837000
@NM00022 EQU   ATCPOFLG                                                 01838000
@NM00021 EQU   ATCPOFLG                                                 01839000
@NM00020 EQU   ATCPOFLG                                                 01840000
@NM00019 EQU   ATCPOFLG                                                 01841000
@NM00018 EQU   ATCPOFLG                                                 01842000
@NM00017 EQU   ATCPOFLG                                                 01843000
@NM00016 EQU   ATCPOFLG                                                 01844000
ATCPOUNS EQU   ATCPOFLG                                                 01845000
@NM00015 EQU   ATCSTAT+1                                                01846000
ATCHIP   EQU   ATCSTAT1                                                 01847000
ATCMDHLT EQU   ATCSTAT1                                                 01848000
ATCINHLT EQU   ATCSTAT1                                                 01849000
ATCNETSL EQU   ATCSTAT1                                                 01850000
ATCQKHLT EQU   ATCSTAT1                                                 01851000
ATCSNHLT EQU   ATCSTAT1                                                 01852000
ATCACTIV EQU   ATCSTAT1                                                 01853000
ATCSTART EQU   ATCSTAT1                                                 01854000
ATCNOP00 EQU   ISTATCVT+932                                             01855000
ATCTSBUF EQU   ISTATCVT+928                                             01856000
ATCFEPT  EQU   ISTATCVT+924                                             01857000
ATCFDVT  EQU   ISTATCVT+920                                             01858000
ATCCONFT EQU   ISTATCVT+916                                             01859000
ATCRDTH  EQU   ISTATCVT+912                                             01860000
ATCSIBQ  EQU   ISTATCVT+908                                             01861000
ATCHLTMS EQU   ISTATCVT+904                                             01862000
ATCECPRM EQU   ISTATCVT+900                                             01863000
ATCVPARM EQU   ISTATCVT+896                                             01864000
ATCOCHA  EQU   ISTATCVT+892                                             01865000
ATCDSPLQ EQU   ISTATCVT+888                                             01866000
ATCVARYQ EQU   ISTATCVT+884                                             01867000
ATCHALTQ EQU   ISTATCVT+880                                             01868000
ATCMODQ  EQU   ISTATCVT+876                                             01869000
ATCSRT   EQU   ISTATCVT+872                                             01870000
ATCRDT   EQU   ISTATCVT+868                                             01871000
ATCSDVT  EQU   ISTATCVT+864                                             01872000
ATCDLRPT EQU   ISTATCVT+860                                             01873000
ATCBPDA  EQU   ISTATCVT+856                                             01874000
ATCACDA  EQU   ISTATCVT+852                                             01875000
ATCMNT   EQU   ISTATCVT+848                                             01876000
ATCUEP   EQU   ISTATCVT+844                                             01877000
ATCNODDS EQU   ISTATCVT+840                                             01878000
ATCITRT  EQU   ISTATCVT+836                                             01879000
ATCTODVT EQU   ISTATCVT+832                                             01880000
ATCTRCPT EQU   ISTATCVT+828                                             01881000
ATCMODTB EQU   ISTATCVT+824                                             01882000
ATCUSSPT EQU   ISTATCVT+820                                             01883000
ATCTUBUF EQU   ISTATCVT+816                                             01884000
ATCTACB  EQU   ISTATCVT+812                                             01885000
ATCDWA   EQU   ISTATCVT+808                                             01886000
ATCCFCR2 EQU   ATCPODVT                                                 01887000
ATCEPA   EQU   ISTATCVT+800                                             01888000
ATCPULQB EQU   @NM00014+16                                              01889000
ATCMCQAB EQU   @NM00014+12                                              01890000
ATCLUSMQ EQU   @NM00014+8                                               01891000
ATCLUIOQ EQU   @NM00014+4                                               01892000
ATCIOLQB EQU   @NM00014                                                 01893000
ATCTSCAP EQU   ATCANYDT                                                 01894000
ATCTSCCO EQU   ATCLUDVT+4                                               01895000
ATCTSCSR EQU   ATCLUDVT                                                 01896000
ATCVTLOD EQU   ISTATCVT+764                                             01897000
ATCTSCLF EQU   ISTATCVT+760                                             01898000
ATCTSCLE EQU   ISTATCVT+756                                             01899000
ATCTSCLB EQU   ISTATCVT+752                                             01900000
ATCTSCLS EQU   ISTATCVT+748                                             01901000
ATCTSCCF EQU   ISTATCVT+744                                             01902000
ATCTSCFV EQU   ISTATCVT+740                                             01903000
ATCTSCCE EQU   ISTATCVT+736                                             01904000
ATCTSCCB EQU   ISTATCVT+732                                             01905000
ATCTSCWS EQU   ISTATCVT+728                                             01906000
ATCTSCEM EQU   ISTATCVT+724                                             01907000
ATCTSCNS EQU   ISTATCVT+720                                             01908000
ATCTSCER EQU   ISTATCVT+716                                             01909000
ATCTSCPR EQU   ISTATCVT+712                                             01910000
ATCTSCGR EQU   ISTATCVT+708                                             01911000
ATCTSCCI EQU   ISTATCVT+704                                             01912000
ATCTSVT  EQU   ISTATCVT+700                                             01913000
ATCDVLOD EQU   ISTATCVT+696                                             01914000
ATCCDCNR EQU   ISTATCVT+692                                             01915000
ATCCDCNF EQU   ISTATCVT+688                                             01916000
ATCCDCND EQU   ISTATCVT+684                                             01917000
ATCCDCNA EQU   ISTATCVT+680                                             01918000
ATCCDCCP EQU   ISTATCVT+676                                             01919000
ATCCDFDN EQU   ISTATCVT+672                                             01920000
ATCCDFIN EQU   ISTATCVT+668                                             01921000
ATCCDFND EQU   ISTATCVT+664                                             01922000
ATCCDDEL EQU   ISTATCVT+660                                             01923000
ATCCDADD EQU   ISTATCVT+656                                             01924000
ATCTCLIM EQU   ISTATCVT+652                                             01925000
ATCRACTR EQU   ISTATCVT+648                                             01926000
ATCRACTI EQU   ISTATCVT+644                                             01927000
ATCREMOV EQU   ISTATCVT+640                                             01928000
ATCRACIO EQU   ISTATCVT+636                                             01929000
ATCADD   EQU   ISTATCVT+632                                             01930000
ATCPUCRT EQU   ISTATCVT+628                                             01931000
ATCSMRS  EQU   ISTATCVT+624                                             01932000
ATCSMRQ  EQU   ISTATCVT+620                                             01933000
ATCORCPX EQU   ISTATCVT+616                                             01934000
ATCORCAF EQU   ISTATCVT+612                                             01935000
ATCFRSTR EQU   ATCGTSTR                                                 01936000
ATCSTMA  EQU   ISTATCVT+604                                             01937000
ATCSRTAD EQU   ISTATCVT+600                                             01938000
ATCOCRT  EQU   ISTATCVT+596                                             01939000
ATCOCCFS EQU   ISTATCVT+592                                             01940000
ATCOCCFP EQU   ISTATCVT+588                                             01941000
ATCSRTDF EQU   ISTATCVT+584                                             01942000
ATCLUCRT EQU   ISTATCVT+580                                             01943000
ATCINCY5 EQU   ISTATCVT+576                                             01944000
ATCINCW3 EQU   ISTATCVT+572                                             01945000
ATCINCU6 EQU   ISTATCVT+568                                             01946000
ATCINCTQ EQU   ISTATCVT+564                                             01947000
ATCINCS1 EQU   ISTATCVT+560                                             01948000
ATCSRTAB EQU   ISTATCVT+556                                             01949000
ATCINCRD EQU   ISTATCVT+552                                             01950000
ATCINCPH EQU   ISTATCVT+548                                             01951000
ATCINCLQ EQU   ISTATCVT+544                                             01952000
ATCNOCRT EQU   ISTATCVT+540                                             01953000
ATCINCF1 EQU   ISTATCVT+536                                             01954000
ATCINCCI EQU   ISTATCVT+532                                             01955000
ATCINCCO EQU   ISTATCVT+528                                             01956000
ATCBLDLA EQU   ISTATCVT+524                                             01957000
ATCALOAD EQU   ISTATCVT+520                                             01958000
ATCADEL  EQU   ISTATCVT+516                                             01959000
ATCESC02 EQU   ISTATCVT+512                                             01960000
ATCESC01 EQU   ISTATCVT+508                                             01961000
ATCDEC01 EQU   ISTATCVT+504                                             01962000
ATCDEC00 EQU   ISTATCVT+500                                             01963000
ATCCPCRT EQU   ISTATCVT+496                                             01964000
ATCMSGM  EQU   ISTATCVT+492                                             01965000
ATCCPCFR EQU   ISTATCVT+488                                             01966000
ATCCPCGR EQU   ISTATCVT+484                                             01967000
ATCCPCPP EQU   ISTATCVT+480                                             01968000
ATCMSGP  EQU   ISTATCVT+476                                             01969000
ATCCPCNT EQU   ISTATCVT+472                                             01970000
ATCAUTHA EQU   ISTATCVT+468                                             01971000
ATCACCTA EQU   ISTATCVT+464                                             01972000
ATCAP39  EQU   ISTATCVT+460                                             01973000
ATCAP36  EQU   ISTATCVT+456                                             01974000
ATCAP35  EQU   ISTATCVT+452                                             01975000
ATCAP33  EQU   ISTATCVT+448                                             01976000
ATCAPCR5 EQU   ISTATCVT+444                                             01977000
ATCAICPT EQU   ISTATCVT+440                                             01978000
ATCAPI   EQU   ISTATCVT+436                                             01979000
ATCAICTN EQU   ISTATCVT+432                                             01980000
ATCACC01 EQU   ISTATCVT+428                                             01981000
ATCACC00 EQU   ISTATCVT+424                                             01982000
ATCLDECB EQU   ATCLDTIL+12                                              01983000
ATCLDLCK EQU   ATCLDTIL+8                                               01984000
ATCLDLST EQU   ATCLDTIL+4                                               01985000
ATCLDNCS EQU   ATCLDTIL                                                 01986000
ATCNOSPB EQU   ISTATCVT+376                                             01987000
ATCNSPAB EQU   ISTATCVT+344                                             01988000
ATCLUSRT EQU   ISTATCVT+312                                             01989000
ATCPUIOP EQU   ISTATCVT+280                                             01990000
ATCPUPAB EQU   ISTATCVT+248                                             01991000
ATCPXPAB EQU   ISTATCVT+216                                             01992000
ATCPOPAB EQU   ISTATCVT+184                                             01993000
@NM00013 EQU   ATCVDPAB+16                                              01994000
ATCFEPAB EQU   ATCVDPAB                                                 01995000
ATCTCIPB EQU   ISTATCVT+120                                             01996000
ATCCSPAB EQU   ATCSMPAB+16                                              01997000
@NM00012 EQU   ATCSMPAB                                                 01998000
ATCTMRPB EQU   ISTATCVT+56                                              01999000
ATCITPAB EQU   ISTATCVT+24                                              02000000
@NM00011 EQU   ATCITRA1                                                 02001000
ATCITSCP EQU   ATCITRA1                                                 02002000
ATCITMSG EQU   ATCITRA1                                                 02003000
ATCITPIU EQU   ATCITRA1                                                 02004000
ATCITSMS EQU   ATCITRA1                                                 02005000
ATCITPSS EQU   ATCITRA1                                                 02006000
ATCITLCK EQU   ATCITRA1                                                 02007000
ATCITAPI EQU   ATCITRA1                                                 02008000
ATCITCNT EQU   ATCITFLG                                                 02009000
ATCITRPH EQU   ATCITCDS                                                 02010000
ATCITTBL EQU   ATCITFLD+4                                               02011000
ATCITPRM EQU   ATCITFLD                                                 02012000
ATCPTCHA EQU   ATCRPTCH+4                                               02013000
ATCVTLVL EQU   ATCRPTCH                                                 02014000
DYPPAB   EQU   ISTDYPAB+16                                              02015000
DYPOCRPH EQU   DYPPACMD                                                 02016000
DYPTSKID EQU   ISTDYPAB+8                                               02017000
DYPPACTB EQU   DYPCHAIN                                                 02018000
DYPFLGS  EQU   ISTDYPAB+2                                               02019000
DYPLNGTH EQU   ISTDYPAB+1                                               02020000
DYPTYPE  EQU   ISTDYPAB                                                 02021000
PABRPHA  EQU   PABRPHFG+1                                               02022000
PABNODQ  EQU   PABFLAGS                                                 02023000
PABINHBT EQU   PABFLAGS                                                 02024000
PABERLOK EQU   PABERRLK                                                 02025000
PABSSN   EQU   PABFLAGS                                                 02026000
PABDYNAM EQU   PABFLAGS                                                 02027000
PABXTND  EQU   PABFLAGS                                                 02028000
PABPRIOR EQU   PABFLAGS                                                 02029000
PABAPYP  EQU   PABFLAGS                                                 02030000
PABDVTA  EQU   ISTPAB+9                                                 02031000
PABOFFST EQU   ISTPAB+8                                                 02032000
PABCHNGP EQU   PABCHAIN+1                                               02033000
PABRSV02 EQU   PABCHAIN                                                 02034000
PABDELAY EQU   PABCHAIN                                                 02035000
PABQUED  EQU   PABRUNNG                                                 02036000
PABRESET EQU   PABCHAIN                                                 02037000
PABUNCON EQU   PABCHAIN                                                 02038000
PABCDP   EQU   PABCHAIN                                                 02039000
PABRESCH EQU   PABCHAIN                                                 02040000
PABCHNG  EQU   PABCHAIN                                                 02041000
PABWEQP  EQU   PABWEQA+1                                                02042000
PABRSV01 EQU   PABWEQA                                                  02043000
PABWEQG  EQU   PABWEQA                                                  02044000
DVTPROCA EQU   DVTPROC+1                                                02045000
DVTRSV14 EQU   DVTFLAG1                                                 02046000
DVTRSV13 EQU   DVTFLAG1                                                 02047000
DVTRSV12 EQU   DVTFLAG1                                                 02048000
DVTRSV11 EQU   DVTFLAG1                                                 02049000
DVTRSV10 EQU   DVTFLAG1                                                 02050000
DVTRSV09 EQU   DVTFLAG1                                                 02051000
DVTRSV08 EQU   DVTFLAG1                                                 02052000
DVTENTRY EQU   ISTDVT+24                                                02053000
DVTRSV01 EQU   DVTHDR+20                                                02054000
DVTRSV15 EQU   DVTHDR+14                                                02055000
DVTHDCNT EQU   DVTHDR+12                                                02056000
DVTHLEN  EQU   DVTHDR+10                                                02057000
DVTHFGB  EQU   DVTHDR+9                                                 02058000
DVTRSV07 EQU   DVTHFGA                                                  02059000
DVTRSV06 EQU   DVTHFGA                                                  02060000
DVTRSV05 EQU   DVTHFGA                                                  02061000
DVTRSV04 EQU   DVTHFGA                                                  02062000
DVTRSV03 EQU   DVTHFGA                                                  02063000
DVTRSV02 EQU   DVTHFGA                                                  02064000
DVTHFGA1 EQU   DVTHFGA                                                  02065000
DVTHFGA0 EQU   DVTHFGA                                                  02066000
DVTHUCNT EQU   DVTHDR+6                                                 02067000
DVTHECNT EQU   DVTHDR+4                                                 02068000
DVTHFORW EQU   DVTHDR                                                   02069000
LOKXCL   EQU   @NM00008                                                 02070000
LOKPRY   EQU   @NM00008                                                 02071000
@NM00009 EQU   @NM00008                                                 02072000
@NM00007 EQU   LOKCHNG                                                  02073000
LOKCT    EQU   ISTLOK                                                   02074000
RPHUPSTA EQU   ISTRPH+104                                               02075000
RPHSAV16 EQU   RPHWORK+60                                               02076000
RPHSAV15 EQU   RPHWORK+56                                               02077000
RPHSAV14 EQU   RPHWORK+52                                               02078000
RPHSAV13 EQU   RPHWORK+48                                               02079000
RPHSAV12 EQU   RPHWORK+44                                               02080000
RPHSAV11 EQU   RPHWORK+40                                               02081000
RPHSAV10 EQU   RPHWORK+36                                               02082000
RPHSAVE9 EQU   RPHWORK+32                                               02083000
RPHSAVE8 EQU   RPHWORK+28                                               02084000
RPHSAVE7 EQU   RPHWORK+24                                               02085000
RPHSAVE6 EQU   RPHWORK+20                                               02086000
RPHSAVE5 EQU   RPHWORK+16                                               02087000
RPHSAVE4 EQU   RPHWORK+12                                               02088000
RPHSAVE3 EQU   RPHWORK+8                                                02089000
RPHSAVE2 EQU   RPHWORK+4                                                02090000
RPHSHALF EQU   RPHSAVE1+2                                               02091000
RPHSBIT8 EQU   RPHSBITS                                                 02092000
RPHSBIT7 EQU   RPHSBITS                                                 02093000
RPHSBIT6 EQU   RPHSBITS                                                 02094000
RPHSBIT5 EQU   RPHSBITS                                                 02095000
RPHSBIT4 EQU   RPHSBITS                                                 02096000
RPHSBIT3 EQU   RPHSBITS                                                 02097000
RPHSBIT2 EQU   RPHSBITS                                                 02098000
RPHSBIT1 EQU   RPHSBITS                                                 02099000
RPHSBYTE EQU   RPHSAVE1                                                 02100000
RPHPABQP EQU   RPHPABQA+1                                               02101000
RPHPABFG EQU   RPHPABQA                                                 02102000
RPHCRR   EQU   ISTRPH+32                                                02103000
RPHSRP34 EQU   RPHSRPRM+2                                               02104000
RPHSRP12 EQU   RPHSRPRM                                                 02105000
RPHWEGT  EQU   RPHCSPA                                                  02106000
RPHMAJCB EQU   ISTRPH+21                                                02107000
RPHPABOF EQU   ISTRPH+20                                                02108000
RPHRESUM EQU   RPHRESMA+1                                               02109000
@NM00006 EQU   RPHWPFLG                                                 02110000
RPHPURGE EQU   RPHWPFLG                                                 02111000
RPHPT    EQU   RPHWPFLG                                                 02112000
RPHWT    EQU   RPHWPFLG                                                 02113000
RPHRSKEY EQU   RPHWPFLG                                                 02114000
RPHTIK   EQU   RPHTSKID+3                                               02115000
@NM00005 EQU   RPHTSKID                                                 02116000
RPHRPHAP EQU   RPHRPHA+1                                                02117000
@NM00004 EQU   RPHRPHA                                                  02118000
RPHGATE  EQU   RPHRPHA                                                  02119000
RPHABEND EQU   RPHFLGB                                                  02120000
RPHUWAIT EQU   RPHFLGB                                                  02121000
RPHRLCRA EQU   RPHFLGB                                                  02122000
@NM00003 EQU   RPHFLGB                                                  02123000
RPHPGCMP EQU   RPHFLGB                                                  02124000
RPHFBAPS EQU   RPHFLGB                                                  02125000
RPHBSSP  EQU   RPHFLGB                                                  02126000
RPHLOCK  EQU   RPHFLGB                                                  02127000
RPHFNFLG EQU   RPHFSTLC                                                 02128000
RPHMLTCP EQU   RPHFLAGS                                                 02129000
RPHSMCLR EQU   RPHFLAGS                                                 02130000
RPHSMTYP EQU   RPHFLAGS                                                 02131000
RPHSMQ   EQU   RPHFLAGS                                                 02132000
RPHAPTYP EQU   RPHFLAGS                                                 02133000
RPHSPGIN EQU   RPHFLAGS                                                 02134000
RPHOGIND EQU   RPHFLAGS                                                 02135000
RPHLNGTH EQU   RPHCNTL+1                                                02136000
RPHTYPE  EQU   RPHCNTL                                                  02137000
CVTLEVL  EQU   CVTRELNO+2                                               02138000
CVTNUMB  EQU   CVTRELNO                                                 02139000
CVTMDL   EQU   CVTFIX+250                                               02140000
@NM00002 EQU   CVTFIX+248                                               02141000
@NM00001 EQU   CVTFIX                                                   02142000
CVTRV482 EQU   CVTXTNT2+128                                             02143000
CVTRV481 EQU   CVTXTNT2+124                                             02144000
CVTRV480 EQU   CVTXTNT2+120                                             02145000
CVTRV479 EQU   CVTXTNT2+118                                             02146000
CVTRV478 EQU   CVTXTNT2+117                                             02147000
CVTRV477 EQU   CVTXTNT2+116                                             02148000
CVTRV476 EQU   CVTXTNT2+115                                             02149000
CVTRV475 EQU   CVTXTNT2+114                                             02150000
CVTRV474 EQU   CVTRV466                                                 02151000
CVTRV473 EQU   CVTRV466                                                 02152000
CVTRV472 EQU   CVTRV466                                                 02153000
CVTRV471 EQU   CVTRV466                                                 02154000
CVTRV470 EQU   CVTRV466                                                 02155000
CVTRV469 EQU   CVTRV466                                                 02156000
CVTRV468 EQU   CVTRV466                                                 02157000
CVTRV467 EQU   CVTRV466                                                 02158000
CVTRV465 EQU   CVTRV457                                                 02159000
CVTRV464 EQU   CVTRV457                                                 02160000
CVTRV463 EQU   CVTRV457                                                 02161000
CVTRV462 EQU   CVTRV457                                                 02162000
CVTRV461 EQU   CVTRV457                                                 02163000
CVTRV460 EQU   CVTRV457                                                 02164000
CVTRV459 EQU   CVTRV457                                                 02165000
CVTRV458 EQU   CVTRV457                                                 02166000
CVTRV456 EQU   CVTXTNT2+108                                             02167000
CVTRV455 EQU   CVTXTNT2+104                                             02168000
CVTRV454 EQU   CVTXTNT2+100                                             02169000
CVTRV453 EQU   CVTXTNT2+96                                              02170000
CVTRV452 EQU   CVTXTNT2+94                                              02171000
CVTRV451 EQU   CVTXTNT2+92                                              02172000
CVTRV450 EQU   CVTXTNT2+90                                              02173000
CVTRV449 EQU   CVTXTNT2+88                                              02174000
CVTRV448 EQU   CVTXTNT2+87                                              02175000
CVTRV447 EQU   CVTXTNT2+86                                              02176000
CVTRV446 EQU   CVTRV438                                                 02177000
CVTRV445 EQU   CVTRV438                                                 02178000
CVTRV444 EQU   CVTRV438                                                 02179000
CVTRV443 EQU   CVTRV438                                                 02180000
CVTRV442 EQU   CVTRV438                                                 02181000
CVTRV441 EQU   CVTRV438                                                 02182000
CVTRV440 EQU   CVTRV438                                                 02183000
CVTRV439 EQU   CVTRV438                                                 02184000
CVTRV437 EQU   CVTRV429                                                 02185000
CVTRV436 EQU   CVTRV429                                                 02186000
CVTRV435 EQU   CVTRV429                                                 02187000
CVTRV434 EQU   CVTRV429                                                 02188000
CVTRV433 EQU   CVTRV429                                                 02189000
CVTRV432 EQU   CVTRV429                                                 02190000
CVTRV431 EQU   CVTRV429                                                 02191000
CVTRV430 EQU   CVTRV429                                                 02192000
CVTRV428 EQU   CVTXTNT2+80                                              02193000
CVTRV427 EQU   CVTXTNT2+76                                              02194000
CVTRV426 EQU   CVTXTNT2+72                                              02195000
CVTRV425 EQU   CVTXTNT2+68                                              02196000
CVTATACT EQU   CVTATCVT                                                 02197000
CVTRV423 EQU   CVTXTNT2+62                                              02198000
CVTRV422 EQU   CVTXTNT2+60                                              02199000
CVTRV421 EQU   CVTXTNT2+58                                              02200000
CVTRV420 EQU   CVTXTNT2+56                                              02201000
CVTRV419 EQU   CVTXTNT2+55                                              02202000
CVTRV418 EQU   CVTXTNT2+54                                              02203000
CVTRV417 EQU   CVTRV409                                                 02204000
CVTRV416 EQU   CVTRV409                                                 02205000
CVTRV415 EQU   CVTRV409                                                 02206000
CVTRV414 EQU   CVTRV409                                                 02207000
CVTRV413 EQU   CVTRV409                                                 02208000
CVTRV412 EQU   CVTRV409                                                 02209000
CVTRV411 EQU   CVTRV409                                                 02210000
CVTRV410 EQU   CVTRV409                                                 02211000
CVTRV408 EQU   CVTRV400                                                 02212000
CVTRV407 EQU   CVTRV400                                                 02213000
CVTRV406 EQU   CVTRV400                                                 02214000
CVTRV405 EQU   CVTRV400                                                 02215000
CVTRV404 EQU   CVTRV400                                                 02216000
CVTRV403 EQU   CVTRV400                                                 02217000
CVTRV402 EQU   CVTRV400                                                 02218000
CVTRV401 EQU   CVTRV400                                                 02219000
CVTICB   EQU   CVTXTNT2+48                                              02220000
CVTSKTA  EQU   CVTXTNT2+44                                              02221000
CVTCCVT  EQU   CVTXTNT2+40                                              02222000
CVTRSV98 EQU   CVTXTNT2+36                                              02223000
CVTRSV97 EQU   CVTXTNT2+34                                              02224000
CVTRSV96 EQU   CVTXTNT2+32                                              02225000
CVTOLTEP EQU   CVTXTNT2+28                                              02226000
CVTQIDA  EQU   CVTQID+1                                                 02227000
CVTRSV95 EQU   CVTQID                                                   02228000
CVTRSV94 EQU   CVTXTNT2+20                                              02229000
CVTRSV93 EQU   CVTXTNT2+16                                              02230000
CVTRSV92 EQU   CVTXTNT2+12                                              02231000
CVTDEBVR EQU   CVTXTNT2+8                                               02232000
CVTRSV91 EQU   CVTXTNT2+6                                               02233000
CVTRSV9H EQU   CVTFLGBT                                                 02234000
CVTRSV9G EQU   CVTFLGBT                                                 02235000
CVTRSV9F EQU   CVTFLGBT                                                 02236000
CVTRSV9E EQU   CVTFLGBT                                                 02237000
CVTRSV9D EQU   CVTFLGBT                                                 02238000
CVTBAH   EQU   CVTFLGBT                                                 02239000
CVTVME   EQU   CVTFLGBT                                                 02240000
CVTNPE   EQU   CVTFLGBT                                                 02241000
CVTNUCLS EQU   CVTXTNT2+4                                               02242000
CVTDSSVA EQU   CVTDSSV+1                                                02243000
CVTRSV89 EQU   CVTDSSV                                                  02244000
CVTRSV88 EQU   CVTXTNT1+8                                               02245000
CVTRSV87 EQU   CVTXTNT1+4                                               02246000
CVTFACHN EQU   CVTXTNT1                                                 02247000
CVTRV488 EQU   CVTMAP+412                                               02248000
CVTRV487 EQU   CVTMAP+408                                               02249000
CVTRV486 EQU   CVTMAP+404                                               02250000
CVTRV485 EQU   CVTMAP+400                                               02251000
CVTACTAP EQU   CVTMAP+396                                               02252000
CVTAUTH  EQU   CVTMAP+392                                               02253000
CVTRV490 EQU   CVTMAP+388                                               02254000
CVTSU    EQU   CVTMAP+384                                               02255000
CVTVOLT1 EQU   CVTVOLM1+1                                               02256000
CVTVOLI1 EQU   CVTVOLF1                                                 02257000
CVTSTOA  EQU   CVTMAP+376                                               02258000
CVTRSV58 EQU   CVTMAP+374                                               02259000
CVTRSV57 EQU   CVTMAP+372                                               02260000
CVTDDCE  EQU   CVTMAP+368                                               02261000
CVTPNWFR EQU   CVTMAP+364                                               02262000
CVTSMF   EQU   CVTMAP+360                                               02263000
CVTSULK  EQU   CVTMAP+358                                               02264000
CVTSLKO  EQU   CVTSYSK                                                  02265000
CVTSLKP  EQU   CVTSYSK                                                  02266000
CVTSLKQ  EQU   CVTSYSK                                                  02267000
CVTSLKR  EQU   CVTSYSK                                                  02268000
CVTRSV56 EQU   CVTSYSK                                                  02269000
CVTRSV55 EQU   CVTSYSK                                                  02270000
CVTRSV54 EQU   CVTSYSK                                                  02271000
CVTRSV53 EQU   CVTSYSK                                                  02272000
CVTRSV52 EQU   CVTA1F1                                                  02273000
CVTRSV51 EQU   CVTA1F1                                                  02274000
CVTRSV50 EQU   CVTA1F1                                                  02275000
CVTRSV49 EQU   CVTA1F1                                                  02276000
CVTRSV48 EQU   CVTA1F1                                                  02277000
CVTRSV47 EQU   CVTA1F1                                                  02278000
CVTSRSW  EQU   CVTA1F1                                                  02279000
CVTPFSW  EQU   CVTA1F1                                                  02280000
CVTPCVT  EQU   CVTMAP+352                                               02281000
CVTRSV46 EQU   CVTMAP+344                                               02282000
CVTRSV45 EQU   CVTMAP+340                                               02283000
CVTRSV44 EQU   CVTMAP+338                                               02284000
CVTRSV43 EQU   CVTMAP+336                                               02285000
CVTHJESA EQU   CVTHJES+1                                                02286000
CVTRSV42 EQU   CVTHJES                                                  02287000
CVTEXT2A EQU   CVTEXT2+1                                                02288000
CVTRSV41 EQU   CVTEXT2                                                  02289000
CVTAPFA  EQU   CVTAPF+1                                                 02290000
CVTRSV40 EQU   CVTAPF                                                   02291000
CVTRV518 EQU   CVTINTLA                                                 02292000
CVTRV517 EQU   CVTERPV                                                  02293000
CVTEORM  EQU   CVTMAP+312                                               02294000
CVTMCHPR EQU   CVTMAP+308                                               02295000
CVTTZ    EQU   CVTMAP+304                                               02296000
CVTJEPS  EQU   CVTMAP+300                                               02297000
CVTJESCT EQU   CVTMAP+296                                               02298000
CVTMODE  EQU   CVTMAP+292                                               02299000
CVTPTRV  EQU   CVTMAP+288                                               02300000
CVTREAL  EQU   CVTMAP+284                                               02301000
CVTRSV39 EQU   CVTMAP+280                                               02302000
CVTRSV38 EQU   CVTMAP+276                                               02303000
CVTDMSRA EQU   CVTDMSR+1                                                02304000
CVTRV634 EQU   CVTDMSRF                                                 02305000
CVTRV633 EQU   CVTDMSRF                                                 02306000
CVTRV632 EQU   CVTDMSRF                                                 02307000
CVTRV631 EQU   CVTDMSRF                                                 02308000
CVTRV630 EQU   CVTDMSRF                                                 02309000
CVTRV629 EQU   CVTDMSRF                                                 02310000
CVTUDUMP EQU   CVTDMSRF                                                 02311000
CVTSDUMP EQU   CVTDMSRF                                                 02312000
CVTQMSGA EQU   CVTQMSG+1                                                02313000
CVTRSV36 EQU   CVTQMSG                                                  02314000
CVTAMFF  EQU   CVTMAP+264                                               02315000
CVTPURGA EQU   CVTPURG+1                                                02316000
CVTRSV35 EQU   CVTPURG                                                  02317000
CVTCBSP  EQU   CVTMAP+256                                               02318000
CVTATERA EQU   CVTATER+1                                                02319000
CVTSYST  EQU   CVTATER                                                  02320000
CVTVOLT2 EQU   CVTTAT                                                   02321000
CVTVOLI2 EQU   CVTVOLF2                                                 02322000
CVTAQAVB EQU   CVTAQAVT+1                                               02323000
CVTRSV34 EQU   CVTTCMFG                                                 02324000
CVTRSV33 EQU   CVTTCMFG                                                 02325000
CVTRSV32 EQU   CVTTCMFG                                                 02326000
CVTRSV31 EQU   CVTTCMFG                                                 02327000
CVTRSV30 EQU   CVTTCMFG                                                 02328000
CVTRSV29 EQU   CVTTCMFG                                                 02329000
CVTLDEV  EQU   CVTTCMFG                                                 02330000
CVTTCRDY EQU   CVTTCMFG                                                 02331000
CVTGTFA  EQU   CVTGTF+1                                                 02332000
CVTRSV27 EQU   CVTGTFST                                                 02333000
CVTRNIO  EQU   CVTGTFST                                                 02334000
CVTUSR   EQU   CVTGTFST                                                 02335000
CVTRV318 EQU   CVTFORM                                                  02336000
CVTRV317 EQU   CVTTMODE                                                 02337000
CVTRV316 EQU   CVTSTATE                                                 02338000
CVTRV315 EQU   CVTGTFS                                                  02339000
CVTGTFAV EQU   CVTGTFS                                                  02340000
CVT0SCR1 EQU   CVTMAP+232                                               02341000
CVTRV515 EQU   CVTMAP+228                                               02342000
CVTRMS   EQU   CVTMAP+224                                               02343000
CVTPATCH EQU   CVTMAP+220                                               02344000
CVTTSCE  EQU   CVTMAP+216                                               02345000
CVTLNKSC EQU   CVTMAP+214                                               02346000
CVTQABST EQU   CVTMAP+212                                               02347000
CVTMDLDS EQU   CVTMAP+208                                               02348000
CVTUSER  EQU   CVTMAP+204                                               02349000
CVTABEND EQU   CVTMAP+200                                               02350000
CVTSMCA  EQU   CVTMAP+196                                               02351000
CVTRSV18 EQU   CVTMAP+192                                               02352000
CVTQLPAQ EQU   CVTMAP+188                                               02353000
CVTQCDSR EQU   CVTMAP+184                                               02354000
CVTVS1B  EQU   CVTOPTB                                                  02355000
CVTVS1A  EQU   CVTOPTB                                                  02356000
CVTFP    EQU   CVTOPTB                                                  02357000
CVTAPTHR EQU   CVTOPTB                                                  02358000
CVTNLOG  EQU   CVTOPTB                                                  02359000
CVTTOD   EQU   CVTOPTB                                                  02360000
CVTCTIMS EQU   CVTOPTB                                                  02361000
CVTPROT  EQU   CVTOPTB                                                  02362000
CVTXPFP  EQU   CVTOPTA                                                  02363000
CVTASCII EQU   CVTOPTA                                                  02364000
CVTRSV13 EQU   CVTOPTA                                                  02365000
CVTRSV12 EQU   CVTOPTA                                                  02366000
CVTNIP   EQU   CVTOPTA                                                  02367000
CVTDDR   EQU   CVTOPTA                                                  02368000
CVTAPR   EQU   CVTOPTA                                                  02369000
CVTCCH   EQU   CVTOPTA                                                  02370000
CVTSNCTR EQU   CVTMAP+180                                               02371000
CVTQMWR  EQU   CVTMAP+176                                               02372000
CVTQOCR  EQU   CVTMAP+172                                               02373000
CVT1EF00 EQU   CVTMAP+168                                               02374000
CVTMZ00  EQU   CVTMAP+164                                               02375000
CVTHEAD  EQU   CVTMAP+160                                               02376000
CVTRSV11 EQU   CVTMAP+156                                               02377000
CVT0PT01 EQU   CVTMAP+152                                               02378000
CVTMSER  EQU   CVTMAP+148                                               02379000
CVTRV516 EQU   CVTIERLC                                                 02380000
CVTILCH  EQU   CVTMAP+140                                               02381000
CVT0DS   EQU   CVTMAP+136                                               02382000
CVTFBOSV EQU   CVTMAP+132                                               02383000
CVTNUCB  EQU   CVTMAP+128                                               02384000
CVTIXAVL EQU   CVTMAP+124                                               02385000
CVTIOQET EQU   CVTMAP+120                                               02386000
CVTDCBA  EQU   CVTMAP+117                                               02387000
CVTMVS2  EQU   CVTDCB                                                   02388000
CVT6DAT  EQU   CVTDCB                                                   02389000
CVT4MPS  EQU   CVTDCB                                                   02390000
CVTRSV09 EQU   CVTDCB                                                   02391000
CVT4MS1  EQU   CVTDCB                                                   02392000
CVT2SPS  EQU   CVTDCB                                                   02393000
CVT1SSS  EQU   CVTDCB                                                   02394000
CVTRSV08 EQU   CVTDCB                                                   02395000
CVTSTB   EQU   CVTMAP+112                                               02396000
CVTQTD00 EQU   CVTMAP+108                                               02397000
CVTQTE00 EQU   CVTMAP+104                                               02398000
CVTCUCB  EQU   CVTMAP+100                                               02399000
CVTSJQ   EQU   CVTMAP+96                                                02400000
CVTPBLDL EQU   CVTMAP+92                                                02401000
CVTTPC   EQU   CVTMAP+88                                                02402000
CVTSVDCB EQU   CVTMAP+84                                                02403000
CVTBRET  EQU   CVTMAP+82                                                02404000
CVTEXIT  EQU   CVTMAP+80                                                02405000
CVT0FN00 EQU   CVTMAP+76                                                02406000
CVTDARA  EQU   CVTDAR+1                                                 02407000
CVTRSV07 EQU   CVTFLGS1                                                 02408000
CVTRSV06 EQU   CVTFLGS1                                                 02409000
CVTRSV05 EQU   CVTFLGS1                                                 02410000
CVTRSV04 EQU   CVTFLGS1                                                 02411000
CVTRSV03 EQU   CVTFLGS1                                                 02412000
CVTRSV02 EQU   CVTFLGS1                                                 02413000
CVTRSV01 EQU   CVTFLGS1                                                 02414000
CVTDMPLK EQU   CVTFLGS1                                                 02415000
CVTXITP  EQU   CVTMAP+68                                                02416000
CVTZDTAB EQU   CVTMAP+64                                                02417000
CVTMSLT  EQU   CVTMAP+60                                                02418000
CVTDATE  EQU   CVTMAP+56                                                02419000
CVTBTERM EQU   CVTMAP+52                                                02420000
CVTSYSAD EQU   CVTMAP+48                                                02421000
CVTXTLER EQU   CVTMAP+44                                                02422000
CVTILK2  EQU   CVTMAP+40                                                02423000
CVTILK1  EQU   CVTMAP+36                                                02424000
CVTPRLTV EQU   CVTMAP+32                                                02425000
CVTPCNVT EQU   CVTMAP+28                                                02426000
CVT0VL00 EQU   CVTMAP+24                                                02427000
CVTXAPG  EQU   CVTMAP+20                                                02428000
CVTBUF   EQU   CVTMAP+16                                                02429000
CVTJOB   EQU   CVTMAP+12                                                02430000
CVTLINK  EQU   CVTMAP+8                                                 02431000
CVT0EF00 EQU   CVTMAP+4                                                 02432000
CVTTCBP  EQU   CVTMAP                                                   02433000
CVT      EQU   CVTMAP                                                   02434000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02435000
@ENDDATA EQU   *                                                        02436000
         END   ISTESC01,(C'PLS1232',0702,78336)                         02437000
