         TITLE 'ISTINCPH - PARAMETER HANDLER ROUTINE'                   00001000
*REGS(0,1,2,3,4,15)LINKREGS(5,6,7,12)INCLUDES(ISTPHROA)*/          0001 00002000
ISTINCPH CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINCPH  79.061'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @11,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@11                                         0001 00013000
*    DO;                                                           0002 00014000
*/* ATBUILD (ISTPHROA)  */                                         0003 00015000
*GEN (PRINT OFF);                                                  0003 00016000
         PRINT OFF                                                      00017000
*/*       VTAM  PARAMETER HANDLER (ISTINCPH) OUTPUT AREA              * 00018000
*/*  INITIAL LEVEL                                     001 08/02/74  */ 00019000
*DECLARE 1 ISTPHROA BASED BDY(WORD),                               0004 00020000
*         2 PHROALEN FIXED(31),        /* TOTAL LENGTH OF PHR OUTPUT    00021000
*                                         AREA                        * 00022000
*         2 PHROADTA CHAR(*) BDY(WORD); /* PHR OUTPUT AREA DATA       * 00023000
*                                                                  0004 00024000
*DECLARE 1 PHRFN1OA DEFINED(PHROADTA),   /* FUNCTION 1 OUTPUT      0005 00025000
*                                          AREA                       * 00026000
*         2 PHRF1SAD PTR(31),            /* POINTER TO SUB-PARAMETER  * 00027000
*         2 PHRF1SLN FIXED(31);          /* LENGTH OF SUB-PARAMETER   * 00028000
*                                                                  0005 00029000
*DECLARE 1 PHRFN2OA DEFINED(PHROADTA),   /* FUNCTION 2 OUTPUT AREA    * 00030000
*         2 PHRF2NVL FIXED(31),          /* NUMBER OF OUTPUT VALUES   * 00031000
*         2 PHRF2VAL(*) FIXED(31),       /* ARRAY OF OUTPUT VALUES    * 00032000
*          3 PHRF2OFS FIXED(15),         /* OFFSET INTO SIFT AREA     * 00033000
*          3 PHRF2FLG BIT(8),            /* FLAG BYTE                 * 00034000
*           4 PHRF2GP BIT(1),            /* USE MLCPTR0 AS BASE       * 00035000
*           4 PHRF2LN BIT(1),            /* USE MLCPTR1 AS BASE       * 00036000
*           4 PHRF2CL BIT(1),            /* USE MLCPTR2 AS BASE       * 00037000
*           4 PHRF2TR BIT(1),            /* USE MLCPTR3 AS BASE       * 00038000
*           4 *       BIT(1),            /* RESERVED                  * 00039000
*           4 PHRF2ON BIT(1),            /* SET ON UNDER PHRF2MSK     * 00040000
*           4 PHRF2OFF BIT(1),           /* SET OFF UNDER PHRF2MSK    * 00041000
*           4 PHRF2MV BIT(1),            /* MOVE PHRF2MSK TO AREA     * 00042000
*          3 PHRF2MSK BIT(8);            /* BIT PATTERN TO PROCESS    * 00043000
*                                                                  0006 00044000
*DECLARE 1 PHRF34OA DEFINED(PHROADTA),   /* FUNCTIONS 3+4 OUTPUT AREA * 00045000
*         2 PHRF34NS FIXED(31),          /* NUMBER OF SUB-PARAMETERS  * 00046000
*         2 PHRF34EN(*),                 /* OUTPUT AREA ARRAY ENTRY   * 00047000
*          3 PHRF34VF BIT(8),            /* VALIDITY FLAGS            * 00048000
*          3 * BIT(8),                   /* RESERVED                  * 00049000
*          3 PHRF34SL FIXED(15),         /* LENGTH OF SUBPARAMETER    * 00050000
*          3 PHRF34SP CHAR(8);           /* SUBPARAMETER STRING       * 00051000
*                                                                  0007 00052000
*DECLARE 1 PHRFN5OA DEFINED(PHROADTA),   /* FUNCTION 5 OUTPUT AREA    * 00053000
*         2 PHRF5NSP FIXED(31),          /* NUMBER OF SUB-PARAMETERS  * 00054000
*         2 PHRF5ENT(*),                 /* OUTPUT AREA ARRAY ENTRY   * 00055000
*          3 PHRF5VF BIT(8),             /* VALIDITY FLAGS            * 00056000
*          3 * BIT(8),                   /* RESERVED                  * 00057000
*          3 PHRF5SL FIXED(15),          /* LENGTH OF SUB-PARAMETER   * 00058000
*          3 PHRF5SPT PTR(31);           /* POINTER TO SUB-PARAMETER  * 00059000
*                                                                  0008 00060000
*DECLARE 1 PHRFN7OA DEFINED(PHROADTA),   /* FUNCTION 7 OUTPUT AREA    * 00061000
*         2 PHRF7NSP FIXED(31),          /* NUMBER OF SUB-PARAMETERS  * 00062000
*         2 PHRF7NUM(*) BIN(8);         /* ARRAY OF ONE-BYTE VALUES  */ 00063000
*                                                                  0009 00064000
*DECLARE 1 PHRFN8OA DEFINED(PHROADTA),   /* FUNCTION 8 OUTPUT AREA    * 00065000
*          2 PHRF8NSP FIXED(31),         /* NUMBER OF SUB PARAMETERS  * 00066000
*          2 PHRF8ENT(*),                /* OUTPUT AREA ARRAY ENTRY   * 00067000
*            3 PHRF8FLG BIT(8),          /* FLAG BYTE                 * 00068000
*              4 PHRF8DFT BIT(1),        /* SUB-PARM DEFAULTED        * 00069000
*              4 *        BIT(7),        /* RESERVED                  * 00070000
*            3 PHRF8NUM BIN(8);          /* ONE-BYTE VALUE            * 00071000
*                                                                  0010 00072000
*/*       VALIDITY ERROR FLAGS SET BY FUNCTIONS IN OUTPUT AREA        * 00073000
*DECLARE PHRVFAOK BIT(8) CONSTANT('00'X);/* NO ERRORS IN SUB-PARAMETER* 00074000
*DECLARE PHRVFNA1 BIT(8) CONSTANT('10'X);/* FIRST CHAR. NOT ALPHABETIC* 00075000
*DECLARE PHRVFNAN BIT(8) CONSTANT('20'X);/* ALL CHARS. NOT ALPHANUM   * 00076000
*DECLARE PHRVFNNN BIT(8) CONSTANT('40'X);/* ALL CHARS. NOT NUMERIC    * 00077000
*GEN (PRINT ON);                                                   0015 00078000
         PRINT ON                                                       00079000
*                                                                  0016 00080000
*/* END OF ATBUILD */                                              0016 00081000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0016 00082000
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR12P 00083000
*GPR14P,GPR15P) RSTD;                                              0017 00084000
*                                                                  0017 00085000
*   END;/* CMZMREG */                                              0018 00086000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0019 00087000
*                                                                  0020 00088000
*   END;/* CMZMREG */                                              0020 00089000
*   END ;                                                          0021 00090000
*/*A-000000-999999                                           @DL29HBN*/ 00091000
*   RFY                                                            0022 00092000
*     ISTPHROA BASED(GPR02P);                                      0022 00093000
*                                                                  0023 00094000
*/*      KEYWORD TABLE INPUT FORMAT                                  */ 00095000
*                                                                  0023 00096000
*                                                                  0023 00097000
*   DCL                                                            0023 00098000
*     1 CPHKWDTB BDY(BYTE)BASED(CPHTABAD),                         0023 00099000
*     (2 CPHENTNO,                  /* NUMBER OF ENTRIES             */ 00100000
*      2 CPHENTLN)                  /* LENGTH OF 1 ENTRY             */ 00101000
*            FIXED(15)BDY(BYTE),                                   0023 00102000
*      2 CPHTABEN(*),               /* TABLE ENTRY FORMAT            */ 00103000
*       3 CPHKEYWD CHAR(8),         /* KEYWORD NAME                  */ 00104000
*       3 CPHFUNBT CHAR(5);         /* FUNCTION BYTE/VALUE           */ 00105000
*   DCL                                                            0024 00106000
*     1 CPHSUBVL CHAR(5)BDY(BYTE),  /* SUB-TABLE VALUE               */ 00107000
*      2 CPHVALBT BIT(8),           /* VALIDITY FLAGS & FUNCT. NO    */ 00108000
*       3 * BIT(1),                 /* RESERVED                      */ 00109000
*       3 CPHFUNNU BIT(1),          /* CHECK NUMERIC CHAR            */ 00110000
*       3 CPHFUNAN BIT(1),          /* CHECK ALPHANUM CHS            */ 00111000
*       3 CPHFUNFC BIT(1),          /* CHECK ALPHA 1ST CH            */ 00112000
*       3 CPHFUNNO BIT(4),          /* FUNCTION NUMBER               */ 00113000
*      2 CPHVALUE PTR(31)BDY(BYTE); /* VALUE                         */ 00114000
*                                                                  0024 00115000
*   DCL CPHF2VAL (*) BIT(32) DEFINED(PHRF2VAL);  /*TO ALLOW MVC  */     00116000
*   DCL CPHSBVL1 BIT(32) DEFINED(CPHSUBVL);  /*ALSO TO ALLOW MVC*/ 0026 00117000
*                                                                  0026 00118000
*/*      FUNCTION NUMBER VALUES                                      */ 00119000
*                                                                  0027 00120000
*   DCL                                                            0027 00121000
*    (CPHFUN01 CONSTANT('0001'B),   /* FUNCTION NO. 1                */ 00122000
*     CPHFUN02 CONSTANT('0010'B),   /* FUNCTION NO. 2                */ 00123000
*     CPHFUN03 CONSTANT('0011'B),   /* FUNCTION NO. 3                */ 00124000
*     CPHFUN04 CONSTANT('0100'B),   /* FUNCTION NO. 4                */ 00125000
*     CPHFUN05 CONSTANT('0101'B),   /* FUNCTION NO. 5                */ 00126000
*     CPHFUN06 CONSTANT('0110'B),   /* FUNCTION NO. 6                */ 00127000
*     CPHFUN07 CONSTANT('0111'B),   /* FUNCTION NO. 7                */ 00128000
*     CPHFUN08 CONSTANT('1000'B))  /*FUNCTION 8              @D32CKKA*/ 00129000
*         BIT(4);                                                  0027 00130000
*                                                                  0027 00131000
*/*         TRANSLATE-AND-TEST TABLE USED TO SCAN FOR DELIMITERS     */ 00132000
*                                                                  0028 00133000
*   DCL                                                            0028 00134000
*     CPHTRTB STATIC LOCAL CHAR(256)GENERATED;             /*@DM39361*/ 00135000
*   GEN DATA DEFS(CPHTRTB);                                        0029 00136000
*                                                                  0029 00137000
*/*         TRT TABLE FOR VALIDITY CHECK SUBROUTINE                  */ 00138000
*                                                                  0030 00139000
*   DCL                                                            0030 00140000
*     CPHVTRTB STATIC LOCAL CHAR(256)GENERATED;            /*@DM39361*/ 00141000
*   GEN DATA DEFS(CPHVTRTB);                                       0031 00142000
*                                                                  0031 00143000
*/*      TRANSITION MATRIX FOR CONTEXT SUB-PROCESSORS                */ 00144000
*                                                                  0032 00145000
*   DCL                                                            0032 00146000
*     CPHSCNTB(7,7)PTR(31) STATIC LOCAL /*TABLE STORAGE      @DM39361*/ 00147000
*         INIT                      /* SEE DESCRIPTION OF TABLE IN 0032 00148000
*                                      CHARTS                        */ 00149000
*         (ADDR(CPHCSP13),ADDR(CPHCSP01),ADDR(CPHCSP01),ADDR(CPHCSP01), 00150000
*         ADDR(CPHCSP12),ADDR(CPHCSP12),ADDR(CPHCSP01),ADDR(CPHCSP02),  00151000
*         ADDR(CPHCSP12),ADDR(CPHCSP12),ADDR(CPHCSP12),ADDR(CPHCSP12),  00152000
*         ADDR(CPHCSP12),ADDR(CPHCSP12),ADDR(CPHCSP10),ADDR(CPHCSP10),  00153000
*         ADDR(CPHCSP04),ADDR(CPHCSP04),ADDR(CPHCSP05),ADDR(CPHCSP13),  00154000
*         ADDR(CPHCSP12),ADDR(CPHCSP12),ADDR(CPHCSP06),ADDR(CPHCSP06),  00155000
*         ADDR(CPHCSP06),ADDR(CPHCSP12),ADDR(CPHCSP12),ADDR(CPHCSP12),  00156000
*         ADDR(CPHCSP07),ADDR(CPHCSP12),ADDR(CPHCSP07),ADDR(CPHCSP12),  00157000
*         ADDR(CPHCSP08),ADDR(CPHCSP08),ADDR(CPHCSP12),ADDR(CPHCSP12),  00158000
*         ADDR(CPHCSP09),ADDR(CPHCSP09),ADDR(CPHCSP09),ADDR(CPHCSP12),  00159000
*         ADDR(CPHCSP12),ADDR(CPHCSP12),ADDR(CPHCSP10),ADDR(CPHCSP10),  00160000
*         ADDR(CPHCSP10),ADDR(CPHCSP12),ADDR(CPHCSP14),ADDR(CPHCSP10),  00161000
*         ADDR(CPHCSP13));                                         0032 00162000
*                                                                  0032 00163000
*/*   SUB-PARAMTER POINTER BLOCK FOR FUNCTION 2                      */ 00164000
*                                                                  0033 00165000
*   DCL                                                            0033 00166000
*     1 CPHPNTBK BASED(CPHVALUE)BDY(BYTE),                         0033 00167000
*      2 CPHSBVAL FIXED(31)BDY(BYTE),/* KWD RTN. ADDRESS             */ 00168000
*      2 CPHSBTAB PTR(31)BDY(BYTE); /* SUBPARM TBL                   */ 00169000
*                                                                  0033 00170000
*/*      INLINE DATA AREA AND LOCK                           @DM39361*/ 00171000
*   DCL                                                            0034 00172000
*     CPHLOCK BIT(8) INIT(0) STATIC LOCAL;                 /*@DM39361*/ 00173000
*   DCL                                                            0035 00174000
*     STATICFD BDY(WORD) CHAR(116) STATIC LOCAL;           /*@DM30483*/ 00175000
*                                                                  0035 00176000
*                                                                  0035 00177000
*/*      SUB-PROCESSOR ENTRY POINT LOCATOR                           */ 00178000
*                                                                  0036 00179000
*   DCL                                                            0036 00180000
*     CPHSCNPT PTR(31);                                            0036 00181000
*                                                                  0036 00182000
*/*     LOCAL POINTERS USED FOR WORKING STORAGE                      */ 00183000
*                                                                  0037 00184000
*                                                                  0037 00185000
*   DCL                                                            0037 00186000
*    (CPHOANDX,                     /* OUTPUT AREA ENTRY INDEX       */ 00187000
*     CPHOALIM)FIXED(31);           /* MAX NO. OF OUTPUT AREA ENT    */ 00188000
*   DCL CPHINSVA PTR(31);           /* SVA FOR INPUT SVADDR  @DM39361*/ 00189000
*   DCL CPHSCN00 PTR(31);           /* CPHSUBSC R00 SVA      @DM30483*/ 00190000
*   DCL CPHSCN02 PTR(31);           /* CPHSUBSC R02 SVA      @DM30483*/ 00191000
*   DCL CPHVCK01 PTR(31);           /* CPHVALCK R01 SVA      @DM30483*/ 00192000
*   DCL CPHVCK02 PTR(31);           /* CPHVALCK R02 SVA      @DM30483*/ 00193000
*   DCL                                                            0043 00194000
*    (CPHTCHAR,                     /* TRT CODE FOR LAST CHAR.       */ 00195000
*     CPHLCHAR)FIXED(8);            /* TRT CODE FOR PREVIOUS CHAR    */ 00196000
*   DCL                                                            0044 00197000
*    (CPHSPLEN,                     /* SUB-PARAMETER LENGTH          */ 00198000
*     CPHKWLEN,                     /* KEYWORD LENGTH                */ 00199000
*     CPHPARCT,                     /* PARENTHESES COUNT             */ 00200000
*     CPHSBPAR,                     /* SUBPARM START PARENS. COUNT   */ 00201000
*     CPHENCTR)FIXED(15);           /* TABLE SEARCH ENTRY COUNT      */ 00202000
*   DCL                                                            0045 00203000
*     CPHSBYTE CHAR(*)BASED;        /* (A) BYTE(S) IN SCANNED STR    */ 00204000
*   DCL                                                            0046 00205000
*     CPHARGUM CHAR(8);             /* SEARCH ARGUMENT (CPHTBLSC)    */ 00206000
*   DCL                                                            0047 00207000
*     CPHDECHX CHAR(3);             /*HOLD AREA FOR CPHSUB07 @DM39361*/ 00208000
*   DCL                                                            0048 00209000
*     1 CPHVALFG BIT(8),            /* VALIDITY ERROR FLAGS          */ 00210000
*      2 * BIT(1),                  /* RESERVED                      */ 00211000
*      2 CPHVALNU BIT(1),           /* CHARACTERS NOT NUMERIC        */ 00212000
*      2 CPHVALAN BIT(1),           /* CHARS. NOT ALPHANUMERIC       */ 00213000
*      2 CPHVALFC BIT(1),           /* 1ST CHAR. NOT ALPHANUMERIC    */ 00214000
*      2 * BIT(4);                  /* RESERVED                      */ 00215000
*   DCL                                                            0049 00216000
*    (CPHTABAD,                     /* POINTER TO KWD TABLE ENTRY    */ 00217000
*     CPHTABSV)PTR(31);             /* POINTER TO KWD TABLE START    */ 00218000
*   DCL                                                            0050 00219000
*    (CPHKWPTR,                     /* POINTER TO START OF KEYWD     */ 00220000
*     CPHTRTSV,                     /* POINTER TO START OF    SUBPARM*/ 00221000
*     CPHVALPS,                     /* VALCHK SAVE AREA FOR PTR      */ 00222000
*     CPHSPPTR)PTR(31);             /* SUB-PARAMETER POINTER         */ 00223000
*   DCL                                                            0051 00224000
*     1 CPHFLAGS BIT(8),            /* ** PHR LOGIC CONTROL FLAGS*   */ 00225000
*      2 * BIT(1),                  /* RESERVED                      */ 00226000
*      2 CPHCONT BIT(1),            /* TRT CONTINUE FLAG             */ 00227000
*      2 CPHKWSCN BIT(1),           /* SCANNING STRING FOR KWD       */ 00228000
*      2 CPHENDST BIT(1),           /* END OF STRING WAS HIT         */ 00229000
*      2 CPHENDSP BIT(1),           /* END OF SUB-PARM WAS HIT       */ 00230000
*      2 CPHLSTSP BIT(1),           /* LAST SUB-PARAMETER WAS HIT    */ 00231000
*      2 CPHSLIST BIT(1),           /* SUB PARM LIST ENCOUNTERED     */ 00232000
*      2 CPHSYNER BIT(1);           /* SYNTAX ERROR HAS OCCURRED     */ 00233000
*   DCL                                                            0052 00234000
*     1 CPHFLAG2 BIT(8),            /* ADDITIONAL CONTROL FLAGS      */ 00235000
*      2 CPHOFLOW BIT(1),           /* OUTPUT AREA OVERFLOW          */ 00236000
*      2 CPHFUNER BIT(1),           /* FUNCTION ERROR                */ 00237000
*      2 CPHARGNF BIT(1),           /* ARGUMENT NOT FOUND-TBL SCH    */ 00238000
*      2 * BIT(5);                  /* RESERVED                      */ 00239000
*   DCL R4 PTR(24)   REG(04);          /* DECLARE REGS       @DA20388*/ 00240000
*   DCL R5 FIXED(31) REG(05);          /*                    @DA20388*/ 00241000
*   DCL R6 PTR(24)   REG(06);          /*                    @DA20388*/ 00242000
*   DCL R7 FIXED(31) REG(07);          /*                    @DA20388*/ 00243000
*                                                                  0057 00244000
*/*         EXECUTABLE CODE SECTION                                  */ 00245000
*         GPR03P=GPR13P;                 /*SAVE CALLER'S SVA @DM30219*/ 00246000
         LR    GPR03P,GPR13P                                       0057 00247000
*         GPR13P=ADDR(STATICFD);         /*USE INLINE SVA    @DM39361*/ 00248000
         LA    GPR13P,STATICFD                                     0058 00249000
*         GEN REFS(CPHLOCK)(TS CPHLOCK); /*INLINE DATA AREA IN     0059 00250000
*                                          USE ?             @DM39361*/ 00251000
         TS CPHLOCK                                                     00252000
*         BC(8,USEINLIN);                /* NO-USE INLINE AREA     0060 00253000
*                                                            @DM39361*/ 00254000
         BC    8,USEINLIN                                          0060 00255000
*GEN SETS(GPR00P,GPR01P,GPR04P,GPR15F,GPR05P,GPR06P,GPR07P)        0061 00256000
*    REFS(GPR03P);                                         /*@VS45824*/ 00257000
          LM   4,7,36(3)                                                00258000
          L    0,@SIZDATD                                               00259000
          LA   1,48(3)                                                  00260000
          ST   1,40(3)                                                  00261000
          LA   1,36(3)                                                  00262000
          GETMAIN EC,LV=(0),SP=0,MF=(E,(1))                             00263000
*        IF GPR15F=0                                               0062 00264000
*              THEN DO;                                    /*@DM39361*/ 00265000
         LTR   GPR15F,GPR15F                                       0062 00266000
         BNZ   @RF00062                                            0062 00267000
*        GEN SETS(GPR13P,GPR00P,GPR01P)                            0064 00268000
*            REFS(GPR04P,GPR05P,GPR06P,GPR07P,GPR03P);     /*@VS45113*/ 00269000
          LM   0,1,20(3)                                                00270000
          L   13,48(3)                                                  00271000
          STM 4,7,36(3)                                                 00272000
          USING @DATD,13                                                00273000
*USEINLIN:                                                         0065 00274000
*CPHINSVA=GPR03P;                   /* SAVE INPUT SAVE AREA  @DM39361*/ 00275000
USEINLIN ST    GPR03P,CPHINSVA                                     0065 00276000
*RFY (R4,R5,R6,R7) RSTD;            /* RESTRICT MVCL REGS    @DA20388*/ 00277000
*R4=ADDR(PHROADTA);                 /* 'TO' FIELD            @DA20388*/ 00278000
         LA    R4,PHROADTA(,GPR02P)                                0067 00279000
*R5=PHROALEN-LENGTH(PHROALEN);      /* SIZE OF 'TO' FIELD    @DA20388*/ 00280000
         L     R5,PHROALEN(,GPR02P)                                0068 00281000
         SL    R5,@CF00117                                         0068 00282000
*R6=R4;                             /* 'FROM' FIELD          @DA20388*/ 00283000
         LR    R6,R4                                               0069 00284000
*R7=0;                              /* PAD+SIZE OF 'FROM'    @DA20388*/ 00285000
         SLR   R7,R7                                               0070 00286000
*MVCL (R4,R6);                      /* CLEAR OUTPUT AREA     @DA20388*/ 00287000
         MVCL  R4,R6                                               0071 00288000
*RFY (R4,R5,R6,R7) UNRSTD;          /*                       @DA20388*/ 00289000
*                                                                  0072 00290000
*CPHPARCT=0;         /*INIT. PARENS. COUNT (CPHPARCT) TO 0        */    00291000
         SLR   @10,@10                                             0073 00292000
         STH   @10,CPHPARCT                                        0073 00293000
*/*   R0=TABLE ADDR R1=KEYWORD ADDR R2=OUTPUT AREA ADDR              */ 00294000
*CPHFLAGS='00'X;            /*  RESET CPHFLAGS*/                   0074 00295000
         MVI   CPHFLAGS,X'00'                                      0074 00296000
*CPHFLAG2='00'X;                                                   0075 00297000
         MVI   CPHFLAG2,X'00'                                      0075 00298000
*CPHKWSCN='1'B;             /*   SET CPHKWSCN = 1*/                0076 00299000
         OI    CPHKWSCN,B'00100000'                                0076 00300000
*CPHLCHAR='06'X;            /*   CPHLCHAR = X'06' (START OF KWD)*/ 0077 00301000
         MVI   CPHLCHAR,X'06'                                      0077 00302000
* /*ICALL(CPHSUBSC)*/                                              0078 00303000
*  DO;                                                             0078 00304000
* CALL CPHSUBSC;                                                   0079 00305000
*                                                                  0079 00306000
         BAL   @14,CPHSUBSC                                        0079 00307000
* END ;           /*   GO TO LOCATE KEYWORD */                     0080 00308000
*                   /* KWD ADD IN CPHKWPTR, KWD LENGTH IN CPHKWLEN   */ 00309000
*IF CPHSYNER='1'B            /*SYNTAX ERR */                       0081 00310000
*   THEN                        /*YES */                           0081 00311000
         TM    CPHSYNER,B'00000001'                                0081 00312000
         BNO   @RF00081                                            0081 00313000
*     GPR01P=GPR01P+1;           /*UPDATE REG1*/                   0082 00314000
         AL    GPR01P,@CF00048                                     0082 00315000
*   ELSE DO;                     /*NOT SYNTAX ERR */               0083 00316000
         B     @RC00081                                            0083 00317000
@RF00081 DS    0H                                                  0084 00318000
*     IF CPHENDST='1'B       /*END OF STRING*/                     0084 00319000
*        THEN;               /*YES END OF STRING*/                 0084 00320000
         TM    CPHENDST,B'00010000'                                0084 00321000
         BO    @RT00084                                            0084 00322000
*        ELSE DO;            /*NOT END OF STRING*/                 0086 00323000
*         IF CPHKWLEN>8           /*KWD LONGER THAN 8*/            0087 00324000
*          THEN                  /*YES */                          0087 00325000
         LH    @10,CPHKWLEN                                        0087 00326000
         C     @10,@CF00046                                        0087 00327000
         BNH   @RF00087                                            0087 00328000
*             CPHARGNF='1'B;         /*  SET ARGUMENT NOT FOUND*/  0088 00329000
         OI    CPHARGNF,B'00100000'                                0088 00330000
*          ELSE DO;                  /*NOT LONGER THAN 8*/         0089 00331000
         B     @RC00087                                            0089 00332000
@RF00087 DS    0H                                                  0090 00333000
*             CPHARGUM=' ';         /*CLEAR SEARCH ARG*/           0090 00334000
         MVI   CPHARGUM+1,C' '                                     0090 00335000
         MVC   CPHARGUM+2(6),CPHARGUM+1                            0090 00336000
         MVI   CPHARGUM,C' '                                       0090 00337000
*                               /* MOVE KWD TO CPHARGUM (SEARCH ARG)*/  00338000
*             CPHARGUM(1:CPHKWLEN)=CPHKWPTR->CPHSBYTE(1:CPHKWLEN); 0091 00339000
         LH    @10,CPHKWLEN                                        0091 00340000
         BCTR  @10,0                                               0091 00341000
         L     @09,CPHKWPTR                                        0091 00342000
         EX    @10,@SM00442                                        0091 00343000
*             CPHTABAD=GPR00P;  /*GET ADDR OF KWD TABLE*/          0092 00344000
         ST    GPR00P,CPHTABAD                                     0092 00345000
*              /*ICALL(CPHTBLSC)*/                                 0093 00346000
*               DO;                                                0093 00347000
*              CALL CPHTBLSC;                                      0094 00348000
*                                                                  0094 00349000
         BAL   @14,CPHTBLSC                                        0094 00350000
*              END ;  /* SEARCH KWD TABLE FOR KWD */               0095 00351000
*             IF CPHARGNF='0'B    /*WAS ARG FOUND*/                0096 00352000
*                THEN DO;         /*YES */                         0096 00353000
         TM    CPHARGNF,B'00100000'                                0096 00354000
         BNZ   @RF00096                                            0096 00355000
*                                 /* WAS IT  FUNCT. 0 WITH PARMS*/ 0098 00356000
*                  IF CPHFUNNO='0000'B&CPHTCHAR='01'X              0098 00357000
*                     THEN       /*YES*/                           0098 00358000
         TM    CPHFUNNO,B'00001111'                                0098 00359000
         BNZ   @RF00098                                            0098 00360000
         CLI   CPHTCHAR,1                                          0098 00361000
         BNE   @RF00098                                            0098 00362000
*                        CPHFUNER='1'B;    /* SET FUNCTION ERROR FLAG*/ 00363000
         OI    CPHFUNER,B'01000000'                                0099 00364000
*                     ELSE DO;       /*NOT FUNC 0 WITH PARMS*/     0100 00365000
         B     @RC00098                                            0100 00366000
@RF00098 DS    0H                                                  0101 00367000
*                             /* NOT FUNCT. 0 AND POSITIONAL KEYWD   */ 00368000
*                        IF CPHFUNNO^='0000'B&CPHTCHAR^='01'X      0101 00369000
*                           THEN      /*YES*/                      0101 00370000
         TM    CPHFUNNO,B'00001111'                                0101 00371000
         BZ    @RF00101                                            0101 00372000
         CLI   CPHTCHAR,1                                          0101 00373000
         BE    @RF00101                                            0101 00374000
*                             CPHSYNER='1'B; /* SET SYNTAX ERROR */     00375000
         OI    CPHSYNER,B'00000001'                                0102 00376000
*                           ELSE DO;/*NOT SYNTAX ERROR*/           0103 00377000
         B     @RC00101                                            0103 00378000
@RF00101 DS    0H                                                  0104 00379000
*                            GPR00F=CPHVALUE; /*GET ENT VALUE*/    0104 00380000
         ICM   GPR00F,15,CPHVALUE                                  0104 00381000
*                            IF CPHFUNNO=CPHFUN01 /*FUNCT 1*/      0105 00382000
*                               THEN   /*YES FUNC 1*/              0105 00383000
         TM    CPHFUNNO,B'00000001'                                0105 00384000
         BNO   @RF00105                                            0105 00385000
         TM    CPHFUNNO,B'00001110'                                0105 00386000
         BNZ   @RF00105                                            0105 00387000
*                                  /*ICALL(CPHSUB01)*/             0106 00388000
*                                   DO;                            0106 00389000
*                                  CALL CPHSUB01;                  0107 00390000
*                                                                  0107 00391000
         BAL   @14,CPHSUB01                                        0107 00392000
*                                  END ;/*CALL FUNCT 1 RTN*/       0108 00393000
*                               ELSE DO;   /*NOT FUNCT 1*/         0109 00394000
         B     @RC00105                                            0109 00395000
@RF00105 DS    0H                                                  0110 00396000
*                                 IF CPHFUNNO=CPHFUN02 /*FUNCT 2*/ 0110 00397000
*                                  THEN  /*YES FUNC2*/             0110 00398000
         TM    CPHFUNNO,B'00000010'                                0110 00399000
         BNO   @RF00110                                            0110 00400000
         TM    CPHFUNNO,B'00001101'                                0110 00401000
         BNZ   @RF00110                                            0110 00402000
*                                    /*ICALL(CPHSUB02)*/           0111 00403000
*                                     DO;                          0111 00404000
*                                    CALL CPHSUB02;                0112 00405000
*                                                                  0112 00406000
         BAL   @14,CPHSUB02                                        0112 00407000
*                                    END ;/*CALL FUNCT2 */         0113 00408000
*                                  ELSE DO;  /*NOT FUNCT 2*/       0114 00409000
         B     @RC00110                                            0114 00410000
@RF00110 DS    0H                                                  0115 00411000
*                                    IF CPHFUNNO=CPHFUN03 | /*FUNCT 3*/ 00412000
*                                       CPHFUNNO=CPHFUN04   /*OR 4*/    00413000
*                                     THEN     /*YES 3 OR 4*/      0115 00414000
         TM    CPHFUNNO,B'00000011'                                0115 00415000
         BNO   @GL00003                                            0115 00416000
         TM    CPHFUNNO,B'00001100'                                0115 00417000
         BZ    @RT00115                                            0115 00418000
@GL00003 TM    CPHFUNNO,B'00000100'                                0115 00419000
         BNO   @RF00115                                            0115 00420000
         TM    CPHFUNNO,B'00001011'                                0115 00421000
         BNZ   @RF00115                                            0115 00422000
@RT00115 DS    0H                                                  0116 00423000
*                                            /*CALL FUNCT 3/4 RTN*/     00424000
*                                         /*ICALL(CPHSUB34)*/      0116 00425000
*                                          DO;                     0116 00426000
*                                         CALL CPHSUB34;           0117 00427000
*                                                                  0117 00428000
         BAL   @14,CPHSUB34                                        0117 00429000
*                                         END ;                    0118 00430000
*                                     ELSE DO;  /*NOT 3/4*/        0119 00431000
         B     @RC00115                                            0119 00432000
@RF00115 DS    0H                                                  0120 00433000
*                                        IF CPHFUNNO=CPHFUN05/*FUNC 5*/ 00434000
*                                           THEN  /*YES CALL FUNC 5*/   00435000
         TM    CPHFUNNO,B'00000101'                                0120 00436000
         BNO   @RF00120                                            0120 00437000
         TM    CPHFUNNO,B'00001010'                                0120 00438000
         BNZ   @RF00120                                            0120 00439000
*                                               /*ICALL(CPHSUB05)*/     00440000
*                                                DO;               0121 00441000
*                                               CALL CPHSUB05;     0122 00442000
*                                                                  0122 00443000
         BAL   @14,CPHSUB05                                        0122 00444000
*                                               END ;              0123 00445000
*                                           ELSE DO;/*NOT FUNC5*/  0124 00446000
         B     @RC00120                                            0124 00447000
@RF00120 DS    0H                                                  0125 00448000
*                                           /*IF IT FUNC6*/        0125 00449000
*                                              IF CPHFUNNO=CPHFUN06     00450000
*                                                 THEN /*YES*/     0125 00451000
         TM    CPHFUNNO,B'00000110'                                0125 00452000
         BNO   @RF00125                                            0125 00453000
         TM    CPHFUNNO,B'00001001'                                0125 00454000
         BNZ   @RF00125                                            0125 00455000
*                                         /*CALL FUNCT 6 RTN*/     0126 00456000
*                                                     /*ICALL(CPHSUB06) 00457000
*/                                                                 0126 00458000
*                                                      DO;         0126 00459000
*                                                     CALL CPHSUB06;    00460000
*                                                                  0127 00461000
         BAL   @14,CPHSUB06                                        0127 00462000
*                                                     END ;        0128 00463000
*                                                 ELSE DO; /*NOT 6*/    00464000
         B     @RC00125                                            0129 00465000
@RF00125 DS    0H                                                  0130 00466000
*                                                 /*IS IT FUNC 7 OR 8*/ 00467000
*                                                 IF CPHFUNNO=CPHFUN07  00468000
*                                                 | CPHFUNNO=CPHFUN08   00469000
*                                                          /*@D32CKKA*/ 00470000
*                                                    THEN /*YES*/  0130 00471000
         TM    CPHFUNNO,B'00000111'                                0130 00472000
         BNO   @GL00004                                            0130 00473000
         TM    CPHFUNNO,B'00001000'                                0130 00474000
         BZ    @RT00130                                            0130 00475000
@GL00004 TM    CPHFUNNO,B'00001000'                                0130 00476000
         BNO   @RF00130                                            0130 00477000
         TM    CPHFUNNO,B'00000111'                                0130 00478000
         BNZ   @RF00130                                            0130 00479000
@RT00130 DS    0H                                                  0131 00480000
*                                                /*CALL FUNC 7/8 */     00481000
*                                                      /*ICALL(CPHSUB07 00482000
**/                                                                0131 00483000
*                                                       DO;        0131 00484000
*                                                      CALL CPHSUB07;   00485000
*                                                                  0132 00486000
         BAL   @14,CPHSUB07                                        0132 00487000
*                                                      END ;       0133 00488000
*                                                     ELSE;/*NOT 7,8*/  00489000
@RF00130 DS    0H                                                  0135 00490000
*                                                 END; /*END NOT 6*/    00491000
*                                           END;  /*END NOT FUNC 5*/    00492000
*                                     END;  /*END NOT FUNCT 3/4*/  0137 00493000
*                                 END;      /*END NOT FUNCT2*/     0138 00494000
*                                END;       /*END NOT FUNCT 1*/    0139 00495000
*                            END;          /*END NOT SYNTAX ERROR*/     00496000
*                     END;                 /*END NOT FUNCT ERROR*/ 0141 00497000
*                END;                      /*END ARG FOUND*/       0142 00498000
*                ELSE;                     /*ARG NOT FOUND*/       0143 00499000
@RF00096 DS    0H                                                  0144 00500000
*          END;              /*END NOT LONGER THAN 8*/             0144 00501000
@RC00096 DS    0H                                                  0145 00502000
*        END;                /*END NOT END OF STRING*/             0145 00503000
@RC00087 DS    0H                                                  0146 00504000
*    END;                  /*END NOT SYNTAX ERROR */               0146 00505000
@RT00084 DS    0H                                                  0147 00506000
*   IF CPHARGNF='1'B|CPHFUNER='1'B|CPHOFLOW='1'B /*NON-TERM ERRORS*/    00507000
*     THEN DO;               /*YES NON TERMINATING ERRORS*/        0147 00508000
@RC00081 TM    CPHARGNF,B'11100000'                                0147 00509000
         BZ    @RF00147                                            0147 00510000
*                              /* DO WHILE ERROR AND END NOT HIT     */ 00511000
*       DO WHILE(CPHLSTSP='0'B&CPHSYNER='0'B&CPHENDST='0'B);       0149 00512000
         B     @DE00149                                            0149 00513000
@DL00149 DS    0H                                                  0150 00514000
*          /*ICALL(CPHSUBSC)*/                                     0150 00515000
*           DO;                                                    0150 00516000
*          CALL CPHSUBSC;                                          0151 00517000
*                                                                  0151 00518000
         BAL   @14,CPHSUBSC                                        0151 00519000
*          END ;   /* SCAN OVER PARAMETER LIST            */       0152 00520000
*       END;                  /*END DO WHILE */                    0153 00521000
@DE00149 TM    CPHLSTSP,B'00010101'                                0153 00522000
         BZ    @DL00149                                            0153 00523000
*     END;                    /*END ERRORS CODE*/                  0154 00524000
*     ELSE;                   /*NO NON-TERMINATING ERRORS*/        0155 00525000
@RF00147 DS    0H                                                  0156 00526000
*   IF CPHSYNER='1'B          /*SYNTAX ERROR*/                     0156 00527000
*     THEN                     /*YES */                            0156 00528000
         TM    CPHSYNER,B'00000001'                                0156 00529000
         BNO   @RF00156                                            0156 00530000
*        GPR15F=12;            /*SET RTN CODE */                   0157 00531000
         LA    GPR15F,12                                           0157 00532000
*     ELSE DO;                 /*NOT SYNTAX ERROR*/                0158 00533000
         B     @RC00156                                            0158 00534000
@RF00156 DS    0H                                                  0159 00535000
*       IF CPHARGNF='1'B       /*ARG NOT FOUND ERROR*/             0159 00536000
*          THEN                /*YES */                            0159 00537000
         TM    CPHARGNF,B'00100000'                                0159 00538000
         BNO   @RF00159                                            0159 00539000
*             GPR15F=4;        /*SET RETURN CODE*/                 0160 00540000
         LA    GPR15F,4                                            0160 00541000
*          ELSE DO;            /*NOT ARG NOT FOUND ERROR*/         0161 00542000
         B     @RC00159                                            0161 00543000
@RF00159 DS    0H                                                  0162 00544000
*             IF CPHFUNER='1'B /*FUNCT ERROR*/                     0162 00545000
*                THEN          /*YES*/                             0162 00546000
         TM    CPHFUNER,B'01000000'                                0162 00547000
         BNO   @RF00162                                            0162 00548000
*                   GPR15F=16;  /*SET RETURN CODE*/                0163 00549000
         LA    GPR15F,16                                           0163 00550000
*                ELSE DO;      /*NOT FUNCT ERROR*/                 0164 00551000
         B     @RC00162                                            0164 00552000
@RF00162 DS    0H                                                  0165 00553000
*                   IF CPHOFLOW='1'B /*OVERFLOW*/                  0165 00554000
*                      THEN    /*YES*/                             0165 00555000
         TM    CPHOFLOW,B'10000000'                                0165 00556000
         BNO   @RF00165                                            0165 00557000
*                         GPR15F=20;  /*SET RETURN CODE*/          0166 00558000
         LA    GPR15F,20                                           0166 00559000
*                      ELSE DO;  /*NOT OVER FLOW*/                 0167 00560000
         B     @RC00165                                            0167 00561000
@RF00165 DS    0H                                                  0168 00562000
*                         IF CPHENDST='1'B /*END OF STRING*/       0168 00563000
*                            THEN   /*YES*/                        0168 00564000
         TM    CPHENDST,B'00010000'                                0168 00565000
         BNO   @RF00168                                            0168 00566000
*                               GPR15F=8; /*SET RETURN CODE*/      0169 00567000
         LA    GPR15F,8                                            0169 00568000
*                            ELSE   /*NO ERRORS*/                  0170 00569000
*                               GPR15F=0; /*SET RETURN CODE*/      0170 00570000
         B     @RC00168                                            0170 00571000
@RF00168 SLR   GPR15F,GPR15F                                       0170 00572000
*                      END;   /*END NOT OVERFLOW*/                 0171 00573000
@RC00168 DS    0H                                                  0172 00574000
*                END;    /*END NOT FUNCTION ERROR*/                0172 00575000
@RC00165 DS    0H                                                  0173 00576000
*          END;          /*END NOT ARG NOT FOUND ERROR*/           0173 00577000
@RC00162 DS    0H                                                  0174 00578000
*     END;               /*END NOT SYNTAX ERROR*/                  0174 00579000
@RC00159 DS    0H                                                  0175 00580000
*        GPR03P=CPHINSVA;  /*PICK UP CALLER'S SVA ADDRESS    @DM39361*/ 00581000
@RC00156 L     GPR03P,CPHINSVA                                     0175 00582000
*   GEN REFS(GPR15F,GPR00P,GPR01P,GPR13P)                          0176 00583000
*       (STM  15,1,16(3));  /*STORE OUTPUT REGS FOR CALLER   @DM39361*/ 00584000
         STM  15,1,16(3)                                                00585000
*        IF GPR13P=ADDR(STATICFD)                                  0177 00586000
*          THEN CPHLOCK='00'X; /*RESET INLINE DATA LOCK      @DM39361*/ 00587000
         LA    @10,STATICFD                                        0177 00588000
         CR    GPR13P,@10                                          0177 00589000
         BNE   @RF00177                                            0177 00590000
         MVI   CPHLOCK,X'00'                                       0178 00591000
*          ELSE DO;            /*ELSE RELEASE DYN DATA AREA  @DM39361*/ 00592000
         B     @RC00177                                            0179 00593000
@RF00177 DS    0H                                                  0180 00594000
*        GEN SETS(GPR00P) SETS(GPR13P);                    /*@DM39361*/ 00595000
         L    0,@SIZDATD                                                00596000
         FREEMAIN  R,LV=(0),A=(13)                                      00597000
*          END;                                            /*@DM39361*/ 00598000
*        GPR13P=GPR03P;    /*PUT CALLER'S SVA ADDR IN R13    @DM39361*/ 00599000
@RC00177 LR    GPR13P,GPR03P                                       0182 00600000
* END;                   /*SAVE AREA GOTTEN OK               @DM39361*/ 00601000
* ELSE DO;               /*SAVE AREA NOT OBTAINED            @DM39361*/ 00602000
         B     @RC00062                                            0184 00603000
@RF00062 DS    0H                                                  0185 00604000
*   GPR15F=20;           /* OVERFLOW RETURN CODE             @DM39361*/ 00605000
         LA    GPR15F,20                                           0185 00606000
*   GPR13P=GPR03P;       /*RESTORE CALLER'S SVA ADDR         @DM39361*/ 00607000
         LR    GPR13P,GPR03P                                       0186 00608000
* GEN REFS(GPR15P,GPR13P)                                          0187 00609000
*     (ST 15,16(13));    /*SAVE RETURN CODE FOR CALLER       @DM39361*/ 00610000
         ST 15,16(13)                                                   00611000
* GEN REFS(GPR04P,GPR05P,GPR13P,GPR06P,GPR07P);            /*@VS45113*/ 00612000
         STM 4,7,36(13)                                                 00613000
* END;                   /*SAVE AREA NOT OBTAINED            @DM39361*/ 00614000
*/*CPHSUB01:03A2 E                                 */              0190 00615000
*/*******************************************************************/  00616000
*/*                                                                 */  00617000
*/*   CPHSUB01: FUNCTION 1 ROUTINE                                  */  00618000
*/*                                                                 */  00619000
*/*******************************************************************/  00620000
*   CPHSUB01: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0190 00621000
         B     @PB00002                                            0190 00622000
CPHSUB01 DS    0H                                                  0191 00623000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0191 00624000
*    DO;                                                           0191 00625000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0192 00626000
*                                                                  0193 00627000
*   END;/* CMZMREG */                                              0193 00628000
*   CMZX9904 = GPR14P;                                             0194 00629000
         LR    CMZX9904,GPR14P                                     0194 00630000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0195 00631000
*                                                                  0196 00632000
*   END;/* CMZMREG */                                              0196 00633000
*   END ;                                                          0197 00634000
*      /*   R1=PARM STRING POINTER R2=OUTPUT AREA ADDRESS       */ 0198 00635000
*    /*ICALL(CPHSUBSC)*/                                           0198 00636000
*     DO;                                                          0198 00637000
*    CALL CPHSUBSC;                                                0199 00638000
*                                                                  0199 00639000
         BAL   @14,CPHSUBSC                                        0199 00640000
*    END ;     /*LOCATE NEXT SUBPARAMETER*/                        0200 00641000
*          /* CPHSPPTR= SUBPARAM PTR CPHSPLEN= SUBPARAM LENGTH*/   0201 00642000
*   IF CPHSYNER='1'B      /*SYNTAX ERROR */                        0201 00643000
*      THEN;              /*YES */                                 0201 00644000
         TM    CPHSYNER,B'00000001'                                0201 00645000
         BO    @RT00201                                            0201 00646000
*      ELSE DO;           /*NOT SYNTAX ERROR*/                     0203 00647000
*         PHRF1SAD=CPHSPPTR;/*SUBPARM PTR IN OUTPUT AREA*/         0204 00648000
         L     @10,CPHSPPTR                                        0204 00649000
         ST    @10,PHRF1SAD(,GPR02P)                               0204 00650000
*         PHRF1SLN=CPHSPLEN;/*SUBPARM LENGTH IN OUTPUT AREA*/      0205 00651000
         LH    @09,CPHSPLEN                                        0205 00652000
         ST    @09,PHRF1SLN(,GPR02P)                               0205 00653000
*         IF EVAL(CPHSPPTR-1)->CPHSBYTE(1)='(' /*LAST CHAR '('*/   0206 00654000
*            THEN DO;          /*YES LEFT PAREN*/                  0206 00655000
         LR    @09,@10                                             0206 00656000
         BCTR  @09,0                                               0206 00657000
         CLI   CPHSBYTE(@09),C'('                                  0206 00658000
         BNE   @RF00206                                            0206 00659000
*                /* GET ADDRESS OF LAST CHAR (CPHSPPTR MINUS 1)*/  0208 00660000
*               EVAL(CPHSPPTR-1)->CPHSBYTE(1)=' ';/*SET TO BLANK*/ 0208 00661000
         BCTR  @10,0                                               0208 00662000
         MVI   CPHSBYTE(@10),C' '                                  0208 00663000
*            END;            /*END LEFT PAREN CODE*/               0209 00664000
*            ELSE;           /*NOT LEFT PAREN*/                    0210 00665000
@RF00206 DS    0H                                                  0211 00666000
*FUN1LOOP:                                                         0211 00667000
*         DO WHILE(CPHSYNER='0'B&CPHLSTSP='0'B);/*LOOK FOR ','*/   0211 00668000
FUN1LOOP B     @DE00211                                            0211 00669000
@DL00211 DS    0H                                                  0212 00670000
*            IF GPR01P->CPHSBYTE(1) = ','   /* COMMA FOUND? */     0212 00671000
*               THEN   /* YES */                                   0212 00672000
         CLI   CPHSBYTE(GPR01P),C','                               0212 00673000
         BNE   @RF00212                                            0212 00674000
*                  PHRF1SLN = PHRF1SLN + 1;  /*ACCOUNT FOR COMMA */     00675000
         LA    @10,1                                               0213 00676000
         AL    @10,PHRF1SLN(,GPR02P)                               0213 00677000
         ST    @10,PHRF1SLN(,GPR02P)                               0213 00678000
*               ELSE;           /* NO STRING COUNT UPDATE */       0214 00679000
@RF00212 DS    0H                                                  0215 00680000
*             /*ICALL(CPHSUBSC)*/                                  0215 00681000
*              DO;                                                 0215 00682000
*             CALL CPHSUBSC;                                       0216 00683000
*                                                                  0216 00684000
         BAL   @14,CPHSUBSC                                        0216 00685000
*             END ;    /* LOCATE NEXT SUBPARAMETER*/               0217 00686000
*            PHRF1SLN=PHRF1SLN+CPHSPLEN; /*ADD SUBPARM LENGTH*/    0218 00687000
         LH    @10,CPHSPLEN                                        0218 00688000
         AL    @10,PHRF1SLN(,GPR02P)                               0218 00689000
         ST    @10,PHRF1SLN(,GPR02P)                               0218 00690000
*            CPHSPLEN = 0; /* ZAP COUNT TO AVOID DOUBLE UPDATES */ 0219 00691000
         SLR   @10,@10                                             0219 00692000
         STH   @10,CPHSPLEN                                        0219 00693000
*         END FUN1LOOP;                                            0220 00694000
@DE00211 TM    CPHSYNER,B'00000101'                                0220 00695000
         BZ    @DL00211                                            0220 00696000
*         IF CPHSYNER='1'B /*SYNTAX ERROR*/                        0221 00697000
*            THEN;         /*YES*/                                 0221 00698000
         TM    CPHSYNER,B'00000001'                                0221 00699000
         BO    @RT00221                                            0221 00700000
*            ELSE DO;      /*NOT SYNTAX ERROR*/                    0223 00701000
*                       /* CHECK LAST BYTE OF PARM LIST SCANNED */ 0224 00702000
*              IF EVAL(PHRF1SAD+PHRF1SLN)->CPHSBYTE(1)=')'/*LAST ')'*/  00703000
*                 THEN DO;      /*YES LAST CAHR IS RT PAREN*/      0224 00704000
         L     @10,PHRF1SAD(,GPR02P)                               0224 00705000
         L     @09,PHRF1SLN(,GPR02P)                               0224 00706000
         LR    @08,@10                                             0224 00707000
         ALR   @08,@09                                             0224 00708000
         CLI   CPHSBYTE(@08),C')'                                  0224 00709000
         BNE   @RF00224                                            0224 00710000
*            /*GET ADDRESS OF LAST CHAR (SUBPARM PTR PLUS STRING LEN)*/ 00711000
*                     /*   MOVE 'BLANK' INTO THAT CHAR OF PARM STRING*/ 00712000
*                    EVAL(PHRF1SAD+PHRF1SLN)->CPHSBYTE(1)=' ';     0226 00713000
         ALR   @10,@09                                             0226 00714000
         MVI   CPHSBYTE(@10),C' '                                  0226 00715000
*                 END;    /*END RT PAREN CODE*/                    0227 00716000
*                 ELSE;   /*NOT RT PAREN*/                         0228 00717000
@RF00224 DS    0H                                                  0229 00718000
*            END;         /*END NOT SYNTAX ERROR FROM COMMA SCAN*/ 0229 00719000
*      END;               /*END NOT SYNTAX ERROR FROM NXT PARM*/   0230 00720000
@RT00221 DS    0H                                                  0231 00721000
*    /*CMZPEND*/                                                   0231 00722000
*     DO;                                                          0231 00723000
@RT00201 DS    0H                                                  0232 00724000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0232 00725000
*                                                                  0233 00726000
*    END;/* CMZMREG */                                             0233 00727000
*    GPR14P = CMZX9904;                                            0234 00728000
         LR    GPR14P,CMZX9904                                     0234 00729000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0235 00730000
*                                                                  0236 00731000
*    END;/* CMZMREG */                                             0236 00732000
*    END ;                                                         0237 00733000
*    END CPHSUB01;                                                 0238 00734000
@EL00002 DS    0H                                                  0238 00735000
@EF00002 DS    0H                                                  0238 00736000
@ER00002 BR    @14                                                 0238 00737000
*/********************************************************************/ 00738000
*/*                                                                  */ 00739000
*/*      CPHSUB02: FUNCTION 2 ROUTINE                                */ 00740000
*/*                                                                  */ 00741000
*/********************************************************************/ 00742000
*   CPHSUB02: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0239 00743000
CPHSUB02 DS    0H                                                  0240 00744000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0240 00745000
*    DO;                                                           0240 00746000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0241 00747000
*                                                                  0242 00748000
*   END;/* CMZMREG */                                              0242 00749000
*   CMZX9905 = GPR14P;                                             0243 00750000
         LR    CMZX9905,GPR14P                                     0243 00751000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0244 00752000
*                                                                  0245 00753000
*   END;/* CMZMREG */                                              0245 00754000
*   END ;                                                          0246 00755000
*  /* R0=PTR BLK ADDRESS R1=PARM STRING POINTER R2=OUTPUT AREA PTR*/    00756000
*   PHRF2NVL=0;                 /* RESET COUNT FIELD  */           0247 00757000
         SLR   @10,@10                                             0247 00758000
         ST    @10,PHRF2NVL(,GPR02P)                               0247 00759000
*                               /* RESET COUNT LIMIT  */           0248 00760000
*   CPHOALIM=(PHROALEN-(ADDR(PHRF2VAL(1))-GPR02P))/LENGTH(PHRF2VAL(1)); 00761000
         LA    @10,PHRF2VAL(,GPR02P)                               0248 00762000
         SLR   @10,GPR02P                                          0248 00763000
         LR    @08,@10                                             0248 00764000
         LCR   @08,@08                                             0248 00765000
         AL    @08,PHROALEN(,GPR02P)                               0248 00766000
         SRDA  @08,32                                              0248 00767000
         D     @08,@CF00117                                        0248 00768000
         ST    @09,CPHOALIM                                        0248 00769000
*LOOP2:                                                            0249 00770000
*   DO CPHOANDX=1 TO CPHOALIM WHILE(CPHLSTSP='0'B&CPHSYNER='0'B&   0249 00771000
*         CPHFUNER='0'B);    /*GET ALL SUBPARMS WHILE NOT A SYNTAX*/    00772000
LOOP2    LA    @10,1                                               0249 00773000
         B     @DE00249                                            0249 00774000
@DL00249 TM    CPHLSTSP,B'00000101'                                0249 00775000
         BNZ   @DC00249                                            0249 00776000
         TM    CPHFUNER,B'01000000'                                0249 00777000
         BNZ   @DC00249                                            0249 00778000
*                                       /*ERROR AND NOT END OF STRING*/ 00779000
*      /*ICALL(CPHSUBSC)*/                                         0250 00780000
*      F2LOOP: DO;                                                 0250 00781000
F2LOOP   DS    0H                                                  0251 00782000
*      CALL CPHSUBSC;                                              0251 00783000
*                                                                  0251 00784000
         BAL   @14,CPHSUBSC                                        0251 00785000
*      END F2LOOP;           /*LOCATE NEXT SUBPARAM */             0252 00786000
*                 /* CPHSPPTR= SUBPARAM PTR, CPHSPLEN= SUBPARAM LNGTH*/ 00787000
*      IF CPHSYNER='1'B           /*SYNTAX ERROR*/                 0253 00788000
*          THEN;                  /*YES*/                          0253 00789000
         TM    CPHSYNER,B'00000001'                                0253 00790000
         BO    @RT00253                                            0253 00791000
*          ELSE DO;               /*NOT SYNTAX ERROR*/             0255 00792000
*             CPHTABAD=GPR00P->CPHSBTAB;  /*GET TABLE ADDR*/       0256 00793000
         LR    @10,GPR00P                                          0256 00794000
         MVC   CPHTABAD(4),CPHSBTAB(@10)                           0256 00795000
*             IF CPHSPLEN>8 /*SUB PARM TOO LONG*/                  0257 00796000
*                THEN        /*YES*/                               0257 00797000
         LH    @10,CPHSPLEN                                        0257 00798000
         C     @10,@CF00046                                        0257 00799000
         BNH   @RF00257                                            0257 00800000
*                   CPHFUNER='1'B;    /*SET FUNCTION ERROR*/       0258 00801000
         OI    CPHFUNER,B'01000000'                                0258 00802000
*                ELSE DO;         /*NOT TOO LONG*/                 0259 00803000
         B     @RC00257                                            0259 00804000
@RF00257 DS    0H                                                  0260 00805000
*                   IF CPHSPLEN=0   /*WAS SUB PARM DEFAULTED*/     0260 00806000
*                      THEN       /*YES*/                          0260 00807000
         SLR   @10,@10                                             0260 00808000
         CH    @10,CPHSPLEN                                        0260 00809000
         BNE   @RF00260                                            0260 00810000
*                         PHRF2VAL(CPHOANDX)=0;/*NEXT ENTRY EQUAL ZERO* 00811000
         L     @09,CPHOANDX                                        0261 00812000
         SLA   @09,2                                               0261 00813000
         ST    @10,PHRF2VAL-4(@09,GPR02P)                          0261 00814000
*                       ELSE DO;   /*NOT DEFAULTED*/               0262 00815000
         B     @RC00260                                            0262 00816000
@RF00260 DS    0H                                                  0263 00817000
*                                      /*PUT PARM IN SEARCH ARG*/  0263 00818000
*                          CPHARGUM=CPHSPPTR->CPHSBYTE(1:CPHSPLEN);     00819000
         MVI   CPHARGUM+1,C' '                                     0263 00820000
         MVC   CPHARGUM+2(6),CPHARGUM+1                            0263 00821000
         LH    @10,CPHSPLEN                                        0263 00822000
         BCTR  @10,0                                               0263 00823000
         L     @09,CPHSPPTR                                        0263 00824000
         EX    @10,@SM00442                                        0263 00825000
*                           /*ICALL(CPHTBLSC)*/                    0264 00826000
*                            DO;                                   0264 00827000
*                           CALL CPHTBLSC;                         0265 00828000
*                                                                  0265 00829000
         BAL   @14,CPHTBLSC                                        0265 00830000
*                           END ;  /*SEARCH SUBPARM TABLE*/        0266 00831000
*                          IF CPHARGNF='0'B     /*WAS ARG FOUND*/  0267 00832000
*                             THEN          /*YES*/                0267 00833000
         TM    CPHARGNF,B'00100000'                                0267 00834000
         BNZ   @RF00267                                            0267 00835000
*                                /* STORE TABLE ENTRY INTO OUTPUT AREA* 00836000
*                                MVC(CPHF2VAL(CPHOANDX),CPHSBVL1); 0268 00837000
         L     @10,CPHOANDX                                        0268 00838000
         SLA   @10,2                                               0268 00839000
         ALR   @10,GPR02P                                          0268 00840000
         MVC   CPHF2VAL-4(4,@10),CPHSBVL1                          0268 00841000
*                             ELSE DO;   /*ARG NOT FOUND*/         0269 00842000
         B     @RC00267                                            0269 00843000
@RF00267 DS    0H                                                  0270 00844000
*                          /*  STORE 'FF'S IN NEXT WORD OF OUTPUT AREA* 00845000
*                                PHRF2VAL(CPHOANDX)=-1;            0270 00846000
         L     @10,CPHOANDX                                        0270 00847000
         SLA   @10,2                                               0270 00848000
         SLR   @09,@09                                             0270 00849000
         BCTR  @09,0                                               0270 00850000
         ST    @09,PHRF2VAL-4(@10,GPR02P)                          0270 00851000
*                                CPHARGNF='0'B; /*RESET ARG NOT FOUND*/ 00852000
         NI    CPHARGNF,B'11011111'                                0271 00853000
*                             END;       /*END ARG NOT FOUND*/     0272 00854000
*                       END;             /*END NOT DEFAULTED*/     0273 00855000
@RC00267 DS    0H                                                  0274 00856000
*                   PHRF2NVL=PHRF2NVL+1;/*INCR COUNT*/             0274 00857000
@RC00260 LA    @10,1                                               0274 00858000
         AL    @10,PHRF2NVL(,GPR02P)                               0274 00859000
         ST    @10,PHRF2NVL(,GPR02P)                               0274 00860000
*                END;             /*END NOT TOO LONG*/             0275 00861000
*          END;                   /*END NOT SYNTAX ERROR*/         0276 00862000
@RC00257 DS    0H                                                  0277 00863000
*   END LOOP2;                    /*END DO WHILE*/                 0277 00864000
@RT00253 LA    @10,1                                               0277 00865000
         AL    @10,CPHOANDX                                        0277 00866000
@DE00249 ST    @10,CPHOANDX                                        0277 00867000
         C     @10,CPHOALIM                                        0277 00868000
         BNH   @DL00249                                            0277 00869000
@DC00249 DS    0H                                                  0278 00870000
*   IF CPHOANDX>CPHOALIM&CPHLSTSP='0'B /*OVER FLOW AND NOT END*/   0278 00871000
*      THEN                                     /*YES*/            0278 00872000
         L     @10,CPHOANDX                                        0278 00873000
         C     @10,CPHOALIM                                        0278 00874000
         BNH   @RF00278                                            0278 00875000
         TM    CPHLSTSP,B'00000100'                                0278 00876000
         BNZ   @RF00278                                            0278 00877000
*         CPHOFLOW='1'B;           /*SET OVERFLOW */               0279 00878000
         OI    CPHOFLOW,B'10000000'                                0279 00879000
*      ELSE DO;                    /*NOT OVERFLOW*/                0280 00880000
         B     @RC00278                                            0280 00881000
@RF00278 DS    0H                                                  0281 00882000
*         IF CPHSYNER='0'B&CPHFUNER='0'B /*SYNTAX OR FUNCT ERR*/   0281 00883000
*            THEN                  /*NO*/                          0281 00884000
         TM    CPHSYNER,B'00000001'                                0281 00885000
         BNZ   @RF00281                                            0281 00886000
         TM    CPHFUNER,B'01000000'                                0281 00887000
         BNZ   @RF00281                                            0281 00888000
*               GPR00P=GPR00P->CPHSBVAL; /*SET R0 =ADDR OF RTN*/   0282 00889000
         LR    @10,GPR00P                                          0282 00890000
         ICM   GPR00P,15,CPHSBVAL(@10)                             0282 00891000
*            ELSE;                 /*YES SYNTAX OR FUNCT ERR*/     0283 00892000
@RF00281 DS    0H                                                  0284 00893000
*      END;                         /*END NOT OVERFLOW*/           0284 00894000
*    /*CMZPEND*/                                                   0285 00895000
*     DO;                                                          0285 00896000
@RC00278 DS    0H                                                  0286 00897000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0286 00898000
*                                                                  0287 00899000
*    END;/* CMZMREG */                                             0287 00900000
*    GPR14P = CMZX9905;                                            0288 00901000
         LR    GPR14P,CMZX9905                                     0288 00902000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0289 00903000
*                                                                  0290 00904000
*    END;/* CMZMREG */                                             0290 00905000
*    END ;                                                         0291 00906000
*    END CPHSUB02;                                                 0292 00907000
@EL00003 DS    0H                                                  0292 00908000
@EF00003 DS    0H                                                  0292 00909000
@ER00003 BR    @14                                                 0292 00910000
*/********************************************************************/ 00911000
*/*                                                                  */ 00912000
*/*      CPHSUB34: FUNCTION 3, 4 ROUTINE                             */ 00913000
*/*                                                                  */ 00914000
*/********************************************************************/ 00915000
*                                                                  0293 00916000
*   CPHSUB34: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0293 00917000
CPHSUB34 DS    0H                                                  0294 00918000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0294 00919000
*    DO;                                                           0294 00920000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0295 00921000
*                                                                  0296 00922000
*   END;/* CMZMREG */                                              0296 00923000
*   CMZX9906 = GPR14P;                                             0297 00924000
         LR    CMZX9906,GPR14P                                     0297 00925000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0298 00926000
*                                                                  0299 00927000
*   END;/* CMZMREG */                                              0299 00928000
*   END ;                                                          0300 00929000
*                   /*  R1=PARM STRING PTR R2=OUTPUT AREA PTR*/    0301 00930000
*            /*RESET COUNT FIELD AND LIMIT OF OUTPUT AREA AND CPHOALIM* 00931000
*   PHRF34NS=0;                                                    0301 00932000
         SLR   @10,@10                                             0301 00933000
         ST    @10,PHRF34NS(,GPR02P)                               0301 00934000
*   CPHOALIM=(PHROALEN-(ADDR(PHRF34EN(1))-GPR02P))/LENGTH(PHRF34EN);    00935000
         LA    @10,PHRF34EN(,GPR02P)                               0302 00936000
         SLR   @10,GPR02P                                          0302 00937000
         LR    @08,@10                                             0302 00938000
         LCR   @08,@08                                             0302 00939000
         AL    @08,PHROALEN(,GPR02P)                               0302 00940000
         SRDA  @08,32                                              0302 00941000
         D     @08,@CF00235                                        0302 00942000
         ST    @09,CPHOALIM                                        0302 00943000
*             /*PROCESS ENTRIES WHILE NO ERRORS*/                  0303 00944000
*LOOP34:                                                           0303 00945000
*   DO CPHOANDX=1 TO CPHOALIM WHILE(CPHLSTSP='0'B&CPHFUNER='0'B&   0303 00946000
*         CPHSYNER='0'B);                                          0303 00947000
LOOP34   LA    @10,1                                               0303 00948000
         B     @DE00303                                            0303 00949000
@DL00303 TM    CPHLSTSP,B'00000100'                                0303 00950000
         BNZ   @DC00303                                            0303 00951000
         TM    CPHFUNER,B'01000000'                                0303 00952000
         BNZ   @DC00303                                            0303 00953000
         TM    CPHSYNER,B'00000001'                                0303 00954000
         BNZ   @DC00303                                            0303 00955000
*      /*ICALL(CPHSUBSC)*/                                         0304 00956000
*      F34LOOP: DO;                                                0304 00957000
F34LOOP  DS    0H                                                  0305 00958000
*      CALL CPHSUBSC;                                              0305 00959000
*                                                                  0305 00960000
         BAL   @14,CPHSUBSC                                        0305 00961000
*      END F34LOOP;            /*  LOCATE NEXT SUBPARAM*/          0306 00962000
*      IF CPHSYNER='1'B         /* SYNTAX ERROR*/                  0307 00963000
*         THEN;                   /*YES*/                          0307 00964000
         TM    CPHSYNER,B'00000001'                                0307 00965000
         BO    @RT00307                                            0307 00966000
*         ELSE DO;                 /*NOT SYNTAX ERROR*/            0309 00967000
*            IF CPHSPLEN>8         /*PARM TOO LONG*/               0310 00968000
*               THEN               /*YES*/                         0310 00969000
         LH    @10,CPHSPLEN                                        0310 00970000
         C     @10,@CF00046                                        0310 00971000
         BNH   @RF00310                                            0310 00972000
*                  CPHFUNER='1'B;  /*SET FUNCTION ERROR*/          0311 00973000
         OI    CPHFUNER,B'01000000'                                0311 00974000
*               ELSE DO;           /*NOT TOO LONG*/                0312 00975000
         B     @RC00310                                            0312 00976000
@RF00310 DS    0H                                                  0313 00977000
*                  IF CPHSPLEN=0   /*WAS PARM DEFAULTED*/          0313 00978000
*                     THEN DO;     /*YES*/                         0313 00979000
         LH    @10,CPHSPLEN                                        0313 00980000
         LTR   @10,@10                                             0313 00981000
         BNZ   @RF00313                                            0313 00982000
*                        IF CPHFUNNO=CPHFUN03 /*FUNCT 3*/          0315 00983000
*                           THEN    /*YES*/                        0315 00984000
         TM    CPHFUNNO,B'00000011'                                0315 00985000
         BNO   @RF00315                                            0315 00986000
         TM    CPHFUNNO,B'00001100'                                0315 00987000
         BNZ   @RF00315                                            0315 00988000
*                              PHRF34SP(CPHOANDX)=' ';/*SET TO BLANKS*/ 00989000
         L     @10,CPHOANDX                                        0316 00990000
         MH    @10,@CH00235                                        0316 00991000
         ALR   @10,GPR02P                                          0316 00992000
         MVI   PHRF34SP-11(@10),C' '                               0316 00993000
         MVC   PHRF34SP-10(6,@10),PHRF34SP-11(@10)                 0316 00994000
         MVI   PHRF34SP-12(@10),C' '                               0316 00995000
*                           ELSE    /*NO NOT FUNCT 3*/             0317 00996000
*                              PHRF34SP(CPHOANDX)='00000000';/*ST TO 0* 00997000
         B     @RC00315                                            0317 00998000
@RF00315 L     @10,CPHOANDX                                        0317 00999000
         MH    @10,@CH00235                                        0317 01000000
         ALR   @10,GPR02P                                          0317 01001000
         MVC   PHRF34SP-12(8,@10),@CC00266                         0317 01002000
*                     END;    /*END DEFAULTED*/                    0318 01003000
*                     ELSE DO;     /*NOT DEFAULTED*/               0319 01004000
         B     @RC00313                                            0319 01005000
@RF00313 DS    0H                                                  0320 01006000
*                         /*ICALL(CPHVALCK)*/                      0320 01007000
*                          DO;                                     0320 01008000
*                         CALL CPHVALCK;                           0321 01009000
*                                                                  0321 01010000
         BAL   @14,CPHVALCK                                        0321 01011000
*                         END ; /*CK VALIDITY OF PARM*/            0322 01012000
*                        PHRF34VF(CPHOANDX)=CPHVALFG;/*SET VAL FLG*/    01013000
         L     @10,CPHOANDX                                        0323 01014000
         MH    @10,@CH00235                                        0323 01015000
         ST    @10,@TF00001                                        0323 01016000
         ALR   @10,GPR02P                                          0323 01017000
         AL    @10,@CF00448                                        0323 01018000
         MVC   PHRF34VF-8(1,@10),CPHVALFG                          0323 01019000
*                        IF CPHFUNNO=CPHFUN03 /*FUNCT 3*/          0324 01020000
*                           THEN DO;          /*YES*/              0324 01021000
         TM    CPHFUNNO,B'00000011'                                0324 01022000
         BNO   @RF00324                                            0324 01023000
         TM    CPHFUNNO,B'00001100'                                0324 01024000
         BNZ   @RF00324                                            0324 01025000
*                              PHRF34SP(CPHOANDX)=' ';/*INIT TO BLANK*/ 01026000
         LR    @10,GPR02P                                          0326 01027000
         AL    @10,@TF00001                                        0326 01028000
         MVI   PHRF34SP-11(@10),C' '                               0326 01029000
         MVC   PHRF34SP-10(6,@10),PHRF34SP-11(@10)                 0326 01030000
         MVI   PHRF34SP-12(@10),C' '                               0326 01031000
*                    /* MOVE SUBPARAM TO PHRF34SP(*) LEFT JUSTIFIED*/   01032000
*                                     /*PADDED WITH BLANKS (8 CHAR) */  01033000
*                              PHRF34SP(CPHOANDX,1:CPHSPLEN)=      0327 01034000
*                                CPHSPPTR->CPHSBYTE(1:CPHSPLEN);   0327 01035000
         LR    @10,GPR02P                                          0327 01036000
         AL    @10,@TF00001                                        0327 01037000
         LH    @09,CPHSPLEN                                        0327 01038000
         BCTR  @09,0                                               0327 01039000
         L     @08,CPHSPPTR                                        0327 01040000
         EX    @09,@SM00449                                        0327 01041000
*                           END;              /*END FUNCT 3*/      0328 01042000
*                           ELSE DO;   /*NOT FUNCT 3*/             0329 01043000
         B     @RC00324                                            0329 01044000
@RF00324 DS    0H                                                  0330 01045000
*                              /*  INIT PHRF34SP(*) TO EBCDIC ZEROS*/   01046000
*                              PHRF34SP(CPHOANDX)='00000000';      0330 01047000
         L     @10,CPHOANDX                                        0330 01048000
         MH    @10,@CH00235                                        0330 01049000
         ST    @10,@TF00001                                        0330 01050000
         ALR   @10,GPR02P                                          0330 01051000
         MVC   PHRF34SP-12(8,@10),@CC00266                         0330 01052000
*               /* MOVE SUBPARAM TO PHRF34SP(*) RIGHT JUSTIFIED PADDED* 01053000
*                                        /*WITH ZEROS (8 CHARS)*/  0331 01054000
*                              PHRF34SP(CPHOANDX,9-CPHSPLEN:8)=    0331 01055000
*                              CPHSPPTR->CPHSBYTE(1:CPHSPLEN);     0331 01056000
         LA    @10,9                                               0331 01057000
         SH    @10,CPHSPLEN                                        0331 01058000
         L     @09,@TF00001                                        0331 01059000
         ALR   @09,@10                                             0331 01060000
         ALR   @09,GPR02P                                          0331 01061000
         BCTR  @09,0                                               0331 01062000
         LCR   @10,@10                                             0331 01063000
         AL    @10,@CF00046                                        0331 01064000
         L     @08,CPHSPPTR                                        0331 01065000
         EX    @10,@SM00451                                        0331 01066000
*                           END;        /*END NOT FUNCT 3*/        0332 01067000
*                     END;              /*END NOT DEFAULTED*/      0333 01068000
@RC00324 DS    0H                                                  0334 01069000
*                  PHRF34SL(CPHOANDX)=CPHSPLEN;/*PUT LEN IN OUT AREA*/  01070000
@RC00313 L     @10,CPHOANDX                                        0334 01071000
         MH    @10,@CH00235                                        0334 01072000
         LH    @09,CPHSPLEN                                        0334 01073000
         BCTR  @10,0                                               0334 01074000
         BCTR  @10,0                                               0334 01075000
         STH   @09,PHRF34SL-10(@10,GPR02P)                         0334 01076000
*                  PHRF34NS=PHRF34NS+1;       /*INC NO. SUBPARM*/  0335 01077000
         LA    @10,1                                               0335 01078000
         AL    @10,PHRF34NS(,GPR02P)                               0335 01079000
         ST    @10,PHRF34NS(,GPR02P)                               0335 01080000
*               END;           /*END NOT TOO LONG*/                0336 01081000
*         END;                 /*END NOT SYNTAX ERROR*/            0337 01082000
@RC00310 DS    0H                                                  0338 01083000
*   END LOOP34;                /*END DO WHILE*/                    0338 01084000
@RT00307 LA    @10,1                                               0338 01085000
         AL    @10,CPHOANDX                                        0338 01086000
@DE00303 ST    @10,CPHOANDX                                        0338 01087000
         C     @10,CPHOALIM                                        0338 01088000
         BNH   @DL00303                                            0338 01089000
@DC00303 DS    0H                                                  0339 01090000
*   IF CPHOANDX>CPHOALIM&CPHLSTSP='0'B /*OVERFLOW AND NOT END*/    0339 01091000
*      THEN                    /*YES*/                             0339 01092000
         L     @10,CPHOANDX                                        0339 01093000
         C     @10,CPHOALIM                                        0339 01094000
         BNH   @RF00339                                            0339 01095000
         TM    CPHLSTSP,B'00000100'                                0339 01096000
         BNZ   @RF00339                                            0339 01097000
*         CPHOFLOW='1'B;       /*SET OVERFLOW FLG*/                0340 01098000
         OI    CPHOFLOW,B'10000000'                                0340 01099000
*      ELSE;                   /*NOT OVER FLOW*/                   0341 01100000
@RF00339 DS    0H                                                  0342 01101000
*    /*CMZPEND*/                                                   0342 01102000
*     DO;                                                          0342 01103000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0343 01104000
*                                                                  0344 01105000
*    END;/* CMZMREG */                                             0344 01106000
*    GPR14P = CMZX9906;                                            0345 01107000
         LR    GPR14P,CMZX9906                                     0345 01108000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0346 01109000
*                                                                  0347 01110000
*    END;/* CMZMREG */                                             0347 01111000
*    END ;                                                         0348 01112000
*    END CPHSUB34;                                                 0349 01113000
@EL00004 DS    0H                                                  0349 01114000
@EF00004 DS    0H                                                  0349 01115000
@ER00004 BR    @14                                                 0349 01116000
*/********************************************************************/ 01117000
*/*                                                                  */ 01118000
*/*        CPHSUB05: FUNCTION 5 ROUTINE                              */ 01119000
*/*                                                                  */ 01120000
*/********************************************************************/ 01121000
*                                                                  0350 01122000
*  CPHSUB05: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                   0350 01123000
CPHSUB05 DS    0H                                                  0351 01124000
*  /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                        0351 01125000
*   DO;                                                            0351 01126000
*  DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */           0352 01127000
*                                                                  0353 01128000
*  END;/* CMZMREG */                                               0353 01129000
*  CMZX9907 = GPR14P;                                              0354 01130000
         LR    CMZX9907,GPR14P                                     0354 01131000
*  DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                   0355 01132000
*                                                                  0356 01133000
*  END;/* CMZMREG */                                               0356 01134000
*  END ;                                                           0357 01135000
*                      /* R1=PARM STRING PTR R2=OUTPUT AREA PTR*/  0358 01136000
*/*  RESET COUNT FIELD AND LIMIT OF OUTPUT AREA (PHRF5NSP & CPHOALIM)*/ 01137000
*   PHRF5NSP=0;                                                    0358 01138000
         SLR   @10,@10                                             0358 01139000
         ST    @10,PHRF5NSP(,GPR02P)                               0358 01140000
*   CPHOALIM=(PHROALEN-(ADDR(PHRF5ENT(1))-GPR02P))/LENGTH(PHRF5ENT);    01141000
         LA    @10,PHRF5ENT(,GPR02P)                               0359 01142000
         SLR   @10,GPR02P                                          0359 01143000
         LR    @08,@10                                             0359 01144000
         LCR   @08,@08                                             0359 01145000
         AL    @08,PHROALEN(,GPR02P)                               0359 01146000
         SRDA  @08,32                                              0359 01147000
         D     @08,@CF00046                                        0359 01148000
         ST    @09,CPHOALIM                                        0359 01149000
*             /*PROCESS ENTRIES WHILE NO ERRORS*/                  0360 01150000
*LOOP5:                                                            0360 01151000
*   DO CPHOANDX=1 TO CPHOALIM WHILE(CPHLSTSP='0'B&CPHSYNER='0'B);  0360 01152000
LOOP5    LA    @10,1                                               0360 01153000
         B     @DE00360                                            0360 01154000
@DL00360 TM    CPHLSTSP,B'00000101'                                0360 01155000
         BNZ   @DC00360                                            0360 01156000
*      /*ICALL(CPHSUBSC)*/                                         0361 01157000
*      F5LOOP: DO;                                                 0361 01158000
F5LOOP   DS    0H                                                  0362 01159000
*      CALL CPHSUBSC;                                              0362 01160000
*                                                                  0362 01161000
         BAL   @14,CPHSUBSC                                        0362 01162000
*      END F5LOOP;     /* LOCATE NEXT SUBPARAM*/                   0363 01163000
*                  /*CPHSPPTR= SUBPARAM PTR CPHSPLEN= SUBPARAM LENGTH*/ 01164000
*      IF CPHSYNER='1'B         /* SYNTAX ERROR */                 0364 01165000
*         THEN;                 /*YES  */                          0364 01166000
         TM    CPHSYNER,B'00000001'                                0364 01167000
         BO    @RT00364                                            0364 01168000
*         ELSE DO;            /* NOT SYNTAX ERROR*/                0366 01169000
*            IF CPHSPPTR=0     /*PARM DEFAULTED*/                  0367 01170000
*               THEN;          /*YES*/                             0367 01171000
         L     @10,CPHSPPTR                                        0367 01172000
         LTR   @10,@10                                             0367 01173000
         BZ    @RT00367                                            0367 01174000
*               ELSE DO;             /*NOT DEFAULTED*/             0369 01175000
*                   /*ICALL(CPHVALCK)*/                            0370 01176000
*                    DO;                                           0370 01177000
*                   CALL CPHVALCK;                                 0371 01178000
*                                                                  0371 01179000
         BAL   @14,CPHVALCK                                        0371 01180000
*                   END ;  /* CHECK SUBPARAM VALIDITY*/            0372 01181000
*                  PHRF5VF(CPHOANDX)=CPHVALFG;/*SET VAL FLGS IN OUTARA* 01182000
         L     @10,CPHOANDX                                        0373 01183000
         SLA   @10,3                                               0373 01184000
         ALR   @10,GPR02P                                          0373 01185000
         MVC   PHRF5VF-8(1,@10),CPHVALFG                           0373 01186000
*               END;                 /*END NOT DEFAULTED*/         0374 01187000
*            PHRF5SL(CPHOANDX)=CPHSPLEN;/*SET LENGTH IN OUT AREA*/ 0375 01188000
@RT00367 L     @10,CPHOANDX                                        0375 01189000
         SLA   @10,3                                               0375 01190000
         LH    @09,CPHSPLEN                                        0375 01191000
         STH   @09,PHRF5SL-8(@10,GPR02P)                           0375 01192000
*            PHRF5SPT(CPHOANDX)=CPHSPPTR;/*PUT PTR IN OUT AREA*/   0376 01193000
         L     @09,CPHSPPTR                                        0376 01194000
         ST    @09,PHRF5SPT-8(@10,GPR02P)                          0376 01195000
*            PHRF5NSP=PHRF5NSP+1;   /*INCR COUNT*/                 0377 01196000
         LA    @10,1                                               0377 01197000
         AL    @10,PHRF5NSP(,GPR02P)                               0377 01198000
         ST    @10,PHRF5NSP(,GPR02P)                               0377 01199000
*         END;                  /*END NOT SYNTAX ERROR*/           0378 01200000
*   END LOOP5;                  /*END DO WHILE*/                   0379 01201000
@RT00364 LA    @10,1                                               0379 01202000
         AL    @10,CPHOANDX                                        0379 01203000
@DE00360 ST    @10,CPHOANDX                                        0379 01204000
         C     @10,CPHOALIM                                        0379 01205000
         BNH   @DL00360                                            0379 01206000
@DC00360 DS    0H                                                  0380 01207000
*   IF CPHOANDX>CPHOALIM /*OVER FLOW AND NOT END OF LIST*/         0380 01208000
*      THEN                     /*YES */                           0380 01209000
         L     @10,CPHOANDX                                        0380 01210000
         C     @10,CPHOALIM                                        0380 01211000
         BNH   @RF00380                                            0380 01212000
*         CPHOFLOW='1'B;        /*SET OVERFLOW FLAG*/              0381 01213000
         OI    CPHOFLOW,B'10000000'                                0381 01214000
*      ELSE;                    /*NOT OVERFLOW*/                   0382 01215000
@RF00380 DS    0H                                                  0383 01216000
*    /*CMZPEND*/                                                   0383 01217000
*     DO;                                                          0383 01218000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0384 01219000
*                                                                  0385 01220000
*    END;/* CMZMREG */                                             0385 01221000
*    GPR14P = CMZX9907;                                            0386 01222000
         LR    GPR14P,CMZX9907                                     0386 01223000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0387 01224000
*                                                                  0388 01225000
*    END;/* CMZMREG */                                             0388 01226000
*    END ;                                                         0389 01227000
*    END CPHSUB05;                                                 0390 01228000
@EL00005 DS    0H                                                  0390 01229000
@EF00005 DS    0H                                                  0390 01230000
@ER00005 BR    @14                                                 0390 01231000
*/********************************************************************/ 01232000
*/*                                                                  */ 01233000
*/*        CPHSUB06: FUNCTION 6 ROUTINE                              */ 01234000
*/*                                                                  */ 01235000
*/********************************************************************/ 01236000
*   CPHSUB06: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0391 01237000
CPHSUB06 DS    0H                                                  0392 01238000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0392 01239000
*    DO;                                                           0392 01240000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0393 01241000
*                                                                  0394 01242000
*   END;/* CMZMREG */                                              0394 01243000
*   CMZX9908 = GPR14P;                                             0395 01244000
         LR    CMZX9908,GPR14P                                     0395 01245000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0396 01246000
*                                                                  0397 01247000
*   END;/* CMZMREG */                                              0397 01248000
*   END ;                                                          0398 01249000
*                            /* R1=PARM STRING POINTER */          0399 01250000
*   DO WHILE (CPHLSTSP='0'B & CPHSYNER='0'B);    /*PROCESS PARMS*/ 0399 01251000
         B     @DE00399                                            0399 01252000
@DL00399 DS    0H                                                  0400 01253000
*     /*ICALL(CPHSUBSC)*/                                          0400 01254000
*     F6LOOP: DO;                                                  0400 01255000
F6LOOP   DS    0H                                                  0401 01256000
*     CALL CPHSUBSC;                                               0401 01257000
*                                                                  0401 01258000
         BAL   @14,CPHSUBSC                                        0401 01259000
*     END F6LOOP;   /*LOCATE NEXT SUBPARAM              */         0402 01260000
*   END;                   /*END DO WHILE*/                        0403 01261000
@DE00399 TM    CPHLSTSP,B'00000101'                                0403 01262000
         BZ    @DL00399                                            0403 01263000
*    /*CMZPEND*/                                                   0404 01264000
*     DO;                                                          0404 01265000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0405 01266000
*                                                                  0406 01267000
*    END;/* CMZMREG */                                             0406 01268000
*    GPR14P = CMZX9908;                                            0407 01269000
         LR    GPR14P,CMZX9908                                     0407 01270000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0408 01271000
*                                                                  0409 01272000
*    END;/* CMZMREG */                                             0409 01273000
*    END ;                                                         0410 01274000
*    END CPHSUB06;                                                 0411 01275000
@EL00006 DS    0H                                                  0411 01276000
@EF00006 DS    0H                                                  0411 01277000
@ER00006 BR    @14                                                 0411 01278000
*/*******************************************************************/  01279000
*/*                                                                  */ 01280000
*/*       CPHSUB07: FUNCTIONS 7 AND 8 ROUTINE                        */ 01281000
*/*                                                                  */ 01282000
*/********************************************************************/ 01283000
*                                                                  0412 01284000
*   CPHSUB07: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0412 01285000
CPHSUB07 DS    0H                                                  0413 01286000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0413 01287000
*    DO;                                                           0413 01288000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0414 01289000
*                                                                  0415 01290000
*   END;/* CMZMREG */                                              0415 01291000
*   CMZX9909 = GPR14P;                                             0416 01292000
         LR    CMZX9909,GPR14P                                     0416 01293000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0417 01294000
*                                                                  0418 01295000
*   END;/* CMZMREG */                                              0418 01296000
*   END ;                                                          0419 01297000
* /*RESET COUNT FIELD AND LIMIT IN OUTPUT AREA (PHRF7NSP & CPHOALIM)*/  01298000
* IF CPHFUNNO=CPHFUN07 THEN DO;                            /*@D32CKKA*/ 01299000
         TM    CPHFUNNO,B'00000111'                                0420 01300000
         BNO   @RF00420                                            0420 01301000
         TM    CPHFUNNO,B'00001000'                                0420 01302000
         BNZ   @RF00420                                            0420 01303000
*   PHRF7NSP=0;                                                    0422 01304000
         SLR   @10,@10                                             0422 01305000
         ST    @10,PHRF7NSP(,GPR02P)                               0422 01306000
*   CPHOALIM=(PHROALEN-(ADDR(PHRF7NUM(1))-GPR02P))/LENGTH(PHRF7NUM);    01307000
         LA    @10,PHRF7NUM(,GPR02P)                               0423 01308000
         SLR   @10,GPR02P                                          0423 01309000
         LCR   @10,@10                                             0423 01310000
         AL    @10,PHROALEN(,GPR02P)                               0423 01311000
         ST    @10,CPHOALIM                                        0423 01312000
*    END;                                                  /*@D32CKKA*/ 01313000
* ELSE DO;                          /*DO SAME FOR FUNCTION 8 @D32CKKA*/ 01314000
         B     @RC00420                                            0425 01315000
@RF00420 DS    0H                                                  0426 01316000
*   PHRF8NSP=0;                                            /*@D32CKKA*/ 01317000
         SLR   @10,@10                                             0426 01318000
         ST    @10,PHRF8NSP(,GPR02P)                               0426 01319000
*   CPHOALIM=(PHROALEN-(ADDR(PHRF8ENT(1))-GPR02P))/LENGTH(PHRF8ENT);    01320000
         LA    @10,PHRF8ENT(,GPR02P)                               0427 01321000
         SLR   @10,GPR02P                                          0427 01322000
         LR    @08,@10                                             0427 01323000
         LCR   @08,@08                                             0427 01324000
         AL    @08,PHROALEN(,GPR02P)                               0427 01325000
         SRDA  @08,32                                              0427 01326000
         D     @08,@CF00311                                        0427 01327000
         ST    @09,CPHOALIM                                        0427 01328000
*    END;                                                  /*@D32CKKA*/ 01329000
*                      /*  R1=PARM STRING PTR R2=OUTPUT AREA PTR*/ 0429 01330000
*LOOP7:                                                            0429 01331000
*   DO CPHOANDX=1 TO CPHOALIM WHILE(CPHLSTSP='0'B&CPHFUNER='0'B&   0429 01332000
*         CPHSYNER='0'B);/*PROCESS ENTRIES*/                       0429 01333000
@RC00420 DS    0H                                                  0429 01334000
LOOP7    LA    @10,1                                               0429 01335000
         B     @DE00429                                            0429 01336000
@DL00429 TM    CPHLSTSP,B'00000100'                                0429 01337000
         BNZ   @DC00429                                            0429 01338000
         TM    CPHFUNER,B'01000000'                                0429 01339000
         BNZ   @DC00429                                            0429 01340000
         TM    CPHSYNER,B'00000001'                                0429 01341000
         BNZ   @DC00429                                            0429 01342000
*      /*ICALL(CPHSUBSC)*/                                         0430 01343000
*      F7LOOP: DO;                                                 0430 01344000
F7LOOP   DS    0H                                                  0431 01345000
*      CALL CPHSUBSC;                                              0431 01346000
*                                                                  0431 01347000
         BAL   @14,CPHSUBSC                                        0431 01348000
*      END F7LOOP;            /* LOCATE NEXT SUBPARAM*/            0432 01349000
*                  /* CPHSPPTR= SUBPARAM PTR CPHSPLEN= SUBPARAM LENGTH* 01350000
*      IF CPHSYNER='1'B              /*SYNTAX ERROR*/              0433 01351000
*         THEN;                     /*YES */                       0433 01352000
         TM    CPHSYNER,B'00000001'                                0433 01353000
         BO    @RT00433                                            0433 01354000
*         ELSE DO;                   /*NOT SYNTAX ERROR*/          0435 01355000
*            CPHVALBT=CPHVALBT|'40'X;   /*CHECK FOR NUMERICS @DM12920*/ 01356000
         OI    CPHVALBT,X'40'                                      0436 01357000
*            IF CPHSPPTR*CPHSPLEN=0 /*SUB PARM DEFAULTED*/         0437 01358000
*             THEN IF CPHFUNNO=CPHFUN07  /*DEFAULTED AND F7  @D32CKKA*/ 01359000
         L     @10,CPHSPPTR                                        0437 01360000
         MH    @10,CPHSPLEN                                        0437 01361000
         LTR   @10,@10                                             0437 01362000
         BNZ   @RF00437                                            0437 01363000
*               THEN CPHFUNER='1'B;  /*SET FUNCTION ERROR    @D32CKKA*/ 01364000
         TM    CPHFUNNO,B'00000111'                                0438 01365000
         BNO   @RF00438                                            0438 01366000
         TM    CPHFUNNO,B'00001000'                                0438 01367000
         BNZ   @RF00438                                            0438 01368000
         OI    CPHFUNER,B'01000000'                                0439 01369000
*               ELSE DO;               /*DEFAULTED AND FUNC8 @D32CKKA*/ 01370000
         B     @RC00438                                            0440 01371000
@RF00438 DS    0H                                                  0441 01372000
*                 PHRF8DFT(CPHOANDX)='1'B;  /*DEFAULT FLG ON @D32CKKA*/ 01373000
         L     @10,CPHOANDX                                        0441 01374000
         ALR   @10,@10                                             0441 01375000
         ST    @10,@TF00001                                        0441 01376000
         ALR   @10,GPR02P                                          0441 01377000
         OI    PHRF8DFT-2(@10),B'10000000'                         0441 01378000
*                 PHRF8NSP=PHRF8NSP+1;   /*INC SUBPARM COUNT @D32CKKA*/ 01379000
         LA    @10,1                                               0442 01380000
         AL    @10,PHRF8NSP(,GPR02P)                               0442 01381000
         ST    @10,PHRF8NSP(,GPR02P)                               0442 01382000
*                 PHRF8NUM(CPHOANDX)='00'X;    /*CLEAR VALUE @D32CKKA*/ 01383000
         SLR   @10,@10                                             0443 01384000
         L     @09,@TF00001                                        0443 01385000
         STC   @10,PHRF8NUM-2(@09,GPR02P)                          0443 01386000
*                 END;                                     /*@D32CKKA*/ 01387000
*               ELSE DO;       /*NOT DEFAULTED*/                   0445 01388000
         B     @RC00437                                            0445 01389000
@RF00437 DS    0H                                                  0446 01390000
*                   /*ICALL(CPHVALCK)*/                            0446 01391000
*                    DO;                                           0446 01392000
*                   CALL CPHVALCK;                                 0447 01393000
*                                                                  0447 01394000
         BAL   @14,CPHVALCK                                        0447 01395000
*                   END ;     /*CHECK SUBPARAM FOR NUMERIC*/       0448 01396000
*                  IF CPHVALNU='1'B |  /*NOT NUMERIC         @DM10621*/ 01397000
*                     CPHVALAN='1'B /*OR NOT ALPHA NUMERIC   @DM10621*/ 01398000
*                     THEN               /*YES*/                   0449 01399000
         TM    CPHVALNU,B'01100000'                                0449 01400000
         BZ    @RF00449                                            0449 01401000
*                        CPHFUNER='1'B;   /*SET FUNCTION ERROR*/   0450 01402000
         OI    CPHFUNER,B'01000000'                                0450 01403000
*                     ELSE DO;   /*NOT AN ERROR*/                  0451 01404000
         B     @RC00449                                            0451 01405000
@RF00449 DS    0H                                                  0452 01406000
*                        IF CPHSPLEN>3 /*GR THAN 3 CHAR*/          0452 01407000
*                           THEN      /*YES*/                      0452 01408000
         LH    @10,CPHSPLEN                                        0452 01409000
         C     @10,@CF00182                                        0452 01410000
         BNH   @RF00452                                            0452 01411000
*                              CPHFUNER='1'B;  /*SET FUNCT ERROR*/ 0453 01412000
         OI    CPHFUNER,B'01000000'                                0453 01413000
*                           ELSE DO;  /*NOT GR TAHN 3*/            0454 01414000
         B     @RC00452                                            0454 01415000
@RF00452 DS    0H                                                  0455 01416000
*                               /* CONVERT DECIMAL SUBPARAM TO HEX*/    01417000
*                              CPHDECHX='000';/* INIT HOLD AREA     */  01418000
         MVC   CPHDECHX(3),@CC00291                                0455 01419000
*                              CPHDECHX(4-CPHSPLEN:3)=     /*MOVE NO.*/ 01420000
*                              CPHSPPTR->CPHSBYTE(1:CPHSPLEN);     0456 01421000
         LA    @10,4                                               0456 01422000
         SH    @10,CPHSPLEN                                        0456 01423000
         LA    @09,CPHDECHX-1(@10)                                 0456 01424000
         LCR   @10,@10                                             0456 01425000
         AL    @10,@CF00182                                        0456 01426000
         L     @08,CPHSPPTR                                        0456 01427000
         EX    @10,@SM00453                                        0456 01428000
*                              PACK(CPHDECHX,CPHDECHX);            0457 01429000
         PACK  CPHDECHX(3),CPHDECHX(3)                             0457 01430000
*                                     /* PACK EBCDIC TO DIGITS + SIGN*/ 01431000
*                              CVB(GPR15F,CPHDECHX);               0458 01432000
         XC    @TS00001(8),@TS00001                                0458 01433000
         MVC   @TS00001+5(3),CPHDECHX                              0458 01434000
         CVB   GPR15F,@TS00001                                     0458 01435000
*                                     /* PUT HEX VALUE IN REGISTER 1*/  01436000
*                              IF GPR15F>255 /*PARM GR THAN 255*/  0459 01437000
*                                 THEN    /*YES*/                  0459 01438000
         C     GPR15F,@CF00294                                     0459 01439000
         BNH   @RF00459                                            0459 01440000
*                                    CPHFUNER='1'B;/*SET FUNCTION ERR*/ 01441000
         OI    CPHFUNER,B'01000000'                                0460 01442000
*                                   ELSE IF CPHFUNNO=CPHFUN07      0461 01443000
*                                    THEN DO;             /*@D32CKKA*/  01444000
         B     @RC00459                                            0461 01445000
@RF00459 TM    CPHFUNNO,B'00000111'                                0461 01446000
         BNO   @RF00461                                            0461 01447000
         TM    CPHFUNNO,B'00001000'                                0461 01448000
         BNZ   @RF00461                                            0461 01449000
*                                   /* MOVE HEX BYTE TO OUTPUT AREA*/   01450000
*                                     PHRF7NUM(CPHOANDX)=GPR15F;   0463 01451000
         L     @10,CPHOANDX                                        0463 01452000
         STC   GPR15F,PHRF7NUM-1(@10,GPR02P)                       0463 01453000
*                                     PHRF7NSP=PHRF7NSP+1;/*INCR CNT*/  01454000
         LA    @10,1                                               0464 01455000
         AL    @10,PHRF7NSP(,GPR02P)                               0464 01456000
         ST    @10,PHRF7NSP(,GPR02P)                               0464 01457000
*                                     END;  /*END FUNC 7 @D32CKKA*/     01458000
*                                    ELSE DO; /*FUNC 8 @D32CKKA*/  0466 01459000
         B     @RC00461                                            0466 01460000
@RF00461 DS    0H                                                  0467 01461000
*                                      /*MOVE DATA TO OUTPUT AREA*/     01462000
*                                     PHRF8NUM(CPHOANDX)=GPR15F;   0467 01463000
         L     @10,CPHOANDX                                        0467 01464000
         ALR   @10,@10                                             0467 01465000
         STC   GPR15F,PHRF8NUM-2(@10,GPR02P)                       0467 01466000
*                                     PHRF8NSP=PHRF8NSP+1; /*@D32CKKA*/ 01467000
         LA    @09,1                                               0468 01468000
         AL    @09,PHRF8NSP(,GPR02P)                               0468 01469000
         ST    @09,PHRF8NSP(,GPR02P)                               0468 01470000
*                                     PHRF8DFT(CPHOANDX)='0'B;     0469 01471000
         ALR   @10,GPR02P                                          0469 01472000
         NI    PHRF8DFT-2(@10),B'01111111'                         0469 01473000
*                                     /*INC NUMBER OF PARMS AND CLEAR*/ 01474000
*                                     /*DEFAULT FLAG        @D32CKKA*/  01475000
*                                     END; /*END FUNC 8 @D32CKKA*/ 0470 01476000
*                           END;         /*END NOT GR THAN 3*/     0471 01477000
@RC00461 DS    0H                                                  0471 01478000
@RC00459 DS    0H                                                  0472 01479000
*                     END;               /*END NO ERRORS*/         0472 01480000
@RC00452 DS    0H                                                  0473 01481000
*               END;                     /*END NOT DEFAULTED*/     0473 01482000
@RC00449 DS    0H                                                  0474 01483000
*         END;                           /*END NOT SYNTAX ERROR*/  0474 01484000
@RC00437 DS    0H                                                  0475 01485000
*   END LOOP7;                            /*END DO WHILE*/         0475 01486000
@RT00433 LA    @10,1                                               0475 01487000
         AL    @10,CPHOANDX                                        0475 01488000
@DE00429 ST    @10,CPHOANDX                                        0475 01489000
         C     @10,CPHOALIM                                        0475 01490000
         BNH   @DL00429                                            0475 01491000
@DC00429 DS    0H                                                  0476 01492000
*   IF CPHOANDX>CPHOALIM                 /*OVERFLOW*/              0476 01493000
*      THEN                             /*YES*/                    0476 01494000
         L     @10,CPHOANDX                                        0476 01495000
         C     @10,CPHOALIM                                        0476 01496000
         BNH   @RF00476                                            0476 01497000
*         CPHOFLOW='1'B;                /*SET OVERFLOW FLG*/       0477 01498000
         OI    CPHOFLOW,B'10000000'                                0477 01499000
*      ELSE;                            /*NOT OVERFLOW*/           0478 01500000
@RF00476 DS    0H                                                  0479 01501000
*  /*CMZPEND*/                                                     0479 01502000
*   DO;                                                            0479 01503000
*  DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                   0480 01504000
*                                                                  0481 01505000
*  END;/* CMZMREG */                                               0481 01506000
*  GPR14P = CMZX9909;                                              0482 01507000
         LR    GPR14P,CMZX9909                                     0482 01508000
*  DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */            0483 01509000
*                                                                  0484 01510000
*  END;/* CMZMREG */                                               0484 01511000
*  END ;                                                           0485 01512000
*  END CPHSUB07;                                                   0486 01513000
@EL00007 DS    0H                                                  0486 01514000
@EF00007 DS    0H                                                  0486 01515000
@ER00007 BR    @14                                                 0486 01516000
*/********************************************************************/ 01517000
*/*                                                                  */ 01518000
*/*      CPHTBLSC: TABLE SEARCH ROUTINE                              */ 01519000
*/*                                                                  */ 01520000
*/********************************************************************/ 01521000
*   CPHTBLSC: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0487 01522000
CPHTBLSC DS    0H                                                  0488 01523000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0488 01524000
*    DO;                                                           0488 01525000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0489 01526000
*                                                                  0490 01527000
*   END;/* CMZMREG */                                              0490 01528000
*   CMZX9903 = GPR14P;                                             0491 01529000
         LR    CMZX9903,GPR14P                                     0491 01530000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0492 01531000
*                                                                  0493 01532000
*   END;/* CMZMREG */                                              0493 01533000
*   END ;                                                          0494 01534000
*   CPHTABSV=CPHTABAD;         /*SAVE TABLE PTR IN CPHTABSV*/      0495 01535000
         L     @10,CPHTABAD                                        0495 01536000
         ST    @10,CPHTABSV                                        0495 01537000
*   CPHARGNF='1'B;          /*INIT ARG NOT FOUND ON*/              0496 01538000
         OI    CPHARGNF,B'00100000'                                0496 01539000
*TBLOOP:                    /*SEARCH FOR ARG*/                     0497 01540000
*   DO CPHENCTR=1 TO CPHTABSV->CPHENTNO WHILE(CPHARGNF='1'B);      0497 01541000
TBLOOP   LA    @10,1                                               0497 01542000
         B     @DE00497                                            0497 01543000
@DL00497 TM    CPHARGNF,B'00100000'                                0497 01544000
         BNO   @DC00497                                            0497 01545000
*      IF CPHKEYWD(1)=CPHARGUM /*IS THIS THE CORRECT ONE*/         0498 01546000
*         THEN DO;             /*YES*/                             0498 01547000
         L     @10,CPHTABAD                                        0498 01548000
         CLC   CPHKEYWD(8,@10),CPHARGUM                            0498 01549000
         BNE   @RF00498                                            0498 01550000
*            CPHSUBVL(1:CPHTABSV->CPHENTLN-8)=CPHFUNBT(1,1:CPHTABSV->   01551000
*             CPHENTLN-8);    /*MOVE ENTRY MINUS FIRST 8*/         0500 01552000
         L     @09,CPHTABSV                                        0500 01553000
         ICM   @09,12,CPHENTLN(@09)                                0500 01554000
         SRA   @09,16                                              0500 01555000
         SL    @09,@CF00268                                        0500 01556000
         EX    @09,@SM00456                                        0500 01557000
*            CPHARGNF='0'B;    /*RESET ARG NOT FOUND FLG*/         0501 01558000
         NI    CPHARGNF,B'11011111'                                0501 01559000
*         END;                 /*END CORRECT ENTRY*/               0502 01560000
*         ELSE                 /*NOT CORRECT ENTRY*/               0503 01561000
*            CPHTABAD=CPHTABSV->CPHENTLN+CPHTABAD;/*GET NEXT ENTRY*/    01562000
         B     @RC00498                                            0503 01563000
@RF00498 L     @10,CPHTABSV                                        0503 01564000
         ICM   @10,12,CPHENTLN(@10)                                0503 01565000
         SRA   @10,16                                              0503 01566000
         AL    @10,CPHTABAD                                        0503 01567000
         ST    @10,CPHTABAD                                        0503 01568000
*   END TBLOOP;                                                    0504 01569000
@RC00498 LA    @10,1                                               0504 01570000
         AH    @10,CPHENCTR                                        0504 01571000
@DE00497 STH   @10,CPHENCTR                                        0504 01572000
         L     @09,CPHTABSV                                        0504 01573000
         ICM   @09,12,CPHENTNO(@09)                                0504 01574000
         SRA   @09,16                                              0504 01575000
         CR    @10,@09                                             0504 01576000
         BNH   @DL00497                                            0504 01577000
@DC00497 DS    0H                                                  0505 01578000
*   /*CMZPEND*/                                                    0505 01579000
*   TBR: DO;                                                       0505 01580000
TBR      DS    0H                                                  0506 01581000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0506 01582000
*                                                                  0507 01583000
*   END;/* CMZMREG */                                              0507 01584000
*   GPR14P = CMZX9903;                                             0508 01585000
         LR    GPR14P,CMZX9903                                     0508 01586000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0509 01587000
*                                                                  0510 01588000
*   END;/* CMZMREG */                                              0510 01589000
*   END TBR;                                                       0511 01590000
*   END CPHTBLSC;                                                  0512 01591000
@EL00008 DS    0H                                                  0512 01592000
@EF00008 DS    0H                                                  0512 01593000
@ER00008 BR    @14                                                 0512 01594000
*/********************************************************************/ 01595000
*/*                                                                  */ 01596000
*/*      CPHVALCK: VALIDITY CHECK ROUTINE                            */ 01597000
*/*                                                                  */ 01598000
*/********************************************************************/ 01599000
*                                                                  0513 01600000
*   CPHVALCK: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0513 01601000
CPHVALCK DS    0H                                                  0514 01602000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0514 01603000
*    DO;                                                           0514 01604000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0515 01605000
*                                                                  0516 01606000
*   END;/* CMZMREG */                                              0516 01607000
*   CMZX9910 = GPR14P;                                             0517 01608000
         LR    CMZX9910,GPR14P                                     0517 01609000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0518 01610000
*                                                                  0519 01611000
*   END;/* CMZMREG */                                              0519 01612000
*   END ;                  /*@DM30483*/                            0520 01613000
*   CPHVCK01=GPR01P;           /* SAVE REG01                 @DM30483*/ 01614000
         ST    GPR01P,CPHVCK01                                     0521 01615000
*   CPHVCK02=GPR02P;           /* SAVE REG02                 @DM30483*/ 01616000
         ST    GPR02P,CPHVCK02                                     0522 01617000
*   CPHVALFG='00'X;            /* RESET ERROR INDICATORS*/         0523 01618000
         MVI   CPHVALFG,X'00'                                      0523 01619000
*   IF CPHVALBT(1:4)='0000'B   /*VAL CHECKING CALLED FOR*/         0524 01620000
*      THEN;                   /*NO*/                              0524 01621000
         TM    CPHVALBT,B'11110000'                                0524 01622000
         BZ    @RT00524                                            0524 01623000
*      ELSE DO;                /*YES*/                             0526 01624000
*         CPHVALPS=1;           /*INIT SUBPARAM STRING POINTER*/   0527 01625000
         MVC   CPHVALPS(4),@CF00048                                0527 01626000
*         IF CPHFUNFC='1'B   /*CK 1ST CHAR ALPHA*/                 0528 01627000
*            THEN DO;           /*YES*/                            0528 01628000
         TM    CPHFUNFC,B'00010000'                                0528 01629000
         BNO   @RF00528                                            0528 01630000
*                          /* TRT CHAR. TO CLASSIFY TYPE*/         0530 01631000
*               GPR02F=0;     /* INIT TRT CODE REGISTER TO ZERO*/  0530 01632000
         SLR   GPR02F,GPR02F                                       0530 01633000
*               TRT(CPHSPPTR->CPHSBYTE(1),CPHVTRTB);               0531 01634000
         L     @10,CPHSPPTR                                        0531 01635000
         TRT   CPHSBYTE(1,@10),CPHVTRTB                            0531 01636000
*               IF GPR02F=1    /*IS CHAR ALPHA*/                   0532 01637000
*                  THEN DO;             /*YES*/                    0532 01638000
         LA    @10,1                                               0532 01639000
         CR    GPR02F,@10                                          0532 01640000
         BNE   @RF00532                                            0532 01641000
*                     IF CPHFUNAN='1'B /*CK ALPHA NUMERIC*/        0534 01642000
*                        THEN                 /*YES*/              0534 01643000
         TM    CPHFUNAN,B'00100000'                                0534 01644000
         BNO   @RF00534                                            0534 01645000
*                           CPHVALPS=CPHVALPS+1;/*INCR CHAR PTR*/  0535 01646000
         AL    @10,CPHVALPS                                        0535 01647000
         ST    @10,CPHVALPS                                        0535 01648000
*                         ELSE   /*NOT CK ALPHA NUMERIC*/          0536 01649000
*                            CPHVALPS=CPHSPLEN+1; /*SET END*/      0536 01650000
         B     @RC00534                                            0536 01651000
@RF00534 LA    @10,1                                               0536 01652000
         AH    @10,CPHSPLEN                                        0536 01653000
         ST    @10,CPHVALPS                                        0536 01654000
*                  END;        /*END CHAR ALPHA*/                  0537 01655000
*                  ELSE        /*NOT ALPHA*/                       0538 01656000
*                     CPHVALFC='1'B;         /* SET ERROR INDICATOR*/   01657000
         B     @RC00532                                            0538 01658000
@RF00532 OI    CPHVALFC,B'00010000'                                0538 01659000
*            END;               /*END CK FIRST CHAR ALPHA*/        0539 01660000
*            ELSE;              /*NOT CK FIRST ALPHA*/             0540 01661000
@RF00528 DS    0H                                                  0541 01662000
*                             /*VAL CK ENTRY*/                     0541 01663000
*VALLOOP:                                                          0541 01664000
*       DO CPHVALPS=CPHVALPS TO CPHSPLEN WHILE(CPHVALFG='00'X);    0541 01665000
@RC00528 DS    0H                                                  0541 01666000
VALLOOP  L     @10,CPHVALPS                                        0541 01667000
         B     @DE00541                                            0541 01668000
@DL00541 CLI   CPHVALFG,X'00'                                      0541 01669000
         BNE   @DC00541                                            0541 01670000
*          /* TRT CHAR. AT CPHVALPS USING CPHVTRTB TO FIND TYPE   */    01671000
*         GPR02F=0;             /*INIT TRT CODE REG TO 0*/         0542 01672000
         SLR   GPR02F,GPR02F                                       0542 01673000
*         TRT(CPHSPPTR->CPHSBYTE(CPHVALPS),CPHVTRTB);              0543 01674000
         L     @10,CPHSPPTR                                        0543 01675000
         AL    @10,CPHVALPS                                        0543 01676000
         BCTR  @10,0                                               0543 01677000
         TRT   CPHSBYTE(1,@10),CPHVTRTB                            0543 01678000
*         IF GPR02F=1           /*IS CHAR ALPHA*/                  0544 01679000
*             THEN DO;          /*YES*/                            0544 01680000
         C     GPR02F,@CF00048                                     0544 01681000
         BNE   @RF00544                                            0544 01682000
*                IF CPHFUNNU='1'B /*CHECK NUMERIC*/                0546 01683000
*                   THEN                /*YES*/                    0546 01684000
         TM    CPHFUNNU,B'01000000'                                0546 01685000
         BNO   @RF00546                                            0546 01686000
*                      CPHVALNU='1'B;   /*SET ERROR FLG*/          0547 01687000
         OI    CPHVALNU,B'01000000'                                0547 01688000
*                    ELSE;          /*NOT CHECK NUMERIC*/          0548 01689000
@RF00546 DS    0H                                                  0549 01690000
*             END;                 /*END CHAR ALPHA*/              0549 01691000
*             ELSE DO;           /*CHAR NOT ALPHA*/                0550 01692000
         B     @RC00544                                            0550 01693000
@RF00544 DS    0H                                                  0551 01694000
*                IF GPR02F=2  /*IS CHAR NUMERIC*/                  0551 01695000
*                   THEN;       /*YES*/                            0551 01696000
         C     GPR02F,@CF00311                                     0551 01697000
         BE    @RT00551                                            0551 01698000
*                   ELSE        /*NO*/                             0553 01699000
*                      CPHVALAN='1'B; /*SET ERROR FLG*/            0553 01700000
         OI    CPHVALAN,B'00100000'                                0553 01701000
*             END;              /*END CHAR NOT ALPHA*/             0554 01702000
@RT00551 DS    0H                                                  0555 01703000
*       END VALLOOP;                                               0555 01704000
@RC00544 LA    @10,1                                               0555 01705000
         AL    @10,CPHVALPS                                        0555 01706000
         ST    @10,CPHVALPS                                        0555 01707000
@DE00541 CH    @10,CPHSPLEN                                        0555 01708000
         BNH   @DL00541                                            0555 01709000
@DC00541 DS    0H                                                  0556 01710000
*     END;                                                         0556 01711000
*   GPR01P=CPHVCK01;           /* RESTORE REG01              @DM30483*/ 01712000
@RT00524 L     GPR01P,CPHVCK01                                     0557 01713000
*   GPR02P=CPHVCK02;           /* RESTORE REG02              @DM30483*/ 01714000
         L     GPR02P,CPHVCK02                                     0558 01715000
*   /*CMZPEND*/                                                    0559 01716000
*   VALR: DO;                                                      0559 01717000
VALR     DS    0H                                                  0560 01718000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0560 01719000
*                                                                  0561 01720000
*   END;/* CMZMREG */                                              0561 01721000
*   GPR14P = CMZX9910;                                             0562 01722000
         LR    GPR14P,CMZX9910                                     0562 01723000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0563 01724000
*                                                                  0564 01725000
*   END;/* CMZMREG */                                              0564 01726000
*   END VALR;                                                      0565 01727000
*   END CPHVALCK;                                                  0566 01728000
@EL00009 DS    0H                                                  0566 01729000
@EF00009 DS    0H                                                  0566 01730000
@ER00009 BR    @14                                                 0566 01731000
*/********************************************************************/ 01732000
*/*                                                                  */ 01733000
*/*       CPHSUBSC: SUBPARAMETER SCAN ROUTINE                        */ 01734000
*/*                                                                  */ 01735000
*/********************************************************************/ 01736000
*                                                                  0567 01737000
*   CPHSUBSC: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0567 01738000
CPHSUBSC DS    0H                                                  0568 01739000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0568 01740000
*    DO;                                                           0568 01741000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0569 01742000
*                                                                  0570 01743000
*   END;/* CMZMREG */                                              0570 01744000
*   CMZX9902 = GPR14P;                                             0571 01745000
         LR    CMZX9902,GPR14P                                     0571 01746000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0572 01747000
*                                                                  0573 01748000
*   END;/* CMZMREG */                                              0573 01749000
*   END ;                  /*@DM30483*/                            0574 01750000
*   CPHSCN00=GPR00P;           /* SAVE REG00                 @DM30483*/ 01751000
         ST    GPR00P,CPHSCN00                                     0575 01752000
*   CPHSCN02=GPR02P;           /* SAVE REG02                 @DM30483*/ 01753000
         ST    GPR02P,CPHSCN02                                     0576 01754000
*                              /*  REG1= ADDR OF PARM STRING*/     0577 01755000
*   CPHTCHAR=0;                /*   SET CPHTCHAR = X'00'*/         0577 01756000
         MVI   CPHTCHAR,X'00'                                      0577 01757000
*                 /* RESET CPHENDSP, CPHSPLEN, CPHSBPAR, AND CPHSPPTR*/ 01758000
*   CPHSPLEN=0;                                                    0578 01759000
         SLR   @10,@10                                             0578 01760000
         STH   @10,CPHSPLEN                                        0578 01761000
*   CPHSPPTR=0;                                                    0579 01762000
         ST    @10,CPHSPPTR                                        0579 01763000
*   CPHENDSP='0'B;                                                 0580 01764000
         NI    CPHENDSP,B'11110111'                                0580 01765000
*   CPHSBPAR=0;                                                    0581 01766000
         STH   @10,CPHSBPAR                                        0581 01767000
*   IF GPR01P->CPHSBYTE(1)=' '&CPHKWSCN='1'B /*BLNK IN SCAN*/      0582 01768000
*      THEN                  /*YES BLANK WHILE SCANNING*/          0582 01769000
         CLI   CPHSBYTE(GPR01P),C' '                               0582 01770000
         BNE   @RF00582                                            0582 01771000
         TM    CPHKWSCN,B'00100000'                                0582 01772000
         BNO   @RF00582                                            0582 01773000
*         CPHENDST='1'B;     /*SET STRING EXHAUSTED*/              0583 01774000
         OI    CPHENDST,B'00010000'                                0583 01775000
*      ELSE DO;              /*NOT STRING EXHAUSTED*/              0584 01776000
         B     @RC00582                                            0584 01777000
@RF00582 DS    0H                                                  0585 01778000
*SS1:                                                              0585 01779000
*         IF CPHKWSCN='1'B   /*ARE WE SCANNING A KWD*/             0585 01780000
*            THEN            /*YES*/                               0585 01781000
SS1      TM    CPHKWSCN,B'00100000'                                0585 01782000
         BNO   @RF00585                                            0585 01783000
*               CPHKWPTR=GPR01P; /*PUT STRING PTR IN WKPTR*/       0586 01784000
         ST    GPR01P,CPHKWPTR                                     0586 01785000
*            ELSE;               /*NOT KWD SCAN*/                  0587 01786000
@RF00585 DS    0H                                                  0588 01787000
*SS5:                                       /*DOWHILE NOT END OF SCAN*/ 01788000
*         DO WHILE(CPHENDSP='0'B&CPHSYNER='0'B)|(CPHLSTSP='1'B &   0588 01789000
*             CPHSLIST='1'B&CPHSYNER='0'B);                        0588 01790000
SS5      B     @DE00588                                            0588 01791000
@DL00588 DS    0H                                                  0589 01792000
*            /*ICALL(CPHSBTRT)*/                                   0589 01793000
*             DO;                                                  0589 01794000
*            CALL CPHSBTRT;                                        0590 01795000
*                                                                  0590 01796000
         BAL   @14,CPHSBTRT                                        0590 01797000
*            END ;          /* TRT:SCAN TO NEXT DELIMITER*/        0591 01798000
*            CPHTCHAR=GPR02F;       /*SAVE CHAR CODE IN TCHAR*/    0592 01799000
         STC   GPR02F,CPHTCHAR                                     0592 01800000
*                  /* CALCULATE TABLE INDEX FROM CPHTCHAR & CPHLCHAR*/  01801000
*            CPHSCNPT=CPHSCNTB(CPHTCHAR+1,CPHLCHAR+1);             0593 01802000
         SLR   @10,@10                                             0593 01803000
         IC    @10,CPHTCHAR                                        0593 01804000
         MH    @10,@CH00080                                        0593 01805000
         SLR   @09,@09                                             0593 01806000
         IC    @09,CPHLCHAR                                        0593 01807000
         ALR   @10,@09                                             0593 01808000
         SLA   @10,2                                               0593 01809000
         L     @10,CPHSCNTB(@10)                                   0593 01810000
         ST    @10,CPHSCNPT                                        0593 01811000
*             /*ICALL(CPHSCNPT)FLOWS(CPHCSP01,CPHCSP02,CPHCSP03,CPHCSP0 01812000
*,CPHCSP05,CPHCSP06,CPHCSP07,CPHCSP08,CPHCSP13,CPHCSP09,CPHCSP10,CPHCSP 01813000
*2,CPHCSP14)*/                                                     0594 01814000
*              DO;                                                 0594 01815000
*             DCL CMZP0229 BASED ENTRY VALRG (CPHCSP01,CPHCSP02,CPHCSP0 01816000
*,CPHCSP04,CPHCSP05,CPHCSP06,CPHCSP07,CPHCSP08,CPHCSP13,CPHCSP09,CPHCSP 01817000
*0,CPHCSP12,CPHCSP14) ;                                            0595 01818000
*             CALL CPHSCNPT-> CMZP0229 ;                           0596 01819000
*                                                                  0596 01820000
         LR    @15,@10                                             0596 01821000
         BALR  @14,@15                                             0596 01822000
*             END ;  /* GO TO SUB-PROCESSOR*/                      0597 01823000
*            IF CPHSYNER='1'B|CPHTCHAR=6 /*SYNTAX ERR OR BLNK CHAR*/    01824000
*               THEN;                /*YES*/                       0598 01825000
         TM    CPHSYNER,B'00000001'                                0598 01826000
         BO    @RT00598                                            0598 01827000
         CLI   CPHTCHAR,6                                          0598 01828000
         BE    @RT00598                                            0598 01829000
*               ELSE DO;             /*NOT SYNTAX OR BLANK*/       0600 01830000
*                  CPHLCHAR=CPHTCHAR; /*PUT CURRENT  CHAR IN LAST CHAR* 01831000
         IC    @10,CPHTCHAR                                        0601 01832000
         STC   @10,CPHLCHAR                                        0601 01833000
*                  GPR01P=GPR01P+1;   /*INCREMENT STRING PTR*/     0602 01834000
         AL    GPR01P,@CF00048                                     0602 01835000
*                END;                 /*END NOT SYNTAX OR BLANK*/  0603 01836000
*         END SS5;                    /*END DO WHILE*/             0604 01837000
@RT00598 DS    0H                                                  0604 01838000
@DE00588 TM    CPHENDSP,B'00001001'                                0604 01839000
         BZ    @DL00588                                            0604 01840000
         TM    CPHLSTSP,B'00000110'                                0604 01841000
         BNO   @DC00588                                            0604 01842000
         TM    CPHSYNER,B'00000001'                                0604 01843000
         BZ    @DL00588                                            0604 01844000
@DC00588 DS    0H                                                  0605 01845000
*      END;                           /*END NOT STRING EXHAUSTED*/ 0605 01846000
*/*******************************************************************/  01847000
*/*                                                                 */  01848000
*/*      CPHSBTRT: TRANSLATE AND TEST ROUTINE                       */  01849000
*/*                                                                 */  01850000
*/*******************************************************************/  01851000
*                                                                  0606 01852000
*   CPHSBTRT: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0606 01853000
         B     @PB00011                                            0606 01854000
CPHSBTRT DS    0H                                                  0607 01855000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0607 01856000
*    DO;                                                           0607 01857000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0608 01858000
*                                                                  0609 01859000
*   END;/* CMZMREG */                                              0609 01860000
*   CMZX9911 = GPR14P;                                             0610 01861000
         LR    CMZX9911,GPR14P                                     0610 01862000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0611 01863000
*                                                                  0612 01864000
*   END;/* CMZMREG */                                              0612 01865000
*   END ;                                                          0613 01866000
*   CPHCONT='1'B;               /* SET CONTINUE FLAG*/             0614 01867000
         OI    CPHCONT,B'01000000'                                 0614 01868000
*   CPHTRTSV=GPR01P;              /*    SAVE START PTR   */        0615 01869000
         ST    GPR01P,CPHTRTSV                                     0615 01870000
*   GPR03P=GPR01P;               /*  SET R3 = INPUT PARM STRING PTR*/   01871000
         LR    GPR03P,GPR01P                                       0616 01872000
*TR3:                                                              0617 01873000
*   DO WHILE(CPHCONT='1'B);       /* SCAN 256 BYTES FOR A DELIMITER*/   01874000
TR3      B     @DE00617                                            0617 01875000
@DL00617 DS    0H                                                  0618 01876000
*      GPR02F=0;                  /*CLEAR OUTPUT CODE REG*/        0618 01877000
         SLR   GPR02F,GPR02F                                       0618 01878000
*      TRT(GPR03P->CPHSBYTE(1:256),CPHTRTB);     /*TRANSLATE AND TEST*/ 01879000
         TRT   CPHSBYTE(256,GPR03P),CPHTRTB                        0619 01880000
*                                    /* NOTE: DELIMITERS ARE  )(,= */   01881000
*                              /*QUOTE OR BLANK CODE IN REG2 AFTER TRT* 01882000
*       IF GPR02F^=0                  /*  DELIMITER FOUND */       0620 01883000
*          THEN                         /*YES*/                    0620 01884000
         LTR   GPR02F,GPR02F                                       0620 01885000
         BZ    @RF00620                                            0620 01886000
*             CPHCONT='0'B;            /*RESET CONTINUE FLAG*/     0621 01887000
         NI    CPHCONT,B'10111111'                                 0621 01888000
*          ELSE                        /*NO DELIMITER YET*/        0622 01889000
*             GPR03P=GPR03P+256;     /* PREPARE TO SCAN NEXT 256 BYTES* 01890000
         B     @RC00620                                            0622 01891000
@RF00620 AL    GPR03P,@CF00139                                     0622 01892000
*   END TR3;                          /*END DO WHILE*/             0623 01893000
@RC00620 DS    0H                                                  0623 01894000
@DE00617 TM    CPHCONT,B'01000000'                                 0623 01895000
         BO    @DL00617                                            0623 01896000
*                                      /* R1= DELIM ADDR*/         0624 01897000
*   GPR04P=GPR01P-CPHTRTSV;             /*SET R4 = LEN OF SUB PARM*/    01898000
         L     @10,CPHTRTSV                                        0624 01899000
         LR    GPR04P,GPR01P                                       0624 01900000
         SLR   GPR04P,@10                                          0624 01901000
*   GPR03P=CPHTRTSV;                     /* RESTORE START PTR*/    0625 01902000
         LR    GPR03P,@10                                          0625 01903000
*   IF GPR01P^=CPHTRTSV                  /*WAS DELIMITER FIRST CHAR*/   01904000
*      THEN DO;                          /*NO*/                    0626 01905000
         CR    GPR01P,@10                                          0626 01906000
         BE    @RF00626                                            0626 01907000
*         GPR02F=0;                      /*SET NON DILIMITER CODE*/     01908000
         SLR   GPR02F,GPR02F                                       0628 01909000
*         GPR01P=GPR01P-1;           /*DECREMENT STRING PTR*/      0629 01910000
         BCTR  GPR01P,0                                            0629 01911000
*      END;                           /*END NOT FIRST SCANNED*/    0630 01912000
*      ELSE;                          /*YES FIRST CHAR WAS DELIMITER*/  01913000
@RF00626 DS    0H                                                  0632 01914000
*   /*CMZPEND*/                                                    0632 01915000
*   TR5: DO;                                                       0632 01916000
TR5      DS    0H                                                  0633 01917000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0633 01918000
*                                                                  0634 01919000
*   END;/* CMZMREG */                                              0634 01920000
*   GPR14P = CMZX9911;                                             0635 01921000
         LR    GPR14P,CMZX9911                                     0635 01922000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0636 01923000
*                                                                  0637 01924000
*   END;/* CMZMREG */                                              0637 01925000
*   END TR5;                                                       0638 01926000
*   END CPHSBTRT;                                                  0639 01927000
@EL00011 DS    0H                                                  0639 01928000
@EF00011 DS    0H                                                  0639 01929000
@ER00011 BR    @14                                                 0639 01930000
*/********************************************************************/ 01931000
*/*                                                                  */ 01932000
*/*        CPHCSP01: STORE SUBPARM PTR & LENGTH                      */ 01933000
*/*                                                                  */ 01934000
*/********************************************************************/ 01935000
*                                                                  0640 01936000
*   CPHCSP01: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0640 01937000
CPHCSP01 DS    0H                                                  0641 01938000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0641 01939000
*    DO;                                                           0641 01940000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0642 01941000
*                                                                  0643 01942000
*   END;/* CMZMREG */                                              0643 01943000
*   CMZX9912 = GPR14P;                                             0644 01944000
         LR    CMZX9912,GPR14P                                     0644 01945000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0645 01946000
*                                                                  0646 01947000
*   END;/* CMZMREG */                                              0646 01948000
*   END ;                                                          0647 01949000
*   IF CPHSPPTR^=0           /* START SUBPARM PTR ALREADY SET*/    0648 01950000
*       THEN;                /* YES */                             0648 01951000
         L     @10,CPHSPPTR                                        0648 01952000
         LTR   @10,@10                                             0648 01953000
         BNZ   @RT00648                                            0648 01954000
*       ELSE                 /*NO*/                                0650 01955000
*          CPHSPPTR=GPR03P;  /*SAVE PARM STRING PTR*/              0650 01956000
         ST    GPR03P,CPHSPPTR                                     0650 01957000
*   CPHSPLEN=GPR04P+CPHSPLEN;  /*ADD LENGTH OF SUB PARM */         0651 01958000
@RT00648 LR    @10,GPR04P                                          0651 01959000
         AH    @10,CPHSPLEN                                        0651 01960000
         STH   @10,CPHSPLEN                                        0651 01961000
*    /*CMZPEND*/                                                   0652 01962000
*     DO;                                                          0652 01963000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0653 01964000
*                                                                  0654 01965000
*    END;/* CMZMREG */                                             0654 01966000
*    GPR14P = CMZX9912;                                            0655 01967000
         LR    GPR14P,CMZX9912                                     0655 01968000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0656 01969000
*                                                                  0657 01970000
*    END;/* CMZMREG */                                             0657 01971000
*    END ;                                                         0658 01972000
*    END CPHCSP01;                                                 0659 01973000
@EL00012 DS    0H                                                  0659 01974000
@EF00012 DS    0H                                                  0659 01975000
@ER00012 BR    @14                                                 0659 01976000
*/********************************************************************/ 01977000
*/*                                                                  */ 01978000
*/*        CPHCSP02: END OF KEYWORD A                                */ 01979000
*/*                                                                  */ 01980000
*/********************************************************************/ 01981000
*                                                                  0660 01982000
*   CPHCSP02: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0660 01983000
CPHCSP02 DS    0H                                                  0661 01984000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0661 01985000
*    DO;                                                           0661 01986000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0662 01987000
*                                                                  0663 01988000
*   END;/* CMZMREG */                                              0663 01989000
*   CMZX9913 = GPR14P;                                             0664 01990000
         LR    CMZX9913,GPR14P                                     0664 01991000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0665 01992000
*                                                                  0666 01993000
*   END;/* CMZMREG */                                              0666 01994000
*   END ;                                                          0667 01995000
*   IF CPHKWSCN='1'B                  /*KWD SCAN ON*/              0668 01996000
*      THEN DO;                       /*YES */                     0668 01997000
         TM    CPHKWSCN,B'00100000'                                0668 01998000
         BNO   @RF00668                                            0668 01999000
*         CPHKWLEN=CPHSPLEN;          /*SET KWD LEN = SUB PARM LEN*/    02000000
         LH    @10,CPHSPLEN                                        0670 02001000
         STH   @10,CPHKWLEN                                        0670 02002000
*         CPHKWSCN='0'B;              /*   RESET KWD SCAN FLAG*/   0671 02003000
*         CPHENDSP='1'B;               /*    SET END OF SUBPARM*/  0672 02004000
         OI    CPHENDSP,B'00001000'                                0672 02005000
         NI    CPHKWSCN,B'11011111'                                0672 02006000
*      END;                            /*END KWD SCAN*/            0673 02007000
*      ELSE DO;                        /*NOT KWD SCAN*/            0674 02008000
         B     @RC00668                                            0674 02009000
@RF00668 DS    0H                                                  0675 02010000
*P2A:                                                              0675 02011000
*         IF CPHPARCT=0                /*BALANCED PARENS*/         0675 02012000
*            THEN                      /* YES */                   0675 02013000
P2A      LH    @10,CPHPARCT                                        0675 02014000
         LTR   @10,@10                                             0675 02015000
         BNZ   @RF00675                                            0675 02016000
*               CPHSYNER='1'B;         /*SET SYNTAX ERROR*/        0676 02017000
         OI    CPHSYNER,B'00000001'                                0676 02018000
*            ELSE                      /*NOT BALANCED PARENS*/     0677 02019000
*               CPHSPLEN=CPHSPLEN+1;   /*UP SUB PARM LEN BY 1*/    0677 02020000
         B     @RC00675                                            0677 02021000
@RF00675 LH    @10,CPHSPLEN                                        0677 02022000
         LA    @10,1(,@10)                                         0677 02023000
         STH   @10,CPHSPLEN                                        0677 02024000
*      END;                            /*END NOT KWD SCAN*/        0678 02025000
@RC00675 DS    0H                                                  0679 02026000
*   /*CMZPEND*/                                                    0679 02027000
*   P2C: DO;                                                       0679 02028000
@RC00668 DS    0H                                                  0679 02029000
P2C      DS    0H                                                  0680 02030000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0680 02031000
*                                                                  0681 02032000
*   END;/* CMZMREG */                                              0681 02033000
*   GPR14P = CMZX9913;                                             0682 02034000
         LR    GPR14P,CMZX9913                                     0682 02035000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0683 02036000
*                                                                  0684 02037000
*   END;/* CMZMREG */                                              0684 02038000
*   END P2C;                                                       0685 02039000
*   END CPHCSP02;                                                  0686 02040000
@EL00013 DS    0H                                                  0686 02041000
@EF00013 DS    0H                                                  0686 02042000
@ER00013 BR    @14                                                 0686 02043000
*/********************************************************************/ 02044000
*/*                                                                  */ 02045000
*/*         CPHCSP03: CHECK FOR LAST SUBPARM                         */ 02046000
*/*                                                                  */ 02047000
*/********************************************************************/ 02048000
*                                                                  0687 02049000
*   CPHCSP03: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0687 02050000
CPHCSP03 DS    0H                                                  0688 02051000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0688 02052000
*    DO;                                                           0688 02053000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0689 02054000
*                                                                  0690 02055000
*   END;/* CMZMREG */                                              0690 02056000
*   CMZX9914 = GPR14P;                                             0691 02057000
         LR    CMZX9914,GPR14P                                     0691 02058000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0692 02059000
*                                                                  0693 02060000
*   END;/* CMZMREG */                                              0693 02061000
*   END ;                                                          0694 02062000
*    /*ICALL(CPHCSP13)*/                                           0695 02063000
*     DO;                                                          0695 02064000
*    CALL CPHCSP13;                                                0696 02065000
*                                                                  0696 02066000
         BAL   @14,CPHCSP13                                        0696 02067000
*    END ;                 /*CHECK FOR END OF SUBPARM*/            0697 02068000
*   IF CPHPARCT=0                     /*BALANCED PARENS*/          0698 02069000
*      THEN                           /* YES */                    0698 02070000
         LH    @10,CPHPARCT                                        0698 02071000
         LTR   @10,@10                                             0698 02072000
         BNZ   @RF00698                                            0698 02073000
*         CPHLSTSP='1'B;              /*SET LAST SUB PARM */       0699 02074000
         OI    CPHLSTSP,B'00000100'                                0699 02075000
*      ELSE;                          /*NOT LAST SUB PARM*/        0700 02076000
@RF00698 DS    0H                                                  0701 02077000
*   /*CMZPEND*/                                                    0701 02078000
*   P3A: DO;                                                       0701 02079000
P3A      DS    0H                                                  0702 02080000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0702 02081000
*                                                                  0703 02082000
*   END;/* CMZMREG */                                              0703 02083000
*   GPR14P = CMZX9914;                                             0704 02084000
         LR    GPR14P,CMZX9914                                     0704 02085000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0705 02086000
*                                                                  0706 02087000
*   END;/* CMZMREG */                                              0706 02088000
*   END P3A;                                                       0707 02089000
*   END CPHCSP03;                                                  0708 02090000
@EL00014 DS    0H                                                  0708 02091000
@EF00014 DS    0H                                                  0708 02092000
@ER00014 BR    @14                                                 0708 02093000
*/********************************************************************/ 02094000
*/*                                                                  */ 02095000
*/*     CPHCSP04: END OF SUBPARM A                                   */ 02096000
*/*                                                                  */ 02097000
*/********************************************************************/ 02098000
*                                                                  0709 02099000
*   CPHCSP04: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0709 02100000
CPHCSP04 DS    0H                                                  0710 02101000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0710 02102000
*    DO;                                                           0710 02103000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0711 02104000
*                                                                  0712 02105000
*   END;/* CMZMREG */                                              0712 02106000
*   CMZX9915 = GPR14P;                                             0713 02107000
         LR    CMZX9915,GPR14P                                     0713 02108000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0714 02109000
*                                                                  0715 02110000
*   END;/* CMZMREG */                                              0715 02111000
*   END ;                                                          0716 02112000
*   IF CPHPARCT=0               /*BALANCED PARENS*/                0717 02113000
*      THEN                      /* YES */                         0717 02114000
         LH    @10,CPHPARCT                                        0717 02115000
         LTR   @10,@10                                             0717 02116000
         BNZ   @RF00717                                            0717 02117000
*         CPHSYNER='1'B;         /*SET SYNTAX ERROR*/              0718 02118000
         OI    CPHSYNER,B'00000001'                                0718 02119000
*      ELSE DO;                  /*NOT BALANCED PARENS*/           0719 02120000
         B     @RC00717                                            0719 02121000
@RF00717 DS    0H                                                  0720 02122000
*          /*ICALL(CPHCSP13)*/                                     0720 02123000
*           DO;                                                    0720 02124000
*          CALL CPHCSP13;                                          0721 02125000
*                                                                  0721 02126000
         BAL   @14,CPHCSP13                                        0721 02127000
*          END ;       /*  CHECK FOR END OF SUBPARM*/              0722 02128000
*         /*ICALL(CPHCSP01)*/                                      0723 02129000
*         P4A: DO;                                                 0723 02130000
P4A      DS    0H                                                  0724 02131000
*         CALL CPHCSP01;                                           0724 02132000
*                                                                  0724 02133000
         BAL   @14,CPHCSP01                                        0724 02134000
*         END P4A;            /*  STORE PTR AND LENGTH*/           0725 02135000
*      END;                        /*END NOT BALANCED PARENS*/     0726 02136000
*   /*CMZPEND*/                                                    0727 02137000
*   P4B: DO;                                                       0727 02138000
@RC00717 DS    0H                                                  0727 02139000
P4B      DS    0H                                                  0728 02140000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0728 02141000
*                                                                  0729 02142000
*   END;/* CMZMREG */                                              0729 02143000
*   GPR14P = CMZX9915;                                             0730 02144000
         LR    GPR14P,CMZX9915                                     0730 02145000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0731 02146000
*                                                                  0732 02147000
*   END;/* CMZMREG */                                              0732 02148000
*   END P4B;                                                       0733 02149000
*   END CPHCSP04;                                                  0734 02150000
@EL00015 DS    0H                                                  0734 02151000
@EF00015 DS    0H                                                  0734 02152000
@ER00015 BR    @14                                                 0734 02153000
*/********************************************************************/ 02154000
*/*                                                                  */ 02155000
*/*      CPHCSP05: END OF SUBPARM LIST                               */ 02156000
*/*                                                                  */ 02157000
*/********************************************************************/ 02158000
*                                                                  0735 02159000
*   CPHCSP05: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0735 02160000
CPHCSP05 DS    0H                                                  0736 02161000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0736 02162000
*    DO;                                                           0736 02163000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0737 02164000
*                                                                  0738 02165000
*   END;/* CMZMREG */                                              0738 02166000
*   CMZX9916 = GPR14P;                                             0739 02167000
         LR    CMZX9916,GPR14P                                     0739 02168000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0740 02169000
*                                                                  0741 02170000
*   END;/* CMZMREG */                                              0741 02171000
*   END ;                                                          0742 02172000
*   IF CPHPARCT=0                 /*PARENS. BALANCED*/             0743 02173000
*      THEN                           /* YES */                    0743 02174000
         LH    @10,CPHPARCT                                        0743 02175000
         LTR   @10,@10                                             0743 02176000
         BNZ   @RF00743                                            0743 02177000
*         CPHSLIST='0'B;               /* RESET SUBPARM. LIST FLAG*/    02178000
         NI    CPHSLIST,B'11111101'                                0744 02179000
*      ELSE;                           /* NO */                    0745 02180000
@RF00743 DS    0H                                                  0746 02181000
*   /*CMZPEND*/                                                    0746 02182000
*   P5A: DO;                                                       0746 02183000
P5A      DS    0H                                                  0747 02184000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0747 02185000
*                                                                  0748 02186000
*   END;/* CMZMREG */                                              0748 02187000
*   GPR14P = CMZX9916;                                             0749 02188000
         LR    GPR14P,CMZX9916                                     0749 02189000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0750 02190000
*                                                                  0751 02191000
*   END;/* CMZMREG */                                              0751 02192000
*   END P5A;                                                       0752 02193000
*   END CPHCSP05;                                                  0753 02194000
@EL00016 DS    0H                                                  0753 02195000
@EF00016 DS    0H                                                  0753 02196000
@ER00016 BR    @14                                                 0753 02197000
*/********************************************************************/ 02198000
*/*                                                                  */ 02199000
*/*         CPHCSP06: INCREASE PAREN COUNTER                         */ 02200000
*/*                                                                  */ 02201000
*/********************************************************************/ 02202000
*                                                                  0754 02203000
*   CPHCSP06: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0754 02204000
CPHCSP06 DS    0H                                                  0755 02205000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0755 02206000
*    DO;                                                           0755 02207000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0756 02208000
*                                                                  0757 02209000
*   END;/* CMZMREG */                                              0757 02210000
*   CMZX9917 = GPR14P;                                             0758 02211000
         LR    CMZX9917,GPR14P                                     0758 02212000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0759 02213000
*                                                                  0760 02214000
*   END;/* CMZMREG */                                              0760 02215000
*   END ;                                                          0761 02216000
*   IF CPHPARCT>0&CPHSBPAR=0 /*PAREN CNT GT 0 AND SUB PAREN CNT 0*/     02217000
*      THEN DO;               /* YES */                            0762 02218000
         LH    @10,CPHPARCT                                        0762 02219000
         SLR   @09,@09                                             0762 02220000
         CR    @10,@09                                             0762 02221000
         BNH   @RF00762                                            0762 02222000
         CH    @09,CPHSBPAR                                        0762 02223000
         BNE   @RF00762                                            0762 02224000
*         CPHSBPAR=CPHPARCT;  /*SET SUBPARM START PARENS. COUNT*/  0764 02225000
         STH   @10,CPHSBPAR                                        0764 02226000
*         CPHSPPTR=GPR01P;       /* FLAG LEFT PARENTHESIS AS START */   02227000
         ST    GPR01P,CPHSPPTR                                     0765 02228000
*                                /*    OF SUBPARM                    */ 02229000
*      END;                   /*END PAREN CNT GT 0*/               0766 02230000
*      ELSE;                  /*PAREN CNT NOT GT 0 */              0767 02231000
@RF00762 DS    0H                                                  0768 02232000
*   CPHPARCT=CPHPARCT+1;       /* INCREASE PAREN COUNTER BY 1*/    0768 02233000
         LH    @10,CPHPARCT                                        0768 02234000
         LA    @10,1(,@10)                                         0768 02235000
         STH   @10,CPHPARCT                                        0768 02236000
*   CPHSLIST='1'B;             /*   SET SUBPARM LIST FLAG*/        0769 02237000
         OI    CPHSLIST,B'00000010'                                0769 02238000
*    /*CMZPEND*/                                                   0770 02239000
*     DO;                                                          0770 02240000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0771 02241000
*                                                                  0772 02242000
*    END;/* CMZMREG */                                             0772 02243000
*    GPR14P = CMZX9917;                                            0773 02244000
         LR    GPR14P,CMZX9917                                     0773 02245000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0774 02246000
*                                                                  0775 02247000
*    END;/* CMZMREG */                                             0775 02248000
*    END ;                                                         0776 02249000
*    END CPHCSP06;                                                 0777 02250000
@EL00017 DS    0H                                                  0777 02251000
@EF00017 DS    0H                                                  0777 02252000
@ER00017 BR    @14                                                 0777 02253000
*/********************************************************************/ 02254000
*/*                                                                  */ 02255000
*/*         CPHCSP07: END OF SUBPARM C                               */ 02256000
*/*                                                                  */ 02257000
*/********************************************************************/ 02258000
*                                                                  0778 02259000
*   CPHCSP07: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0778 02260000
CPHCSP07 DS    0H                                                  0779 02261000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0779 02262000
*    DO;                                                           0779 02263000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0780 02264000
*                                                                  0781 02265000
*   END;/* CMZMREG */                                              0781 02266000
*   CMZX9918 = GPR14P;                                             0782 02267000
         LR    CMZX9918,GPR14P                                     0782 02268000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0783 02269000
*                                                                  0784 02270000
*   END;/* CMZMREG */                                              0784 02271000
*   END ;                                                          0785 02272000
*    /*ICALL(CPHCSP08)*/                                           0786 02273000
*     DO;                                                          0786 02274000
*    CALL CPHCSP08;                                                0787 02275000
*                                                                  0787 02276000
         BAL   @14,CPHCSP08                                        0787 02277000
*    END ;                /* CHECK FOR BALANCED PARENS*/           0788 02278000
*   IF CPHSYNER='1'B                 /*SYNTAX ERROR*/              0789 02279000
*      THEN ;                        /* YES */                     0789 02280000
         TM    CPHSYNER,B'00000001'                                0789 02281000
         BO    @RT00789                                            0789 02282000
*      ELSE                          /* NO */                      0791 02283000
*         /*ICALL(CPHCSP03)*/                                      0791 02284000
*          DO;                                                     0791 02285000
*         CALL CPHCSP03;                                           0792 02286000
*                                                                  0792 02287000
         BAL   @14,CPHCSP03                                        0792 02288000
*         END ;           /*   CHECK FOR LAST SUB-PARM*/           0793 02289000
*   /*CMZPEND*/                                                    0794 02290000
*   P7A: DO;                                                       0794 02291000
@RT00789 DS    0H                                                  0794 02292000
P7A      DS    0H                                                  0795 02293000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0795 02294000
*                                                                  0796 02295000
*   END;/* CMZMREG */                                              0796 02296000
*   GPR14P = CMZX9918;                                             0797 02297000
         LR    GPR14P,CMZX9918                                     0797 02298000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0798 02299000
*                                                                  0799 02300000
*   END;/* CMZMREG */                                              0799 02301000
*   END P7A;                                                       0800 02302000
*   END CPHCSP07;                                                  0801 02303000
@EL00018 DS    0H                                                  0801 02304000
@EF00018 DS    0H                                                  0801 02305000
@ER00018 BR    @14                                                 0801 02306000
*/********************************************************************/ 02307000
*/*                                                                  */ 02308000
*/*          CPHCSP08: DECREASE PAREN COUNTER                        */ 02309000
*/*                                                                  */ 02310000
*/********************************************************************/ 02311000
*                                                                  0802 02312000
*   CPHCSP08: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0802 02313000
CPHCSP08 DS    0H                                                  0803 02314000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0803 02315000
*    DO;                                                           0803 02316000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0804 02317000
*                                                                  0805 02318000
*   END;/* CMZMREG */                                              0805 02319000
*   CMZX9919 = GPR14P;                                             0806 02320000
         LR    CMZX9919,GPR14P                                     0806 02321000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0807 02322000
*                                                                  0808 02323000
*   END;/* CMZMREG */                                              0808 02324000
*   END ;                                                          0809 02325000
*   CPHPARCT=CPHPARCT-1;      /*DECREMENT PAREN CNT*/              0810 02326000
         LH    @10,CPHPARCT                                        0810 02327000
         BCTR  @10,0                                               0810 02328000
         STH   @10,CPHPARCT                                        0810 02329000
*   IF CPHPARCT<0            /*CPHPARCT LESS THAN 0*/              0811 02330000
*      THEN                   /* YES */                            0811 02331000
         LTR   @10,@10                                             0811 02332000
         BNM   @RF00811                                            0811 02333000
*         CPHSYNER='1'B;      /*SET SYNTAX ERROR*/                 0812 02334000
         OI    CPHSYNER,B'00000001'                                0812 02335000
*      ELSE;                  /* NO */                             0813 02336000
@RF00811 DS    0H                                                  0814 02337000
*   IF CPHSBPAR=0             /*SUB PAREN CNT 0*/                  0814 02338000
*      THEN DO;               /*YES */                             0814 02339000
         SLR   @10,@10                                             0814 02340000
         CH    @10,CPHSBPAR                                        0814 02341000
         BNE   @RF00814                                            0814 02342000
*         CPHENDSP='1'B;        /*SET END OF SUBPARM */            0816 02343000
         OI    CPHENDSP,B'00001000'                                0816 02344000
*         IF CPHSPPTR=0       /*SUB PARM PTR 0 */                  0817 02345000
*            THEN;            /*YES */                             0817 02346000
         C     @10,CPHSPPTR                                        0817 02347000
         BE    @RT00817                                            0817 02348000
*            ELSE             /* NO */                             0819 02349000
*               CPHSPLEN=GPR01P-CPHSPPTR;  /*SET TOTAL SUBPARM LENGTH*/ 02350000
         LR    @10,GPR01P                                          0819 02351000
         SL    @10,CPHSPPTR                                        0819 02352000
         STH   @10,CPHSPLEN                                        0819 02353000
*      END;                   /*END SUB PAREN CNT 0*/              0820 02354000
*      ELSE DO;               /*SUB PAREN CNT NOT 0*/              0821 02355000
         B     @RC00814                                            0821 02356000
@RF00814 DS    0H                                                  0822 02357000
*         IF CPHSBPAR=CPHPARCT    /*SUBPARM START COUNT EQUAL CURRENT*/ 02358000
*            THEN DO;                                              0822 02359000
         CLC   CPHSBPAR(2),CPHPARCT                                0822 02360000
         BNE   @RF00822                                            0822 02361000
*               CPHSBPAR=0;     /*SET SUB APREN CNT TO 0*/         0824 02362000
         SLR   @10,@10                                             0824 02363000
         STH   @10,CPHSBPAR                                        0824 02364000
*               CPHENDSP='1'B;    /* SET END OF SUBPARM*/          0825 02365000
         OI    CPHENDSP,B'00001000'                                0825 02366000
*               CPHSPLEN=GPR01P-CPHSPPTR+1; /*SET TOTAL SUBPARM LENGTH* 02367000
         LR    @10,GPR01P                                          0826 02368000
         SL    @10,CPHSPPTR                                        0826 02369000
         LA    @10,1(,@10)                                         0826 02370000
         STH   @10,CPHSPLEN                                        0826 02371000
*            END;                 /*END SUB PARM STRT =CURRENT*/   0827 02372000
*            ELSE;                /*NOT  EQUAL*/                   0828 02373000
@RF00822 DS    0H                                                  0829 02374000
*      END;                    /*END SUB PAREN CNT NOT 0*/         0829 02375000
*   /*CMZPEND*/                                                    0830 02376000
*   P8A: DO;                                                       0830 02377000
@RC00814 DS    0H                                                  0830 02378000
P8A      DS    0H                                                  0831 02379000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0831 02380000
*                                                                  0832 02381000
*   END;/* CMZMREG */                                              0832 02382000
*   GPR14P = CMZX9919;                                             0833 02383000
         LR    GPR14P,CMZX9919                                     0833 02384000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0834 02385000
*                                                                  0835 02386000
*   END;/* CMZMREG */                                              0835 02387000
*   END P8A;                                                       0836 02388000
*   END CPHCSP08;                                                  0837 02389000
@EL00019 DS    0H                                                  0837 02390000
@EF00019 DS    0H                                                  0837 02391000
@ER00019 BR    @14                                                 0837 02392000
*/********************************************************************/ 02393000
*/*                                                                  */ 02394000
*/*         CPHCSP09: SCAN TO NEXT QUOTE                             */ 02395000
*/*                                                                  */ 02396000
*/********************************************************************/ 02397000
*                                                                  0838 02398000
*   CPHCSP09: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0838 02399000
CPHCSP09 DS    0H                                                  0839 02400000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0839 02401000
*    DO;                                                           0839 02402000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0840 02403000
*                                                                  0841 02404000
*   END;/* CMZMREG */                                              0841 02405000
*   CMZX9921 = GPR14P;                                             0842 02406000
         LR    CMZX9921,GPR14P                                     0842 02407000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0843 02408000
*                                                                  0844 02409000
*   END;/* CMZMREG */                                              0844 02410000
*   END ;                                                          0845 02411000
*   GPR03P=GPR03P+1;          /* INCREASE PARM STRING PTR BY 1*/   0846 02412000
         AL    GPR03P,@CF00048                                     0846 02413000
*   CPHSPPTR=GPR03P;             /*   STORE IN CPHSPPTR*/          0847 02414000
         ST    GPR03P,CPHSPPTR                                     0847 02415000
*   GPR02F=0;                       /* INITIALIZE TRT CODE REGISTER  */ 02416000
         SLR   GPR02F,GPR02F                                       0848 02417000
*   DO WHILE GPR02F^=5;            /*SCAN FOR QUOTE*/              0849 02418000
         B     @DE00849                                            0849 02419000
@DL00849 DS    0H                                                  0850 02420000
*     /*ICALL(CPHSBTRT)*/                                          0850 02421000
*     P9A: DO;                                                     0850 02422000
P9A      DS    0H                                                  0851 02423000
*     CALL CPHSBTRT;                                               0851 02424000
*                                                                  0851 02425000
         BAL   @14,CPHSBTRT                                        0851 02426000
*     END P9A;            /*   TRT:SCAN TO NEXT DELIMITER*/        0852 02427000
*   END;                            /*END DO WHILE*/               0853 02428000
@DE00849 C     GPR02F,@CF00109                                     0853 02429000
         BNE   @DL00849                                            0853 02430000
*   CPHSPLEN=GPR01P-CPHSPPTR;      /*SAVE SUB PARM LENGTH*/        0854 02431000
         LR    @10,GPR01P                                          0854 02432000
         SL    @10,CPHSPPTR                                        0854 02433000
         STH   @10,CPHSPLEN                                        0854 02434000
*   CPHTCHAR=5;                   /*SET TCHAR = QUOTE CODE*/       0855 02435000
         MVI   CPHTCHAR,X'05'                                      0855 02436000
*   /*CMZPEND*/                                                    0856 02437000
*   P9B: DO;                                                       0856 02438000
P9B      DS    0H                                                  0857 02439000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0857 02440000
*                                                                  0858 02441000
*   END;/* CMZMREG */                                              0858 02442000
*   GPR14P = CMZX9921;                                             0859 02443000
         LR    GPR14P,CMZX9921                                     0859 02444000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0860 02445000
*                                                                  0861 02446000
*   END;/* CMZMREG */                                              0861 02447000
*   END P9B;                                                       0862 02448000
*   END CPHCSP09;                                                  0863 02449000
@EL00020 DS    0H                                                  0863 02450000
@EF00020 DS    0H                                                  0863 02451000
@ER00020 BR    @14                                                 0863 02452000
*/********************************************************************/ 02453000
*/*                                                                  */ 02454000
*/*       CPHCSP10: END OF KEYWORD B OR SUBPARM                      */ 02455000
*/*                                                                  */ 02456000
*/********************************************************************/ 02457000
*                                                                  0864 02458000
*   CPHCSP10: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0864 02459000
CPHCSP10 DS    0H                                                  0865 02460000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0865 02461000
*    DO;                                                           0865 02462000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0866 02463000
*                                                                  0867 02464000
*   END;/* CMZMREG */                                              0867 02465000
*   CMZX9922 = GPR14P;                                             0868 02466000
         LR    CMZX9922,GPR14P                                     0868 02467000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0869 02468000
*                                                                  0870 02469000
*   END;/* CMZMREG */                                              0870 02470000
*   END ;                                                          0871 02471000
*    /*ICALL(CPHCSP03)*/                                           0872 02472000
*     DO;                                                          0872 02473000
*    CALL CPHCSP03;                                                0873 02474000
*                                                                  0873 02475000
         BAL   @14,CPHCSP03                                        0873 02476000
*    END ;              /* CHECK FOR LAST SUBPARM */               0874 02477000
*   IF CPHLSTSP='1'B               /*LAST SUB PARM*/               0875 02478000
*      THEN DO;                    /* YES */                       0875 02479000
         TM    CPHLSTSP,B'00000100'                                0875 02480000
         BNO   @RF00875                                            0875 02481000
*         CPHENDSP='1'B;            /*   SET END OF SUBPARM */     0877 02482000
*         CPHKWSCN='0'B;            /*    RESET KWD SCAN FLAG*/    0878 02483000
         OI    CPHENDSP,B'00001000'                                0878 02484000
         NI    CPHKWSCN,B'11011111'                                0878 02485000
*         CPHKWLEN=CPHSPLEN;        /*SET KWD LENGTH*/             0879 02486000
         LH    @10,CPHSPLEN                                        0879 02487000
         STH   @10,CPHKWLEN                                        0879 02488000
*      END;                         /*END LAST SUB PARM*/          0880 02489000
*      ELSE DO;                     /*NOT LAST SUB PARM*/          0881 02490000
         B     @RC00875                                            0881 02491000
@RF00875 DS    0H                                                  0882 02492000
*         IF CPHKWSCN='1'B | CPHTCHAR=6 /*IN KWD SCAN OR BLAKN CHAR*/   02493000
*            THEN                 /* YES */                        0882 02494000
         TM    CPHKWSCN,B'00100000'                                0882 02495000
         BO    @RT00882                                            0882 02496000
         CLI   CPHTCHAR,6                                          0882 02497000
         BNE   @RF00882                                            0882 02498000
@RT00882 DS    0H                                                  0883 02499000
*               CPHSYNER='1'B;    /*SET SYNTAX ERROR*/             0883 02500000
         OI    CPHSYNER,B'00000001'                                0883 02501000
*            ELSE;                /*NOT KWD SCAN MODE*/            0884 02502000
@RF00882 DS    0H                                                  0885 02503000
*      END;                        /*END NOT LAST SUB PARM*/       0885 02504000
*   /*CMZPEND*/                                                    0886 02505000
*   P10B: DO;                                                      0886 02506000
@RC00875 DS    0H                                                  0886 02507000
P10B     DS    0H                                                  0887 02508000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0887 02509000
*                                                                  0888 02510000
*   END;/* CMZMREG */                                              0888 02511000
*   GPR14P = CMZX9922;                                             0889 02512000
         LR    GPR14P,CMZX9922                                     0889 02513000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0890 02514000
*                                                                  0891 02515000
*   END;/* CMZMREG */                                              0891 02516000
*   END P10B;                                                      0892 02517000
*   END CPHCSP10;                                                  0893 02518000
@EL00021 DS    0H                                                  0893 02519000
@EF00021 DS    0H                                                  0893 02520000
@ER00021 BR    @14                                                 0893 02521000
*/********************************************************************/ 02522000
*/*                                                                  */ 02523000
*/*          CPHCSP12: SYNTAX ERROR                                  */ 02524000
*/*                                                                  */ 02525000
*/********************************************************************/ 02526000
*                                                                  0894 02527000
*   CPHCSP12: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0894 02528000
CPHCSP12 DS    0H                                                  0895 02529000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0895 02530000
*    DO;                                                           0895 02531000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0896 02532000
*                                                                  0897 02533000
*   END;/* CMZMREG */                                              0897 02534000
*   CMZX9923 = GPR14P;                                             0898 02535000
         LR    CMZX9923,GPR14P                                     0898 02536000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0899 02537000
*                                                                  0900 02538000
*   END;/* CMZMREG */                                              0900 02539000
*   END ;                                                          0901 02540000
*   CPHSYNER='1'B;                       /*SET SYNTAX ERROR FLAG*/ 0902 02541000
         OI    CPHSYNER,B'00000001'                                0902 02542000
*    /*CMZPEND*/                                                   0903 02543000
*     DO;                                                          0903 02544000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                 0904 02545000
*                                                                  0905 02546000
*    END;/* CMZMREG */                                             0905 02547000
*    GPR14P = CMZX9923;                                            0906 02548000
         LR    GPR14P,CMZX9923                                     0906 02549000
*    DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */          0907 02550000
*                                                                  0908 02551000
*    END;/* CMZMREG */                                             0908 02552000
*    END ;                                                         0909 02553000
*    END CPHCSP12;                                                 0910 02554000
@EL00022 DS    0H                                                  0910 02555000
@EF00022 DS    0H                                                  0910 02556000
@ER00022 BR    @14                                                 0910 02557000
*/********************************************************************/ 02558000
*/*                                                                  */ 02559000
*/*           CPHCSP13: CHECK FOR END OF SUBPARM                     */ 02560000
*/*                                                                  */ 02561000
*/********************************************************************/ 02562000
*                                                                  0911 02563000
*   CPHCSP13: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0911 02564000
CPHCSP13 DS    0H                                                  0912 02565000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0912 02566000
*    DO;                                                           0912 02567000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0913 02568000
*                                                                  0914 02569000
*   END;/* CMZMREG */                                              0914 02570000
*   CMZX9920 = GPR14P;                                             0915 02571000
         ST    GPR14P,CMZX9920                                     0915 02572000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0916 02573000
*                                                                  0917 02574000
*   END;/* CMZMREG */                                              0917 02575000
*   END ;                                                          0918 02576000
*   IF CPHSBPAR=0                   /*IN NESTED SUB PARM*/         0919 02577000
*      THEN                          /* NO */                      0919 02578000
         LH    @10,CPHSBPAR                                        0919 02579000
         LTR   @10,@10                                             0919 02580000
         BNZ   @RF00919                                            0919 02581000
*         CPHENDSP='1'B;             /*SET END OF SUBPARM*/        0920 02582000
         OI    CPHENDSP,B'00001000'                                0920 02583000
*      ELSE;                         /*IN NESTED SUB PARM*/        0921 02584000
@RF00919 DS    0H                                                  0922 02585000
*   /*CMZPEND*/                                                    0922 02586000
*   P13A: DO;                                                      0922 02587000
P13A     DS    0H                                                  0923 02588000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0923 02589000
*                                                                  0924 02590000
*   END;/* CMZMREG */                                              0924 02591000
*   GPR14P = CMZX9920;                                             0925 02592000
         L     GPR14P,CMZX9920                                     0925 02593000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0926 02594000
*                                                                  0927 02595000
*   END;/* CMZMREG */                                              0927 02596000
*   END P13A;                                                      0928 02597000
*   END CPHCSP13;                                                  0929 02598000
@EL00023 DS    0H                                                  0929 02599000
@EF00023 DS    0H                                                  0929 02600000
@ER00023 BR    @14                                                 0929 02601000
*/********************************************************************/ 02602000
*/*                                                                  */ 02603000
*/*        CPHCSP14: END OF LAST SUBPARM LIST                        */ 02604000
*/*                                                                  */ 02605000
*/********************************************************************/ 02606000
*                                                                  0930 02607000
*   CPHCSP14: PROC OPTIONS(DONTSAVE,NOSAVEAREA) ;                  0930 02608000
CPHCSP14 DS    0H                                                  0931 02609000
*   /*CMZPROC OPTIONS(DONTSAVE,NOSAVEAREA)*/                       0931 02610000
*    DO;                                                           0931 02611000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RESTRICT */          0932 02612000
*                                                                  0933 02613000
*   END;/* CMZMREG */                                              0933 02614000
*   CMZX9924 = GPR14P;                                             0934 02615000
         LR    CMZX9924,GPR14P                                     0934 02616000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0935 02617000
*                                                                  0936 02618000
*   END;/* CMZMREG */                                              0936 02619000
*   END ;                                                          0937 02620000
*   CPHSLIST='0'B;                   /*  RESET SUBPARM LIST FLAG */     02621000
         NI    CPHSLIST,B'11111101'                                0938 02622000
*    /*ICALL(CPHCSP03)*/                                           0939 02623000
*     DO;                                                          0939 02624000
*    CALL CPHCSP03;                                                0940 02625000
*                                                                  0940 02626000
         BAL   @14,CPHCSP03                                        0940 02627000
*    END ;                 /*  CHECK FOR END OF SUBPARMS*/         0941 02628000
*   IF CPHPARCT=0                  /*   BALANCED PARENS.*/         0942 02629000
*      THEN;                       /* YES */                       0942 02630000
         LH    @10,CPHPARCT                                        0942 02631000
         LTR   @10,@10                                             0942 02632000
         BZ    @RT00942                                            0942 02633000
*      ELSE                         /*NOT BALANCED PARENS*/        0944 02634000
*         CPHSYNER='1'B;             /* SET SYNTAX ERROR FLAG*/    0944 02635000
         OI    CPHSYNER,B'00000001'                                0944 02636000
*   /*CMZPEND*/                                                    0945 02637000
*   P14A: DO;                                                      0945 02638000
@RT00942 DS    0H                                                  0945 02639000
P14A     DS    0H                                                  0946 02640000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0946 02641000
*                                                                  0947 02642000
*   END;/* CMZMREG */                                              0947 02643000
*   GPR14P = CMZX9924;                                             0948 02644000
         LR    GPR14P,CMZX9924                                     0948 02645000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0949 02646000
*                                                                  0950 02647000
*   END;/* CMZMREG */                                              0950 02648000
*   END P14A;                                                      0951 02649000
*   END CPHCSP14;                                                  0952 02650000
@EL00024 DS    0H                                                  0952 02651000
@EF00024 DS    0H                                                  0952 02652000
@ER00024 BR    @14                                                 0952 02653000
@PB00024 DS    0H                                                  0953 02654000
*   GPR00P=CPHSCN00;           /* RESTORE REG00              @DM30483*/ 02655000
         L     GPR00P,CPHSCN00                                     0953 02656000
*   GPR02P=CPHSCN02;           /* RESTORE REG02              @DM30483*/ 02657000
         L     GPR02P,CPHSCN02                                     0954 02658000
*   /*CMZPEND*/                                                    0955 02659000
*    DO;                                                           0955 02660000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                  0956 02661000
*                                                                  0957 02662000
*   END;/* CMZMREG */                                              0957 02663000
*   GPR14P = CMZX9902;                                             0958 02664000
         LR    GPR14P,CMZX9902                                     0958 02665000
*   DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */           0959 02666000
*                                                                  0960 02667000
*   END;/* CMZMREG */                                              0960 02668000
*   END ;                                                          0961 02669000
*   END CPHSUBSC;                                                  0962 02670000
*                                                                  0962 02671000
@EL00010 DS    0H                                                  0962 02672000
@EF00010 DS    0H                                                  0962 02673000
@ER00010 BR    @14                                                 0962 02674000
@PB00010 DS    0H                                                  0963 02675000
* DO; /* TPEPILOG   */                                             0963 02676000
*                                                                  0964 02677000
* GEN (PRINT OFF);                                                 0964 02678000
*                                                                  0964 02679000
         PRINT OFF                                                      02680000
* DO;                                                              0965 02681000
* DCL GPR00F FIXED(31) REG(00),GPR00P PTR(31) REG(00),GPR01F FIXED(31)  02682000
*EG(01),GPR01P PTR(31) REG(01),GPR02F FIXED(31) REG(02),GPR02P PTR(31)  02683000
*EG(02),GPR03F FIXED(31) REG(03),GPR03P PTR(31) REG(03),GPR04F FIXED(31 02684000
* REG(04),GPR04P PTR(31) REG(04),GPR05F FIXED(31) REG(05),GPR05P PTR(31 02685000
* REG(05),GPR06F FIXED(31) REG(06),GPR06P PTR(31) REG(06),GPR07F FIXED( 02686000
*1) REG(07),GPR07P PTR(31) REG(07),GPR08F FIXED(31) REG(08),GPR08P PTR( 02687000
*1) REG(08),GPR09F FIXED(31) REG(09),GPR09P PTR(31) REG(09),GPR10F FIXE 02688000
*(31) REG(10),GPR10P PTR(31) REG(10),GPR11F FIXED(31) REG(11),GPR11P PT 02689000
*(31) REG(11),GPR12F FIXED(31) REG(12),GPR12P PTR(31) REG(12),GPR13F FI 02690000
*ED(31) REG(13),GPR13P PTR(31) REG(13),GPR14F FIXED(31) REG(14),GPR14P  02691000
*TR(31) REG(14),GPR15F FIXED(31) REG(15),GPR15P PTR(31) REG(15);   0966 02692000
* END;                                                             0967 02693000
*                                                                  0968 02694000
* GEN (PRINT ON);                                                  0968 02695000
         PRINT ON                                                       02696000
* END;/* TPEPILOG */                                               0969 02697000
* DO; /* ATDSPLY   */                                              0970 02698000
*                                                                  0971 02699000
* END;/* ATDSPLY */                                                0971 02700000
*  /*CMZPEND*/                                                     0972 02701000
*   DO;                                                            0972 02702000
*  DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15)  */                   0973 02703000
*                                                                  0974 02704000
*  END;/* CMZMREG */                                               0974 02705000
*  DCL CMZX9902 REG(6) PTR(31);                                    0975 02706000
*  DCL CMZX9903 REG(6) PTR(31);                                    0976 02707000
*  DCL CMZX9904 REG(5) PTR(31);                                    0977 02708000
*  DCL CMZX9905 REG(5) PTR(31);                                    0978 02709000
*  DCL CMZX9906 REG(5) PTR(31);                                    0979 02710000
*  DCL CMZX9907 REG(5) PTR(31);                                    0980 02711000
*  DCL CMZX9908 REG(5) PTR(31);                                    0981 02712000
*  DCL CMZX9909 REG(5) PTR(31);                                    0982 02713000
*  DCL CMZX9910 REG(6) PTR(31);                                    0983 02714000
*  DCL CMZX9911 REG(12) PTR(31);                                   0984 02715000
*  DCL CMZX9912 REG(12) PTR(31);                                   0985 02716000
*  DCL CMZX9913 REG(7) PTR(31);                                    0986 02717000
*  DCL CMZX9914 REG(12) PTR(31);                                   0987 02718000
*  DCL CMZX9915 REG(7) PTR(31);                                    0988 02719000
*  DCL CMZX9916 REG(7) PTR(31);                                    0989 02720000
*  DCL CMZX9917 REG(7) PTR(31);                                    0990 02721000
*  DCL CMZX9918 REG(7) PTR(31);                                    0991 02722000
*  DCL CMZX9919 REG(12) PTR(31);                                   0992 02723000
*  /*PROC0012 INSUFFICIENT LINK REGISTERS*/                        0993 02724000
*  DCL CMZX9920 PTR(31);                                           0993 02725000
*  DCL CMZX9921 REG(7) PTR(31);                                    0994 02726000
*  DCL CMZX9922 REG(7) PTR(31);                                    0995 02727000
*  DCL CMZX9923 REG(7) PTR(31);                                    0996 02728000
*  DCL CMZX9924 REG(7) PTR(31);                                    0997 02729000
*  DO; /* CMZMREG (5,6,7,12,14,0,1,2,3,4,15) RELEASE */            0998 02730000
*  RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR12P, 02731000
*PR14P,GPR15P) UNRSTD;                                             0999 02732000
*                                                                  0999 02733000
*  END;/* CMZMREG */                                               1000 02734000
*  END ;                                                           1001 02735000
*  END ISTINCPH;                                                   1002 02736000
@EL00001 DS    0H                                                  1002 02737000
@EF00001 DS    0H                                                  1002 02738000
@ER00001 LM    @14,@12,12(@13)                                     1002 02739000
         BR    @14                                                 1002 02740000
@DATA    DS    0H                                                       02741000
@CH00080 DC    H'7'                                                     02742000
@SM00442 MVC   CPHARGUM(0),CPHSBYTE(@09)                                02743000
@SM00449 MVC   PHRF34SP-12(0,@10),CPHSBYTE(@08)                         02744000
@SM00451 MVC   PHRF34SP-12(0,@09),CPHSBYTE(@08)                         02745000
@SM00453 MVC   0(0,@09),CPHSBYTE(@08)                                   02746000
@SM00456 MVC   CPHSUBVL(0),CPHFUNBT(@10)                                02747000
@DATD    DSECT                                                          02748000
         DS    0F                                                       02749000
@TF00001 DS    F                                                        02750000
ISTINCPH CSECT                                                          02751000
         DS    0F                                                       02752000
@CF00048 DC    F'1'                                                     02753000
@CF00311 DC    F'2'                                                     02754000
@CF00182 DC    F'3'                                                     02755000
@CF00117 DC    F'4'                                                     02756000
@CF00109 DC    F'5'                                                     02757000
@CF00046 DC    F'8'                                                     02758000
@CF00268 DC    F'9'                                                     02759000
@CF00235 DC    F'12'                                                    02760000
@CH00235 EQU   @CF00235+2                                               02761000
@CF00294 DC    F'255'                                                   02762000
@CF00139 DC    F'256'                                                   02763000
@CF00448 DC    F'-4'                                                    02764000
@DATD    DSECT                                                          02765000
         DS    0D                                                       02766000
CPHTABAD DS    A                                                        02767000
CPHSCNPT DS    A                                                        02768000
CPHOANDX DS    F                                                        02769000
CPHOALIM DS    F                                                        02770000
CPHINSVA DS    A                                                        02771000
CPHSCN00 DS    A                                                        02772000
CPHSCN02 DS    A                                                        02773000
CPHVCK01 DS    A                                                        02774000
CPHVCK02 DS    A                                                        02775000
CPHTABSV DS    A                                                        02776000
CPHKWPTR DS    A                                                        02777000
CPHTRTSV DS    A                                                        02778000
CPHVALPS DS    A                                                        02779000
CPHSPPTR DS    A                                                        02780000
CMZX9920 DS    A                                                        02781000
CPHSPLEN DS    H                                                        02782000
CPHKWLEN DS    H                                                        02783000
CPHPARCT DS    H                                                        02784000
CPHSBPAR DS    H                                                        02785000
CPHENCTR DS    H                                                        02786000
CPHTCHAR DS    FL1                                                      02787000
CPHLCHAR DS    FL1                                                      02788000
         DS    0D                                                       02789000
@TS00001 DS    CL8                                                      02790000
CPHSUBVL DS    CL5                                                      02791000
         ORG   CPHSUBVL                                                 02792000
CPHVALBT DS    BL1                                                      02793000
         ORG   CPHVALBT                                                 02794000
@NM00005 DS    BL1                                                      02795000
CPHFUNNU EQU   CPHVALBT+0                                               02796000
CPHFUNAN EQU   CPHVALBT+0                                               02797000
CPHFUNFC EQU   CPHVALBT+0                                               02798000
CPHFUNNO EQU   CPHVALBT+0                                               02799000
         ORG   CPHSUBVL+1                                               02800000
CPHVALUE DS    AL4                                                      02801000
         ORG   CPHSUBVL+5                                               02802000
CPHARGUM DS    CL8                                                      02803000
CPHDECHX DS    CL3                                                      02804000
CPHVALFG DS    BL1                                                      02805000
         ORG   CPHVALFG                                                 02806000
@NM00006 DS    BL1                                                      02807000
CPHVALNU EQU   CPHVALFG+0                                               02808000
CPHVALAN EQU   CPHVALFG+0                                               02809000
CPHVALFC EQU   CPHVALFG+0                                               02810000
@NM00007 EQU   CPHVALFG+0                                               02811000
         ORG   CPHVALFG+1                                               02812000
CPHFLAGS DS    BL1                                                      02813000
         ORG   CPHFLAGS                                                 02814000
@NM00008 DS    BL1                                                      02815000
CPHCONT  EQU   CPHFLAGS+0                                               02816000
CPHKWSCN EQU   CPHFLAGS+0                                               02817000
CPHENDST EQU   CPHFLAGS+0                                               02818000
CPHENDSP EQU   CPHFLAGS+0                                               02819000
CPHLSTSP EQU   CPHFLAGS+0                                               02820000
CPHSLIST EQU   CPHFLAGS+0                                               02821000
CPHSYNER EQU   CPHFLAGS+0                                               02822000
         ORG   CPHFLAGS+1                                               02823000
CPHFLAG2 DS    BL1                                                      02824000
         ORG   CPHFLAG2                                                 02825000
CPHOFLOW DS    BL1                                                      02826000
CPHFUNER EQU   CPHFLAG2+0                                               02827000
CPHARGNF EQU   CPHFLAG2+0                                               02828000
@NM00009 EQU   CPHFLAG2+0                                               02829000
         ORG   CPHFLAG2+1                                               02830000
ISTINCPH CSECT                                                          02831000
         DS    0F                                                       02832000
@SIZDATD DC    AL1(0)                                                   02833000
         DC    AL3(@ENDDATD-@DATD)                                      02834000
         DS    0D                                                       02835000
@CC00266 DC    C'00000000'                                              02836000
@CC00291 EQU   @CC00266                                                 02837000
CPHLOCK  DC    AL1(0)                                                   02838000
         DS    CL3                                                      02839000
STATICFD DS    CL116                                                    02840000
CPHSCNTB DC    AL4(CPHCSP13)                                            02841000
         DC    AL4(CPHCSP01)                                            02842000
         DC    AL4(CPHCSP01)                                            02843000
         DC    AL4(CPHCSP01)                                            02844000
         DC    AL4(CPHCSP12)                                            02845000
         DC    AL4(CPHCSP12)                                            02846000
         DC    AL4(CPHCSP01)                                            02847000
         DC    AL4(CPHCSP02)                                            02848000
         DC    AL4(CPHCSP12)                                            02849000
         DC    AL4(CPHCSP12)                                            02850000
         DC    AL4(CPHCSP12)                                            02851000
         DC    AL4(CPHCSP12)                                            02852000
         DC    AL4(CPHCSP12)                                            02853000
         DC    AL4(CPHCSP12)                                            02854000
         DC    AL4(CPHCSP10)                                            02855000
         DC    AL4(CPHCSP10)                                            02856000
         DC    AL4(CPHCSP04)                                            02857000
         DC    AL4(CPHCSP04)                                            02858000
         DC    AL4(CPHCSP05)                                            02859000
         DC    AL4(CPHCSP13)                                            02860000
         DC    AL4(CPHCSP12)                                            02861000
         DC    AL4(CPHCSP12)                                            02862000
         DC    AL4(CPHCSP06)                                            02863000
         DC    AL4(CPHCSP06)                                            02864000
         DC    AL4(CPHCSP06)                                            02865000
         DC    AL4(CPHCSP12)                                            02866000
         DC    AL4(CPHCSP12)                                            02867000
         DC    AL4(CPHCSP12)                                            02868000
         DC    AL4(CPHCSP07)                                            02869000
         DC    AL4(CPHCSP12)                                            02870000
         DC    AL4(CPHCSP07)                                            02871000
         DC    AL4(CPHCSP12)                                            02872000
         DC    AL4(CPHCSP08)                                            02873000
         DC    AL4(CPHCSP08)                                            02874000
         DC    AL4(CPHCSP12)                                            02875000
         DC    AL4(CPHCSP12)                                            02876000
         DC    AL4(CPHCSP09)                                            02877000
         DC    AL4(CPHCSP09)                                            02878000
         DC    AL4(CPHCSP09)                                            02879000
         DC    AL4(CPHCSP12)                                            02880000
         DC    AL4(CPHCSP12)                                            02881000
         DC    AL4(CPHCSP12)                                            02882000
         DC    AL4(CPHCSP10)                                            02883000
         DC    AL4(CPHCSP10)                                            02884000
         DC    AL4(CPHCSP10)                                            02885000
         DC    AL4(CPHCSP12)                                            02886000
         DC    AL4(CPHCSP14)                                            02887000
         DC    AL4(CPHCSP10)                                            02888000
         DC    AL4(CPHCSP13)                                            02889000
ISTINCPH CSECT                                                          02890000
CPHTRTB    DC    XL256'00'          INIT ALL CODES TO NON-DELIMITER     02891000
            ORG   CPHTRTB+C' '       RE-ORIGIN TO BLANK                 02892000
            DC    X'06'              SCAN CODE = '06'X                  02893000
            ORG   CPHTRTB+C','       RE-ORIGIN TO COMMA                 02894000
            DC    X'02'              SCAN CODE = '02'X                  02895000
            ORG   CPHTRTB+C'('       RE-ORIGIN TO LEFT PARENTHESIS      02896000
            DC    X'03'              SCAN CODE = '03'X                  02897000
            ORG   CPHTRTB+C')'       RE-ORIGIN TO RIGHT PARENTHESIS     02898000
            DC    X'04'              SCAN CODE = '04'X                  02899000
            ORG   CPHTRTB+C''''      RE-ORIGIN TO QUOTE MARK            02900000
            DC    X'05'              SCAN CODE = '05'X                  02901000
            ORG   CPHTRTB+C'='       RE-ORIGIN TO EQUAL SIGN            02902000
            DC    X'01'              SCAN CODE = '01'X                  02903000
            ORG             ,        CONTINUE WITH STORAGE DEFINITION   02904000
ISTINCPH CSECT                                                          02905000
CPHVTRTB  DC    XL256'04'           DEFAULT CODE = '04'X                02906000
           ORG   CPHVTRTB+C'A'       RE-ORIGIN TO ALPHABETICS           02907000
           DC    9X'01'              A-I CODE = '01'X                   02908000
           ORG   CPHVTRTB+C'J'       RE-ORIGIN TO NEXT ALPHA GROUP      02909000
           DC    9X'01'              J-R CODE = '01'X                   02910000
           ORG   CPHVTRTB+C'S'       RE-ORIGIN TO LAST ALPHA GROUP      02911000
           DC    8X'01'              S-Z CODE = '01'X                   02912000
           ORG   CPHVTRTB+C'$'       RE-ORIGIN TO NATIONAL CHARACTERS   02913000
           DC    X'01'               ALPHA CODE = '01'X                 02914000
           ORG   CPHVTRTB+C'@'       ANOTHER NATIONAL CHARACTER         02915000
           DC    X'01'               ALPHA CODE = '01'X                 02916000
           ORG   CPHVTRTB+X'7B'      RE-ORIGIN TO POUND SIGN            02917000
           DC    X'01'               ALPHA CODE = '01'X                 02918000
           ORG   CPHVTRTB+C'0'       RE-ORIGIN TO NUMERICS              02919000
           DC    10X'02'             NUMERIC CODE = '02'X               02920000
           ORG         ,             CONTINUE STORAGE DEFINITION        02921000
@DATD    DSECT                                                          02922000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02923000
@ENDDATD EQU   *                                                        02924000
ISTINCPH CSECT                                                          02925000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02926000
@01      EQU   01                                                       02927000
@02      EQU   02                                                       02928000
@03      EQU   03                                                       02929000
@04      EQU   04                                                       02930000
@05      EQU   05                                                       02931000
@06      EQU   06                                                       02932000
@07      EQU   07                                                       02933000
@08      EQU   08                                                       02934000
@09      EQU   09                                                       02935000
@10      EQU   10                                                       02936000
@11      EQU   11                                                       02937000
@12      EQU   12                                                       02938000
@13      EQU   13                                                       02939000
@14      EQU   14                                                       02940000
@15      EQU   15                                                       02941000
GPR00P   EQU   @00                                                      02942000
GPR01P   EQU   @01                                                      02943000
GPR02P   EQU   @02                                                      02944000
GPR03P   EQU   @03                                                      02945000
GPR04P   EQU   @04                                                      02946000
GPR05P   EQU   @05                                                      02947000
GPR06P   EQU   @06                                                      02948000
GPR07P   EQU   @07                                                      02949000
GPR12P   EQU   @12                                                      02950000
GPR14P   EQU   @14                                                      02951000
GPR15P   EQU   @15                                                      02952000
R4       EQU   @04                                                      02953000
R5       EQU   @05                                                      02954000
R6       EQU   @06                                                      02955000
R7       EQU   @07                                                      02956000
GPR13P   EQU   @13                                                      02957000
GPR15F   EQU   @15                                                      02958000
GPR00F   EQU   @00                                                      02959000
CMZX9904 EQU   @05                                                      02960000
CMZX9905 EQU   @05                                                      02961000
CMZX9906 EQU   @05                                                      02962000
CMZX9907 EQU   @05                                                      02963000
CMZX9908 EQU   @05                                                      02964000
CMZX9909 EQU   @05                                                      02965000
CMZX9903 EQU   @06                                                      02966000
CMZX9910 EQU   @06                                                      02967000
GPR02F   EQU   @02                                                      02968000
CMZX9902 EQU   @06                                                      02969000
CMZX9911 EQU   @12                                                      02970000
CMZX9912 EQU   @12                                                      02971000
CMZX9913 EQU   @07                                                      02972000
CMZX9914 EQU   @12                                                      02973000
CMZX9915 EQU   @07                                                      02974000
CMZX9916 EQU   @07                                                      02975000
CMZX9917 EQU   @07                                                      02976000
CMZX9918 EQU   @07                                                      02977000
CMZX9919 EQU   @12                                                      02978000
CMZX9921 EQU   @07                                                      02979000
CMZX9922 EQU   @07                                                      02980000
CMZX9923 EQU   @07                                                      02981000
CMZX9924 EQU   @07                                                      02982000
GPR01F   EQU   @01                                                      02983000
GPR03F   EQU   @03                                                      02984000
GPR04F   EQU   @04                                                      02985000
GPR05F   EQU   @05                                                      02986000
GPR06F   EQU   @06                                                      02987000
GPR07F   EQU   @07                                                      02988000
GPR08F   EQU   @08                                                      02989000
GPR08P   EQU   @08                                                      02990000
GPR09F   EQU   @09                                                      02991000
GPR09P   EQU   @09                                                      02992000
GPR10F   EQU   @10                                                      02993000
GPR10P   EQU   @10                                                      02994000
GPR11F   EQU   @11                                                      02995000
GPR11P   EQU   @11                                                      02996000
GPR12F   EQU   @12                                                      02997000
GPR13F   EQU   @13                                                      02998000
GPR14F   EQU   @14                                                      02999000
ISTPHROA EQU   0                                                        03000000
PHROALEN EQU   ISTPHROA                                                 03001000
PHROADTA EQU   ISTPHROA+4                                               03002000
CPHKWDTB EQU   0                                                        03003000
CPHENTNO EQU   CPHKWDTB                                                 03004000
CPHENTLN EQU   CPHKWDTB+2                                               03005000
CPHTABEN EQU   CPHKWDTB+4                                               03006000
CPHKEYWD EQU   CPHTABEN                                                 03007000
CPHFUNBT EQU   CPHTABEN+8                                               03008000
CPHPNTBK EQU   0                                                        03009000
CPHSBVAL EQU   CPHPNTBK                                                 03010000
CPHSBTAB EQU   CPHPNTBK+4                                               03011000
CPHSBYTE EQU   0                                                        03012000
CMZP0229 EQU   0                                                        03013000
PHRFN1OA EQU   PHROADTA                                                 03014000
PHRF1SAD EQU   PHRFN1OA                                                 03015000
PHRF1SLN EQU   PHRFN1OA+4                                               03016000
PHRFN2OA EQU   PHROADTA                                                 03017000
PHRF2NVL EQU   PHRFN2OA                                                 03018000
PHRF2VAL EQU   PHRFN2OA+4                                               03019000
PHRF2FLG EQU   PHRF2VAL+2                                               03020000
PHRF34OA EQU   PHROADTA                                                 03021000
PHRF34NS EQU   PHRF34OA                                                 03022000
PHRF34EN EQU   PHRF34OA+4                                               03023000
PHRF34VF EQU   PHRF34EN                                                 03024000
PHRF34SL EQU   PHRF34EN+2                                               03025000
PHRF34SP EQU   PHRF34EN+4                                               03026000
PHRFN5OA EQU   PHROADTA                                                 03027000
PHRF5NSP EQU   PHRFN5OA                                                 03028000
PHRF5ENT EQU   PHRFN5OA+4                                               03029000
PHRF5VF  EQU   PHRF5ENT                                                 03030000
PHRF5SL  EQU   PHRF5ENT+2                                               03031000
PHRF5SPT EQU   PHRF5ENT+4                                               03032000
PHRFN7OA EQU   PHROADTA                                                 03033000
PHRF7NSP EQU   PHRFN7OA                                                 03034000
PHRF7NUM EQU   PHRFN7OA+4                                               03035000
PHRFN8OA EQU   PHROADTA                                                 03036000
PHRF8NSP EQU   PHRFN8OA                                                 03037000
PHRF8ENT EQU   PHRFN8OA+4                                               03038000
PHRF8FLG EQU   PHRF8ENT                                                 03039000
PHRF8DFT EQU   PHRF8FLG                                                 03040000
PHRF8NUM EQU   PHRF8ENT+1                                               03041000
CPHF2VAL EQU   PHRF2VAL                                                 03042000
CPHSBVL1 EQU   CPHSUBVL                                                 03043000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03044000
@NM00004 EQU   PHRF8FLG                                                 03045000
@NM00003 EQU   PHRF5ENT+1                                               03046000
@NM00002 EQU   PHRF34EN+1                                               03047000
PHRF2MSK EQU   PHRF2VAL+3                                               03048000
PHRF2MV  EQU   PHRF2FLG                                                 03049000
PHRF2OFF EQU   PHRF2FLG                                                 03050000
PHRF2ON  EQU   PHRF2FLG                                                 03051000
@NM00001 EQU   PHRF2FLG                                                 03052000
PHRF2TR  EQU   PHRF2FLG                                                 03053000
PHRF2CL  EQU   PHRF2FLG                                                 03054000
PHRF2LN  EQU   PHRF2FLG                                                 03055000
PHRF2GP  EQU   PHRF2FLG                                                 03056000
PHRF2OFS EQU   PHRF2VAL                                                 03057000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03058000
@RC00098 EQU   @RC00096                                                 03059000
@RC00101 EQU   @RC00096                                                 03060000
@RC00105 EQU   @RC00096                                                 03061000
@RC00110 EQU   @RC00096                                                 03062000
@RC00115 EQU   @RC00096                                                 03063000
@RC00120 EQU   @RC00096                                                 03064000
@RC00125 EQU   @RC00096                                                 03065000
@RC00315 EQU   @RC00313                                                 03066000
@RC00438 EQU   @RC00437                                                 03067000
@RC00532 EQU   @RC00528                                                 03068000
@PB00009 EQU   @PB00010                                                 03069000
@RT00817 EQU   @RC00814                                                 03070000
@PB00023 EQU   @PB00024                                                 03071000
@PB00008 EQU   @PB00009                                                 03072000
@RC00534 EQU   @RC00532                                                 03073000
@PB00022 EQU   @PB00023                                                 03074000
@PB00007 EQU   @PB00008                                                 03075000
@PB00021 EQU   @PB00022                                                 03076000
@PB00006 EQU   @PB00007                                                 03077000
@PB00020 EQU   @PB00021                                                 03078000
@PB00005 EQU   @PB00006                                                 03079000
@PB00019 EQU   @PB00020                                                 03080000
@PB00004 EQU   @PB00005                                                 03081000
@PB00018 EQU   @PB00019                                                 03082000
@PB00003 EQU   @PB00004                                                 03083000
@PB00017 EQU   @PB00018                                                 03084000
@PB00002 EQU   @PB00003                                                 03085000
@PB00016 EQU   @PB00017                                                 03086000
@RC00062 EQU   @PB00002                                                 03087000
@PB00015 EQU   @PB00016                                                 03088000
@PB00014 EQU   @PB00015                                                 03089000
@PB00013 EQU   @PB00014                                                 03090000
@PB00012 EQU   @PB00013                                                 03091000
@PB00011 EQU   @PB00012                                                 03092000
@RC00582 EQU   @PB00011                                                 03093000
@ENDDATA EQU   *                                                        03094000
         END   ISTINCPH,(C'PLS1908',0702,79061)                         03095000
