SVTM     TITLE ' SSCP  ISTINFY1  OS/VS APUNS TRANS I/O EXEC'            00001000
ISTINCY1 CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'ISTINCY1  78.336'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00009000
         BALR  @12,0                                            01S0001 00010000
@PSTART  DS    0H                                               01S0001 00011000
         USING @PSTART,@12                                      01S0001 00012000
         PRINT OFF                                                      00013000
         PRINT ON                                                       00014000
         PRINT OFF                                                      00015000
         PRINT ON                                                       00016000
*      /* MAINLINE CODE OF ISTINFY1  */                         01S0543 00017000
* R1INPUT = R1;         /* SAVE ADDR(INPUT PARAMETER LIST) */   01S0543 00018000
         LR    R1INPUT,R1                                       01S0543 00019000
* RFY FY1PARML BASED(R1INPUT);     /* ADDRESSABILITY FOR PLIST */       00020000
* RFY GTSTOREG RSTD;       /* RESTRICT GETSTORE OUTPUT REG */   01S0545 00021000
*   DO; /* GETSTOR  SIZE(LENGTH(FY1WORKA)+@SIZDATD-4)TYPE(PAGEABLE)CLEA 00022000
*(NO)SAVE(NO) */                                                01S0546 00023000
*                                                               01S0547 00024000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */               01S0547 00025000
*/* END OF ATBUILD */                                           01S0547 00026000
*                                                               01S0547 00027000
*                                                               01S0547 00028000
*   DO;                                                         01S0547 00029000
*   END;                                                        01S0548 00030000
*                                                               01S0549 00031000
*                                                               01S0549 00032000
*   DO;                                                         01S0549 00033000
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                     01S0550 00034000
*   END;                                                        01S0551 00035000
*     GPR00F = LENGTH(FY1WORKA)+@SIZDATD-4;            /*SIZE IN REG0*/ 00036000
         L     GPR00F,@SIZDATD                                  01S0552 00037000
         SL    GPR00F,@CF03280                                  01S0552 00038000
*     DCL 1 CMZA0006 FIXED(31) STATIC LOCAL,                    01S0553 00039000
*           2 * FIXED(8) INIT(0),                    /* OPTION FLAGS */ 00040000
*           2 * FIXED(8) INIT(96),                    /* STORAGE KEY */ 00041000
*           2 * FIXED(8) INIT(231),                /* SUBPOOL NUMBER */ 00042000
*           2 * FIXED(8) INIT('00'X);                /* REQUEST TYPE */ 00043000
*     GPR03F = CMZA0006;                                        01S0554 00044000
*                                                               01S0554 00045000
         L     GPR03F,CMZA0006                                  01S0554 00046000
*   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */               01S0555 00047000
*     GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/               01S0556 00048000
         L     GPR02P,ATCLCPTR                                  01S0556 00049000
*   END; /*LISATCVT*/                                           01S0557 00050000
*     CALL GPR02P -> ATCGTSTR;                        /*CALL ISTORFSR*/ 00051000
*                                                               01S0558 00052000
*                                                               01S0558 00053000
         L     @15,ATCGTSTR(,GPR02P)                            01S0558 00054000
         BALR  @14,@15                                          01S0558 00055000
*   DO;                                                         01S0559 00056000
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P) UNRSTD;                   01S0560 00057000
*   END;                                                        01S0561 00058000
*                                                               01S0562 00059000
*   END;/* GETSTOR */                                           01S0562 00060000
* IF R15^=0                          /*GETSTORE OK ? */         01S0563 00061000
*    THEN RETCODE = THRTYTWO;               /* SET RC = 32  */  01S0563 00062000
         LTR   R15,R15                                          01S0563 00063000
         BZ    @RF00563                                         01S0563 00064000
         LA    RETCODE,32                                       01S0564 00065000
*      ELSE DO;                             /*GETSTOR OK    */  01S0565 00066000
         B     @RC00563                                         01S0565 00067000
@RF00563 DS    0H                                               01S0566 00068000
*      R15  = R13;                /*TEMP SAVE CALLERS REGSV PTR*/       00069000
         LR    R15,R13                                          01S0566 00070000
*      R13 =GTSTOREG;                /* REG SAVE PTR      */    01S0567 00071000
         LR    R13,GTSTOREG                                     01S0567 00072000
* RFY GTSTOREG UNRSTD;                                          01S0568 00073000
* RFY FY1WORKA BASED(R13);  /* ADDRESSABILITY FOR WORK AREA */  01S0569 00074000
* R15->FY1FWDPT = R13;              /* SET CALLERS FORWARD PTR */       00075000
         ST    R13,FY1FWDPT(,R15)                               01S0570 00076000
* R13->FY1BAKPT = R15;             /* SET ISTINFY1 BACK PTR */  01S0571 00077000
         ST    R15,FY1BAKPT(,R13)                               01S0571 00078000
* R13-> FY1FWDPT = 0;           /* ZERO ISTINFY1 FORWARD PTR */ 01S0572 00079000
         SLR   @14,@14                                          01S0572 00080000
         ST    @14,FY1FWDPT(,R13)                               01S0572 00081000
* R10 = ADDR(FY1EXTRA);           /* GET ADDR OF COMPILER VARIABLES */  00082000
         LA    R10,FY1EXTRA(,R13)                               01S0573 00083000
* GEN REFS(R10);                                                01S0574 00084000
      USING @DATD,R10            ADDRESSABILITY FOR COMPILER VARIABLES  00085000
*      RFY ISTNCSPL BASED(FY1NCSPL);       /* BASE FOR NCSPL */ 01S0575 00086000
*                                                               01S0575 00087000
*        FY1IOB = FY1IOB && FY1IOB;          /* ZERO IOB   */   01S0576 00088000
         XC    FY1IOB(40,R13),FY1IOB(R13)                       01S0576 00089000
*        FY1IOBW1= IOBWORD1;               /* INIT FIRST WD IOB */      00090000
         MVC   FY1IOBW1(4,R13),@CB03180                         01S0577 00091000
*        FY1IOBW2 = ADDR(FY1ECB);       /* W2 IOB = @ ECB */    01S0578 00092000
         LA    @14,FY1ECB(,R13)                                 01S0578 00093000
         ST    @14,FY1IOBW2(,R13)                               01S0578 00094000
*        FY1IOBW5 = FY1CHPGM;               /* W5 IOB = @ CHAN PGM*/    00095000
         L     @14,FY1CHPGM(,R1INPUT)                           01S0579 00096000
         ST    @14,FY1IOBW5(,R13)                               01S0579 00097000
*        FY1IOBW6 = NCSPLRPT->RPRNSNEA->RPRNCBA->ICNDCBAD;      01S0580 00098000
         L     @14,FY1NCSPL(,R1INPUT)                           01S0580 00099000
         L     @14,NCSPLRPT(,@14)                               01S0580 00100000
         L     @14,RPRNSNEA(,@14)                               01S0580 00101000
         L     @14,RPRNCBA(,@14)                                01S0580 00102000
         L     @09,ICNDCBAD-1(,@14)                             01S0580 00103000
         LA    @09,0(,@09)                                      01S0580 00104000
         ST    @09,FY1IOBW6(,R13)                               01S0580 00105000
*        FY1CC3WE = '1'B;                   /* POST ON CC=3  @ZA27624*/ 00106000
*                                                               01S0581 00107000
         OI    FY1CC3WE(R13),B'01000000'                        01S0581 00108000
*        ACDEBPTR = NCSPLRPT->RPRNSNEA->RPRNCBA->ICNDEBAD;      01S0582 00109000
         L     ACDEBPTR,ICNDEBAD-1(,@14)                        01S0582 00110000
         LA    ACDEBPTR,0(,ACDEBPTR)                            01S0582 00111000
*        ICNCBPTR = NCSPLRPT->RPRNSNEA->RPRNCBA;           /*@AM00431*/ 00112000
         LR    ICNCBPTR,@14                                     01S0583 00113000
*        RFY ISTACDEB BASED(ACDEBPTR); /* BASEING FOR ACDEB */  01S0584 00114000
*        RFY ISTICNCB BASED(ICNCBPTR); /* BASEING FOR ICNCB  @AM00431*/ 00115000
*                                                               01S0585 00116000
*        FY1ECB=ZERO;       /* ZERO ECB */                      01S0586 00117000
         SLR   @14,@14                                          01S0586 00118000
         ST    @14,FY1ECB(,R13)                                 01S0586 00119000
*   EVAL(FY1IOBW6+FORTFOUR)->DCBBITS=FY1BITON; /* BITS ON */    01S0587 00120000
         LA    @14,44                                           01S0587 00121000
         AL    @14,FY1IOBW6(,R13)                               01S0587 00122000
         OI    DCBBITS(@14),B'00001100'                         01S0587 00123000
*        FAPPADSV = ICNAPPAD;       /* SAVE CURRENT STATUS   @AM00431*/ 00124000
         L     FAPPADSV,ICNAPPAD-1(,ICNCBPTR)                   01S0588 00125000
         LA    FAPPADSV,0(,FAPPADSV)                            01S0588 00126000
*        ICNAPPAD = ADDR(ATCDAPVT); /*UNHOOK TPIOS APPENDAGE @AM00431*/ 00127000
*                                                               01S0589 00128000
         L     @14,ATCLCPTR                                     01S0589 00129000
         LA    @14,ATCDAPVT(,@14)                               01S0589 00130000
         STCM  @14,7,ICNAPPAD(ICNCBPTR)                         01S0589 00131000
*               /* END OF INITILIZATION OF IOB  */              01S0590 00132000
*                                                               01S0590 00133000
*/*VMDESET  ((15),ZERO,(2))*/                                   01S0590 00134000
*      DO;                               /* INVOKE MODESET MACRO    */  00135000
*        GEN SETS (2);                                          01S0591 00136000
*                                                               01S0591 00137000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00138000
*      DO; /* CMZMREG (15) RESTRICT */                          01S0592 00139000
*      RFY (GPR15P) RSTD;                                       01S0593 00140000
*                                                               01S0593 00141000
*      END;/* CMZMREG */                                        01S0594 00142000
*        GPR15F=0;                                              01S0595 00143000
*                                                               01S0595 00144000
         SLR   GPR15F,GPR15F                                    01S0595 00145000
*      DO; /* CMZMREG (15) RELEASE */                           01S0596 00146000
*      RFY (GPR15P) UNRSTD;                                     01S0597 00147000
*                                                               01S0597 00148000
*      END;/* CMZMREG */                 /*PUT RETURN CODE IN RCREG*/   00149000
*      END;  /* VMDESET */                            /*@VS44020*/      00150000
*      R1 = ADDR(ICNUCBAD);                    /*PASS UCB    @VS44020*/ 00151000
         LA    R1,ICNUCBAD(,ICNCBPTR)                           01S0600 00152000
*      CALL ATCVIOPM;           /*GET PATH ASSUME SUCCESS    @VS44020*/ 00153000
*                                                               01S0601 00154000
         L     @09,ATCLCPTR                                     01S0601 00155000
         L     @15,ATCVIOPM(,@09)                               01S0601 00156000
         BALR  @14,@15                                          01S0601 00157000
*/*VMDESET  ((15),,,(2))*/                                      01S0602 00158000
*       DO;                              /* INVOKE MODESET MACRO    */  00159000
*         GEN SETS (2);                                         01S0603 00160000
*                                                               01S0603 00161000
         MODESET KEYADDR=(2),WORKREG=2                                  00162000
*       DO; /* CMZMREG (15) RESTRICT */                         01S0604 00163000
*       RFY (GPR15P) RSTD;                                      01S0605 00164000
*                                                               01S0605 00165000
*       END;/* CMZMREG */                                       01S0606 00166000
*         GPR15F=0;                                             01S0607 00167000
*                                                               01S0607 00168000
         SLR   GPR15F,GPR15F                                    01S0607 00169000
*       DO; /* CMZMREG (15) RELEASE */                          01S0608 00170000
*       RFY (GPR15P) UNRSTD;                                    01S0609 00171000
*                                                               01S0609 00172000
*       END;/* CMZMREG */                /*PUT RETURN CODE IN RCREG*/   00173000
*       END;  /* VMDESET */                              /*@VS44020*/   00174000
*        R1 = ADDR(FY1IOB);          /* ADDR OF IOB */          01S0612 00175000
         LA    R1,FY1IOB(,R13)                                  01S0612 00176000
* GEN CODE SETS(FY1IOB,FY1ECB) REFS(R1);                   /*@AM00432*/ 00177000
         EXCP (R1)                                                      00178000
         WAIT ECB=FY1ECB(,13)                                           00179000
*       IF FY1ECBRC = FY1IONRM              /*I/O COMP NORM?*/  01S0614 00180000
*         & FY1CSWST = FY1CEDE              /* AND CE, DE ONLY */       00181000
*         THEN                              /* YES  */          01S0614 00182000
         CLI   FY1ECBRC(R13),X'7F'                              01S0614 00183000
         BNE   @RF00614                                         01S0614 00184000
         CLC   FY1CSWST(2,R13),@CB00880                         01S0614 00185000
         BNE   @RF00614                                         01S0614 00186000
*           RETCODE = ZERO;                /* GOOD RC  */       01S0615 00187000
         SLR   RETCODE,RETCODE                                  01S0615 00188000
*         ELSE DO;                          /* NOT NORM I/O */  01S0616 00189000
         B     @RC00614                                         01S0616 00190000
@RF00614 DS    0H                                               01S0617 00191000
*           IF FY1SIOCC = FY1BITON          /* SIO CC = 3? */   01S0617 00192000
*              THEN                         /* YES  */          01S0617 00193000
         TM    FY1SIOCC(R13),B'00110000'                        01S0617 00194000
         BNO   @RF00617                                         01S0617 00195000
*                RETCODE = EIGHT;          /* RC = 8  */        01S0618 00196000
         LA    RETCODE,8                                        01S0618 00197000
*              ELSE DO;                     /* SIO CC ^=3 */    01S0619 00198000
         B     @RC00617                                         01S0619 00199000
@RF00617 DS    0H                                               01S0620 00200000
*                RETCODE = FOUR;           /* RC = 4  */        01S0620 00201000
         LA    RETCODE,4                                        01S0620 00202000
*                FYENDCSW->FY1CSW = FY1IOBW3;                   01S0621 00203000
         L     @14,FYENDCSW(,R1INPUT)                           01S0621 00204000
         MVC   FY1CSW(8,@14),FY1IOBW3(R13)                      01S0621 00205000
*                FY1SENSE->CY1SENS = FY1SDATA;                  01S0622 00206000
         L     @14,FY1SENSE(,R1INPUT)                           01S0622 00207000
         MVC   CY1SENS(2,@14),FY1SDATA(R13)                     01S0622 00208000
*                   END;                    /* END SIO CC ^=3 */        00209000
*              END;                         /* END NOT NORM I/O */      00210000
*                                                               01S0624 00211000
@RC00617 DS    0H                                               01S0625 00212000
*          ICNAPPAD = FAPPADSV;      /* HOOK UP TPIOS APDG   @AM00431*/ 00213000
@RC00614 STCM  FAPPADSV,7,ICNAPPAD(ICNCBPTR)                    01S0625 00214000
*   EVAL(FY1IOBW6+FORTFOUR)->DCBBITS=FY1BTOFF; /* BITS ON    @AM00430*/ 00215000
         LA    @14,44                                           01S0626 00216000
         AL    @14,FY1IOBW6(,R13)                               01S0626 00217000
         NI    DCBBITS(@14),B'11110011'                         01S0626 00218000
*    R13 = R13->FY1BAKPT;    /* RESTORE ADDR CALLER SAVE AREA */        00219000
         L     R13,FY1BAKPT(,R13)                               01S0627 00220000
*    R11 = RETCODE;        /* SAVE EXTERNAL RETURN CODE */      01S0628 00221000
*                                                               01S0628 00222000
         LR    R11,RETCODE                                      01S0628 00223000
*     DO; /* FREESTOR  AREA((R13->FY1FWDPT))SIZE(LENGTH(FY1WORKA)+@SIZD 00224000
*TD-4)TYPE(PAGEABLE)CLEAR(NO)SAVE(NO) */                        01S0629 00225000
*                                                               01S0630 00226000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */               01S0630 00227000
*/* END OF ATBUILD */                                           01S0630 00228000
*                                                               01S0630 00229000
*                                                               01S0630 00230000
*     DO;                                                       01S0630 00231000
*     END;                                                      01S0631 00232000
*                                                               01S0632 00233000
*                                                               01S0632 00234000
*     DO;                                                       01S0632 00235000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                   01S0633 00236000
*     END;                                                      01S0634 00237000
*       GPR00F = LENGTH(FY1WORKA)+@SIZDATD-4;          /*SIZE IN REG0*/ 00238000
         L     GPR00F,@SIZDATD                                  01S0635 00239000
         SL    GPR00F,@CF03280                                  01S0635 00240000
*       DCL 1 CMZA0044 FIXED(31) STATIC LOCAL,                  01S0636 00241000
*             2 * FIXED(8) INIT(0),                  /* OPTION FLAGS */ 00242000
*             2 * FIXED(8) INIT(96),                  /* STORAGE KEY */ 00243000
*             2 * FIXED(8) INIT(231),              /* SUBPOOL NUMBER */ 00244000
*             2 * FIXED(8) INIT('01'X);              /* REQUEST TYPE */ 00245000
*       GPR03F = CMZA0044;                                      01S0637 00246000
*                                                               01S0637 00247000
*                                                               01S0637 00248000
         L     GPR03F,CMZA0044                                  01S0637 00249000
*     DO;                                                       01S0638 00250000
*     RFY (GPR04P) RSTD;                                        01S0639 00251000
*     END;                                                      01S0640 00252000
*       GPR04P = (R13->FY1FWDPT);         /*PUT FREEMAIN ADDR IN REG4*/ 00253000
*                                                               01S0641 00254000
         L     GPR04P,FY1FWDPT(,R13)                            01S0641 00255000
*     DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */             01S0642 00256000
*       GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/             01S0643 00257000
         L     GPR02P,ATCLCPTR                                  01S0643 00258000
*     END; /*LISATCVT*/                                         01S0644 00259000
*       CALL GPR02P -> ATCGTSTR;                      /*CALL ISTORFSR*/ 00260000
*                                                               01S0645 00261000
*                                                               01S0645 00262000
         L     @15,ATCGTSTR(,GPR02P)                            01S0645 00263000
         BALR  @14,@15                                          01S0645 00264000
*     DO;                                                       01S0646 00265000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRSTD;          01S0647 00266000
*     END;                                                      01S0648 00267000
*                                                               01S0649 00268000
*     END;/* FREESTOR */                                        01S0649 00269000
*                                                               01S0649 00270000
*                                                               01S0649 00271000
*    END;                           /* END GET STOR OK */       01S0650 00272000
*RETURN CODE(R11);      /* RETURN TO THE CALLER */              01S0651 00273000
*                                                               01S0651 00274000
@RC00563 LR    @15,R11                                          01S0651 00275000
         L     @14,12(,@13)                                     01S0651 00276000
         LM    @00,@12,20(@13)                                  01S0651 00277000
         BR    @14                                              01S0651 00278000
*   DO; /* TPEPILOG   */                                        01S0652 00279000
*                                                               01S0653 00280000
*   GEN (PRINT OFF);                                            01S0653 00281000
*                                                               01S0653 00282000
         PRINT OFF                                                      00283000
*   DO;                                                         01S0654 00284000
*   DCL GPR00F FIXED(31) REG(00),GPR00P PTR(31) REG(00),GPR01F FIXED(31 00285000
* REG(01),GPR01P PTR(31) REG(01),GPR02F FIXED(31) REG(02),GPR02P PTR(31 00286000
* REG(02),GPR03F FIXED(31) REG(03),GPR03P PTR(31) REG(03),GPR04F FIXED( 00287000
*1) REG(04),GPR04P PTR(31) REG(04),GPR05F FIXED(31) REG(05),GPR05P PTR( 00288000
*1) REG(05),GPR06F FIXED(31) REG(06),GPR06P PTR(31) REG(06),GPR07F FIXE 00289000
*(31) REG(07),GPR07P PTR(31) REG(07),GPR08F FIXED(31) REG(08),GPR08P PT 00290000
*(31) REG(08),GPR09F FIXED(31) REG(09),GPR09P PTR(31) REG(09),GPR10F FI 00291000
*ED(31) REG(10),GPR10P PTR(31) REG(10),GPR11F FIXED(31) REG(11),GPR11P  00292000
*TR(31) REG(11),GPR12F FIXED(31) REG(12),GPR12P PTR(31) REG(12),GPR13F  00293000
*IXED(31) REG(13),GPR13P PTR(31) REG(13),GPR14F FIXED(31) REG(14),GPR14 00294000
* PTR(31) REG(14),GPR15F FIXED(31) REG(15),GPR15P PTR(31) REG(15);      00295000
*   END;                                                        01S0656 00296000
*                                                               01S0657 00297000
*   GEN (PRINT ON);                                             01S0657 00298000
         PRINT ON                                                       00299000
*   END;/* TPEPILOG */                                          01S0658 00300000
*      END                   /* END OF PROCEDURE ISTINFY1 */    01S0659 00301000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00302000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        * 00303000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00304000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        * 00305000
*;                                                              01S0659 00306000
@EL00001 DS    0H                                               01S0659 00307000
@EF00001 DS    0H                                               01S0659 00308000
@ER00001 LM    @14,@12,12(@13)                                  01S0659 00309000
         BR    @14                                              01S0659 00310000
@DATA    DS    0H                                                       00311000
@DATD    DSECT                                                          00312000
         DS    0F                                                       00313000
ISTINCY1 CSECT                                                          00314000
         DS    0F                                                       00315000
@CF03280 DC    F'-120'                                                  00316000
@DATD    DSECT                                                          00317000
         DS    0D                                                       00318000
IOSBPTR  DS    A                                                        00319000
SRBPTR   DS    A                                                        00320000
IOBPRPTR DS    A                                                        00321000
IOBSTPTR DS    A                                                        00322000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00323000
@ENDDATD EQU   *                                                        00324000
ISTINCY1 CSECT                                                          00325000
         DS    0F                                                       00326000
@SIZDATD DC    AL1(0)                                                   00327000
         DC    AL3(@ENDDATD-@DATD)                                      00328000
         DS    0D                                                       00329000
CMZA0006 DS    FL4                                                      00330000
         ORG   CMZA0006                                                 00331000
@NM00291 DC    AL1(0)                                                   00332000
@NM00292 DC    AL1(96)                                                  00333000
@NM00293 DC    AL1(231)                                                 00334000
@NM00294 DC    XL1'00'                                                  00335000
         ORG   CMZA0006+4                                               00336000
CMZA0044 DS    FL4                                                      00337000
         ORG   CMZA0044                                                 00338000
@NM00295 DC    AL1(0)                                                   00339000
@NM00296 DC    AL1(96)                                                  00340000
@NM00297 DC    AL1(231)                                                 00341000
@NM00298 DC    XL1'01'                                                  00342000
         ORG   CMZA0044+4                                               00343000
@CB03180 DC    X'42000000'                                              00344000
@CB00880 DC    X'0C00'                                                  00345000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00346000
@01      EQU   01                                                       00347000
@02      EQU   02                                                       00348000
@03      EQU   03                                                       00349000
@04      EQU   04                                                       00350000
@05      EQU   05                                                       00351000
@06      EQU   06                                                       00352000
@07      EQU   07                                                       00353000
@08      EQU   08                                                       00354000
@09      EQU   09                                                       00355000
@10      EQU   10                                                       00356000
@11      EQU   11                                                       00357000
@12      EQU   12                                                       00358000
@13      EQU   13                                                       00359000
@14      EQU   14                                                       00360000
@15      EQU   15                                                       00361000
RETCODE  EQU   @07                                                      00362000
FAPPADSV EQU   @08                                                      00363000
ICNCBPTR EQU   @04                                                      00364000
ACDEBPTR EQU   @04                                                      00365000
RPHPTR   EQU   @01                                                      00366000
R0       EQU   @00                                                      00367000
R1       EQU   @01                                                      00368000
R2       EQU   @02                                                      00369000
R1INPUT  EQU   @11                                                      00370000
GTSTOREG EQU   @03                                                      00371000
BASEREG  EQU   @12                                                      00372000
R10      EQU   @10                                                      00373000
R11      EQU   @11                                                      00374000
R13      EQU   @13                                                      00375000
R15      EQU   @15                                                      00376000
GPR00P   EQU   @00                                                      00377000
GPR01P   EQU   @01                                                      00378000
GPR02P   EQU   @02                                                      00379000
GPR03P   EQU   @03                                                      00380000
GPR00F   EQU   @00                                                      00381000
GPR03F   EQU   @03                                                      00382000
GPR15P   EQU   @15                                                      00383000
GPR15F   EQU   @15                                                      00384000
GPR04P   EQU   @04                                                      00385000
GPR01F   EQU   @01                                                      00386000
GPR02F   EQU   @02                                                      00387000
GPR04F   EQU   @04                                                      00388000
GPR05F   EQU   @05                                                      00389000
GPR05P   EQU   @05                                                      00390000
GPR06F   EQU   @06                                                      00391000
GPR06P   EQU   @06                                                      00392000
GPR07F   EQU   @07                                                      00393000
GPR07P   EQU   @07                                                      00394000
GPR08F   EQU   @08                                                      00395000
GPR08P   EQU   @08                                                      00396000
GPR09F   EQU   @09                                                      00397000
GPR09P   EQU   @09                                                      00398000
GPR10F   EQU   @10                                                      00399000
GPR10P   EQU   @10                                                      00400000
GPR11F   EQU   @11                                                      00401000
GPR11P   EQU   @11                                                      00402000
GPR12F   EQU   @12                                                      00403000
GPR12P   EQU   @12                                                      00404000
GPR13F   EQU   @13                                                      00405000
GPR13P   EQU   @13                                                      00406000
GPR14F   EQU   @14                                                      00407000
GPR14P   EQU   @14                                                      00408000
ATCLCPTR EQU   1032                                                     00409000
IOSB     EQU   0                                                        00410000
IOSFLA   EQU   IOSB                                                     00411000
IOSACHN  EQU   IOSFLA                                                   00412000
IOSFLB   EQU   IOSB+1                                                   00413000
IOSFLC   EQU   IOSB+2                                                   00414000
IOSDVALT EQU   IOSFLC                                                   00415000
IOSPKEY  EQU   IOSB+12                                                  00416000
IOSOPT   EQU   IOSB+14                                                  00417000
IOSOPT2  EQU   IOSB+15                                                  00418000
@NM00002 EQU   IOSB+20                                                  00419000
IOSCSW   EQU   @NM00002+1                                               00420000
IOSTATUS EQU   IOSCSW+3                                                 00421000
IOSIPIB  EQU   IOSB+44                                                  00422000
IOSPATH  EQU   IOSB+86                                                  00423000
IOSCHN   EQU   IOSPATH                                                  00424000
IOSCKEY  EQU   IOSB+89                                                  00425000
IOSEEKA  EQU   IOSB+100                                                 00426000
IOSCCHH  EQU   IOSEEKA+3                                                00427000
IOSSKHH  EQU   IOSCCHH+2                                                00428000
SRBSECT  EQU   0                                                        00429000
SRBFLC   EQU   SRBSECT+12                                               00430000
IOBPREFX EQU   0                                                        00431000
IOBCFLG1 EQU   IOBPREFX                                                 00432000
IOBSTDRD EQU   0                                                        00433000
IOBFLAG1 EQU   IOBSTDRD                                                 00434000
IOBCYCCK EQU   IOBFLAG1                                                 00435000
IOBRSTRT EQU   IOBFLAG1                                                 00436000
IOBFLAG2 EQU   IOBSTDRD+1                                               00437000
IOBPURGE EQU   IOBFLAG2                                                 00438000
IOBRDHA0 EQU   IOBFLAG2                                                 00439000
IOBSENS0 EQU   IOBSTDRD+2                                               00440000
IOBS0B7  EQU   IOBSENS0                                                 00441000
IOBSENS1 EQU   IOBSTDRD+3                                               00442000
IOBECBPT EQU   IOBSTDRD+4                                               00443000
IOBFLAG3 EQU   IOBSTDRD+8                                               00444000
IOBFL3   EQU   IOBFLAG3                                                 00445000
IOBCNC   EQU   IOBFL3                                                   00446000
IOBICL   EQU   IOBFL3                                                   00447000
IOBCSW   EQU   IOBSTDRD+9                                               00448000
IOBIOCSW EQU   IOBCSW                                                   00449000
IOBSTBYT EQU   IOBIOCSW+3                                               00450000
IOBUSTAT EQU   IOBSTBYT                                                 00451000
IOBCSTAT EQU   IOBSTBYT+1                                               00452000
IOBSTART EQU   IOBSTDRD+16                                              00453000
IOBDCBPT EQU   IOBSTDRD+20                                              00454000
IOBFLAG4 EQU   IOBDCBPT                                                 00455000
IOBRESTR EQU   IOBSTDRD+24                                              00456000
IOBINCAM EQU   IOBSTDRD+28                                              00457000
IOBBTAMF EQU   IOBINCAM                                                 00458000
ISTPOHD  EQU   0                                                        00459000
POHSTAT  EQU   ISTPOHD+1                                                00460000
ISTCPCB  EQU   0                                                        00461000
CPCBFL   EQU   ISTCPCB+2                                                00462000
CPCBTD   EQU   ISTCPCB+8                                                00463000
@NM00010 EQU   CPCBTD                                                   00464000
CPCBPH   EQU   CPCBTD+4                                                 00465000
CPCBOPC  EQU   ISTCPCB+16                                               00466000
ISTNCSPL EQU   0                                                        00467000
NCSPFX   EQU   ISTNCSPL                                                 00468000
NCSFLAGS EQU   NCSPFX+2                                                 00469000
NCSPLWEL EQU   NCSPFX+8                                                 00470000
@NM00018 EQU   NCSPFX+16                                                00471000
NCSVERB  EQU   @NM00018+1                                               00472000
NCSPLVBF EQU   NCSVERB+1                                                00473000
NCSPLSID EQU   NCSPFX+35                                                00474000
NCSPLSTA EQU   NCSPLSID                                                 00475000
NCSPLPHD EQU   NCSPLSID+1                                               00476000
NCSCRRTN EQU   ISTNCSPL+44                                              00477000
NCSPLVFL EQU   ISTNCSPL+45                                              00478000
NCSPLLID EQU   ISTNCSPL+61                                              00479000
NCSCDRMN EQU   NCSPLLID                                                 00480000
NCSPLRPT EQU   ISTNCSPL+80                                              00481000
NCSPLCMD EQU   ISTNCSPL+88                                              00482000
NCSCMDA  EQU   NCSPLCMD                                                 00483000
NCSITFL2 EQU   ISTNCSPL+90                                              00484000
NCSCRFLG EQU   ISTNCSPL+95                                              00485000
NCSIOCID EQU   ISTNCSPL+176                                             00486000
NCSPLCID EQU   NCSIOCID                                                 00487000
NCSMDFY  EQU   ISTNCSPL+188                                             00488000
NCSPLFSB EQU   ISTNCSPL+196                                             00489000
NCSPLFL1 EQU   ISTNCSPL+204                                             00490000
NCSPLFL2 EQU   ISTNCSPL+205                                             00491000
NCSPLFL3 EQU   ISTNCSPL+206                                             00492000
NCSPLFL4 EQU   ISTNCSPL+207                                             00493000
NCSPLFL5 EQU   ISTNCSPL+209                                             00494000
NCSPLAPP EQU   ISTNCSPL+244                                             00495000
NCSRNAME EQU   ISTNCSPL+248                                             00496000
NCSSENSE EQU   ISTNCSPL+272                                             00497000
NCSPLREP EQU   ISTNCSPL+276                                             00498000
NCSCRMSK EQU   ISTNCSPL+296                                             00499000
NCSCHKPT EQU   NCSCRMSK                                                 00500000
NCSCRMOD EQU   NCSCRMSK+2                                               00501000
NCSPLITF EQU   0                                                        00502000
NCSITFL1 EQU   NCSPLITF                                                 00503000
NCSAPP   EQU   0                                                        00504000
NCSAPBUE EQU   NCSAPP+88                                                00505000
NCSUSSRU EQU   0                                                        00506000
ISTSRT   EQU   0                                                        00507000
SRTSRTE  EQU   ISTSRT+8                                                 00508000
SRTXTNBS EQU   ISTSRT+13                                                00509000
ISTDEVCH EQU   0                                                        00510000
DEVSHCH  EQU   ISTDEVCH                                                 00511000
DEVCHAR  EQU   DEVSHCH                                                  00512000
DEVTCODE EQU   ISTDEVCH+1                                               00513000
DEVFLAGS EQU   ISTDEVCH+3                                               00514000
DEVFCCTL EQU   DEVFLAGS                                                 00515000
DEVCHAR3 EQU   DEVFLAGS                                                 00516000
DEVMODE  EQU   ISTDEVCH+5                                               00517000
ISTLOK   EQU   0                                                        00518000
LOKCHN   EQU   ISTLOK+1                                                 00519000
LOKCHNG  EQU   LOKCHN                                                   00520000
@NM00035 EQU   LOKCHNG+2                                                00521000
ISTRPRE  EQU   0                                                        00522000
RPRSRTHD EQU   ISTRPRE                                                  00523000
RPRDAFID EQU   ISTRPRE+16                                               00524000
RPRNCBA  EQU   ISTRPRE+40                                               00525000
RPRNSNEA EQU   ISTRPRE+44                                               00526000
RPRSTATE EQU   ISTRPRE+56                                               00527000
RPRCURST EQU   RPRSTATE                                                 00528000
RPRDESST EQU   RPRSTATE+2                                               00529000
RPRBITAN EQU   ISTRPRE+61                                               00530000
ISTRCPRE EQU   0                                                        00531000
RCPSARRY EQU   ISTRCPRE+84                                              00532000
RCPPACE  EQU   ISTRCPRE+108                                             00533000
RCPNCPPC EQU   ISTRCPRE+110                                             00534000
RCPPMODE EQU   ISTRCPRE+113                                             00535000
RCPCYMOD EQU   RCPPMODE                                                 00536000
RCPCYSET EQU   RCPPMODE                                                 00537000
RCPSESSM EQU   ISTRCPRE+115                                             00538000
RCPBITAN EQU   ISTRCPRE+116                                             00539000
ISTRAP   EQU   0                                                        00540000
RAPBITAN EQU   ISTRAP+165                                               00541000
ISTRDT   EQU   0                                                        00542000
RDTPLEN  EQU   ISTRDT+84                                                00543000
RDTPRIOR EQU   RDTPLEN                                                  00544000
RDTBITAN EQU   ISTRDT+113                                               00545000
RDTCRIA  EQU   ISTRDT+116                                               00546000
ISTRLN   EQU   0                                                        00547000
RLNADR   EQU   ISTRLN+84                                                00548000
RLNFLAG  EQU   RLNADR                                                   00549000
RLNUCBAD EQU   RLNADR+1                                                 00550000
RLNCSLRC EQU   ISTRLN+104                                               00551000
RLNBITAN EQU   ISTRLN+112                                               00552000
RLNRACNT EQU   RLNBITAN                                                 00553000
RLNLSCMD EQU   RLNBITAN+3                                               00554000
RLNCUA   EQU   ISTRLN+120                                               00555000
ISTRAPRE EQU   0                                                        00556000
ISTRTR   EQU   0                                                        00557000
RTRADR   EQU   ISTRTR+144                                               00558000
RTRFLAG  EQU   RTRADR                                                   00559000
RTRBITAN EQU   ISTRTR+164                                               00560000
RTRRAALL EQU   RTRBITAN                                                 00561000
RTRBSCID EQU   ISTRTR+171                                               00562000
ISTRSW   EQU   0                                                        00563000
ISTRRN   EQU   0                                                        00564000
RRNADR   EQU   ISTRRN+136                                               00565000
RRNFLAG  EQU   RRNADR                                                   00566000
RRNUCBAD EQU   RRNADR+1                                                 00567000
RRNHPRE  EQU   ISTRRN+196                                               00568000
RRNBITAN EQU   ISTRRN+201                                               00569000
RRNLVL   EQU   ISTRRN+204                                               00570000
RRNNMDPD EQU   ISTRRN+232                                               00571000
ISTRPX   EQU   0                                                        00572000
ISTRPT   EQU   0                                                        00573000
RPTXTCID EQU   ISTRPT+128                                               00574000
RPTLNCID EQU   RPTXTCID                                                 00575000
RPTDITT  EQU   ISTRPT+136                                               00576000
RPTBITAN EQU   ISTRPT+158                                               00577000
ISTRLX   EQU   0                                                        00578000
RLXBITAN EQU   ISTRLX+92                                                00579000
ISTRLU   EQU   0                                                        00580000
RLUBITAN EQU   ISTRLU+146                                               00581000
ISTRLS   EQU   0                                                        00582000
ISTRLC   EQU   0                                                        00583000
RLCADR   EQU   ISTRLC+84                                                00584000
RLCFLAG  EQU   RLCADR                                                   00585000
ISTRIN   EQU   0                                                        00586000
RINDAFID EQU   ISTRIN+104                                               00587000
RINBITAN EQU   ISTRIN+110                                               00588000
ISTRGP   EQU   0                                                        00589000
RGPBITAN EQU   ISTRGP+94                                                00590000
ISTRDS   EQU   0                                                        00591000
ISTRDA   EQU   0                                                        00592000
ISTRCL   EQU   0                                                        00593000
RCLADR   EQU   ISTRCL+84                                                00594000
RCLFLAG  EQU   RCLADR                                                   00595000
ISTRCDRS EQU   0                                                        00596000
ISTRCDRM EQU   0                                                        00597000
RCDRMPDN EQU   ISTRCDRM+184                                             00598000
RCDRMRPQ EQU   ISTRCDRM+192                                             00599000
RCDRMFGS EQU   ISTRCDRM+204                                             00600000
ISTRCC   EQU   0                                                        00601000
RCCBITAN EQU   ISTRCC+86                                                00602000
RCCSTAID EQU   ISTRCC+116                                               00603000
RCCID48  EQU   RCCSTAID+2                                               00604000
ISTPAT   EQU   0                                                        00605000
PATFLAGA EQU   ISTPAT+7                                                 00606000
ISTGNT   EQU   0                                                        00607000
ISTDOT   EQU   0                                                        00608000
ISTDNT   EQU   0                                                        00609000
ISTPAB   EQU   0                                                        00610000
PABWQCHN EQU   ISTPAB                                                   00611000
PABWEQA  EQU   PABWQCHN                                                 00612000
PABCHAIN EQU   PABWQCHN+4                                               00613000
PABRUNNG EQU   PABCHAIN                                                 00614000
PABRPHFG EQU   ISTPAB+12                                                00615000
PABFLAGS EQU   PABRPHFG                                                 00616000
PABERLCK EQU   PABFLAGS                                                 00617000
PABERRLK EQU   PABERLCK                                                 00618000
PABEND   EQU   ISTPAB+16                                                00619000
ISTCCW   EQU   0                                                        00620000
CCWVADDR EQU   ISTCCW                                                   00621000
CCWFLAGS EQU   ISTCCW+4                                                 00622000
CCWSPARE EQU   ISTCCW+5                                                 00623000
ISTDYPAB EQU   0                                                        00624000
DYPCHAIN EQU   ISTDYPAB+4                                               00625000
DYPPACMD EQU   ISTDYPAB+12                                              00626000
ISTRPH   EQU   0                                                        00627000
RPHCNTL  EQU   ISTRPH                                                   00628000
RPHFLAGS EQU   RPHCNTL+2                                                00629000
RPHFSTLC EQU   RPHFLAGS                                                 00630000
RPHFLGB  EQU   RPHCNTL+3                                                00631000
RPHRPHA  EQU   ISTRPH+4                                                 00632000
RPHTSKID EQU   ISTRPH+8                                                 00633000
RPHRESMA EQU   ISTRPH+16                                                00634000
RPHWPFLG EQU   RPHRESMA                                                 00635000
RPHWEA   EQU   ISTRPH+24                                                00636000
RPHCSPA  EQU   RPHWEA                                                   00637000
RPHSRPRM EQU   ISTRPH+28                                                00638000
RPHPABQA EQU   ISTRPH+36                                                00639000
RPHWORK  EQU   ISTRPH+40                                                00640000
RPHSAVE1 EQU   RPHWORK                                                  00641000
RPHSBITS EQU   RPHSAVE1+1                                               00642000
ISTNCB   EQU   0                                                        00643000
NCBFLAGS EQU   ISTNCB+24                                                00644000
NCBFRAS  EQU   NCBFLAGS+1                                               00645000
NCBFTRIO EQU   NCBFRAS                                                  00646000
NCBFLAG1 EQU   NCBFLAGS+2                                               00647000
NCBEXFLG EQU   ISTNCB+28                                                00648000
ISTICNCB EQU   0                                                        00649000
ICNDLCIA EQU   ISTICNCB+104                                             00650000
ICNSENSE EQU   ICNDLCIA+12                                              00651000
@NM00197 EQU   ICNSENSE                                                 00652000
ICNDTCHK EQU   @NM00197                                                 00653000
ICNOVRUN EQU   @NM00197                                                 00654000
@NM00198 EQU   ICNSENSE+1                                               00655000
ICNSTS   EQU   ICNDLCIA+14                                              00656000
@NM00200 EQU   ICNSTS                                                   00657000
ICNDEVCA EQU   ISTICNCB+128                                             00658000
ICNWSCCW EQU   ICNDEVCA                                                 00659000
ICNWSTIC EQU   ICNDEVCA+8                                               00660000
ICNNPCCW EQU   ICNDEVCA+24                                              00661000
ICNSMNOP EQU   ICNDEVCA+32                                              00662000
ICNRSCCW EQU   ICNDEVCA+40                                              00663000
ICNRSTIC EQU   ICNDEVCA+48                                              00664000
ICNPENDQ EQU   ICNDEVCA+56                                              00665000
ICNBUFFQ EQU   ICNDEVCA+64                                              00666000
ICNBUFRQ EQU   ICNBUFFQ+6                                               00667000
ICNFLAG1 EQU   ICNDEVCA+80                                              00668000
ICNFLAG2 EQU   ICNDEVCA+84                                              00669000
@NM00203 EQU   ICNFLAG2                                                 00670000
ICNLAT   EQU   ICNDEVCA+92                                              00671000
ICNUNAME EQU   ICNDEVCA+96                                              00672000
ICNTECT  EQU   ICNDEVCA+101                                             00673000
ICNSIOCT EQU   ICNDEVCA+102                                             00674000
ICNSYSUA EQU   ISTICNCB+232                                             00675000
ICNCKFLD EQU   ICNSYSUA                                                 00676000
ICNDCDEB EQU   ICNSYSUA+16                                              00677000
ICNDCBAD EQU   ICNDCDEB+25                                              00678000
ICNAPPAD EQU   ICNDCDEB+29                                              00679000
ICNUCBAD EQU   ICNDCDEB+32                                              00680000
ICNDIDEB EQU   ICNDCDEB+36                                              00681000
ICNDEBAD EQU   ICNDIDEB+1                                               00682000
ICNSPACE EQU   ICNDCDEB+40                                              00683000
ISTATCVT EQU   0                                                        00684000
ATCRPTCH EQU   ISTATCVT                                                 00685000
ATCITFLD EQU   ISTATCVT+8                                               00686000
ATCITCDS EQU   ATCITFLD+8                                               00687000
ATCITFLG EQU   ATCITCDS+4                                               00688000
ATCITRA1 EQU   ATCITFLG+2                                               00689000
ATCSMPAB EQU   ISTATCVT+88                                              00690000
ATCVDPAB EQU   ISTATCVT+152                                             00691000
ATCLDTIL EQU   ISTATCVT+408                                             00692000
ATCGTSTR EQU   ISTATCVT+608                                             00693000
ATCLUDVT EQU   ISTATCVT+768                                             00694000
ATCANYDT EQU   ISTATCVT+776                                             00695000
@NM00231 EQU   ISTATCVT+780                                             00696000
ATCPODVT EQU   ISTATCVT+804                                             00697000
ATCSTAT  EQU   ISTATCVT+936                                             00698000
ATCSTAT1 EQU   ATCSTAT                                                  00699000
ATCPOFLG EQU   ATCSTAT+2                                                00700000
ATCSTAT4 EQU   ATCSTAT+3                                                00701000
ATCBITAN EQU   ISTATCVT+940                                             00702000
ATCFLAG2 EQU   ATCBITAN+1                                               00703000
ATCONID  EQU   ISTATCVT+944                                             00704000
ATCSSCPA EQU   ISTATCVT+948                                             00705000
ATCHPGM  EQU   ISTATCVT+1012                                            00706000
ATCVLCNT EQU   ISTATCVT+1016                                            00707000
ATCRNO   EQU   ISTATCVT+1020                                            00708000
@NM00254 EQU   ISTATCVT+1028                                            00709000
ATCSHRFG EQU   @NM00254+8                                               00710000
ATCCPDVT EQU   ISTATCVT+1096                                            00711000
ATCSMSDQ EQU   ISTATCVT+1140                                            00712000
ATCRID   EQU   ISTATCVT+1152                                            00713000
ATCLDAPP EQU   ISTATCVT+1288                                            00714000
ATCSQAFR EQU   ISTATCVT+1312                                            00715000
ATCORTCB EQU   ATCSQAFR+4                                               00716000
ATCORSRB EQU   ATCORTCB                                                 00717000
ATCICAPP EQU   ISTATCVT+1320                                            00718000
ATCDAPVT EQU   ISTATCVT+1340                                            00719000
ATCGSRBQ EQU   ISTATCVT+1472                                            00720000
ATCGSRBG EQU   ATCGSRBQ                                                 00721000
ATCENFLG EQU   ISTATCVT+1512                                            00722000
@NM00269 EQU   ISTATCVT+1575                                            00723000
ATCVTFLG EQU   ISTATCVT+1576                                            00724000
ATCZFLAG EQU   ISTATCVT+1696                                            00725000
ATCVIOPM EQU   ISTATCVT+1712                                            00726000
ATCCRA   EQU   ISTATCVT+1720                                            00727000
ATCCRACN EQU   ATCCRA+4                                                 00728000
ATCSRB   EQU   ISTATCVT+1728                                            00729000
ATCSRBCN EQU   ATCSRB+4                                                 00730000
ATCCRPL  EQU   ISTATCVT+1736                                            00731000
ATCRPLCN EQU   ATCCRPL+4                                                00732000
ISTACDEB EQU   0                                                        00733000
ACDANYQ  EQU   ISTACDEB+48                                              00734000
ACDLUFLG EQU   ISTACDEB+102                                             00735000
FY1WORKA EQU   0                                                        00736000
FY1IOB   EQU   FY1WORKA+72                                              00737000
FY1IOBW1 EQU   FY1IOB                                                   00738000
FY1SDATA EQU   FY1IOBW1+2                                               00739000
FY1IOBW2 EQU   FY1IOB+4                                                 00740000
FY1IOBW3 EQU   FY1IOB+8                                                 00741000
FY1IOBW4 EQU   FY1IOBW3+4                                               00742000
FY1CSWST EQU   FY1IOBW4                                                 00743000
FY1IOBW5 EQU   FY1IOB+16                                                00744000
FY1SIOCC EQU   FY1IOBW5                                                 00745000
FY1IOBW6 EQU   FY1IOB+20                                                00746000
FY1CC3WE EQU   FY1IOBW6                                                 00747000
FY1ECB   EQU   FY1WORKA+112                                             00748000
FY1ECBRC EQU   FY1ECB                                                   00749000
FY1EXTRA EQU   FY1WORKA+120                                             00750000
FY1CSW   EQU   0                                                        00751000
CY1SENS  EQU   0                                                        00752000
FY1PARML EQU   0                                                        00753000
FY1CHPGM EQU   FY1PARML                                                 00754000
FY1NCSPL EQU   FY1PARML+4                                               00755000
FYENDCSW EQU   FY1PARML+8                                               00756000
FY1SENSE EQU   FY1PARML+12                                              00757000
FY1DBITS EQU   0                                                        00758000
DCBBITS  EQU   FY1DBITS                                                 00759000
FY1RGSAV EQU   0                                                        00760000
FY1BAKPT EQU   FY1RGSAV+4                                               00761000
FY1FWDPT EQU   FY1RGSAV+8                                               00762000
ISTXDYP  EQU   0                                                        00763000
ISTXPAB  EQU   0                                                        00764000
IOSATTSC EQU   IOSIPIB                                                  00765000
IOSWTOWA EQU   IOSIPIB                                                  00766000
IOSPCISC EQU   IOSIPIB                                                  00767000
IOBORG01 EQU   IOBPREFX+8                                               00768000
IOBNIOBA EQU   IOBORG01                                                 00769000
IOBNFLG1 EQU   IOBNIOBA                                                 00770000
IOBPRTOV EQU   IOBNFLG1                                                 00771000
IOBORG02 EQU   IOBPREFX+8                                               00772000
IOBDQADA EQU   IOBORG02                                                 00773000
IOBDEQIN EQU   IOBDQADA                                                 00774000
IOBORG03 EQU   IOBPREFX+12                                              00775000
IOBORG04 EQU   IOBINCAM                                                 00776000
IOBORG12 EQU   IOBINCAM                                                 00777000
IOBFL4   EQU   IOBORG12                                                 00778000
IOBEXTEN EQU   IOBSTDRD+32                                              00779000
IOBSEEK  EQU   IOBEXTEN                                                 00780000
IOBBB    EQU   IOBSEEK+1                                                00781000
IOBCC    EQU   IOBSEEK+3                                                00782000
IOBHH    EQU   IOBSEEK+5                                                00783000
IOBORG05 EQU   IOBEXTEN                                                 00784000
IOBORG06 EQU   IOBEXTEN                                                 00785000
IOBNXTPT EQU   IOBORG06+4                                               00786000
IOBSTATA EQU   IOBNXTPT                                                 00787000
IOBORG07 EQU   IOBEXTEN+8                                               00788000
W1IEXTEN EQU   IOBORG07                                                 00789000
IOBORG08 EQU   IOBEXTEN+8                                               00790000
IOBINDCT EQU   IOBORG08+4                                               00791000
IOBUNSQR EQU   IOBORG08+5                                               00792000
IOBFCHAD EQU   IOBORG08+8                                               00793000
IOBORG09 EQU   IOBEXTEN+8                                               00794000
IOBDPLAD EQU   IOBORG09+4                                               00795000
IOBDTYPE EQU   IOBORG09+8                                               00796000
IOBDTYP2 EQU   IOBORG09+9                                               00797000
IOBDSTAT EQU   IOBORG09+10                                              00798000
IOBSTAT1 EQU   IOBDSTAT                                                 00799000
IOBORG10 EQU   IOBEXTEN+8                                               00800000
IOBSEEK2 EQU   IOBORG10                                                 00801000
IOBORG11 EQU   IOBEXTEN                                                 00802000
IOBERCT  EQU   IOBORG11                                                 00803000
IOBUCBXV EQU   IOBERCT                                                  00804000
IOBNAME  EQU   IOBORG11+4                                               00805000
IOBORG13 EQU   IOBEXTEN                                                 00806000
IOBSKADR EQU   IOBORG13                                                 00807000
NCSTUNST EQU   NCSMDFY                                                  00808000
NCSTSFLG EQU   NCSTUNST+2                                               00809000
NCSLS    EQU   NCSMDFY                                                  00810000
NCSCYPTO EQU   NCSMDFY                                                  00811000
NCSCYFLG EQU   NCSCYPTO                                                 00812000
SRTXTNSN EQU   SRTXTNBS                                                 00813000
PABXTNSN EQU   PABEND                                                   00814000
@NM00211 EQU   ICNFLAG1                                                 00815000
@NM00212 EQU   @NM00211                                                 00816000
ICNCLREC EQU   @NM00212                                                 00817000
@NM00215 EQU   @NM00211+1                                               00818000
ICNANSIP EQU   @NM00215                                                 00819000
ICNRDREQ EQU   @NM00215                                                 00820000
ICNUFLAG EQU   @NM00211+2                                               00821000
ICNUHARD EQU   ICNUFLAG                                                 00822000
ICNURQCN EQU   ICNUFLAG                                                 00823000
@NM00219 EQU   ICNSPACE                                                 00824000
ICNZH002 EQU   @NM00219+12                                              00825000
ICNZS002 EQU   ICNZH002                                                 00826000
ICNZS003 EQU   ICNZH002                                                 00827000
ICNZS004 EQU   ICNZH002                                                 00828000
ICNZS006 EQU   ICNZH002                                                 00829000
ICNZS007 EQU   ICNZH002                                                 00830000
ICNZS008 EQU   ICNZH002                                                 00831000
ICNZS009 EQU   ICNZH002+1                                               00832000
ICNZS00A EQU   ICNZH002+1                                               00833000
@NM00220 EQU   @NM00219+19                                              00834000
ICNRSRT  EQU   @NM00220                                                 00835000
@NM00222 EQU   @NM00219+20                                              00836000
ISTICNCT EQU   ISTICNCB                                                 00837000
ICNSTATS EQU   ISTICNCT+464                                             00838000
ICNBUFF  EQU   ICNBUFRQ                                                 00839000
ICNCUUA  EQU   ICNUNAME                                                 00840000
ICNIDT   EQU   ICNLAT                                                   00841000
ICNLCVTA EQU   ICNLAT                                                   00842000
ICNZD001 EQU   ICNWSCCW                                                 00843000
ICNZD002 EQU   ICNWSTIC                                                 00844000
ICNZD003 EQU   ICNRSCCW                                                 00845000
ICNZD004 EQU   ICNRSTIC                                                 00846000
ICNZD005 EQU   ICNNPCCW                                                 00847000
ICNZD006 EQU   ICNSMNOP                                                 00848000
ICNZH001 EQU   ICNSIOCT                                                 00849000
ICNZX001 EQU   ICNTECT                                                  00850000
RCPSIBQ  EQU   RCPSARRY                                                 00851000
SRB      EQU   SRBSECT                                                  00852000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00853000
ICNSLODN EQU   ICNSTATS+28                                              00854000
ICNRDBUF EQU   ICNSTATS+24                                              00855000
ICNOPIU  EQU   ICNSTATS+20                                              00856000
ICNIPIU  EQU   ICNSTATS+16                                              00857000
ICNRDATN EQU   ICNSTATS+12                                              00858000
ICNATTN  EQU   ICNSTATS+8                                               00859000
ICNCHRD  EQU   ICNSTATS+4                                               00860000
ICNCHWR  EQU   ICNSTATS                                                 00861000
@NM00227 EQU   ISTICNCT                                                 00862000
@NM00226 EQU   @NM00219+23                                              00863000
ICNHKMSK EQU   @NM00219+22                                              00864000
ICNERCNT EQU   @NM00219+21                                              00865000
@NM00225 EQU   @NM00222                                                 00866000
@NM00224 EQU   @NM00222                                                 00867000
@NM00223 EQU   @NM00222                                                 00868000
ICNZF026 EQU   @NM00222                                                 00869000
ICNZF024 EQU   @NM00222                                                 00870000
ICNZF023 EQU   @NM00222                                                 00871000
ICNZF022 EQU   @NM00222                                                 00872000
ICNZF021 EQU   @NM00222                                                 00873000
@NM00221 EQU   @NM00220                                                 00874000
ICNZF016 EQU   @NM00220                                                 00875000
ICNZF011 EQU   @NM00220                                                 00876000
ICNZF00E EQU   ICNRSRT                                                  00877000
ICNZF00A EQU   @NM00220                                                 00878000
ICNZF005 EQU   @NM00220                                                 00879000
ICNZF004 EQU   @NM00220                                                 00880000
ICNZF001 EQU   @NM00220                                                 00881000
ICNZX013 EQU   @NM00219+18                                              00882000
ICNZX012 EQU   @NM00219+17                                              00883000
ICNZX011 EQU   @NM00219+16                                              00884000
ICNZX010 EQU   @NM00219+14                                              00885000
ICNZS010 EQU   ICNZH002+1                                               00886000
ICNZS00F EQU   ICNZH002+1                                               00887000
ICNZS00E EQU   ICNZH002+1                                               00888000
ICNZS00D EQU   ICNZH002+1                                               00889000
ICNZS00C EQU   ICNZH002+1                                               00890000
ICNZS00B EQU   ICNZH002+1                                               00891000
ICNZS01A EQU   ICNZS00A                                                 00892000
ICNZS019 EQU   ICNZS009                                                 00893000
ICNZS018 EQU   ICNZS008                                                 00894000
ICNZS017 EQU   ICNZS007                                                 00895000
ICNZS016 EQU   ICNZS006                                                 00896000
ICNZS005 EQU   ICNZH002                                                 00897000
ICNZS014 EQU   ICNZS004                                                 00898000
ICNZS013 EQU   ICNZS003                                                 00899000
ICNZS012 EQU   ICNZS002                                                 00900000
ICNZS001 EQU   ICNZH002                                                 00901000
ICNZV006 EQU   @NM00219+8                                               00902000
ICNZC001 EQU   @NM00219                                                 00903000
@NM00218 EQU   @NM00211+3                                               00904000
@NM00217 EQU   ICNUFLAG                                                 00905000
ICNUIOEM EQU   ICNUFLAG                                                 00906000
ICNROLN  EQU   ICNURQCN                                                 00907000
ICNUDELR EQU   ICNUFLAG                                                 00908000
ICNUSOFT EQU   ICNUFLAG                                                 00909000
ICNZF00F EQU   ICNUHARD                                                 00910000
ICNUDISC EQU   ICNUFLAG                                                 00911000
@NM00216 EQU   @NM00215                                                 00912000
ICNZF013 EQU   ICNRDREQ                                                 00913000
ICNZF010 EQU   ICNANSIP                                                 00914000
ICNSLOW  EQU   @NM00215                                                 00915000
@NM00214 EQU   @NM00212                                                 00916000
ICNZF008 EQU   ICNCLREC                                                 00917000
ICNCLOSE EQU   @NM00212                                                 00918000
@NM00213 EQU   @NM00212                                                 00919000
@NM00185 EQU   PABXTNSN+12                                              00920000
PABNPSSQ EQU   PABXTNSN+8                                               00921000
PABLOCK  EQU   PABXTNSN+4                                               00922000
PABLAST  EQU   PABXTNSN                                                 00923000
SRTDATA  EQU   SRTXTNSN+3                                               00924000
SRTUSELN EQU   SRTXTNSN+1                                               00925000
SRTFLAGS EQU   SRTXTNSN                                                 00926000
@NM00032 EQU   NCSCYPTO+1                                               00927000
@NM00031 EQU   NCSCYFLG                                                 00928000
NCSENCR  EQU   NCSCYFLG                                                 00929000
@NM00030 EQU   NCSLS+2                                                  00930000
NCSPLRCD EQU   NCSLS+1                                                  00931000
NCSLSCMD EQU   NCSLS                                                    00932000
@NM00029 EQU   NCSTUNST+3                                               00933000
@NM00028 EQU   NCSTSFLG                                                 00934000
NCSTUNCS EQU   NCSTSFLG                                                 00935000
NCSTUNON EQU   NCSTSFLG                                                 00936000
NCSTUTIM EQU   NCSTUNST                                                 00937000
IOBSKSS  EQU   IOBSKADR+3                                               00938000
IOBSK0   EQU   IOBSKADR+2                                               00939000
IOBSKTT  EQU   IOBSKADR+1                                               00940000
IOBSKRV  EQU   IOBSKADR                                                 00941000
IOBCSWSV EQU   IOBORG11+17                                              00942000
IOBSENSV EQU   IOBORG11+16                                              00943000
IOBRCD   EQU   IOBORG11+12                                              00944000
IOBMDREC EQU   IOBORG11+8                                               00945000
IOBNAMEA EQU   IOBNAME+1                                                00946000
IOBNAMSZ EQU   IOBNAME                                                  00947000
IOBERCTA EQU   IOBERCT+1                                                00948000
IOBRTYPE EQU   IOBUCBXV                                                 00949000
IOBRDCHP EQU   IOBORG10+20                                              00950000
IOBNEXTA EQU   IOBORG10+16                                              00951000
IOBREADA EQU   IOBORG10+12                                              00952000
IOBBUFC  EQU   IOBORG10+8                                               00953000
IOBSK2R  EQU   IOBSEEK2+7                                               00954000
IOBSK2HH EQU   IOBSEEK2+5                                               00955000
IOBSK2CC EQU   IOBSEEK2+3                                               00956000
IOBSK2BB EQU   IOBSEEK2+1                                               00957000
IOBSK2M  EQU   IOBSEEK2                                                 00958000
IOBCHNPR EQU   IOBORG09+40                                              00959000
IOBDNCRF EQU   IOBORG09+32                                              00960000
IOBRSV35 EQU   IOBORG09+24                                              00961000
IOBDQPTR EQU   IOBORG09+20                                              00962000
IOBRSV34 EQU   IOBORG09+18                                              00963000
IOBDBYTN EQU   IOBORG09+16                                              00964000
IOBDCPND EQU   IOBORG09+12                                              00965000
IOBSTAT2 EQU   IOBDSTAT+1                                               00966000
IOBSIORT EQU   IOBSTAT1                                                 00967000
IOBADDVU EQU   IOBSTAT1                                                 00968000
IOBBUFF  EQU   IOBSTAT1                                                 00969000
IOBENQUE EQU   IOBSTAT1                                                 00970000
IOBPASS2 EQU   IOBSTAT1                                                 00971000
IOBSYNCH EQU   IOBSTAT1                                                 00972000
IOBNEWVL EQU   IOBSTAT1                                                 00973000
IOBABNRM EQU   IOBSTAT1                                                 00974000
IOBRELEX EQU   IOBDTYP2                                                 00975000
IOBADDTY EQU   IOBDTYP2                                                 00976000
IOBTYPE  EQU   IOBDTYP2                                                 00977000
IOBRQUST EQU   IOBDTYP2                                                 00978000
IOBSUFFX EQU   IOBDTYP2                                                 00979000
IOBSBLKL EQU   IOBDTYP2                                                 00980000
IOBSKEY  EQU   IOBDTYP2                                                 00981000
IOBRELBL EQU   IOBDTYPE                                                 00982000
IOBRDEXC EQU   IOBDTYPE                                                 00983000
IOBDYNBF EQU   IOBDTYPE                                                 00984000
IOBACTAD EQU   IOBDTYPE                                                 00985000
IOBFDBCK EQU   IOBDTYPE                                                 00986000
IOBEXTSC EQU   IOBDTYPE                                                 00987000
IOBOVFLO EQU   IOBDTYPE                                                 00988000
IOBVERFY EQU   IOBDTYPE                                                 00989000
IOBDPLB  EQU   IOBDPLAD+1                                               00990000
IOBDAYLI EQU   IOBDPLAD                                                 00991000
IOBDIOBS EQU   IOBORG09+2                                               00992000
IOBDBYTR EQU   IOBORG09                                                 00993000
IOBBCHAD EQU   IOBORG08+12                                              00994000
IOBFCHNB EQU   IOBFCHAD+1                                               00995000
IOBCOUNT EQU   IOBFCHAD                                                 00996000
IOBASYN  EQU   IOBORG08+7                                               00997000
IOBAPP   EQU   IOBORG08+6                                               00998000
IOBRSV32 EQU   IOBUNSQR                                                 00999000
IOBRSV31 EQU   IOBUNSQR                                                 01000000
IOBRSV30 EQU   IOBUNSQR                                                 01001000
IOBKNRWR EQU   IOBUNSQR                                                 01002000
IOBKNWR  EQU   IOBUNSQR                                                 01003000
IOBNTAV2 EQU   IOBUNSQR                                                 01004000
IOBNTAV1 EQU   IOBUNSQR                                                 01005000
IOBCPBSY EQU   IOBUNSQR                                                 01006000
IOBCHNNL EQU   IOBINDCT                                                 01007000
IOBRSV29 EQU   IOBINDCT                                                 01008000
IOBRSV28 EQU   IOBINDCT                                                 01009000
IOBRSV27 EQU   IOBINDCT                                                 01010000
IOBKEYAD EQU   IOBINDCT                                                 01011000
IOBOVPTR EQU   IOBINDCT                                                 01012000
IOBUNSCH EQU   IOBINDCT                                                 01013000
IOBDEQCP EQU   IOBINDCT                                                 01014000
IOBCCWAD EQU   IOBORG08                                                 01015000
W1OEXTEN EQU   W1IEXTEN                                                 01016000
IOBCCW   EQU   IOBORG06+8                                               01017000
IOBNXTPB EQU   IOBNXTPT+1                                               01018000
IOBRSV26 EQU   IOBSTATA                                                 01019000
IOBRSV25 EQU   IOBSTATA                                                 01020000
IOBRSV24 EQU   IOBSTATA                                                 01021000
IOBRSV23 EQU   IOBSTATA                                                 01022000
IOBRSV22 EQU   IOBSTATA                                                 01023000
IOBRSV21 EQU   IOBSTATA                                                 01024000
IOBRSV20 EQU   IOBSTATA                                                 01025000
IOBAVLFL EQU   IOBSTATA                                                 01026000
IOBRSV37 EQU   IOBORG06+1                                               01027000
IOBUCBXG EQU   IOBORG06                                                 01028000
IOBCPA   EQU   IOBORG05+32                                              01029000
IOBERINF EQU   IOBORG05+16                                              01030000
IOBERCCW EQU   IOBORG05+8                                               01031000
IOBSNDPT EQU   IOBORG05+7                                               01032000
IOBRCVPT EQU   IOBORG05+6                                               01033000
IOBWORK  EQU   IOBORG05+1                                               01034000
IOBUCBX  EQU   IOBORG05                                                 01035000
IOBR     EQU   IOBSEEK+7                                                01036000
IOBHH2   EQU   IOBHH+1                                                  01037000
IOBHH1   EQU   IOBHH                                                    01038000
IOBCC2   EQU   IOBCC+1                                                  01039000
IOBCC1   EQU   IOBCC                                                    01040000
IOBBB2   EQU   IOBBB+1                                                  01041000
IOBBB1   EQU   IOBBB                                                    01042000
IOBM     EQU   IOBSEEK                                                  01043000
IOBRSV46 EQU   IOBFL4                                                   01044000
IOBRSV47 EQU   IOBFL4                                                   01045000
IOBENT   EQU   IOBFL4                                                   01046000
IOBEQP   EQU   IOBFL4                                                   01047000
IOBBUS   EQU   IOBFL4                                                   01048000
IOBDCK   EQU   IOBFL4                                                   01049000
IOBREJ   EQU   IOBFL4                                                   01050000
IOBOVR   EQU   IOBFL4                                                   01051000
IOBCRILC EQU   IOBORG04+1                                               01052000
IOBCRDCC EQU   IOBORG04                                                 01053000
IOBGQECB EQU   IOBORG03                                                 01054000
IOBSWAP  EQU   IOBORG02+4                                               01055000
IOBDQADB EQU   IOBDQADA+1                                               01056000
IOBRSV13 EQU   IOBDEQIN                                                 01057000
IOBRSV12 EQU   IOBDEQIN                                                 01058000
IOBRSV11 EQU   IOBDEQIN                                                 01059000
IOBRSV10 EQU   IOBDEQIN                                                 01060000
IOBRSV09 EQU   IOBDEQIN                                                 01061000
IOBRSV08 EQU   IOBDEQIN                                                 01062000
IOBRSV07 EQU   IOBDEQIN                                                 01063000
IOBDEQ   EQU   IOBDEQIN                                                 01064000
IOBNECB  EQU   IOBORG01+4                                               01065000
IOBNIOBB EQU   IOBNIOBA+1                                               01066000
IOBFIRST EQU   IOBNFLG1                                                 01067000
IOBUPERR EQU   IOBNFLG1                                                 01068000
IOBSPAN  EQU   IOBNFLG1                                                 01069000
IOBBKSPC EQU   IOBNFLG1                                                 01070000
IOBUPDAT EQU   IOBNFLG1                                                 01071000
IOBREAD  EQU   IOBNFLG1                                                 01072000
IOBWRITE EQU   IOBNFLG1                                                 01073000
IOBSEGMT EQU   IOBPRTOV                                                 01074000
IOSPCIWA EQU   IOSPCISC+44                                              01075000
IOSPCIRS EQU   IOSPCISC+8                                               01076000
@NM00007 EQU   IOSPCISC+4                                               01077000
@NM00006 EQU   IOSPCISC                                                 01078000
IOSWRNDR EQU   IOSWTOWA+4                                               01079000
IOSWTOPT EQU   IOSWTOWA+3                                               01080000
IOSWTOCP EQU   IOSWTOWA+2                                               01081000
IOSWTOCH EQU   IOSWTOWA                                                 01082000
IOSATTWA EQU   IOSATTSC+40                                              01083000
@NM00005 EQU   IOSATTSC+24                                              01084000
IOSATTSN EQU   IOSATTSC                                                 01085000
@NM00290 EQU   FY1RGSAV+12                                              01086000
@NM00289 EQU   FY1RGSAV                                                 01087000
@NM00288 EQU   FY1DBITS                                                 01088000
@NM00287 EQU   FY1IOB+24                                                01089000
@NM00286 EQU   FY1IOBW6                                                 01090000
@NM00285 EQU   FY1IOBW6                                                 01091000
@NM00284 EQU   FY1IOBW5                                                 01092000
@NM00283 EQU   FY1IOBW3                                                 01093000
@NM00282 EQU   FY1IOBW1                                                 01094000
FY1REGSV EQU   FY1WORKA                                                 01095000
@NM00281 EQU   ISTACDEB+120                                             01096000
ACDNIB   EQU   ISTACDEB+116                                             01097000
ACDEAS   EQU   ISTACDEB+112                                             01098000
ACDUNTNM EQU   ISTACDEB+104                                             01099000
@NM00280 EQU   ACDLUFLG+1                                               01100000
ACDAACQ  EQU   ACDLUFLG+1                                               01101000
ACDAPASS EQU   ACDLUFLG+1                                               01102000
ACDCSM   EQU   ACDLUFLG+1                                               01103000
ACDPARS  EQU   ACDLUFLG+1                                               01104000
ACDTSO   EQU   ACDLUFLG+1                                               01105000
ACDSCIP  EQU   ACDLUFLG+1                                               01106000
ACDNSEXT EQU   ACDLUFLG+1                                               01107000
ACDAUTHE EQU   ACDLUFLG                                                 01108000
ACDTPEND EQU   ACDLUFLG                                                 01109000
ACDABEND EQU   ACDLUFLG                                                 01110000
ACDCLOSE EQU   ACDLUFLG                                                 01111000
ACDQUIES EQU   ACDLUFLG                                                 01112000
ACDNSESS EQU   ACDLUFLG                                                 01113000
ACDREADY EQU   ACDLUFLG                                                 01114000
ACDACTIV EQU   ACDLUFLG                                                 01115000
ACDRQID  EQU   ISTACDEB+100                                             01116000
ACDSMCNT EQU   ISTACDEB+96                                              01117000
ACDPACNT EQU   ISTACDEB+92                                              01118000
ACDASCNT EQU   ISTACDEB+88                                              01119000
ACDSMQ   EQU   ISTACDEB+84                                              01120000
ACDSSCNT EQU   ISTACDEB+80                                              01121000
ACDECB   EQU   ISTACDEB+76                                              01122000
ACDLUCBA EQU   ISTACDEB+72                                              01123000
ACDLOCK  EQU   ISTACDEB+68                                              01124000
ACDACB   EQU   ISTACDEB+64                                              01125000
ACDDEB   EQU   ISTACDEB+60                                              01126000
ACDTCB   EQU   ISTACDEB+56                                              01127000
ACDRARQ  EQU   ACDANYQ+4                                                01128000
ACDRAFQ  EQU   ACDANYQ                                                  01129000
ACDSSPAB EQU   ISTACDEB+32                                              01130000
ACDNEPAB EQU   ISTACDEB+16                                              01131000
ACDRDTE  EQU   ISTACDEB+12                                              01132000
ACDTSKID EQU   ISTACDEB+8                                               01133000
ACDCHN   EQU   ISTACDEB+4                                               01134000
ACDSAF   EQU   ISTACDEB+2                                               01135000
ACDLNGTH EQU   ISTACDEB+1                                               01136000
ACDTYPE  EQU   ISTACDEB                                                 01137000
ATCAOS   EQU   ISTATCVT+1868                                            01138000
@NM00279 EQU   ISTATCVT+1860                                            01139000
@NM00278 EQU   ISTATCVT+1852                                            01140000
@NM00277 EQU   ISTATCVT+1844                                            01141000
@NM00276 EQU   ISTATCVT+1836                                            01142000
@NM00275 EQU   ISTATCVT+1828                                            01143000
@NM00274 EQU   ISTATCVT+1820                                            01144000
@NM00273 EQU   ISTATCVT+1816                                            01145000
ATCCACSA EQU   ISTATCVT+1812                                            01146000
ATCMXCSA EQU   ISTATCVT+1808                                            01147000
ATCTPMPB EQU   ISTATCVT+1776                                            01148000
ATCTRMPB EQU   ISTATCVT+1744                                            01149000
ATCRPLAC EQU   ATCRPLCN+2                                               01150000
ATCRPLRC EQU   ATCRPLCN                                                 01151000
ATCCRPLQ EQU   ATCCRPL                                                  01152000
ATCSRBAC EQU   ATCSRBCN+2                                               01153000
ATCSRBRC EQU   ATCSRBCN                                                 01154000
ATCSRBQ  EQU   ATCSRB                                                   01155000
ATCCRAAC EQU   ATCCRACN+2                                               01156000
ATCCRARC EQU   ATCCRACN                                                 01157000
ATCCRAQ  EQU   ATCCRA                                                   01158000
ATCLUFFD EQU   ISTATCVT+1716                                            01159000
ATCTPMMI EQU   ISTATCVT+1708                                            01160000
ATCPXSRB EQU   ISTATCVT+1704                                            01161000
ATCRPLCT EQU   ISTATCVT+1702                                            01162000
ATCCRACT EQU   ISTATCVT+1700                                            01163000
ATCSRBCT EQU   ISTATCVT+1698                                            01164000
ATCSTNSM EQU   ISTATCVT+1697                                            01165000
@NM00272 EQU   ATCZFLAG                                                 01166000
ATCZF001 EQU   ATCZFLAG                                                 01167000
ATCTPCP1 EQU   ISTATCVT+1692                                            01168000
ATCTPCP0 EQU   ISTATCVT+1688                                            01169000
ATCZR01  EQU   ISTATCVT+1684                                            01170000
ATCMPLTA EQU   ISTATCVT+1680                                            01171000
ATCASCB  EQU   ISTATCVT+1676                                            01172000
ATCAP86  EQU   ISTATCVT+1672                                            01173000
ATCAP85  EQU   ISTATCVT+1668                                            01174000
ATCAP84  EQU   ISTATCVT+1664                                            01175000
ATCAP83  EQU   ISTATCVT+1660                                            01176000
ATCAP82  EQU   ISTATCVT+1656                                            01177000
ATCAP69  EQU   ISTATCVT+1652                                            01178000
ATCAP66  EQU   ISTATCVT+1648                                            01179000
ATCAP62  EQU   ISTATCVT+1644                                            01180000
ATCAPC59 EQU   ISTATCVT+1640                                            01181000
ATCAP56  EQU   ISTATCVT+1636                                            01182000
ATCAP55  EQU   ISTATCVT+1632                                            01183000
ATCAP41  EQU   ISTATCVT+1628                                            01184000
ATCAPC25 EQU   ISTATCVT+1624                                            01185000
ATCAP23  EQU   ISTATCVT+1620                                            01186000
ATCAPBE  EQU   ISTATCVT+1616                                            01187000
ATCPSTA  EQU   ISTATCVT+1612                                            01188000
ATCSMABF EQU   ISTATCVT+1608                                            01189000
ATCSMAPR EQU   ISTATCVT+1604                                            01190000
ATCTPWQA EQU   ISTATCVT+1600                                            01191000
ATCSMAID EQU   ISTATCVT+1596                                            01192000
ATCSMARA EQU   ISTATCVT+1592                                            01193000
ATCCACXA EQU   ISTATCVT+1588                                            01194000
ATCATA10 EQU   ISTATCVT+1584                                            01195000
ATCHLTCB EQU   ISTATCVT+1580                                            01196000
@NM00271 EQU   ATCVTFLG                                                 01197000
ATCVTACT EQU   ATCVTFLG                                                 01198000
@NM00270 EQU   @NM00269                                                 01199000
ATCVTMAB EQU   @NM00269                                                 01200000
ATCVTBAM EQU   ISTATCVT+1572                                            01201000
@NM00268 EQU   ISTATCVT+1568                                            01202000
@NM00267 EQU   ISTATCVT+1520                                            01203000
ATCCCOOC EQU   ISTATCVT+1516                                            01204000
@NM00266 EQU   ISTATCVT+1513                                            01205000
ATCSNUF  EQU   ATCENFLG                                                 01206000
ATCOPKL  EQU   ATCENFLG                                                 01207000
ATCABEN  EQU   ATCENFLG                                                 01208000
ATCSRDN  EQU   ATCENFLG                                                 01209000
ATCDLDN  EQU   ATCENFLG                                                 01210000
ATCTIMER EQU   ISTATCVT+1508                                            01211000
ATCAIWT  EQU   ISTATCVT+1504                                            01212000
ATCOROBT EQU   ISTATCVT+1500                                            01213000
ATCDMAPP EQU   ISTATCVT+1496                                            01214000
ATCZDVTX EQU   ISTATCVT+1492                                            01215000
ATCPXCRA EQU   ISTATCVT+1488                                            01216000
ATCICNCB EQU   ISTATCVT+1484                                            01217000
ATCCMTCB EQU   ISTATCVT+1480                                            01218000
ATCPRPH  EQU   ISTATCVT+1476                                            01219000
ATCGSRBF EQU   ATCGSRBG                                                 01220000
ATCSRBRT EQU   ISTATCVT+1468                                            01221000
ATCTSCPC EQU   ISTATCVT+1464                                            01222000
@NM00265 EQU   ISTATCVT+1460                                            01223000
ATCCDTCB EQU   ISTATCVT+1456                                            01224000
ATCORFRL EQU   ISTATCVT+1452                                            01225000
ATCORFPX EQU   ISTATCVT+1448                                            01226000
ATCORFMG EQU   ISTATCVT+1444                                            01227000
ATCSMBQ  EQU   ISTATCVT+1440                                            01228000
ATCINFDD EQU   ISTATCVT+1436                                            01229000
ATCAP67  EQU   ISTATCVT+1432                                            01230000
ATCAP65  EQU   ISTATCVT+1428                                            01231000
ATCAP64  EQU   ISTATCVT+1424                                            01232000
ATCAP63  EQU   ISTATCVT+1420                                            01233000
ATCAP61  EQU   ISTATCVT+1416                                            01234000
ATCAP58  EQU   ISTATCVT+1412                                            01235000
ATCAP57  EQU   ISTATCVT+1408                                            01236000
ATCAP54  EQU   ISTATCVT+1404                                            01237000
ATCAP53  EQU   ISTATCVT+1400                                            01238000
ATCAP52  EQU   ISTATCVT+1396                                            01239000
ATCAP51  EQU   ISTATCVT+1392                                            01240000
ATCAP38  EQU   ISTATCVT+1388                                            01241000
ATCAP37  EQU   ISTATCVT+1384                                            01242000
ATCAP34  EQU   ISTATCVT+1380                                            01243000
ATCAP32  EQU   ISTATCVT+1376                                            01244000
ATCAP31  EQU   ISTATCVT+1372                                            01245000
ATCAP12  EQU   ISTATCVT+1368                                            01246000
ATCAP11  EQU   ISTATCVT+1364                                            01247000
ATCDAPDG EQU   ATCDAPVT+20                                              01248000
ATCDXCEA EQU   ATCDAPVT+16                                              01249000
ATCDCEA  EQU   ATCDAPVT+12                                              01250000
ATCDPCIA EQU   ATCDAPVT+8                                               01251000
ATCDSIOA EQU   ATCDAPVT+4                                               01252000
ATCDEOEA EQU   ATCDAPVT                                                 01253000
ATCZAEA  EQU   ATCICAPP+16                                              01254000
ATCZCEA  EQU   ATCICAPP+12                                              01255000
ATCZCPCI EQU   ATCICAPP+8                                               01256000
ATCZSIOA EQU   ATCICAPP+4                                               01257000
ATCCDRPH EQU   ATCICAPP                                                 01258000
ATCORQG  EQU   ATCORSRB                                                 01259000
ATCORTBF EQU   ATCSQAFR                                                 01260000
@NM00264 EQU   ISTATCVT+1308                                            01261000
ATCZLAEA EQU   ATCLDAPP+16                                              01262000
ATCZLCEA EQU   ATCLDAPP+12                                              01263000
ATCZLPCI EQU   ATCLDAPP+8                                               01264000
ATCSMFRR EQU   ATCLDAPP+4                                               01265000
ATCCDTID EQU   ATCLDAPP                                                 01266000
@NM00263 EQU   ISTATCVT+1256                                            01267000
ATCZPAB2 EQU   ISTATCVT+1224                                            01268000
@NM00262 EQU   ISTATCVT+1224                                            01269000
@NM00261 EQU   ISTATCVT+1164                                            01270000
ATCCPCFE EQU   ISTATCVT+1160                                            01271000
@NM00260 EQU   ATCRID+2                                                 01272000
ATCCDRMA EQU   ATCRID                                                   01273000
@NM00259 EQU   ATCSMSDQ+8                                               01274000
@NM00258 EQU   ATCSMSDQ+4                                               01275000
@NM00257 EQU   ATCSMSDQ                                                 01276000
ATCSEQNO EQU   ISTATCVT+1136                                            01277000
ATCSMPMD EQU   ISTATCVT+1132                                            01278000
ATCPAREA EQU   ISTATCVT+1128                                            01279000
ATCCPCSM EQU   ISTATCVT+1124                                            01280000
ATCQLOCK EQU   ISTATCVT+1120                                            01281000
ATCITQLE EQU   ISTATCVT+1116                                            01282000
ATCSQCDS EQU   ISTATCVT+1112                                            01283000
ATCUSSVT EQU   ISTATCVT+1108                                            01284000
ATCNOSQ  EQU   ISTATCVT+1104                                            01285000
ATCINCIP EQU   ATCCPDVT+4                                               01286000
ATCTSCNI EQU   ATCCPDVT                                                 01287000
ATCMGCRT EQU   ISTATCVT+1092                                            01288000
ATCMACRT EQU   ISTATCVT+1088                                            01289000
ATCCSMT  EQU   ISTATCVT+1084                                            01290000
ATCDRUSL EQU   ISTATCVT+1080                                            01291000
ATCDRULL EQU   ISTATCVT+1076                                            01292000
ATCCFCDR EQU   ISTATCVT+1072                                            01293000
@NM00256 EQU   ISTATCVT+1069                                            01294000
ATCMROUT EQU   ISTATCVT+1060                                            01295000
ATCONFIG EQU   ISTATCVT+1052                                            01296000
ATCNODEL EQU   ISTATCVT+1044                                            01297000
@NM00255 EQU   @NM00254+9                                               01298000
ATCLAST  EQU   ATCSHRFG                                                 01299000
ATCSHRTN EQU   @NM00254                                                 01300000
@NM00253 EQU   ISTATCVT+1026                                            01301000
ATCNMCTR EQU   ISTATCVT+1024                                            01302000
ATCPOIA  EQU   ATCRNO+1                                                 01303000
@NM00252 EQU   ATCRNO                                                   01304000
ATCLCLCT EQU   ATCVLCNT+2                                               01305000
ATCRNCNT EQU   ATCVLCNT                                                 01306000
ATCHBSIZ EQU   ATCHPGM+2                                                01307000
ATCHBFNO EQU   ATCHPGM                                                  01308000
@NM00251 EQU   ISTATCVT+1011                                            01309000
ATCXRANG EQU   ISTATCVT+1010                                            01310000
ATCMAXID EQU   ISTATCVT+1009                                            01311000
ATCMSGSP EQU   ISTATCVT+1008                                            01312000
ATCCIDM  EQU   ISTATCVT+1006                                            01313000
ATCACTRM EQU   ISTATCVT+1004                                            01314000
ATCECTLP EQU   ISTATCVT+1000                                            01315000
ATCECNET EQU   ISTATCVT+996                                             01316000
ATCECOPC EQU   ISTATCVT+992                                             01317000
ATCECSES EQU   ISTATCVT+988                                             01318000
ATCECDSP EQU   ISTATCVT+984                                             01319000
ATCECVRY EQU   ISTATCVT+980                                             01320000
ATCECHLT EQU   ISTATCVT+976                                             01321000
ATCECMOD EQU   ISTATCVT+972                                             01322000
ATCVDLOK EQU   ISTATCVT+968                                             01323000
ATCRDTLK EQU   ISTATCVT+964                                             01324000
ATCVOCLK EQU   ISTATCVT+960                                             01325000
ATCITLIM EQU   ISTATCVT+958                                             01326000
ATCTMINV EQU   ISTATCVT+956                                             01327000
ATCHOSTA EQU   ISTATCVT+954                                             01328000
ATCPUNSA EQU   ISTATCVT+952                                             01329000
ATCSAF   EQU   ISTATCVT+950                                             01330000
ATCVTMID EQU   ATCSSCPA                                                 01331000
ATCHCNID EQU   ATCONID+2                                                01332000
ATCSCNID EQU   ATCONID                                                  01333000
@NM00250 EQU   ATCBITAN+3                                               01334000
@NM00249 EQU   ATCBITAN+2                                               01335000
@NM00248 EQU   ATCFLAG2                                                 01336000
@NM00247 EQU   ATCFLAG2                                                 01337000
@NM00246 EQU   ATCFLAG2                                                 01338000
ATCCRYPF EQU   ATCFLAG2                                                 01339000
ATCTUNCL EQU   ATCFLAG2                                                 01340000
ATCTUNRQ EQU   ATCFLAG2                                                 01341000
ATCTUNAC EQU   ATCFLAG2                                                 01342000
ATCCDLRA EQU   ATCFLAG2                                                 01343000
@NM00245 EQU   ATCBITAN                                                 01344000
@NM00244 EQU   ATCSTAT4                                                 01345000
@NM00243 EQU   ATCSTAT4                                                 01346000
@NM00242 EQU   ATCSTAT4                                                 01347000
@NM00241 EQU   ATCSTAT4                                                 01348000
@NM00240 EQU   ATCSTAT4                                                 01349000
ATCPRTAT EQU   ATCSTAT4                                                 01350000
ATCNCSD  EQU   ATCSTAT4                                                 01351000
ATCMTST  EQU   ATCSTAT4                                                 01352000
@NM00239 EQU   ATCPOFLG                                                 01353000
@NM00238 EQU   ATCPOFLG                                                 01354000
@NM00237 EQU   ATCPOFLG                                                 01355000
@NM00236 EQU   ATCPOFLG                                                 01356000
@NM00235 EQU   ATCPOFLG                                                 01357000
@NM00234 EQU   ATCPOFLG                                                 01358000
@NM00233 EQU   ATCPOFLG                                                 01359000
ATCPOUNS EQU   ATCPOFLG                                                 01360000
@NM00232 EQU   ATCSTAT+1                                                01361000
ATCHIP   EQU   ATCSTAT1                                                 01362000
ATCMDHLT EQU   ATCSTAT1                                                 01363000
ATCINHLT EQU   ATCSTAT1                                                 01364000
ATCNETSL EQU   ATCSTAT1                                                 01365000
ATCQKHLT EQU   ATCSTAT1                                                 01366000
ATCSNHLT EQU   ATCSTAT1                                                 01367000
ATCACTIV EQU   ATCSTAT1                                                 01368000
ATCSTART EQU   ATCSTAT1                                                 01369000
ATCNOP00 EQU   ISTATCVT+932                                             01370000
ATCTSBUF EQU   ISTATCVT+928                                             01371000
ATCFEPT  EQU   ISTATCVT+924                                             01372000
ATCFDVT  EQU   ISTATCVT+920                                             01373000
ATCCONFT EQU   ISTATCVT+916                                             01374000
ATCRDTH  EQU   ISTATCVT+912                                             01375000
ATCSIBQ  EQU   ISTATCVT+908                                             01376000
ATCHLTMS EQU   ISTATCVT+904                                             01377000
ATCECPRM EQU   ISTATCVT+900                                             01378000
ATCVPARM EQU   ISTATCVT+896                                             01379000
ATCOCHA  EQU   ISTATCVT+892                                             01380000
ATCDSPLQ EQU   ISTATCVT+888                                             01381000
ATCVARYQ EQU   ISTATCVT+884                                             01382000
ATCHALTQ EQU   ISTATCVT+880                                             01383000
ATCMODQ  EQU   ISTATCVT+876                                             01384000
ATCSRT   EQU   ISTATCVT+872                                             01385000
ATCRDT   EQU   ISTATCVT+868                                             01386000
ATCSDVT  EQU   ISTATCVT+864                                             01387000
ATCDLRPT EQU   ISTATCVT+860                                             01388000
ATCBPDA  EQU   ISTATCVT+856                                             01389000
ATCACDA  EQU   ISTATCVT+852                                             01390000
ATCMNT   EQU   ISTATCVT+848                                             01391000
ATCUEP   EQU   ISTATCVT+844                                             01392000
ATCNODDS EQU   ISTATCVT+840                                             01393000
ATCITRT  EQU   ISTATCVT+836                                             01394000
ATCTODVT EQU   ISTATCVT+832                                             01395000
ATCTRCPT EQU   ISTATCVT+828                                             01396000
ATCMODTB EQU   ISTATCVT+824                                             01397000
ATCUSSPT EQU   ISTATCVT+820                                             01398000
ATCTUBUF EQU   ISTATCVT+816                                             01399000
ATCTACB  EQU   ISTATCVT+812                                             01400000
ATCDWA   EQU   ISTATCVT+808                                             01401000
ATCCFCR2 EQU   ATCPODVT                                                 01402000
ATCEPA   EQU   ISTATCVT+800                                             01403000
ATCPULQB EQU   @NM00231+16                                              01404000
ATCMCQAB EQU   @NM00231+12                                              01405000
ATCLUSMQ EQU   @NM00231+8                                               01406000
ATCLUIOQ EQU   @NM00231+4                                               01407000
ATCIOLQB EQU   @NM00231                                                 01408000
ATCTSCAP EQU   ATCANYDT                                                 01409000
ATCTSCCO EQU   ATCLUDVT+4                                               01410000
ATCTSCSR EQU   ATCLUDVT                                                 01411000
ATCVTLOD EQU   ISTATCVT+764                                             01412000
ATCTSCLF EQU   ISTATCVT+760                                             01413000
ATCTSCLE EQU   ISTATCVT+756                                             01414000
ATCTSCLB EQU   ISTATCVT+752                                             01415000
ATCTSCLS EQU   ISTATCVT+748                                             01416000
ATCTSCCF EQU   ISTATCVT+744                                             01417000
ATCTSCFV EQU   ISTATCVT+740                                             01418000
ATCTSCCE EQU   ISTATCVT+736                                             01419000
ATCTSCCB EQU   ISTATCVT+732                                             01420000
ATCTSCWS EQU   ISTATCVT+728                                             01421000
ATCTSCEM EQU   ISTATCVT+724                                             01422000
ATCTSCNS EQU   ISTATCVT+720                                             01423000
ATCTSCER EQU   ISTATCVT+716                                             01424000
ATCTSCPR EQU   ISTATCVT+712                                             01425000
ATCTSCGR EQU   ISTATCVT+708                                             01426000
ATCTSCCI EQU   ISTATCVT+704                                             01427000
ATCTSVT  EQU   ISTATCVT+700                                             01428000
ATCDVLOD EQU   ISTATCVT+696                                             01429000
ATCCDCNR EQU   ISTATCVT+692                                             01430000
ATCCDCNF EQU   ISTATCVT+688                                             01431000
ATCCDCND EQU   ISTATCVT+684                                             01432000
ATCCDCNA EQU   ISTATCVT+680                                             01433000
ATCCDCCP EQU   ISTATCVT+676                                             01434000
ATCCDFDN EQU   ISTATCVT+672                                             01435000
ATCCDFIN EQU   ISTATCVT+668                                             01436000
ATCCDFND EQU   ISTATCVT+664                                             01437000
ATCCDDEL EQU   ISTATCVT+660                                             01438000
ATCCDADD EQU   ISTATCVT+656                                             01439000
ATCTCLIM EQU   ISTATCVT+652                                             01440000
ATCRACTR EQU   ISTATCVT+648                                             01441000
ATCRACTI EQU   ISTATCVT+644                                             01442000
ATCREMOV EQU   ISTATCVT+640                                             01443000
ATCRACIO EQU   ISTATCVT+636                                             01444000
ATCADD   EQU   ISTATCVT+632                                             01445000
ATCPUCRT EQU   ISTATCVT+628                                             01446000
ATCSMRS  EQU   ISTATCVT+624                                             01447000
ATCSMRQ  EQU   ISTATCVT+620                                             01448000
ATCORCPX EQU   ISTATCVT+616                                             01449000
ATCORCAF EQU   ISTATCVT+612                                             01450000
ATCFRSTR EQU   ATCGTSTR                                                 01451000
ATCSTMA  EQU   ISTATCVT+604                                             01452000
ATCSRTAD EQU   ISTATCVT+600                                             01453000
ATCOCRT  EQU   ISTATCVT+596                                             01454000
ATCOCCFS EQU   ISTATCVT+592                                             01455000
ATCOCCFP EQU   ISTATCVT+588                                             01456000
ATCSRTDF EQU   ISTATCVT+584                                             01457000
ATCLUCRT EQU   ISTATCVT+580                                             01458000
ATCINCY5 EQU   ISTATCVT+576                                             01459000
ATCINCW3 EQU   ISTATCVT+572                                             01460000
ATCINCU6 EQU   ISTATCVT+568                                             01461000
ATCINCTQ EQU   ISTATCVT+564                                             01462000
ATCINCS1 EQU   ISTATCVT+560                                             01463000
ATCSRTAB EQU   ISTATCVT+556                                             01464000
ATCINCRD EQU   ISTATCVT+552                                             01465000
ATCINCPH EQU   ISTATCVT+548                                             01466000
ATCINCLQ EQU   ISTATCVT+544                                             01467000
ATCNOCRT EQU   ISTATCVT+540                                             01468000
ATCINCF1 EQU   ISTATCVT+536                                             01469000
ATCINCCI EQU   ISTATCVT+532                                             01470000
ATCINCCO EQU   ISTATCVT+528                                             01471000
ATCBLDLA EQU   ISTATCVT+524                                             01472000
ATCALOAD EQU   ISTATCVT+520                                             01473000
ATCADEL  EQU   ISTATCVT+516                                             01474000
ATCESC02 EQU   ISTATCVT+512                                             01475000
ATCESC01 EQU   ISTATCVT+508                                             01476000
ATCDEC01 EQU   ISTATCVT+504                                             01477000
ATCDEC00 EQU   ISTATCVT+500                                             01478000
ATCCPCRT EQU   ISTATCVT+496                                             01479000
ATCMSGM  EQU   ISTATCVT+492                                             01480000
ATCCPCFR EQU   ISTATCVT+488                                             01481000
ATCCPCGR EQU   ISTATCVT+484                                             01482000
ATCCPCPP EQU   ISTATCVT+480                                             01483000
ATCMSGP  EQU   ISTATCVT+476                                             01484000
ATCCPCNT EQU   ISTATCVT+472                                             01485000
ATCAUTHA EQU   ISTATCVT+468                                             01486000
ATCACCTA EQU   ISTATCVT+464                                             01487000
ATCAP39  EQU   ISTATCVT+460                                             01488000
ATCAP36  EQU   ISTATCVT+456                                             01489000
ATCAP35  EQU   ISTATCVT+452                                             01490000
ATCAP33  EQU   ISTATCVT+448                                             01491000
ATCAPCR5 EQU   ISTATCVT+444                                             01492000
ATCAICPT EQU   ISTATCVT+440                                             01493000
ATCAPI   EQU   ISTATCVT+436                                             01494000
ATCAICTN EQU   ISTATCVT+432                                             01495000
ATCACC01 EQU   ISTATCVT+428                                             01496000
ATCACC00 EQU   ISTATCVT+424                                             01497000
ATCLDECB EQU   ATCLDTIL+12                                              01498000
ATCLDLCK EQU   ATCLDTIL+8                                               01499000
ATCLDLST EQU   ATCLDTIL+4                                               01500000
ATCLDNCS EQU   ATCLDTIL                                                 01501000
ATCNOSPB EQU   ISTATCVT+376                                             01502000
ATCNSPAB EQU   ISTATCVT+344                                             01503000
ATCLUSRT EQU   ISTATCVT+312                                             01504000
ATCPUIOP EQU   ISTATCVT+280                                             01505000
ATCPUPAB EQU   ISTATCVT+248                                             01506000
ATCPXPAB EQU   ISTATCVT+216                                             01507000
ATCPOPAB EQU   ISTATCVT+184                                             01508000
@NM00230 EQU   ATCVDPAB+16                                              01509000
ATCFEPAB EQU   ATCVDPAB                                                 01510000
ATCTCIPB EQU   ISTATCVT+120                                             01511000
ATCCSPAB EQU   ATCSMPAB+16                                              01512000
@NM00229 EQU   ATCSMPAB                                                 01513000
ATCTMRPB EQU   ISTATCVT+56                                              01514000
ATCITPAB EQU   ISTATCVT+24                                              01515000
@NM00228 EQU   ATCITRA1                                                 01516000
ATCITSCP EQU   ATCITRA1                                                 01517000
ATCITMSG EQU   ATCITRA1                                                 01518000
ATCITPIU EQU   ATCITRA1                                                 01519000
ATCITSMS EQU   ATCITRA1                                                 01520000
ATCITPSS EQU   ATCITRA1                                                 01521000
ATCITLCK EQU   ATCITRA1                                                 01522000
ATCITAPI EQU   ATCITRA1                                                 01523000
ATCITCNT EQU   ATCITFLG                                                 01524000
ATCITRPH EQU   ATCITCDS                                                 01525000
ATCITTBL EQU   ATCITFLD+4                                               01526000
ATCITPRM EQU   ATCITFLD                                                 01527000
ATCPTCHA EQU   ATCRPTCH+4                                               01528000
ATCVTLVL EQU   ATCRPTCH                                                 01529000
@NM00210 EQU   ICNSYSUA+232                                             01530000
ICNSRB   EQU   ICNSYSUA+188                                             01531000
ICNIOSB  EQU   ICNDCDEB+64                                              01532000
ICNDCBIF EQU   ICNDIDEB                                                 01533000
ICNEXSCL EQU   ICNDCDEB+28                                              01534000
ICNDEBID EQU   ICNDCDEB+24                                              01535000
@NM00209 EQU   ICNDCDEB                                                 01536000
ICNERPWA EQU   ICNSYSUA+8                                               01537000
ICNCNTRL EQU   ICNSYSUA+4                                               01538000
ICNCKPAB EQU   ICNCKFLD+1                                               01539000
@NM00208 EQU   ICNCKFLD                                                 01540000
ICNCKBIT EQU   ICNCKFLD                                                 01541000
ICNLNKMD EQU   ICNDEVCA+100                                             01542000
ICNMSIZE EQU   ICNDEVCA+88                                              01543000
@NM00207 EQU   ICNFLAG2+3                                               01544000
@NM00206 EQU   ICNFLAG2+2                                               01545000
@NM00205 EQU   ICNFLAG2+1                                               01546000
@NM00204 EQU   @NM00203                                                 01547000
ICNLCLUS EQU   @NM00203                                                 01548000
ICNPATHO EQU   ICNDEVCA+76                                              01549000
ICNPATHI EQU   ICNDEVCA+72                                              01550000
ICNBUFNO EQU   ICNBUFFQ+4                                               01551000
ICNBUFQH EQU   ICNBUFFQ                                                 01552000
ICNPNDQT EQU   ICNPENDQ+4                                               01553000
ICNPNDQH EQU   ICNPENDQ                                                 01554000
ICNWBCCW EQU   ICNDEVCA+16                                              01555000
ICNLOCK  EQU   ICNDLCIA+20                                              01556000
ICNSIB   EQU   ICNDLCIA+16                                              01557000
@NM00202 EQU   ICNSTS+1                                                 01558000
@NM00201 EQU   @NM00200                                                 01559000
ICNPOSTF EQU   @NM00200                                                 01560000
ICNERROR EQU   @NM00200                                                 01561000
ICNBUSYF EQU   @NM00200                                                 01562000
ICNREADY EQU   @NM00200                                                 01563000
@NM00199 EQU   @NM00198                                                 01564000
ICNDTREJ EQU   @NM00198                                                 01565000
ICNDLCHK EQU   @NM00198                                                 01566000
ICNABORT EQU   @NM00197                                                 01567000
ICNIPLRQ EQU   @NM00197                                                 01568000
ICNSN02  EQU   ICNOVRUN                                                 01569000
ICNSN01  EQU   ICNDTCHK                                                 01570000
ICNEQCHK EQU   @NM00197                                                 01571000
ICNBOCHK EQU   @NM00197                                                 01572000
ICNINTRQ EQU   @NM00197                                                 01573000
ICNCMDRJ EQU   @NM00197                                                 01574000
ICNCAW   EQU   ICNDLCIA+8                                               01575000
ICNCSW   EQU   ICNDLCIA                                                 01576000
@NM00196 EQU   ISTICNCB+102                                             01577000
ICNPUNA  EQU   ISTICNCB+100                                             01578000
ICNUSECT EQU   ISTICNCB+96                                              01579000
ICNPCPAB EQU   ISTICNCB+64                                              01580000
ICNUFPAB EQU   ISTICNCB+48                                              01581000
ICNCB    EQU   ISTICNCB                                                 01582000
NCBRSV01 EQU   ISTNCB+46                                                01583000
NCBSWDAF EQU   ISTNCB+44                                                01584000
NCBDEVCH EQU   ISTNCB+36                                                01585000
NCBFMCBP EQU   ISTNCB+32                                                01586000
NCBLTRC  EQU   ISTNCB+30                                                01587000
@NM00195 EQU   ISTNCB+29                                                01588000
@NM00194 EQU   NCBEXFLG                                                 01589000
@NM00193 EQU   NCBEXFLG                                                 01590000
@NM00192 EQU   NCBEXFLG                                                 01591000
@NM00191 EQU   NCBEXFLG                                                 01592000
NCBEXSDA EQU   NCBEXFLG                                                 01593000
NCBEXSNO EQU   NCBEXFLG                                                 01594000
NCBEXAIL EQU   NCBEXFLG                                                 01595000
NCBEXAIC EQU   NCBEXFLG                                                 01596000
NCBNMLLN EQU   NCBFLAGS+3                                               01597000
@NM00190 EQU   NCBFLAG1                                                 01598000
NCBUEXIT EQU   NCBFLAG1                                                 01599000
NCBFORCE EQU   NCBFLAG1                                                 01600000
NCBTTF   EQU   NCBFLAG1                                                 01601000
NCBRSYNC EQU   NCBFLAG1                                                 01602000
NCBRSTRT EQU   NCBFLAG1                                                 01603000
NCBCONF  EQU   NCBFLAG1                                                 01604000
NCBSNAI  EQU   NCBFLAG1                                                 01605000
NCBFLTIO EQU   NCBFTRIO                                                 01606000
NCBCSTAT EQU   NCBFLAGS                                                 01607000
NCBNCSL  EQU   ISTNCB+22                                                01608000
NCBNCBA  EQU   ISTNCB+20                                                01609000
NCBFMCBA EQU   ISTNCB+16                                                01610000
NCBNSNA  EQU   ISTNCB+12                                                01611000
NCBTSKID EQU   ISTNCB+8                                                 01612000
NCBRDTE  EQU   ISTNCB+4                                                 01613000
NCBDAF   EQU   ISTNCB+2                                                 01614000
NCBLNGTH EQU   ISTNCB+1                                                 01615000
NCBTYPE  EQU   ISTNCB                                                   01616000
RPHUPSTA EQU   ISTRPH+104                                               01617000
RPHSAV16 EQU   RPHWORK+60                                               01618000
RPHSAV15 EQU   RPHWORK+56                                               01619000
RPHSAV14 EQU   RPHWORK+52                                               01620000
RPHSAV13 EQU   RPHWORK+48                                               01621000
RPHSAV12 EQU   RPHWORK+44                                               01622000
RPHSAV11 EQU   RPHWORK+40                                               01623000
RPHSAV10 EQU   RPHWORK+36                                               01624000
RPHSAVE9 EQU   RPHWORK+32                                               01625000
RPHSAVE8 EQU   RPHWORK+28                                               01626000
RPHSAVE7 EQU   RPHWORK+24                                               01627000
RPHSAVE6 EQU   RPHWORK+20                                               01628000
RPHSAVE5 EQU   RPHWORK+16                                               01629000
RPHSAVE4 EQU   RPHWORK+12                                               01630000
RPHSAVE3 EQU   RPHWORK+8                                                01631000
RPHSAVE2 EQU   RPHWORK+4                                                01632000
RPHSHALF EQU   RPHSAVE1+2                                               01633000
RPHSBIT8 EQU   RPHSBITS                                                 01634000
RPHSBIT7 EQU   RPHSBITS                                                 01635000
RPHSBIT6 EQU   RPHSBITS                                                 01636000
RPHSBIT5 EQU   RPHSBITS                                                 01637000
RPHSBIT4 EQU   RPHSBITS                                                 01638000
RPHSBIT3 EQU   RPHSBITS                                                 01639000
RPHSBIT2 EQU   RPHSBITS                                                 01640000
RPHSBIT1 EQU   RPHSBITS                                                 01641000
RPHSBYTE EQU   RPHSAVE1                                                 01642000
RPHPABQP EQU   RPHPABQA+1                                               01643000
RPHPABFG EQU   RPHPABQA                                                 01644000
RPHCRR   EQU   ISTRPH+32                                                01645000
RPHSRP34 EQU   RPHSRPRM+2                                               01646000
RPHSRP12 EQU   RPHSRPRM                                                 01647000
RPHWEGT  EQU   RPHCSPA                                                  01648000
RPHMAJCB EQU   ISTRPH+21                                                01649000
RPHPABOF EQU   ISTRPH+20                                                01650000
RPHRESUM EQU   RPHRESMA+1                                               01651000
@NM00189 EQU   RPHWPFLG                                                 01652000
RPHPURGE EQU   RPHWPFLG                                                 01653000
RPHPT    EQU   RPHWPFLG                                                 01654000
RPHWT    EQU   RPHWPFLG                                                 01655000
RPHRSKEY EQU   RPHWPFLG                                                 01656000
RPHDVTA  EQU   ISTRPH+12                                                01657000
RPHTIK   EQU   RPHTSKID+3                                               01658000
@NM00188 EQU   RPHTSKID                                                 01659000
RPHRPHAP EQU   RPHRPHA+1                                                01660000
@NM00187 EQU   RPHRPHA                                                  01661000
RPHGATE  EQU   RPHRPHA                                                  01662000
RPHABEND EQU   RPHFLGB                                                  01663000
RPHUWAIT EQU   RPHFLGB                                                  01664000
RPHRLCRA EQU   RPHFLGB                                                  01665000
@NM00186 EQU   RPHFLGB                                                  01666000
RPHPGCMP EQU   RPHFLGB                                                  01667000
RPHFBAPS EQU   RPHFLGB                                                  01668000
RPHBSSP  EQU   RPHFLGB                                                  01669000
RPHLOCK  EQU   RPHFLGB                                                  01670000
RPHFNFLG EQU   RPHFSTLC                                                 01671000
RPHMLTCP EQU   RPHFLAGS                                                 01672000
RPHSMCLR EQU   RPHFLAGS                                                 01673000
RPHSMTYP EQU   RPHFLAGS                                                 01674000
RPHSMQ   EQU   RPHFLAGS                                                 01675000
RPHAPTYP EQU   RPHFLAGS                                                 01676000
RPHSPGIN EQU   RPHFLAGS                                                 01677000
RPHOGIND EQU   RPHFLAGS                                                 01678000
RPHLNGTH EQU   RPHCNTL+1                                                01679000
RPHTYPE  EQU   RPHCNTL                                                  01680000
DYPPAB   EQU   ISTDYPAB+16                                              01681000
DYPOCRPH EQU   DYPPACMD                                                 01682000
DYPTSKID EQU   ISTDYPAB+8                                               01683000
DYPPACTB EQU   DYPCHAIN                                                 01684000
DYPFLGS  EQU   ISTDYPAB+2                                               01685000
DYPLNGTH EQU   ISTDYPAB+1                                               01686000
DYPTYPE  EQU   ISTDYPAB                                                 01687000
CCWCOUNT EQU   ISTCCW+6                                                 01688000
CCWSPRSV EQU   CCWSPARE                                                 01689000
CCWCFTX  EQU   CCWSPARE                                                 01690000
CCWTRCE  EQU   CCWSPARE                                                 01691000
CCWNULL  EQU   CCWFLAGS                                                 01692000
CCWPCI   EQU   CCWFLAGS                                                 01693000
CCWSKIP  EQU   CCWFLAGS                                                 01694000
CCWSLI   EQU   CCWFLAGS                                                 01695000
CCWCC    EQU   CCWFLAGS                                                 01696000
CCWCD    EQU   CCWFLAGS                                                 01697000
CCWADDR  EQU   CCWVADDR+1                                               01698000
CCWCODE  EQU   CCWVADDR                                                 01699000
PABRPHA  EQU   PABRPHFG+1                                               01700000
PABNODQ  EQU   PABFLAGS                                                 01701000
PABINHBT EQU   PABFLAGS                                                 01702000
PABERLOK EQU   PABERRLK                                                 01703000
PABSSN   EQU   PABFLAGS                                                 01704000
PABDYNAM EQU   PABFLAGS                                                 01705000
PABXTND  EQU   PABFLAGS                                                 01706000
PABPRIOR EQU   PABFLAGS                                                 01707000
PABAPYP  EQU   PABFLAGS                                                 01708000
PABDVTA  EQU   ISTPAB+9                                                 01709000
PABOFFST EQU   ISTPAB+8                                                 01710000
PABCHNGP EQU   PABCHAIN+1                                               01711000
PABRSV02 EQU   PABCHAIN                                                 01712000
PABDELAY EQU   PABCHAIN                                                 01713000
PABQUED  EQU   PABRUNNG                                                 01714000
PABRESET EQU   PABCHAIN                                                 01715000
PABUNCON EQU   PABCHAIN                                                 01716000
PABCDP   EQU   PABCHAIN                                                 01717000
PABRESCH EQU   PABCHAIN                                                 01718000
PABCHNG  EQU   PABCHAIN                                                 01719000
PABWEQP  EQU   PABWEQA+1                                                01720000
PABRSV01 EQU   PABWEQA                                                  01721000
PABWEQG  EQU   PABWEQA                                                  01722000
DNTTELNO EQU   ISTDNT+1                                                 01723000
DNTCTDIG EQU   ISTDNT                                                   01724000
DOTADTRM EQU   ISTDOT                                                   01725000
GNTGRPNM EQU   ISTGNT                                                   01726000
@NM00184 EQU   PATFLAGA                                                 01727000
@NM00183 EQU   PATFLAGA                                                 01728000
@NM00182 EQU   PATFLAGA                                                 01729000
@NM00181 EQU   PATFLAGA                                                 01730000
@NM00180 EQU   PATFLAGA                                                 01731000
@NM00179 EQU   PATFLAGA                                                 01732000
@NM00178 EQU   PATFLAGA                                                 01733000
PATUSEFG EQU   PATFLAGA                                                 01734000
PATRDCNT EQU   ISTPAT+6                                                 01735000
PATGRPID EQU   ISTPAT+5                                                 01736000
PATPTHID EQU   ISTPAT+4                                                 01737000
PATDINDX EQU   ISTPAT+2                                                 01738000
PATGINDX EQU   ISTPAT                                                   01739000
RCCEND   EQU   ISTRCC+124                                               01740000
RCCIDNUM EQU   RCCID48+3                                                01741000
RCCIDBLK EQU   RCCID48+2                                                01742000
RCCIDPA2 EQU   RCCID48+1                                                01743000
RCCIDPUT EQU   RCCID48                                                  01744000
RCCIDPA1 EQU   RCCSTAID                                                 01745000
@NM00177 EQU   ISTRCC+114                                               01746000
RCCCRFLG EQU   ISTRCC+113                                               01747000
RCCADDR  EQU   ISTRCC+112                                               01748000
RCCPASSL EQU   ISTRCC+111                                               01749000
RCCMXOUT EQU   ISTRCC+110                                               01750000
RCCSESCT EQU   ISTRCC+109                                               01751000
RCCCNCNT EQU   ISTRCC+108                                               01752000
RCCPUXPT EQU   ISTRCC+104                                               01753000
RCCMXDAT EQU   ISTRCC+102                                               01754000
RCCINDEX EQU   ISTRCC+100                                               01755000
RCCPATHZ EQU   ISTRCC+98                                                01756000
RCCCTELU EQU   ISTRCC+96                                                01757000
RCCTIMER EQU   ISTRCC+92                                                01758000
RCCPATHT EQU   ISTRCC+88                                                01759000
@NM00176 EQU   RCCBITAN+1                                               01760000
@NM00175 EQU   RCCBITAN+1                                               01761000
@NM00174 EQU   RCCBITAN+1                                               01762000
@NM00173 EQU   RCCBITAN+1                                               01763000
@NM00172 EQU   RCCBITAN+1                                               01764000
@NM00171 EQU   RCCBITAN+1                                               01765000
RCCANS   EQU   RCCBITAN+1                                               01766000
RCCBNNSP EQU   RCCBITAN+1                                               01767000
RCCIRETR EQU   RCCBITAN                                                 01768000
RCCDSNPR EQU   RCCBITAN                                                 01769000
RCCACTPU EQU   RCCBITAN                                                 01770000
RCCBRKCN EQU   RCCBITAN                                                 01771000
RCCFINAL EQU   RCCBITAN                                                 01772000
RCCDIALP EQU   RCCBITAN                                                 01773000
RCCBRKF  EQU   RCCBITAN                                                 01774000
RCCCTPGD EQU   RCCBITAN                                                 01775000
RCCCDFLG EQU   ISTRCC+85                                                01776000
RCCTYPE  EQU   ISTRCC+84                                                01777000
RCCPRE   EQU   ISTRCC                                                   01778000
RCDRMEND EQU   ISTRCDRM+212                                             01779000
@NM00170 EQU   ISTRCDRM+209                                             01780000
RCDRMSC  EQU   ISTRCDRM+208                                             01781000
@NM00169 EQU   RCDRMFGS+3                                               01782000
@NM00168 EQU   RCDRMFGS+3                                               01783000
@NM00167 EQU   RCDRMFGS+3                                               01784000
@NM00166 EQU   RCDRMFGS+3                                               01785000
@NM00165 EQU   RCDRMFGS+3                                               01786000
@NM00164 EQU   RCDRMFGS+3                                               01787000
@NM00163 EQU   RCDRMFGS+3                                               01788000
@NM00162 EQU   RCDRMFGS+3                                               01789000
@NM00161 EQU   RCDRMFGS+2                                               01790000
@NM00160 EQU   RCDRMFGS+2                                               01791000
RCDRMRID EQU   RCDRMFGS+2                                               01792000
RCDRMLOQ EQU   RCDRMFGS+2                                               01793000
RCDRMNMP EQU   RCDRMFGS+2                                               01794000
RCDRMPS  EQU   RCDRMFGS+2                                               01795000
RCDRMURC EQU   RCDRMFGS+2                                               01796000
RCDRMNAP EQU   RCDRMFGS+2                                               01797000
RCDRMVL  EQU   RCDRMFGS+1                                               01798000
RCDRMSPC EQU   RCDRMFGS+1                                               01799000
RCDRMINC EQU   RCDRMFGS+1                                               01800000
RCDRMLPS EQU   RCDRMFGS+1                                               01801000
RCDRMTCR EQU   RCDRMFGS+1                                               01802000
RCDRMDTC EQU   RCDRMFGS+1                                               01803000
RCDRMDT  EQU   RCDRMFGS+1                                               01804000
RCDRMCLR EQU   RCDRMFGS+1                                               01805000
RCDRMCLC EQU   RCDRMFGS                                                 01806000
RCDRMDCD EQU   RCDRMFGS                                                 01807000
RCDRMOVR EQU   RCDRMFGS                                                 01808000
RCDRMSDT EQU   RCDRMFGS                                                 01809000
RCDRMACT EQU   RCDRMFGS                                                 01810000
RCDRMOPN EQU   RCDRMFGS                                                 01811000
RCDRMPRI EQU   RCDRMFGS                                                 01812000
RCDRMHST EQU   RCDRMFGS                                                 01813000
RCDRMRP  EQU   ISTRCDRM+200                                             01814000
RCDRMLRP EQU   RCDRMRPQ+4                                               01815000
RCDRMFRP EQU   RCDRMRPQ                                                 01816000
RCDRMARP EQU   ISTRCDRM+188                                             01817000
RCDRMPDT EQU   RCDRMPDN                                                 01818000
RCDRMPR  EQU   ISTRCDRM                                                 01819000
RCDRSEND EQU   ISTRCDRS+164                                             01820000
RCDCDRMN EQU   ISTRCDRS+156                                             01821000
RCDRCDRM EQU   ISTRCDRS+148                                             01822000
RCDRSARP EQU   ISTRCDRS+144                                             01823000
RCDRSPR  EQU   ISTRCDRS                                                 01824000
RCLEND   EQU   ISTRCL+100                                               01825000
@NM00159 EQU   ISTRCL+98                                                01826000
RCLCTNGP EQU   ISTRCL+96                                                01827000
RCLCTECM EQU   ISTRCL+94                                                01828000
RCLCTETR EQU   ISTRCL+92                                                01829000
RCLGPOLA EQU   ISTRCL+88                                                01830000
RCLGPADR EQU   RCLADR+1                                                 01831000
@NM00158 EQU   RCLFLAG                                                  01832000
@NM00157 EQU   RCLFLAG                                                  01833000
@NM00156 EQU   RCLFLAG                                                  01834000
@NM00155 EQU   RCLFLAG                                                  01835000
@NM00154 EQU   RCLFLAG                                                  01836000
@NM00153 EQU   RCLFLAG                                                  01837000
@NM00152 EQU   RCLFLAG                                                  01838000
RCLBATCH EQU   RCLFLAG                                                  01839000
RCLPRE   EQU   ISTRCL                                                   01840000
RDAEND   EQU   ISTRDA+128                                               01841000
RDAPRE   EQU   ISTRDA                                                   01842000
RDSEND   EQU   ISTRDS+92                                                01843000
RDSCTATR EQU   ISTRDS+90                                                01844000
RDSCTTRM EQU   ISTRDS+88                                                01845000
RDSADDOT EQU   ISTRDS+84                                                01846000
RDSPRE   EQU   ISTRDS                                                   01847000
RGPEND   EQU   ISTRGP+96                                                01848000
@NM00151 EQU   ISTRGP+95                                                01849000
@NM00150 EQU   RGPBITAN                                                 01850000
@NM00149 EQU   RGPBITAN                                                 01851000
@NM00148 EQU   RGPBITAN                                                 01852000
@NM00147 EQU   RGPBITAN                                                 01853000
RGPASDLC EQU   RGPBITAN                                                 01854000
RGPABSC  EQU   RGPBITAN                                                 01855000
RGPASS   EQU   RGPBITAN                                                 01856000
RGPADIL  EQU   RGPBITAN                                                 01857000
RGPCTECM EQU   ISTRGP+92                                                01858000
RGPCTEIN EQU   ISTRGP+90                                                01859000
RGPCTETR EQU   ISTRGP+88                                                01860000
RGPCTECL EQU   ISTRGP+86                                                01861000
RGPCTELN EQU   ISTRGP+84                                                01862000
RGPPRE   EQU   ISTRGP                                                   01863000
RINEND   EQU   ISTRIN+120                                               01864000
RINREAL  EQU   ISTRIN+112                                               01865000
@NM00146 EQU   ISTRIN+111                                               01866000
@NM00145 EQU   RINBITAN                                                 01867000
@NM00144 EQU   RINBITAN                                                 01868000
RINPRSWD EQU   RINBITAN                                                 01869000
RINLOCAL EQU   RINBITAN                                                 01870000
RINPEER  EQU   RINBITAN                                                 01871000
RINLDISC EQU   RINBITAN                                                 01872000
RINNODEF EQU   RINBITAN                                                 01873000
RINREMPO EQU   RINBITAN                                                 01874000
RINCNCNT EQU   ISTRIN+109                                               01875000
RINNODID EQU   ISTRIN+108                                               01876000
RINRLDAF EQU   RINDAFID+2                                               01877000
@NM00143 EQU   RINDAFID                                                 01878000
RINLOCRN EQU   ISTRIN+100                                               01879000
RINSVREM EQU   ISTRIN+96                                                01880000
RINSVTRE EQU   ISTRIN+92                                                01881000
RINREMOT EQU   ISTRIN+88                                                01882000
RINTRENT EQU   ISTRIN+84                                                01883000
RINCRPRE EQU   ISTRIN                                                   01884000
RLCEND   EQU   ISTRLC+92                                                01885000
@NM00142 EQU   ISTRLC+91                                                01886000
RLCLCCUA EQU   ISTRLC+88                                                01887000
RLCUCBAD EQU   RLCADR+1                                                 01888000
@NM00141 EQU   RLCFLAG                                                  01889000
@NM00140 EQU   RLCFLAG                                                  01890000
@NM00139 EQU   RLCFLAG                                                  01891000
@NM00138 EQU   RLCFLAG                                                  01892000
@NM00137 EQU   RLCFLAG                                                  01893000
@NM00136 EQU   RLCFLAG                                                  01894000
RLCACNT  EQU   RLCFLAG                                                  01895000
RLCALLOC EQU   RLCFLAG                                                  01896000
RLCPRE   EQU   ISTRLC                                                   01897000
RLSEND   EQU   ISTRLS+140                                               01898000
@NM00135 EQU   ISTRLS+138                                               01899000
RLSCTELU EQU   ISTRLS+136                                               01900000
RLSPRE   EQU   ISTRLS                                                   01901000
RLUEND   EQU   ISTRLU+152                                               01902000
RLUSEQNO EQU   ISTRLU+148                                               01903000
@NM00134 EQU   RLUBITAN+1                                               01904000
@NM00133 EQU   RLUBITAN+1                                               01905000
@NM00132 EQU   RLUBITAN+1                                               01906000
@NM00131 EQU   RLUBITAN+1                                               01907000
@NM00130 EQU   RLUBITAN+1                                               01908000
@NM00129 EQU   RLUBITAN+1                                               01909000
@NM00128 EQU   RLUBITAN+1                                               01910000
@NM00127 EQU   RLUBITAN                                                 01911000
@NM00126 EQU   RLUBITAN                                                 01912000
@NM00125 EQU   RLUBITAN                                                 01913000
RLUCLNUP EQU   RLUBITAN                                                 01914000
RLUACTLU EQU   RLUBITAN                                                 01915000
RLUCDCTL EQU   RLUBITAN                                                 01916000
RLUNDSES EQU   RLUBITAN                                                 01917000
RLUBATCH EQU   RLUBITAN                                                 01918000
RLULOCAD EQU   ISTRLU+145                                               01919000
RLUTYPE  EQU   ISTRLU+144                                               01920000
RLUCRPR  EQU   ISTRLU                                                   01921000
RLXEND   EQU   ISTRLX+96                                                01922000
@NM00124 EQU   ISTRLX+93                                                01923000
@NM00123 EQU   RLXBITAN                                                 01924000
@NM00122 EQU   RLXBITAN                                                 01925000
@NM00121 EQU   RLXBITAN                                                 01926000
@NM00120 EQU   RLXBITAN                                                 01927000
@NM00119 EQU   RLXBITAN                                                 01928000
@NM00118 EQU   RLXBITAN                                                 01929000
@NM00117 EQU   RLXBITAN                                                 01930000
RLXINUSE EQU   RLXBITAN                                                 01931000
RLXLUPTR EQU   ISTRLX+88                                                01932000
RLXNLUX  EQU   ISTRLX+84                                                01933000
RLXPRE   EQU   ISTRLX                                                   01934000
RPTEND   EQU   ISTRPT+168                                               01935000
RPTCTNM  EQU   ISTRPT+160                                               01936000
@NM00116 EQU   RPTBITAN+1                                               01937000
@NM00115 EQU   RPTBITAN+1                                               01938000
@NM00114 EQU   RPTBITAN+1                                               01939000
@NM00113 EQU   RPTBITAN+1                                               01940000
@NM00112 EQU   RPTBITAN+1                                               01941000
@NM00111 EQU   RPTBITAN+1                                               01942000
@NM00110 EQU   RPTBITAN+1                                               01943000
@NM00109 EQU   RPTBITAN+1                                               01944000
RPTISTAT EQU   RPTBITAN                                                 01945000
RPTDYNAM EQU   RPTBITAN                                                 01946000
RPTVYIMM EQU   RPTBITAN                                                 01947000
RPTVIODN EQU   RPTBITAN                                                 01948000
RPTONLIN EQU   RPTBITAN                                                 01949000
RPTHLVPD EQU   RPTBITAN                                                 01950000
RPTVRYPD EQU   RPTBITAN                                                 01951000
RPTASLEP EQU   RPTBITAN                                                 01952000
RPTDAFSV EQU   ISTRPT+156                                               01953000
RPTPTHCT EQU   ISTRPT+154                                               01954000
RPTPEPCT EQU   ISTRPT+152                                               01955000
RPTNSNSV EQU   ISTRPT+148                                               01956000
RPTUTERM EQU   ISTRPT+144                                               01957000
RPTATERM EQU   ISTRPT+140                                               01958000
RPTDIVT  EQU   RPTDITT                                                  01959000
@NM00108 EQU   RPTXTCID+4                                               01960000
RPTLNDAF EQU   RPTLNCID+2                                               01961000
RPTLNSAF EQU   RPTLNCID                                                 01962000
RPTLN    EQU   ISTRPT                                                   01963000
RPXEND   EQU   ISTRPX+96                                                01964000
@NM00107 EQU   ISTRPX+93                                                01965000
RPXMAXLU EQU   ISTRPX+92                                                01966000
RPXPUPTR EQU   ISTRPX+88                                                01967000
RPXFLUX  EQU   ISTRPX+84                                                01968000
RPXPRE   EQU   ISTRPX                                                   01969000
RRNEND   EQU   ISTRRN+300                                               01970000
@NM00106 EQU   ISTRRN+296                                               01971000
RRNPUXTN EQU   ISTRRN+292                                               01972000
RRNLUCT  EQU   ISTRRN+290                                               01973000
RRNPUCT  EQU   ISTRRN+288                                               01974000
RRNLPPTR EQU   ISTRRN+284                                               01975000
RRNTPPTR EQU   ISTRRN+280                                               01976000
RRNFNAEQ EQU   ISTRRN+276                                               01977000
@NM00105 EQU   ISTRRN+264                                               01978000
@NM00104 EQU   ISTRRN+260                                               01979000
RRNNMNCP EQU   ISTRRN+252                                               01980000
RRNRINNM EQU   ISTRRN+244                                               01981000
RRNCDPWE EQU   ISTRRN+240                                               01982000
RRNPUBI  EQU   RRNNMDPD+6                                               01983000
RRNDPLUB EQU   RRNNMDPD                                                 01984000
@NM00103 EQU   ISTRRN+231                                               01985000
RRNDEFLV EQU   ISTRRN+230                                               01986000
RRNRNCUA EQU   ISTRRN+227                                               01987000
RRNRDCUA EQU   ISTRRN+224                                               01988000
RRNNCPNM EQU   ISTRRN+217                                               01989000
RRNCTPCC EQU   ISTRRN+216                                               01990000
RRNCPLUB EQU   ISTRRN+210                                               01991000
RRNDELAY EQU   ISTRRN+208                                               01992000
RRNMODL  EQU   RRNLVL+2                                                 01993000
RRNRELL  EQU   RRNLVL                                                   01994000
@NM00102 EQU   RRNBITAN+2                                               01995000
@NM00101 EQU   RRNBITAN+2                                               01996000
@NM00100 EQU   RRNBITAN+2                                               01997000
@NM00099 EQU   RRNBITAN+2                                               01998000
@NM00098 EQU   RRNBITAN+2                                               01999000
RRNRBMDL EQU   RRNBITAN+2                                               02000000
RRNALLOC EQU   RRNBITAN+2                                               02001000
RRNACQRD EQU   RRNBITAN+2                                               02002000
RRNREMPO EQU   RRNBITAN+1                                               02003000
RRNRBBUP EQU   RRNBITAN+1                                               02004000
RRNRBCT2 EQU   RRNBITAN+1                                               02005000
RRNRBCT1 EQU   RRNBITAN+1                                               02006000
RRNRBSEC EQU   RRNBITAN+1                                               02007000
RRNRBCCT EQU   RRNBITAN+1                                               02008000
RRNRBCCL EQU   RRNBITAN+1                                               02009000
RRNRBREM EQU   RRNBITAN+1                                               02010000
RRNRSYN  EQU   RRNBITAN                                                 02011000
RRNRAPEP EQU   RRNBITAN                                                 02012000
RRNRANCP EQU   RRNBITAN                                                 02013000
RRNRAOLT EQU   RRNBITAN                                                 02014000
RRNRASYN EQU   RRNBITAN                                                 02015000
RRNRADMP EQU   RRNBITAN                                                 02016000
RRNRAIPL EQU   RRNBITAN                                                 02017000
RRNRASHT EQU   RRNBITAN                                                 02018000
RRNHSTID EQU   ISTRRN+200                                               02019000
RRNHBUFS EQU   ISTRRN+198                                               02020000
RRNHLENT EQU   RRNHPRE+1                                                02021000
RRNHLENH EQU   RRNHPRE                                                  02022000
RRNNODCT EQU   ISTRRN+194                                               02023000
RRNEPADR EQU   ISTRRN+192                                               02024000
RRNCTENT EQU   ISTRRN+190                                               02025000
RRNCTECM EQU   ISTRRN+188                                               02026000
RRNCTEIN EQU   ISTRRN+186                                               02027000
RRNCTETR EQU   ISTRRN+184                                               02028000
RRNCTECL EQU   ISTRRN+182                                               02029000
RRNCTELI EQU   ISTRRN+180                                               02030000
RRNCTEGP EQU   ISTRRN+178                                               02031000
RRNCTBHS EQU   ISTRRN+176                                               02032000
RRNTABCT EQU   ISTRRN+172                                               02033000
RRNLASTE EQU   ISTRRN+168                                               02034000
RRNNCSPL EQU   ISTRRN+164                                               02035000
RRNRPLPT EQU   ISTRRN+160                                               02036000
RRNMSIZE EQU   ISTRRN+156                                               02037000
RRNFLUX  EQU   ISTRRN+152                                               02038000
RRNBHSET EQU   ISTRRN+148                                               02039000
RRNTRENT EQU   ISTRRN+144                                               02040000
RRNGRPA  EQU   ISTRRN+140                                               02041000
RRNLUBA  EQU   RRNUCBAD+1                                               02042000
RRNCHQI  EQU   RRNUCBAD                                                 02043000
@NM00097 EQU   RRNFLAG                                                  02044000
@NM00096 EQU   RRNFLAG                                                  02045000
@NM00095 EQU   RRNFLAG                                                  02046000
RRNVFYLM EQU   RRNFLAG                                                  02047000
RRNNTAIL EQU   RRNFLAG                                                  02048000
RRNRIMIP EQU   RRNFLAG                                                  02049000
RRNLCDIE EQU   RRNFLAG                                                  02050000
RRNLCSIP EQU   RRNFLAG                                                  02051000
RRNPRE   EQU   ISTRRN                                                   02052000
RSWEND   EQU   ISTRSW+152                                               02053000
@NM00094 EQU   ISTRSW+150                                               02054000
RSWCTELU EQU   ISTRSW+148                                               02055000
RSWGRUPZ EQU   ISTRSW+146                                               02056000
RSWDIALZ EQU   ISTRSW+144                                               02057000
RSWGRUPT EQU   ISTRSW+140                                               02058000
RSWDIALT EQU   ISTRSW+136                                               02059000
RSWPRE   EQU   ISTRSW                                                   02060000
RTREND   EQU   ISTRTR+208                                               02061000
RTRCADDR EQU   ISTRTR+200                                               02062000
RTRBHSN1 EQU   ISTRTR+192                                               02063000
RTRIDCAS EQU   RTRBSCID+1                                               02064000
RTRIDLEN EQU   RTRBSCID                                                 02065000
RTRLCTI  EQU   ISTRTR+170                                               02066000
RTRTRMAX EQU   ISTRTR+169                                               02067000
@NM00093 EQU   RTRBITAN+4                                               02068000
@NM00092 EQU   RTRBITAN+4                                               02069000
@NM00091 EQU   RTRBITAN+4                                               02070000
@NM00090 EQU   RTRBITAN+4                                               02071000
@NM00089 EQU   RTRBITAN+4                                               02072000
@NM00088 EQU   RTRBITAN+4                                               02073000
@NM00087 EQU   RTRBITAN+4                                               02074000
@NM00086 EQU   RTRBITAN+4                                               02075000
@NM00085 EQU   RTRBITAN+3                                               02076000
RTRDTRLM EQU   RTRBITAN+3                                               02077000
RTRRAATN EQU   RTRBITAN+3                                               02078000
RTRLSCMD EQU   RTRBITAN+3                                               02079000
RTRRFDEK EQU   RTRBITAN+3                                               02080000
RTRRFANK EQU   RTRBITAN+3                                               02081000
RTRRFPFK EQU   RTRBITAN+3                                               02082000
RTRRFPEN EQU   RTRBITAN+3                                               02083000
RTRRFXCT EQU   RTRBITAN+2                                               02084000
RTRRESCT EQU   RTRBITAN+2                                               02085000
RTRRESUP EQU   RTRBITAN+2                                               02086000
RTRREATT EQU   RTRBITAN+2                                               02087000
RTRRECHK EQU   RTRBITAN+2                                               02088000
RTRREACR EQU   RTRBITAN+2                                               02089000
@NM00084 EQU   RTRBITAN+2                                               02090000
RTRREBRK EQU   RTRBITAN+2                                               02091000
RTRRDBHI EQU   RTRBITAN+1                                               02092000
RTRRDBHD EQU   RTRBITAN+1                                               02093000
RTRRDBHN EQU   RTRBITAN+1                                               02094000
RTRRCXMS EQU   RTRBITAN+1                                               02095000
RTRRCMSG EQU   RTRBITAN+1                                               02096000
RTRRCBLK EQU   RTRBITAN+1                                               02097000
RTRRCPT3 EQU   RTRBITAN+1                                               02098000
RTRRCIT2 EQU   RTRBITAN+1                                               02099000
RTRRCIT1 EQU   RTRBITAN                                                 02100000
RTRRBEND EQU   RTRBITAN                                                 02101000
RTRRBECT EQU   RTRBITAN                                                 02102000
RTRRACTR EQU   RTRBITAN                                                 02103000
RTRRACDT EQU   RTRBITAN                                                 02104000
RTRRAPT3 EQU   RTRRAALL                                                 02105000
RTRRAPT2 EQU   RTRRAALL                                                 02106000
RTRRAPT1 EQU   RTRRAALL                                                 02107000
RTRCTADR EQU   ISTRTR+162                                               02108000
RTRCTPOL EQU   ISTRTR+160                                               02109000
RTRCTDIA EQU   ISTRTR+158                                               02110000
RTRCTECM EQU   ISTRTR+156                                               02111000
RTRDIAA  EQU   ISTRTR+152                                               02112000
RTRPOLA  EQU   ISTRTR+148                                               02113000
RTRADRPT EQU   RTRADR+1                                                 02114000
@NM00083 EQU   RTRFLAG                                                  02115000
@NM00082 EQU   RTRFLAG                                                  02116000
@NM00081 EQU   RTRFLAG                                                  02117000
@NM00080 EQU   RTRFLAG                                                  02118000
@NM00079 EQU   RTRFLAG                                                  02119000
@NM00078 EQU   RTRFLAG                                                  02120000
@NM00077 EQU   RTRFLAG                                                  02121000
RTRVTERM EQU   RTRFLAG                                                  02122000
RTRCRPR  EQU   ISTRTR                                                   02123000
RAPREND  EQU   ISTRAPRE+144                                             02124000
RAPHPRE  EQU   ISTRAPRE                                                 02125000
RLNEND   EQU   ISTRLN+128                                               02126000
RLNCTPCC EQU   ISTRLN+127                                               02127000
RLNPUBI  EQU   ISTRLN+126                                               02128000
RLNDCUA  EQU   ISTRLN+123                                               02129000
RLNDESTR EQU   RLNCUA+1                                                 02130000
RLNCURTR EQU   RLNCUA                                                   02131000
RLNPAUSE EQU   ISTRLN+119                                               02132000
RLNPOLMT EQU   ISTRLN+118                                               02133000
RLNCTSES EQU   ISTRLN+117                                               02134000
RLNRDSLM EQU   ISTRLN+116                                               02135000
@NM00076 EQU   RLNBITAN+3                                               02136000
@NM00075 EQU   RLNBITAN+3                                               02137000
RLNSWEP  EQU   RLNBITAN+3                                               02138000
RLNSVSKP EQU   RLNLSCMD                                                 02139000
RLNSESLM EQU   RLNLSCMD                                                 02140000
RLNNPRLM EQU   RLNLSCMD                                                 02141000
RLNSWNCP EQU   RLNBITAN+3                                               02142000
RLNACTLN EQU   RLNBITAN+2                                               02143000
@NM00074 EQU   RLNBITAN+2                                               02144000
@NM00073 EQU   RLNBITAN+2                                               02145000
@NM00072 EQU   RLNBITAN+2                                               02146000
@NM00071 EQU   RLNBITAN+2                                               02147000
@NM00070 EQU   RLNBITAN+2                                               02148000
@NM00069 EQU   RLNBITAN+2                                               02149000
@NM00068 EQU   RLNBITAN+2                                               02150000
@NM00067 EQU   RLNBITAN+1                                               02151000
RLNWANSW EQU   RLNBITAN+1                                               02152000
RLNINUSE EQU   RLNBITAN+1                                               02153000
RLNMULTP EQU   RLNBITAN+1                                               02154000
RLNIDV   EQU   RLNBITAN+1                                               02155000
RLNTTV   EQU   RLNBITAN+1                                               02156000
RLNAUTOD EQU   RLNBITAN+1                                               02157000
RLNRBUSE EQU   RLNBITAN+1                                               02158000
RLNRAPEP EQU   RLNBITAN                                                 02159000
RLNRANCP EQU   RLNBITAN                                                 02160000
RLNRAEP  EQU   RLNBITAN                                                 02161000
RLNRAPOL EQU   RLNBITAN                                                 02162000
RLNRATRN EQU   RLNBITAN                                                 02163000
RLNGANSW EQU   RLNBITAN                                                 02164000
RLNRACAN EQU   RLNRACNT                                                 02165000
RLNRACAT EQU   RLNRACNT                                                 02166000
@NM00066 EQU   ISTRLN+111                                               02167000
RLNMAXLA EQU   ISTRLN+110                                               02168000
RLNDESAM EQU   ISTRLN+109                                               02169000
RLNCURAM EQU   ISTRLN+108                                               02170000
RLNACTSN EQU   RLNCSLRC+2                                               02171000
RLNACTRM EQU   RLNCSLRC+1                                               02172000
RLNLRC   EQU   RLNCSLRC                                                 02173000
RLNAUTOA EQU   ISTRLN+102                                               02174000
RLNACTCT EQU   ISTRLN+100                                               02175000
RLNCTECM EQU   ISTRLN+98                                                02176000
RLNCTEIN EQU   ISTRLN+96                                                02177000
RLNCTETR EQU   ISTRLN+94                                                02178000
RLNCTECL EQU   ISTRLN+92                                                02179000
RLNENTAD EQU   ISTRLN+88                                                02180000
RLNLUBA  EQU   RLNUCBAD+1                                               02181000
RLNCHQI  EQU   RLNUCBAD                                                 02182000
@NM00065 EQU   RLNFLAG                                                  02183000
@NM00064 EQU   RLNFLAG                                                  02184000
@NM00063 EQU   RLNFLAG                                                  02185000
@NM00062 EQU   RLNFLAG                                                  02186000
RLNACLNK EQU   RLNFLAG                                                  02187000
RLNBKDUP EQU   RLNFLAG                                                  02188000
RLNBCKUP EQU   RLNFLAG                                                  02189000
RLNCDLNK EQU   RLNFLAG                                                  02190000
RLNPRE   EQU   ISTRLN                                                   02191000
RDTEND   EQU   ISTRDT+136                                               02192000
RDTVSRPL EQU   RDTCRIA+16                                               02193000
RDTCRSPW EQU   RDTCRIA+8                                                02194000
RDTCRSDS EQU   RDTCRIA                                                  02195000
@NM00061 EQU   ISTRDT+114                                               02196000
@NM00060 EQU   RDTBITAN                                                 02197000
@NM00059 EQU   RDTBITAN                                                 02198000
@NM00058 EQU   RDTBITAN                                                 02199000
@NM00057 EQU   RDTBITAN                                                 02200000
RDTHCDRM EQU   RDTBITAN                                                 02201000
RDTBHSET EQU   RDTBITAN                                                 02202000
RDTCDCTL EQU   RDTBITAN                                                 02203000
RDTCTPGD EQU   RDTBITAN                                                 02204000
RDTLGCT  EQU   ISTRDT+112                                               02205000
RDTNODID EQU   ISTRDT+111                                               02206000
RDTMAXID EQU   ISTRDT+110                                               02207000
RDTCTSNT EQU   ISTRDT+108                                               02208000
RDTVYRPH EQU   ISTRDT+104                                               02209000
RDTBACK  EQU   ISTRDT+100                                               02210000
RDTFORW  EQU   ISTRDT+96                                                02211000
RDTNAMTB EQU   ISTRDT+92                                                02212000
RDTENTAD EQU   ISTRDT+88                                                02213000
RDTLEN   EQU   RDTPLEN+1                                                02214000
@NM00056 EQU   RDTPRIOR                                                 02215000
RDTPRILS EQU   RDTPRIOR                                                 02216000
RDTPRISW EQU   RDTPRIOR                                                 02217000
RDTPRIRN EQU   RDTPRIOR                                                 02218000
RDTPRILC EQU   RDTPRIOR                                                 02219000
RDTPRIAP EQU   RDTPRIOR                                                 02220000
RDTCDRSC EQU   RDTPRIOR                                                 02221000
RDTCDRM  EQU   RDTPRIOR                                                 02222000
RDTPRE   EQU   ISTRDT                                                   02223000
RAPEND   EQU   ISTRAP+184                                               02224000
RAPAPPWD EQU   ISTRAP+176                                               02225000
RAPACBN  EQU   ISTRAP+168                                               02226000
@NM00055 EQU   RAPBITAN+2                                               02227000
@NM00054 EQU   RAPBITAN+2                                               02228000
@NM00053 EQU   RAPBITAN+2                                               02229000
@NM00052 EQU   RAPBITAN+2                                               02230000
@NM00051 EQU   RAPBITAN+2                                               02231000
@NM00050 EQU   RAPBITAN+2                                               02232000
@NM00049 EQU   RAPBITAN+2                                               02233000
RAPCSMA  EQU   RAPBITAN+2                                               02234000
RAPTSO   EQU   RAPBITAN+1                                               02235000
RAPAUTHE EQU   RAPBITAN+1                                               02236000
RAPANVPC EQU   RAPBITAN+1                                               02237000
RAPASPO  EQU   RAPBITAN+1                                               02238000
RAPAPPO  EQU   RAPBITAN+1                                               02239000
RAPAACQ  EQU   RAPBITAN+1                                               02240000
RAPAPRMT EQU   RAPBITAN+1                                               02241000
RAPAPASS EQU   RAPBITAN+1                                               02242000
RAPABLCK EQU   RAPBITAN                                                 02243000
RAPALLF  EQU   RAPBITAN                                                 02244000
RAPPARS  EQU   RAPBITAN                                                 02245000
RAPLSIZ  EQU   RAPBITAN                                                 02246000
RAPATLGN EQU   RAPBITAN                                                 02247000
RAPASLGI EQU   RAPBITAN                                                 02248000
RAPAQUI  EQU   RAPBITAN                                                 02249000
RAPABLGN EQU   RAPBITAN                                                 02250000
RAPBFACT EQU   ISTRAP+164                                               02251000
RAPBNA   EQU   ISTRAP+162                                               02252000
RAPEAS   EQU   ISTRAP+160                                               02253000
RAPACDEB EQU   ISTRAP+156                                               02254000
RAPACBA  EQU   ISTRAP+152                                               02255000
RAPENTAD EQU   ISTRAP+148                                               02256000
@NM00048 EQU   ISTRAP+146                                               02257000
RAPTRPRE EQU   ISTRAP+144                                               02258000
RAPPRE   EQU   ISTRAP                                                   02259000
RCPEND   EQU   ISTRCPRE+144                                             02260000
RCPLGMOD EQU   ISTRCPRE+136                                             02261000
RCPDLGMD EQU   ISTRCPRE+128                                             02262000
RCPLGNAP EQU   ISTRCPRE+120                                             02263000
RCPQCNT  EQU   ISTRCPRE+118                                             02264000
@NM00047 EQU   ISTRCPRE+117                                             02265000
@NM00046 EQU   RCPBITAN                                                 02266000
@NM00045 EQU   RCPBITAN                                                 02267000
RCPCSM   EQU   RCPBITAN                                                 02268000
RCPALLOC EQU   RCPBITAN                                                 02269000
RCPSEC   EQU   RCPBITAN                                                 02270000
RCPSESSC EQU   RCPSESSM                                                 02271000
RCPSESPR EQU   RCPSESSM                                                 02272000
RCPSSCFM EQU   ISTRCPRE+114                                             02273000
RCPSTCAP EQU   RCPCYSET                                                 02274000
RCPSTRQD EQU   RCPCYSET                                                 02275000
RCPMDCAP EQU   RCPCYMOD                                                 02276000
RCPMDRQD EQU   RCPCYMOD                                                 02277000
RCPPRIM  EQU   RCPPMODE                                                 02278000
RCPCROSS EQU   RCPPMODE                                                 02279000
RCPRRECD EQU   RCPPMODE                                                 02280000
RCPRBASC EQU   RCPPMODE                                                 02281000
RCPBFLIM EQU   ISTRCPRE+112                                             02282000
RCPNCPPM EQU   RCPNCPPC+1                                               02283000
RCPNCPPN EQU   RCPNCPPC                                                 02284000
RCPPACEM EQU   RCPPACE+1                                                02285000
RCPPACEN EQU   RCPPACE                                                  02286000
RCPBHSI2 EQU   ISTRCPRE+107                                             02287000
RCPBHSI1 EQU   ISTRCPRE+106                                             02288000
RCPSESLM EQU   ISTRCPRE+104                                             02289000
RCPSESCT EQU   ISTRCPRE+102                                             02290000
RCPINTTI EQU   ISTRCPRE+100                                             02291000
RCPUSSTI EQU   ISTRCPRE+98                                              02292000
RCPMODTI EQU   ISTRCPRE+96                                              02293000
RCPLNAPA EQU   ISTRCPRE+92                                              02294000
RCPSIBS  EQU   RCPSARRY+4                                               02295000
RCPSIBP  EQU   RCPSARRY                                                 02296000
RCPPRE   EQU   ISTRCPRE                                                 02297000
RPREND   EQU   ISTRPRE+84                                               02298000
RPRDEVCH EQU   ISTRPRE+76                                               02299000
RPRCONID EQU   ISTRPRE+67                                               02300000
@NM00044 EQU   ISTRPRE+66                                               02301000
@NM00043 EQU   RPRBITAN+4                                               02302000
@NM00042 EQU   RPRBITAN+4                                               02303000
@NM00041 EQU   RPRBITAN+4                                               02304000
@NM00040 EQU   RPRBITAN+4                                               02305000
@NM00039 EQU   RPRBITAN+4                                               02306000
RPRNEO   EQU   RPRBITAN+4                                               02307000
RPRRNAA  EQU   RPRBITAN+4                                               02308000
RPRDRADD EQU   RPRBITAN+4                                               02309000
RPRFADD  EQU   RPRBITAN+3                                               02310000
RPRINTST EQU   RPRBITAN+3                                               02311000
RPRCLVPD EQU   RPRBITAN+3                                               02312000
RPRSNASS EQU   RPRBITAN+3                                               02313000
RPRGIST  EQU   RPRBITAN+3                                               02314000
RPRRBISA EQU   RPRBITAN+3                                               02315000
RPRENTVT EQU   RPRBITAN+3                                               02316000
RPRDINOP EQU   RPRBITAN+3                                               02317000
RPRDINUS EQU   RPRBITAN+2                                               02318000
RPRCRCPT EQU   RPRBITAN+2                                               02319000
RPRNOSRT EQU   RPRBITAN+2                                               02320000
RPRDOM   EQU   RPRBITAN+2                                               02321000
RPRNOUSE EQU   RPRBITAN+2                                               02322000
RPRNOSNA EQU   RPRBITAN+2                                               02323000
RPRCLNUP EQU   RPRBITAN+2                                               02324000
RPRCONLD EQU   RPRBITAN+2                                               02325000
RPRCONP  EQU   RPRBITAN+1                                               02326000
RPRACTP  EQU   RPRBITAN+1                                               02327000
RPRRSON  EQU   RPRBITAN+1                                               02328000
RPRCONCT EQU   RPRBITAN+1                                               02329000
RPRHLVPD EQU   RPRBITAN+1                                               02330000
RPRHLACT EQU   RPRBITAN+1                                               02331000
RPRONLIN EQU   RPRBITAN+1                                               02332000
RPRSMLU  EQU   RPRBITAN+1                                               02333000
RPRAOPN  EQU   RPRBITAN                                                 02334000
RPRENTVH EQU   RPRBITAN                                                 02335000
RPRLIVE  EQU   RPRBITAN                                                 02336000
RPRENTED EQU   RPRBITAN                                                 02337000
RPRLTASN EQU   RPRBITAN                                                 02338000
RPRENTIO EQU   RPRBITAN                                                 02339000
RPRENTBF EQU   RPRBITAN                                                 02340000
RPRINV   EQU   RPRBITAN                                                 02341000
RPRDEFLV EQU   RPRSTATE+4                                               02342000
RPRDESS1 EQU   RPRDESST                                                 02343000
RPRCURS1 EQU   RPRCURST                                                 02344000
RPRCMDWE EQU   ISTRPRE+52                                               02345000
RPRTNTQP EQU   ISTRPRE+48                                               02346000
RPRPELEN EQU   ISTRPRE+36                                               02347000
RPRELEN  EQU   ISTRPRE+32                                               02348000
RPRALPAD EQU   ISTRPRE+28                                               02349000
RPRENTAD EQU   ISTRPRE+24                                               02350000
RPRREQCT EQU   ISTRPRE+23                                               02351000
RPRPTHCT EQU   ISTRPRE+22                                               02352000
RPRINDEX EQU   ISTRPRE+20                                               02353000
RPRDAF   EQU   RPRDAFID+2                                               02354000
@NM00038 EQU   RPRDAFID                                                 02355000
@NM00037 EQU   ISTRPRE+15                                               02356000
RPRHDTYP EQU   ISTRPRE+14                                               02357000
RPRENTRY EQU   ISTRPRE+13                                               02358000
RPRNAME  EQU   RPRSRTHD                                                 02359000
LOKXCL   EQU   @NM00035                                                 02360000
LOKPRY   EQU   @NM00035                                                 02361000
@NM00036 EQU   @NM00035                                                 02362000
@NM00034 EQU   LOKCHNG                                                  02363000
LOKCT    EQU   ISTLOK                                                   02364000
DEVRSV01 EQU   ISTDEVCH+7                                               02365000
DEVAUXTP EQU   ISTDEVCH+6                                               02366000
DEVADVFE EQU   DEVMODE                                                  02367000
@NM00033 EQU   DEVMODE                                                  02368000
DEVBASIC EQU   DEVMODE                                                  02369000
DEVREC   EQU   DEVMODE                                                  02370000
DEVPHYSA EQU   ISTDEVCH+4                                               02371000
DEVCSLPN EQU   DEVCHAR3                                                 02372000
DEVCSTCL EQU   DEVCHAR3                                                 02373000
DEVCCHEK EQU   DEVCHAR3                                                 02374000
DEVCATTN EQU   DEVCHAR3                                                 02375000
DEVCSWL  EQU   DEVFCCTL                                                 02376000
DEVCRVB  EQU   DEVFCCTL                                                 02377000
DEVCSSL  EQU   DEVFCCTL                                                 02378000
DEVCBSC  EQU   DEVFCCTL                                                 02379000
DEVMCODE EQU   ISTDEVCH+2                                               02380000
DEVCHAR2 EQU   DEVTCODE                                                 02381000
DEVSPOLL EQU   DEVCHAR                                                  02382000
DEVCCTL  EQU   DEVCHAR                                                  02383000
DEVNNSPT EQU   DEVCHAR                                                  02384000
DEVSPS   EQU   DEVCHAR                                                  02385000
DEVSUBND EQU   DEVCHAR                                                  02386000
DEVCONVR EQU   DEVCHAR                                                  02387000
DEVOTPUT EQU   DEVCHAR                                                  02388000
DEVINPUT EQU   DEVCHAR                                                  02389000
SRTTYPE  EQU   ISTSRT+12                                                02390000
SRTSPECE EQU   SRTSRTE                                                  02391000
SRTSYMNM EQU   ISTSRT                                                   02392000
NCSRUITS EQU   NCSUSSRU+2                                               02393000
NCSRULEN EQU   NCSUSSRU                                                 02394000
NCSAPPAB EQU   NCSAPP+608                                               02395000
NCSAPDAT EQU   NCSAPBUE+8                                               02396000
NCSAPRU  EQU   NCSAPBUE+3                                               02397000
NCSAPLEN EQU   NCSAPBUE+1                                               02398000
NCSRSV04 EQU   NCSAPBUE                                                 02399000
NCSAPEND EQU   NCSAPP+84                                                02400000
NCSAPTXT EQU   NCSAPP+76                                                02401000
NCSAPECB EQU   NCSAPP+72                                                02402000
NCSAPSA  EQU   NCSAPP                                                   02403000
NCSITSIZ EQU   NCSPLITF+2                                               02404000
@NM00027 EQU   NCSITFL1                                                 02405000
NCSITSCP EQU   NCSITFL1                                                 02406000
NCSITMSG EQU   NCSITFL1                                                 02407000
NCSITPIU EQU   NCSITFL1                                                 02408000
NCSITSMS EQU   NCSITFL1                                                 02409000
NCSITPSS EQU   NCSITFL1                                                 02410000
NCSITLCK EQU   NCSITFL1                                                 02411000
NCSITAPI EQU   NCSITFL1                                                 02412000
NCSDRDS  EQU   ISTNCSPL+299                                             02413000
NCSRSVD2 EQU   NCSCRMOD                                                 02414000
NCSPTMOD EQU   NCSCRMOD                                                 02415000
NCSAIMOD EQU   NCSCRMOD                                                 02416000
NCSRSVD1 EQU   NCSCHKPT+1                                               02417000
NCSCKCRY EQU   NCSCHKPT+1                                               02418000
NCSCKRIN EQU   NCSCHKPT+1                                               02419000
NCSPTUSE EQU   NCSCHKPT+1                                               02420000
NCSRNME  EQU   NCSCHKPT+1                                               02421000
NCSCUA   EQU   NCSCHKPT+1                                               02422000
NCSANSMD EQU   NCSCHKPT+1                                               02423000
NCSLGMOD EQU   NCSCHKPT                                                 02424000
NCSLGAPL EQU   NCSCHKPT                                                 02425000
NCSDTRLM EQU   NCSCHKPT                                                 02426000
NCSESLM  EQU   NCSCHKPT                                                 02427000
NCSNRPL  EQU   NCSCHKPT                                                 02428000
NCSPOLD  EQU   NCSCHKPT                                                 02429000
NCSPACTV EQU   NCSCHKPT                                                 02430000
NCSACTV  EQU   NCSCHKPT                                                 02431000
NCSCRDTE EQU   ISTNCSPL+292                                             02432000
NCSPLRTY EQU   ISTNCSPL+291                                             02433000
NCSPLRH  EQU   ISTNCSPL+288                                             02434000
NCSUFMCB EQU   ISTNCSPL+284                                             02435000
NCSMGLPT EQU   NCSPLREP+4                                               02436000
NCSCPWPT EQU   NCSPLREP                                                 02437000
NCSSENS2 EQU   NCSSENSE+2                                               02438000
NCSSNS2  EQU   NCSSENSE+1                                               02439000
NCSSNS1  EQU   NCSSENSE                                                 02440000
NCSPLNSN EQU   ISTNCSPL+268                                             02441000
NCSPLMID EQU   ISTNCSPL+260                                             02442000
NCSPLPID EQU   ISTNCSPL+259                                             02443000
NCSPLGID EQU   ISTNCSPL+258                                             02444000
NCSPLSQN EQU   ISTNCSPL+256                                             02445000
NCSCDRMO EQU   NCSRNAME                                                 02446000
NCSPLRUI EQU   ISTNCSPL+240                                             02447000
NCSPLRUO EQU   ISTNCSPL+236                                             02448000
NCSPLRRP EQU   ISTNCSPL+232                                             02449000
NCSCRWKA EQU   ISTNCSPL+228                                             02450000
NCSPLSPL EQU   ISTNCSPL+224                                             02451000
NCSPLP3  EQU   ISTNCSPL+220                                             02452000
NCSPLP2  EQU   ISTNCSPL+216                                             02453000
NCSPLP1  EQU   ISTNCSPL+212                                             02454000
NCSPLOLN EQU   ISTNCSPL+210                                             02455000
NCSPLHIS EQU   NCSPLFL5                                                 02456000
NCSCDLRA EQU   NCSPLFL5                                                 02457000
NCSINACT EQU   NCSPLFL5                                                 02458000
NCSERP2N EQU   NCSPLFL5                                                 02459000
NCSSKPSC EQU   NCSPLFL5                                                 02460000
NCSFORCE EQU   NCSPLFL5                                                 02461000
NCSSDLK  EQU   NCSPLFL5                                                 02462000
NCSSCPPS EQU   NCSPLFL5                                                 02463000
NCSDLRSN EQU   ISTNCSPL+208                                             02464000
NCSPL2AP EQU   NCSPLFL4                                                 02465000
NCSDSPN  EQU   NCSPLFL4                                                 02466000
NCSDSPI  EQU   NCSPLFL4                                                 02467000
NCSDSPA  EQU   NCSPLFL4                                                 02468000
NCSDSPE  EQU   NCSPLFL4                                                 02469000
NCSPLVID EQU   NCSPLFL4                                                 02470000
NCSPLRSO EQU   NCSPLFL4                                                 02471000
NCSDLNID EQU   NCSPLFL4                                                 02472000
NCSEND   EQU   NCSPLFL3                                                 02473000
NCSFINAL EQU   NCSPLFL3                                                 02474000
NCSANS   EQU   NCSPLFL3                                                 02475000
NCSPID   EQU   NCSPLFL3                                                 02476000
NCSGID   EQU   NCSPLFL3                                                 02477000
NCSPLANS EQU   NCSPLFL3                                                 02478000
NCSEPP   EQU   NCSPLFL3                                                 02479000
NCSPLMOM EQU   NCSPLFL3                                                 02480000
NCSPLVIT EQU   NCSPLFL2                                                 02481000
NCSPLVIS EQU   NCSPLFL2                                                 02482000
NCSREMPO EQU   NCSPLFL2                                                 02483000
NCSPLDS  EQU   NCSPLFL2                                                 02484000
NCSOUFMC EQU   NCSPLFL2                                                 02485000
NCSPLRIO EQU   NCSPLFL2                                                 02486000
NCSPLRSF EQU   NCSPLFL2                                                 02487000
NCSPLVDP EQU   NCSPLFL2                                                 02488000
NCSPLPOS EQU   NCSPLFL1                                                 02489000
NCSPL2CN EQU   NCSPLFL1                                                 02490000
NCSPLAPU EQU   NCSPLFL1                                                 02491000
NCSMSG   EQU   NCSPLFL1                                                 02492000
NCSPLSMN EQU   NCSPLFL1                                                 02493000
NCSPLEBN EQU   NCSPLFL1                                                 02494000
NCSPLSOM EQU   NCSPLFL1                                                 02495000
NCSPL2IN EQU   NCSPLFL1                                                 02496000
NCSPLRCR EQU   ISTNCSPL+200                                             02497000
NCSPLECB EQU   ISTNCSPL+192                                             02498000
NCSPLCVT EQU   ISTNCSPL+184                                             02499000
NCSPLWKA EQU   ISTNCSPL+180                                             02500000
NCSPLDAF EQU   NCSPLCID+2                                               02501000
NCSPLSAF EQU   NCSPLCID                                                 02502000
NCSPLRAD EQU   ISTNCSPL+172                                             02503000
NCSPLWRF EQU   ISTNCSPL+100                                             02504000
NCSPLWRE EQU   ISTNCSPL+96                                              02505000
NCSSTCMD EQU   NCSCRFLG                                                 02506000
NCSUSRNF EQU   NCSCRFLG                                                 02507000
NCSOPRQU EQU   NCSCRFLG                                                 02508000
NCSCRDSE EQU   NCSCRFLG                                                 02509000
NCSFMERP EQU   NCSCRFLG                                                 02510000
NCSFMCLD EQU   NCSCRFLG                                                 02511000
NCSPLCLD EQU   NCSCRFLG                                                 02512000
NCSPLWRM EQU   NCSCRFLG                                                 02513000
NCSPLUAD EQU   ISTNCSPL+92                                              02514000
NCSMSGSP EQU   ISTNCSPL+91                                              02515000
@NM00026 EQU   NCSITFL2                                                 02516000
NCSITEND EQU   NCSITFL2                                                 02517000
NCSITEXT EQU   NCSITFL2                                                 02518000
NCSITINT EQU   NCSITFL2                                                 02519000
NCSCMDB  EQU   NCSPLCMD+1                                               02520000
@NM00025 EQU   NCSCMDA                                                  02521000
NCSPLINT EQU   NCSCMDA                                                  02522000
NCSPLUFM EQU   NCSCMDA                                                  02523000
NCSPLFLO EQU   NCSCMDA                                                  02524000
NCSPLSYN EQU   NCSCMDA                                                  02525000
NCSPLCTL EQU   NCSCMDA                                                  02526000
NCSPLSYS EQU   NCSCMDA                                                  02527000
NCSPLLPT EQU   ISTNCSPL+84                                              02528000
@NM00024 EQU   ISTNCSPL+77                                              02529000
NCSCRPID EQU   ISTNCSPL+76                                              02530000
NCSCRCMD EQU   ISTNCSPL+75                                              02531000
NCSDLID  EQU   ISTNCSPL+69                                              02532000
NCSDEST  EQU   NCSCDRMN+4                                               02533000
NCSADJ   EQU   NCSCDRMN                                                 02534000
NCSPLRID EQU   ISTNCSPL+53                                              02535000
NCSRRNPT EQU   ISTNCSPL+49                                              02536000
NCSDRFLG EQU   ISTNCSPL+48                                              02537000
NCSPRMRC EQU   ISTNCSPL+47                                              02538000
NCSSCOPE EQU   ISTNCSPL+46                                              02539000
NCSPLREL EQU   NCSPLVFL                                                 02540000
NCSDCTCT EQU   NCSPLVFL                                                 02541000
NCSDACLK EQU   NCSPLVFL                                                 02542000
NCSABCON EQU   NCSPLVFL                                                 02543000
NCSDCONT EQU   NCSPLVFL                                                 02544000
NCSPLACQ EQU   NCSPLVFL                                                 02545000
NCSVDEL  EQU   NCSPLVFL                                                 02546000
NCSVNCSA EQU   NCSPLVFL                                                 02547000
@NM00023 EQU   NCSCRRTN                                                 02548000
NCSMDRQD EQU   NCSCRRTN                                                 02549000
NCSPLPDB EQU   NCSPLSID+5                                               02550000
NCSPLNID EQU   NCSPLPHD                                                 02551000
NCSPLPO  EQU   NCSPLSTA                                                 02552000
NCSRSVD4 EQU   NCSPLSTA                                                 02553000
@NM00022 EQU   NCSPFX+33                                                02554000
@NM00021 EQU   NCSPFX+24                                                02555000
@NM00020 EQU   NCSPFX+20                                                02556000
NCSVBF16 EQU   NCSPLVBF+1                                               02557000
NCSVBF15 EQU   NCSPLVBF+1                                               02558000
NCSVBF14 EQU   NCSPLVBF+1                                               02559000
NCSVBF13 EQU   NCSPLVBF+1                                               02560000
NCSVBF12 EQU   NCSPLVBF+1                                               02561000
NCSVBF11 EQU   NCSPLVBF+1                                               02562000
NCSVBF10 EQU   NCSPLVBF+1                                               02563000
NCSVBF09 EQU   NCSPLVBF+1                                               02564000
NCSVBF08 EQU   NCSPLVBF                                                 02565000
NCSVBF07 EQU   NCSPLVBF                                                 02566000
NCSVBF06 EQU   NCSPLVBF                                                 02567000
NCSVBF05 EQU   NCSPLVBF                                                 02568000
NCSVBF04 EQU   NCSPLVBF                                                 02569000
NCSVBF03 EQU   NCSPLVBF                                                 02570000
NCSVBF02 EQU   NCSPLVBF                                                 02571000
NCSVBF01 EQU   NCSPLVBF                                                 02572000
NCSPLVCD EQU   NCSVERB                                                  02573000
@NM00019 EQU   @NM00018                                                 02574000
NCSPLRPH EQU   NCSPFX+12                                                02575000
NCSWLPTR EQU   NCSPLWEL+1                                               02576000
@NM00017 EQU   NCSPLWEL                                                 02577000
@NM00016 EQU   NCSPFX+4                                                 02578000
NCSIORC  EQU   NCSPFX+3                                                 02579000
@NM00015 EQU   NCSFLAGS                                                 02580000
@NM00014 EQU   NCSFLAGS                                                 02581000
@NM00013 EQU   NCSFLAGS                                                 02582000
@NM00012 EQU   NCSFLAGS                                                 02583000
NCSPLNON EQU   NCSFLAGS                                                 02584000
NCSPRIV  EQU   NCSFLAGS                                                 02585000
NCSPLREQ EQU   NCSFLAGS                                                 02586000
NCSVSTAT EQU   NCSFLAGS                                                 02587000
@NM00011 EQU   NCSPFX+1                                                 02588000
NCSCBID  EQU   NCSPFX                                                   02589000
CPCBCON  EQU   ISTCPCB+35                                               02590000
CPCBR00  EQU   ISTCPCB+34                                               02591000
CPCBMNR  EQU   ISTCPCB+33                                               02592000
CPCBURC  EQU   ISTCPCB+24                                               02593000
CPCBUSR  EQU   ISTCPCB+20                                               02594000
CPCBFMH  EQU   CPCBOPC+1                                                02595000
CPCBCAT  EQU   CPCBOPC                                                  02596000
CPCB13   EQU   CPCBPH                                                   02597000
CPCBFA   EQU   @NM00010                                                 02598000
CPCBQP   EQU   ISTCPCB+4                                                02599000
CPCBRC   EQU   ISTCPCB+3                                                02600000
CPCBNW   EQU   CPCBFL                                                   02601000
CPCBXC   EQU   CPCBFL                                                   02602000
CPCBDX   EQU   CPCBFL                                                   02603000
CPCBIB   EQU   CPCBFL                                                   02604000
CPCBXN   EQU   CPCBFL                                                   02605000
CPCBPV   EQU   CPCBFL                                                   02606000
CPCBRS   EQU   CPCBFL                                                   02607000
CPCBST   EQU   CPCBFL                                                   02608000
CPCBLN   EQU   ISTCPCB+1                                                02609000
CPCBID   EQU   ISTCPCB                                                  02610000
POHID    EQU   ISTPOHD+2                                                02611000
POHGEN   EQU   POHSTAT                                                  02612000
POHRREQ  EQU   POHSTAT                                                  02613000
POHRSVD2 EQU   POHSTAT                                                  02614000
POHCNTRL EQU   POHSTAT                                                  02615000
POHLBL   EQU   POHSTAT                                                  02616000
POHDATA  EQU   POHSTAT                                                  02617000
POHEND   EQU   POHSTAT                                                  02618000
POHRSVD1 EQU   ISTPOHD                                                  02619000
IOBERRCT EQU   IOBSTDRD+30                                              02620000
IOBRSV19 EQU   IOBINCAM+1                                               02621000
IOBOLTST EQU   IOBBTAMF                                                 02622000
IOBRFTMG EQU   IOBBTAMF                                                 02623000
IOBRSV17 EQU   IOBBTAMF                                                 02624000
IOBRSV16 EQU   IOBBTAMF                                                 02625000
IOBRSV15 EQU   IOBBTAMF                                                 02626000
IOBRSV14 EQU   IOBBTAMF                                                 02627000
IOBINUSE EQU   IOBBTAMF                                                 02628000
IOBPRMER EQU   IOBBTAMF                                                 02629000
IOBRSTRB EQU   IOBRESTR+1                                               02630000
IOBREPOS EQU   IOBRESTR                                                 02631000
IOBDCBPB EQU   IOBDCBPT+1                                               02632000
IOBRSV44 EQU   IOBFLAG4                                                 02633000
IOBJES3I EQU   IOBFLAG4                                                 02634000
IOBRSV42 EQU   IOBFLAG4                                                 02635000
IOBRSV41 EQU   IOBFLAG4                                                 02636000
IOBRSV40 EQU   IOBFLAG4                                                 02637000
IOBPMERR EQU   IOBFLAG4                                                 02638000
IOBCC3WE EQU   IOBFLAG4                                                 02639000
IOBGDPOL EQU   IOBFLAG4                                                 02640000
IOBSTRTB EQU   IOBSTART+1                                               02641000
IOBSIOCC EQU   IOBSTART                                                 02642000
IOBCSB7  EQU   IOBCSTAT                                                 02643000
IOBCSB6  EQU   IOBCSTAT                                                 02644000
IOBCSB5  EQU   IOBCSTAT                                                 02645000
IOBCSB4  EQU   IOBCSTAT                                                 02646000
IOBCSB3  EQU   IOBCSTAT                                                 02647000
IOBCSB2  EQU   IOBCSTAT                                                 02648000
IOBCSB1  EQU   IOBCSTAT                                                 02649000
IOBCSB0  EQU   IOBCSTAT                                                 02650000
IOBUSB7  EQU   IOBUSTAT                                                 02651000
IOBUSB6  EQU   IOBUSTAT                                                 02652000
IOBUSB5  EQU   IOBUSTAT                                                 02653000
IOBUSB4  EQU   IOBUSTAT                                                 02654000
IOBUSB3  EQU   IOBUSTAT                                                 02655000
IOBUSB2  EQU   IOBUSTAT                                                 02656000
IOBUSB1  EQU   IOBUSTAT                                                 02657000
IOBUSB0  EQU   IOBUSTAT                                                 02658000
IOBCMDA  EQU   IOBIOCSW                                                 02659000
IOBLOG   EQU   IOBFL3                                                   02660000
IOBJAM   EQU   IOBICL                                                   02661000
IOBMSG   EQU   IOBFL3                                                   02662000
IOBSDR   EQU   IOBCNC                                                   02663000
IOBACU   EQU   IOBFL3                                                   02664000
IOBCDC   EQU   IOBFL3                                                   02665000
IOBICC   EQU   IOBFL3                                                   02666000
IOBCCC   EQU   IOBFL3                                                   02667000
IOBECBPB EQU   IOBECBPT+1                                               02668000
IOBECBCC EQU   IOBECBPT                                                 02669000
IOBS1B7  EQU   IOBSENS1                                                 02670000
IOBS1B6  EQU   IOBSENS1                                                 02671000
IOBS1B5  EQU   IOBSENS1                                                 02672000
IOBS1B4  EQU   IOBSENS1                                                 02673000
IOBS1B3  EQU   IOBSENS1                                                 02674000
IOBS1B2  EQU   IOBSENS1                                                 02675000
IOBS1B1  EQU   IOBSENS1                                                 02676000
IOBS1B0  EQU   IOBSENS1                                                 02677000
IOBSNSC9 EQU   IOBS0B7                                                  02678000
IOBS0B6  EQU   IOBSENS0                                                 02679000
IOBS0B5  EQU   IOBSENS0                                                 02680000
IOBS0B4  EQU   IOBSENS0                                                 02681000
IOBS0B3  EQU   IOBSENS0                                                 02682000
IOBS0B2  EQU   IOBSENS0                                                 02683000
IOBS0B1  EQU   IOBSENS0                                                 02684000
IOBS0B0  EQU   IOBSENS0                                                 02685000
IOBPNCH  EQU   IOBFLAG2                                                 02686000
IOBSTATO EQU   IOBFLAG2                                                 02687000
IOBSKUPD EQU   IOBFLAG2                                                 02688000
IOBALTTR EQU   IOBFLAG2                                                 02689000
IOBRRT2  EQU   IOBRDHA0                                                 02690000
IOBRRT3  EQU   IOBPURGE                                                 02691000
IOBSENSE EQU   IOBFLAG2                                                 02692000
IOBHALT  EQU   IOBFLAG2                                                 02693000
IOBSPSVC EQU   IOBRSTRT                                                 02694000
IOBUNREL EQU   IOBFLAG1                                                 02695000
IOBIOERR EQU   IOBFLAG1                                                 02696000
IOBFCREX EQU   IOBCYCCK                                                 02697000
IOBRPSTN EQU   IOBFLAG1                                                 02698000
IOBERRTN EQU   IOBFLAG1                                                 02699000
IOBCMDCH EQU   IOBFLAG1                                                 02700000
IOBDATCH EQU   IOBFLAG1                                                 02701000
IOBCNOPA EQU   IOBPREFX+12                                              02702000
IOBCICB  EQU   IOBPREFX+8                                               02703000
IOBCECB  EQU   IOBPREFX+4                                               02704000
IOBCONOP EQU   IOBPREFX+3                                               02705000
IOBCINOP EQU   IOBPREFX+2                                               02706000
IOBRSV05 EQU   IOBPREFX+1                                               02707000
IOBPCI   EQU   IOBCFLG1                                                 02708000
IOBRSTCH EQU   IOBCFLG1                                                 02709000
IOBABAPP EQU   IOBCFLG1                                                 02710000
IOBPTST  EQU   IOBCFLG1                                                 02711000
IOBRSV04 EQU   IOBCFLG1                                                 02712000
IOBRSV03 EQU   IOBCFLG1                                                 02713000
IOBRSV02 EQU   IOBCFLG1                                                 02714000
IOBRSV01 EQU   IOBCFLG1                                                 02715000
@NM00009 EQU   SRBSECT+40                                               02716000
@NM00008 EQU   SRBSECT+38                                               02717000
SRBPRIOR EQU   SRBSECT+37                                               02718000
SRBPKF   EQU   SRBSECT+36                                               02719000
SRBSAVE  EQU   SRBSECT+32                                               02720000
SRBPARM  EQU   SRBSECT+28                                               02721000
SRBRMTR  EQU   SRBSECT+24                                               02722000
SRBEP    EQU   SRBSECT+20                                               02723000
SRBPTCB  EQU   SRBFLC+4                                                 02724000
SRBPASID EQU   SRBFLC+2                                                 02725000
SRBCPAFF EQU   SRBFLC                                                   02726000
SRBASCB  EQU   SRBSECT+8                                                02727000
SRBFLNK  EQU   SRBSECT+4                                                02728000
SRBID    EQU   SRBSECT                                                  02729000
IOSEND   EQU   IOSB+108                                                 02730000
IOSSKR   EQU   IOSEEKA+7                                                02731000
IOSSKH2  EQU   IOSSKHH+1                                                02732000
IOSSKH1  EQU   IOSSKHH                                                  02733000
IOSSKCC  EQU   IOSCCHH                                                  02734000
IOSSKBB  EQU   IOSEEKA+1                                                02735000
IOSSKM   EQU   IOSEEKA                                                  02736000
IOSEEK   EQU   IOSB+92                                                  02737000
IOSMDM   EQU   IOSB+91                                                  02738000
IOSMDB   EQU   IOSB+90                                                  02739000
IOSCKEY7 EQU   IOSCKEY                                                  02740000
IOSCKEY6 EQU   IOSCKEY                                                  02741000
IOSCKEY5 EQU   IOSCKEY                                                  02742000
IOSCKEY4 EQU   IOSCKEY                                                  02743000
@NM00004 EQU   IOSCKEY                                                  02744000
IOSFMSK  EQU   IOSB+88                                                  02745000
IOSCUDEV EQU   IOSPATH+1                                                02746000
@NM00003 EQU   IOSCHN                                                   02747000
IOSPATH3 EQU   IOSCHN                                                   02748000
IOSPATH2 EQU   IOSCHN                                                   02749000
IOSEXP   EQU   IOSCHN                                                   02750000
IOSGDP   EQU   IOSCHN                                                   02751000
IOSAFF   EQU   IOSB+85                                                  02752000
IOSRSS1B EQU   IOSB+84                                                  02753000
IOSDSID  EQU   IOSB+80                                                  02754000
IOSVST   EQU   IOSB+76                                                  02755000
IOSRST   EQU   IOSB+72                                                  02756000
IOSDIE   EQU   IOSB+68                                                  02757000
IOSABN   EQU   IOSB+64                                                  02758000
IOSNRM   EQU   IOSB+60                                                  02759000
IOSPCI   EQU   IOSB+56                                                  02760000
IOSERP   EQU   IOSB+52                                                  02761000
IOSPCHN  EQU   IOSB+48                                                  02762000
IOSSNS   EQU   IOSB+42                                                  02763000
IOSAPMSK EQU   IOSB+40                                                  02764000
IOSRES4A EQU   IOSB+36                                                  02765000
IOSUSE   EQU   IOSB+32                                                  02766000
IOSSRB   EQU   IOSB+28                                                  02767000
IOSCSWRC EQU   IOSCSW+5                                                 02768000
IOSTSB   EQU   IOSTATUS+1                                               02769000
IOSTSA   EQU   IOSTATUS                                                 02770000
IOSCSWCA EQU   IOSCSW                                                   02771000
IOSCC    EQU   @NM00002                                                 02772000
IOSUCB   EQU   IOSB+16                                                  02773000
IOSOPT2X EQU   IOSOPT2                                                  02774000
IOSHTP   EQU   IOSOPT2                                                  02775000
IOSRELSE EQU   IOSOPT                                                   02776000
IOSAPR   EQU   IOSOPT                                                   02777000
IOSTSLL  EQU   IOSOPT                                                   02778000
IOSNERP  EQU   IOSOPT                                                   02779000
IOSPSLL  EQU   IOSOPT                                                   02780000
IOSQISCE EQU   IOSOPT                                                   02781000
IOSDEP   EQU   IOSOPT                                                   02782000
IOSBYP   EQU   IOSOPT                                                   02783000
IOSCOD   EQU   IOSB+13                                                  02784000
IOSPKY7  EQU   IOSPKEY                                                  02785000
IOSPGDPX EQU   IOSPKEY                                                  02786000
IOSIDR   EQU   IOSPKEY                                                  02787000
IOSLCL   EQU   IOSPKEY                                                  02788000
@NM00001 EQU   IOSPKEY                                                  02789000
IOSPGAD  EQU   IOSB+8                                                   02790000
IOSASID  EQU   IOSB+6                                                   02791000
IOSPRLVL EQU   IOSB+5                                                   02792000
IOSDVRID EQU   IOSB+4                                                   02793000
IOSPROC  EQU   IOSB+3                                                   02794000
IOSFLC7  EQU   IOSFLC                                                   02795000
IOSFLC6  EQU   IOSFLC                                                   02796000
IOSRWAIT EQU   IOSFLC                                                   02797000
IOSTP    EQU   IOSFLC                                                   02798000
IOSCC3WE EQU   IOSFLC                                                   02799000
IOSVERIF EQU   IOSDVALT                                                 02800000
IOSDVMNT EQU   IOSFLC                                                   02801000
IOSLOG   EQU   IOSFLB                                                   02802000
IOSBDCST EQU   IOSFLB                                                   02803000
IOSMSG   EQU   IOSFLB                                                   02804000
IOSFLB4  EQU   IOSFLB                                                   02805000
IOSFLB3  EQU   IOSFLB                                                   02806000
IOSFLB2  EQU   IOSFLB                                                   02807000
IOSSDR   EQU   IOSFLB                                                   02808000
IOSDIESE EQU   IOSFLB                                                   02809000
IOSIOSB  EQU   IOSFLA                                                   02810000
IOSDOM   EQU   IOSFLA                                                   02811000
IOSEX    EQU   IOSFLA                                                   02812000
IOSSMDB  EQU   IOSFLA                                                   02813000
IOSSMDA  EQU   IOSFLA                                                   02814000
IOSERR   EQU   IOSFLA                                                   02815000
IOSCCHN  EQU   IOSACHN                                                  02816000
IOSDCHN  EQU   IOSACHN                                                  02817000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02818000
@ENDDATA EQU   *                                                        02819000
         END   ISTINCY1,(C'PLS1045',0702,78336)                         02820000
