         TITLE 'ISTIC006,UPDATE CTL && EXHIBIT'                         00001000
ISTIC006 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTIC006  79.129'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @11,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@11                                         0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @12,@SA00001                                        0001 00015000
         ST    @12,8(,@13)                                         0001 00016000
         LR    @13,@12                                             0001 00017000
         EJECT                                                          00018000
         EJECT                                                          00019000
         EJECT                                                          00020000
*                                                                  0076 00021000
*/*  UPDATE CONTROL SECTION                                          */ 00022000
*                                                                  0076 00023000
*I006C01:                                                          0076 00024000
*   $INBUFR(1:80)='';               /* BLANK OUT INPUT BUFFER        */ 00025000
*                                                                  0076 00026000
I006C01  MVI   $INBUFR(WAPTR),C' '                                 0076 00027000
         MVC   $INBUFR+1(79,WAPTR),$INBUFR(WAPTR)                  0076 00028000
*   /*****************************************************************/ 00029000
*   /*                                                               */ 00030000
*   /* TCEC MSGN(560)INCT(8) INVOKED                                 */ 00031000
*   /*                                                               */ 00032000
*   /*****************************************************************/ 00033000
*                                                                  0077 00034000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00035000
         OI    $TCECM(WAPTR),B'00000001'                           0077 00036000
*   R1=ADDR($TCA09);                /* SET UP PARM LIST $TR          */ 00037000
         LA    R1,$TCA09                                           0078 00038000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00039000
         L     @15,#EXITA(,WAPTR)                                  0079 00040000
         BALR  @14,@15                                             0079 00041000
*   DCL                                                            0080 00042000
*     1 $TCA09,                     /* TCEC PARM LIST                */ 00043000
*      2 $TCB09 FIXED(32) INIT(560),/* MSG NUMBER                    */ 00044000
*      2 $TCC09 FIXED(32) INIT(8),  /* INCT LEN                      */ 00045000
*      2 $TCD09 BIT(8) INIT('01000000'B),/* FLAG                     */ 00046000
*      2 $TCE09 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK ENTER     0080 00047000
*                                      FUNCTION ID                   */ 00048000
*   WKREG1=ADDR(FNCTBL);            /* GET PTR TO FUNCTION TBL       */ 00049000
         LA    WKREG1,FNCTBL                                       0081 00050000
*   RESPECIFY                                                      0082 00051000
*     CDSMAP BASED(CDSWKPTR);                                      0082 00052000
*   CDSWKPTR=$LOWADDR;              /* SET UP BASE                   */ 00053000
         L     @15,$LOWADDR(,WAPTR)                                0083 00054000
         ST    @15,CDSWKPTR                                        0083 00055000
*   CDSWKPTR=CDSWKPTR+80;           /* GET CDS WORK AREA OFFSET      */ 00056000
         AH    @15,@CH00181                                        0084 00057000
         ST    @15,CDSWKPTR                                        0084 00058000
*   R1=ADDR(CDSUA);                 /* INITIALIZE BASE FOR XC INST   */ 00059000
         LR    R1,@15                                              0085 00060000
*   GEN;                                                           0086 00061000
*                                                                  0086 00062000
         XC  0(255,R1),0(R1)            /*ZERO OUT CDS WORK AREA     */ 00063000
*/* LOCATE FUNCTION                                                  */ 00064000
*                                                                  0087 00065000
*   IF NONE=$INBUFR(2:LENGTH(NONE)+1) THEN                         0087 00066000
         CLC   NONE(4),$INBUFR+1(WAPTR)                            0087 00067000
         BE    @RT00087                                            0087 00068000
*     GOTO I006CRET;                                               0088 00069000
*   CALLREG=ADDR(CALLTBL);          /* GET PTR TO CALL TABLE         */ 00070000
         LA    CALLREG,CALLTBL                                     0089 00071000
*   DO X=1 TO DIM(FNCTBL);          /* CHECK FOR VALID ENTRY         */ 00072000
         LA    @15,1                                               0090 00073000
         ST    @15,X                                               0090 00074000
@DL00090 DS    0H                                                  0091 00075000
*     IF TBLENTLN=$INBUFR THEN      /* COMPARE LENGTH FIRST          */ 00076000
         CLC   TBLENTLN(1,WKREG1),$INBUFR(WAPTR)                   0091 00077000
         BNE   @RF00091                                            0091 00078000
*       DO;                                                        0092 00079000
*         WKREG1=ADDR(FNCTBL);      /* REINITIALIZE WKREG1           */ 00080000
         LA    WKREG1,FNCTBL                                       0093 00081000
*         I=$INBUFR(1:1);           /* GET INPUT LENGTH              */ 00082000
         MVC   I(1),$INBUFR(WAPTR)                                 0094 00083000
*         DO X=1 TO DIM(FNCTBL);    /* COMPARE ACTUAL ENTRY          */ 00084000
         LA    @15,1                                               0095 00085000
         ST    @15,X                                               0095 00086000
@DL00095 DS    0H                                                  0096 00087000
*           IF TBLENTRY(2:4)=$INBUFR(2:4) THEN                     0096 00088000
         CLC   TBLENTRY+1(3,WKREG1),$INBUFR+1(WAPTR)               0096 00089000
         BE    @RT00096                                            0096 00090000
*             GOTO I006C02;         /* IF FOUND-GET OUT              */ 00091000
*           CALLREG=CALLREG+4;      /* UPDATE CALL REG PTR           */ 00092000
         AH    CALLREG,@CH00045                                    0098 00093000
*           WKREG1=WKREG1+TBLENTLN; /* POINT TO NXT FNCTBL ENTRY     */ 00094000
         SLR   @12,@12                                             0099 00095000
         IC    @12,TBLENTLN(,WKREG1)                               0099 00096000
         ALR   WKREG1,@12                                          0099 00097000
*           WKREG1=WKREG1+1;        /* AND UPDATE THAT PTR BY 1      */ 00098000
         AH    WKREG1,@CH00036                                     0100 00099000
*         END;                                                     0101 00100000
         AH    @15,@CH00036                                        0101 00101000
         ST    @15,X                                               0101 00102000
         CH    @15,@CH00080                                        0101 00103000
         BNH   @DL00095                                            0101 00104000
*         GOTO I006C01A;            /* BR AROUND                     */ 00105000
         B     I006C01A                                            0102 00106000
*       END;                                                       0103 00107000
*     WKREG1=WKREG1+TBLENTLN;       /* POINT TO NXT FUNCT TBL ENT    */ 00108000
@RF00091 SLR   @15,@15                                             0104 00109000
         IC    @15,TBLENTLN(,WKREG1)                               0104 00110000
         ALR   WKREG1,@15                                          0104 00111000
*     WKREG1=WKREG1+1;              /* UPDATE THAT PTR BY ONE        */ 00112000
         AH    WKREG1,@CH00036                                     0105 00113000
*   END;                                                           0106 00114000
         LA    @15,1                                               0106 00115000
         AL    @15,X                                               0106 00116000
         ST    @15,X                                               0106 00117000
         CH    @15,@CH00080                                        0106 00118000
         BNH   @DL00090                                            0106 00119000
*I006C01A:                                                         0107 00120000
*                                                                  0107 00121000
*   /*****************************************************************/ 00122000
*   /*                                                               */ 00123000
*   /* TCEC MSGN(299) INVOKED                                        */ 00124000
*   /*                                                               */ 00125000
*   /*****************************************************************/ 00126000
*                                                                  0107 00127000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00128000
I006C01A OI    $TCECM(WAPTR),B'00000001'                           0107 00129000
*   R1=ADDR($TCA10);                /* SET UP PARM LIST $TR          */ 00130000
         LA    R1,$TCA10                                           0108 00131000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00132000
         L     @15,#EXITA(,WAPTR)                                  0109 00133000
         BALR  @14,@15                                             0109 00134000
*   DCL                                                            0110 00135000
*     1 $TCA10,                     /* TCEC PARM LIST                */ 00136000
*      2 $TCB10 FIXED(32) INIT(299),/* MSG NUMBER                    */ 00137000
*      2 $TCC10 FIXED(32) INIT(0),  /* INCT LEN                      */ 00138000
*      2 $TCD10 BIT(8) INIT('00000000'B),/* FLAG                     */ 00139000
*      2 $TCE10 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK INVALID   0110 00140000
*                                      ENTRY,RE-ENTER                */ 00141000
*   GOTO I006C01;                   /* GO GET NEW RESPONSE           */ 00142000
         B     I006C01                                             0111 00143000
*/* THIS SECTION SETS UP THE UNIT ADDRESS OR SYMBOLIC NAME IN THE    */ 00144000
*/* CDS BUILD AREA AND INITIALIZES THE PROPER SWITCHES               */ 00145000
*                                                                  0112 00146000
*I006C02:                                                          0112 00147000
*   R1=ADDR(CDSUA);                 /* SET UP SECONDARY BASE         */ 00148000
I006C02  L     R1,CDSWKPTR                                         0112 00149000
*   GEN;                                                           0113 00150000
*                                                                  0113 00151000
         XC  0(255,R1),0(R1)            /*ZERO OUT CDS WORK AREA     */ 00152000
*   /*****************************************************************/ 00153000
*   /*                                                               */ 00154000
*   /* TCEC MSGN(578)INCT(8) INVOKED                                 */ 00155000
*   /*                                                               */ 00156000
*   /*****************************************************************/ 00157000
*                                                                  0114 00158000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00159000
         OI    $TCECM(WAPTR),B'00000001'                           0114 00160000
*   R1=ADDR($TCA11);                /* SET UP PARM LIST $TR          */ 00161000
         LA    R1,$TCA11                                           0115 00162000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00163000
         L     @15,#EXITA(,WAPTR)                                  0116 00164000
         BALR  @14,@15                                             0116 00165000
*   DCL                                                            0117 00166000
*     1 $TCA11,                     /* TCEC PARM LIST                */ 00167000
*      2 $TCB11 FIXED(32) INIT(578),/* MSG NUMBER                    */ 00168000
*      2 $TCC11 FIXED(32) INIT(8),  /* INCT LEN                      */ 00169000
*      2 $TCD11 BIT(8) INIT('01000000'B),/* FLAG                     */ 00170000
*      2 $TCE11 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK GET SYMBOLIC   00171000
*                                      NAME OR CUA                   */ 00172000
*   IF $INBUFR(2:LENGTH(NUMBERIC)+1)<NUMBERIC THEN/* WHICH WOULD   0118 00173000
*                                      INDICATE A                    */ 00174000
         CLC   $INBUFR+1(1,WAPTR),NUMBERIC                         0118 00175000
         BNL   @RF00118                                            0118 00176000
*     DO;                                                          0119 00177000
*       $REMSW='1'B;                /* TURN ON REMOTE SW IN RCA      */ 00178000
         OI    $REMSW(WAPTR),B'01000000'                           0120 00179000
*       CDSREMSY='1'B;              /* TURN ON REMOTE SW IN CDS      */ 00180000
*       CDSSYMB='1'B;               /* TURN ON SYMBOLIC SW IN CDS    */ 00181000
         L     @15,CDSWKPTR                                        0122 00182000
         OI    CDSREMSY(@15),B'00001010'                           0122 00183000
*       CDSSYMBN='        ';        /* BLANK OUT NAME        @DM44548*/ 00184000
         MVC   CDSSYMBN(8,@15),@CC00835                            0123 00185000
*       CDSSYMBN=$INBUFR(2:(($INBUFR(1:1)+1)));/* MOVE NAME TO CDS   */ 00186000
         MVI   CDSSYMBN+1(@15),C' '                                0124 00187000
         MVC   CDSSYMBN+2(6,@15),CDSSYMBN+1(@15)                   0124 00188000
         SLR   @12,@12                                             0124 00189000
         IC    @12,$INBUFR(,WAPTR)                                 0124 00190000
         BCTR  @12,0                                               0124 00191000
         EX    @12,@SM00895                                        0124 00192000
*     END;                                                         0125 00193000
*   ELSE                                                           0126 00194000
*     DO;                           /* CUA ENTRY                     */ 00195000
         B     @RC00118                                            0126 00196000
@RF00118 DS    0H                                                  0127 00197000
*       $REMSW='0'B;                /* TURN OFF REMOTE FLAG          */ 00198000
         NI    $REMSW(WAPTR),B'10111111'                           0127 00199000
*       IF THREE=$INBUFR(1:1)       /* IF HE ENTERED ONLY A 3-BYTE   */ 00200000
*         THEN                      /* ADDRESS THEN MAKE IT LOOK     */ 00201000
         CLC   THREE(1),$INBUFR(WAPTR)                             0128 00202000
         BNE   @RF00128                                            0128 00203000
*         DO;                       /* LIKE A FOUR BYTE ENTRY        */ 00204000
*           WKAREA(1:2)=NUMBERIC;                                  0130 00205000
         MVI   WKAREA+1,C' '                                       0130 00206000
         MVC   WKAREA(1),NUMBERIC                                  0130 00207000
*           WKAREA(2:4)=$INBUFR(2:5);                              0131 00208000
         MVC   WKAREA+1(3),$INBUFR+1(WAPTR)                        0131 00209000
*         END;                                                     0132 00210000
*       ELSE                        /* IF IT WAS A 4-BYTE ENTRY      */ 00211000
*         DO;                       /* THEN JUST MOVE IT IN          */ 00212000
         B     @RC00128                                            0133 00213000
@RF00128 DS    0H                                                  0134 00214000
*           WKAREA(1:4)=$INBUFR(2:5);                              0134 00215000
         MVC   WKAREA(4),$INBUFR+1(WAPTR)                          0134 00216000
*         END;                                                     0135 00217000
*                                                                  0135 00218000
*       /*************************************************************/ 00219000
*       /*                                                           */ 00220000
*       /* ITACONV FROM(WKAREA)TO(WKAREA1)COUNT(4)TYPE(EH) INVOKED   */ 00221000
*       /*                                                           */ 00222000
*       /*************************************************************/ 00223000
*                                                                  0136 00224000
*       DCL                                                        0136 00225000
*         1 ITATCPRM BDY(WORD),     /* CONVERT PARAMETER LIST        */ 00226000
*          2 * CHAR(4) INIT('0102F4F1'X),                          0136 00227000
*          2 ITATCFR PTR,           /* ADDRESS OF FROM FIELD         */ 00228000
*          2 ITATCTO PTR,           /* ADDRESS OF TO FIELD           */ 00229000
*          2 * BIT(8) INIT(0),      /* FLAGS FOR CONVERT MODULE      */ 00230000
*           3 ITATCTP BIT(1),       /* TYPE OF CONVERT REQUIRED      */ 00231000
*          2 ITATCNT FIXED(8);      /* NUMBER OF BYTES TO CONVERT    */ 00232000
@RC00128 DS    0H                                                  0137 00233000
*       ITATCFR=ADDR(WKAREA);       /* SET THE FROM ADDRESS          */ 00234000
         LA    @15,WKAREA                                          0137 00235000
         ST    @15,ITATCFR                                         0137 00236000
*       ITATCTO=ADDR(WKAREA1);      /* SET THE TO ADDRESS            */ 00237000
         LA    @15,WKAREA1                                         0138 00238000
         ST    @15,ITATCTO                                         0138 00239000
*       ITATCTP='0'B;               /* SET THE TYPE OF CONVERT BIT   */ 00240000
         NI    ITATCTP,B'01111111'                                 0139 00241000
*       ITATCNT=4;                  /* GIVE THE CONVERT BYTE COUNT   */ 00242000
         MVI   ITATCNT,X'04'                                       0140 00243000
*       R1=ADDR(ITATCPRM);          /* POINT TO CONVERT PARM LIST    */ 00244000
         LA    R1,ITATCPRM                                         0141 00245000
*       CALL ISTSC021;              /* CALL CONVERT DIRECTLY         */ 00246000
         L     @15,@CV00845                                        0142 00247000
         BALR  @14,@15                                             0142 00248000
*       WKREG1=ADDR(CDSUA);         /* SET UP BASE FOR NXT INSTR     */ 00249000
         L     WKREG1,CDSWKPTR                                     0143 00250000
*       GEN;                                                       0144 00251000
*                                       /*                              00252000
               XC  0(4,WKREG1),0(WKREG1)  ZERO OUT CDSUA                00253000
               MVC 2(2,WKREG1),WKAREA1    MOVE IN CONVERTED ADDR        00254000
*     END;                                                         0145 00255000
*                                                                  0145 00256000
*/* CHECK TO SEE IF THE CDS REQUESTED IS KNOWN TO VTAM               */ 00257000
*                                                                  0146 00258000
*   R1=ADDR(VERYTBL);               /* SET UP PARM LIST PTR AND      */ 00259000
@RC00118 LA    R1,VERYTBL                                          0146 00260000
*   CDSPTR=ADDR(CDSUA);             /* CDS PTR FOR VERIFY            */ 00261000
         MVC   CDSPTR(4),CDSWKPTR                                  0147 00262000
*   CALL ISTSC030;                  /* CALL VERIFY MODULE            */ 00263000
         L     @15,@CV00846                                        0148 00264000
         BALR  @14,@15                                             0148 00265000
*   IF R15=0                        /* IF VERIFY WAS GOOD            */ 00266000
*     THEN                          /* THEN PUT CDS DATA IN $WORK    */ 00267000
         LTR   R15,R15                                             0149 00268000
         BNZ   @RF00149                                            0149 00269000
*     DO;                           /* AND CALL RESPECTIVE FUNCT     */ 00270000
*       GEN;                                                       0151 00271000
*                                       /*                              00272000
               BR  CALLREG                                           */ 00273000
*     END;                                                         0152 00274000
*I006C02A:                                                         0153 00275000
*   GOTO I006C01;                   /* PRT HEADER LINE               */ 00276000
         B     I006C01                                             0153 00277000
*I006CRET:                                                         0154 00278000
*   RETURN;                                                        0154 00279000
*   GEN(EJECT);                                                    0155 00280000
*                                                                  0155 00281000
         EJECT                                                          00282000
*/* BRANCH TABLE                                                     */ 00283000
*                                                                  0156 00284000
*   GEN;                                                           0156 00285000
CALLTBL  DS   0H                                                        00286000
          B    I006C03                    GO CALL DELETE                00287000
          B    I006C03A                   GO CALL ADD                   00288000
          B    I006C03B                   GO CALL CHANGE                00289000
          B    I006C03C                   GO CALL COPY                  00290000
          B    I006C03D                   GO EXEC EXHIBIT               00291000
*I006C03:                                                          0157 00292000
*   CALL ISTIC007;                  /* CALL DELETE                   */ 00293000
I006C03  L     @15,@CV00851                                        0157 00294000
         BALR  @14,@15                                             0157 00295000
*   GOTO I006C02A;                  /* GO CK FOR CONTINUATION        */ 00296000
         B     I006C02A                                            0158 00297000
*I006C03A:                                                         0159 00298000
*   CALL ISTIC008;                  /* CALL ADD                      */ 00299000
I006C03A L     @15,@CV00854                                        0159 00300000
         BALR  @14,@15                                             0159 00301000
*   GOTO I006C02A;                  /* GO CK FOR CONTINUATION        */ 00302000
         B     I006C02A                                            0160 00303000
*I006C03B:                                                         0161 00304000
*   $CHANGE='1'B;                   /* TURN ON CHANGE BIT            */ 00305000
I006C03B OI    $CHANGE(WAPTR),B'00100000'                          0161 00306000
*   CALL ISTIC009;                  /* CALL CHANGE                   */ 00307000
         L     @15,@CV00858                                        0162 00308000
         BALR  @14,@15                                             0162 00309000
*   GOTO I006C02A;                  /* GO CK FOR CONTINUATION        */ 00310000
         B     I006C02A                                            0163 00311000
*I006C03C:                                                         0164 00312000
*   $COPY='1'B;                     /* TURN ON COPY BIT              */ 00313000
I006C03C OI    $COPY(WAPTR),B'00001000'                            0164 00314000
*   CALL ISTIC009;                  /* CALL COPY                     */ 00315000
         L     @15,@CV00858                                        0165 00316000
         BALR  @14,@15                                             0165 00317000
*   GOTO I006C02A;                  /* GO CK FOR CONTINUATION        */ 00318000
         B     I006C02A                                            0166 00319000
*I006C03D:                                                         0167 00320000
*   DCL                                                            0167 00321000
*     1 ZZZGTPRM BDY(WORD),         /* GETCONFG PARAMETER LIST       */ 00322000
*      2 * CHAR(4) INIT('0102F1F6'X),                              0167 00323000
*      2 ZZZGTCD PTR,               /* POINTER TO BASIC CDS INFO     */ 00324000
*      2 ZZZGTAD PTR,               /* POINTER TO RECEIVING BUFFER   */ 00325000
*      2 ZZZGTCT FIXED(8);          /* NUMBER OF CDS BYTES NEEDED    */ 00326000
I006C03D DS    0H                                                  0168 00327000
*   ZZZGTAD=ADDR(CDSUA);            /* POINTER TO RECEIVING BUFFER   */ 00328000
         L     @15,CDSWKPTR                                        0168 00329000
         ST    @15,ZZZGTAD                                         0168 00330000
*   ZZZGTCD=ADDR(CDSUA);            /* POINTER TO BASIC CDS INFO     */ 00331000
         ST    @15,ZZZGTCD                                         0169 00332000
*   ZZZGTCT=255;                    /* NUMBER OF BYTES NEEDED        */ 00333000
         MVI   ZZZGTCT,X'FF'                                       0170 00334000
*   R1=ADDR(ZZZGTPRM);              /* POINT TO THE PARM LIST        */ 00335000
         LA    R1,ZZZGTPRM                                         0171 00336000
*   CALL ISTSC029;                  /* CALL THE GETCONFG FUNCTION    */ 00337000
         L     @15,@CV00870                                        0172 00338000
         BALR  @14,@15                                             0172 00339000
*/* START OF EXHIBIT FUNCTION                                        */ 00340000
*                                                                  0173 00341000
*   IF R15=0 THEN                   /* IF WE FOUND CDS THEN          */ 00342000
         LTR   R15,R15                                             0173 00343000
         BZ    @RT00173                                            0173 00344000
*     GOTO I006C04;                 /* CONTINUE                      */ 00345000
*                                                                  0174 00346000
*   /*****************************************************************/ 00347000
*   /*                                                               */ 00348000
*   /* TCEC MSGN(574) INVOKED                                        */ 00349000
*   /*                                                               */ 00350000
*   /*****************************************************************/ 00351000
*                                                                  0175 00352000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00353000
         OI    $TCECM(WAPTR),B'00000001'                           0175 00354000
*   R1=ADDR($TCA14);                /* SET UP PARM LIST $TR          */ 00355000
         LA    R1,$TCA14                                           0176 00356000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00357000
         L     @15,#EXITA(,WAPTR)                                  0177 00358000
         BALR  @14,@15                                             0177 00359000
*   DCL                                                            0178 00360000
*     1 $TCA14,                     /* TCEC PARM LIST                */ 00361000
*      2 $TCB14 FIXED(32) INIT(574),/* MSG NUMBER                    */ 00362000
*      2 $TCC14 FIXED(32) INIT(0),  /* INCT LEN                      */ 00363000
*      2 $TCD14 BIT(8) INIT('00000000'B),/* FLAG                     */ 00364000
*      2 $TCE14 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK DEVICE NOT     00365000
*                                      CONFIGURED                    */ 00366000
*   GOTO I006C02A;                  /* SEE IF HE WANTS TO CONT       */ 00367000
         B     I006C02A                                            0179 00368000
*   GEN(EJECT);                                                    0180 00369000
         EJECT                                                          00370000
*I006C04:                                                          0181 00371000
*   PRNTBUF1=TERMHD;                /* SET UP TERMINAL CONFIG HD     */ 00372000
I006C04  MVC   PRNTBUF1(22,WAPTR),TERMHD                           0181 00373000
*   FILLER(1:22)=BLANKHD;           /* BLANK OUT REST OF AREA        */ 00374000
         MVC   FILLER(22,WAPTR),BLANKHD                            0182 00375000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT HEADINGS             */ 00376000
         BAL LINKR,I006CMSG                                             00377000
*   PRNTBUF1=SUBHD01;               /* 'FIELD BYTES'                 */ 00378000
         MVC   PRNTBUF1(22,WAPTR),SUBHD01                          0184 00379000
*   FILLER(1:22)=CONTNTHD;          /* CONTENTS                      */ 00380000
         MVC   FILLER(22,WAPTR),CONTNTHD                           0185 00381000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT SUB-HEADING          */ 00382000
         BAL LINKR,I006CMSG                                             00383000
*   PRNTBUF1=UNITADHD;              /* SET UP UNIT ADDR HEADING      */ 00384000
*                                                                  0187 00385000
         MVC   PRNTBUF1(22,WAPTR),UNITADHD                         0187 00386000
*   /*****************************************************************/ 00387000
*   /*                                                               */ 00388000
*   /* ITACONV FROM(CDSUA)TO(PRNTBUF2)COUNT(4)TYPE(HE) INVOKED       */ 00389000
*   /*                                                               */ 00390000
*   /*****************************************************************/ 00391000
*                                                                  0188 00392000
*   ITATCFR=ADDR(CDSUA);            /* SET THE FROM ADDRESS          */ 00393000
         MVC   ITATCFR(4),CDSWKPTR                                 0188 00394000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00395000
         LA    @15,PRNTBUF2(,WAPTR)                                0189 00396000
         ST    @15,ITATCTO                                         0189 00397000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00398000
         OI    ITATCTP,B'10000000'                                 0190 00399000
*   ITATCNT=4;                      /* GIVE THE CONVERT BYTE COUNT   */ 00400000
         MVI   ITATCNT,X'04'                                       0191 00401000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00402000
         LA    R1,ITATCPRM                                         0192 00403000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00404000
         L     @15,@CV00845                                        0193 00405000
         BALR  @14,@15                                             0193 00406000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT UNIT ADDR LINE       */ 00407000
         BAL LINKR,I006CMSG                                             00408000
*   PRNTBUF1=MODELHD;               /* SET UP MODEL HEADING          */ 00409000
*                                                                  0195 00410000
         MVC   PRNTBUF1(22,WAPTR),MODELHD                          0195 00411000
*   /*****************************************************************/ 00412000
*   /*                                                               */ 00413000
*   /* ITACONV FROM(CDSMODEL)TO(PRNTBUF2)COUNT(1)TYPE(HE) INVOKED    */ 00414000
*   /*                                                               */ 00415000
*   /*****************************************************************/ 00416000
*                                                                  0196 00417000
*   ITATCFR=ADDR(CDSMODEL);         /* SET THE FROM ADDRESS          */ 00418000
         L     @15,CDSWKPTR                                        0196 00419000
         LA    @15,CDSMODEL(,@15)                                  0196 00420000
         ST    @15,ITATCFR                                         0196 00421000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00422000
         LA    @15,PRNTBUF2(,WAPTR)                                0197 00423000
         ST    @15,ITATCTO                                         0197 00424000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00425000
         OI    ITATCTP,B'10000000'                                 0198 00426000
*   ITATCNT=1;                      /* GIVE THE CONVERT BYTE COUNT   */ 00427000
         MVI   ITATCNT,X'01'                                       0199 00428000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00429000
         LA    R1,ITATCPRM                                         0200 00430000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00431000
         L     @15,@CV00845                                        0201 00432000
         BALR  @14,@15                                             0201 00433000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT MODEL LINE           */ 00434000
         BAL LINKR,I006CMSG                                             00435000
*   PRNTBUF1=FEATHD;                /* SET UP FEATURE HEADING        */ 00436000
*                                                                  0203 00437000
         MVC   PRNTBUF1(22,WAPTR),FEATHD                           0203 00438000
*   /*****************************************************************/ 00439000
*   /*                                                               */ 00440000
*   /* ITACONV FROM(CDSFEAT)TO(PRNTBUF2)COUNT(1)TYPE(HE) INVOKED     */ 00441000
*   /*                                                               */ 00442000
*   /*****************************************************************/ 00443000
*                                                                  0204 00444000
*   ITATCFR=ADDR(CDSFEAT);          /* SET THE FROM ADDRESS          */ 00445000
         L     @15,CDSWKPTR                                        0204 00446000
         LA    @15,CDSFEAT(,@15)                                   0204 00447000
         ST    @15,ITATCFR                                         0204 00448000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00449000
         LA    @15,PRNTBUF2(,WAPTR)                                0205 00450000
         ST    @15,ITATCTO                                         0205 00451000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00452000
         OI    ITATCTP,B'10000000'                                 0206 00453000
*   ITATCNT=1;                      /* GIVE THE CONVERT BYTE COUNT   */ 00454000
         MVI   ITATCNT,X'01'                                       0207 00455000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00456000
         LA    R1,ITATCPRM                                         0208 00457000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00458000
         L     @15,@CV00845                                        0209 00459000
         BALR  @14,@15                                             0209 00460000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT FEATURE LINE         */ 00461000
         BAL LINKR,I006CMSG                                             00462000
*   PRNTBUF1=CLASSHD;               /* SET UP CLASS HEADING          */ 00463000
*                                                                  0211 00464000
         MVC   PRNTBUF1(22,WAPTR),CLASSHD                          0211 00465000
*   /*****************************************************************/ 00466000
*   /*                                                               */ 00467000
*   /* ITACONV FROM(CDSCLASS)TO(PRNTBUF2)COUNT(1)TYPE(HE) INVOKED    */ 00468000
*   /*                                                               */ 00469000
*   /*****************************************************************/ 00470000
*                                                                  0212 00471000
*   ITATCFR=ADDR(CDSCLASS);         /* SET THE FROM ADDRESS          */ 00472000
         L     @15,CDSWKPTR                                        0212 00473000
         LA    @15,CDSCLASS(,@15)                                  0212 00474000
         ST    @15,ITATCFR                                         0212 00475000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00476000
         LA    @15,PRNTBUF2(,WAPTR)                                0213 00477000
         ST    @15,ITATCTO                                         0213 00478000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00479000
         OI    ITATCTP,B'10000000'                                 0214 00480000
*   ITATCNT=1;                      /* GIVE THE CONVERT BYTE COUNT   */ 00481000
         MVI   ITATCNT,X'01'                                       0215 00482000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00483000
         LA    R1,ITATCPRM                                         0216 00484000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00485000
         L     @15,@CV00845                                        0217 00486000
         BALR  @14,@15                                             0217 00487000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT CLASS LINE           */ 00488000
         BAL LINKR,I006CMSG                                             00489000
*   PRNTBUF1=TYPEHD;                /* SET UP TYPE HEADING           */ 00490000
*                                                                  0219 00491000
         MVC   PRNTBUF1(22,WAPTR),TYPEHD                           0219 00492000
*   /*****************************************************************/ 00493000
*   /*                                                               */ 00494000
*   /* ITACONV FROM(CDSTYPE)TO(PRNTBUF2)COUNT(1)TYPE(HE) INVOKED     */ 00495000
*   /*                                                               */ 00496000
*   /*****************************************************************/ 00497000
*                                                                  0220 00498000
*   ITATCFR=ADDR(CDSTYPE);          /* SET THE FROM ADDRESS          */ 00499000
         L     @15,CDSWKPTR                                        0220 00500000
         LA    @15,CDSTYPE(,@15)                                   0220 00501000
         ST    @15,ITATCFR                                         0220 00502000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00503000
         LA    @15,PRNTBUF2(,WAPTR)                                0221 00504000
         ST    @15,ITATCTO                                         0221 00505000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00506000
         OI    ITATCTP,B'10000000'                                 0222 00507000
*   ITATCNT=1;                      /* GIVE THE CONVERT BYTE COUNT   */ 00508000
         MVI   ITATCNT,X'01'                                       0223 00509000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00510000
         LA    R1,ITATCPRM                                         0224 00511000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00512000
         L     @15,@CV00845                                        0225 00513000
         BALR  @14,@15                                             0225 00514000
*   GEN(BAL LINKR,I006CMSG);        /* PRINT TYPE LINE               */ 00515000
         BAL LINKR,I006CMSG                                             00516000
*   PRNTBUF1=BYTECTHD;              /* SET UP BYTE COUNT HEADING     */ 00517000
*                                                                  0227 00518000
         MVC   PRNTBUF1(22,WAPTR),BYTECTHD                         0227 00519000
*   /*****************************************************************/ 00520000
*   /*                                                               */ 00521000
*   /* ITACONV FROM(CDSBYTCT)TO(PRNTBUF2)COUNT(1)TYPE(HE) INVOKED    */ 00522000
*   /*                                                               */ 00523000
*   /*****************************************************************/ 00524000
*                                                                  0228 00525000
*   ITATCFR=ADDR(CDSBYTCT);         /* SET THE FROM ADDRESS          */ 00526000
         L     @15,CDSWKPTR                                        0228 00527000
         LA    @15,CDSBYTCT(,@15)                                  0228 00528000
         ST    @15,ITATCFR                                         0228 00529000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00530000
         LA    @15,PRNTBUF2(,WAPTR)                                0229 00531000
         ST    @15,ITATCTO                                         0229 00532000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00533000
         OI    ITATCTP,B'10000000'                                 0230 00534000
*   ITATCNT=1;                      /* GIVE THE CONVERT BYTE COUNT   */ 00535000
         MVI   ITATCNT,X'01'                                       0231 00536000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00537000
         LA    R1,ITATCPRM                                         0232 00538000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00539000
         L     @15,@CV00845                                        0233 00540000
         BALR  @14,@15                                             0233 00541000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT BYTE COUNT LINE      */ 00542000
         BAL LINKR,I006CMSG                                             00543000
*   PRNTBUF1=FLAG01HD;              /* SET UP FLAG HEADING           */ 00544000
*                                                                  0235 00545000
         MVC   PRNTBUF1(22,WAPTR),FLAG01HD                         0235 00546000
*   /*****************************************************************/ 00547000
*   /*                                                               */ 00548000
*   /* ITACONV FROM(CDSFLAG)TO(PRNTBUF2)COUNT(3)TYPE(HE) INVOKED     */ 00549000
*   /*                                                               */ 00550000
*   /*****************************************************************/ 00551000
*                                                                  0236 00552000
*   ITATCFR=ADDR(CDSFLAG);          /* SET THE FROM ADDRESS          */ 00553000
         L     @15,CDSWKPTR                                        0236 00554000
         LA    @15,CDSFLAG(,@15)                                   0236 00555000
         ST    @15,ITATCFR                                         0236 00556000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00557000
         LA    @15,PRNTBUF2(,WAPTR)                                0237 00558000
         ST    @15,ITATCTO                                         0237 00559000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00560000
         OI    ITATCTP,B'10000000'                                 0238 00561000
*   ITATCNT=3;                      /* GIVE THE CONVERT BYTE COUNT   */ 00562000
         MVI   ITATCNT,X'03'                                       0239 00563000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00564000
         LA    R1,ITATCPRM                                         0240 00565000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00566000
         L     @15,@CV00845                                        0241 00567000
         BALR  @14,@15                                             0241 00568000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT FLAG LINE            */ 00569000
         BAL LINKR,I006CMSG                                             00570000
*   IF $REMSW^='1'B THEN            /* IF ITS NOT REMOTE RUN         */ 00571000
         TM    $REMSW(WAPTR),B'01000000'                           0243 00572000
         BO    @RF00243                                            0243 00573000
*     DO;                                                          0244 00574000
*       IF CDSBYTCT<12              /* IF NO EXTRA DATA              */ 00575000
*         THEN                      /* THEN                          */ 00576000
         L     @15,CDSWKPTR                                        0245 00577000
         CLI   CDSBYTCT(@15),12                                    0245 00578000
         BL    @RT00245                                            0245 00579000
*         GOTO I006C02A;            /* GO BACK AROUND                */ 00580000
*       ELSE                        /* ELSE                          */ 00581000
*         Z=CDSBYTCT-12;            /* POINT TO REMAINING DATA     0247 00582000
*                                                            @YA04055*/ 00583000
         SLR   @12,@12                                             0247 00584000
         IC    @12,CDSBYTCT(,@15)                                  0247 00585000
         SH    @12,@CH00263                                        0247 00586000
         STC   @12,Z                                               0247 00587000
*       REMPTR=ADDR(CDSSYMBN);      /* PT YO BYTE 12                 */ 00588000
         LA    REMPTR,CDSSYMBN(,@15)                               0248 00589000
*       GOTO I006C04C;              /* THEN BR AROUND                */ 00590000
         B     I006C04C                                            0249 00591000
*     END;                                                         0250 00592000
*   PRNTBUF1=SYMNMEHD;              /* SET UP SYM NME HEADING        */ 00593000
@RF00243 MVC   PRNTBUF1(22,WAPTR),SYMNMEHD                         0251 00594000
*   PRNTBUF2=CDSSYMBN;              /* SET UP SYMBOLIC NAME          */ 00595000
         MVI   PRNTBUF2+8(WAPTR),C' '                              0252 00596000
         MVC   PRNTBUF2+9(9,WAPTR),PRNTBUF2+8(WAPTR)               0252 00597000
         L     @15,CDSWKPTR                                        0252 00598000
         MVC   PRNTBUF2(8,WAPTR),CDSSYMBN(@15)                     0252 00599000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT SYMBOLIC NAME LN     */ 00600000
         BAL LINKR,I006CMSG                                             00601000
*   IF CDSBYTCT<20                  /* IF WE DO NOT HAVE CDS DATA    */ 00602000
*     THEN                                                         0254 00603000
         L     @15,CDSWKPTR                                        0254 00604000
         CLI   CDSBYTCT(@15),20                                    0254 00605000
         BL    @RT00254                                            0254 00606000
*     GOTO I006C02A;                /* THEN BR AROUND                */ 00607000
*   ELSE                                                           0256 00608000
*     DO;                           /* PRINT THAT DATA (MAX-235)     */ 00609000
*       REMPTR=ADDR(CDSEXARA);      /* PT TO BYTE 20                 */ 00610000
         LA    REMPTR,CDSEXARA(,@15)                               0257 00611000
*       Z=CDSBYTCT-20;              /* ADJUST FOR 0-20 BYTES @YA04055*/ 00612000
         SLR   @12,@12                                             0258 00613000
         IC    @12,CDSBYTCT(,@15)                                  0258 00614000
         SH    @12,@CH00068                                        0258 00615000
         STC   @12,Z                                               0258 00616000
*I006C04C:                                                         0259 00617000
*       PRNTBUF1=REMGHD;            /* SET UP 'REMAINING' HD         */ 00618000
I006C04C MVC   PRNTBUF1(22,WAPTR),REMGHD                           0259 00619000
*       I=Z/8;                      /* GET NUMBER OF DO LOOPS        */ 00620000
         SLR   @15,@15                                             0260 00621000
         IC    @15,Z                                               0260 00622000
         LR    @12,@15                                             0260 00623000
         SRL   @12,3                                               0260 00624000
         STC   @12,I                                               0260 00625000
*       R=Z//8;                     /* GET REMAINDER                 */ 00626000
         LR    @00,@15                                             0261 00627000
         SRDA  @00,32                                              0261 00628000
         D     @00,@CF00055                                        0261 00629000
         STC   @00,R                                               0261 00630000
*       X=0;                        /* RESET INDEX VALUE             */ 00631000
         SLR   @15,@15                                             0262 00632000
         ST    @15,X                                               0262 00633000
*       IF I<1 THEN                                                0263 00634000
         CLI   I,1                                                 0263 00635000
         BL    @RT00263                                            0263 00636000
*         GOTO I006C05;             /* SKIP LOOP IF DATA < 8         */ 00637000
*       DO Y=1 TO I BY 1;           /* CONVERT AND PRINT DATA        */ 00638000
*                                                                  0265 00639000
         LA    @15,1                                               0265 00640000
         ST    @15,Y                                               0265 00641000
         B     @DE00265                                            0265 00642000
@DL00265 DS    0H                                                  0266 00643000
*         /***********************************************************/ 00644000
*         /*                                                         */ 00645000
*         /* ITACONV FROM(REMAREA)TO(PRNTBUF2)COUNT(8)TYPE(HE)       */ 00646000
*         /* INVOKED                                                 */ 00647000
*         /*                                                         */ 00648000
*         /***********************************************************/ 00649000
*                                                                  0266 00650000
*         ITATCFR=ADDR(REMAREA);    /* SET THE FROM ADDRESS          */ 00651000
         ST    REMPTR,ITATCFR                                      0266 00652000
*         ITATCTO=ADDR(PRNTBUF2);   /* SET THE TO ADDRESS            */ 00653000
         LA    @15,PRNTBUF2(,WAPTR)                                0267 00654000
         ST    @15,ITATCTO                                         0267 00655000
*         ITATCTP='1'B;             /* SET THE TYPE OF CONVERT BIT   */ 00656000
         OI    ITATCTP,B'10000000'                                 0268 00657000
*         ITATCNT=8;                /* GIVE THE CONVERT BYTE COUNT   */ 00658000
         MVI   ITATCNT,X'08'                                       0269 00659000
*         R1=ADDR(ITATCPRM);        /* POINT TO CONVERT PARM LIST    */ 00660000
         LA    R1,ITATCPRM                                         0270 00661000
*         CALL ISTSC021;            /* CALL CONVERT DIRECTLY         */ 00662000
         L     @15,@CV00845                                        0271 00663000
         BALR  @14,@15                                             0271 00664000
*         GEN(BAL LINKR,I006CMSG);  /* GO PRINT DATA                 */ 00665000
         BAL LINKR,I006CMSG                                             00666000
*         X=X+8;                    /* UPDATE INDEX VALUE            */ 00667000
         LA    @15,8                                               0273 00668000
         L     @12,X                                               0273 00669000
         ALR   @12,@15                                             0273 00670000
         ST    @12,X                                               0273 00671000
*         REMPTR=REMPTR+8;                                         0274 00672000
         ALR   REMPTR,@15                                          0274 00673000
*       END;                                                       0275 00674000
         LA    @15,1                                               0275 00675000
         AL    @15,Y                                               0275 00676000
         ST    @15,Y                                               0275 00677000
@DE00265 SLR   @12,@12                                             0275 00678000
         IC    @12,I                                               0275 00679000
         CR    @15,@12                                             0275 00680000
         BNH   @DL00265                                            0275 00681000
*     END;                                                         0276 00682000
*I006C05:                                                          0277 00683000
*   IF R=0 THEN                     /* IF REMAINDER = 0, THEN BR     */ 00684000
I006C05  CLI   R,0                                                 0277 00685000
         BE    @RT00277                                            0277 00686000
*     GO TO I006C02A;               /* BR AROUND CONVERT             */ 00687000
*                                                                  0278 00688000
*   /*****************************************************************/ 00689000
*   /*                                                               */ 00690000
*   /* ITACONV FROM(REMAREA)TO(PRNTBUF2)COUNT(R)TYPE(HE) INVOKED     */ 00691000
*   /*                                                               */ 00692000
*   /*****************************************************************/ 00693000
*                                                                  0279 00694000
*   ITATCFR=ADDR(REMAREA);          /* SET THE FROM ADDRESS          */ 00695000
         ST    REMPTR,ITATCFR                                      0279 00696000
*   ITATCTO=ADDR(PRNTBUF2);         /* SET THE TO ADDRESS            */ 00697000
         LA    @15,PRNTBUF2(,WAPTR)                                0280 00698000
         ST    @15,ITATCTO                                         0280 00699000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00700000
         OI    ITATCTP,B'10000000'                                 0281 00701000
*   ITATCNT=R;                      /* GIVE THE CONVERT BYTE COUNT   */ 00702000
         MVC   ITATCNT(1),R                                        0282 00703000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00704000
         LA    R1,ITATCPRM                                         0283 00705000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00706000
         L     @15,@CV00845                                        0284 00707000
         BALR  @14,@15                                             0284 00708000
*   GEN(BAL LINKR,I006CMSG);        /* GO PRINT LAST DATA BYTES      */ 00709000
         BAL LINKR,I006CMSG                                             00710000
*   GOTO I006C02A;                  /* GO CK FOR MORE TO EXHIBIT     */ 00711000
         B     I006C02A                                            0286 00712000
*   GEN(EJECT);                                                    0287 00713000
         EJECT                                                          00714000
*I006CMSG:                                                         0288 00715000
*   GEN(ST LINKR,RETSAV);           /* SAVE RETURN ADDR              */ 00716000
I006CMSG ST LINKR,RETSAV                                                00717000
*   $INBUFR(1:80)='';               /* BLANK OUT INBUFR              */ 00718000
         MVI   $INBUFR(WAPTR),C' '                                 0289 00719000
         MVC   $INBUFR+1(79,WAPTR),$INBUFR(WAPTR)                  0289 00720000
*   $INBUFR(1:44)=PRNTBUF;          /* SET UP SUBSTITUTION CHAR      */ 00721000
*                                                                  0290 00722000
         MVC   $INBUFR(44,WAPTR),PRNTBUF(WAPTR)                    0290 00723000
*   /*****************************************************************/ 00724000
*   /*                                                               */ 00725000
*   /* TCEC MSGN(579)SUB(YES) INVOKED                                */ 00726000
*   /*                                                               */ 00727000
*   /*****************************************************************/ 00728000
*                                                                  0291 00729000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00730000
         OI    $TCECM(WAPTR),B'00000001'                           0291 00731000
*   R1=ADDR($TCA24);                /* SET UP PARM LIST $TR          */ 00732000
         LA    R1,$TCA24                                           0292 00733000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00734000
         L     @15,#EXITA(,WAPTR)                                  0293 00735000
         BALR  @14,@15                                             0293 00736000
*   DCL                                                            0294 00737000
*     1 $TCA24,                     /* TCEC PARM LIST                */ 00738000
*      2 $TCB24 FIXED(32) INIT(579),/* MSG NUMBER                    */ 00739000
*      2 $TCC24 FIXED(32) INIT(0),  /* INCT LEN                      */ 00740000
*      2 $TCD24 BIT(8) INIT('10000000'B),/* FLAG                     */ 00741000
*      2 $TCE24 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK PRINT MSG   */ 00742000
*   PRNTBUF1=BLANKHD;               /* BLANK OUT PRNTBUF             */ 00743000
         MVC   PRNTBUF1(22,WAPTR),BLANKHD                          0295 00744000
*   FILLER=BLANKHD;                 /* BLANK OUT PRNTBUF             */ 00745000
         MVC   FILLER(4,WAPTR),BLANKHD                             0296 00746000
*   PRNTBUF2(1:18)=BLANKHD(1:18);   /* BLANK OUT PRNT BUFFER 2       */ 00747000
         MVC   PRNTBUF2(18,WAPTR),BLANKHD                          0297 00748000
*   GEN(L  LINKR,RETSAV);           /* RESTORE RETURN REG            */ 00749000
         L  LINKR,RETSAV                                                00750000
*   GEN(BR LINKR);                  /* RETURN TO CALLER              */ 00751000
         BR LINKR                                                       00752000
*   DO;                             /* ATDSPLY                       */ 00753000
*   END;                            /* ATDSPLY                       */ 00754000
*   END ISTIC006;                                                  0302 00755000
@EL00001 L     @13,4(,@13)                                         0302 00756000
@EF00001 DS    0H                                                  0302 00757000
@ER00001 L     @14,12(,@13)                                        0302 00758000
         LM    @00,@12,20(@13)                                     0302 00759000
         BR    @14                                                 0302 00760000
@DATA    DS    0H                                                       00761000
@CH00036 DC    H'1'                                                     00762000
@CH00045 DC    H'4'                                                     00763000
@CH00080 DC    H'5'                                                     00764000
@CH00263 DC    H'12'                                                    00765000
@CH00068 DC    H'20'                                                    00766000
@CH00181 DC    H'80'                                                    00767000
@SM00895 MVC   CDSSYMBN(0,@15),$INBUFR+1(WAPTR)                         00768000
         DS    0F                                                       00769000
@SA00001 DS    18F                                                      00770000
         DS    0F                                                       00771000
@CF00055 DC    F'8'                                                     00772000
@CV00845 DC    V(ISTSC021)                                              00773000
@CV00846 DC    V(ISTSC030)                                              00774000
@CV00851 DC    V(ISTIC007)                                              00775000
@CV00854 DC    V(ISTIC008)                                              00776000
@CV00858 DC    V(ISTIC009)                                              00777000
@CV00870 DC    V(ISTSC029)                                              00778000
         DS    0D                                                       00779000
X        DC    F'0'                                                     00780000
Y        DC    F'0'                                                     00781000
RCAPTR   DS    A                                                        00782000
CDSWKPTR DS    A                                                        00783000
RETSAV   DS    F                                                        00784000
Z        DC    XL1'0'                                                   00785000
         DS    CL3                                                      00786000
I        DC    XL1'0'                                                   00787000
         DS    CL3                                                      00788000
R        DC    XL1'0'                                                   00789000
@CC00835 DC    C'        '                                              00790000
BLANK    DC    CL1' '                                                   00791000
YES      DC    CL3'YES'                                                 00792000
NO       DC    CL2'NO'                                                  00793000
NONE     DC    CL4'NONE'                                                00794000
NUMBERIC DC    CL1'0'                                                   00795000
DSPLYMSG DC    CL7'EXHIBIT'                                             00796000
THREE    DC    X'03'                                                    00797000
WKAREA   DS    CL8                                                      00798000
WKAREA1  DS    CL4                                                      00799000
VERYTBL  DS    CL5                                                      00800000
         ORG   VERYTBL                                                  00801000
CDSPTR   DS    AL4                                                      00802000
@NM00001 DC    X'00'                                                    00803000
         ORG   VERYTBL+5                                                00804000
CDSTITLE DS    CL286                                                    00805000
         ORG   CDSTITLE                                                 00806000
TERMHD   DS    CL22                                                     00807000
         ORG   TERMHD                                                   00808000
@NM00012 DC    CL22'CONFIGURATION DATA    '                             00809000
         ORG   CDSTITLE+22                                              00810000
SUBHD01  DS    CL22                                                     00811000
         ORG   SUBHD01                                                  00812000
@NM00013 DC    CL22'   FIELD         BYTES'                             00813000
         ORG   CDSTITLE+44                                              00814000
UNITADHD DS    CL22                                                     00815000
         ORG   UNITADHD                                                 00816000
@NM00014 DC    CL22'UNIT ADDRESS     00-03'                             00817000
         ORG   CDSTITLE+66                                              00818000
MODELHD  DS    CL22                                                     00819000
         ORG   MODELHD                                                  00820000
@NM00015 DC    CL22'MODEL               04'                             00821000
         ORG   CDSTITLE+88                                              00822000
FEATHD   DS    CL22                                                     00823000
         ORG   FEATHD                                                   00824000
@NM00016 DC    CL22'FEATURE             05'                             00825000
         ORG   CDSTITLE+110                                             00826000
CLASSHD  DS    CL22                                                     00827000
         ORG   CLASSHD                                                  00828000
@NM00017 DC    CL22'CLASS               06'                             00829000
         ORG   CDSTITLE+132                                             00830000
TYPEHD   DS    CL22                                                     00831000
         ORG   TYPEHD                                                   00832000
@NM00018 DC    CL22'TYPE                07'                             00833000
         ORG   CDSTITLE+154                                             00834000
BYTECTHD DS    CL22                                                     00835000
         ORG   BYTECTHD                                                 00836000
@NM00019 DC    CL22'BYTE COUNT          08'                             00837000
         ORG   CDSTITLE+176                                             00838000
FLAG01HD DS    CL22                                                     00839000
         ORG   FLAG01HD                                                 00840000
@NM00020 DC    CL22'FLAGS            09-11'                             00841000
         ORG   CDSTITLE+198                                             00842000
SYMNMEHD DS    CL22                                                     00843000
         ORG   SYMNMEHD                                                 00844000
@NM00021 DC    CL22'SYMBOLIC NAME    12-19'                             00845000
         ORG   CDSTITLE+220                                             00846000
REMGHD   DS    CL22                                                     00847000
         ORG   REMGHD                                                   00848000
@NM00022 DC    CL22'REMAINING             '                             00849000
         ORG   CDSTITLE+242                                             00850000
BLANKHD  DS    CL22                                                     00851000
         ORG   BLANKHD                                                  00852000
@NM00023 DC    CL22'                      '                             00853000
         ORG   CDSTITLE+264                                             00854000
CONTNTHD DS    CL22                                                     00855000
         ORG   CONTNTHD                                                 00856000
@NM00024 DC    CL22'    CONTENTS          '                             00857000
         ORG   CDSTITLE+286                                             00858000
         DS    CL1                                                      00859000
$TCA09   DS    CL13                                                     00860000
         ORG   $TCA09                                                   00861000
$TCB09   DC    A(560)                                                   00862000
$TCC09   DC    A(8)                                                     00863000
$TCD09   DC    B'01000000'                                              00864000
$TCE09   DC    X'FFFFFFFF'                                              00865000
         ORG   $TCA09+13                                                00866000
         DS    CL3                                                      00867000
$TCA10   DS    CL13                                                     00868000
         ORG   $TCA10                                                   00869000
$TCB10   DC    A(299)                                                   00870000
$TCC10   DC    A(0)                                                     00871000
$TCD10   DC    B'00000000'                                              00872000
$TCE10   DC    X'FFFFFFFF'                                              00873000
         ORG   $TCA10+13                                                00874000
         DS    CL3                                                      00875000
$TCA11   DS    CL13                                                     00876000
         ORG   $TCA11                                                   00877000
$TCB11   DC    A(578)                                                   00878000
$TCC11   DC    A(8)                                                     00879000
$TCD11   DC    B'01000000'                                              00880000
$TCE11   DC    X'FFFFFFFF'                                              00881000
         ORG   $TCA11+13                                                00882000
         DS    CL3                                                      00883000
ITATCPRM DS    CL14                                                     00884000
         ORG   ITATCPRM                                                 00885000
@NM00077 DC    X'0102F4F1'                                              00886000
ITATCFR  DS    AL4                                                      00887000
ITATCTO  DS    AL4                                                      00888000
@NM00078 DC    AL1(0)                                                   00889000
         ORG   @NM00078                                                 00890000
ITATCTP  DS    BL1                                                      00891000
         ORG   ITATCPRM+13                                              00892000
ITATCNT  DS    FL1                                                      00893000
         ORG   ITATCPRM+14                                              00894000
         DS    CL2                                                      00895000
ZZZGTPRM DS    CL13                                                     00896000
         ORG   ZZZGTPRM                                                 00897000
@NM00079 DC    X'0102F1F6'                                              00898000
ZZZGTCD  DS    AL4                                                      00899000
ZZZGTAD  DS    AL4                                                      00900000
ZZZGTCT  DS    FL1                                                      00901000
         ORG   ZZZGTPRM+13                                              00902000
         DS    CL3                                                      00903000
$TCA14   DS    CL13                                                     00904000
         ORG   $TCA14                                                   00905000
$TCB14   DC    A(574)                                                   00906000
$TCC14   DC    A(0)                                                     00907000
$TCD14   DC    B'00000000'                                              00908000
$TCE14   DC    X'FFFFFFFF'                                              00909000
         ORG   $TCA14+13                                                00910000
         DS    CL3                                                      00911000
$TCA24   DS    CL13                                                     00912000
         ORG   $TCA24                                                   00913000
$TCB24   DC    A(579)                                                   00914000
$TCC24   DC    A(0)                                                     00915000
$TCD24   DC    B'10000000'                                              00916000
$TCE24   DC    X'FFFFFFFF'                                              00917000
         ORG   $TCA24+13                                                00918000
CDSWORK  DS    CL20                                                     00919000
FNCTBL   DS    CL31                                                     00920000
         ORG   FNCTBL+0                                                 00921000
DELETE   DS    CL7                                                      00922000
         ORG   DELETE+0                                                 00923000
@NM00002 DC    AL1(6)                                                   00924000
@NM00003 DC    CL6'DELETE'                                              00925000
         ORG   FNCTBL+7                                                 00926000
ADD      DS    CL4                                                      00927000
         ORG   ADD+0                                                    00928000
@NM00004 DC    AL1(3)                                                   00929000
@NM00005 DC    CL3'ADD'                                                 00930000
         ORG   FNCTBL+11                                                00931000
CHANGE   DS    CL7                                                      00932000
         ORG   CHANGE+0                                                 00933000
@NM00006 DC    AL1(6)                                                   00934000
@NM00007 DC    CL6'CHANGE'                                              00935000
         ORG   FNCTBL+18                                                00936000
COPY     DS    CL5                                                      00937000
         ORG   COPY+0                                                   00938000
@NM00008 DC    AL1(4)                                                   00939000
@NM00009 DC    CL4'COPY'                                                00940000
         ORG   FNCTBL+23                                                00941000
EXHIBIT  DS    CL8                                                      00942000
         ORG   EXHIBIT+0                                                00943000
@NM00010 DC    AL1(7)                                                   00944000
@NM00011 DC    CL7'EXHIBIT'                                             00945000
         ORG   FNCTBL+155                                               00946000
PATCH    DC    40F'0'                                                   00947000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00948000
@01      EQU   01                                                       00949000
@02      EQU   02                                                       00950000
@03      EQU   03                                                       00951000
@04      EQU   04                                                       00952000
@05      EQU   05                                                       00953000
@06      EQU   06                                                       00954000
@07      EQU   07                                                       00955000
@08      EQU   08                                                       00956000
@09      EQU   09                                                       00957000
@10      EQU   10                                                       00958000
@11      EQU   11                                                       00959000
@12      EQU   12                                                       00960000
@13      EQU   13                                                       00961000
@14      EQU   14                                                       00962000
@15      EQU   15                                                       00963000
REMPTR   EQU   @03                                                      00964000
WKREG1   EQU   @05                                                      00965000
WKREG2   EQU   @06                                                      00966000
CALLREG  EQU   @07                                                      00967000
LINKR    EQU   @14                                                      00968000
CECMAP   EQU   @04                                                      00969000
WAPTR    EQU   @02                                                      00970000
R1       EQU   @01                                                      00971000
R15      EQU   @15                                                      00972000
R0       EQU   @00                                                      00973000
R10      EQU   @10                                                      00974000
R11      EQU   @11                                                      00975000
R12      EQU   @12                                                      00976000
R13      EQU   @13                                                      00977000
R14      EQU   @14                                                      00978000
R2       EQU   @02                                                      00979000
R3       EQU   @03                                                      00980000
R4       EQU   @04                                                      00981000
R5       EQU   @05                                                      00982000
R6       EQU   @06                                                      00983000
R7       EQU   @07                                                      00984000
R8       EQU   @08                                                      00985000
R9       EQU   @09                                                      00986000
TBLENTLN EQU   0                                                        00987000
TBLENTRY EQU   0                                                        00988000
REMAREA  EQU   0                                                        00989000
$RCAAREA EQU   0                                                        00990000
$POINTER EQU   $RCAAREA+100                                             00991000
$TRTBLA  EQU   $POINTER+124                                             00992000
$CONSTNT EQU   $RCAAREA+244                                             00993000
$RCAFLG  EQU   $RCAAREA+604                                             00994000
TOLTEPWA EQU   0                                                        00995000
$SCTTBLE EQU   TOLTEPWA                                                 00996000
$TESTOPT EQU   $SCTTBLE+2                                               00997000
$ERROPT  EQU   $SCTTBLE+3                                               00998000
$PDEVFLG EQU   $SCTTBLE+10                                              00999000
$CDSFLGS EQU   $SCTTBLE+11                                              01000000
$CDS8T19 EQU   $SCTTBLE+20                                              01001000
$EXECFLG EQU   $SCTTBLE+33                                              01002000
$OLTFLGS EQU   $SCTTBLE+36                                              01003000
$OLTFLG2 EQU   $SCTTBLE+37                                              01004000
$TOTFLG1 EQU   $SCTTBLE+38                                              01005000
$ROUTMSK EQU   $SCTTBLE+40                                              01006000
$CDA     EQU   TOLTEPWA+100                                             01007000
$RCA     EQU   $CDA+44                                                  01008000
$OLTPTR  EQU   $CDA+52                                                  01009000
$LOWADDR EQU   $OLTPTR                                                  01010000
$HIMOREC EQU   $CDA+60                                                  01011000
$COMMFLG EQU   TOLTEPWA+224                                             01012000
$FLAG1   EQU   $COMMFLG                                                 01013000
$FLAG2   EQU   $COMMFLG+1                                               01014000
$FLAG3   EQU   $COMMFLG+2                                               01015000
$FLAG4   EQU   $COMMFLG+3                                               01016000
$FLAG5   EQU   $COMMFLG+4                                               01017000
$EOJ     EQU   $FLAG5                                                   01018000
$CANCEL  EQU   $EOJ                                                     01019000
$FLAG6   EQU   $COMMFLG+5                                               01020000
$CHANGE  EQU   $FLAG6                                                   01021000
$ABNDBIT EQU   $FLAG6                                                   01022000
$FLAG7   EQU   $COMMFLG+6                                               01023000
$FLAG8   EQU   $COMMFLG+7                                               01024000
$TCECM   EQU   $FLAG8                                                   01025000
$FLAG9   EQU   $COMMFLG+8                                               01026000
$REMSW   EQU   $FLAG9                                                   01027000
$COPY    EQU   $FLAG9                                                   01028000
$FLAG10  EQU   $COMMFLG+9                                               01029000
$FLAG11  EQU   $COMMFLG+10                                              01030000
$FLAG12  EQU   $COMMFLG+11                                              01031000
$FLAG13  EQU   $COMMFLG+12                                              01032000
$DEVTBLE EQU   TOLTEPWA+240                                             01033000
$DEVCDS  EQU   $DEVTBLE                                                 01034000
$DEVUNAD EQU   $DEVCDS                                                  01035000
@NM00063 EQU   $DEVUNAD+2                                               01036000
$DEVFEAT EQU   $DEVCDS+4                                                01037000
$DEVCDSF EQU   $DEVCDS+9                                                01038000
$DEVSDCF EQU   $DEVCDS+10                                               01039000
$$SYMNME EQU   $DEVCDS+12                                               01040000
$DEVFLG1 EQU   $DEVTBLE+20                                              01041000
$EVNCPLT EQU   $DEVFLG1                                                 01042000
$ATTNEXP EQU   $DEVFLG1                                                 01043000
$INTOCC  EQU   $DEVFLG1                                                 01044000
$DEVFLG2 EQU   $DEVTBLE+21                                              01045000
$DEVTECB EQU   $DEVTBLE+22                                              01046000
$OPIS    EQU   $DEVTECB                                                 01047000
$OPND    EQU   $DEVTECB+2                                               01048000
$DEVFLG3 EQU   $DEVTBLE+27                                              01049000
$SIOFLG  EQU   $DEVFLG3                                                 01050000
$IFTOUT  EQU   $DEVTBLE+36                                              01051000
$DEVSESP EQU   $IFTOUT                                                  01052000
$SSCPDAF EQU   $IFTOUT+6                                                01053000
$LDNCBPT EQU   $DEVTBLE+48                                              01054000
$RNINFO  EQU   $DEVTBLE+56                                              01055000
$DEVFLG5 EQU   $RNINFO+8                                                01056000
$DEVFLG4 EQU   $DEVTBLE+65                                              01057000
$SLTBL   EQU   TOLTEPWA+1468                                            01058000
$RUNTEST EQU   $SLTBL+13                                                01059000
$TESTFLG EQU   $SLTBL+21                                                01060000
$SECLST  EQU   $SLTBL+22                                                01061000
$BUFFER  EQU   TOLTEPWA+1976                                            01062000
$INBUFR  EQU   TOLTEPWA+2104                                            01063000
#EXITA   EQU   TOLTEPWA+2632                                            01064000
$CCOMDAT EQU   TOLTEPWA+2644                                            01065000
$CFLGS   EQU   $CCOMDAT+16                                              01066000
$24FEMSG EQU   TOLTEPWA+2681                                            01067000
$24CATMG EQU   $24FEMSG+11                                              01068000
@NM00072 EQU   TOLTEPWA+2776                                            01069000
$OUNTPTR EQU   @NM00072+4                                               01070000
$NSPTR   EQU   $OUNTPTR                                                 01071000
$NSCNT   EQU   @NM00072+10                                              01072000
$ENXX    EQU   @NM00072+15                                              01073000
$IMITX   EQU   $ENXX                                                    01074000
SVESC033 EQU   TOLTEPWA+3160                                            01075000
SVECC013 EQU   TOLTEPWA+3232                                            01076000
SVEIC003 EQU   TOLTEPWA+3592                                            01077000
SVESC022 EQU   TOLTEPWA+3736                                            01078000
SVECC011 EQU   TOLTEPWA+4024                                            01079000
#EXIT    EQU   0                                                        01080000
CECOMMAP EQU   0                                                        01081000
CDSMAP   EQU   0                                                        01082000
CDSUA    EQU   CDSMAP                                                   01083000
CDSMFCT  EQU   CDSMAP+4                                                 01084000
CDSMODEL EQU   CDSMFCT                                                  01085000
CDSFEAT  EQU   CDSMFCT+1                                                01086000
CDSCLASS EQU   CDSMFCT+2                                                01087000
CDSTYPE  EQU   CDSMFCT+3                                                01088000
CDSBYTCT EQU   CDSMAP+8                                                 01089000
CDSFLAG  EQU   CDSMAP+9                                                 01090000
CDSSYMB  EQU   CDSFLAG                                                  01091000
CDSREMSY EQU   CDSFLAG                                                  01092000
CDSSYMBN EQU   CDSMAP+12                                                01093000
CDSEXARA EQU   CDSMAP+20                                                01094000
$TRTBL   EQU   0                                                        01095000
PRNTBUF  EQU   $BUFFER                                                  01096000
PRNTBUF1 EQU   PRNTBUF                                                  01097000
FILLER   EQU   PRNTBUF+22                                               01098000
PRNTBUF2 EQU   PRNTBUF+26                                               01099000
SVECC012 EQU   SVESC022                                                 01100000
SVEIC00A EQU   SVEIC003                                                 01101000
SVEIC004 EQU   SVEIC003                                                 01102000
SVEIC005 EQU   SVEIC003                                                 01103000
SVESC02A EQU   SVESC022                                                 01104000
SVESC02B EQU   SVESC022                                                 01105000
SVESC02D EQU   SVESC022                                                 01106000
SVESC02E EQU   SVESC022                                                 01107000
SVESC02F EQU   SVECC013                                                 01108000
SVESC024 EQU   SVESC022                                                 01109000
SVESC027 EQU   SVESC022                                                 01110000
SVESC029 EQU   SVESC033                                                 01111000
SVESC031 EQU   SVECC013                                                 01112000
SVESC032 EQU   SVECC011                                                 01113000
SVETC037 EQU   SVEIC003                                                 01114000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01115000
CDSEXTM  EQU   CDSFLAG+2                                                01116000
CDSEXTB  EQU   CDSFLAG+2                                                01117000
CDSTMERB EQU   CDSFLAG+2                                                01118000
@NM00076 EQU   CDSFLAG+1                                                01119000
CDSDVPRO EQU   CDSFLAG+1                                                01120000
CDSNTPRI EQU   CDSFLAG+1                                                01121000
CDSLINCN EQU   CDSFLAG                                                  01122000
CDS2CHAN EQU   CDSFLAG                                                  01123000
CDSEXTPR EQU   CDSFLAG                                                  01124000
CDSFEVOL EQU   CDSFLAG                                                  01125000
CDSSHAR  EQU   CDSFLAG                                                  01126000
CDSFPMD  EQU   CDSFLAG                                                  01127000
@NM00075 EQU   CDSFEAT                                                  01128000
CDSDEVM  EQU   CDSFEAT                                                  01129000
CDSDEVT  EQU   CDSFEAT                                                  01130000
CDSASCII EQU   CDSFEAT                                                  01131000
$CECFLAG EQU   CECOMMAP+20                                              01132000
$CEINCT  EQU   CECOMMAP+16                                              01133000
$CEINADR EQU   CECOMMAP+12                                              01134000
$CEOUTCT EQU   CECOMMAP+8                                               01135000
$CEOUTAD EQU   CECOMMAP+4                                               01136000
$CECIDNT EQU   CECOMMAP+2                                               01137000
$CECLEVL EQU   CECOMMAP+1                                               01138000
$CECTRMG EQU   CECOMMAP                                                 01139000
SVECC010 EQU   TOLTEPWA+3952                                            01140000
SVETC035 EQU   TOLTEPWA+3880                                            01141000
SVESC030 EQU   TOLTEPWA+3808                                            01142000
SVESC020 EQU   TOLTEPWA+3664                                            01143000
SVEIC002 EQU   TOLTEPWA+3520                                            01144000
SVECC014 EQU   TOLTEPWA+3376                                            01145000
SVESC120 EQU   TOLTEPWA+3304                                            01146000
SVESC025 EQU   TOLTEPWA+3088                                            01147000
@NM00074 EQU   TOLTEPWA+2980                                            01148000
$RPLERR  EQU   TOLTEPWA+2977                                            01149000
@NM00073 EQU   TOLTEPWA+2976                                            01150000
$R13PR3  EQU   TOLTEPWA+2972                                            01151000
$CEINT2  EQU   TOLTEPWA+2968                                            01152000
$CEINT1  EQU   TOLTEPWA+2964                                            01153000
$MSGGET  EQU   TOLTEPWA+2960                                            01154000
$ACQLIST EQU   TOLTEPWA+2956                                            01155000
$R4SAVE1 EQU   TOLTEPWA+2952                                            01156000
$CLSISS  EQU   TOLTEPWA+2950                                            01157000
$CLSCNT  EQU   TOLTEPWA+2948                                            01158000
$CUTABLE EQU   TOLTEPWA+2868                                            01159000
$BUFSZ2  EQU   TOLTEPWA+2864                                            01160000
$RESID2  EQU   TOLTEPWA+2860                                            01161000
$OLTCCW2 EQU   TOLTEPWA+2856                                            01162000
$ENDBFR2 EQU   TOLTEPWA+2852                                            01163000
$1STBFR2 EQU   TOLTEPWA+2848                                            01164000
$TECB2   EQU   TOLTEPWA+2844                                            01165000
$BUFSZ1  EQU   TOLTEPWA+2840                                            01166000
$RESID1  EQU   TOLTEPWA+2836                                            01167000
$OLTCCW1 EQU   TOLTEPWA+2832                                            01168000
$ENDBFR1 EQU   TOLTEPWA+2828                                            01169000
$1STBFR1 EQU   TOLTEPWA+2824                                            01170000
$TECB1   EQU   TOLTEPWA+2820                                            01171000
$WAITIME EQU   TOLTEPWA+2816                                            01172000
$TRTN#   EQU   TOLTEPWA+2815                                            01173000
$WIODEV  EQU   TOLTEPWA+2814                                            01174000
$RQSTSZE EQU   TOLTEPWA+2812                                            01175000
$RQSTPTR EQU   TOLTEPWA+2808                                            01176000
$R4SAVE  EQU   TOLTEPWA+2804                                            01177000
$PARTADR EQU   TOLTEPWA+2800                                            01178000
$TBSDATA EQU   TOLTEPWA+2796                                            01179000
$CTWIDTH EQU   TOLTEPWA+2795                                            01180000
$CTLINE  EQU   TOLTEPWA+2794                                            01181000
$APWIDTH EQU   TOLTEPWA+2793                                            01182000
$APLINE  EQU   TOLTEPWA+2792                                            01183000
$INDEX   EQU   $IMITX                                                   01184000
$UMXX    EQU   @NM00072+14                                              01185000
$NSXX    EQU   @NM00072+12                                              01186000
$ATACNT  EQU   $NSCNT                                                   01187000
$CTR     EQU   @NM00072+8                                               01188000
$ATAPTR  EQU   $NSPTR                                                   01189000
$DDRPTR  EQU   @NM00072                                                 01190000
$DTORESP EQU   TOLTEPWA+2712                                            01191000
$APNAME  EQU   TOLTEPWA+2704                                            01192000
$24SYMNE EQU   $24CATMG+4                                               01193000
$24DEVAD EQU   $24CATMG                                                 01194000
$24RTN#  EQU   $24FEMSG+8                                               01195000
$ESECTID EQU   $24FEMSG                                                 01196000
$24FLGS  EQU   TOLTEPWA+2680                                            01197000
$24SAVE2 EQU   TOLTEPWA+2676                                            01198000
$24SAVE1 EQU   TOLTEPWA+2672                                            01199000
$24UNADR EQU   TOLTEPWA+2668                                            01200000
$24SAV13 EQU   TOLTEPWA+2664                                            01201000
$24RETCD EQU   TOLTEPWA+2663                                            01202000
$MACID   EQU   TOLTEPWA+2661                                            01203000
$CSPARE  EQU   $CFLGS                                                   01204000
$C2WAY   EQU   $CFLGS                                                   01205000
$CINCT   EQU   $CCOMDAT+12                                              01206000
$CINADR  EQU   $CCOMDAT+8                                               01207000
$COUTCT  EQU   $CCOMDAT+4                                               01208000
$COUTAD  EQU   $CCOMDAT                                                 01209000
ROOTLOC  EQU   TOLTEPWA+2640                                            01210000
$RETREG  EQU   TOLTEPWA+2636                                            01211000
$WORK    EQU   TOLTEPWA+2376                                            01212000
$EXTA    EQU   TOLTEPWA+2320                                            01213000
$PASSONA EQU   TOLTEPWA+2264                                            01214000
$TRMINPT EQU   TOLTEPWA+2184                                            01215000
$TLTRPL3 EQU   TOLTEPWA+1856                                            01216000
$TLTRPL2 EQU   TOLTEPWA+1736                                            01217000
$TLTRPL1 EQU   TOLTEPWA+1616                                            01218000
@NM00071 EQU   $SLTBL+135                                               01219000
$HIGHRTN EQU   $SLTBL+134                                               01220000
$PRIMADR EQU   $SLTBL+130                                               01221000
$CTSTPT  EQU   $SLTBL+128                                               01222000
$TSTCNT  EQU   $SLTBL+126                                               01223000
$SECFLGS EQU   $SECLST+3                                                01224000
$SECTION EQU   $SECLST                                                  01225000
$SECACT  EQU   $TESTFLG                                                 01226000
$CANTRUN EQU   $TESTFLG                                                 01227000
$FINAL   EQU   $TESTFLG                                                 01228000
$TESTSUF EQU   $RUNTEST+5                                               01229000
$TESTNUM EQU   $RUNTEST+1                                               01230000
$LETPRF  EQU   $RUNTEST                                                 01231000
$SYMBOLC EQU   $SLTBL+5                                                 01232000
$FAMILY  EQU   $SLTBL                                                   01233000
$CDEVPT  EQU   TOLTEPWA+1466                                            01234000
$DEVCNTS EQU   TOLTEPWA+1464                                            01235000
$FEEDBCK EQU   $DEVTBLE+66                                              01236000
$WTISUED EQU   $DEVFLG4                                                 01237000
$EXIOISD EQU   $DEVFLG4                                                 01238000
$REMWRIT EQU   $DEVFLG4                                                 01239000
$REMDONE EQU   $DEVFLG4                                                 01240000
$2NDUSED EQU   $DEVFLG4                                                 01241000
$1STUSED EQU   $DEVFLG4                                                 01242000
$IGLXIFB EQU   $DEVFLG4                                                 01243000
$EXIOLV3 EQU   $DEVFLG4                                                 01244000
@NM00070 EQU   $DEVFLG5                                                 01245000
$DVBASIC EQU   $DEVFLG5                                                 01246000
$ASCII   EQU   $DEVFLG5                                                 01247000
$DEVLU   EQU   $DEVFLG5                                                 01248000
$OPNDFAL EQU   $DEVFLG5                                                 01249000
$ACQNCB  EQU   $DEVFLG5                                                 01250000
$REMOTE  EQU   $DEVFLG5                                                 01251000
$ENDNODE EQU   $DEVFLG5                                                 01252000
$LINENME EQU   $RNINFO                                                  01253000
$CID     EQU   $DEVTBLE+52                                              01254000
$DVCOL   EQU   $LDNCBPT+2                                               01255000
$DVROW   EQU   $LDNCBPT                                                 01256000
$NCSPLP  EQU   $DEVTBLE+44                                              01257000
$DVLN    EQU   $SSCPDAF                                                 01258000
$DAF     EQU   $DEVSESP+4                                               01259000
$VARYPAB EQU   $DEVSESP                                                 01260000
$SYSMN   EQU   $DEVTBLE+28                                              01261000
@NM00069 EQU   $DEVFLG3                                                 01262000
$CLRSNT  EQU   $DEVFLG3                                                 01263000
$OLTERR  EQU   $DEVFLG3                                                 01264000
$SRTEST  EQU   $DEVFLG3                                                 01265000
$DVSNDOK EQU   $SIOFLG                                                  01266000
$POLLREQ EQU   $DEVFLG3                                                 01267000
$ACQRED  EQU   $DEVFLG3                                                 01268000
$NOTDEV  EQU   $DEVFLG3                                                 01269000
$DVINCT  EQU   $DEVTBLE+26                                              01270000
$DVBRKST EQU   $OPND+1                                                  01271000
$DVBRKSN EQU   $OPND                                                    01272000
$DVSEQNO EQU   $OPIS                                                    01273000
$CEINTRP EQU   $DEVFLG2                                                 01274000
$TESTMDE EQU   $DEVFLG2                                                 01275000
$DEVALOC EQU   $DEVFLG2                                                 01276000
$ALLDATA EQU   $DEVFLG2                                                 01277000
$ENDCNTL EQU   $DEVFLG2                                                 01278000
$CTLDEV  EQU   $DEVFLG2                                                 01279000
$NOCDS   EQU   $DEVFLG2                                                 01280000
$DATAIN  EQU   $DEVFLG2                                                 01281000
$PRIMARY EQU   $DEVFLG1                                                 01282000
$DVCTBYT EQU   $INTOCC                                                  01283000
$DEVACT  EQU   $DEVFLG1                                                 01284000
$DVLGMDE EQU   $ATTNEXP                                                 01285000
$DVSPRM  EQU   $EVNCPLT                                                 01286000
$GRABBED EQU   $DEVFLG1                                                 01287000
$CATASTR EQU   $DEVFLG1                                                 01288000
$LETGO   EQU   $DEVFLG1                                                 01289000
$CURELEM EQU   $$SYMNME+4                                               01290000
$MSGOTSD EQU   $$SYMNME                                                 01291000
$EXTDEV  EQU   $DEVCDS+11                                               01292000
@NM00068 EQU   $DEVSDCF                                                 01293000
$NOTPRIM EQU   $DEVSDCF                                                 01294000
@NM00067 EQU   $DEVCDSF                                                 01295000
@NM00066 EQU   $DEVCDSF                                                 01296000
@NM00065 EQU   $DEVCDSF                                                 01297000
$CDSNAME EQU   $DEVCDSF                                                 01298000
$EXTRN   EQU   $DEVCDSF                                                 01299000
$CEVOLUM EQU   $DEVCDSF                                                 01300000
$SHARD   EQU   $DEVCDSF                                                 01301000
$DEVFPM  EQU   $DEVCDSF                                                 01302000
$DEVCNT  EQU   $DEVCDS+8                                                01303000
$DEVTYPE EQU   $DEVFEAT+3                                               01304000
$DEVCLAS EQU   $DEVFEAT+2                                               01305000
$DEVFRRS EQU   $DEVFEAT+1                                               01306000
$DEVMOD  EQU   $DEVFEAT                                                 01307000
$DEVRDGT EQU   @NM00063+1                                               01308000
$DEVCTLU EQU   @NM00063+1                                               01309000
$DEVCHAN EQU   @NM00063                                                 01310000
@NM00064 EQU   @NM00063                                                 01311000
$CTINDX  EQU   $DEVUNAD                                                 01312000
$FLAG16  EQU   $COMMFLG+15                                              01313000
$FLAG15  EQU   $COMMFLG+14                                              01314000
$FLAG14  EQU   $COMMFLG+13                                              01315000
$TEP2ND  EQU   $FLAG13                                                  01316000
$TEP1ST  EQU   $FLAG13                                                  01317000
$CATMSG  EQU   $FLAG13                                                  01318000
$PRMPTSW EQU   $FLAG13                                                  01319000
$DEVENT  EQU   $FLAG13                                                  01320000
$OLTMACC EQU   $FLAG13                                                  01321000
$LGON    EQU   $FLAG13                                                  01322000
$CTLOGON EQU   $FLAG13                                                  01323000
@NM00062 EQU   $FLAG12                                                  01324000
$VARYINP EQU   $FLAG12                                                  01325000
$ENDTEST EQU   $FLAG12                                                  01326000
$VRYHRD  EQU   $FLAG12                                                  01327000
$VRYSFT  EQU   $FLAG12                                                  01328000
$POSTFLG EQU   $FLAG12                                                  01329000
$OPTMSG  EQU   $FLAG12                                                  01330000
$FEORCAT EQU   $FLAG11                                                  01331000
@NM00061 EQU   $FLAG11                                                  01332000
@NM00060 EQU   $FLAG10                                                  01333000
$INBND   EQU   $FLAG10                                                  01334000
$WAITFLG EQU   $FLAG10                                                  01335000
$DPRINT  EQU   $FLAG10                                                  01336000
$HOLD    EQU   $FLAG9                                                   01337000
$NOTRRCH EQU   $FLAG9                                                   01338000
@NM00059 EQU   $FLAG9                                                   01339000
$LSTLNSW EQU   $FLAG9                                                   01340000
$MULLNSW EQU   $FLAG9                                                   01341000
$IGRES   EQU   $FLAG9                                                   01342000
$VS2     EQU   $FLAG8                                                   01343000
$VS1     EQU   $FLAG8                                                   01344000
$EDOS    EQU   $FLAG8                                                   01345000
@NM00058 EQU   $FLAG8                                                   01346000
$TWOWAY  EQU   $FLAG8                                                   01347000
@NM00057 EQU   $FLAG8                                                   01348000
$RCVMSG  EQU   $FLAG7                                                   01349000
$RCVRFLG EQU   $FLAG7                                                   01350000
$SNDRFLG EQU   $FLAG7                                                   01351000
$LDOIS   EQU   $FLAG7                                                   01352000
$DCONTCT EQU   $FLAG7                                                   01353000
$EXIOWAT EQU   $FLAG7                                                   01354000
$2NDDATA EQU   $FLAG7                                                   01355000
$1STDATA EQU   $FLAG7                                                   01356000
$CIREQ   EQU   $FLAG6                                                   01357000
$ABTERM  EQU   $ABNDBIT                                                 01358000
$FSTMCIS EQU   $FLAG6                                                   01359000
$DISCREQ EQU   $FLAG6                                                   01360000
$DISCISS EQU   $FLAG6                                                   01361000
$CTERROR EQU   $FLAG6                                                   01362000
$RECAL11 EQU   $FLAG6                                                   01363000
@NM00056 EQU   $FLAG5                                                   01364000
$PROGCK  EQU   $CANCEL                                                  01365000
$PRINTAP EQU   $FLAG5                                                   01366000
@NM00055 EQU   $FLAG5                                                   01367000
$MSG922  EQU   $FLAG5                                                   01368000
$CT924   EQU   $FLAG5                                                   01369000
$FSTCAT  EQU   $FLAG5                                                   01370000
$FSTFE   EQU   $FLAG5                                                   01371000
$ACTOPND EQU   $FLAG4                                                   01372000
$ACQCUTT EQU   $FLAG4                                                   01373000
$CLSSACT EQU   $FLAG4                                                   01374000
$BACKINT EQU   $FLAG4                                                   01375000
$DMSGSW  EQU   $FLAG4                                                   01376000
$TSTDEVP EQU   $FLAG4                                                   01377000
$APRQPER EQU   $FLAG4                                                   01378000
$OPCOM   EQU   $FLAG4                                                   01379000
$NEWAP   EQU   $FLAG3                                                   01380000
$ALTPRTR EQU   $FLAG3                                                   01381000
$OPTERR  EQU   $FLAG3                                                   01382000
$PRTONLY EQU   $FLAG3                                                   01383000
$REQSTOR EQU   $FLAG3                                                   01384000
$LOGOFFE EQU   $FLAG3                                                   01385000
$TSTERR  EQU   $FLAG3                                                   01386000
$DEVERR  EQU   $FLAG3                                                   01387000
$PARTIAL EQU   $FLAG2                                                   01388000
$NRMTERM EQU   $FLAG2                                                   01389000
$VALDTST EQU   $FLAG2                                                   01390000
$VALDDEV EQU   $FLAG2                                                   01391000
$DBLSLSH EQU   $FLAG2                                                   01392000
$NDR     EQU   $FLAG2                                                   01393000
@NM00054 EQU   $FLAG2                                                   01394000
$FTTHR   EQU   $FLAG2                                                   01395000
$OLTACT  EQU   $FLAG1                                                   01396000
$NORELDV EQU   $FLAG1                                                   01397000
@NM00053 EQU   $FLAG1                                                   01398000
$OPTCHNG EQU   $FLAG1                                                   01399000
$DEVCHNG EQU   $FLAG1                                                   01400000
$TESTCNG EQU   $FLAG1                                                   01401000
$CNSLFG  EQU   $FLAG1                                                   01402000
$TEP3RD  EQU   $FLAG1                                                   01403000
@NM00052 EQU   $CDA+120                                                 01404000
$CUCNT   EQU   $CDA+118                                                 01405000
@NM00051 EQU   $CDA+117                                                 01406000
$PRTFORM EQU   $CDA+116                                                 01407000
$OPISCNT EQU   $CDA+114                                                 01408000
$OPNDCNT EQU   $CDA+112                                                 01409000
$GETMSZE EQU   $CDA+110                                                 01410000
$GRCNTS  EQU   $CDA+108                                                 01411000
$CTLCNT  EQU   $CDA+106                                                 01412000
$ACTLVL  EQU   $CDA+105                                                 01413000
$PRNTLVL EQU   $CDA+104                                                 01414000
$ERRCNTA EQU   $CDA+102                                                 01415000
$TLCNT   EQU   $CDA+100                                                 01416000
$TIMEALW EQU   $CDA+96                                                  01417000
$PTRAREA EQU   $CDA+92                                                  01418000
$GETMPTR EQU   $CDA+88                                                  01419000
$R13PTRT EQU   $CDA+84                                                  01420000
$R13PTR  EQU   $CDA+80                                                  01421000
$TEPEND  EQU   $CDA+76                                                  01422000
$PLINKDL EQU   $CDA+72                                                  01423000
$TEPBEGN EQU   $CDA+68                                                  01424000
$FRELPTR EQU   $CDA+64                                                  01425000
$HIGHADR EQU   $HIMOREC                                                 01426000
$LOMOREC EQU   $CDA+56                                                  01427000
$ENDCOMM EQU   $CDA+48                                                  01428000
$COMMON  EQU   $RCA                                                     01429000
$SLASHAD EQU   $CDA+32                                                  01430000
$PASSON  EQU   $CDA+28                                                  01431000
$TOLBRTB EQU   $CDA+24                                                  01432000
$SCTPTR8 EQU   $CDA+20                                                  01433000
$SCTPTR  EQU   $CDA+16                                                  01434000
$TBWDPTR EQU   $CDA+12                                                  01435000
$TFWDPTR EQU   $CDA+8                                                   01436000
@NM00050 EQU   $CDA                                                     01437000
@NM00049 EQU   $SCTTBLE+98                                              01438000
$SCTLWTC EQU   $SCTTBLE+96                                              01439000
$SCTLWTA EQU   $SCTTBLE+92                                              01440000
#EXT     EQU   $SCTTBLE+88                                              01441000
#PASS    EQU   $SCTTBLE+84                                              01442000
#TABLE   EQU   $SCTTBLE+80                                              01443000
#MSGIDAC EQU   $SCTTBLE+78                                              01444000
@NM00048 EQU   $SCTTBLE+71                                              01445000
$RETMASK EQU   $SCTTBLE+70                                              01446000
$R249255 EQU   $ROUTMSK+29                                              01447000
$R241248 EQU   $ROUTMSK+28                                              01448000
$R233240 EQU   $ROUTMSK+27                                              01449000
$R225232 EQU   $ROUTMSK+26                                              01450000
$R217224 EQU   $ROUTMSK+25                                              01451000
$R209216 EQU   $ROUTMSK+24                                              01452000
$R201208 EQU   $ROUTMSK+23                                              01453000
$R193200 EQU   $ROUTMSK+22                                              01454000
$R185192 EQU   $ROUTMSK+21                                              01455000
$R177184 EQU   $ROUTMSK+20                                              01456000
$R169176 EQU   $ROUTMSK+19                                              01457000
$R161168 EQU   $ROUTMSK+18                                              01458000
$R153160 EQU   $ROUTMSK+17                                              01459000
$R145152 EQU   $ROUTMSK+16                                              01460000
$R137144 EQU   $ROUTMSK+15                                              01461000
$R129136 EQU   $ROUTMSK+14                                              01462000
$R121128 EQU   $ROUTMSK+13                                              01463000
$R113120 EQU   $ROUTMSK+12                                              01464000
$R105112 EQU   $ROUTMSK+11                                              01465000
$R097104 EQU   $ROUTMSK+10                                              01466000
$R089096 EQU   $ROUTMSK+9                                               01467000
$R081088 EQU   $ROUTMSK+8                                               01468000
$R073080 EQU   $ROUTMSK+7                                               01469000
$R065072 EQU   $ROUTMSK+6                                               01470000
$R057064 EQU   $ROUTMSK+5                                               01471000
$R049056 EQU   $ROUTMSK+4                                               01472000
$R041048 EQU   $ROUTMSK+3                                               01473000
$R033040 EQU   $ROUTMSK+2                                               01474000
$R025032 EQU   $ROUTMSK+1                                               01475000
$R017024 EQU   $ROUTMSK                                                 01476000
$TOTFLG2 EQU   $SCTTBLE+39                                              01477000
@NM00047 EQU   $TOTFLG1                                                 01478000
@NM00046 EQU   $TOTFLG1                                                 01479000
@NM00045 EQU   $TOTFLG1                                                 01480000
$CURELOD EQU   $TOTFLG1                                                 01481000
$CTEQTT  EQU   $TOTFLG1                                                 01482000
@NM00044 EQU   $TOTFLG1                                                 01483000
@NM00043 EQU   $TOTFLG1                                                 01484000
$LINESHR EQU   $TOTFLG1                                                 01485000
@NM00042 EQU   $OLTFLG2                                                 01486000
@NM00041 EQU   $OLTFLG2                                                 01487000
@NM00040 EQU   $OLTFLG2                                                 01488000
@NM00039 EQU   $OLTFLG2                                                 01489000
@NM00038 EQU   $OLTFLG2                                                 01490000
@NM00037 EQU   $OLTFLG2                                                 01491000
@NM00036 EQU   $OLTFLG2                                                 01492000
$TALK    EQU   $OLTFLG2                                                 01493000
$DYCOM   EQU   $OLTFLGS                                                 01494000
@NM00035 EQU   $OLTFLGS                                                 01495000
$TRACE   EQU   $OLTFLGS                                                 01496000
$RETCODE EQU   $OLTFLGS                                                 01497000
$CONTCB  EQU   $OLTFLGS                                                 01498000
$RETAIN  EQU   $OLTFLGS                                                 01499000
$CLEANRT EQU   $OLTFLGS                                                 01500000
$MANINTV EQU   $OLTFLGS                                                 01501000
$OLTSIZE EQU   $SCTTBLE+34                                              01502000
$QSCTMOD EQU   $EXECFLG                                                 01503000
$CTRLMOD EQU   $EXECFLG                                                 01504000
$CLEANUP EQU   $EXECFLG                                                 01505000
$LSTPDEV EQU   $EXECFLG                                                 01506000
$ERRCNT  EQU   $EXECFLG                                                 01507000
$RTNSLCT EQU   $EXECFLG                                                 01508000
$MULTDEV EQU   $EXECFLG                                                 01509000
@NM00034 EQU   $EXECFLG                                                 01510000
$RMSKCNT EQU   $SCTTBLE+32                                              01511000
$SYNAME  EQU   $CDS8T19+4                                               01512000
$EXTSIG  EQU   $CDS8T19+3                                               01513000
$CDFLGS  EQU   $CDS8T19+1                                               01514000
$CDSCNT  EQU   $CDS8T19                                                 01515000
$PDEVDSC EQU   $SCTTBLE+16                                              01516000
$PDEVADR EQU   $SCTTBLE+12                                              01517000
$COMMCN  EQU   $CDSFLGS                                                 01518000
$CUSTSYM EQU   $CDSFLGS                                                 01519000
$TWOCHSW EQU   $CDSFLGS                                                 01520000
$SYMNAME EQU   $CDSFLGS                                                 01521000
$EXTINTC EQU   $CDSFLGS                                                 01522000
$CEVOL   EQU   $CDSFLGS                                                 01523000
$SHARED  EQU   $CDSFLGS                                                 01524000
$FPM     EQU   $CDSFLGS                                                 01525000
$LASTSUB EQU   $PDEVFLG                                                 01526000
@NM00033 EQU   $PDEVFLG                                                 01527000
@NM00032 EQU   $PDEVFLG                                                 01528000
@NM00031 EQU   $PDEVFLG                                                 01529000
$LASTDEV EQU   $PDEVFLG                                                 01530000
@NM00030 EQU   $PDEVFLG                                                 01531000
$EXFILPT EQU   $PDEVFLG                                                 01532000
$FPMOLD  EQU   $PDEVFLG                                                 01533000
$TSSSYM  EQU   $SCTTBLE+8                                               01534000
$SCTLEVL EQU   $SCTTBLE+7                                               01535000
$DRIVER  EQU   $SCTTBLE+6                                               01536000
$RT0916  EQU   $SCTTBLE+5                                               01537000
$RT0108  EQU   $SCTTBLE+4                                               01538000
$LOOPTST EQU   $ERROPT                                                  01539000
$LOOPERR EQU   $ERROPT                                                  01540000
$NERRPRT EQU   $ERROPT                                                  01541000
$NOCNTRL EQU   $ERROPT                                                  01542000
$ALTPRNT EQU   $ERROPT                                                  01543000
$CATERR  EQU   $ERROPT                                                  01544000
$ASTERIK EQU   $ERROPT                                                  01545000
$TESTERR EQU   $ERROPT                                                  01546000
$FSTCOMM EQU   $TESTOPT                                                 01547000
$INDEFLP EQU   $TESTOPT                                                 01548000
$NOPRT   EQU   $TESTOPT                                                 01549000
$PARAPRT EQU   $TESTOPT                                                 01550000
@NM00029 EQU   $TESTOPT                                                 01551000
$ERRLPCT EQU   $SCTTBLE                                                 01552000
$TLTEND  EQU   $RCAAREA+945                                             01553000
$CNSLID  EQU   $RCAAREA+936                                             01554000
$EXITSAV EQU   $RCAAREA+864                                             01555000
$TRASCII EQU   $RCAAREA+608                                             01556000
@NM00028 EQU   $RCAAREA+605                                             01557000
$VTAMEND EQU   $RCAFLG                                                  01558000
$TPPOSTD EQU   $RCAFLG                                                  01559000
$NEWCT   EQU   $RCAFLG                                                  01560000
$ABNDALL EQU   $RCAFLG                                                  01561000
$CUTESTB EQU   $RCAFLG                                                  01562000
$CONSOLE EQU   $RCAFLG                                                  01563000
$TPLOGON EQU   $RCAFLG                                                  01564000
$UPDATE  EQU   $RCAFLG                                                  01565000
$DEVAREA EQU   $RCAAREA+600                                             01566000
$CTDVAR  EQU   $RCAAREA+596                                             01567000
$BUFFS   EQU   $RCAAREA+464                                             01568000
$TLTNIB  EQU   $CONSTNT+140                                             01569000
$TLTPRPL EQU   $CONSTNT+20                                              01570000
@NM00027 EQU   $CONSTNT+4                                               01571000
@NM00026 EQU   $CONSTNT+2                                               01572000
$USECNT  EQU   $CONSTNT                                                 01573000
$CURRTWA EQU   $POINTER+140                                             01574000
$CTNAME  EQU   $POINTER+132                                             01575000
$CTARGX  EQU   $POINTER+128                                             01576000
$COMINT  EQU   $POINTER+120                                             01577000
$QUEHNDL EQU   $POINTER+116                                             01578000
@NM00025 EQU   $POINTER+36                                              01579000
$RTNPTR  EQU   $POINTER+32                                              01580000
$TLTECB2 EQU   $POINTER+28                                              01581000
$TLTECB1 EQU   $POINTER+24                                              01582000
$CLEANP  EQU   $POINTER+20                                              01583000
$ABEND   EQU   $POINTER+16                                              01584000
$LSTAREA EQU   $POINTER+12                                              01585000
$FSTAREA EQU   $POINTER+8                                               01586000
$CVTSAVE EQU   $POINTER+4                                               01587000
$TOLTEP  EQU   $POINTER                                                 01588000
$TLTACB  EQU   $RCAAREA                                                 01589000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01590000
@RT00096 EQU   I006C02                                                  01591000
@RF00149 EQU   I006C01                                                  01592000
I006C02A EQU   I006C01                                                  01593000
I006CRET EQU   @EL00001                                                 01594000
@RT00173 EQU   I006C04                                                  01595000
@RT00245 EQU   I006C02A                                                 01596000
@RT00254 EQU   I006C02A                                                 01597000
@RT00263 EQU   I006C05                                                  01598000
@RT00277 EQU   I006C02A                                                 01599000
@RT00087 EQU   I006CRET                                                 01600000
@ENDDATA EQU   *                                                        01601000
         END   ISTIC006,(C'PLS2011',0702,79129)                         01602000
