         TITLE '     ISTINCIT - INITIALIZATION CONTROL'                 00001000
ISTINCIT CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTINCIT  78.336'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         PRINT OFF                                                      00017000
         PRINT ON                                                       00018000
*                                                                  0173 00019000
*/* END OF ATBUILD */                /* @ZA03720*/                 0173 00020000
*/*------------------------------------------------------------------*/ 00021000
*/* THHIS MODULE INVOKS VTAM INITALIZATION MODULES                   */ 00022000
*/*-----------------------------------------------------------------*/  00023000
*                                                                  0173 00024000
*                                                                  0173 00025000
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(ATCVTPTR)) */                 0173 00026000
*    ATCVTPTR = ATCLCPTR; /*SET UP ATCVT POINTER*/                 0174 00027000
         L     ATCVTPTR,ATCLCPTR                                   0174 00028000
*  END; /*LISATCVT*/        /*         @ZA03720*/                  0175 00029000
*        RFY ISTATCVT BASED (ATCVTPTR);                            0176 00030000
*        RFY ISTCONFT BASED (ATCCONFT);                            0177 00031000
*        CONF01SV = CHASAVE;                                       0178 00032000
         L     @14,ATCCONFT(,ATCVTPTR)                             0178 00033000
         L     @05,CHASAVE(,CITR13)                                0178 00034000
         ST    @05,CONF01SV(,@14)                                  0178 00035000
*        CALL  ISTINCIB;           /* LINK TO BASIC INITIALIZATION 0179 00036000
*                                     ROUTINE TO ESTABLISH BASE    0179 00037000
*                                     ENVIORNMENT                    */ 00038000
         L     @15,@CV01460                                        0179 00039000
         BALR  @14,@15                                             0179 00040000
*        IF  CITR15=0  THEN        /*    RETURN CODE EQUAL ZERO?    */  00041000
         LTR   CITR15,CITR15                                       0180 00042000
         BNZ   @RF00180                                            0180 00043000
*              CONSTAFP='7FFFFFFF'X; /* INDICATE CALL CRR   @ZA03720*/  00044000
         L     @14,ATCCONFT(,ATCVTPTR)                             0181 00045000
         MVC   CONSTAFP(4,@14),@CF00108                            0181 00046000
*            ELSE GOTO CITTREL;    /* NO-GO TO RELEASE RESOURCES RTN */ 00047000
*        CALL  ISTINCCC;           /*YES-LINK TO THE CONFIGURATION 0183 00048000
*                                         CONTROL RTN TO PROCESS   0183 00049000
*                                         OPTION PARAMETERS        */   00050000
         L     @15,@CV01462                                        0183 00051000
         BALR  @14,@15                                             0183 00052000
*        IF  CITR15=0  THEN;        /* RETURN CODE EQUAL ZERO?    */    00053000
         LTR   CITR15,CITR15                                       0184 00054000
         BNZ   @RF00184                                            0184 00055000
*            ELSE GOTO CITTREL;     /*NO-GO TO RELEASE RESOURCES RTN */ 00056000
*        CALL  ISTINCCF;            /*YES-LINK TO THE CONFIGURATION     00057000
*                                         ROUTINE                    */ 00058000
         L     @15,@CV01463                                        0187 00059000
         BALR  @14,@15                                             0187 00060000
*        IF  CITR15=0  THEN;        /* RETURN CODE EQUAL ZERO?    */    00061000
         LTR   CITR15,CITR15                                       0188 00062000
         BNZ   @RF00188                                            0188 00063000
*            ELSE GOTO CITTREL;     /*NO-GO TO RELEASE RESOURCES RTN */ 00064000
*        CALL  ISTINCOS;            /*YES-LINK TO THE OPTIONAL SERVICES 00065000
*                                         ROUTINE TO PROCESS OPTIONS */ 00066000
         L     @15,@CV01464                                        0191 00067000
         BALR  @14,@15                                             0191 00068000
*        IF  CITR15=0  THEN            /* RETURN CODE EQUAL ZERO?    */ 00069000
         LTR   CITR15,CITR15                                       0192 00070000
         BNZ   @RF00192                                            0192 00071000
*              CALL  ISTINCAW;      /*YES-LINK TO TASK CONTROL RTN   */ 00072000
         L     @15,@CV01465                                        0193 00073000
         BALR  @14,@15                                             0193 00074000
*            ELSE                                                  0194 00075000
*        CITTREL:       CALL ISTINCRR; /*NO-LINK TO THE RELEASE    0194 00076000
*                                        RESOURCES ROUTINE           */ 00077000
*                                                                  0194 00078000
         B     @RC00192                                            0194 00079000
@RF00192 DS    0H                                                  0194 00080000
CITTREL  L     @15,@CV01466                                        0194 00081000
         BALR  @14,@15                                             0194 00082000
* DO; /* TPEPILOG   */                                             0195 00083000
@RC00192 DS    0H                                                  0196 00084000
*                                                                  0196 00085000
* GEN (PRINT OFF);                                                 0196 00086000
         PRINT OFF                                                      00087000
* GEN (PRINT ON);                                                  0197 00088000
         PRINT ON                                                       00089000
* END;/* TPEPILOG */                                               0198 00090000
*        END;                                                      0199 00091000
@EL00001 L     @13,4(,@13)                                         0199 00092000
@EF00001 DS    0H                                                  0199 00093000
@ER00001 LM    @14,@12,12(@13)                                     0199 00094000
         BR    @14                                                 0199 00095000
@DATA    DS    0H                                                       00096000
         DS    0F                                                       00097000
@SA00001 DS    18F                                                      00098000
         DS    0F                                                       00099000
@CF00108 DC    XL4'7FFFFFFF'                                            00100000
@CV01460 DC    V(ISTINCIB)                                              00101000
@CV01462 DC    V(ISTINCCC)                                              00102000
@CV01463 DC    V(ISTINCCF)                                              00103000
@CV01464 DC    V(ISTINCOS)                                              00104000
@CV01465 DC    V(ISTINCAW)                                              00105000
@CV01466 DC    V(ISTINCRR)                                              00106000
         DS    0D                                                       00107000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00108000
@01      EQU   01                                                       00109000
@02      EQU   02                                                       00110000
@03      EQU   03                                                       00111000
@04      EQU   04                                                       00112000
@05      EQU   05                                                       00113000
@06      EQU   06                                                       00114000
@07      EQU   07                                                       00115000
@08      EQU   08                                                       00116000
@09      EQU   09                                                       00117000
@10      EQU   10                                                       00118000
@11      EQU   11                                                       00119000
@12      EQU   12                                                       00120000
@13      EQU   13                                                       00121000
@14      EQU   14                                                       00122000
@15      EQU   15                                                       00123000
ATCVTPTR EQU   @04                                                      00124000
CITR13   EQU   @13                                                      00125000
CITR15   EQU   @15                                                      00126000
RPHPTR   EQU   @01                                                      00127000
LDPRMPTR EQU   @01                                                      00128000
ATCLCPTR EQU   1032                                                     00129000
CITSAVE  EQU   0                                                        00130000
CHASAVE  EQU   CITSAVE+4                                                00131000
ISTLOK   EQU   0                                                        00132000
LOKCHN   EQU   ISTLOK+1                                                 00133000
LOKCHNG  EQU   LOKCHN                                                   00134000
@NM00003 EQU   LOKCHNG+2                                                00135000
ISTPAB   EQU   0                                                        00136000
PABWQCHN EQU   ISTPAB                                                   00137000
PABWEQA  EQU   PABWQCHN                                                 00138000
PABCHAIN EQU   PABWQCHN+4                                               00139000
PABRUNNG EQU   PABCHAIN                                                 00140000
PABRPHFG EQU   ISTPAB+12                                                00141000
PABFLAGS EQU   PABRPHFG                                                 00142000
PABERLCK EQU   PABFLAGS                                                 00143000
PABERRLK EQU   PABERLCK                                                 00144000
PABEND   EQU   ISTPAB+16                                                00145000
ISTDYPAB EQU   0                                                        00146000
DYPCHAIN EQU   ISTDYPAB+4                                               00147000
DYPPACMD EQU   ISTDYPAB+12                                              00148000
ISTRPH   EQU   0                                                        00149000
RPHCNTL  EQU   ISTRPH                                                   00150000
RPHFLAGS EQU   RPHCNTL+2                                                00151000
RPHFSTLC EQU   RPHFLAGS                                                 00152000
RPHFLGB  EQU   RPHCNTL+3                                                00153000
RPHRPHA  EQU   ISTRPH+4                                                 00154000
RPHTSKID EQU   ISTRPH+8                                                 00155000
RPHRESMA EQU   ISTRPH+16                                                00156000
RPHWPFLG EQU   RPHRESMA                                                 00157000
RPHWEA   EQU   ISTRPH+24                                                00158000
RPHCSPA  EQU   RPHWEA                                                   00159000
RPHSRPRM EQU   ISTRPH+28                                                00160000
RPHPABQA EQU   ISTRPH+36                                                00161000
RPHWORK  EQU   ISTRPH+40                                                00162000
RPHSAVE1 EQU   RPHWORK                                                  00163000
RPHSBITS EQU   RPHSAVE1+1                                               00164000
ISTATCVT EQU   0                                                        00165000
ATCRPTCH EQU   ISTATCVT                                                 00166000
ATCITFLD EQU   ISTATCVT+8                                               00167000
ATCITCDS EQU   ATCITFLD+8                                               00168000
ATCITFLG EQU   ATCITCDS+4                                               00169000
ATCITRA1 EQU   ATCITFLG+2                                               00170000
ATCSMPAB EQU   ISTATCVT+88                                              00171000
ATCVDPAB EQU   ISTATCVT+152                                             00172000
ATCLDTIL EQU   ISTATCVT+408                                             00173000
ATCGTSTR EQU   ISTATCVT+608                                             00174000
ATCLUDVT EQU   ISTATCVT+768                                             00175000
ATCANYDT EQU   ISTATCVT+776                                             00176000
@NM00013 EQU   ISTATCVT+780                                             00177000
ATCPODVT EQU   ISTATCVT+804                                             00178000
ATCCONFT EQU   ISTATCVT+916                                             00179000
ATCSTAT  EQU   ISTATCVT+936                                             00180000
ATCSTAT1 EQU   ATCSTAT                                                  00181000
ATCPOFLG EQU   ATCSTAT+2                                                00182000
ATCSTAT4 EQU   ATCSTAT+3                                                00183000
ATCBITAN EQU   ISTATCVT+940                                             00184000
ATCFLAG2 EQU   ATCBITAN+1                                               00185000
ATCONID  EQU   ISTATCVT+944                                             00186000
ATCSSCPA EQU   ISTATCVT+948                                             00187000
ATCHPGM  EQU   ISTATCVT+1012                                            00188000
ATCVLCNT EQU   ISTATCVT+1016                                            00189000
ATCRNO   EQU   ISTATCVT+1020                                            00190000
@NM00036 EQU   ISTATCVT+1028                                            00191000
ATCSHRFG EQU   @NM00036+8                                               00192000
ATCCPDVT EQU   ISTATCVT+1096                                            00193000
ATCSMSDQ EQU   ISTATCVT+1140                                            00194000
ATCRID   EQU   ISTATCVT+1152                                            00195000
ATCLDAPP EQU   ISTATCVT+1288                                            00196000
ATCSQAFR EQU   ISTATCVT+1312                                            00197000
ATCORTCB EQU   ATCSQAFR+4                                               00198000
ATCORSRB EQU   ATCORTCB                                                 00199000
ATCICAPP EQU   ISTATCVT+1320                                            00200000
ATCDAPVT EQU   ISTATCVT+1340                                            00201000
ATCGSRBQ EQU   ISTATCVT+1472                                            00202000
ATCGSRBG EQU   ATCGSRBQ                                                 00203000
ATCENFLG EQU   ISTATCVT+1512                                            00204000
@NM00051 EQU   ISTATCVT+1575                                            00205000
ATCVTFLG EQU   ISTATCVT+1576                                            00206000
ATCZFLAG EQU   ISTATCVT+1696                                            00207000
ATCCRA   EQU   ISTATCVT+1720                                            00208000
ATCCRACN EQU   ATCCRA+4                                                 00209000
ATCSRB   EQU   ISTATCVT+1728                                            00210000
ATCSRBCN EQU   ATCSRB+4                                                 00211000
ATCCRPL  EQU   ISTATCVT+1736                                            00212000
ATCRPLCN EQU   ATCCRPL+4                                                00213000
ISTSRT   EQU   0                                                        00214000
SRTSRTE  EQU   ISTSRT+8                                                 00215000
SRTXTNBS EQU   ISTSRT+13                                                00216000
ISTDEVCH EQU   0                                                        00217000
DEVSHCH  EQU   ISTDEVCH                                                 00218000
DEVCHAR  EQU   DEVSHCH                                                  00219000
DEVTCODE EQU   ISTDEVCH+1                                               00220000
DEVFLAGS EQU   ISTDEVCH+3                                               00221000
DEVFCCTL EQU   DEVFLAGS                                                 00222000
DEVCHAR3 EQU   DEVFLAGS                                                 00223000
DEVMODE  EQU   ISTDEVCH+5                                               00224000
ISTRPRE  EQU   0                                                        00225000
RPRSRTHD EQU   ISTRPRE                                                  00226000
RPRDAFID EQU   ISTRPRE+16                                               00227000
RPRSTATE EQU   ISTRPRE+56                                               00228000
RPRCURST EQU   RPRSTATE                                                 00229000
RPRDESST EQU   RPRSTATE+2                                               00230000
RPRBITAN EQU   ISTRPRE+61                                               00231000
ISTRCPRE EQU   0                                                        00232000
RCPSARRY EQU   ISTRCPRE+84                                              00233000
RCPPACE  EQU   ISTRCPRE+108                                             00234000
RCPNCPPC EQU   ISTRCPRE+110                                             00235000
RCPPMODE EQU   ISTRCPRE+113                                             00236000
RCPCYMOD EQU   RCPPMODE                                                 00237000
RCPCYSET EQU   RCPPMODE                                                 00238000
RCPSESSM EQU   ISTRCPRE+115                                             00239000
RCPBITAN EQU   ISTRCPRE+116                                             00240000
ISTRAP   EQU   0                                                        00241000
RAPBITAN EQU   ISTRAP+165                                               00242000
ISTLDPRM EQU   0                                                        00243000
LDPFG    EQU   ISTLDPRM+20                                              00244000
LDPFB2   EQU   ISTLDPRM+21                                              00245000
ISTUILTE EQU   0                                                        00246000
ISTSMHDR EQU   0                                                        00247000
SMHCHAR  EQU   ISTSMHDR+8                                               00248000
ISTSCHDR EQU   0                                                        00249000
SCHCHAR  EQU   ISTSCHDR                                                 00250000
ISTECB   EQU   0                                                        00251000
@NM00096 EQU   ISTECB                                                   00252000
ISTRCDRM EQU   0                                                        00253000
RCDRMPDN EQU   ISTRCDRM+184                                             00254000
RCDRMRPQ EQU   ISTRCDRM+192                                             00255000
RCDRMFGS EQU   ISTRCDRM+204                                             00256000
ISTRDT   EQU   0                                                        00257000
RDTPLEN  EQU   ISTRDT+84                                                00258000
RDTPRIOR EQU   RDTPLEN                                                  00259000
RDTBITAN EQU   ISTRDT+113                                               00260000
RDTCRIA  EQU   ISTRDT+116                                               00261000
ISTCONFT EQU   0                                                        00262000
CONSTAFP EQU   ISTCONFT+100                                             00263000
CONF01SV EQU   ISTCONFT+116                                             00264000
CONECBAA EQU   ISTCONFT+136                                             00265000
CONSBFAA EQU   ISTCONFT+140                                             00266000
CONDBFAA EQU   ISTCONFT+144                                             00267000
CONVTHAA EQU   ISTCONFT+148                                             00268000
CONPUNAA EQU   ISTCONFT+152                                             00269000
CONTOLAA EQU   ISTCONFT+156                                             00270000
CONTRCAA EQU   ISTCONFT+160                                             00271000
CONNETAA EQU   ISTCONFT+164                                             00272000
CONUSSAA EQU   ISTCONFT+168                                             00273000
CONRVYAA EQU   ISTCONFT+172                                             00274000
CONSCPAA EQU   ISTCONFT+176                                             00275000
CONFNSAA EQU   ISTCONFT+180                                             00276000
CONFTRAA EQU   ISTCONFT+184                                             00277000
CONFLDAA EQU   ISTCONFT+188                                             00278000
CONFXXAA EQU   ISTCONFT+192                                             00279000
CONFTTAA EQU   ISTCONFT+196                                             00280000
CONTUNAA EQU   ISTCONFT+200                                             00281000
CONCDPAA EQU   ISTCONFT+204                                             00282000
CONTDPAA EQU   ISTCONFT+208                                             00283000
CONAREAA EQU   ISTCONFT+212                                             00284000
CONSRTAA EQU   ISTCONFT+216                                             00285000
CONEND   EQU   ISTCONFT+232                                             00286000
CONVARA  EQU   0                                                        00287000
CONAREAS EQU   CONVARA                                                  00288000
CONFLG01 EQU   CONAREAS                                                 00289000
CONHALT  EQU   CONAREAS+8                                               00290000
CONFLAGS EQU   CONAREAS+12                                              00291000
CONDSFLG EQU   CONFLAGS                                                 00292000
CONOPTFL EQU   CONFLAGS+1                                               00293000
CONSTAT  EQU   CONFLAGS+2                                               00294000
CONBUFF  EQU   CONFLAGS+3                                               00295000
CONSCPID EQU   CONAREAS+26                                              00296000
CONSTAID EQU   CONSCPID+3                                               00297000
CONDYPA  EQU   CONVARA+56                                               00298000
CONRDTA  EQU   CONVARA+120                                              00299000
CONLDPA  EQU   CONVARA+1572                                             00300000
CONECBA  EQU   CONVARA+1812                                             00301000
CONBUFA  EQU   CONVARA+1852                                             00302000
CONSRTA  EQU   CONVARA+2236                                             00303000
CONECBL  EQU   0                                                        00304000
CONSBFA  EQU   0                                                        00305000
CONDBFA  EQU   0                                                        00306000
ISTAVT   EQU   0                                                        00307000
ISTRETRG EQU   ISTAVT+44                                                00308000
CONCDRMP EQU   0                                                        00309000
CONFLDAT EQU   0                                                        00310000
CONFNSAT EQU   0                                                        00311000
CONFTRAT EQU   0                                                        00312000
CONFTTAT EQU   0                                                        00313000
CONFXXAT EQU   0                                                        00314000
CONNTSOL EQU   0                                                        00315000
CONRECON EQU   0                                                        00316000
CONSRTE  EQU   0                                                        00317000
CONTERMP EQU   0                                                        00318000
CONTOLTP EQU   0                                                        00319000
CONTRACE EQU   0                                                        00320000
CONTUNAT EQU   0                                                        00321000
CONUILTA EQU   0                                                        00322000
CONUSNOP EQU   0                                                        00323000
CONVPUNS EQU   0                                                        00324000
CONVTHDR EQU   0                                                        00325000
CONVVTAM EQU   0                                                        00326000
ISTXDYP  EQU   0                                                        00327000
ISTXPAB  EQU   0                                                        00328000
PABXTNSN EQU   PABEND                                                   00329000
SRTXTNSN EQU   SRTXTNBS                                                 00330000
RCPSIBQ  EQU   RCPSARRY                                                 00331000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00332000
SRTDATA  EQU   SRTXTNSN+3                                               00333000
SRTUSELN EQU   SRTXTNSN+1                                               00334000
SRTFLAGS EQU   SRTXTNSN                                                 00335000
@NM00005 EQU   PABXTNSN+12                                              00336000
PABNPSSQ EQU   PABXTNSN+8                                               00337000
PABLOCK  EQU   PABXTNSN+4                                               00338000
PABLAST  EQU   PABXTNSN                                                 00339000
ISTRETR7 EQU   ISTRETRG+4                                               00340000
ISTRETR6 EQU   ISTRETRG                                                 00341000
ISTRSV01 EQU   ISTAVT+42                                                00342000
ISTPDAVP EQU   ISTAVT+38                                                00343000
ISTVTTP  EQU   ISTAVT+36                                                00344000
ISTAGTWT EQU   ISTAVT+34                                                00345000
ISTATRT  EQU   ISTAVT+32                                                00346000
ISTARID  EQU   ISTAVT+30                                                00347000
ISTX1    EQU   ISTAVT+29                                                00348000
ISTPHNM  EQU   ISTAVT+24                                                00349000
ISTAPSEX EQU   ISTAVT+20                                                00350000
ISTVTTIK EQU   ISTAVT+18                                                00351000
AVTASID  EQU   ISTAVT+16                                                00352000
ISTAPSTA EQU   ISTAVT+12                                                00353000
ISTAS53  EQU   ISTAVT+8                                                 00354000
ISTAS49  EQU   ISTAVT+4                                                 00355000
ISTACVT  EQU   ISTAVT                                                   00356000
CONCRPLD EQU   CONDBFA+192                                              00357000
CONPPDBF EQU   CONDBFA+176                                              00358000
CONNPDBF EQU   CONDBFA+160                                              00359000
CONAPDBF EQU   CONDBFA+144                                              00360000
CONWPDBF EQU   CONDBFA+128                                              00361000
CONIODBF EQU   CONDBFA+112                                              00362000
CONUEDBF EQU   CONDBFA+96                                               00363000
CONVPDBF EQU   CONDBFA+80                                               00364000
CONVFDBF EQU   CONDBFA+64                                               00365000
CONLPDBF EQU   CONDBFA+48                                               00366000
CONLFDBF EQU   CONDBFA+32                                               00367000
CONSPDBF EQU   CONDBFA+16                                               00368000
CONSFDBF EQU   CONDBFA                                                  00369000
CONCRPLS EQU   CONSBFA+176                                              00370000
CONPPSBF EQU   CONSBFA+160                                              00371000
CONNPSBF EQU   CONSBFA+144                                              00372000
CONAPSBF EQU   CONSBFA+128                                              00373000
CONWPSBF EQU   CONSBFA+112                                              00374000
CONIOSBF EQU   CONSBFA+96                                               00375000
CONVPSBF EQU   CONSBFA+80                                               00376000
CONVFSBF EQU   CONSBFA+64                                               00377000
CONLPSBF EQU   CONSBFA+48                                               00378000
CONLFSBF EQU   CONSBFA+32                                               00379000
CONSPSBF EQU   CONSBFA+16                                               00380000
CONSFSBF EQU   CONSBFA                                                  00381000
CONECDET EQU   CONECBL+28                                               00382000
CONAPPLE EQU   CONECBL+24                                               00383000
CONCDRSE EQU   CONECBL+20                                               00384000
CONIOECB EQU   CONECBL+16                                               00385000
CONCDRME EQU   CONECBL+12                                               00386000
CONTERM  EQU   CONECBL+8                                                00387000
CONTIMER EQU   CONECBL+4                                                00388000
CONDEACT EQU   CONECBL                                                  00389000
CONSRTEA EQU   CONSRTA                                                  00390000
CONDBFSA EQU   CONBUFA+192                                              00391000
CONSBFSA EQU   CONBUFA                                                  00392000
@NM00142 EQU   CONECBA                                                  00393000
CONTUNLA EQU   CONLDPA+200                                              00394000
CONFTTLA EQU   CONLDPA+160                                              00395000
CONFXXLA EQU   CONLDPA+120                                              00396000
CONFLDLA EQU   CONLDPA+80                                               00397000
CONFTRLA EQU   CONLDPA+40                                               00398000
CONFNSLA EQU   CONLDPA                                                  00399000
CONNETRA EQU   CONRDTA+1268                                             00400000
CONRVYRA EQU   CONRDTA+1084                                             00401000
CONUSSRA EQU   CONRDTA+900                                              00402000
CONTRCRA EQU   CONRDTA+716                                              00403000
CONTOLRA EQU   CONRDTA+532                                              00404000
CONSCPRA EQU   CONRDTA+320                                              00405000
CONPUNRA EQU   CONRDTA+136                                              00406000
CONVTHRA EQU   CONRDTA                                                  00407000
CONTDYPA EQU   CONDYPA+32                                               00408000
CONCDYPA EQU   CONDYPA                                                  00409000
@NM00141 EQU   CONAREAS+50                                              00410000
CONDLRVL EQU   CONAREAS+48                                              00411000
CONUESBF EQU   CONAREAS+32                                              00412000
CONSTVAR EQU   CONSTAID+1                                               00413000
CONSTFIL EQU   CONSTAID                                                 00414000
CONBLKNO EQU   CONSCPID+2                                               00415000
CONFILL  EQU   CONSCPID+1                                               00416000
CONFCNL  EQU   CONSCPID                                                 00417000
CONUNITS EQU   CONAREAS+24                                              00418000
@NM00140 EQU   CONAREAS+23                                              00419000
CONGLBBH EQU   CONAREAS+22                                              00420000
CONLIST  EQU   CONAREAS+20                                              00421000
CONMAXPL EQU   CONAREAS+18                                              00422000
@NM00139 EQU   CONAREAS+17                                              00423000
@NM00138 EQU   CONBUFF+1                                                00424000
@NM00137 EQU   CONBUFF+1                                                00425000
@NM00136 EQU   CONBUFF+1                                                00426000
CONCRPL  EQU   CONBUFF+1                                                00427000
CONPPEX  EQU   CONBUFF+1                                                00428000
CONNPEX  EQU   CONBUFF+1                                                00429000
CONAPEX  EQU   CONBUFF+1                                                00430000
CONWPEX  EQU   CONBUFF+1                                                00431000
CONIOEX  EQU   CONBUFF                                                  00432000
CONUECB  EQU   CONBUFF                                                  00433000
CONVPEX  EQU   CONBUFF                                                  00434000
CONVFEX  EQU   CONBUFF                                                  00435000
CONLPEX  EQU   CONBUFF                                                  00436000
CONLFEX  EQU   CONBUFF                                                  00437000
CONSPEX  EQU   CONBUFF                                                  00438000
CONSFEX  EQU   CONBUFF                                                  00439000
CONACTV  EQU   CONSTAT                                                  00440000
CONVRYIN EQU   CONSTAT                                                  00441000
CONLODED EQU   CONSTAT                                                  00442000
CONDSOPN EQU   CONSTAT                                                  00443000
CONSTOR  EQU   CONSTAT                                                  00444000
CONHSTDF EQU   CONSTAT                                                  00445000
@NM00135 EQU   CONSTAT                                                  00446000
@NM00134 EQU   CONSTAT                                                  00447000
CONIOTR  EQU   CONOPTFL                                                 00448000
CONMODTR EQU   CONOPTFL                                                 00449000
CONBTUTR EQU   CONOPTFL                                                 00450000
CONBUFTR EQU   CONOPTFL                                                 00451000
@NM00133 EQU   CONOPTFL                                                 00452000
@NM00132 EQU   CONOPTFL                                                 00453000
@NM00131 EQU   CONOPTFL                                                 00454000
CONWRMST EQU   CONOPTFL                                                 00455000
@NM00130 EQU   CONDSFLG                                                 00456000
@NM00129 EQU   CONDSFLG                                                 00457000
CONSYLST EQU   CONDSFLG                                                 00458000
CONSYLIB EQU   CONDSFLG                                                 00459000
CONSYOBJ EQU   CONDSFLG                                                 00460000
@NM00128 EQU   CONDSFLG                                                 00461000
@NM00127 EQU   CONDSFLG                                                 00462000
@NM00126 EQU   CONDSFLG                                                 00463000
CONMODFY EQU   CONAREAS+11                                              00464000
CONDISPL EQU   CONAREAS+10                                              00465000
CONVARY  EQU   CONAREAS+9                                               00466000
@NM00125 EQU   CONHALT                                                  00467000
@NM00124 EQU   CONHALT                                                  00468000
@NM00123 EQU   CONHALT                                                  00469000
@NM00122 EQU   CONHALT                                                  00470000
@NM00121 EQU   CONHALT                                                  00471000
@NM00120 EQU   CONHALT                                                  00472000
CONHLTS  EQU   CONHALT                                                  00473000
CONHLTQ  EQU   CONHALT                                                  00474000
CONLAST  EQU   CONAREAS+7                                               00475000
@NM00119 EQU   CONAREAS+6                                               00476000
CONCID   EQU   CONAREAS+4                                               00477000
CONBUFSZ EQU   CONAREAS+2                                               00478000
@NM00118 EQU   CONAREAS+1                                               00479000
CONNSNEC EQU   CONFLG01                                                 00480000
CONFTPSA EQU   CONFLG01                                                 00481000
CONFTTA  EQU   CONFLG01                                                 00482000
CONFTNSA EQU   CONFLG01                                                 00483000
CONFTNAC EQU   CONFLG01                                                 00484000
CONFTEXS EQU   CONFLG01                                                 00485000
CONFTTMR EQU   CONFLG01                                                 00486000
CONFTSTM EQU   CONFLG01                                                 00487000
@NM00117 EQU   ISTCONFT+220                                             00488000
CONUILAA EQU   CONSRTAA                                                 00489000
CONDCDRM EQU   ISTCONFT+132                                             00490000
CONHCDRM EQU   ISTCONFT+128                                             00491000
CONINCTO EQU   ISTCONFT+124                                             00492000
CONCDCRT EQU   ISTCONFT+120                                             00493000
CONSDMLC EQU   ISTCONFT+112                                             00494000
CONSDECB EQU   ISTCONFT+108                                             00495000
CONCSCB  EQU   ISTCONFT+104                                             00496000
CONTPNCS EQU   ISTCONFT+96                                              00497000
CONDCBBA EQU   ISTCONFT+92                                              00498000
CONDCBLA EQU   ISTCONFT+88                                              00499000
CONDCBOA EQU   ISTCONFT+84                                              00500000
CONLDPRM EQU   ISTCONFT+80                                              00501000
CONRDBUF EQU   ISTCONFT+76                                              00502000
CONSTCIB EQU   ISTCONFT+72                                              00503000
CONENDLA EQU   ISTCONFT+68                                              00504000
CONVARLA EQU   ISTCONFT+64                                              00505000
CONMODLA EQU   ISTCONFT+60                                              00506000
CONHLTLA EQU   ISTCONFT+56                                              00507000
CONNCSLA EQU   ISTCONFT+52                                              00508000
CONDISLA EQU   ISTCONFT+48                                              00509000
CONCIBAD EQU   ISTCONFT+44                                              00510000
CONACB   EQU   ISTCONFT+40                                              00511000
CONFBPNM EQU   ISTCONFT+32                                              00512000
CONDMNM  EQU   ISTCONFT+24                                              00513000
CONAPSNM EQU   ISTCONFT+16                                              00514000
CONAPINM EQU   ISTCONFT+8                                               00515000
CONCONFG EQU   ISTCONFT                                                 00516000
RDTEND   EQU   ISTRDT+136                                               00517000
RDTVSRPL EQU   RDTCRIA+16                                               00518000
RDTCRSPW EQU   RDTCRIA+8                                                00519000
RDTCRSDS EQU   RDTCRIA                                                  00520000
@NM00116 EQU   ISTRDT+114                                               00521000
@NM00115 EQU   RDTBITAN                                                 00522000
@NM00114 EQU   RDTBITAN                                                 00523000
@NM00113 EQU   RDTBITAN                                                 00524000
@NM00112 EQU   RDTBITAN                                                 00525000
RDTHCDRM EQU   RDTBITAN                                                 00526000
RDTBHSET EQU   RDTBITAN                                                 00527000
RDTCDCTL EQU   RDTBITAN                                                 00528000
RDTCTPGD EQU   RDTBITAN                                                 00529000
RDTLGCT  EQU   ISTRDT+112                                               00530000
RDTNODID EQU   ISTRDT+111                                               00531000
RDTMAXID EQU   ISTRDT+110                                               00532000
RDTCTSNT EQU   ISTRDT+108                                               00533000
RDTVYRPH EQU   ISTRDT+104                                               00534000
RDTBACK  EQU   ISTRDT+100                                               00535000
RDTFORW  EQU   ISTRDT+96                                                00536000
RDTNAMTB EQU   ISTRDT+92                                                00537000
RDTENTAD EQU   ISTRDT+88                                                00538000
RDTLEN   EQU   RDTPLEN+1                                                00539000
@NM00111 EQU   RDTPRIOR                                                 00540000
RDTPRILS EQU   RDTPRIOR                                                 00541000
RDTPRISW EQU   RDTPRIOR                                                 00542000
RDTPRIRN EQU   RDTPRIOR                                                 00543000
RDTPRILC EQU   RDTPRIOR                                                 00544000
RDTPRIAP EQU   RDTPRIOR                                                 00545000
RDTCDRSC EQU   RDTPRIOR                                                 00546000
RDTCDRM  EQU   RDTPRIOR                                                 00547000
RDTPRE   EQU   ISTRDT                                                   00548000
RCDRMEND EQU   ISTRCDRM+212                                             00549000
@NM00110 EQU   ISTRCDRM+209                                             00550000
RCDRMSC  EQU   ISTRCDRM+208                                             00551000
@NM00109 EQU   RCDRMFGS+3                                               00552000
@NM00108 EQU   RCDRMFGS+3                                               00553000
@NM00107 EQU   RCDRMFGS+3                                               00554000
@NM00106 EQU   RCDRMFGS+3                                               00555000
@NM00105 EQU   RCDRMFGS+3                                               00556000
@NM00104 EQU   RCDRMFGS+3                                               00557000
@NM00103 EQU   RCDRMFGS+3                                               00558000
@NM00102 EQU   RCDRMFGS+3                                               00559000
@NM00101 EQU   RCDRMFGS+2                                               00560000
@NM00100 EQU   RCDRMFGS+2                                               00561000
RCDRMRID EQU   RCDRMFGS+2                                               00562000
RCDRMLOQ EQU   RCDRMFGS+2                                               00563000
RCDRMNMP EQU   RCDRMFGS+2                                               00564000
RCDRMPS  EQU   RCDRMFGS+2                                               00565000
RCDRMURC EQU   RCDRMFGS+2                                               00566000
RCDRMNAP EQU   RCDRMFGS+2                                               00567000
RCDRMVL  EQU   RCDRMFGS+1                                               00568000
RCDRMSPC EQU   RCDRMFGS+1                                               00569000
RCDRMINC EQU   RCDRMFGS+1                                               00570000
RCDRMLPS EQU   RCDRMFGS+1                                               00571000
RCDRMTCR EQU   RCDRMFGS+1                                               00572000
RCDRMDTC EQU   RCDRMFGS+1                                               00573000
RCDRMDT  EQU   RCDRMFGS+1                                               00574000
RCDRMCLR EQU   RCDRMFGS+1                                               00575000
RCDRMCLC EQU   RCDRMFGS                                                 00576000
RCDRMDCD EQU   RCDRMFGS                                                 00577000
RCDRMOVR EQU   RCDRMFGS                                                 00578000
RCDRMSDT EQU   RCDRMFGS                                                 00579000
RCDRMACT EQU   RCDRMFGS                                                 00580000
RCDRMOPN EQU   RCDRMFGS                                                 00581000
RCDRMPRI EQU   RCDRMFGS                                                 00582000
RCDRMHST EQU   RCDRMFGS                                                 00583000
RCDRMRP  EQU   ISTRCDRM+200                                             00584000
RCDRMLRP EQU   RCDRMRPQ+4                                               00585000
RCDRMFRP EQU   RCDRMRPQ                                                 00586000
RCDRMARP EQU   ISTRCDRM+188                                             00587000
RCDRMPDT EQU   RCDRMPDN                                                 00588000
RCDRMPR  EQU   ISTRCDRM                                                 00589000
@NM00099 EQU   ISTECB+1                                                 00590000
@NM00098 EQU   @NM00096                                                 00591000
ECBCOMP  EQU   @NM00096                                                 00592000
@NM00097 EQU   @NM00096                                                 00593000
SCHLONG  EQU   ISTSCHDR+4                                               00594000
@NM00095 EQU   SCHCHAR+3                                                00595000
SCHKEY   EQU   SCHCHAR+2                                                00596000
@NM00094 EQU   SCHCHAR+1                                                00597000
@NM00093 EQU   SCHCHAR+1                                                00598000
@NM00092 EQU   SCHCHAR+1                                                00599000
@NM00091 EQU   SCHCHAR+1                                                00600000
@NM00090 EQU   SCHCHAR+1                                                00601000
@NM00089 EQU   SCHCHAR+1                                                00602000
SCHCSQAF EQU   SCHCHAR+1                                                00603000
SCHPGFR  EQU   SCHCHAR+1                                                00604000
SCHSBPL  EQU   SCHCHAR                                                  00605000
SMHLONG  EQU   ISTSMHDR+12                                              00606000
@NM00088 EQU   SMHCHAR+3                                                00607000
SMHKEY   EQU   SMHCHAR+2                                                00608000
@NM00087 EQU   SMHCHAR+1                                                00609000
@NM00086 EQU   SMHCHAR+1                                                00610000
@NM00085 EQU   SMHCHAR+1                                                00611000
@NM00084 EQU   SMHCHAR+1                                                00612000
@NM00083 EQU   SMHCHAR+1                                                00613000
@NM00082 EQU   SMHCHAR+1                                                00614000
SMHCSQAF EQU   SMHCHAR+1                                                00615000
SMHPGFR  EQU   SMHCHAR+1                                                00616000
SMHSBPL  EQU   SMHCHAR                                                  00617000
SMHCHTBF EQU   ISTSMHDR+4                                               00618000
SMHCHOBT EQU   ISTSMHDR                                                 00619000
UILEND   EQU   ISTUILTE+8                                               00620000
UILNAME  EQU   ISTUILTE                                                 00621000
LDPRSV04 EQU   ISTLDPRM+37                                              00622000
LDPRCNID EQU   ISTLDPRM+28                                              00623000
LDPTCEP  EQU   ISTLDPRM+24                                              00624000
LDPRSV02 EQU   ISTLDPRM+22                                              00625000
LDPRSV01 EQU   LDPFB2                                                   00626000
LDPTPPST EQU   LDPFB2                                                   00627000
LDPLOAD  EQU   LDPFB2                                                   00628000
LDPACTIF EQU   LDPFB2                                                   00629000
LDPATACH EQU   LDPFB2                                                   00630000
LDPFLAST EQU   LDPFB2                                                   00631000
LDPRSV03 EQU   LDPFG                                                    00632000
LDPRSYSD EQU   LDPFG                                                    00633000
LDPPB    EQU   LDPFG                                                    00634000
LDPFX    EQU   LDPFG                                                    00635000
LDPDCBA  EQU   ISTLDPRM+16                                              00636000
LDPPDS   EQU   ISTLDPRM+8                                               00637000
LDPMBR   EQU   ISTLDPRM                                                 00638000
RAPEND   EQU   ISTRAP+184                                               00639000
RAPAPPWD EQU   ISTRAP+176                                               00640000
RAPACBN  EQU   ISTRAP+168                                               00641000
@NM00081 EQU   RAPBITAN+2                                               00642000
@NM00080 EQU   RAPBITAN+2                                               00643000
@NM00079 EQU   RAPBITAN+2                                               00644000
@NM00078 EQU   RAPBITAN+2                                               00645000
@NM00077 EQU   RAPBITAN+2                                               00646000
@NM00076 EQU   RAPBITAN+2                                               00647000
@NM00075 EQU   RAPBITAN+2                                               00648000
RAPCSMA  EQU   RAPBITAN+2                                               00649000
RAPTSO   EQU   RAPBITAN+1                                               00650000
RAPAUTHE EQU   RAPBITAN+1                                               00651000
RAPANVPC EQU   RAPBITAN+1                                               00652000
RAPASPO  EQU   RAPBITAN+1                                               00653000
RAPAPPO  EQU   RAPBITAN+1                                               00654000
RAPAACQ  EQU   RAPBITAN+1                                               00655000
RAPAPRMT EQU   RAPBITAN+1                                               00656000
RAPAPASS EQU   RAPBITAN+1                                               00657000
RAPABLCK EQU   RAPBITAN                                                 00658000
RAPALLF  EQU   RAPBITAN                                                 00659000
RAPPARS  EQU   RAPBITAN                                                 00660000
RAPLSIZ  EQU   RAPBITAN                                                 00661000
RAPATLGN EQU   RAPBITAN                                                 00662000
RAPASLGI EQU   RAPBITAN                                                 00663000
RAPAQUI  EQU   RAPBITAN                                                 00664000
RAPABLGN EQU   RAPBITAN                                                 00665000
RAPBFACT EQU   ISTRAP+164                                               00666000
RAPBNA   EQU   ISTRAP+162                                               00667000
RAPEAS   EQU   ISTRAP+160                                               00668000
RAPACDEB EQU   ISTRAP+156                                               00669000
RAPACBA  EQU   ISTRAP+152                                               00670000
RAPENTAD EQU   ISTRAP+148                                               00671000
@NM00074 EQU   ISTRAP+146                                               00672000
RAPTRPRE EQU   ISTRAP+144                                               00673000
RAPPRE   EQU   ISTRAP                                                   00674000
RCPEND   EQU   ISTRCPRE+144                                             00675000
RCPLGMOD EQU   ISTRCPRE+136                                             00676000
RCPDLGMD EQU   ISTRCPRE+128                                             00677000
RCPLGNAP EQU   ISTRCPRE+120                                             00678000
RCPQCNT  EQU   ISTRCPRE+118                                             00679000
@NM00073 EQU   ISTRCPRE+117                                             00680000
@NM00072 EQU   RCPBITAN                                                 00681000
@NM00071 EQU   RCPBITAN                                                 00682000
RCPCSM   EQU   RCPBITAN                                                 00683000
RCPALLOC EQU   RCPBITAN                                                 00684000
RCPSEC   EQU   RCPBITAN                                                 00685000
RCPSESSC EQU   RCPSESSM                                                 00686000
RCPSESPR EQU   RCPSESSM                                                 00687000
RCPSSCFM EQU   ISTRCPRE+114                                             00688000
RCPSTCAP EQU   RCPCYSET                                                 00689000
RCPSTRQD EQU   RCPCYSET                                                 00690000
RCPMDCAP EQU   RCPCYMOD                                                 00691000
RCPMDRQD EQU   RCPCYMOD                                                 00692000
RCPPRIM  EQU   RCPPMODE                                                 00693000
RCPCROSS EQU   RCPPMODE                                                 00694000
RCPRRECD EQU   RCPPMODE                                                 00695000
RCPRBASC EQU   RCPPMODE                                                 00696000
RCPBFLIM EQU   ISTRCPRE+112                                             00697000
RCPNCPPM EQU   RCPNCPPC+1                                               00698000
RCPNCPPN EQU   RCPNCPPC                                                 00699000
RCPPACEM EQU   RCPPACE+1                                                00700000
RCPPACEN EQU   RCPPACE                                                  00701000
RCPBHSI2 EQU   ISTRCPRE+107                                             00702000
RCPBHSI1 EQU   ISTRCPRE+106                                             00703000
RCPSESLM EQU   ISTRCPRE+104                                             00704000
RCPSESCT EQU   ISTRCPRE+102                                             00705000
RCPINTTI EQU   ISTRCPRE+100                                             00706000
RCPUSSTI EQU   ISTRCPRE+98                                              00707000
RCPMODTI EQU   ISTRCPRE+96                                              00708000
RCPLNAPA EQU   ISTRCPRE+92                                              00709000
RCPSIBS  EQU   RCPSARRY+4                                               00710000
RCPSIBP  EQU   RCPSARRY                                                 00711000
RCPPRE   EQU   ISTRCPRE                                                 00712000
RPREND   EQU   ISTRPRE+84                                               00713000
RPRDEVCH EQU   ISTRPRE+76                                               00714000
RPRCONID EQU   ISTRPRE+67                                               00715000
@NM00070 EQU   ISTRPRE+66                                               00716000
@NM00069 EQU   RPRBITAN+4                                               00717000
@NM00068 EQU   RPRBITAN+4                                               00718000
@NM00067 EQU   RPRBITAN+4                                               00719000
@NM00066 EQU   RPRBITAN+4                                               00720000
@NM00065 EQU   RPRBITAN+4                                               00721000
RPRNEO   EQU   RPRBITAN+4                                               00722000
RPRRNAA  EQU   RPRBITAN+4                                               00723000
RPRDRADD EQU   RPRBITAN+4                                               00724000
RPRFADD  EQU   RPRBITAN+3                                               00725000
RPRINTST EQU   RPRBITAN+3                                               00726000
RPRCLVPD EQU   RPRBITAN+3                                               00727000
RPRSNASS EQU   RPRBITAN+3                                               00728000
RPRGIST  EQU   RPRBITAN+3                                               00729000
RPRRBISA EQU   RPRBITAN+3                                               00730000
RPRENTVT EQU   RPRBITAN+3                                               00731000
RPRDINOP EQU   RPRBITAN+3                                               00732000
RPRDINUS EQU   RPRBITAN+2                                               00733000
RPRCRCPT EQU   RPRBITAN+2                                               00734000
RPRNOSRT EQU   RPRBITAN+2                                               00735000
RPRDOM   EQU   RPRBITAN+2                                               00736000
RPRNOUSE EQU   RPRBITAN+2                                               00737000
RPRNOSNA EQU   RPRBITAN+2                                               00738000
RPRCLNUP EQU   RPRBITAN+2                                               00739000
RPRCONLD EQU   RPRBITAN+2                                               00740000
RPRCONP  EQU   RPRBITAN+1                                               00741000
RPRACTP  EQU   RPRBITAN+1                                               00742000
RPRRSON  EQU   RPRBITAN+1                                               00743000
RPRCONCT EQU   RPRBITAN+1                                               00744000
RPRHLVPD EQU   RPRBITAN+1                                               00745000
RPRHLACT EQU   RPRBITAN+1                                               00746000
RPRONLIN EQU   RPRBITAN+1                                               00747000
RPRSMLU  EQU   RPRBITAN+1                                               00748000
RPRAOPN  EQU   RPRBITAN                                                 00749000
RPRENTVH EQU   RPRBITAN                                                 00750000
RPRLIVE  EQU   RPRBITAN                                                 00751000
RPRENTED EQU   RPRBITAN                                                 00752000
RPRLTASN EQU   RPRBITAN                                                 00753000
RPRENTIO EQU   RPRBITAN                                                 00754000
RPRENTBF EQU   RPRBITAN                                                 00755000
RPRINV   EQU   RPRBITAN                                                 00756000
RPRDEFLV EQU   RPRSTATE+4                                               00757000
RPRDESS1 EQU   RPRDESST                                                 00758000
RPRCURS1 EQU   RPRCURST                                                 00759000
RPRCMDWE EQU   ISTRPRE+52                                               00760000
RPRTNTQP EQU   ISTRPRE+48                                               00761000
RPRNSNEA EQU   ISTRPRE+44                                               00762000
RPRNCBA  EQU   ISTRPRE+40                                               00763000
RPRPELEN EQU   ISTRPRE+36                                               00764000
RPRELEN  EQU   ISTRPRE+32                                               00765000
RPRALPAD EQU   ISTRPRE+28                                               00766000
RPRENTAD EQU   ISTRPRE+24                                               00767000
RPRREQCT EQU   ISTRPRE+23                                               00768000
RPRPTHCT EQU   ISTRPRE+22                                               00769000
RPRINDEX EQU   ISTRPRE+20                                               00770000
RPRDAF   EQU   RPRDAFID+2                                               00771000
@NM00064 EQU   RPRDAFID                                                 00772000
@NM00063 EQU   ISTRPRE+15                                               00773000
RPRHDTYP EQU   ISTRPRE+14                                               00774000
RPRENTRY EQU   ISTRPRE+13                                               00775000
RPRNAME  EQU   RPRSRTHD                                                 00776000
DEVRSV01 EQU   ISTDEVCH+7                                               00777000
DEVAUXTP EQU   ISTDEVCH+6                                               00778000
DEVADVFE EQU   DEVMODE                                                  00779000
@NM00062 EQU   DEVMODE                                                  00780000
DEVBASIC EQU   DEVMODE                                                  00781000
DEVREC   EQU   DEVMODE                                                  00782000
DEVPHYSA EQU   ISTDEVCH+4                                               00783000
DEVCSLPN EQU   DEVCHAR3                                                 00784000
DEVCSTCL EQU   DEVCHAR3                                                 00785000
DEVCCHEK EQU   DEVCHAR3                                                 00786000
DEVCATTN EQU   DEVCHAR3                                                 00787000
DEVCSWL  EQU   DEVFCCTL                                                 00788000
DEVCRVB  EQU   DEVFCCTL                                                 00789000
DEVCSSL  EQU   DEVFCCTL                                                 00790000
DEVCBSC  EQU   DEVFCCTL                                                 00791000
DEVMCODE EQU   ISTDEVCH+2                                               00792000
DEVCHAR2 EQU   DEVTCODE                                                 00793000
DEVSPOLL EQU   DEVCHAR                                                  00794000
DEVCCTL  EQU   DEVCHAR                                                  00795000
DEVNNSPT EQU   DEVCHAR                                                  00796000
DEVSPS   EQU   DEVCHAR                                                  00797000
DEVSUBND EQU   DEVCHAR                                                  00798000
DEVCONVR EQU   DEVCHAR                                                  00799000
DEVOTPUT EQU   DEVCHAR                                                  00800000
DEVINPUT EQU   DEVCHAR                                                  00801000
SRTTYPE  EQU   ISTSRT+12                                                00802000
SRTSPECE EQU   SRTSRTE                                                  00803000
SRTSYMNM EQU   ISTSRT                                                   00804000
ATCAOS   EQU   ISTATCVT+1868                                            00805000
@NM00061 EQU   ISTATCVT+1860                                            00806000
@NM00060 EQU   ISTATCVT+1852                                            00807000
@NM00059 EQU   ISTATCVT+1844                                            00808000
@NM00058 EQU   ISTATCVT+1836                                            00809000
@NM00057 EQU   ISTATCVT+1828                                            00810000
@NM00056 EQU   ISTATCVT+1820                                            00811000
@NM00055 EQU   ISTATCVT+1816                                            00812000
ATCCACSA EQU   ISTATCVT+1812                                            00813000
ATCMXCSA EQU   ISTATCVT+1808                                            00814000
ATCTPMPB EQU   ISTATCVT+1776                                            00815000
ATCTRMPB EQU   ISTATCVT+1744                                            00816000
ATCRPLAC EQU   ATCRPLCN+2                                               00817000
ATCRPLRC EQU   ATCRPLCN                                                 00818000
ATCCRPLQ EQU   ATCCRPL                                                  00819000
ATCSRBAC EQU   ATCSRBCN+2                                               00820000
ATCSRBRC EQU   ATCSRBCN                                                 00821000
ATCSRBQ  EQU   ATCSRB                                                   00822000
ATCCRAAC EQU   ATCCRACN+2                                               00823000
ATCCRARC EQU   ATCCRACN                                                 00824000
ATCCRAQ  EQU   ATCCRA                                                   00825000
ATCLUFFD EQU   ISTATCVT+1716                                            00826000
ATCVIOPM EQU   ISTATCVT+1712                                            00827000
ATCTPMMI EQU   ISTATCVT+1708                                            00828000
ATCPXSRB EQU   ISTATCVT+1704                                            00829000
ATCRPLCT EQU   ISTATCVT+1702                                            00830000
ATCCRACT EQU   ISTATCVT+1700                                            00831000
ATCSRBCT EQU   ISTATCVT+1698                                            00832000
ATCSTNSM EQU   ISTATCVT+1697                                            00833000
@NM00054 EQU   ATCZFLAG                                                 00834000
ATCZF001 EQU   ATCZFLAG                                                 00835000
ATCTPCP1 EQU   ISTATCVT+1692                                            00836000
ATCTPCP0 EQU   ISTATCVT+1688                                            00837000
ATCZR01  EQU   ISTATCVT+1684                                            00838000
ATCMPLTA EQU   ISTATCVT+1680                                            00839000
ATCASCB  EQU   ISTATCVT+1676                                            00840000
ATCAP86  EQU   ISTATCVT+1672                                            00841000
ATCAP85  EQU   ISTATCVT+1668                                            00842000
ATCAP84  EQU   ISTATCVT+1664                                            00843000
ATCAP83  EQU   ISTATCVT+1660                                            00844000
ATCAP82  EQU   ISTATCVT+1656                                            00845000
ATCAP69  EQU   ISTATCVT+1652                                            00846000
ATCAP66  EQU   ISTATCVT+1648                                            00847000
ATCAP62  EQU   ISTATCVT+1644                                            00848000
ATCAPC59 EQU   ISTATCVT+1640                                            00849000
ATCAP56  EQU   ISTATCVT+1636                                            00850000
ATCAP55  EQU   ISTATCVT+1632                                            00851000
ATCAP41  EQU   ISTATCVT+1628                                            00852000
ATCAPC25 EQU   ISTATCVT+1624                                            00853000
ATCAP23  EQU   ISTATCVT+1620                                            00854000
ATCAPBE  EQU   ISTATCVT+1616                                            00855000
ATCPSTA  EQU   ISTATCVT+1612                                            00856000
ATCSMABF EQU   ISTATCVT+1608                                            00857000
ATCSMAPR EQU   ISTATCVT+1604                                            00858000
ATCTPWQA EQU   ISTATCVT+1600                                            00859000
ATCSMAID EQU   ISTATCVT+1596                                            00860000
ATCSMARA EQU   ISTATCVT+1592                                            00861000
ATCCACXA EQU   ISTATCVT+1588                                            00862000
ATCATA10 EQU   ISTATCVT+1584                                            00863000
ATCHLTCB EQU   ISTATCVT+1580                                            00864000
@NM00053 EQU   ATCVTFLG                                                 00865000
ATCVTACT EQU   ATCVTFLG                                                 00866000
@NM00052 EQU   @NM00051                                                 00867000
ATCVTMAB EQU   @NM00051                                                 00868000
ATCVTBAM EQU   ISTATCVT+1572                                            00869000
@NM00050 EQU   ISTATCVT+1568                                            00870000
@NM00049 EQU   ISTATCVT+1520                                            00871000
ATCCCOOC EQU   ISTATCVT+1516                                            00872000
@NM00048 EQU   ISTATCVT+1513                                            00873000
ATCSNUF  EQU   ATCENFLG                                                 00874000
ATCOPKL  EQU   ATCENFLG                                                 00875000
ATCABEN  EQU   ATCENFLG                                                 00876000
ATCSRDN  EQU   ATCENFLG                                                 00877000
ATCDLDN  EQU   ATCENFLG                                                 00878000
ATCTIMER EQU   ISTATCVT+1508                                            00879000
ATCAIWT  EQU   ISTATCVT+1504                                            00880000
ATCOROBT EQU   ISTATCVT+1500                                            00881000
ATCDMAPP EQU   ISTATCVT+1496                                            00882000
ATCZDVTX EQU   ISTATCVT+1492                                            00883000
ATCPXCRA EQU   ISTATCVT+1488                                            00884000
ATCICNCB EQU   ISTATCVT+1484                                            00885000
ATCCMTCB EQU   ISTATCVT+1480                                            00886000
ATCPRPH  EQU   ISTATCVT+1476                                            00887000
ATCGSRBF EQU   ATCGSRBG                                                 00888000
ATCSRBRT EQU   ISTATCVT+1468                                            00889000
ATCTSCPC EQU   ISTATCVT+1464                                            00890000
@NM00047 EQU   ISTATCVT+1460                                            00891000
ATCCDTCB EQU   ISTATCVT+1456                                            00892000
ATCORFRL EQU   ISTATCVT+1452                                            00893000
ATCORFPX EQU   ISTATCVT+1448                                            00894000
ATCORFMG EQU   ISTATCVT+1444                                            00895000
ATCSMBQ  EQU   ISTATCVT+1440                                            00896000
ATCINFDD EQU   ISTATCVT+1436                                            00897000
ATCAP67  EQU   ISTATCVT+1432                                            00898000
ATCAP65  EQU   ISTATCVT+1428                                            00899000
ATCAP64  EQU   ISTATCVT+1424                                            00900000
ATCAP63  EQU   ISTATCVT+1420                                            00901000
ATCAP61  EQU   ISTATCVT+1416                                            00902000
ATCAP58  EQU   ISTATCVT+1412                                            00903000
ATCAP57  EQU   ISTATCVT+1408                                            00904000
ATCAP54  EQU   ISTATCVT+1404                                            00905000
ATCAP53  EQU   ISTATCVT+1400                                            00906000
ATCAP52  EQU   ISTATCVT+1396                                            00907000
ATCAP51  EQU   ISTATCVT+1392                                            00908000
ATCAP38  EQU   ISTATCVT+1388                                            00909000
ATCAP37  EQU   ISTATCVT+1384                                            00910000
ATCAP34  EQU   ISTATCVT+1380                                            00911000
ATCAP32  EQU   ISTATCVT+1376                                            00912000
ATCAP31  EQU   ISTATCVT+1372                                            00913000
ATCAP12  EQU   ISTATCVT+1368                                            00914000
ATCAP11  EQU   ISTATCVT+1364                                            00915000
ATCDAPDG EQU   ATCDAPVT+20                                              00916000
ATCDXCEA EQU   ATCDAPVT+16                                              00917000
ATCDCEA  EQU   ATCDAPVT+12                                              00918000
ATCDPCIA EQU   ATCDAPVT+8                                               00919000
ATCDSIOA EQU   ATCDAPVT+4                                               00920000
ATCDEOEA EQU   ATCDAPVT                                                 00921000
ATCZAEA  EQU   ATCICAPP+16                                              00922000
ATCZCEA  EQU   ATCICAPP+12                                              00923000
ATCZCPCI EQU   ATCICAPP+8                                               00924000
ATCZSIOA EQU   ATCICAPP+4                                               00925000
ATCCDRPH EQU   ATCICAPP                                                 00926000
ATCORQG  EQU   ATCORSRB                                                 00927000
ATCORTBF EQU   ATCSQAFR                                                 00928000
@NM00046 EQU   ISTATCVT+1308                                            00929000
ATCZLAEA EQU   ATCLDAPP+16                                              00930000
ATCZLCEA EQU   ATCLDAPP+12                                              00931000
ATCZLPCI EQU   ATCLDAPP+8                                               00932000
ATCSMFRR EQU   ATCLDAPP+4                                               00933000
ATCCDTID EQU   ATCLDAPP                                                 00934000
@NM00045 EQU   ISTATCVT+1256                                            00935000
ATCZPAB2 EQU   ISTATCVT+1224                                            00936000
@NM00044 EQU   ISTATCVT+1224                                            00937000
@NM00043 EQU   ISTATCVT+1164                                            00938000
ATCCPCFE EQU   ISTATCVT+1160                                            00939000
@NM00042 EQU   ATCRID+2                                                 00940000
ATCCDRMA EQU   ATCRID                                                   00941000
@NM00041 EQU   ATCSMSDQ+8                                               00942000
@NM00040 EQU   ATCSMSDQ+4                                               00943000
@NM00039 EQU   ATCSMSDQ                                                 00944000
ATCSEQNO EQU   ISTATCVT+1136                                            00945000
ATCSMPMD EQU   ISTATCVT+1132                                            00946000
ATCPAREA EQU   ISTATCVT+1128                                            00947000
ATCCPCSM EQU   ISTATCVT+1124                                            00948000
ATCQLOCK EQU   ISTATCVT+1120                                            00949000
ATCITQLE EQU   ISTATCVT+1116                                            00950000
ATCSQCDS EQU   ISTATCVT+1112                                            00951000
ATCUSSVT EQU   ISTATCVT+1108                                            00952000
ATCNOSQ  EQU   ISTATCVT+1104                                            00953000
ATCINCIP EQU   ATCCPDVT+4                                               00954000
ATCTSCNI EQU   ATCCPDVT                                                 00955000
ATCMGCRT EQU   ISTATCVT+1092                                            00956000
ATCMACRT EQU   ISTATCVT+1088                                            00957000
ATCCSMT  EQU   ISTATCVT+1084                                            00958000
ATCDRUSL EQU   ISTATCVT+1080                                            00959000
ATCDRULL EQU   ISTATCVT+1076                                            00960000
ATCCFCDR EQU   ISTATCVT+1072                                            00961000
@NM00038 EQU   ISTATCVT+1069                                            00962000
ATCMROUT EQU   ISTATCVT+1060                                            00963000
ATCONFIG EQU   ISTATCVT+1052                                            00964000
ATCNODEL EQU   ISTATCVT+1044                                            00965000
@NM00037 EQU   @NM00036+9                                               00966000
ATCLAST  EQU   ATCSHRFG                                                 00967000
ATCSHRTN EQU   @NM00036                                                 00968000
@NM00035 EQU   ISTATCVT+1026                                            00969000
ATCNMCTR EQU   ISTATCVT+1024                                            00970000
ATCPOIA  EQU   ATCRNO+1                                                 00971000
@NM00034 EQU   ATCRNO                                                   00972000
ATCLCLCT EQU   ATCVLCNT+2                                               00973000
ATCRNCNT EQU   ATCVLCNT                                                 00974000
ATCHBSIZ EQU   ATCHPGM+2                                                00975000
ATCHBFNO EQU   ATCHPGM                                                  00976000
@NM00033 EQU   ISTATCVT+1011                                            00977000
ATCXRANG EQU   ISTATCVT+1010                                            00978000
ATCMAXID EQU   ISTATCVT+1009                                            00979000
ATCMSGSP EQU   ISTATCVT+1008                                            00980000
ATCCIDM  EQU   ISTATCVT+1006                                            00981000
ATCACTRM EQU   ISTATCVT+1004                                            00982000
ATCECTLP EQU   ISTATCVT+1000                                            00983000
ATCECNET EQU   ISTATCVT+996                                             00984000
ATCECOPC EQU   ISTATCVT+992                                             00985000
ATCECSES EQU   ISTATCVT+988                                             00986000
ATCECDSP EQU   ISTATCVT+984                                             00987000
ATCECVRY EQU   ISTATCVT+980                                             00988000
ATCECHLT EQU   ISTATCVT+976                                             00989000
ATCECMOD EQU   ISTATCVT+972                                             00990000
ATCVDLOK EQU   ISTATCVT+968                                             00991000
ATCRDTLK EQU   ISTATCVT+964                                             00992000
ATCVOCLK EQU   ISTATCVT+960                                             00993000
ATCITLIM EQU   ISTATCVT+958                                             00994000
ATCTMINV EQU   ISTATCVT+956                                             00995000
ATCHOSTA EQU   ISTATCVT+954                                             00996000
ATCPUNSA EQU   ISTATCVT+952                                             00997000
ATCSAF   EQU   ISTATCVT+950                                             00998000
ATCVTMID EQU   ATCSSCPA                                                 00999000
ATCHCNID EQU   ATCONID+2                                                01000000
ATCSCNID EQU   ATCONID                                                  01001000
@NM00032 EQU   ATCBITAN+3                                               01002000
@NM00031 EQU   ATCBITAN+2                                               01003000
@NM00030 EQU   ATCFLAG2                                                 01004000
@NM00029 EQU   ATCFLAG2                                                 01005000
@NM00028 EQU   ATCFLAG2                                                 01006000
ATCCRYPF EQU   ATCFLAG2                                                 01007000
ATCTUNCL EQU   ATCFLAG2                                                 01008000
ATCTUNRQ EQU   ATCFLAG2                                                 01009000
ATCTUNAC EQU   ATCFLAG2                                                 01010000
ATCCDLRA EQU   ATCFLAG2                                                 01011000
@NM00027 EQU   ATCBITAN                                                 01012000
@NM00026 EQU   ATCSTAT4                                                 01013000
@NM00025 EQU   ATCSTAT4                                                 01014000
@NM00024 EQU   ATCSTAT4                                                 01015000
@NM00023 EQU   ATCSTAT4                                                 01016000
@NM00022 EQU   ATCSTAT4                                                 01017000
ATCPRTAT EQU   ATCSTAT4                                                 01018000
ATCNCSD  EQU   ATCSTAT4                                                 01019000
ATCMTST  EQU   ATCSTAT4                                                 01020000
@NM00021 EQU   ATCPOFLG                                                 01021000
@NM00020 EQU   ATCPOFLG                                                 01022000
@NM00019 EQU   ATCPOFLG                                                 01023000
@NM00018 EQU   ATCPOFLG                                                 01024000
@NM00017 EQU   ATCPOFLG                                                 01025000
@NM00016 EQU   ATCPOFLG                                                 01026000
@NM00015 EQU   ATCPOFLG                                                 01027000
ATCPOUNS EQU   ATCPOFLG                                                 01028000
@NM00014 EQU   ATCSTAT+1                                                01029000
ATCHIP   EQU   ATCSTAT1                                                 01030000
ATCMDHLT EQU   ATCSTAT1                                                 01031000
ATCINHLT EQU   ATCSTAT1                                                 01032000
ATCNETSL EQU   ATCSTAT1                                                 01033000
ATCQKHLT EQU   ATCSTAT1                                                 01034000
ATCSNHLT EQU   ATCSTAT1                                                 01035000
ATCACTIV EQU   ATCSTAT1                                                 01036000
ATCSTART EQU   ATCSTAT1                                                 01037000
ATCNOP00 EQU   ISTATCVT+932                                             01038000
ATCTSBUF EQU   ISTATCVT+928                                             01039000
ATCFEPT  EQU   ISTATCVT+924                                             01040000
ATCFDVT  EQU   ISTATCVT+920                                             01041000
ATCRDTH  EQU   ISTATCVT+912                                             01042000
ATCSIBQ  EQU   ISTATCVT+908                                             01043000
ATCHLTMS EQU   ISTATCVT+904                                             01044000
ATCECPRM EQU   ISTATCVT+900                                             01045000
ATCVPARM EQU   ISTATCVT+896                                             01046000
ATCOCHA  EQU   ISTATCVT+892                                             01047000
ATCDSPLQ EQU   ISTATCVT+888                                             01048000
ATCVARYQ EQU   ISTATCVT+884                                             01049000
ATCHALTQ EQU   ISTATCVT+880                                             01050000
ATCMODQ  EQU   ISTATCVT+876                                             01051000
ATCSRT   EQU   ISTATCVT+872                                             01052000
ATCRDT   EQU   ISTATCVT+868                                             01053000
ATCSDVT  EQU   ISTATCVT+864                                             01054000
ATCDLRPT EQU   ISTATCVT+860                                             01055000
ATCBPDA  EQU   ISTATCVT+856                                             01056000
ATCACDA  EQU   ISTATCVT+852                                             01057000
ATCMNT   EQU   ISTATCVT+848                                             01058000
ATCUEP   EQU   ISTATCVT+844                                             01059000
ATCNODDS EQU   ISTATCVT+840                                             01060000
ATCITRT  EQU   ISTATCVT+836                                             01061000
ATCTODVT EQU   ISTATCVT+832                                             01062000
ATCTRCPT EQU   ISTATCVT+828                                             01063000
ATCMODTB EQU   ISTATCVT+824                                             01064000
ATCUSSPT EQU   ISTATCVT+820                                             01065000
ATCTUBUF EQU   ISTATCVT+816                                             01066000
ATCTACB  EQU   ISTATCVT+812                                             01067000
ATCDWA   EQU   ISTATCVT+808                                             01068000
ATCCFCR2 EQU   ATCPODVT                                                 01069000
ATCEPA   EQU   ISTATCVT+800                                             01070000
ATCPULQB EQU   @NM00013+16                                              01071000
ATCMCQAB EQU   @NM00013+12                                              01072000
ATCLUSMQ EQU   @NM00013+8                                               01073000
ATCLUIOQ EQU   @NM00013+4                                               01074000
ATCIOLQB EQU   @NM00013                                                 01075000
ATCTSCAP EQU   ATCANYDT                                                 01076000
ATCTSCCO EQU   ATCLUDVT+4                                               01077000
ATCTSCSR EQU   ATCLUDVT                                                 01078000
ATCVTLOD EQU   ISTATCVT+764                                             01079000
ATCTSCLF EQU   ISTATCVT+760                                             01080000
ATCTSCLE EQU   ISTATCVT+756                                             01081000
ATCTSCLB EQU   ISTATCVT+752                                             01082000
ATCTSCLS EQU   ISTATCVT+748                                             01083000
ATCTSCCF EQU   ISTATCVT+744                                             01084000
ATCTSCFV EQU   ISTATCVT+740                                             01085000
ATCTSCCE EQU   ISTATCVT+736                                             01086000
ATCTSCCB EQU   ISTATCVT+732                                             01087000
ATCTSCWS EQU   ISTATCVT+728                                             01088000
ATCTSCEM EQU   ISTATCVT+724                                             01089000
ATCTSCNS EQU   ISTATCVT+720                                             01090000
ATCTSCER EQU   ISTATCVT+716                                             01091000
ATCTSCPR EQU   ISTATCVT+712                                             01092000
ATCTSCGR EQU   ISTATCVT+708                                             01093000
ATCTSCCI EQU   ISTATCVT+704                                             01094000
ATCTSVT  EQU   ISTATCVT+700                                             01095000
ATCDVLOD EQU   ISTATCVT+696                                             01096000
ATCCDCNR EQU   ISTATCVT+692                                             01097000
ATCCDCNF EQU   ISTATCVT+688                                             01098000
ATCCDCND EQU   ISTATCVT+684                                             01099000
ATCCDCNA EQU   ISTATCVT+680                                             01100000
ATCCDCCP EQU   ISTATCVT+676                                             01101000
ATCCDFDN EQU   ISTATCVT+672                                             01102000
ATCCDFIN EQU   ISTATCVT+668                                             01103000
ATCCDFND EQU   ISTATCVT+664                                             01104000
ATCCDDEL EQU   ISTATCVT+660                                             01105000
ATCCDADD EQU   ISTATCVT+656                                             01106000
ATCTCLIM EQU   ISTATCVT+652                                             01107000
ATCRACTR EQU   ISTATCVT+648                                             01108000
ATCRACTI EQU   ISTATCVT+644                                             01109000
ATCREMOV EQU   ISTATCVT+640                                             01110000
ATCRACIO EQU   ISTATCVT+636                                             01111000
ATCADD   EQU   ISTATCVT+632                                             01112000
ATCPUCRT EQU   ISTATCVT+628                                             01113000
ATCSMRS  EQU   ISTATCVT+624                                             01114000
ATCSMRQ  EQU   ISTATCVT+620                                             01115000
ATCORCPX EQU   ISTATCVT+616                                             01116000
ATCORCAF EQU   ISTATCVT+612                                             01117000
ATCFRSTR EQU   ATCGTSTR                                                 01118000
ATCSTMA  EQU   ISTATCVT+604                                             01119000
ATCSRTAD EQU   ISTATCVT+600                                             01120000
ATCOCRT  EQU   ISTATCVT+596                                             01121000
ATCOCCFS EQU   ISTATCVT+592                                             01122000
ATCOCCFP EQU   ISTATCVT+588                                             01123000
ATCSRTDF EQU   ISTATCVT+584                                             01124000
ATCLUCRT EQU   ISTATCVT+580                                             01125000
ATCINCY5 EQU   ISTATCVT+576                                             01126000
ATCINCW3 EQU   ISTATCVT+572                                             01127000
ATCINCU6 EQU   ISTATCVT+568                                             01128000
ATCINCTQ EQU   ISTATCVT+564                                             01129000
ATCINCS1 EQU   ISTATCVT+560                                             01130000
ATCSRTAB EQU   ISTATCVT+556                                             01131000
ATCINCRD EQU   ISTATCVT+552                                             01132000
ATCINCPH EQU   ISTATCVT+548                                             01133000
ATCINCLQ EQU   ISTATCVT+544                                             01134000
ATCNOCRT EQU   ISTATCVT+540                                             01135000
ATCINCF1 EQU   ISTATCVT+536                                             01136000
ATCINCCI EQU   ISTATCVT+532                                             01137000
ATCINCCO EQU   ISTATCVT+528                                             01138000
ATCBLDLA EQU   ISTATCVT+524                                             01139000
ATCALOAD EQU   ISTATCVT+520                                             01140000
ATCADEL  EQU   ISTATCVT+516                                             01141000
ATCESC02 EQU   ISTATCVT+512                                             01142000
ATCESC01 EQU   ISTATCVT+508                                             01143000
ATCDEC01 EQU   ISTATCVT+504                                             01144000
ATCDEC00 EQU   ISTATCVT+500                                             01145000
ATCCPCRT EQU   ISTATCVT+496                                             01146000
ATCMSGM  EQU   ISTATCVT+492                                             01147000
ATCCPCFR EQU   ISTATCVT+488                                             01148000
ATCCPCGR EQU   ISTATCVT+484                                             01149000
ATCCPCPP EQU   ISTATCVT+480                                             01150000
ATCMSGP  EQU   ISTATCVT+476                                             01151000
ATCCPCNT EQU   ISTATCVT+472                                             01152000
ATCAUTHA EQU   ISTATCVT+468                                             01153000
ATCACCTA EQU   ISTATCVT+464                                             01154000
ATCAP39  EQU   ISTATCVT+460                                             01155000
ATCAP36  EQU   ISTATCVT+456                                             01156000
ATCAP35  EQU   ISTATCVT+452                                             01157000
ATCAP33  EQU   ISTATCVT+448                                             01158000
ATCAPCR5 EQU   ISTATCVT+444                                             01159000
ATCAICPT EQU   ISTATCVT+440                                             01160000
ATCAPI   EQU   ISTATCVT+436                                             01161000
ATCAICTN EQU   ISTATCVT+432                                             01162000
ATCACC01 EQU   ISTATCVT+428                                             01163000
ATCACC00 EQU   ISTATCVT+424                                             01164000
ATCLDECB EQU   ATCLDTIL+12                                              01165000
ATCLDLCK EQU   ATCLDTIL+8                                               01166000
ATCLDLST EQU   ATCLDTIL+4                                               01167000
ATCLDNCS EQU   ATCLDTIL                                                 01168000
ATCNOSPB EQU   ISTATCVT+376                                             01169000
ATCNSPAB EQU   ISTATCVT+344                                             01170000
ATCLUSRT EQU   ISTATCVT+312                                             01171000
ATCPUIOP EQU   ISTATCVT+280                                             01172000
ATCPUPAB EQU   ISTATCVT+248                                             01173000
ATCPXPAB EQU   ISTATCVT+216                                             01174000
ATCPOPAB EQU   ISTATCVT+184                                             01175000
@NM00012 EQU   ATCVDPAB+16                                              01176000
ATCFEPAB EQU   ATCVDPAB                                                 01177000
ATCTCIPB EQU   ISTATCVT+120                                             01178000
ATCCSPAB EQU   ATCSMPAB+16                                              01179000
@NM00011 EQU   ATCSMPAB                                                 01180000
ATCTMRPB EQU   ISTATCVT+56                                              01181000
ATCITPAB EQU   ISTATCVT+24                                              01182000
@NM00010 EQU   ATCITRA1                                                 01183000
ATCITSCP EQU   ATCITRA1                                                 01184000
ATCITMSG EQU   ATCITRA1                                                 01185000
ATCITPIU EQU   ATCITRA1                                                 01186000
ATCITSMS EQU   ATCITRA1                                                 01187000
ATCITPSS EQU   ATCITRA1                                                 01188000
ATCITLCK EQU   ATCITRA1                                                 01189000
ATCITAPI EQU   ATCITRA1                                                 01190000
ATCITCNT EQU   ATCITFLG                                                 01191000
ATCITRPH EQU   ATCITCDS                                                 01192000
ATCITTBL EQU   ATCITFLD+4                                               01193000
ATCITPRM EQU   ATCITFLD                                                 01194000
ATCPTCHA EQU   ATCRPTCH+4                                               01195000
ATCVTLVL EQU   ATCRPTCH                                                 01196000
RPHUPSTA EQU   ISTRPH+104                                               01197000
RPHSAV16 EQU   RPHWORK+60                                               01198000
RPHSAV15 EQU   RPHWORK+56                                               01199000
RPHSAV14 EQU   RPHWORK+52                                               01200000
RPHSAV13 EQU   RPHWORK+48                                               01201000
RPHSAV12 EQU   RPHWORK+44                                               01202000
RPHSAV11 EQU   RPHWORK+40                                               01203000
RPHSAV10 EQU   RPHWORK+36                                               01204000
RPHSAVE9 EQU   RPHWORK+32                                               01205000
RPHSAVE8 EQU   RPHWORK+28                                               01206000
RPHSAVE7 EQU   RPHWORK+24                                               01207000
RPHSAVE6 EQU   RPHWORK+20                                               01208000
RPHSAVE5 EQU   RPHWORK+16                                               01209000
RPHSAVE4 EQU   RPHWORK+12                                               01210000
RPHSAVE3 EQU   RPHWORK+8                                                01211000
RPHSAVE2 EQU   RPHWORK+4                                                01212000
RPHSHALF EQU   RPHSAVE1+2                                               01213000
RPHSBIT8 EQU   RPHSBITS                                                 01214000
RPHSBIT7 EQU   RPHSBITS                                                 01215000
RPHSBIT6 EQU   RPHSBITS                                                 01216000
RPHSBIT5 EQU   RPHSBITS                                                 01217000
RPHSBIT4 EQU   RPHSBITS                                                 01218000
RPHSBIT3 EQU   RPHSBITS                                                 01219000
RPHSBIT2 EQU   RPHSBITS                                                 01220000
RPHSBIT1 EQU   RPHSBITS                                                 01221000
RPHSBYTE EQU   RPHSAVE1                                                 01222000
RPHPABQP EQU   RPHPABQA+1                                               01223000
RPHPABFG EQU   RPHPABQA                                                 01224000
RPHCRR   EQU   ISTRPH+32                                                01225000
RPHSRP34 EQU   RPHSRPRM+2                                               01226000
RPHSRP12 EQU   RPHSRPRM                                                 01227000
RPHWEGT  EQU   RPHCSPA                                                  01228000
RPHMAJCB EQU   ISTRPH+21                                                01229000
RPHPABOF EQU   ISTRPH+20                                                01230000
RPHRESUM EQU   RPHRESMA+1                                               01231000
@NM00009 EQU   RPHWPFLG                                                 01232000
RPHPURGE EQU   RPHWPFLG                                                 01233000
RPHPT    EQU   RPHWPFLG                                                 01234000
RPHWT    EQU   RPHWPFLG                                                 01235000
RPHRSKEY EQU   RPHWPFLG                                                 01236000
RPHDVTA  EQU   ISTRPH+12                                                01237000
RPHTIK   EQU   RPHTSKID+3                                               01238000
@NM00008 EQU   RPHTSKID                                                 01239000
RPHRPHAP EQU   RPHRPHA+1                                                01240000
@NM00007 EQU   RPHRPHA                                                  01241000
RPHGATE  EQU   RPHRPHA                                                  01242000
RPHABEND EQU   RPHFLGB                                                  01243000
RPHUWAIT EQU   RPHFLGB                                                  01244000
RPHRLCRA EQU   RPHFLGB                                                  01245000
@NM00006 EQU   RPHFLGB                                                  01246000
RPHPGCMP EQU   RPHFLGB                                                  01247000
RPHFBAPS EQU   RPHFLGB                                                  01248000
RPHBSSP  EQU   RPHFLGB                                                  01249000
RPHLOCK  EQU   RPHFLGB                                                  01250000
RPHFNFLG EQU   RPHFSTLC                                                 01251000
RPHMLTCP EQU   RPHFLAGS                                                 01252000
RPHSMCLR EQU   RPHFLAGS                                                 01253000
RPHSMTYP EQU   RPHFLAGS                                                 01254000
RPHSMQ   EQU   RPHFLAGS                                                 01255000
RPHAPTYP EQU   RPHFLAGS                                                 01256000
RPHSPGIN EQU   RPHFLAGS                                                 01257000
RPHOGIND EQU   RPHFLAGS                                                 01258000
RPHLNGTH EQU   RPHCNTL+1                                                01259000
RPHTYPE  EQU   RPHCNTL                                                  01260000
DYPPAB   EQU   ISTDYPAB+16                                              01261000
DYPOCRPH EQU   DYPPACMD                                                 01262000
DYPTSKID EQU   ISTDYPAB+8                                               01263000
DYPPACTB EQU   DYPCHAIN                                                 01264000
DYPFLGS  EQU   ISTDYPAB+2                                               01265000
DYPLNGTH EQU   ISTDYPAB+1                                               01266000
DYPTYPE  EQU   ISTDYPAB                                                 01267000
PABRPHA  EQU   PABRPHFG+1                                               01268000
PABNODQ  EQU   PABFLAGS                                                 01269000
PABINHBT EQU   PABFLAGS                                                 01270000
PABERLOK EQU   PABERRLK                                                 01271000
PABSSN   EQU   PABFLAGS                                                 01272000
PABDYNAM EQU   PABFLAGS                                                 01273000
PABXTND  EQU   PABFLAGS                                                 01274000
PABPRIOR EQU   PABFLAGS                                                 01275000
PABAPYP  EQU   PABFLAGS                                                 01276000
PABDVTA  EQU   ISTPAB+9                                                 01277000
PABOFFST EQU   ISTPAB+8                                                 01278000
PABCHNGP EQU   PABCHAIN+1                                               01279000
PABRSV02 EQU   PABCHAIN                                                 01280000
PABDELAY EQU   PABCHAIN                                                 01281000
PABQUED  EQU   PABRUNNG                                                 01282000
PABRESET EQU   PABCHAIN                                                 01283000
PABUNCON EQU   PABCHAIN                                                 01284000
PABCDP   EQU   PABCHAIN                                                 01285000
PABRESCH EQU   PABCHAIN                                                 01286000
PABCHNG  EQU   PABCHAIN                                                 01287000
PABWEQP  EQU   PABWEQA+1                                                01288000
PABRSV01 EQU   PABWEQA                                                  01289000
PABWEQG  EQU   PABWEQA                                                  01290000
LOKXCL   EQU   @NM00003                                                 01291000
LOKPRY   EQU   @NM00003                                                 01292000
@NM00004 EQU   @NM00003                                                 01293000
@NM00002 EQU   LOKCHNG                                                  01294000
LOKCT    EQU   ISTLOK                                                   01295000
@NM00001 EQU   CITSAVE                                                  01296000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01297000
@RF00180 EQU   CITTREL                                                  01298000
@RF00184 EQU   CITTREL                                                  01299000
@RF00188 EQU   CITTREL                                                  01300000
@ENDDATA EQU   *                                                        01301000
         END   ISTINCIT,(C'PLS1259',0702,78336)                         01302000
