         TITLE 'ROUTINE SERVICE MODULE - ISTSC02E'                      00001000
* IBM DISK OPERATING SYSTEM                                             00002000
* TOLTEP - 5745-SC-TLT                                                  00003000
          ISEQ 73,80                                                    00004000
ISTSC02E CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'ISTSC02E  78.337'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  ST    @14,12(,@13)                                        0002 00012000
         STM   @00,@12,20(@13)                                     0002 00013000
         BALR  @12,0                                               0002 00014000
@PSTART  DS    0H                                                  0002 00015000
         USING @PSTART,@12                                         0002 00016000
*   R15=R13;                        /* SET BACKSAVE PTR              */ 00017000
         LR    R15,R13                                             0042 00018000
*   R13=ADDR(SVESC02E);             /* PICK UP PTR TO SAVE AREA      */ 00019000
         LA    R13,SVESC02E(,WAPTR)                                0043 00020000
*   BACKSAVE(3)=R13;                /* CHAIN BACKAREA & THIS AREA    */ 00021000
         ST    R13,BACKSAVE+8(,R15)                                0044 00022000
*   SVESC02E(2)=R15;                /* TOGETHER                      */ 00023000
         ST    R15,SVESC02E+4(,WAPTR)                              0045 00024000
*   RTNMAP=R1;                      /* SAVE PARM POINTER.            */ 00025000
         LR    RTNMAP,R1                                           0046 00026000
*   $RETMASK='00'X;                 /* RESET RETURN CODE MASK BYTE   */ 00027000
         MVI   $RETMASK(WAPTR),X'00'                               0047 00028000
*   $TRTN#=$RTNENUM;                /* ROUTINE NUMBER FOR TRACE      */ 00029000
         SLR   @09,@09                                             0048 00030000
         IC    @09,$RTNENUM(,RTNMAP)                               0048 00031000
         STC   @09,$TRTN#(,WAPTR)                                  0048 00032000
*   $TESTERR=OFF;                   /* RESET TEST ERROR BIT          */ 00033000
         NI    $TESTERR(WAPTR),B'01111111'                         0049 00034000
*   RTNSEL(1:8)=$RT0108;            /* FIRST BYTE OF ROUTINE FLAGS   */ 00035000
         MVC   RTNSEL(1,WAPTR),$RT0108(WAPTR)                      0050 00036000
*   RTNSEL(9:16)=$RT0916;           /* SECOND BYTE ROUTINE FLAGS     */ 00037000
         MVC   RTNSEL+1(1,WAPTR),$RT0916(WAPTR)                    0051 00038000
*   RTNSEL(17:256)=$ROUTMSK;        /* LAST 14 BYTES ROUTINE FLAGS   */ 00039000
         MVC   RTNSEL+2(30,WAPTR),$ROUTMSK(WAPTR)                  0052 00040000
*/********************************************************************/ 00041000
*/* CHECK THE SELECTED ROUTINE NUMBER IN THE ROUTINE PARAMETER LIST  */ 00042000
*/* AGAINST A SET OF FLAGS REPRESENTING THE ROUTINES SELECTED FOR    */ 00043000
*/* EXECUTION BY THE OPERATOR.                                       */ 00044000
*/********************************************************************/ 00045000
*                                                                  0053 00046000
*   X=$RTNENUM-1;                   /* DECREMENT ROUTINE SELECTION   */ 00047000
         BCTR  @09,0                                               0053 00048000
         LR    X,@09                                               0053 00049000
*   R7=X/8;                         /* FIND ROUTINE MASK BYTE        */ 00050000
         LR    R7,X                                                0054 00051000
         SRL   R7,3                                                0054 00052000
*   R6=X//8;                        /* SAVE THE REMAINDER            */ 00053000
         LR    @10,X                                               0055 00054000
         SRDA  @10,32                                              0055 00055000
         D     @10,@CF00039                                        0055 00056000
         LR    R6,@10                                              0055 00057000
*   R1=0;                           /* RESET R1 TO ZEROS             */ 00058000
         SLR   R1,R1                                               0056 00059000
*   GEN(IC R1,MASKLIST(R6));        /* SELECT PROPER BIT MASK        */ 00060000
         IC R1,MASKLIST(R6)                                             00061000
*   R7=R7+ADDR($INBUFR);            /* CALCULATE ADDRESS OF ROUTINE     00062000
*                                      FLAGS FOR THIS ROUTINE.       */ 00063000
         LA    @09,$INBUFR(,WAPTR)                                 0058 00064000
         ALR   R7,@09                                              0058 00065000
*   GEN(EX R1,TSTMSK);              /* TEST FOR SELECTED FLAG ON     */ 00066000
         EX R1,TSTMSK                                                   00067000
*   BC(8,S2EC0005);                 /* BRANCH IF NOT ON.             */ 00068000
         BC    8,S2EC0005                                          0060 00069000
*/********************************************************************/ 00070000
*/* CHECK FOR MANUAL INTERVENTION REQUIRED BY THIS ROUTINE.          */ 00071000
*/********************************************************************/ 00072000
*                                                                  0061 00073000
*   IF $RTNMI=ON                    /* CHECK FOR MI REQUIRED         */ 00074000
*       &$MANINTV=OFF               /* AND MANUAL INTERVENTION IS NOT   00075000
*                                      ALLOWED.                      */ 00076000
*     THEN                                                         0061 00077000
         TM    $RTNMI(RTNMAP),B'10000000'                          0061 00078000
         BNO   @RF00061                                            0061 00079000
         TM    $MANINTV(WAPTR),B'10000000'                         0061 00080000
         BNZ   @RF00061                                            0061 00081000
*     DO;                                                          0062 00082000
*                                                                  0062 00083000
*/* ******************************************************************/ 00084000
*/*  MANUAL INTERVETION IS REQUIRED BY THIS ROUTINE BUT IS NOT       */ 00085000
*/*  ALLOWED PER OPERATOR OPTIONS. RTN BYPASSED.                     */ 00086000
*/* ******************************************************************/ 00087000
*                                                                  0063 00088000
*       GEN(BAL R14,S2EC0050);      /* CALL MSG SUBROUTINE           */ 00089000
*                                                                  0063 00090000
         BAL R14,S2EC0050                                               00091000
*       /*************************************************************/ 00092000
*       /*                                                           */ 00093000
*       /* TCEC MSGN(210)SUB(YES) INVOKED                            */ 00094000
*       /*                                                           */ 00095000
*       /*************************************************************/ 00096000
*                                                                  0064 00097000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00098000
         OI    $TCECM(WAPTR),B'00000001'                           0064 00099000
*       R1=ADDR($TCA07);            /* SET UP PARM LIST $TR          */ 00100000
         LA    R1,$TCA07                                           0065 00101000
*       CALL #EXIT;                 /* CALL CECOM                    */ 00102000
         L     @15,#EXITA(,WAPTR)                                  0066 00103000
         BALR  @14,@15                                             0066 00104000
*       DCL                                                        0067 00105000
*         1 $TCA07,                 /* TCEC PARM LIST                */ 00106000
*          2 $TCB07 FIXED(32) INIT(210),/* MSG NUMBER                */ 00107000
*          2 $TCC07 FIXED(32) INIT(0),/* INCT LEN                    */ 00108000
*          2 $TCD07 BIT(8) INIT('10000000'B),/* FLAG                 */ 00109000
*          2 $TCE07 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 00110000
*       GO TO S2EC0005;                                            0068 00111000
         B     S2EC0005                                            0068 00112000
*     END;                                                         0069 00113000
*   IF $CTEQTT=ON                   /* IF CT ON SME LINE AS TT       */ 00114000
*       &$DCL=ON THEN               /* AND ROUTINE MACRO EXPANSION 0070 00115000
*                                      INDICATES IT CANNOT BE RUN IN    00116000
*                                      THIS CASE BECAUSE OF POSSIBLE    00117000
*                                      HANG UPS WITH TWO WAY       0070 00118000
*                                      MESSAGES, THEN BYPASS THIS  0070 00119000
*                                      ROUTINE.                      */ 00120000
@RF00061 TM    $CTEQTT(WAPTR),B'00010000'                          0070 00121000
         BNO   @RF00070                                            0070 00122000
         TM    $DCL(RTNMAP),B'00100000'                            0070 00123000
         BNO   @RF00070                                            0070 00124000
*     DO;                                                          0071 00125000
*                                                                  0071 00126000
*/********************************************************************/ 00127000
*/* EITHER CT OR AP IS ON SAME LINE AS A TEST TERMINAL AND THIS      */ 00128000
*/* ROUTINE CANNOT BE EXECUTED UNDER THAT CONDITION.                 */ 00129000
*/****************************************************************** */ 00130000
*                                                                  0072 00131000
*       GEN(BAL R14,S2EC0050);      /* CALL MSG SUBROUTINE           */ 00132000
*                                                                  0072 00133000
         BAL R14,S2EC0050                                               00134000
*       /*************************************************************/ 00135000
*       /*                                                           */ 00136000
*       /* TCEC MSGN(210)SUB(YES)MSGMSK('40000000'X) INVOKED         */ 00137000
*       /*                                                           */ 00138000
*       /*************************************************************/ 00139000
*                                                                  0073 00140000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00141000
         OI    $TCECM(WAPTR),B'00000001'                           0073 00142000
*       R1=ADDR($TCA08);            /* SET UP PARM LIST $TR          */ 00143000
         LA    R1,$TCA08                                           0074 00144000
*       CALL S20CEC03;              /* CALL TCEC-MULTIPLE LN         */ 00145000
         L     @15,@CV00644                                        0075 00146000
         BALR  @14,@15                                             0075 00147000
*       DCL                                                        0076 00148000
*         1 $TCA08,                 /* TCEC PARM LIST                */ 00149000
*          2 $TCB08 FIXED(32) INIT(210),/* MSG NUMBER                */ 00150000
*          2 $TCC08 FIXED(32) INIT(0),/* INCT LEN                    */ 00151000
*          2 $TCD08 BIT(8) INIT('10000000'B),/* FLAG                 */ 00152000
*          2 $TCE08 CHAR(4) INIT('40000000'X);/* MSSAGE MASK         */ 00153000
*       GO TO S2EC0005;                                            0077 00154000
         B     S2EC0005                                            0077 00155000
*     END;                                                         0078 00156000
*   ELSE                                                           0079 00157000
*     GO TO S2EC0020;                                              0079 00158000
*S2EC0005:                                                         0080 00159000
*   RET14=$RTNEEXT;                 /* SET RETURN REGISTER IN OLTS 0080 00160000
*                                      SAVE AREA TO POINT TO NEXT  0080 00161000
*                                      ROUTINE.                      */ 00162000
S2EC0005 L     @09,$R13PTR(,WAPTR)                                 0080 00163000
         L     @04,$RTNEEXT(,RTNMAP)                               0080 00164000
         ST    @04,RET14(,@09)                                     0080 00165000
*   R15=4;                                                         0081 00166000
         LA    R15,4                                               0081 00167000
*   GOTO S2EC0015;                                                 0082 00168000
         B     S2EC0015                                            0082 00169000
*S2EC0010:                                                         0083 00170000
*   R15=0;                          /* ZERO RETURN CODE              */ 00171000
S2EC0010 SLR   R15,R15                                             0083 00172000
*S2EC0015:                                                         0084 00173000
*   RET15=R15;                      /* RESET RETURN CODE REGISTER IN    00174000
*                                      OLTS SAVE AREA.               */ 00175000
S2EC0015 L     @09,$R13PTR(,WAPTR)                                 0084 00176000
         ST    R15,RET15(,@09)                                     0084 00177000
*   R13=SVESC02E(2);                /* RESTORE R13 TO ORIG VALUE     */ 00178000
         L     R13,SVESC02E+4(,WAPTR)                              0085 00179000
*   RETURN;                         /* RETURN VIA SAVE AREA MGR.     */ 00180000
@EL00001 DS    0H                                                  0086 00181000
@EF00001 DS    0H                                                  0086 00182000
@ER00001 L     @14,12(,@13)                                        0086 00183000
         LM    @00,@12,20(@13)                                     0086 00184000
         BR    @14                                                 0086 00185000
*S2EC0020:                                                         0087 00186000
*   $RTN#=$RTNENUM;                 /* MOVE RTN# INTO SECTION PREF   */ 00187000
S2EC0020 L     @09,$LOWADDR(,WAPTR)                                0087 00188000
         LH    @04,RTNDISP(,@09)                                   0087 00189000
         ALR   @04,@09                                             0087 00190000
         IC    @09,$RTNENUM(,RTNMAP)                               0087 00191000
         STC   @09,$RTN#(,@04)                                     0087 00192000
*   $REFNUM=$RTNEREF;               /* SET UP REF NUMB               */ 00193000
         MVC   $REFNUM(1,@04),$RTNEREF(RTNMAP)                     0088 00194000
*   GO TO S2EC0010;                 /* RETURN.                       */ 00195000
         B     S2EC0010                                            0089 00196000
*/********************************************************************/ 00197000
*/* THE FOLLOWING INSTRUCTION IS THE TARGET OF AN EX (EXECUTE) INSTR.*/ 00198000
*/********************************************************************/ 00199000
*                                                                  0090 00200000
*TSTMSK:                                                           0090 00201000
*   GEN(TM 0(R7),0);                                               0090 00202000
*                                                                  0090 00203000
TSTMSK   TM 0(R7),0                                                     00204000
*/****************************************************************** */ 00205000
*/* THE FOLLOWING SUBROUTINE CONVERTS ROUTINE NUMBER TO EBCDIC       */ 00206000
*/****************************************************************** */ 00207000
*                                                                  0091 00208000
*S2EC0050:                                                         0091 00209000
*   R1=$RTNENUM;                    /* ROUTINE NUMBER IN HEX         */ 00210000
S2EC0050 SLR   R1,R1                                               0091 00211000
         IC    R1,$RTNENUM(,RTNMAP)                                0091 00212000
*   CVD(R1,$INBUFR(70:77));         /* ROUTINE NUMBER IN PACKED    0092 00213000
*                                      DECIMAL.                      */ 00214000
         CVD   R1,$INBUFR+69(,WAPTR)                               0092 00215000
*   UNPK($INBUFR(1:4),$INBUFR(75:77));/* UNPACK                      */ 00216000
         UNPK  $INBUFR(4,WAPTR),$INBUFR+74(3,WAPTR)                0093 00217000
*   MVZ($INBUFR(4:4),$INBUFR(3:3)); /* ZONE TO SIGN.                 */ 00218000
         MVZ   $INBUFR+3(1,WAPTR),$INBUFR+2(WAPTR)                 0094 00219000
*   GEN(BR R14);                    /* RETURN                        */ 00220000
         BR R14                                                         00221000
*   DO;                             /* ATDSPLY                       */ 00222000
*   END;                            /* ATDSPLY                       */ 00223000
*   END ISTSC02E;                                                  0098 00224000
         B     @EL00001                                            0098 00225000
@DATA    DS    0H                                                       00226000
         DS    0F                                                       00227000
         DS    0F                                                       00228000
@CF00039 DC    F'8'                                                     00229000
@CV00644 DC    V(S20CEC03)                                              00230000
         DS    0D                                                       00231000
MASKLIST DC    X'8040201008040201'                                      00232000
$TCA07   DS    CL13                                                     00233000
         ORG   $TCA07                                                   00234000
$TCB07   DC    A(210)                                                   00235000
$TCC07   DC    A(0)                                                     00236000
$TCD07   DC    B'10000000'                                              00237000
$TCE07   DC    X'FFFFFFFF'                                              00238000
         ORG   $TCA07+13                                                00239000
         DS    CL3                                                      00240000
$TCA08   DS    CL13                                                     00241000
         ORG   $TCA08                                                   00242000
$TCB08   DC    A(210)                                                   00243000
$TCC08   DC    A(0)                                                     00244000
$TCD08   DC    B'10000000'                                              00245000
$TCE08   DC    X'40000000'                                              00246000
         ORG   $TCA08+13                                                00247000
         DS    CL3                                                      00248000
PATCH    DC    8F'0'                                                    00249000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00250000
@01      EQU   01                                                       00251000
@02      EQU   02                                                       00252000
@03      EQU   03                                                       00253000
@04      EQU   04                                                       00254000
@05      EQU   05                                                       00255000
@06      EQU   06                                                       00256000
@07      EQU   07                                                       00257000
@08      EQU   08                                                       00258000
@09      EQU   09                                                       00259000
@10      EQU   10                                                       00260000
@11      EQU   11                                                       00261000
@12      EQU   12                                                       00262000
@13      EQU   13                                                       00263000
@14      EQU   14                                                       00264000
@15      EQU   15                                                       00265000
WAPTR    EQU   @02                                                      00266000
RTNMAP   EQU   @05                                                      00267000
R15      EQU   @15                                                      00268000
R1       EQU   @01                                                      00269000
R2       EQU   @02                                                      00270000
R6       EQU   @06                                                      00271000
R7       EQU   @07                                                      00272000
X        EQU   @08                                                      00273000
R13      EQU   @13                                                      00274000
R14      EQU   @14                                                      00275000
R10      EQU   @10                                                      00276000
TOLTEPWA EQU   0                                                        00277000
$SCTTBLE EQU   TOLTEPWA                                                 00278000
$TESTOPT EQU   $SCTTBLE+2                                               00279000
$ERROPT  EQU   $SCTTBLE+3                                               00280000
$TESTERR EQU   $ERROPT                                                  00281000
$RT0108  EQU   $SCTTBLE+4                                               00282000
$RT0916  EQU   $SCTTBLE+5                                               00283000
$PDEVFLG EQU   $SCTTBLE+10                                              00284000
$CDSFLGS EQU   $SCTTBLE+11                                              00285000
$CDS8T19 EQU   $SCTTBLE+20                                              00286000
$EXECFLG EQU   $SCTTBLE+33                                              00287000
$OLTFLGS EQU   $SCTTBLE+36                                              00288000
$MANINTV EQU   $OLTFLGS                                                 00289000
$OLTFLG2 EQU   $SCTTBLE+37                                              00290000
$TOTFLG1 EQU   $SCTTBLE+38                                              00291000
$CTEQTT  EQU   $TOTFLG1                                                 00292000
$ROUTMSK EQU   $SCTTBLE+40                                              00293000
$RETMASK EQU   $SCTTBLE+70                                              00294000
$CDA     EQU   TOLTEPWA+100                                             00295000
$RCA     EQU   $CDA+44                                                  00296000
$OLTPTR  EQU   $CDA+52                                                  00297000
$LOWADDR EQU   $OLTPTR                                                  00298000
$HIMOREC EQU   $CDA+60                                                  00299000
$R13PTR  EQU   $CDA+80                                                  00300000
$COMMFLG EQU   TOLTEPWA+224                                             00301000
$FLAG1   EQU   $COMMFLG                                                 00302000
$FLAG2   EQU   $COMMFLG+1                                               00303000
$FLAG3   EQU   $COMMFLG+2                                               00304000
$FLAG4   EQU   $COMMFLG+3                                               00305000
$FLAG5   EQU   $COMMFLG+4                                               00306000
$EOJ     EQU   $FLAG5                                                   00307000
$CANCEL  EQU   $EOJ                                                     00308000
$FLAG6   EQU   $COMMFLG+5                                               00309000
$ABNDBIT EQU   $FLAG6                                                   00310000
$FLAG7   EQU   $COMMFLG+6                                               00311000
$FLAG8   EQU   $COMMFLG+7                                               00312000
$TCECM   EQU   $FLAG8                                                   00313000
$FLAG9   EQU   $COMMFLG+8                                               00314000
$FLAG10  EQU   $COMMFLG+9                                               00315000
$FLAG11  EQU   $COMMFLG+10                                              00316000
$FLAG12  EQU   $COMMFLG+11                                              00317000
$FLAG13  EQU   $COMMFLG+12                                              00318000
$DEVTBLE EQU   TOLTEPWA+240                                             00319000
$DEVCDS  EQU   $DEVTBLE                                                 00320000
$DEVUNAD EQU   $DEVCDS                                                  00321000
@NM00035 EQU   $DEVUNAD+2                                               00322000
$DEVFEAT EQU   $DEVCDS+4                                                00323000
$DEVCDSF EQU   $DEVCDS+9                                                00324000
$DEVSDCF EQU   $DEVCDS+10                                               00325000
$$SYMNME EQU   $DEVCDS+12                                               00326000
$DEVFLG1 EQU   $DEVTBLE+20                                              00327000
$EVNCPLT EQU   $DEVFLG1                                                 00328000
$ATTNEXP EQU   $DEVFLG1                                                 00329000
$INTOCC  EQU   $DEVFLG1                                                 00330000
$DEVFLG2 EQU   $DEVTBLE+21                                              00331000
$DEVTECB EQU   $DEVTBLE+22                                              00332000
$OPIS    EQU   $DEVTECB                                                 00333000
$OPND    EQU   $DEVTECB+2                                               00334000
$DEVFLG3 EQU   $DEVTBLE+27                                              00335000
$SIOFLG  EQU   $DEVFLG3                                                 00336000
$IFTOUT  EQU   $DEVTBLE+36                                              00337000
$DEVSESP EQU   $IFTOUT                                                  00338000
$SSCPDAF EQU   $IFTOUT+6                                                00339000
$LDNCBPT EQU   $DEVTBLE+48                                              00340000
$RNINFO  EQU   $DEVTBLE+56                                              00341000
$DEVFLG5 EQU   $RNINFO+8                                                00342000
$DEVFLG4 EQU   $DEVTBLE+65                                              00343000
$INBUFR  EQU   TOLTEPWA+2104                                            00344000
#EXITA   EQU   TOLTEPWA+2632                                            00345000
$CCOMDAT EQU   TOLTEPWA+2644                                            00346000
$CFLGS   EQU   $CCOMDAT+16                                              00347000
$24FEMSG EQU   TOLTEPWA+2681                                            00348000
$24CATMG EQU   $24FEMSG+11                                              00349000
@NM00043 EQU   TOLTEPWA+2776                                            00350000
$OUNTPTR EQU   @NM00043+4                                               00351000
$NSPTR   EQU   $OUNTPTR                                                 00352000
$NSCNT   EQU   @NM00043+10                                              00353000
$ENXX    EQU   @NM00043+15                                              00354000
$IMITX   EQU   $ENXX                                                    00355000
$TRTN#   EQU   TOLTEPWA+2815                                            00356000
SVESC033 EQU   TOLTEPWA+3160                                            00357000
SVECC013 EQU   TOLTEPWA+3232                                            00358000
SVEIC003 EQU   TOLTEPWA+3592                                            00359000
SVESC022 EQU   TOLTEPWA+3736                                            00360000
SVECC011 EQU   TOLTEPWA+4024                                            00361000
#EXIT    EQU   0                                                        00362000
RTNEMAP  EQU   0                                                        00363000
$RTNEEXT EQU   RTNEMAP+4                                                00364000
$RTNENUM EQU   RTNEMAP+8                                                00365000
$RTNEREF EQU   RTNEMAP+9                                                00366000
$RTNEFLG EQU   RTNEMAP+10                                               00367000
$RTNMI   EQU   $RTNEFLG                                                 00368000
$DCL     EQU   $RTNEFLG                                                 00369000
@NM00047 EQU   0                                                        00370000
RTNDISP  EQU   @NM00047+10                                              00371000
INST     EQU   @NM00047+12                                              00372000
$NEWSPRF EQU   0                                                        00373000
$RTN#    EQU   $NEWSPRF                                                 00374000
#FLAGS   EQU   $NEWSPRF+16                                              00375000
$REFNUM  EQU   $NEWSPRF+17                                              00376000
BACKSAVE EQU   0                                                        00377000
SAVEMAP  EQU   0                                                        00378000
RET14    EQU   SAVEMAP+12                                               00379000
RET15    EQU   SAVEMAP+16                                               00380000
OLTENTRY EQU   0                                                        00381000
SVESC02E EQU   SVESC022                                                 00382000
RTNSEL   EQU   $INBUFR                                                  00383000
SVECC012 EQU   SVESC022                                                 00384000
SVEIC00A EQU   SVEIC003                                                 00385000
SVEIC004 EQU   SVEIC003                                                 00386000
SVEIC005 EQU   SVEIC003                                                 00387000
SVESC02A EQU   SVESC022                                                 00388000
SVESC02B EQU   SVESC022                                                 00389000
SVESC02D EQU   SVESC022                                                 00390000
SVESC02F EQU   SVECC013                                                 00391000
SVESC024 EQU   SVESC022                                                 00392000
SVESC027 EQU   SVESC022                                                 00393000
SVESC029 EQU   SVESC033                                                 00394000
SVESC031 EQU   SVECC013                                                 00395000
SVESC032 EQU   SVECC011                                                 00396000
SVETC037 EQU   SVEIC003                                                 00397000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00398000
FILL     EQU   SAVEMAP                                                  00399000
$RME     EQU   $NEWSPRF+36                                              00400000
@NM00050 EQU   $NEWSPRF+35                                              00401000
$ECA     EQU   $NEWSPRF+32                                              00402000
$DCHB    EQU   $NEWSPRF+28                                              00403000
$MOSIZE  EQU   $NEWSPRF+24                                              00404000
$RTSIZE  EQU   $NEWSPRF+20                                              00405000
$COUNT   EQU   $NEWSPRF+18                                              00406000
@NM00049 EQU   #FLAGS                                                   00407000
#MSGIDRQ EQU   #FLAGS                                                   00408000
#PLKMCOR EQU   #FLAGS                                                   00409000
@NM00048 EQU   #FLAGS                                                   00410000
$VIRTUAL EQU   #FLAGS                                                   00411000
$PLINK$  EQU   $NEWSPRF+12                                              00412000
$SCTREQ  EQU   $NEWSPRF+11                                              00413000
$RM      EQU   $NEWSPRF+9                                               00414000
$CTYPE   EQU   $NEWSPRF+8                                               00415000
$CCLASS  EQU   $NEWSPRF+7                                               00416000
$CFEAT   EQU   $NEWSPRF+6                                               00417000
$CMODEL  EQU   $NEWSPRF+5                                               00418000
$TYPE    EQU   $NEWSPRF+4                                               00419000
$CLASS   EQU   $NEWSPRF+3                                               00420000
$FEAT    EQU   $NEWSPRF+2                                               00421000
$MODEL   EQU   $NEWSPRF+1                                               00422000
#MSGID   EQU   @NM00047+16                                              00423000
LEVEL    EQU   @NM00047+8                                               00424000
SECTID   EQU   @NM00047                                                 00425000
@NM00046 EQU   $RTNEFLG                                                 00426000
$TRMYES  EQU   $RTNEFLG                                                 00427000
$RTNIDNT EQU   RTNEMAP+2                                                00428000
$RTNLEVL EQU   RTNEMAP+1                                                00429000
$RTNTRMG EQU   RTNEMAP                                                  00430000
SVECC010 EQU   TOLTEPWA+3952                                            00431000
SVETC035 EQU   TOLTEPWA+3880                                            00432000
SVESC030 EQU   TOLTEPWA+3808                                            00433000
SVESC020 EQU   TOLTEPWA+3664                                            00434000
SVEIC002 EQU   TOLTEPWA+3520                                            00435000
SVECC014 EQU   TOLTEPWA+3376                                            00436000
SVESC120 EQU   TOLTEPWA+3304                                            00437000
SVESC025 EQU   TOLTEPWA+3088                                            00438000
@NM00045 EQU   TOLTEPWA+2980                                            00439000
$RPLERR  EQU   TOLTEPWA+2977                                            00440000
@NM00044 EQU   TOLTEPWA+2976                                            00441000
$R13PR3  EQU   TOLTEPWA+2972                                            00442000
$CEINT2  EQU   TOLTEPWA+2968                                            00443000
$CEINT1  EQU   TOLTEPWA+2964                                            00444000
$MSGGET  EQU   TOLTEPWA+2960                                            00445000
$ACQLIST EQU   TOLTEPWA+2956                                            00446000
$R4SAVE1 EQU   TOLTEPWA+2952                                            00447000
$CLSISS  EQU   TOLTEPWA+2950                                            00448000
$CLSCNT  EQU   TOLTEPWA+2948                                            00449000
$CUTABLE EQU   TOLTEPWA+2868                                            00450000
$BUFSZ2  EQU   TOLTEPWA+2864                                            00451000
$RESID2  EQU   TOLTEPWA+2860                                            00452000
$OLTCCW2 EQU   TOLTEPWA+2856                                            00453000
$ENDBFR2 EQU   TOLTEPWA+2852                                            00454000
$1STBFR2 EQU   TOLTEPWA+2848                                            00455000
$TECB2   EQU   TOLTEPWA+2844                                            00456000
$BUFSZ1  EQU   TOLTEPWA+2840                                            00457000
$RESID1  EQU   TOLTEPWA+2836                                            00458000
$OLTCCW1 EQU   TOLTEPWA+2832                                            00459000
$ENDBFR1 EQU   TOLTEPWA+2828                                            00460000
$1STBFR1 EQU   TOLTEPWA+2824                                            00461000
$TECB1   EQU   TOLTEPWA+2820                                            00462000
$WAITIME EQU   TOLTEPWA+2816                                            00463000
$WIODEV  EQU   TOLTEPWA+2814                                            00464000
$RQSTSZE EQU   TOLTEPWA+2812                                            00465000
$RQSTPTR EQU   TOLTEPWA+2808                                            00466000
$R4SAVE  EQU   TOLTEPWA+2804                                            00467000
$PARTADR EQU   TOLTEPWA+2800                                            00468000
$TBSDATA EQU   TOLTEPWA+2796                                            00469000
$CTWIDTH EQU   TOLTEPWA+2795                                            00470000
$CTLINE  EQU   TOLTEPWA+2794                                            00471000
$APWIDTH EQU   TOLTEPWA+2793                                            00472000
$APLINE  EQU   TOLTEPWA+2792                                            00473000
$INDEX   EQU   $IMITX                                                   00474000
$UMXX    EQU   @NM00043+14                                              00475000
$NSXX    EQU   @NM00043+12                                              00476000
$ATACNT  EQU   $NSCNT                                                   00477000
$CTR     EQU   @NM00043+8                                               00478000
$ATAPTR  EQU   $NSPTR                                                   00479000
$DDRPTR  EQU   @NM00043                                                 00480000
$DTORESP EQU   TOLTEPWA+2712                                            00481000
$APNAME  EQU   TOLTEPWA+2704                                            00482000
$24SYMNE EQU   $24CATMG+4                                               00483000
$24DEVAD EQU   $24CATMG                                                 00484000
$24RTN#  EQU   $24FEMSG+8                                               00485000
$ESECTID EQU   $24FEMSG                                                 00486000
$24FLGS  EQU   TOLTEPWA+2680                                            00487000
$24SAVE2 EQU   TOLTEPWA+2676                                            00488000
$24SAVE1 EQU   TOLTEPWA+2672                                            00489000
$24UNADR EQU   TOLTEPWA+2668                                            00490000
$24SAV13 EQU   TOLTEPWA+2664                                            00491000
$24RETCD EQU   TOLTEPWA+2663                                            00492000
$MACID   EQU   TOLTEPWA+2661                                            00493000
$CSPARE  EQU   $CFLGS                                                   00494000
$C2WAY   EQU   $CFLGS                                                   00495000
$CINCT   EQU   $CCOMDAT+12                                              00496000
$CINADR  EQU   $CCOMDAT+8                                               00497000
$COUTCT  EQU   $CCOMDAT+4                                               00498000
$COUTAD  EQU   $CCOMDAT                                                 00499000
ROOTLOC  EQU   TOLTEPWA+2640                                            00500000
$RETREG  EQU   TOLTEPWA+2636                                            00501000
$WORK    EQU   TOLTEPWA+2376                                            00502000
$EXTA    EQU   TOLTEPWA+2320                                            00503000
$PASSONA EQU   TOLTEPWA+2264                                            00504000
$TRMINPT EQU   TOLTEPWA+2184                                            00505000
$BUFFER  EQU   TOLTEPWA+1976                                            00506000
$TLTRPL3 EQU   TOLTEPWA+1856                                            00507000
$TLTRPL2 EQU   TOLTEPWA+1736                                            00508000
$TLTRPL1 EQU   TOLTEPWA+1616                                            00509000
$SLTBL   EQU   TOLTEPWA+1468                                            00510000
$CDEVPT  EQU   TOLTEPWA+1466                                            00511000
$DEVCNTS EQU   TOLTEPWA+1464                                            00512000
$FEEDBCK EQU   $DEVTBLE+66                                              00513000
$WTISUED EQU   $DEVFLG4                                                 00514000
$EXIOISD EQU   $DEVFLG4                                                 00515000
$REMWRIT EQU   $DEVFLG4                                                 00516000
$REMDONE EQU   $DEVFLG4                                                 00517000
$2NDUSED EQU   $DEVFLG4                                                 00518000
$1STUSED EQU   $DEVFLG4                                                 00519000
$IGLXIFB EQU   $DEVFLG4                                                 00520000
$EXIOLV3 EQU   $DEVFLG4                                                 00521000
@NM00042 EQU   $DEVFLG5                                                 00522000
$DVBASIC EQU   $DEVFLG5                                                 00523000
$ASCII   EQU   $DEVFLG5                                                 00524000
$DEVLU   EQU   $DEVFLG5                                                 00525000
$OPNDFAL EQU   $DEVFLG5                                                 00526000
$ACQNCB  EQU   $DEVFLG5                                                 00527000
$REMOTE  EQU   $DEVFLG5                                                 00528000
$ENDNODE EQU   $DEVFLG5                                                 00529000
$LINENME EQU   $RNINFO                                                  00530000
$CID     EQU   $DEVTBLE+52                                              00531000
$DVCOL   EQU   $LDNCBPT+2                                               00532000
$DVROW   EQU   $LDNCBPT                                                 00533000
$NCSPLP  EQU   $DEVTBLE+44                                              00534000
$DVLN    EQU   $SSCPDAF                                                 00535000
$DAF     EQU   $DEVSESP+4                                               00536000
$VARYPAB EQU   $DEVSESP                                                 00537000
$SYSMN   EQU   $DEVTBLE+28                                              00538000
@NM00041 EQU   $DEVFLG3                                                 00539000
$CLRSNT  EQU   $DEVFLG3                                                 00540000
$OLTERR  EQU   $DEVFLG3                                                 00541000
$SRTEST  EQU   $DEVFLG3                                                 00542000
$DVSNDOK EQU   $SIOFLG                                                  00543000
$POLLREQ EQU   $DEVFLG3                                                 00544000
$ACQRED  EQU   $DEVFLG3                                                 00545000
$NOTDEV  EQU   $DEVFLG3                                                 00546000
$DVINCT  EQU   $DEVTBLE+26                                              00547000
$DVBRKST EQU   $OPND+1                                                  00548000
$DVBRKSN EQU   $OPND                                                    00549000
$DVSEQNO EQU   $OPIS                                                    00550000
$CEINTRP EQU   $DEVFLG2                                                 00551000
$TESTMDE EQU   $DEVFLG2                                                 00552000
$DEVALOC EQU   $DEVFLG2                                                 00553000
$ALLDATA EQU   $DEVFLG2                                                 00554000
$ENDCNTL EQU   $DEVFLG2                                                 00555000
$CTLDEV  EQU   $DEVFLG2                                                 00556000
$NOCDS   EQU   $DEVFLG2                                                 00557000
$DATAIN  EQU   $DEVFLG2                                                 00558000
$PRIMARY EQU   $DEVFLG1                                                 00559000
$DVCTBYT EQU   $INTOCC                                                  00560000
$DEVACT  EQU   $DEVFLG1                                                 00561000
$DVLGMDE EQU   $ATTNEXP                                                 00562000
$DVSPRM  EQU   $EVNCPLT                                                 00563000
$GRABBED EQU   $DEVFLG1                                                 00564000
$CATASTR EQU   $DEVFLG1                                                 00565000
$LETGO   EQU   $DEVFLG1                                                 00566000
$CURELEM EQU   $$SYMNME+4                                               00567000
$MSGOTSD EQU   $$SYMNME                                                 00568000
$EXTDEV  EQU   $DEVCDS+11                                               00569000
@NM00040 EQU   $DEVSDCF                                                 00570000
$NOTPRIM EQU   $DEVSDCF                                                 00571000
@NM00039 EQU   $DEVCDSF                                                 00572000
@NM00038 EQU   $DEVCDSF                                                 00573000
@NM00037 EQU   $DEVCDSF                                                 00574000
$CDSNAME EQU   $DEVCDSF                                                 00575000
$EXTRN   EQU   $DEVCDSF                                                 00576000
$CEVOLUM EQU   $DEVCDSF                                                 00577000
$SHARD   EQU   $DEVCDSF                                                 00578000
$DEVFPM  EQU   $DEVCDSF                                                 00579000
$DEVCNT  EQU   $DEVCDS+8                                                00580000
$DEVTYPE EQU   $DEVFEAT+3                                               00581000
$DEVCLAS EQU   $DEVFEAT+2                                               00582000
$DEVFRRS EQU   $DEVFEAT+1                                               00583000
$DEVMOD  EQU   $DEVFEAT                                                 00584000
$DEVRDGT EQU   @NM00035+1                                               00585000
$DEVCTLU EQU   @NM00035+1                                               00586000
$DEVCHAN EQU   @NM00035                                                 00587000
@NM00036 EQU   @NM00035                                                 00588000
$CTINDX  EQU   $DEVUNAD                                                 00589000
$FLAG16  EQU   $COMMFLG+15                                              00590000
$FLAG15  EQU   $COMMFLG+14                                              00591000
$FLAG14  EQU   $COMMFLG+13                                              00592000
$TEP2ND  EQU   $FLAG13                                                  00593000
$TEP1ST  EQU   $FLAG13                                                  00594000
$CATMSG  EQU   $FLAG13                                                  00595000
$PRMPTSW EQU   $FLAG13                                                  00596000
$DEVENT  EQU   $FLAG13                                                  00597000
$OLTMACC EQU   $FLAG13                                                  00598000
$LGON    EQU   $FLAG13                                                  00599000
$CTLOGON EQU   $FLAG13                                                  00600000
@NM00034 EQU   $FLAG12                                                  00601000
$VARYINP EQU   $FLAG12                                                  00602000
$ENDTEST EQU   $FLAG12                                                  00603000
$VRYHRD  EQU   $FLAG12                                                  00604000
$VRYSFT  EQU   $FLAG12                                                  00605000
$POSTFLG EQU   $FLAG12                                                  00606000
$OPTMSG  EQU   $FLAG12                                                  00607000
$FEORCAT EQU   $FLAG11                                                  00608000
@NM00033 EQU   $FLAG11                                                  00609000
@NM00032 EQU   $FLAG10                                                  00610000
$INBND   EQU   $FLAG10                                                  00611000
$WAITFLG EQU   $FLAG10                                                  00612000
$DPRINT  EQU   $FLAG10                                                  00613000
$HOLD    EQU   $FLAG9                                                   00614000
$NOTRRCH EQU   $FLAG9                                                   00615000
@NM00031 EQU   $FLAG9                                                   00616000
$COPY    EQU   $FLAG9                                                   00617000
$LSTLNSW EQU   $FLAG9                                                   00618000
$MULLNSW EQU   $FLAG9                                                   00619000
$REMSW   EQU   $FLAG9                                                   00620000
$IGRES   EQU   $FLAG9                                                   00621000
$VS2     EQU   $FLAG8                                                   00622000
$VS1     EQU   $FLAG8                                                   00623000
$EDOS    EQU   $FLAG8                                                   00624000
@NM00030 EQU   $FLAG8                                                   00625000
$TWOWAY  EQU   $FLAG8                                                   00626000
@NM00029 EQU   $FLAG8                                                   00627000
$RCVMSG  EQU   $FLAG7                                                   00628000
$RCVRFLG EQU   $FLAG7                                                   00629000
$SNDRFLG EQU   $FLAG7                                                   00630000
$LDOIS   EQU   $FLAG7                                                   00631000
$DCONTCT EQU   $FLAG7                                                   00632000
$EXIOWAT EQU   $FLAG7                                                   00633000
$2NDDATA EQU   $FLAG7                                                   00634000
$1STDATA EQU   $FLAG7                                                   00635000
$CIREQ   EQU   $FLAG6                                                   00636000
$ABTERM  EQU   $ABNDBIT                                                 00637000
$FSTMCIS EQU   $FLAG6                                                   00638000
$DISCREQ EQU   $FLAG6                                                   00639000
$DISCISS EQU   $FLAG6                                                   00640000
$CHANGE  EQU   $FLAG6                                                   00641000
$CTERROR EQU   $FLAG6                                                   00642000
$RECAL11 EQU   $FLAG6                                                   00643000
@NM00028 EQU   $FLAG5                                                   00644000
$PROGCK  EQU   $CANCEL                                                  00645000
$PRINTAP EQU   $FLAG5                                                   00646000
@NM00027 EQU   $FLAG5                                                   00647000
$MSG922  EQU   $FLAG5                                                   00648000
$CT924   EQU   $FLAG5                                                   00649000
$FSTCAT  EQU   $FLAG5                                                   00650000
$FSTFE   EQU   $FLAG5                                                   00651000
$ACTOPND EQU   $FLAG4                                                   00652000
$ACQCUTT EQU   $FLAG4                                                   00653000
$CLSSACT EQU   $FLAG4                                                   00654000
$BACKINT EQU   $FLAG4                                                   00655000
$DMSGSW  EQU   $FLAG4                                                   00656000
$TSTDEVP EQU   $FLAG4                                                   00657000
$APRQPER EQU   $FLAG4                                                   00658000
$OPCOM   EQU   $FLAG4                                                   00659000
$NEWAP   EQU   $FLAG3                                                   00660000
$ALTPRTR EQU   $FLAG3                                                   00661000
$OPTERR  EQU   $FLAG3                                                   00662000
$PRTONLY EQU   $FLAG3                                                   00663000
$REQSTOR EQU   $FLAG3                                                   00664000
$LOGOFFE EQU   $FLAG3                                                   00665000
$TSTERR  EQU   $FLAG3                                                   00666000
$DEVERR  EQU   $FLAG3                                                   00667000
$PARTIAL EQU   $FLAG2                                                   00668000
$NRMTERM EQU   $FLAG2                                                   00669000
$VALDTST EQU   $FLAG2                                                   00670000
$VALDDEV EQU   $FLAG2                                                   00671000
$DBLSLSH EQU   $FLAG2                                                   00672000
$NDR     EQU   $FLAG2                                                   00673000
@NM00026 EQU   $FLAG2                                                   00674000
$OLTACT  EQU   $FLAG1                                                   00675000
$NORELDV EQU   $FLAG1                                                   00676000
@NM00025 EQU   $FLAG1                                                   00677000
$OPTCHNG EQU   $FLAG1                                                   00678000
$DEVCHNG EQU   $FLAG1                                                   00679000
$TESTCNG EQU   $FLAG1                                                   00680000
$CNSLFG  EQU   $FLAG1                                                   00681000
$TEP3RD  EQU   $FLAG1                                                   00682000
@NM00024 EQU   $CDA+120                                                 00683000
$CUCNT   EQU   $CDA+118                                                 00684000
@NM00023 EQU   $CDA+117                                                 00685000
$PRTFORM EQU   $CDA+116                                                 00686000
$OPISCNT EQU   $CDA+114                                                 00687000
$OPNDCNT EQU   $CDA+112                                                 00688000
$GETMSZE EQU   $CDA+110                                                 00689000
$GRCNTS  EQU   $CDA+108                                                 00690000
$CTLCNT  EQU   $CDA+106                                                 00691000
$ACTLVL  EQU   $CDA+105                                                 00692000
$PRNTLVL EQU   $CDA+104                                                 00693000
$ERRCNTA EQU   $CDA+102                                                 00694000
$TLCNT   EQU   $CDA+100                                                 00695000
$TIMEALW EQU   $CDA+96                                                  00696000
$PTRAREA EQU   $CDA+92                                                  00697000
$GETMPTR EQU   $CDA+88                                                  00698000
$R13PTRT EQU   $CDA+84                                                  00699000
$TEPEND  EQU   $CDA+76                                                  00700000
$PLINKDL EQU   $CDA+72                                                  00701000
$TEPBEGN EQU   $CDA+68                                                  00702000
$FRELPTR EQU   $CDA+64                                                  00703000
$HIGHADR EQU   $HIMOREC                                                 00704000
$LOMOREC EQU   $CDA+56                                                  00705000
$ENDCOMM EQU   $CDA+48                                                  00706000
$COMMON  EQU   $RCA                                                     00707000
$SLASHAD EQU   $CDA+32                                                  00708000
$PASSON  EQU   $CDA+28                                                  00709000
$TOLBRTB EQU   $CDA+24                                                  00710000
$SCTPTR8 EQU   $CDA+20                                                  00711000
$SCTPTR  EQU   $CDA+16                                                  00712000
$TBWDPTR EQU   $CDA+12                                                  00713000
$TFWDPTR EQU   $CDA+8                                                   00714000
@NM00022 EQU   $CDA                                                     00715000
@NM00021 EQU   $SCTTBLE+98                                              00716000
$SCTLWTC EQU   $SCTTBLE+96                                              00717000
$SCTLWTA EQU   $SCTTBLE+92                                              00718000
#EXT     EQU   $SCTTBLE+88                                              00719000
#PASS    EQU   $SCTTBLE+84                                              00720000
#TABLE   EQU   $SCTTBLE+80                                              00721000
#MSGIDAC EQU   $SCTTBLE+78                                              00722000
@NM00020 EQU   $SCTTBLE+71                                              00723000
$R249255 EQU   $ROUTMSK+29                                              00724000
$R241248 EQU   $ROUTMSK+28                                              00725000
$R233240 EQU   $ROUTMSK+27                                              00726000
$R225232 EQU   $ROUTMSK+26                                              00727000
$R217224 EQU   $ROUTMSK+25                                              00728000
$R209216 EQU   $ROUTMSK+24                                              00729000
$R201208 EQU   $ROUTMSK+23                                              00730000
$R193200 EQU   $ROUTMSK+22                                              00731000
$R185192 EQU   $ROUTMSK+21                                              00732000
$R177184 EQU   $ROUTMSK+20                                              00733000
$R169176 EQU   $ROUTMSK+19                                              00734000
$R161168 EQU   $ROUTMSK+18                                              00735000
$R153160 EQU   $ROUTMSK+17                                              00736000
$R145152 EQU   $ROUTMSK+16                                              00737000
$R137144 EQU   $ROUTMSK+15                                              00738000
$R129136 EQU   $ROUTMSK+14                                              00739000
$R121128 EQU   $ROUTMSK+13                                              00740000
$R113120 EQU   $ROUTMSK+12                                              00741000
$R105112 EQU   $ROUTMSK+11                                              00742000
$R097104 EQU   $ROUTMSK+10                                              00743000
$R089096 EQU   $ROUTMSK+9                                               00744000
$R081088 EQU   $ROUTMSK+8                                               00745000
$R073080 EQU   $ROUTMSK+7                                               00746000
$R065072 EQU   $ROUTMSK+6                                               00747000
$R057064 EQU   $ROUTMSK+5                                               00748000
$R049056 EQU   $ROUTMSK+4                                               00749000
$R041048 EQU   $ROUTMSK+3                                               00750000
$R033040 EQU   $ROUTMSK+2                                               00751000
$R025032 EQU   $ROUTMSK+1                                               00752000
$R017024 EQU   $ROUTMSK                                                 00753000
$TOTFLG2 EQU   $SCTTBLE+39                                              00754000
@NM00019 EQU   $TOTFLG1                                                 00755000
@NM00018 EQU   $TOTFLG1                                                 00756000
@NM00017 EQU   $TOTFLG1                                                 00757000
$CURELOD EQU   $TOTFLG1                                                 00758000
@NM00016 EQU   $TOTFLG1                                                 00759000
@NM00015 EQU   $TOTFLG1                                                 00760000
$LINESHR EQU   $TOTFLG1                                                 00761000
@NM00014 EQU   $OLTFLG2                                                 00762000
@NM00013 EQU   $OLTFLG2                                                 00763000
@NM00012 EQU   $OLTFLG2                                                 00764000
@NM00011 EQU   $OLTFLG2                                                 00765000
@NM00010 EQU   $OLTFLG2                                                 00766000
@NM00009 EQU   $OLTFLG2                                                 00767000
@NM00008 EQU   $OLTFLG2                                                 00768000
$TALK    EQU   $OLTFLG2                                                 00769000
$DYCOM   EQU   $OLTFLGS                                                 00770000
@NM00007 EQU   $OLTFLGS                                                 00771000
$TRACE   EQU   $OLTFLGS                                                 00772000
$RETCODE EQU   $OLTFLGS                                                 00773000
$CONTCB  EQU   $OLTFLGS                                                 00774000
$RETAIN  EQU   $OLTFLGS                                                 00775000
$CLEANRT EQU   $OLTFLGS                                                 00776000
$OLTSIZE EQU   $SCTTBLE+34                                              00777000
$QSCTMOD EQU   $EXECFLG                                                 00778000
$CTRLMOD EQU   $EXECFLG                                                 00779000
$CLEANUP EQU   $EXECFLG                                                 00780000
$LSTPDEV EQU   $EXECFLG                                                 00781000
$ERRCNT  EQU   $EXECFLG                                                 00782000
$RTNSLCT EQU   $EXECFLG                                                 00783000
$MULTDEV EQU   $EXECFLG                                                 00784000
@NM00006 EQU   $EXECFLG                                                 00785000
$RMSKCNT EQU   $SCTTBLE+32                                              00786000
$SYNAME  EQU   $CDS8T19+4                                               00787000
$EXTSIG  EQU   $CDS8T19+3                                               00788000
$CDFLGS  EQU   $CDS8T19+1                                               00789000
$CDSCNT  EQU   $CDS8T19                                                 00790000
$PDEVDSC EQU   $SCTTBLE+16                                              00791000
$PDEVADR EQU   $SCTTBLE+12                                              00792000
$COMMCN  EQU   $CDSFLGS                                                 00793000
$CUSTSYM EQU   $CDSFLGS                                                 00794000
$TWOCHSW EQU   $CDSFLGS                                                 00795000
$SYMNAME EQU   $CDSFLGS                                                 00796000
$EXTINTC EQU   $CDSFLGS                                                 00797000
$CEVOL   EQU   $CDSFLGS                                                 00798000
$SHARED  EQU   $CDSFLGS                                                 00799000
$FPM     EQU   $CDSFLGS                                                 00800000
$LASTSUB EQU   $PDEVFLG                                                 00801000
@NM00005 EQU   $PDEVFLG                                                 00802000
@NM00004 EQU   $PDEVFLG                                                 00803000
@NM00003 EQU   $PDEVFLG                                                 00804000
$LASTDEV EQU   $PDEVFLG                                                 00805000
@NM00002 EQU   $PDEVFLG                                                 00806000
$EXFILPT EQU   $PDEVFLG                                                 00807000
$FPMOLD  EQU   $PDEVFLG                                                 00808000
$TSSSYM  EQU   $SCTTBLE+8                                               00809000
$SCTLEVL EQU   $SCTTBLE+7                                               00810000
$DRIVER  EQU   $SCTTBLE+6                                               00811000
$LOOPTST EQU   $ERROPT                                                  00812000
$LOOPERR EQU   $ERROPT                                                  00813000
$NERRPRT EQU   $ERROPT                                                  00814000
$NOCNTRL EQU   $ERROPT                                                  00815000
$ALTPRNT EQU   $ERROPT                                                  00816000
$CATERR  EQU   $ERROPT                                                  00817000
$ASTERIK EQU   $ERROPT                                                  00818000
$FSTCOMM EQU   $TESTOPT                                                 00819000
$INDEFLP EQU   $TESTOPT                                                 00820000
$NOPRT   EQU   $TESTOPT                                                 00821000
$PARAPRT EQU   $TESTOPT                                                 00822000
@NM00001 EQU   $TESTOPT                                                 00823000
$ERRLPCT EQU   $SCTTBLE                                                 00824000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00825000
@RF00070 EQU   S2EC0020                                                 00826000
@ENDDATA EQU   *                                                        00827000
         END   ISTSC02E,(C'PLS1520',0702,78337)                         00828000
