         TITLE 'ISTZRM01-FRR FOR TPIOS/IOS INTERFACE'                   00001000
ISTZRM01 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTZRM01  78.336'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@12                                         0001 00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
         PRINT OFF                                                      00014000
         PRINT ON                                                       00015000
*                                                                  0280 00016000
*/* END OF ATBUILD                                                   */ 00017000
*                                                                  0280 00018000
*                                                                  0280 00019000
*   /*****************************************************************/ 00020000
*   /*                                                               */ 00021000
*   /* REGISTER DECLARES                                             */ 00022000
*   /*                                                               */ 00023000
*   /*****************************************************************/ 00024000
*                                                                  0280 00025000
*   DO;                             /* ISTREG (0,1,2,3,4,5,6,7,8,9,10   00026000
*                                      ,11,12,13,14,15)              */ 00027000
*   END;                            /* ISTREG                        */ 00028000
*   RFY                                                            0282 00029000
*    (GPR00P,                                                      0282 00030000
*     GPR01P,                                                      0282 00031000
*     GPR04P,                                                      0282 00032000
*     GPR05P,                                                      0282 00033000
*     GPR06P,                                                      0282 00034000
*     GPR07P,                                                      0282 00035000
*     GPR09P,                                                      0282 00036000
*     GPR10P,                                                      0282 00037000
*     GPR12P,                                                      0282 00038000
*     GPR13P,                                                      0282 00039000
*     GPR14P,                                                      0282 00040000
*     GPR15P,                                                      0282 00041000
*     GPR07F) RSTD;                                                0282 00042000
*   DCL                                                            0283 00043000
*     SDWAPTR REG(10) PTR(31) RSTD;                                0283 00044000
*   DCL                                                            0284 00045000
*     WKAREAPT REG(9) PTR(31) RSTD;                                0284 00046000
*   DCL                                                            0285 00047000
*     UCBPTR REG(5) PTR(31) RSTD;                                  0285 00048000
*   DCL                                                            0286 00049000
*     ICNCBPTR REG(4) PTR(31) RSTD;                                0286 00050000
*   DCL                                                            0287 00051000
*     LDNCBPTR REG(4) PTR(31) RSTD;                                0287 00052000
*   DCL                                                            0288 00053000
*     OLD REG(7) PTR(31) RSTD;                                     0288 00054000
*   DCL                                                            0289 00055000
*     NEW REG(6) PTR(31) RSTD;                                     0289 00056000
*   DCL                                                            0290 00057000
*     BUFPTR REG(8) PTR(31);                                       0290 00058000
*   DCL                                                            0291 00059000
*     BASEREG REG(12) PTR(31) RSTD;                                0291 00060000
*   DCL                                                            0292 00061000
*     RTNREG REG(14) PTR(31) RSTD;                                 0292 00062000
*                                                                  0292 00063000
*   /*****************************************************************/ 00064000
*   /*                                                               */ 00065000
*   /* VARIABLE DECLARES                                             */ 00066000
*   /*                                                               */ 00067000
*   /*****************************************************************/ 00068000
*                                                                  0293 00069000
*   DCL                                                            0293 00070000
*     FRRID CHAR(8) CONSTANT('ISTZRM01');                          0293 00071000
*   DCL                                                            0294 00072000
*     ON BIT(1) CONSTANT('1'B);                                    0294 00073000
*   DCL                                                            0295 00074000
*     OFF BIT(1) CONSTANT('0'B);                                   0295 00075000
*   DCL                                                            0296 00076000
*     HION BIT(32) CONSTANT('80000000'X);                          0296 00077000
*   DCL                                                            0297 00078000
*     HIOFF BIT(32) CONSTANT('7FFFFFFF'X);                         0297 00079000
*   DCL                                                            0298 00080000
*     CVTPTR PTR(31) LOCATION(16);                                 0298 00081000
*   DCL                                                            0299 00082000
*     FRRSPTR PTR(31) CONSTANT(0);                                 0299 00083000
*   DCL                                                            0300 00084000
*     FRREPTR PTR(31) CONSTANT(0);                                 0300 00085000
*   DCL                                                            0301 00086000
*     IOBPRPTR PTR(31) CONSTANT(0);                                0301 00087000
*   DCL                                                            0302 00088000
*     IOBSTPTR PTR(31) CONSTANT(0);                                0302 00089000
*   DCL                                                            0303 00090000
*     SRBPTR PTR(31) CONSTANT(0);                                  0303 00091000
*   DCL                                                            0304 00092000
*     IOSBPTR PTR(31) CONSTANT(0);                                 0304 00093000
*                                                                  0304 00094000
*   /*****************************************************************/ 00095000
*   /*                                                               */ 00096000
*   /* FRR PARMAREA                                                  */ 00097000
*   /*                                                               */ 00098000
*   /*****************************************************************/ 00099000
*                                                                  0305 00100000
*   DCL                                                            0305 00101000
*     1 PARMLIST CHAR(24) BDY(WORD) BASED,                         0305 00102000
*      2 DWORD0 CHAR(8) BDY(WORD),                                 0305 00103000
*       3 WORD0 PTR(31),                                           0305 00104000
*       3 WORD1 PTR(31);            /*                       @ZM31967*/ 00105000
*                                                                  0305 00106000
*   /*****************************************************************/ 00107000
*   /*                                                               */ 00108000
*   /* SDUMP LIST FORM                                               */ 00109000
*   /*                                                               */ 00110000
*   /*****************************************************************/ 00111000
*                                                                  0306 00112000
*   GEN DATA DEFS(DUMPLIST);                                       0306 00113000
*   DCL                                                            0307 00114000
*     DUMPLIST CHAR(24) GEND STATIC LOCAL;                         0307 00115000
*                                                                  0307 00116000
*   /*****************************************************************/ 00117000
*   /*                                                               */ 00118000
*   /* SQA DUMP BUFFER AS USED FOR 370X                              */ 00119000
*   /*                                                               */ 00120000
*   /*****************************************************************/ 00121000
*                                                                  0308 00122000
*   DCL                                                            0308 00123000
*     1 BUF370X BDY(WORD) BASED,                                   0308 00124000
*      2 B370XF1A PTR(31),                                         0308 00125000
*      2 B370XF1L FIXED(15),                                       0308 00126000
*      2 B370XF1R CHAR(2),                                         0308 00127000
*      2 B370XUCB CHAR(LENGTH(UCB)),                               0308 00128000
*      2 B370XUOB CHAR(LENGTH(UCBOB)),                             0308 00129000
*      2 B370XU07 CHAR(LENGTH(UCBOBS07)),                          0308 00130000
*      2 B370XF2A PTR(31),                                         0308 00131000
*      2 B370XF2L FIXED(15),                                       0308 00132000
*      2 B370XF2R CHAR(2),                                         0308 00133000
*      2 B370XICN CHAR(LENGTH(ISTICNCB)),                          0308 00134000
*      2 B370XF3A PTR(31),                                         0308 00135000
*      2 B370XF3L FIXED(15),                                       0308 00136000
*      2 B370XF3R CHAR(2);                                         0308 00137000
*                                                                  0308 00138000
*   /*****************************************************************/ 00139000
*   /*                                                               */ 00140000
*   /* SQA DUMP BUFFER AS USED FOR 3270                              */ 00141000
*   /*                                                               */ 00142000
*   /*****************************************************************/ 00143000
*                                                                  0309 00144000
*   DCL                                                            0309 00145000
*     1 BUF3270 BDY(WORD) BASED,                                   0309 00146000
*      2 B3270F1A PTR(31),                                         0309 00147000
*      2 B3270F1L FIXED(15),                                       0309 00148000
*      2 B3270F1R CHAR(2),                                         0309 00149000
*      2 B3270UCB CHAR(LENGTH(UCB)),                               0309 00150000
*      2 B3270UOB CHAR(LENGTH(UCBOB)),                             0309 00151000
*      2 B3270U06 CHAR(LENGTH(UCBOBS06)),                          0309 00152000
*      2 B3270F2A PTR(31),                                         0309 00153000
*      2 B3270F2L FIXED(15),                                       0309 00154000
*      2 B3270F2R CHAR(2),                                         0309 00155000
*      2 B3270LDN CHAR(LENGTH(ISTLDNCB)),                          0309 00156000
*      2 B3270F3A PTR(31),                                         0309 00157000
*      2 B3270F3L FIXED(15),                                       0309 00158000
*      2 B3270F3R CHAR(2);                                         0309 00159000
*                                                                  0309 00160000
*   /*****************************************************************/ 00161000
*   /*                                                               */ 00162000
*   /* WORK AREA POINTED TO BY REG 0 AT ENTRY                        */ 00163000
*   /*                                                               */ 00164000
*   /*****************************************************************/ 00165000
*                                                                  0310 00166000
*   DCL                                                            0310 00167000
*     1 WKAREA CHAR(200) BDY(WORD) BASED,                          0310 00168000
*       3 FRR69PRM PTR(31),                                        0310 00169000
*       3 REG14SV PTR(31),                                         0310 00170000
*       3 SDMPAREA CHAR(24);                                       0310 00171000
*                                                                  0310 00172000
*   /*****************************************************************/ 00173000
*   /*                                                               */ 00174000
*   /* RESPECIFIES FOR CONTROL BLOCKS                                */ 00175000
*   /*                                                               */ 00176000
*   /*****************************************************************/ 00177000
*                                                                  0311 00178000
*   RFY                                                            0311 00179000
*     SDWA BASED(SDWAPTR);                                         0311 00180000
*   RFY                                                            0312 00181000
*     WKAREA BASED(WKAREAPT);                                      0312 00182000
*   RFY                                                            0313 00183000
*     ISTICNCB BASED(ICNCBPTR);                                    0313 00184000
*   RFY                                                            0314 00185000
*     ISTLDNCB BASED(LDNCBPTR);                                    0314 00186000
*   RFY                                                            0315 00187000
*     BUF370X BASED(BUFPTR);                                       0315 00188000
*   RFY                                                            0316 00189000
*     BUF3270 BASED(BUFPTR);                                       0316 00190000
*                                                                  0316 00191000
*   /*****************************************************************/ 00192000
*   /*                                                               */ 00193000
*   /* START OF CODE                                                 */ 00194000
*   /*                                                               */ 00195000
*   /*****************************************************************/ 00196000
*                                                                  0317 00197000
*   WKAREAPT=GPR00P;                /* WORK AREA PTR PASSED TO     0317 00198000
*                                      ISTZRM01                      */ 00199000
         LR    WKAREAPT,GPR00P                                     0317 00200000
*   SDWAPTR=GPR01P;                 /* SDWA(RTCA) WORK AREA          */ 00201000
         LR    SDWAPTR,GPR01P                                      0318 00202000
*   REG14SV=RTNREG;                 /* SAVE RETURN ADDR              */ 00203000
         ST    RTNREG,REG14SV(,WKAREAPT)                           0319 00204000
*   DO;                             /* LISATCVT                    0320 00205000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00206000
*     GPR15P=ATCLCPTR;              /* SET UP ATCVT POINTER          */ 00207000
         L     GPR15P,ATCLCPTR                                     0321 00208000
*   END;                            /* LISATCVT GET ATCVT ADDR       */ 00209000
*   RFY                                                            0323 00210000
*     PARMLIST BASED(FRR69PRM);                                    0323 00211000
*   GPR15P=GPR15P->ATCAP69;         /* GET ADDR OF FRR ROUTINE -   0324 00212000
*                                      ISTAPM69                      */ 00213000
         L     GPR15P,ATCAP69(,GPR15P)                             0324 00214000
*   GEN REFS(GPR15P,GPR06P,GPR07P,PSACSTK,PSA,FRRSPARM,FRRS,FRRSLAST,   00215000
*       PSALSFCC,FRRSELEN,FRRSCURR,FRRSENTR) SETS(FRR69PRM,GPR06P, 0325 00216000
*       GPR07P,FRRSCURR,FRRSFRRA,FRRSPARM);                        0325 00217000
         SETFRR A,FRRAD=(GPR15P),PARMAD=(GPR07P),                      *00218000
               WRKREGS=(GPR06P,GPR07P) ADD ISTAPM69 TO FRR STACK        00219000
*   FRR69PRM=GPR07P;                                               0326 00220000
         ST    GPR07P,FRR69PRM(,WKAREAPT)                          0326 00221000
*   DWORD0=FRRID;                   /* STORE ID OF THIS FRR IN     0327 00222000
*                                      ISTAPM69 FRR PARM AREA        */ 00223000
         L     @11,FRR69PRM(,WKAREAPT)                             0327 00224000
         MVC   DWORD0(8,@11),@CC03620                              0327 00225000
*   RFY                                                            0328 00226000
*     PARMLIST BASED(SDWAPARM);                                    0328 00227000
*   IF WORD0>0 THEN                 /* IS UCB LOCKWORD STORED        */ 00228000
         L     @11,SDWAPARM(,SDWAPTR)                              0329 00229000
         L     @11,WORD0(,@11)                                     0329 00230000
         LTR   @11,@11                                             0329 00231000
         BNP   @RF00329                                            0329 00232000
*     DO;                           /* YES                           */ 00233000
*       RFY                                                        0331 00234000
*         UCB BASED(0);                                            0331 00235000
*       UCBPTR=WORD0-(ADDR(UCBLOCK)-ADDR(UCB))+LENGTH(UCB);/* GET PTR   00236000
*                                      TO BASIC UCB                  */ 00237000
         AL    @11,@CF00065                                        0332 00238000
         LR    UCBPTR,@11                                          0332 00239000
*       RFY                                                        0333 00240000
*         UCB;                                                     0333 00241000
*       IF UCB3COMM=ON THEN         /* IF COMMUNICATIONS DEVICE CLASS*/ 00242000
         TM    UCB3COMM(UCBPTR),B'01000000'                        0334 00243000
         BNO   @RF00334                                            0334 00244000
*         DO;                       /* DEVICE IS A 370X              */ 00245000
*           ICNCBPTR=UCBICNCB;      /* GET ICNCB PTR                 */ 00246000
         L     ICNCBPTR,UCBICNCB(,UCBPTR)                          0336 00247000
*         END;                                                     0337 00248000
*       ELSE                                                       0338 00249000
*         DO;                       /* DEVICE IS A LOCAL 3270        */ 00250000
         B     @RC00334                                            0338 00251000
@RF00334 DS    0H                                                  0339 00252000
*           LDNCBPTR=UCBLDNCB;      /* GET LDNCB PTR                 */ 00253000
         L     LDNCBPTR,UCBLDNCB-1(,UCBPTR)                        0339 00254000
         LA    LDNCBPTR,0(,LDNCBPTR)                               0339 00255000
*         END;                                                     0340 00256000
*     END;                                                         0341 00257000
@RC00334 DS    0H                                                  0342 00258000
*   IF SDWAFMID^='0000'X THEN                                      0342 00259000
@RF00329 CLC   SDWAFMID(2,SDWAPTR),@CB03676                        0342 00260000
         BNE   @RT00342                                            0342 00261000
*     GO TO ZR010200;               /* IF CURRENT ADDRESS SPACE IS 0343 00262000
*                                      NOT THE ONE THAT ABENDED, SKIP   00263000
*                                      SDUMP. IT WILL BE DONE BY   0343 00264000
*                                      MEMORY TERM MODULE            */ 00265000
*   OLD=CVTPTR->CVTSDBF;            /* GET PTR TO 4K SDMP BUFFER IN     00266000
*                                      SQA                           */ 00267000
         L     @11,CVTPTR                                          0344 00268000
         L     OLD,CVTSDBF(,@11)                                   0344 00269000
*   OLD=OLD&HIOFF;                  /* TURN OFF HI ORDER LOCK BIT IN    00270000
*                                      OLD REG FOR CS                */ 00271000
         N     OLD,@CF02355                                        0345 00272000
*   NEW=OLD|HION;                   /* TURN ON HI ORDER LOCK BIT IN     00273000
*                                      NEW REG FOR CS                */ 00274000
         LR    NEW,OLD                                             0346 00275000
         O     NEW,@CF02357                                        0346 00276000
*   CS(OLD,NEW,CVTPTR->CVTSDBF);    /* ATTEMPT TO ACQUIRE/LOCK BUFFER*/ 00277000
         L     @11,CVTPTR                                          0347 00278000
         CS    OLD,@06,CVTSDBF(@11)                                0347 00279000
*   BC(4,ZR010200);                 /* BUFFER WAS LOCKED ALREADY,  0348 00280000
*                                      SKIP SDUMP                    */ 00281000
         BC    4,ZR010200                                          0348 00282000
*   RFY                                                            0349 00283000
*    (BUFPTR) RSTD;                                                0349 00284000
*   BUFPTR=OLD;                     /* INIT BUFFER PTR REG           */ 00285000
         LR    BUFPTR,OLD                                          0350 00286000
*   IF WORD0>0 THEN                 /* IS UCB LOCKWORD STORED        */ 00287000
         L     @11,SDWAPARM(,SDWAPTR)                              0351 00288000
         L     @11,WORD0(,@11)                                     0351 00289000
         LTR   @11,@11                                             0351 00290000
         BNP   @RF00351                                            0351 00291000
*     DO;                           /* YES                           */ 00292000
*       RFY                                                        0353 00293000
*        (GPR02P,                                                  0353 00294000
*         GPR03F) RSTD;                                            0353 00295000
*       IF UCB3COMM=ON THEN         /* IF COMMUNICATIONS DEVICE CLASS*/ 00296000
         TM    UCB3COMM(UCBPTR),B'01000000'                        0354 00297000
         BNO   @RF00354                                            0354 00298000
*         DO;                       /* DEVICE IS A 370X, INITIALIZE     00299000
*                                      SQA BUFFER                    */ 00300000
*           GPR02P=LENGTH(UCB);                                    0356 00301000
         LA    @11,512                                             0356 00302000
         LR    GPR02P,@11                                          0356 00303000
*           B370XF1A=UCBPTR-GPR02P; /* ADDR OF UCB PREFIX            */ 00304000
         LR    @11,UCBPTR                                          0357 00305000
         SLR   @11,GPR02P                                          0357 00306000
         ST    @11,B370XF1A(,BUFPTR)                               0357 00307000
*           B370XF1L=LENGTH(UCB)+LENGTH(UCBOB)+LENGTH(UCBOBS07);/* 0358 00308000
*                                      LENGTH OF UCB (PREFIX + COMMON   00309000
*                                      SECTION + DEVICE DEPENDENT  0358 00310000
*                                      SECTION)                      */ 00311000
         MVC   B370XF1L(2,BUFPTR),@CH03701                         0358 00312000
*           B370XF1R='0000'X;                                      0359 00313000
         MVC   B370XF1R(2,BUFPTR),@CB03676                         0359 00314000
*           GPR02P=ADDR(B370XUCB);                                 0360 00315000
         LA    GPR02P,B370XUCB(,BUFPTR)                            0360 00316000
*           GPR03F=LENGTH(B370XUCB);                               0361 00317000
         LA    @11,512                                             0361 00318000
         LR    GPR03F,@11                                          0361 00319000
*           GPR06P=ADDR(UCB);       /* ADDR UCB PREFIX               */ 00320000
         LR    GPR06P,UCBPTR                                       0362 00321000
         SLR   GPR06P,@11                                          0362 00322000
*           GPR07F=LENGTH(UCB);     /* LENGTH UCB PREFIX             */ 00323000
         LR    GPR07F,@11                                          0363 00324000
*           MVCL(GPR02P,GPR06P);    /* MOVE UCB PREFIX TO SQA BUFFER */ 00325000
         MVCL  GPR02P,GPR06P                                       0364 00326000
*           B370XUOB=UCBOB;         /* MOVE UCB COMMON SECTION TO SQA   00327000
*                                      BUFFER                        */ 00328000
         MVC   B370XUOB(24,BUFPTR),UCBOB(UCBPTR)                   0365 00329000
*           B370XU07=UCBOBS07;      /* MOVE UCB DEVICE DEPENDENT   0366 00330000
*                                      SECTION TO SQA BUF            */ 00331000
         MVC   B370XU07(8,BUFPTR),UCBOBS07(UCBPTR)                 0366 00332000
*           B370XF2A=ADDR(ISTICNCB);/* ADDR ICNCB                    */ 00333000
         ST    ICNCBPTR,B370XF2A(,BUFPTR)                          0367 00334000
*           B370XF2L=LENGTH(ISTICNCB);/* LENGTH                      */ 00335000
         LA    @11,464                                             0368 00336000
         STH   @11,B370XF2L(,BUFPTR)                               0368 00337000
*           B370XF2R='0000'X;                                      0369 00338000
         MVC   B370XF2R(2,BUFPTR),@CB03676                         0369 00339000
*           GPR02P=ADDR(B370XICN);                                 0370 00340000
         LA    GPR02P,B370XICN(,BUFPTR)                            0370 00341000
*           GPR03F=LENGTH(B370XICN);                               0371 00342000
         LR    GPR03F,@11                                          0371 00343000
*           GPR06P=ADDR(ISTICNCB);  /* ADDR ICNCB                    */ 00344000
         LR    GPR06P,ICNCBPTR                                     0372 00345000
*           GPR07F=LENGTH(ISTICNCB);/* LENGTH ICNCB                  */ 00346000
         LR    GPR07F,@11                                          0373 00347000
*           MVCL(GPR02P,GPR06P);    /* MOVE ICNCB TO SQA BUFFER      */ 00348000
         MVCL  GPR02P,GPR06P                                       0374 00349000
*           B370XF3A=0;             /* FINISH OFF USE OF SQA BUFFER  */ 00350000
         SLR   @11,@11                                             0375 00351000
         ST    @11,B370XF3A(,BUFPTR)                               0375 00352000
*           B370XF3L=0;                                            0376 00353000
         STH   @11,B370XF3L(,BUFPTR)                               0376 00354000
*           B370XF3R='0000'X;                                      0377 00355000
         MVC   B370XF3R(2,BUFPTR),@CB03676                         0377 00356000
*         END;                                                     0378 00357000
*       ELSE                                                       0379 00358000
*         DO;                       /* DEVICE IS LOCAL 3270,       0379 00359000
*                                      INITIALIZE SQA BUFFER         */ 00360000
         B     @RC00354                                            0379 00361000
@RF00354 DS    0H                                                  0380 00362000
*           GPR02P=LENGTH(UCB);                                    0380 00363000
         LA    @11,512                                             0380 00364000
         LR    GPR02P,@11                                          0380 00365000
*           B3270F1A=UCBPTR-GPR02P; /* ADDR OF UCB PREFIX            */ 00366000
         LR    @11,UCBPTR                                          0381 00367000
         SLR   @11,GPR02P                                          0381 00368000
         ST    @11,B3270F1A(,BUFPTR)                               0381 00369000
*           B3270F1L=LENGTH(UCB)+LENGTH(UCBOB)+LENGTH(UCBOBS06);/* 0382 00370000
*                                      LENGTH OF UCB (PREFIX + COMMON   00371000
*                                      SECTION + DEVICE DEPENDENT  0382 00372000
*                                      SECTION)                      */ 00373000
         MVC   B3270F1L(2,BUFPTR),@CH03703                         0382 00374000
*           B3270F1R='0000'X;                                      0383 00375000
         MVC   B3270F1R(2,BUFPTR),@CB03676                         0383 00376000
*           GPR02P=ADDR(B3270UCB);                                 0384 00377000
         LA    GPR02P,B3270UCB(,BUFPTR)                            0384 00378000
*           GPR03F=LENGTH(B3270UCB);                               0385 00379000
         LA    @11,512                                             0385 00380000
         LR    GPR03F,@11                                          0385 00381000
*           GPR06P=ADDR(UCB);       /* ADDR UCB PREFIX               */ 00382000
         LR    GPR06P,UCBPTR                                       0386 00383000
         SLR   GPR06P,@11                                          0386 00384000
*           GPR07F=LENGTH(UCB);     /* LENGTH UCB PREFIX             */ 00385000
         LR    GPR07F,@11                                          0387 00386000
*           MVCL(GPR02P,GPR06P);    /* MOVE UCB PREFIX TO SQA BUFFER */ 00387000
         MVCL  GPR02P,GPR06P                                       0388 00388000
*           B3270UOB=UCBOB;         /* MOVE UCB COMMON SECTION TO SQA   00389000
*                                      BUFFER                        */ 00390000
         MVC   B3270UOB(24,BUFPTR),UCBOB(UCBPTR)                   0389 00391000
*           B3270U06=UCBOBS06;      /* MOVE UCB DEVICE DEPENDENT   0390 00392000
*                                      SECTION TO SQA BUF            */ 00393000
         MVC   B3270U06(16,BUFPTR),UCBOBS06(UCBPTR)                0390 00394000
*           B3270F2A=ADDR(ISTLDNCB);/* ADDR LDNCB                    */ 00395000
         ST    LDNCBPTR,B3270F2A(,BUFPTR)                          0391 00396000
*           B3270F2L=LENGTH(ISTLDNCB);/* LENGTH LDNCB                */ 00397000
         LA    @11,416                                             0392 00398000
         STH   @11,B3270F2L(,BUFPTR)                               0392 00399000
*           B3270F2R='0000'X;                                      0393 00400000
         MVC   B3270F2R(2,BUFPTR),@CB03676                         0393 00401000
*           GPR02P=ADDR(B3270LDN);                                 0394 00402000
         LA    GPR02P,B3270LDN(,BUFPTR)                            0394 00403000
*           GPR03F=LENGTH(B3270LDN);                               0395 00404000
         LR    GPR03F,@11                                          0395 00405000
*           GPR06P=ADDR(ISTLDNCB);  /* ADDR LDNCB                    */ 00406000
         LR    GPR06P,LDNCBPTR                                     0396 00407000
*           GPR07F=LENGTH(ISTLDNCB);/* LENGTH LDNCB                  */ 00408000
         LR    GPR07F,@11                                          0397 00409000
*           MVCL(GPR02P,GPR06P);    /* MOVE LDNCB TO SQA BUFFER      */ 00410000
         MVCL  GPR02P,GPR06P                                       0398 00411000
*           B3270F3A=0;             /* FINISH OFF USE OF SQA BUFFER  */ 00412000
         SLR   @11,@11                                             0399 00413000
         ST    @11,B3270F3A(,BUFPTR)                               0399 00414000
*           B3270F3L=0;                                            0400 00415000
         STH   @11,B3270F3L(,BUFPTR)                               0400 00416000
*           B3270F3R='0000'X;                                      0401 00417000
         MVC   B3270F3R(2,BUFPTR),@CB03676                         0401 00418000
*         END;                                                     0402 00419000
*       RFY                                                        0403 00420000
*        (GPR02P,                                                  0403 00421000
*         GPR03F) UNRSTD;                                          0403 00422000
@RC00354 DS    0H                                                  0404 00423000
*     END;                                                         0404 00424000
*   ELSE                                                           0405 00425000
*     DO;                           /* IF UCB LOCKWORD WAS NOT STORED   00426000
*                                      IN FRR PARM AREA              */ 00427000
         B     @RC00351                                            0405 00428000
@RF00351 DS    0H                                                  0406 00429000
*       B370XF1A=0;                 /* INDUCATE SQA BUFFER IS EMPTY  */ 00430000
         SLR   @11,@11                                             0406 00431000
         ST    @11,B370XF1A(,BUFPTR)                               0406 00432000
*       B370XF1L=0;                                                0407 00433000
         STH   @11,B370XF1L(,BUFPTR)                               0407 00434000
*       B370XF1R='0000'X;                                          0408 00435000
         MVC   B370XF1R(2,BUFPTR),@CB03676                         0408 00436000
*     END;                                                         0409 00437000
*   RFY                                                            0410 00438000
*    (BUFPTR) UNRSTD;                                              0410 00439000
@RC00351 DS    0H                                                  0411 00440000
*   SDMPAREA=DUMPLIST;              /* MOVE SDUMP LIST FORM TO WORK     00441000
*                                      AREA                          */ 00442000
         MVC   SDMPAREA(24,WKAREAPT),DUMPLIST                      0411 00443000
*   GPR07F=0;                       /* ZERO INDICATES DUMP CURRENT 0412 00444000
*                                      ADDRESS SPACE                 */ 00445000
*                                                                  0412 00446000
         SLR   GPR07F,GPR07F                                       0412 00447000
*   /*****************************************************************/ 00448000
*   /*                                                               */ 00449000
*   /* TAKE AN SDUMP OF THIS MEMORY                                  */ 00450000
*   /*                                                               */ 00451000
*   /*****************************************************************/ 00452000
*                                                                  0413 00453000
*   GPR01P=ADDR(SDMPAREA);                                         0413 00454000
         LA    GPR01P,SDMPAREA(,WKAREAPT)                          0413 00455000
*   GEN CODE REFS(CVTPTR,CVTMAP,CVTSDMP,GPR07F,SDMPAREA);          0414 00456000
         SDUMP BRANCH=YES,ASID=(GPR07F),MF=(E,(1))                      00457000
*ZR010200:                                                         0415 00458000
*   IF WORD0>0 THEN                 /* IS UCB LOCKWORD STORED        */ 00459000
ZR010200 L     @11,SDWAPARM(,SDWAPTR)                              0415 00460000
         L     @11,WORD0(,@11)                                     0415 00461000
         LTR   @11,@11                                             0415 00462000
         BNP   @RF00415                                            0415 00463000
*     DO;                           /* UNLOCK UCB GLOBAL SPIN LOCK   */ 00464000
*       RFY                                                        0417 00465000
*        (GPR11P) RSTD;                                            0417 00466000
*       GPR11P=WORD0;               /* ADDR OF UCB LOCKWORD  @ZM31967*/ 00467000
         L     @08,SDWAPARM(,SDWAPTR)                              0418 00468000
         L     @08,WORD0(,@08)                                     0418 00469000
         LR    GPR11P,@08                                          0418 00470000
*       GPR06P=BASEREG;             /* SAVE BASE REG ACROSS SETLOCK  */ 00471000
         LR    GPR06P,BASEREG                                      0419 00472000
*       GEN SETS(GPR12P,GPR13P,GPR14P) REFS(GPR11P,PSALITA,FLC);   0420 00473000
         SETLOCK RELEASE,TYPE=IOSUCB,ADDR=(11),                        *00474000
               RELATED=('LOCK (ICNCB/LDNCB)  HELD AT TIME OF ABEND')    00475000
*       BASEREG=GPR06P;             /* RESTORE BASE REG              */ 00476000
         LR    BASEREG,GPR06P                                      0421 00477000
*       RFY                                                        0422 00478000
*        (GPR11P) UNRSTD;                                          0422 00479000
*                                                                  0422 00480000
*/*   THE FOLLOWING LINE OF CODE HAS BEEN DELETED BY PTM P001798     */ 00481000
*/*     WORD1->ZSAFSV19->ZSAFLOCK=OFF    RESET LOCK OWNERSHIP BIT  0423 00482000
*                                                            @ZM31967   00483000
*                                                            @ZM41798*/ 00484000
*                                                                  0423 00485000
*     END;                                                         0423 00486000
*   SDWAREXN=FRRID;                 /* STORE FRR ID IN SDWA RECORDING   00487000
*                                      AREA                          */ 00488000
@RF00415 MVC   SDWAREXN(8,SDWAPTR),@CC03620                        0424 00489000
*   SDWAVRA(1:24)=PARMLIST;         /* INIT VARIABLE RECORDING AREA     00490000
*                                      WITH ISTZRM01 FRR PARMLIST    */ 00491000
         L     @11,SDWAPARM(,SDWAPTR)                              0425 00492000
         MVC   SDWAVRA(24,SDWAPTR),PARMLIST(@11)                   0425 00493000
*   SDWAHEX=ON;                                                    0426 00494000
         OI    SDWAHEX(SDWAPTR),B'10000000'                        0426 00495000
*   SDWAURAL=24;                                                   0427 00496000
         MVI   SDWAURAL(SDWAPTR),X'18'                             0427 00497000
*   DO;                             /* SETRP RECORD(YES)WKAREA(SDWAPT   00498000
*                                      R)RC(0)                       */ 00499000
*     RESPECIFY                                                    0429 00500000
*      (GPR00P,                                                    0429 00501000
*       GPR01P,                                                    0429 00502000
*       GPR14P,                                                    0429 00503000
*       GPR15P) RSTD;                                              0429 00504000
*     GPR01P=SDWAPTR;                                              0430 00505000
         LR    GPR01P,SDWAPTR                                      0430 00506000
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */ 00507000
         MVI   SDWARCDE(GPR01P),X'00'                              0431 00508000
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */ 00509000
         OI    SDWARCRD(GPR01P),B'10000000'                        0432 00510000
*     RESPECIFY                                                    0433 00511000
*      (GPR00P,                                                    0433 00512000
*       GPR01P,                                                    0433 00513000
*       GPR14P,                                                    0433 00514000
*       GPR15P) UNRSTD;                                            0433 00515000
*   END;                            /* INIT TO PERCOLATE             */ 00516000
*   GEN REFS(GPR06P,GPR07P,PSACSTK,PSA,FRRSCURR,FRRS,FRRSEMP,FRRSELEN)  00517000
*       SETS(GPR06P,GPR07P,FRRSCURR);                              0435 00518000
         SETFRR D,WRKREGS=(GPR06P,GPR07P) DELETE ISTAPM69 FRR ENTRY     00519000
*   RTNREG=REG14SV;                                                0436 00520000
         L     RTNREG,REG14SV(,WKAREAPT)                           0436 00521000
*   RETURN;                                                        0437 00522000
@EL00001 DS    0H                                                  0437 00523000
@EF00001 DS    0H                                                  0437 00524000
@ER00001 BR    @14                                                 0437 00525000
*   DO;                             /* TPEPILOG                      */ 00526000
*     GEN(PRINT OFF);                                              0439 00527000
         PRINT OFF                                                      00528000
*     DO;                                                          0440 00529000
*       DCL                                                        0441 00530000
*         GPR00F FIXED(31) REG(00),                                0441 00531000
*         GPR00P PTR(31) REG(00),                                  0441 00532000
*         GPR01F FIXED(31) REG(01),                                0441 00533000
*         GPR01P PTR(31) REG(01),                                  0441 00534000
*         GPR02F FIXED(31) REG(02),                                0441 00535000
*         GPR02P PTR(31) REG(02),                                  0441 00536000
*         GPR03F FIXED(31) REG(03),                                0441 00537000
*         GPR03P PTR(31) REG(03),                                  0441 00538000
*         GPR04F FIXED(31) REG(04),                                0441 00539000
*         GPR04P PTR(31) REG(04),                                  0441 00540000
*         GPR05F FIXED(31) REG(05),                                0441 00541000
*         GPR05P PTR(31) REG(05),                                  0441 00542000
*         GPR06F FIXED(31) REG(06),                                0441 00543000
*         GPR06P PTR(31) REG(06),                                  0441 00544000
*         GPR07F FIXED(31) REG(07),                                0441 00545000
*         GPR07P PTR(31) REG(07),                                  0441 00546000
*         GPR08F FIXED(31) REG(08),                                0441 00547000
*         GPR08P PTR(31) REG(08),                                  0441 00548000
*         GPR09F FIXED(31) REG(09),                                0441 00549000
*         GPR09P PTR(31) REG(09),                                  0441 00550000
*         GPR10F FIXED(31) REG(10),                                0441 00551000
*         GPR10P PTR(31) REG(10),                                  0441 00552000
*         GPR11F FIXED(31) REG(11),                                0441 00553000
*         GPR11P PTR(31) REG(11),                                  0441 00554000
*         GPR12F FIXED(31) REG(12),                                0441 00555000
*         GPR12P PTR(31) REG(12),                                  0441 00556000
*         GPR13F FIXED(31) REG(13),                                0441 00557000
*         GPR13P PTR(31) REG(13),                                  0441 00558000
*         GPR14F FIXED(31) REG(14),                                0441 00559000
*         GPR14P PTR(31) REG(14),                                  0441 00560000
*         GPR15F FIXED(31) REG(15),                                0441 00561000
*         GPR15P PTR(31) REG(15);                                  0441 00562000
*     END;                                                         0442 00563000
*     GEN(PRINT ON);                                               0443 00564000
         PRINT ON                                                       00565000
*   END;                            /* TPEPILOG                      */ 00566000
*   END ISTZRM01                                                   0445 00567000
*                                                                  0445 00568000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00569000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 00570000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00571000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00572000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00573000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00574000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                       */ 00575000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00576000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00577000
*                                                                  0445 00578000
*       ;                                                          0445 00579000
         B     @EL00001                                            0445 00580000
@DATA    DS    0H                                                       00581000
@CH03701 DC    H'544'                                                   00582000
@CH03703 DC    H'552'                                                   00583000
@DATD    DSECT                                                          00584000
         DS    0F                                                       00585000
ISTZRM01 CSECT                                                          00586000
         DS    0F                                                       00587000
@CF00065 DC    F'8'                                                     00588000
@CF02355 DC    XL4'7FFFFFFF'                                            00589000
@CF02357 DC    XL4'80000000'                                            00590000
@DATD    DSECT                                                          00591000
         DS    0D                                                       00592000
ISTZRM01 CSECT                                                          00593000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00594000
         DS    0F                                                       00595000
@SIZDATD DC    AL1(0)                                                   00596000
         DC    AL3(@ENDDATD-@DATD)                                      00597000
         DS    0D                                                       00598000
@CC03620 DC    C'ISTZRM01'                                              00599000
@CB03676 DC    X'0000'                                                  00600000
ISTZRM01 CSECT                                                          00601000
DUMPLIST SDUMP SDATA=(ALLPSA,CSA,LSQA,SQA,TRT,LPA,NUC,SWA),BUFFER=YES, *00602000
               MF=L                                                     00603000
@DATD    DSECT                                                          00604000
@ENDDATD EQU   *                                                        00605000
ISTZRM01 CSECT                                                          00606000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00607000
@01      EQU   01                                                       00608000
@02      EQU   02                                                       00609000
@03      EQU   03                                                       00610000
@04      EQU   04                                                       00611000
@05      EQU   05                                                       00612000
@06      EQU   06                                                       00613000
@07      EQU   07                                                       00614000
@08      EQU   08                                                       00615000
@09      EQU   09                                                       00616000
@10      EQU   10                                                       00617000
@11      EQU   11                                                       00618000
@12      EQU   12                                                       00619000
@13      EQU   13                                                       00620000
@14      EQU   14                                                       00621000
@15      EQU   15                                                       00622000
SDWAPTR  EQU   @10                                                      00623000
UCBPTR   EQU   @05                                                      00624000
RPHPTR   EQU   @01                                                      00625000
LDNCBPTR EQU   @04                                                      00626000
GPR00P   EQU   @00                                                      00627000
GPR01P   EQU   @01                                                      00628000
GPR04P   EQU   @04                                                      00629000
GPR05P   EQU   @05                                                      00630000
GPR06P   EQU   @06                                                      00631000
GPR07P   EQU   @07                                                      00632000
GPR09P   EQU   @09                                                      00633000
GPR10P   EQU   @10                                                      00634000
GPR12P   EQU   @12                                                      00635000
GPR13P   EQU   @13                                                      00636000
GPR14P   EQU   @14                                                      00637000
GPR15P   EQU   @15                                                      00638000
GPR07F   EQU   @07                                                      00639000
WKAREAPT EQU   @09                                                      00640000
ICNCBPTR EQU   @04                                                      00641000
OLD      EQU   @07                                                      00642000
NEW      EQU   @06                                                      00643000
BUFPTR   EQU   @08                                                      00644000
BASEREG  EQU   @12                                                      00645000
RTNREG   EQU   @14                                                      00646000
GPR02P   EQU   @02                                                      00647000
GPR03F   EQU   @03                                                      00648000
GPR11P   EQU   @11                                                      00649000
GPR00F   EQU   @00                                                      00650000
GPR01F   EQU   @01                                                      00651000
GPR02F   EQU   @02                                                      00652000
GPR03P   EQU   @03                                                      00653000
GPR04F   EQU   @04                                                      00654000
GPR05F   EQU   @05                                                      00655000
GPR06F   EQU   @06                                                      00656000
GPR08F   EQU   @08                                                      00657000
GPR08P   EQU   @08                                                      00658000
GPR09F   EQU   @09                                                      00659000
GPR10F   EQU   @10                                                      00660000
GPR11F   EQU   @11                                                      00661000
GPR12F   EQU   @12                                                      00662000
GPR13F   EQU   @13                                                      00663000
GPR14F   EQU   @14                                                      00664000
GPR15F   EQU   @15                                                      00665000
PSA      EQU   0                                                        00666000
FLCRNPSW EQU   PSA                                                      00667000
FLCROPSW EQU   PSA+8                                                    00668000
FLCICCW2 EQU   PSA+16                                                   00669000
PSAEEPSW EQU   PSA+132                                                  00670000
PSAESPSW EQU   PSA+136                                                  00671000
FLCSVILC EQU   PSAESPSW+1                                               00672000
PSAEPPSW EQU   PSA+140                                                  00673000
FLCPIILC EQU   PSAEPPSW+1                                               00674000
FLCPICOD EQU   PSAEPPSW+2                                               00675000
PSAPICOD EQU   FLCPICOD+1                                               00676000
FLCTEA   EQU   PSAEPPSW+4                                               00677000
FLCPER   EQU   PSA+152                                                  00678000
FLCMCLA  EQU   PSA+168                                                  00679000
FLCIOEL  EQU   FLCMCLA+4                                                00680000
FLCIOA   EQU   FLCMCLA+16                                               00681000
FLCFSA   EQU   FLCMCLA+80                                               00682000
PSASUPER EQU   PSA+552                                                  00683000
PSASUP1  EQU   PSASUPER                                                 00684000
PSASUP2  EQU   PSASUPER+1                                               00685000
PSASUP3  EQU   PSASUPER+2                                               00686000
PSASUP4  EQU   PSASUPER+3                                               00687000
PSACLHT  EQU   PSA+640                                                  00688000
PSALKSA  EQU   PSA+696                                                  00689000
PSAHLHI  EQU   PSA+760                                                  00690000
PSALITA  EQU   PSA+764                                                  00691000
PSADSSFL EQU   PSA+836                                                  00692000
PSADSSF1 EQU   PSADSSFL                                                 00693000
PSADSSF3 EQU   PSADSSFL+2                                               00694000
PSADSSF4 EQU   PSADSSFL+3                                               00695000
PSARSVT  EQU   PSA+896                                                  00696000
PSALSFCC EQU   PSA+1012                                                 00697000
CVTPTR   EQU   16                                                       00698000
ATCLCPTR EQU   1032                                                     00699000
FRRS     EQU   0                                                        00700000
FRRSHEAD EQU   FRRS                                                     00701000
FRRSEMP  EQU   FRRSHEAD                                                 00702000
FRRSLAST EQU   FRRSHEAD+4                                               00703000
FRRSELEN EQU   FRRSHEAD+8                                               00704000
FRRSCURR EQU   FRRSHEAD+12                                              00705000
FRRSENTR EQU   0                                                        00706000
FRRSFRRA EQU   FRRSENTR                                                 00707000
FRRSFLGS EQU   FRRSENTR+4                                               00708000
FRRSFLG1 EQU   FRRSFLGS                                                 00709000
FRRSPARM EQU   FRRSENTR+8                                               00710000
CVTMAP   EQU   0                                                        00711000
CVTDAR   EQU   CVTMAP+72                                                00712000
CVTFLGS1 EQU   CVTDAR                                                   00713000
CVTDCB   EQU   CVTMAP+116                                               00714000
CVTIERLC EQU   CVTMAP+144                                               00715000
CVTOPTA  EQU   CVTMAP+182                                               00716000
CVTOPTB  EQU   CVTMAP+183                                               00717000
CVTGTF   EQU   CVTMAP+236                                               00718000
CVTGTFST EQU   CVTGTF                                                   00719000
CVTGTFS  EQU   CVTGTFST                                                 00720000
CVTSTATE EQU   CVTGTFST                                                 00721000
CVTTMODE EQU   CVTGTFST                                                 00722000
CVTFORM  EQU   CVTGTFST                                                 00723000
CVTAQAVT EQU   CVTMAP+240                                               00724000
CVTTCMFG EQU   CVTAQAVT                                                 00725000
CVTVOLM2 EQU   CVTMAP+244                                               00726000
CVTTATA  EQU   CVTVOLM2                                                 00727000
CVTTSKS  EQU   CVTTATA                                                  00728000
CVTVOLF2 EQU   CVTTSKS                                                  00729000
CVTTAT   EQU   CVTTATA+1                                                00730000
CVTATER  EQU   CVTMAP+248                                               00731000
CVTEXT1  EQU   CVTMAP+252                                               00732000
CVTPURG  EQU   CVTMAP+260                                               00733000
CVTQMSG  EQU   CVTMAP+268                                               00734000
CVTDMSR  EQU   CVTMAP+272                                               00735000
CVTRSV37 EQU   CVTDMSR                                                  00736000
CVTDMSRF EQU   CVTRSV37                                                 00737000
CVTERPV  EQU   CVTMAP+316                                               00738000
CVTINTLA EQU   CVTMAP+320                                               00739000
CVTAPF   EQU   CVTMAP+324                                               00740000
CVTEXT2  EQU   CVTMAP+328                                               00741000
CVTHJES  EQU   CVTMAP+332                                               00742000
CVTPGSIA EQU   CVTMAP+348                                               00743000
CVTA1F1  EQU   CVTMAP+356                                               00744000
CVTSYSK  EQU   CVTMAP+357                                               00745000
CVTVOLM1 EQU   CVTMAP+380                                               00746000
CVTVOLF1 EQU   CVTVOLM1                                                 00747000
CVTXTNT1 EQU   0                                                        00748000
CVTXTNT2 EQU   0                                                        00749000
CVTDSSV  EQU   CVTXTNT2                                                 00750000
CVTFLGBT EQU   CVTXTNT2+5                                               00751000
CVTQID   EQU   CVTXTNT2+24                                              00752000
CVTRV400 EQU   CVTXTNT2+52                                              00753000
CVTRV409 EQU   CVTXTNT2+53                                              00754000
CVTATCVT EQU   CVTXTNT2+64                                              00755000
CVTRV429 EQU   CVTXTNT2+84                                              00756000
CVTRV438 EQU   CVTXTNT2+85                                              00757000
CVTRV457 EQU   CVTXTNT2+112                                             00758000
CVTRV466 EQU   CVTXTNT2+113                                             00759000
CVTFIX   EQU   0                                                        00760000
CVTRELNO EQU   CVTFIX+252                                               00761000
SDWA     EQU   0                                                        00762000
SDWAPARM EQU   SDWA                                                     00763000
SDWAFIOB EQU   SDWA+4                                                   00764000
SDWAABCC EQU   SDWAFIOB                                                 00765000
SDWACMPF EQU   SDWAABCC                                                 00766000
SDWACTL1 EQU   SDWA+8                                                   00767000
SDWACMKA EQU   SDWACTL1                                                 00768000
SDWAMWPA EQU   SDWACTL1+1                                               00769000
SDWAPMKA EQU   SDWACTL1+4                                               00770000
SDWACTL2 EQU   SDWA+16                                                  00771000
SDWACMKP EQU   SDWACTL2                                                 00772000
SDWAMWPP EQU   SDWACTL2+1                                               00773000
SDWAPMKP EQU   SDWACTL2+4                                               00774000
SDWAGRSV EQU   SDWA+24                                                  00775000
SDWANAME EQU   SDWA+88                                                  00776000
SDWAEC1  EQU   SDWA+104                                                 00777000
SDWAEMK1 EQU   SDWAEC1                                                  00778000
SDWAMWP1 EQU   SDWAEC1+1                                                00779000
SDWAINT1 EQU   SDWAEC1+2                                                00780000
SDWANXT1 EQU   SDWAEC1+4                                                00781000
SDWAAEC1 EQU   SDWA+112                                                 00782000
SDWAILC1 EQU   SDWAAEC1+1                                               00783000
SDWAINC1 EQU   SDWAAEC1+2                                               00784000
SDWAICD1 EQU   SDWAINC1+1                                               00785000
SDWAEC2  EQU   SDWA+120                                                 00786000
SDWAEMK2 EQU   SDWAEC2                                                  00787000
SDWAMWP2 EQU   SDWAEC2+1                                                00788000
SDWAINT2 EQU   SDWAEC2+2                                                00789000
SDWANXT2 EQU   SDWAEC2+4                                                00790000
SDWAAEC2 EQU   SDWA+128                                                 00791000
SDWAILC2 EQU   SDWAAEC2+1                                               00792000
SDWAINC2 EQU   SDWAAEC2+2                                               00793000
SDWAICD2 EQU   SDWAINC2+1                                               00794000
SDWASRSV EQU   SDWA+136                                                 00795000
SDWAIDNT EQU   SDWA+200                                                 00796000
SDWAMCH  EQU   SDWA+204                                                 00797000
SDWASTCK EQU   SDWAMCH                                                  00798000
SDWAMCHI EQU   SDWAMCH+8                                                00799000
SDWAMCHS EQU   SDWAMCHI                                                 00800000
SDWAMCHD EQU   SDWAMCHI+1                                               00801000
SDWARSR1 EQU   SDWAMCH+12                                               00802000
SDWARSR2 EQU   SDWAMCH+13                                               00803000
SDWAFLGS EQU   SDWA+232                                                 00804000
SDWAERRA EQU   SDWAFLGS                                                 00805000
SDWAERRB EQU   SDWAFLGS+1                                               00806000
SDWAERRC EQU   SDWAFLGS+2                                               00807000
SDWAERRD EQU   SDWAFLGS+3                                               00808000
SDWAFMID EQU   SDWA+236                                                 00809000
SDWAIOFS EQU   SDWA+238                                                 00810000
SDWACPUA EQU   SDWA+248                                                 00811000
SDWAPARQ EQU   SDWA+252                                                 00812000
SDWARCDE EQU   SDWAPARQ                                                 00813000
SDWAACF2 EQU   SDWAPARQ+1                                               00814000
SDWARCRD EQU   SDWAACF2                                                 00815000
SDWAACF3 EQU   SDWAPARQ+2                                               00816000
SDWAACF4 EQU   SDWAPARQ+3                                               00817000
SDWALKWA EQU   SDWA+256                                                 00818000
SDWALKWS EQU   SDWALKWA                                                 00819000
SDWARECP EQU   SDWA+292                                                 00820000
SDWAREXN EQU   SDWARECP+16                                              00821000
SDWASNPA EQU   SDWA+320                                                 00822000
SDWADUMP EQU   SDWASNPA                                                 00823000
SDWADPFS EQU   SDWADUMP+1                                               00824000
SDWADDAT EQU   SDWASNPA+4                                               00825000
SDWASDAT EQU   SDWADDAT                                                 00826000
SDWAPDAT EQU   SDWADDAT+2                                               00827000
SDWADPSA EQU   SDWA+328                                                 00828000
SDWADPSL EQU   SDWADPSA                                                 00829000
SDWARA   EQU   SDWA+400                                                 00830000
SDWADPVA EQU   SDWARA+2                                                 00831000
SDWAHEX  EQU   SDWADPVA                                                 00832000
SDWAURAL EQU   SDWARA+3                                                 00833000
SDWAVRA  EQU   SDWARA+4                                                 00834000
UCB      EQU   0                                                        00835000
UCBLOCK  EQU   UCB+504                                                  00836000
UCBOB    EQU   0                                                        00837000
UCBJBNR  EQU   UCBOB                                                    00838000
UCBFL5   EQU   UCBOB+1                                                  00839000
UCBAF    EQU   UCBFL5                                                   00840000
UCBSTAT  EQU   UCBOB+3                                                  00841000
UCBCHAN  EQU   UCBOB+4                                                  00842000
UCBSFLS  EQU   UCBOB+6                                                  00843000
UCBFLA   EQU   UCBSFLS                                                  00844000
UCBFL1   EQU   UCBFLA                                                   00845000
UCBBSY   EQU   UCBFL1                                                   00846000
UCBNRY   EQU   UCBFL1                                                   00847000
UCBPST   EQU   UCBFL1                                                   00848000
UCBCUB   EQU   UCBFL1                                                   00849000
UCBFLB   EQU   UCBSFLS+1                                                00850000
UCBCHM   EQU   UCBOB+8                                                  00851000
UCBCHM1  EQU   UCBCHM                                                   00852000
UCBPTH0  EQU   UCBCHM1                                                  00853000
UCBPTH1  EQU   UCBCHM1                                                  00854000
UCBWGT   EQU   UCBOB+12                                                 00855000
UCBTYP   EQU   UCBOB+16                                                 00856000
UCBTBYT1 EQU   UCBTYP                                                   00857000
UCB1FEA5 EQU   UCBTBYT1                                                 00858000
UCB1FEA6 EQU   UCBTBYT1                                                 00859000
UCBTBYT2 EQU   UCBTYP+1                                                 00860000
UCB2OPT2 EQU   UCBTBYT2                                                 00861000
UCBDUDN1 EQU   UCB2OPT2                                                 00862000
UCB2OPT3 EQU   UCBTBYT2                                                 00863000
UCBDUDN2 EQU   UCB2OPT3                                                 00864000
UCB2OPT4 EQU   UCBTBYT2                                                 00865000
UCBRWTAU EQU   UCB2OPT4                                                 00866000
UCB2OPT6 EQU   UCBTBYT2                                                 00867000
UCB2OPT7 EQU   UCBTBYT2                                                 00868000
UCBTBYT3 EQU   UCBTYP+2                                                 00869000
UCBDVCLS EQU   UCBTBYT3                                                 00870000
UCB3COMM EQU   UCBDVCLS                                                 00871000
UCBTBYT4 EQU   UCBTYP+3                                                 00872000
UCBEXTPT EQU   UCBOB+20                                                 00873000
UCBFLC   EQU   UCBEXTPT                                                 00874000
UCBDEV   EQU   UCBOB+24                                                 00875000
UCBCMEXT EQU   0                                                        00876000
UCBATI   EQU   UCBCMEXT+3                                               00877000
@NM00080 EQU   UCBATI                                                   00878000
UCBFLP1  EQU   UCBCMEXT+5                                               00879000
UCBMT    EQU   0                                                        00880000
UCBOCR   EQU   0                                                        00881000
UCB3540X EQU   0                                                        00882000
UCBDKBYT EQU   UCB3540X+6                                               00883000
UCB3800X EQU   0                                                        00884000
UCBOPTNS EQU   UCB3800X                                                 00885000
UCBACTIV EQU   UCB3800X+3                                               00886000
UCBMDRBF EQU   UCB3800X+36                                              00887000
UCBUCS   EQU   0                                                        00888000
UCBUCSOP EQU   UCBUCS+4                                                 00889000
UCBFCBOP EQU   UCBUCS+5                                                 00890000
IOBPREFX EQU   0                                                        00891000
IOBCFLG1 EQU   IOBPREFX                                                 00892000
IOBSTDRD EQU   0                                                        00893000
IOBFLAG1 EQU   IOBSTDRD                                                 00894000
IOBCYCCK EQU   IOBFLAG1                                                 00895000
IOBRSTRT EQU   IOBFLAG1                                                 00896000
IOBFLAG2 EQU   IOBSTDRD+1                                               00897000
IOBPURGE EQU   IOBFLAG2                                                 00898000
IOBRDHA0 EQU   IOBFLAG2                                                 00899000
IOBSENS0 EQU   IOBSTDRD+2                                               00900000
IOBS0B7  EQU   IOBSENS0                                                 00901000
IOBSENS1 EQU   IOBSTDRD+3                                               00902000
IOBECBPT EQU   IOBSTDRD+4                                               00903000
IOBFLAG3 EQU   IOBSTDRD+8                                               00904000
IOBFL3   EQU   IOBFLAG3                                                 00905000
IOBCNC   EQU   IOBFL3                                                   00906000
IOBICL   EQU   IOBFL3                                                   00907000
IOBCSW   EQU   IOBSTDRD+9                                               00908000
IOBIOCSW EQU   IOBCSW                                                   00909000
IOBSTBYT EQU   IOBIOCSW+3                                               00910000
IOBUSTAT EQU   IOBSTBYT                                                 00911000
IOBCSTAT EQU   IOBSTBYT+1                                               00912000
IOBSTART EQU   IOBSTDRD+16                                              00913000
IOBDCBPT EQU   IOBSTDRD+20                                              00914000
IOBFLAG4 EQU   IOBDCBPT                                                 00915000
IOBRESTR EQU   IOBSTDRD+24                                              00916000
IOBINCAM EQU   IOBSTDRD+28                                              00917000
IOBBTAMF EQU   IOBINCAM                                                 00918000
SRBSECT  EQU   0                                                        00919000
SRBFLC   EQU   SRBSECT+12                                               00920000
IOSB     EQU   0                                                        00921000
IOSFLA   EQU   IOSB                                                     00922000
IOSACHN  EQU   IOSFLA                                                   00923000
IOSFLB   EQU   IOSB+1                                                   00924000
IOSFLC   EQU   IOSB+2                                                   00925000
IOSDVALT EQU   IOSFLC                                                   00926000
IOSPKEY  EQU   IOSB+12                                                  00927000
IOSOPT   EQU   IOSB+14                                                  00928000
IOSOPT2  EQU   IOSB+15                                                  00929000
@NM00084 EQU   IOSB+20                                                  00930000
IOSCSW   EQU   @NM00084+1                                               00931000
IOSTATUS EQU   IOSCSW+3                                                 00932000
IOSIPIB  EQU   IOSB+44                                                  00933000
IOSPATH  EQU   IOSB+86                                                  00934000
IOSCHN   EQU   IOSPATH                                                  00935000
IOSCKEY  EQU   IOSB+89                                                  00936000
IOSEEKA  EQU   IOSB+100                                                 00937000
IOSCCHH  EQU   IOSEEKA+3                                                00938000
IOSSKHH  EQU   IOSCCHH+2                                                00939000
ISTLOK   EQU   0                                                        00940000
LOKCHN   EQU   ISTLOK+1                                                 00941000
LOKCHNG  EQU   LOKCHN                                                   00942000
@NM00091 EQU   LOKCHNG+2                                                00943000
ISTPAB   EQU   0                                                        00944000
PABWQCHN EQU   ISTPAB                                                   00945000
PABWEQA  EQU   PABWQCHN                                                 00946000
PABCHAIN EQU   PABWQCHN+4                                               00947000
PABRUNNG EQU   PABCHAIN                                                 00948000
PABRPHFG EQU   ISTPAB+12                                                00949000
PABFLAGS EQU   PABRPHFG                                                 00950000
PABERLCK EQU   PABFLAGS                                                 00951000
PABERRLK EQU   PABERLCK                                                 00952000
PABEND   EQU   ISTPAB+16                                                00953000
ISTDYPAB EQU   0                                                        00954000
DYPCHAIN EQU   ISTDYPAB+4                                               00955000
DYPPACMD EQU   ISTDYPAB+12                                              00956000
ISTRPH   EQU   0                                                        00957000
RPHCNTL  EQU   ISTRPH                                                   00958000
RPHFLAGS EQU   RPHCNTL+2                                                00959000
RPHFSTLC EQU   RPHFLAGS                                                 00960000
RPHFLGB  EQU   RPHCNTL+3                                                00961000
RPHRPHA  EQU   ISTRPH+4                                                 00962000
RPHTSKID EQU   ISTRPH+8                                                 00963000
RPHRESMA EQU   ISTRPH+16                                                00964000
RPHWPFLG EQU   RPHRESMA                                                 00965000
RPHWEA   EQU   ISTRPH+24                                                00966000
RPHCSPA  EQU   RPHWEA                                                   00967000
RPHSRPRM EQU   ISTRPH+28                                                00968000
RPHPABQA EQU   ISTRPH+36                                                00969000
RPHWORK  EQU   ISTRPH+40                                                00970000
RPHSAVE1 EQU   RPHWORK                                                  00971000
RPHSBITS EQU   RPHSAVE1+1                                               00972000
ISTATCVT EQU   0                                                        00973000
ATCRPTCH EQU   ISTATCVT                                                 00974000
ATCITFLD EQU   ISTATCVT+8                                               00975000
ATCITCDS EQU   ATCITFLD+8                                               00976000
ATCITFLG EQU   ATCITCDS+4                                               00977000
ATCITRA1 EQU   ATCITFLG+2                                               00978000
ATCSMPAB EQU   ISTATCVT+88                                              00979000
ATCVDPAB EQU   ISTATCVT+152                                             00980000
ATCLDTIL EQU   ISTATCVT+408                                             00981000
ATCGTSTR EQU   ISTATCVT+608                                             00982000
ATCLUDVT EQU   ISTATCVT+768                                             00983000
ATCANYDT EQU   ISTATCVT+776                                             00984000
@NM00101 EQU   ISTATCVT+780                                             00985000
ATCPODVT EQU   ISTATCVT+804                                             00986000
ATCSTAT  EQU   ISTATCVT+936                                             00987000
ATCSTAT1 EQU   ATCSTAT                                                  00988000
ATCPOFLG EQU   ATCSTAT+2                                                00989000
ATCSTAT4 EQU   ATCSTAT+3                                                00990000
ATCBITAN EQU   ISTATCVT+940                                             00991000
ATCFLAG2 EQU   ATCBITAN+1                                               00992000
ATCONID  EQU   ISTATCVT+944                                             00993000
ATCSSCPA EQU   ISTATCVT+948                                             00994000
ATCHPGM  EQU   ISTATCVT+1012                                            00995000
ATCVLCNT EQU   ISTATCVT+1016                                            00996000
ATCRNO   EQU   ISTATCVT+1020                                            00997000
@NM00124 EQU   ISTATCVT+1028                                            00998000
ATCSHRFG EQU   @NM00124+8                                               00999000
ATCCPDVT EQU   ISTATCVT+1096                                            01000000
ATCSMSDQ EQU   ISTATCVT+1140                                            01001000
ATCRID   EQU   ISTATCVT+1152                                            01002000
ATCLDAPP EQU   ISTATCVT+1288                                            01003000
ATCSQAFR EQU   ISTATCVT+1312                                            01004000
ATCORTCB EQU   ATCSQAFR+4                                               01005000
ATCORSRB EQU   ATCORTCB                                                 01006000
ATCICAPP EQU   ISTATCVT+1320                                            01007000
ATCDAPVT EQU   ISTATCVT+1340                                            01008000
ATCGSRBQ EQU   ISTATCVT+1472                                            01009000
ATCGSRBG EQU   ATCGSRBQ                                                 01010000
ATCENFLG EQU   ISTATCVT+1512                                            01011000
@NM00139 EQU   ISTATCVT+1575                                            01012000
ATCVTFLG EQU   ISTATCVT+1576                                            01013000
ATCAP69  EQU   ISTATCVT+1652                                            01014000
ATCZFLAG EQU   ISTATCVT+1696                                            01015000
ATCCRA   EQU   ISTATCVT+1720                                            01016000
ATCCRACN EQU   ATCCRA+4                                                 01017000
ATCSRB   EQU   ISTATCVT+1728                                            01018000
ATCSRBCN EQU   ATCSRB+4                                                 01019000
ATCCRPL  EQU   ISTATCVT+1736                                            01020000
ATCRPLCN EQU   ATCCRPL+4                                                01021000
ISTAVT   EQU   0                                                        01022000
ISTRETRG EQU   ISTAVT+44                                                01023000
ISTDEVCH EQU   0                                                        01024000
DEVSHCH  EQU   ISTDEVCH                                                 01025000
DEVCHAR  EQU   DEVSHCH                                                  01026000
DEVTCODE EQU   ISTDEVCH+1                                               01027000
DEVFLAGS EQU   ISTDEVCH+3                                               01028000
DEVFCCTL EQU   DEVFLAGS                                                 01029000
DEVCHAR3 EQU   DEVFLAGS                                                 01030000
DEVMODE  EQU   ISTDEVCH+5                                               01031000
ISTCCW   EQU   0                                                        01032000
CCWVADDR EQU   ISTCCW                                                   01033000
CCWFLAGS EQU   ISTCCW+4                                                 01034000
CCWSPARE EQU   ISTCCW+5                                                 01035000
ISTNCB   EQU   0                                                        01036000
NCBFLAGS EQU   ISTNCB+24                                                01037000
NCBFRAS  EQU   NCBFLAGS+1                                               01038000
NCBFTRIO EQU   NCBFRAS                                                  01039000
NCBFLAG1 EQU   NCBFLAGS+2                                               01040000
NCBEXFLG EQU   ISTNCB+28                                                01041000
ISTLDNCB EQU   0                                                        01042000
LDNDLCIA EQU   ISTLDNCB+104                                             01043000
LDNCAW   EQU   LDNDLCIA+8                                               01044000
LDNSENSE EQU   LDNDLCIA+12                                              01045000
@NM00158 EQU   LDNSENSE                                                 01046000
LDNSTS   EQU   LDNDLCIA+14                                              01047000
@NM00160 EQU   LDNSTS                                                   01048000
LDNDEVCA EQU   ISTLDNCB+128                                             01049000
LDNPENDQ EQU   LDNDEVCA+16                                              01050000
LDNBUFFQ EQU   LDNDEVCA+24                                              01051000
LDNUNAME EQU   LDNDEVCA+36                                              01052000
LDNRMLEN EQU   LDNDEVCA+42                                              01053000
LDNSIOCT EQU   LDNDEVCA+44                                              01054000
LDNFLAG1 EQU   LDNDEVCA+48                                              01055000
LDNFLAG2 EQU   LDNDEVCA+52                                              01056000
@NM00163 EQU   LDNFLAG2                                                 01057000
LDNTESTM EQU   @NM00163                                                 01058000
LDNTMIND EQU   LDNTESTM                                                 01059000
@NM00165 EQU   LDNFLAG2+1                                               01060000
LDNRDREQ EQU   @NM00165                                                 01061000
LDNSYSUA EQU   ISTLDNCB+184                                             01062000
LDNDCDEB EQU   LDNSYSUA+16                                              01063000
LDNDIDEB EQU   LDNDCDEB+36                                              01064000
LDNSPACE EQU   LDNDCDEB+40                                              01065000
ISTICNCB EQU   0                                                        01066000
ICNDLCIA EQU   ISTICNCB+104                                             01067000
ICNSENSE EQU   ICNDLCIA+12                                              01068000
@NM00186 EQU   ICNSENSE                                                 01069000
ICNDTCHK EQU   @NM00186                                                 01070000
ICNOVRUN EQU   @NM00186                                                 01071000
@NM00187 EQU   ICNSENSE+1                                               01072000
ICNSTS   EQU   ICNDLCIA+14                                              01073000
@NM00189 EQU   ICNSTS                                                   01074000
ICNDEVCA EQU   ISTICNCB+128                                             01075000
ICNWSCCW EQU   ICNDEVCA                                                 01076000
ICNWSTIC EQU   ICNDEVCA+8                                               01077000
ICNNPCCW EQU   ICNDEVCA+24                                              01078000
ICNSMNOP EQU   ICNDEVCA+32                                              01079000
ICNRSCCW EQU   ICNDEVCA+40                                              01080000
ICNRSTIC EQU   ICNDEVCA+48                                              01081000
ICNPENDQ EQU   ICNDEVCA+56                                              01082000
ICNBUFFQ EQU   ICNDEVCA+64                                              01083000
ICNBUFRQ EQU   ICNBUFFQ+6                                               01084000
ICNFLAG1 EQU   ICNDEVCA+80                                              01085000
ICNFLAG2 EQU   ICNDEVCA+84                                              01086000
@NM00192 EQU   ICNFLAG2                                                 01087000
ICNLAT   EQU   ICNDEVCA+92                                              01088000
ICNUNAME EQU   ICNDEVCA+96                                              01089000
ICNTECT  EQU   ICNDEVCA+101                                             01090000
ICNSIOCT EQU   ICNDEVCA+102                                             01091000
ICNSYSUA EQU   ISTICNCB+232                                             01092000
ICNCKFLD EQU   ICNSYSUA                                                 01093000
ICNDCDEB EQU   ICNSYSUA+16                                              01094000
ICNDIDEB EQU   ICNDCDEB+36                                              01095000
ICNSPACE EQU   ICNDCDEB+40                                              01096000
ISTZFSAV EQU   0                                                        01097000
ISTZ19SV EQU   0                                                        01098000
ZSAF19FG EQU   ISTZ19SV                                                 01099000
PARMLIST EQU   0                                                        01100000
DWORD0   EQU   PARMLIST                                                 01101000
WORD0    EQU   DWORD0                                                   01102000
BUF370X  EQU   0                                                        01103000
B370XF1A EQU   BUF370X                                                  01104000
B370XF1L EQU   BUF370X+4                                                01105000
B370XF1R EQU   BUF370X+6                                                01106000
B370XUCB EQU   BUF370X+8                                                01107000
B370XUOB EQU   BUF370X+520                                              01108000
B370XU07 EQU   BUF370X+544                                              01109000
B370XF2A EQU   BUF370X+552                                              01110000
B370XF2L EQU   BUF370X+556                                              01111000
B370XF2R EQU   BUF370X+558                                              01112000
B370XICN EQU   BUF370X+560                                              01113000
B370XF3A EQU   BUF370X+1024                                             01114000
B370XF3L EQU   BUF370X+1028                                             01115000
B370XF3R EQU   BUF370X+1030                                             01116000
BUF3270  EQU   0                                                        01117000
B3270F1A EQU   BUF3270                                                  01118000
B3270F1L EQU   BUF3270+4                                                01119000
B3270F1R EQU   BUF3270+6                                                01120000
B3270UCB EQU   BUF3270+8                                                01121000
B3270UOB EQU   BUF3270+520                                              01122000
B3270U06 EQU   BUF3270+544                                              01123000
B3270F2A EQU   BUF3270+560                                              01124000
B3270F2L EQU   BUF3270+564                                              01125000
B3270F2R EQU   BUF3270+566                                              01126000
B3270LDN EQU   BUF3270+568                                              01127000
B3270F3A EQU   BUF3270+984                                              01128000
B3270F3L EQU   BUF3270+988                                              01129000
B3270F3R EQU   BUF3270+990                                              01130000
WKAREA   EQU   0                                                        01131000
FRR69PRM EQU   WKAREA                                                   01132000
REG14SV  EQU   WKAREA+4                                                 01133000
SDMPAREA EQU   WKAREA+8                                                 01134000
ISTXDYP  EQU   0                                                        01135000
ISTXPAB  EQU   0                                                        01136000
UCBBGN   EQU   0                                                        01137000
FLC      EQU   PSA                                                      01138000
PSARSVTE EQU   PSARSVT                                                  01139000
PSACSTK  EQU   PSARSVTE                                                 01140000
CVTS01   EQU   CVTPGSIA                                                 01141000
CVTLPDIA EQU   CVTS01+12                                                01142000
CVTDIRST EQU   CVTLPDIA                                                 01143000
CVTSLIDA EQU   CVTS01+24                                                01144000
CVTCTLFG EQU   CVTS01+50                                                01145000
CVTSDMP  EQU   CVTS01+232                                               01146000
CVTSDBF  EQU   CVTS01+240                                               01147000
CVTRV210 EQU   CVTS01+424                                               01148000
CVTRV219 EQU   CVTS01+425                                               01149000
CVTRV228 EQU   CVTS01+426                                               01150000
CVTRV237 EQU   CVTS01+427                                               01151000
CVTMFRTR EQU   CVTS01+452                                               01152000
CVTRV262 EQU   CVTS01+468                                               01153000
CVTRV271 EQU   CVTS01+469                                               01154000
CVTRV280 EQU   CVTS01+470                                               01155000
CVTRV289 EQU   CVTS01+471                                               01156000
CVTGSDA  EQU   CVTS01+600                                               01157000
UCBOBS01 EQU   UCBDEV                                                   01158000
UCBSTAB  EQU   UCBOBS01+10                                              01159000
UCBBSVL  EQU   UCBSTAB                                                  01160000
UCBPRSRS EQU   UCBSTAB                                                  01161000
UCBDMCT  EQU   UCBOBS01+11                                              01162000
UCBFL4   EQU   UCBOBS01+13                                              01163000
UCBOBS02 EQU   UCBDEV                                                   01164000
UCBTFL1  EQU   UCBOBS02+19                                              01165000
UCBXTN   EQU   UCBOBS02+20                                              01166000
UCBVOPT  EQU   UCBXTN                                                   01167000
UCBOBS03 EQU   UCBDEV                                                   01168000
UCBXTADR EQU   UCBOBS03                                                 01169000
UCBOBS04 EQU   UCBDEV                                                   01170000
UCBBTA   EQU   UCBOBS04+12                                              01171000
UCBOBS06 EQU   UCBDEV                                                   01172000
UCBAOF   EQU   UCBOBS06                                                 01173000
UCBAOF1  EQU   UCBAOF                                                   01174000
UCBAOF2  EQU   UCBAOF+1                                                 01175000
@NM00079 EQU   UCBOBS06+3                                               01176000
UCBIRB   EQU   UCBOBS06+4                                               01177000
UCBGRAF  EQU   UCBIRB                                                   01178000
UCBLDNCA EQU   UCBOBS06+8                                               01179000
UCBRDYQ  EQU   UCBLDNCA                                                 01180000
UCBIRLN  EQU   UCBRDYQ                                                  01181000
UCBLDNCB EQU   UCBRDYQ+1                                                01182000
UCBCTLNK EQU   UCBOBS06+12                                              01183000
UCBOBS07 EQU   UCBDEV                                                   01184000
UCBICNCB EQU   UCBOBS07+4                                               01185000
UCBOBS08 EQU   UCBDEV                                                   01186000
UCBCTCAD EQU   UCBOBS08                                                 01187000
UCBCTCF1 EQU   UCBOBS08+4                                               01188000
UCBOBS09 EQU   UCBDEV                                                   01189000
IOBORG01 EQU   IOBPREFX+8                                               01190000
IOBNIOBA EQU   IOBORG01                                                 01191000
IOBNFLG1 EQU   IOBNIOBA                                                 01192000
IOBPRTOV EQU   IOBNFLG1                                                 01193000
IOBORG02 EQU   IOBPREFX+8                                               01194000
IOBDQADA EQU   IOBORG02                                                 01195000
IOBDEQIN EQU   IOBDQADA                                                 01196000
IOBORG03 EQU   IOBPREFX+12                                              01197000
IOBORG04 EQU   IOBINCAM                                                 01198000
IOBORG12 EQU   IOBINCAM                                                 01199000
IOBFL4   EQU   IOBORG12                                                 01200000
IOBEXTEN EQU   IOBSTDRD+32                                              01201000
IOBSEEK  EQU   IOBEXTEN                                                 01202000
IOBBB    EQU   IOBSEEK+1                                                01203000
IOBCC    EQU   IOBSEEK+3                                                01204000
IOBHH    EQU   IOBSEEK+5                                                01205000
IOBORG05 EQU   IOBEXTEN                                                 01206000
IOBORG06 EQU   IOBEXTEN                                                 01207000
IOBNXTPT EQU   IOBORG06+4                                               01208000
IOBSTATA EQU   IOBNXTPT                                                 01209000
IOBORG07 EQU   IOBEXTEN+8                                               01210000
W1IEXTEN EQU   IOBORG07                                                 01211000
IOBORG08 EQU   IOBEXTEN+8                                               01212000
IOBINDCT EQU   IOBORG08+4                                               01213000
IOBUNSQR EQU   IOBORG08+5                                               01214000
IOBFCHAD EQU   IOBORG08+8                                               01215000
IOBORG09 EQU   IOBEXTEN+8                                               01216000
IOBDPLAD EQU   IOBORG09+4                                               01217000
IOBDTYPE EQU   IOBORG09+8                                               01218000
IOBDTYP2 EQU   IOBORG09+9                                               01219000
IOBDSTAT EQU   IOBORG09+10                                              01220000
IOBSTAT1 EQU   IOBDSTAT                                                 01221000
IOBORG10 EQU   IOBEXTEN+8                                               01222000
IOBSEEK2 EQU   IOBORG10                                                 01223000
IOBORG11 EQU   IOBEXTEN                                                 01224000
IOBERCT  EQU   IOBORG11                                                 01225000
IOBUCBXV EQU   IOBERCT                                                  01226000
IOBNAME  EQU   IOBORG11+4                                               01227000
IOBORG13 EQU   IOBEXTEN                                                 01228000
IOBSKADR EQU   IOBORG13                                                 01229000
IOSATTSC EQU   IOSIPIB                                                  01230000
IOSWTOWA EQU   IOSIPIB                                                  01231000
IOSPCISC EQU   IOSIPIB                                                  01232000
PABXTNSN EQU   PABEND                                                   01233000
@NM00171 EQU   LDNFLAG1                                                 01234000
LDNUFLAG EQU   @NM00171                                                 01235000
@NM00173 EQU   @NM00171+1                                               01236000
LDNCLREC EQU   @NM00173                                                 01237000
@NM00177 EQU   LDNSPACE                                                 01238000
LDNZH003 EQU   @NM00177+16                                              01239000
@NM00182 EQU   @NM00177+20                                              01240000
@NM00200 EQU   ICNFLAG1                                                 01241000
@NM00201 EQU   @NM00200                                                 01242000
ICNCLREC EQU   @NM00201                                                 01243000
@NM00204 EQU   @NM00200+1                                               01244000
ICNANSIP EQU   @NM00204                                                 01245000
ICNRDREQ EQU   @NM00204                                                 01246000
ICNUFLAG EQU   @NM00200+2                                               01247000
ICNUHARD EQU   ICNUFLAG                                                 01248000
ICNURQCN EQU   ICNUFLAG                                                 01249000
@NM00208 EQU   ICNSPACE                                                 01250000
ICNZH002 EQU   @NM00208+12                                              01251000
ICNZS002 EQU   ICNZH002                                                 01252000
ICNZS003 EQU   ICNZH002                                                 01253000
ICNZS004 EQU   ICNZH002                                                 01254000
ICNZS006 EQU   ICNZH002                                                 01255000
ICNZS007 EQU   ICNZH002                                                 01256000
ICNZS008 EQU   ICNZH002                                                 01257000
ICNZS009 EQU   ICNZH002+1                                               01258000
ICNZS00A EQU   ICNZH002+1                                               01259000
@NM00209 EQU   @NM00208+19                                              01260000
ICNRSRT  EQU   @NM00209                                                 01261000
@NM00211 EQU   @NM00208+20                                              01262000
ISTICNCT EQU   ISTICNCB                                                 01263000
ICNSTATS EQU   ISTICNCT+464                                             01264000
ICNBUFF  EQU   ICNBUFRQ                                                 01265000
ICNCUUA  EQU   ICNUNAME                                                 01266000
ICNIDT   EQU   ICNLAT                                                   01267000
ICNLCVTA EQU   ICNLAT                                                   01268000
ICNZD001 EQU   ICNWSCCW                                                 01269000
ICNZD002 EQU   ICNWSTIC                                                 01270000
ICNZD003 EQU   ICNRSCCW                                                 01271000
ICNZD004 EQU   ICNRSTIC                                                 01272000
ICNZD005 EQU   ICNNPCCW                                                 01273000
ICNZD006 EQU   ICNSMNOP                                                 01274000
ICNZH001 EQU   ICNSIOCT                                                 01275000
ICNZX001 EQU   ICNTECT                                                  01276000
LDNCPQ   EQU   LDNCAW                                                   01277000
LDNCUUA  EQU   LDNUNAME                                                 01278000
LDNINIT  EQU   LDNRMLEN                                                 01279000
LDNVCPAD EQU   LDNCAW                                                   01280000
LDNZARM  EQU   LDNRMLEN                                                 01281000
LDNZH002 EQU   LDNSIOCT                                                 01282000
SRB      EQU   SRBSECT                                                  01283000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01284000
ICNSLODN EQU   ICNSTATS+28                                              01285000
ICNRDBUF EQU   ICNSTATS+24                                              01286000
ICNOPIU  EQU   ICNSTATS+20                                              01287000
ICNIPIU  EQU   ICNSTATS+16                                              01288000
ICNRDATN EQU   ICNSTATS+12                                              01289000
ICNATTN  EQU   ICNSTATS+8                                               01290000
ICNCHRD  EQU   ICNSTATS+4                                               01291000
ICNCHWR  EQU   ICNSTATS                                                 01292000
@NM00216 EQU   ISTICNCT                                                 01293000
@NM00215 EQU   @NM00208+23                                              01294000
ICNHKMSK EQU   @NM00208+22                                              01295000
ICNERCNT EQU   @NM00208+21                                              01296000
@NM00214 EQU   @NM00211                                                 01297000
@NM00213 EQU   @NM00211                                                 01298000
@NM00212 EQU   @NM00211                                                 01299000
ICNZF026 EQU   @NM00211                                                 01300000
ICNZF024 EQU   @NM00211                                                 01301000
ICNZF023 EQU   @NM00211                                                 01302000
ICNZF022 EQU   @NM00211                                                 01303000
ICNZF021 EQU   @NM00211                                                 01304000
@NM00210 EQU   @NM00209                                                 01305000
ICNZF016 EQU   @NM00209                                                 01306000
ICNZF011 EQU   @NM00209                                                 01307000
ICNZF00E EQU   ICNRSRT                                                  01308000
ICNZF00A EQU   @NM00209                                                 01309000
ICNZF005 EQU   @NM00209                                                 01310000
ICNZF004 EQU   @NM00209                                                 01311000
ICNZF001 EQU   @NM00209                                                 01312000
ICNZX013 EQU   @NM00208+18                                              01313000
ICNZX012 EQU   @NM00208+17                                              01314000
ICNZX011 EQU   @NM00208+16                                              01315000
ICNZX010 EQU   @NM00208+14                                              01316000
ICNZS010 EQU   ICNZH002+1                                               01317000
ICNZS00F EQU   ICNZH002+1                                               01318000
ICNZS00E EQU   ICNZH002+1                                               01319000
ICNZS00D EQU   ICNZH002+1                                               01320000
ICNZS00C EQU   ICNZH002+1                                               01321000
ICNZS00B EQU   ICNZH002+1                                               01322000
ICNZS01A EQU   ICNZS00A                                                 01323000
ICNZS019 EQU   ICNZS009                                                 01324000
ICNZS018 EQU   ICNZS008                                                 01325000
ICNZS017 EQU   ICNZS007                                                 01326000
ICNZS016 EQU   ICNZS006                                                 01327000
ICNZS005 EQU   ICNZH002                                                 01328000
ICNZS014 EQU   ICNZS004                                                 01329000
ICNZS013 EQU   ICNZS003                                                 01330000
ICNZS012 EQU   ICNZS002                                                 01331000
ICNZS001 EQU   ICNZH002                                                 01332000
ICNZV006 EQU   @NM00208+8                                               01333000
ICNZC001 EQU   @NM00208                                                 01334000
@NM00207 EQU   @NM00200+3                                               01335000
@NM00206 EQU   ICNUFLAG                                                 01336000
ICNUIOEM EQU   ICNUFLAG                                                 01337000
ICNROLN  EQU   ICNURQCN                                                 01338000
ICNUDELR EQU   ICNUFLAG                                                 01339000
ICNUSOFT EQU   ICNUFLAG                                                 01340000
ICNZF00F EQU   ICNUHARD                                                 01341000
ICNUDISC EQU   ICNUFLAG                                                 01342000
@NM00205 EQU   @NM00204                                                 01343000
ICNZF013 EQU   ICNRDREQ                                                 01344000
ICNZF010 EQU   ICNANSIP                                                 01345000
ICNSLOW  EQU   @NM00204                                                 01346000
@NM00203 EQU   @NM00201                                                 01347000
ICNZF008 EQU   ICNCLREC                                                 01348000
ICNCLOSE EQU   @NM00201                                                 01349000
@NM00202 EQU   @NM00201                                                 01350000
@NM00184 EQU   @NM00177+23                                              01351000
LDNZX006 EQU   @NM00177+22                                              01352000
LDNZCHNC EQU   @NM00177+21                                              01353000
@NM00183 EQU   @NM00182                                                 01354000
LDNZENTR EQU   @NM00182                                                 01355000
LDNZDSIC EQU   @NM00182                                                 01356000
LDNZCTOV EQU   @NM00182                                                 01357000
LDNZCHNE EQU   @NM00182                                                 01358000
LDNZX005 EQU   @NM00177+19                                              01359000
LDNZX001 EQU   @NM00177+18                                              01360000
LDNZS00F EQU   LDNZH003+1                                               01361000
LDNZS00E EQU   LDNZH003+1                                               01362000
LDNZS00D EQU   LDNZH003+1                                               01363000
@NM00181 EQU   LDNZH003+1                                               01364000
LDNZS00B EQU   LDNZH003+1                                               01365000
@NM00180 EQU   LDNZH003                                                 01366000
LDNZS006 EQU   LDNZH003                                                 01367000
@NM00179 EQU   LDNZH003                                                 01368000
LDNZS004 EQU   LDNZH003                                                 01369000
LDNZS003 EQU   LDNZH003                                                 01370000
LDNZS002 EQU   LDNZH003                                                 01371000
LDNZS001 EQU   LDNZH003                                                 01372000
@NM00178 EQU   LDNZH003                                                 01373000
LDNZFBUF EQU   @NM00177+12                                              01374000
LDNZV006 EQU   @NM00177+8                                               01375000
LDNZC001 EQU   @NM00177                                                 01376000
@NM00176 EQU   @NM00171+3                                               01377000
@NM00175 EQU   @NM00171+2                                               01378000
@NM00174 EQU   @NM00173                                                 01379000
LDNZF001 EQU   LDNCLREC                                                 01380000
LDNCLOSD EQU   @NM00173                                                 01381000
@NM00172 EQU   LDNUFLAG                                                 01382000
LDNUIOEM EQU   LDNUFLAG                                                 01383000
LDNUDELR EQU   LDNUFLAG                                                 01384000
LDNUINOP EQU   LDNUFLAG                                                 01385000
LDNUDISC EQU   LDNUFLAG                                                 01386000
@NM00093 EQU   PABXTNSN+12                                              01387000
PABNPSSQ EQU   PABXTNSN+8                                               01388000
PABLOCK  EQU   PABXTNSN+4                                               01389000
PABLAST  EQU   PABXTNSN                                                 01390000
IOSPCIWA EQU   IOSPCISC+44                                              01391000
IOSPCIRS EQU   IOSPCISC+8                                               01392000
@NM00089 EQU   IOSPCISC+4                                               01393000
@NM00088 EQU   IOSPCISC                                                 01394000
IOSWRNDR EQU   IOSWTOWA+4                                               01395000
IOSWTOPT EQU   IOSWTOWA+3                                               01396000
IOSWTOCP EQU   IOSWTOWA+2                                               01397000
IOSWTOCH EQU   IOSWTOWA                                                 01398000
IOSATTWA EQU   IOSATTSC+40                                              01399000
@NM00087 EQU   IOSATTSC+24                                              01400000
IOSATTSN EQU   IOSATTSC                                                 01401000
IOBSKSS  EQU   IOBSKADR+3                                               01402000
IOBSK0   EQU   IOBSKADR+2                                               01403000
IOBSKTT  EQU   IOBSKADR+1                                               01404000
IOBSKRV  EQU   IOBSKADR                                                 01405000
IOBCSWSV EQU   IOBORG11+17                                              01406000
IOBSENSV EQU   IOBORG11+16                                              01407000
IOBRCD   EQU   IOBORG11+12                                              01408000
IOBMDREC EQU   IOBORG11+8                                               01409000
IOBNAMEA EQU   IOBNAME+1                                                01410000
IOBNAMSZ EQU   IOBNAME                                                  01411000
IOBERCTA EQU   IOBERCT+1                                                01412000
IOBRTYPE EQU   IOBUCBXV                                                 01413000
IOBRDCHP EQU   IOBORG10+20                                              01414000
IOBNEXTA EQU   IOBORG10+16                                              01415000
IOBREADA EQU   IOBORG10+12                                              01416000
IOBBUFC  EQU   IOBORG10+8                                               01417000
IOBSK2R  EQU   IOBSEEK2+7                                               01418000
IOBSK2HH EQU   IOBSEEK2+5                                               01419000
IOBSK2CC EQU   IOBSEEK2+3                                               01420000
IOBSK2BB EQU   IOBSEEK2+1                                               01421000
IOBSK2M  EQU   IOBSEEK2                                                 01422000
IOBCHNPR EQU   IOBORG09+40                                              01423000
IOBDNCRF EQU   IOBORG09+32                                              01424000
IOBRSV35 EQU   IOBORG09+24                                              01425000
IOBDQPTR EQU   IOBORG09+20                                              01426000
IOBRSV34 EQU   IOBORG09+18                                              01427000
IOBDBYTN EQU   IOBORG09+16                                              01428000
IOBDCPND EQU   IOBORG09+12                                              01429000
IOBSTAT2 EQU   IOBDSTAT+1                                               01430000
IOBSIORT EQU   IOBSTAT1                                                 01431000
IOBADDVU EQU   IOBSTAT1                                                 01432000
IOBBUFF  EQU   IOBSTAT1                                                 01433000
IOBENQUE EQU   IOBSTAT1                                                 01434000
IOBPASS2 EQU   IOBSTAT1                                                 01435000
IOBSYNCH EQU   IOBSTAT1                                                 01436000
IOBNEWVL EQU   IOBSTAT1                                                 01437000
IOBABNRM EQU   IOBSTAT1                                                 01438000
IOBRELEX EQU   IOBDTYP2                                                 01439000
IOBADDTY EQU   IOBDTYP2                                                 01440000
IOBTYPE  EQU   IOBDTYP2                                                 01441000
IOBRQUST EQU   IOBDTYP2                                                 01442000
IOBSUFFX EQU   IOBDTYP2                                                 01443000
IOBSBLKL EQU   IOBDTYP2                                                 01444000
IOBSKEY  EQU   IOBDTYP2                                                 01445000
IOBRELBL EQU   IOBDTYPE                                                 01446000
IOBRDEXC EQU   IOBDTYPE                                                 01447000
IOBDYNBF EQU   IOBDTYPE                                                 01448000
IOBACTAD EQU   IOBDTYPE                                                 01449000
IOBFDBCK EQU   IOBDTYPE                                                 01450000
IOBEXTSC EQU   IOBDTYPE                                                 01451000
IOBOVFLO EQU   IOBDTYPE                                                 01452000
IOBVERFY EQU   IOBDTYPE                                                 01453000
IOBDPLB  EQU   IOBDPLAD+1                                               01454000
IOBDAYLI EQU   IOBDPLAD                                                 01455000
IOBDIOBS EQU   IOBORG09+2                                               01456000
IOBDBYTR EQU   IOBORG09                                                 01457000
IOBBCHAD EQU   IOBORG08+12                                              01458000
IOBFCHNB EQU   IOBFCHAD+1                                               01459000
IOBCOUNT EQU   IOBFCHAD                                                 01460000
IOBASYN  EQU   IOBORG08+7                                               01461000
IOBAPP   EQU   IOBORG08+6                                               01462000
IOBRSV32 EQU   IOBUNSQR                                                 01463000
IOBRSV31 EQU   IOBUNSQR                                                 01464000
IOBRSV30 EQU   IOBUNSQR                                                 01465000
IOBKNRWR EQU   IOBUNSQR                                                 01466000
IOBKNWR  EQU   IOBUNSQR                                                 01467000
IOBNTAV2 EQU   IOBUNSQR                                                 01468000
IOBNTAV1 EQU   IOBUNSQR                                                 01469000
IOBCPBSY EQU   IOBUNSQR                                                 01470000
IOBCHNNL EQU   IOBINDCT                                                 01471000
IOBRSV29 EQU   IOBINDCT                                                 01472000
IOBRSV28 EQU   IOBINDCT                                                 01473000
IOBRSV27 EQU   IOBINDCT                                                 01474000
IOBKEYAD EQU   IOBINDCT                                                 01475000
IOBOVPTR EQU   IOBINDCT                                                 01476000
IOBUNSCH EQU   IOBINDCT                                                 01477000
IOBDEQCP EQU   IOBINDCT                                                 01478000
IOBCCWAD EQU   IOBORG08                                                 01479000
W1OEXTEN EQU   W1IEXTEN                                                 01480000
IOBCCW   EQU   IOBORG06+8                                               01481000
IOBNXTPB EQU   IOBNXTPT+1                                               01482000
IOBRSV26 EQU   IOBSTATA                                                 01483000
IOBRSV25 EQU   IOBSTATA                                                 01484000
IOBRSV24 EQU   IOBSTATA                                                 01485000
IOBRSV23 EQU   IOBSTATA                                                 01486000
IOBRSV22 EQU   IOBSTATA                                                 01487000
IOBRSV21 EQU   IOBSTATA                                                 01488000
IOBRSV20 EQU   IOBSTATA                                                 01489000
IOBAVLFL EQU   IOBSTATA                                                 01490000
IOBRSV37 EQU   IOBORG06+1                                               01491000
IOBUCBXG EQU   IOBORG06                                                 01492000
IOBCPA   EQU   IOBORG05+32                                              01493000
IOBERINF EQU   IOBORG05+16                                              01494000
IOBERCCW EQU   IOBORG05+8                                               01495000
IOBSNDPT EQU   IOBORG05+7                                               01496000
IOBRCVPT EQU   IOBORG05+6                                               01497000
IOBWORK  EQU   IOBORG05+1                                               01498000
IOBUCBX  EQU   IOBORG05                                                 01499000
IOBR     EQU   IOBSEEK+7                                                01500000
IOBHH2   EQU   IOBHH+1                                                  01501000
IOBHH1   EQU   IOBHH                                                    01502000
IOBCC2   EQU   IOBCC+1                                                  01503000
IOBCC1   EQU   IOBCC                                                    01504000
IOBBB2   EQU   IOBBB+1                                                  01505000
IOBBB1   EQU   IOBBB                                                    01506000
IOBM     EQU   IOBSEEK                                                  01507000
IOBRSV46 EQU   IOBFL4                                                   01508000
IOBRSV47 EQU   IOBFL4                                                   01509000
IOBENT   EQU   IOBFL4                                                   01510000
IOBEQP   EQU   IOBFL4                                                   01511000
IOBBUS   EQU   IOBFL4                                                   01512000
IOBDCK   EQU   IOBFL4                                                   01513000
IOBREJ   EQU   IOBFL4                                                   01514000
IOBOVR   EQU   IOBFL4                                                   01515000
IOBCRILC EQU   IOBORG04+1                                               01516000
IOBCRDCC EQU   IOBORG04                                                 01517000
IOBGQECB EQU   IOBORG03                                                 01518000
IOBSWAP  EQU   IOBORG02+4                                               01519000
IOBDQADB EQU   IOBDQADA+1                                               01520000
IOBRSV13 EQU   IOBDEQIN                                                 01521000
IOBRSV12 EQU   IOBDEQIN                                                 01522000
IOBRSV11 EQU   IOBDEQIN                                                 01523000
IOBRSV10 EQU   IOBDEQIN                                                 01524000
IOBRSV09 EQU   IOBDEQIN                                                 01525000
IOBRSV08 EQU   IOBDEQIN                                                 01526000
IOBRSV07 EQU   IOBDEQIN                                                 01527000
IOBDEQ   EQU   IOBDEQIN                                                 01528000
IOBNECB  EQU   IOBORG01+4                                               01529000
IOBNIOBB EQU   IOBNIOBA+1                                               01530000
IOBFIRST EQU   IOBNFLG1                                                 01531000
IOBUPERR EQU   IOBNFLG1                                                 01532000
IOBSPAN  EQU   IOBNFLG1                                                 01533000
IOBBKSPC EQU   IOBNFLG1                                                 01534000
IOBUPDAT EQU   IOBNFLG1                                                 01535000
IOBREAD  EQU   IOBNFLG1                                                 01536000
IOBWRITE EQU   IOBNFLG1                                                 01537000
IOBSEGMT EQU   IOBPRTOV                                                 01538000
UCBRV066 EQU   UCBOBS09+4                                               01539000
UCBIOSBA EQU   UCBOBS09                                                 01540000
UCBRV042 EQU   UCBOBS08+5                                               01541000
UCBRV082 EQU   UCBCTCF1                                                 01542000
UCBRV081 EQU   UCBCTCF1                                                 01543000
UCBRV080 EQU   UCBCTCF1                                                 01544000
UCBRV079 EQU   UCBCTCF1                                                 01545000
UCBRV078 EQU   UCBCTCF1                                                 01546000
UCBRV077 EQU   UCBCTCF1                                                 01547000
UCBRV076 EQU   UCBCTCF1                                                 01548000
UCBCTC80 EQU   UCBCTCF1                                                 01549000
UCBCTCAL EQU   UCBCTCAD                                                 01550000
UCBRV040 EQU   UCBOBS07                                                 01551000
UCBCTLNA EQU   UCBCTLNK+1                                               01552000
UCBRLN   EQU   UCBCTLNK                                                 01553000
UCBRDYQA EQU   UCBLDNCB                                                 01554000
UCBINRLN EQU   UCBIRLN                                                  01555000
UCBIRBA  EQU   UCBIRB+1                                                 01556000
UCBRV039 EQU   UCBGRAF                                                  01557000
UCBDWNR  EQU   UCBGRAF                                                  01558000
UCBRPND  EQU   UCBGRAF                                                  01559000
UCBUPM   EQU   UCBGRAF                                                  01560000
UCBBTAM  EQU   UCBGRAF                                                  01561000
UCBDRNO  EQU   UCBGRAF                                                  01562000
UCBDRO   EQU   UCBGRAF                                                  01563000
UCBOIP   EQU   UCBGRAF                                                  01564000
UCBATRCD EQU   @NM00079                                                 01565000
UCBSKPFG EQU   @NM00079                                                 01566000
UCBRIPND EQU   @NM00079                                                 01567000
UCBRTIAC EQU   @NM00079                                                 01568000
UCBRSV79 EQU   @NM00079                                                 01569000
UCBRSV78 EQU   @NM00079                                                 01570000
UCBRSV77 EQU   @NM00079                                                 01571000
UCBOLTEP EQU   @NM00079                                                 01572000
UCBATNCT EQU   UCBOBS06+2                                               01573000
UCBRSV76 EQU   UCBAOF2                                                  01574000
UCBRSV75 EQU   UCBAOF2                                                  01575000
UCBRSV74 EQU   UCBAOF2                                                  01576000
UCBRSV73 EQU   UCBAOF2                                                  01577000
UCBRSV72 EQU   UCBAOF2                                                  01578000
UCBRSV71 EQU   UCBAOF2                                                  01579000
UCBRSV70 EQU   UCBAOF2                                                  01580000
UCBRSV69 EQU   UCBAOF2                                                  01581000
UCBRSV68 EQU   UCBAOF1                                                  01582000
UCBRSV67 EQU   UCBAOF1                                                  01583000
UCBRSV66 EQU   UCBAOF1                                                  01584000
UCBRSV65 EQU   UCBAOF1                                                  01585000
UCBRSV64 EQU   UCBAOF1                                                  01586000
UCBOFNL  EQU   UCBAOF1                                                  01587000
UCBOFSP  EQU   UCBAOF1                                                  01588000
UCBOFMCR EQU   UCBAOF1                                                  01589000
UCBBTB   EQU   UCBBTA+1                                                 01590000
UCBDI    EQU   UCBBTA                                                   01591000
UCBSNS   EQU   UCBOBS04+8                                               01592000
UCBTEB   EQU   UCBOBS04+4                                               01593000
UCBGCB   EQU   UCBOBS04+3                                               01594000
UCBOPEN  EQU   UCBOBS04+2                                               01595000
UCBSTART EQU   UCBOBS04                                                 01596000
UCBXTNB  EQU   UCBXTN+1                                                 01597000
UCBRSV22 EQU   UCBVOPT                                                  01598000
UCBRSV21 EQU   UCBVOPT                                                  01599000
UCBRSV20 EQU   UCBVOPT                                                  01600000
UCBESVE  EQU   UCBVOPT                                                  01601000
UCBERPC  EQU   UCBVOPT                                                  01602000
UCBESVC  EQU   UCBVOPT                                                  01603000
UCBEVA   EQU   UCBVOPT                                                  01604000
UCBESV   EQU   UCBVOPT                                                  01605000
UCBRV009 EQU   UCBTFL1                                                  01606000
UCBRV008 EQU   UCBTFL1                                                  01607000
UCBRV007 EQU   UCBTFL1                                                  01608000
UCBRV006 EQU   UCBTFL1                                                  01609000
UCBRV005 EQU   UCBTFL1                                                  01610000
UCBRV038 EQU   UCBTFL1                                                  01611000
UCBNSLTP EQU   UCBTFL1                                                  01612000
UCBNLTP  EQU   UCBTFL1                                                  01613000
UCBRES1B EQU   UCBOBS02+18                                              01614000
UCBFSER  EQU   UCBOBS02+12                                              01615000
@NM00078 EQU   UCBOBS02+4                                               01616000
UCBFSEQ  EQU   UCBOBS02+2                                               01617000
UCBFSCT  EQU   UCBOBS02                                                 01618000
UCBNEXP  EQU   UCBOBS01+20                                              01619000
UCBBASE  EQU   UCBOBS01+16                                              01620000
UCBRES1A EQU   UCBOBS01+15                                              01621000
UCBUSER  EQU   UCBOBS01+14                                              01622000
UCBFL47  EQU   UCBFL4                                                   01623000
UCBFL46  EQU   UCBFL4                                                   01624000
UCBFL45  EQU   UCBFL4                                                   01625000
UCBRV065 EQU   UCBFL4                                                   01626000
UCBDSS   EQU   UCBFL4                                                   01627000
UCBRV028 EQU   UCBFL4                                                   01628000
UCBWDAV  EQU   UCBFL4                                                   01629000
UCBDAVV  EQU   UCBFL4                                                   01630000
UCBSQC   EQU   UCBOBS01+12                                              01631000
UCBDATP  EQU   UCBOBS01+12                                              01632000
UCBDMC   EQU   UCBDMCT                                                  01633000
UCBMOUNT EQU   UCBDMCT                                                  01634000
UCBBNUL  EQU   UCBSTAB                                                  01635000
UCBSHAR  EQU   UCBSTAB                                                  01636000
UCBBSTR  EQU   UCBSTAB                                                  01637000
UCBBPUB  EQU   UCBSTAB                                                  01638000
UCBBPRV  EQU   UCBSTAB                                                  01639000
UCBBALB  EQU   UCBPRSRS                                                 01640000
UCBPGFL  EQU   UCBSTAB                                                  01641000
UCBDVSHR EQU   UCBBSVL                                                  01642000
UCBVOLI  EQU   UCBOBS01+4                                               01643000
UCBVTOC  EQU   UCBOBS01                                                 01644000
CVTRV628 EQU   CVTS01+728                                               01645000
CVTRV627 EQU   CVTS01+724                                               01646000
CVTRV626 EQU   CVTS01+720                                               01647000
CVTRV625 EQU   CVTS01+716                                               01648000
CVTRV624 EQU   CVTS01+712                                               01649000
CVTRV623 EQU   CVTS01+708                                               01650000
CVTRV622 EQU   CVTS01+704                                               01651000
CVTRV621 EQU   CVTS01+700                                               01652000
CVTIHASU EQU   CVTS01+696                                               01653000
CVTSUSP  EQU   CVTS01+692                                               01654000
CVTT6SVC EQU   CVTS01+688                                               01655000
CVTCDAL  EQU   CVTS01+684                                               01656000
CVTTCTL  EQU   CVTS01+680                                               01657000
CVTRSUME EQU   CVTS01+676                                               01658000
CVTJTERM EQU   CVTS01+672                                               01659000
CVTASMRM EQU   CVTS01+668                                               01660000
CVTTCASP EQU   CVTS01+664                                               01661000
CVT0PT03 EQU   CVTS01+660                                               01662000
CVT0PT0E EQU   CVTS01+656                                               01663000
CVTRV609 EQU   CVTS01+652                                               01664000
CVTCGK   EQU   CVTS01+648                                               01665000
CVTRAC   EQU   CVTS01+644                                               01666000
CVTRV606 EQU   CVTS01+640                                               01667000
CVTRV605 EQU   CVTS01+636                                               01668000
CVTRV604 EQU   CVTS01+632                                               01669000
CVTEFF02 EQU   CVTS01+628                                               01670000
CVTCBBR  EQU   CVTS01+624                                               01671000
CVTSSCR  EQU   CVTS01+620                                               01672000
CVTEVENT EQU   CVTS01+616                                               01673000
CVTCRCA  EQU   CVTS01+612                                               01674000
CVTTPIO  EQU   CVTS01+608                                               01675000
CVTADV   EQU   CVTS01+604                                               01676000
CVTGSDAB EQU   CVTGSDA                                                  01677000
CVTQV3   EQU   CVTS01+596                                               01678000
CVTQV2   EQU   CVTS01+592                                               01679000
CVTQV1   EQU   CVTS01+588                                               01680000
CVTRPT   EQU   CVTS01+584                                               01681000
CVTSSRB  EQU   CVTS01+580                                               01682000
CVTCSDRL EQU   CVTS01+576                                               01683000
CVTEXP1  EQU   CVTS01+572                                               01684000
CVTRMPMT EQU   CVTS01+568                                               01685000
CVTRMPTT EQU   CVTS01+564                                               01686000
CVTVPSA  EQU   CVTS01+560                                               01687000
CVTVSTOP EQU   CVTS01+556                                               01688000
CVTGTFR8 EQU   CVTS01+552                                               01689000
CVTQUIT  EQU   CVTS01+548                                               01690000
CVTVACR  EQU   CVTS01+544                                               01691000
CVTWTCB  EQU   CVTS01+540                                               01692000
CVTSTPRS EQU   CVTS01+536                                               01693000
CVT0PT02 EQU   CVTS01+532                                               01694000
CVTDARCM EQU   CVTS01+528                                               01695000
CVTIRECM EQU   CVTS01+524                                               01696000
CVTJRECM EQU   CVTS01+520                                               01697000
CVTVEMS0 EQU   CVTS01+516                                               01698000
CVTSPFRR EQU   CVTS01+512                                               01699000
CVTRLSTG EQU   CVTS01+508                                               01700000
CVT0TC0A EQU   CVTS01+504                                               01701000
CVTGMBR  EQU   CVTS01+500                                               01702000
CVTLFRM  EQU   CVTS01+496                                               01703000
CVTRMBR  EQU   CVTS01+492                                               01704000
CVTVIOP  EQU   CVTS01+488                                               01705000
CVTRV307 EQU   CVTS01+486                                               01706000
CVTRV306 EQU   CVTS01+484                                               01707000
CVTRV305 EQU   CVTS01+482                                               01708000
CVTRV304 EQU   CVTS01+480                                               01709000
CVTRV303 EQU   CVTS01+478                                               01710000
CVTRV302 EQU   CVTS01+476                                               01711000
CVTTRCA  EQU   CVTS01+472                                               01712000
CVTRV297 EQU   CVTRV289                                                 01713000
CVTRV296 EQU   CVTRV289                                                 01714000
CVTRV295 EQU   CVTRV289                                                 01715000
CVTRV294 EQU   CVTRV289                                                 01716000
CVTRV293 EQU   CVTRV289                                                 01717000
CVTRV292 EQU   CVTRV289                                                 01718000
CVTRV291 EQU   CVTRV289                                                 01719000
CVTRV290 EQU   CVTRV289                                                 01720000
CVTRV288 EQU   CVTRV280                                                 01721000
CVTRV287 EQU   CVTRV280                                                 01722000
CVTRV286 EQU   CVTRV280                                                 01723000
CVTRV285 EQU   CVTRV280                                                 01724000
CVTRV284 EQU   CVTRV280                                                 01725000
CVTRV283 EQU   CVTRV280                                                 01726000
CVTRV282 EQU   CVTRV280                                                 01727000
CVTRV281 EQU   CVTRV280                                                 01728000
CVTRV279 EQU   CVTRV271                                                 01729000
CVTRV278 EQU   CVTRV271                                                 01730000
CVTRV277 EQU   CVTRV271                                                 01731000
CVTRV276 EQU   CVTRV271                                                 01732000
CVTRV275 EQU   CVTRV271                                                 01733000
CVTRV274 EQU   CVTRV271                                                 01734000
CVTRV273 EQU   CVTRV271                                                 01735000
CVTRV272 EQU   CVTRV271                                                 01736000
CVTRV270 EQU   CVTRV262                                                 01737000
CVTRV269 EQU   CVTRV262                                                 01738000
CVTRV268 EQU   CVTRV262                                                 01739000
CVTRV267 EQU   CVTRV262                                                 01740000
CVTRV266 EQU   CVTRV262                                                 01741000
CVTRV265 EQU   CVTRV262                                                 01742000
CVTRV264 EQU   CVTRV262                                                 01743000
CVTRV263 EQU   CVTRV262                                                 01744000
CVTVFP   EQU   CVTS01+464                                               01745000
CVTVSI   EQU   CVTS01+460                                               01746000
CVTVPSIB EQU   CVTS01+456                                               01747000
CVTMFACT EQU   CVTMFRTR                                                 01748000
CVTMFCTL EQU   CVTS01+448                                               01749000
CVTPVBP  EQU   CVTS01+444                                               01750000
CVTPWI   EQU   CVTS01+440                                               01751000
CVTRV254 EQU   CVTS01+438                                               01752000
CVTRV253 EQU   CVTS01+436                                               01753000
CVTRV252 EQU   CVTS01+434                                               01754000
CVTRV251 EQU   CVTS01+433                                               01755000
CVTRV250 EQU   CVTS01+432                                               01756000
CVTRV249 EQU   CVTS01+431                                               01757000
CVTRV248 EQU   CVTS01+430                                               01758000
CVTRV247 EQU   CVTS01+429                                               01759000
CVTRV246 EQU   CVTS01+428                                               01760000
CVTRV245 EQU   CVTRV237                                                 01761000
CVTRV244 EQU   CVTRV237                                                 01762000
CVTRV243 EQU   CVTRV237                                                 01763000
CVTRV242 EQU   CVTRV237                                                 01764000
CVTRV241 EQU   CVTRV237                                                 01765000
CVTRV240 EQU   CVTRV237                                                 01766000
CVTRV239 EQU   CVTRV237                                                 01767000
CVTRV238 EQU   CVTRV237                                                 01768000
CVTRV236 EQU   CVTRV228                                                 01769000
CVTRV235 EQU   CVTRV228                                                 01770000
CVTRV234 EQU   CVTRV228                                                 01771000
CVTRV233 EQU   CVTRV228                                                 01772000
CVTRV232 EQU   CVTRV228                                                 01773000
CVTRV231 EQU   CVTRV228                                                 01774000
CVTRV230 EQU   CVTRV228                                                 01775000
CVTRV229 EQU   CVTRV228                                                 01776000
CVTRV227 EQU   CVTRV219                                                 01777000
CVTRV226 EQU   CVTRV219                                                 01778000
CVTRV225 EQU   CVTRV219                                                 01779000
CVTRV224 EQU   CVTRV219                                                 01780000
CVTRV223 EQU   CVTRV219                                                 01781000
CVTRV222 EQU   CVTRV219                                                 01782000
CVTRV221 EQU   CVTRV219                                                 01783000
CVTRV220 EQU   CVTRV219                                                 01784000
CVTRV218 EQU   CVTRV210                                                 01785000
CVTRV217 EQU   CVTRV210                                                 01786000
CVTRV216 EQU   CVTRV210                                                 01787000
CVTRV215 EQU   CVTRV210                                                 01788000
CVTRV214 EQU   CVTRV210                                                 01789000
CVTRV213 EQU   CVTRV210                                                 01790000
CVTRV212 EQU   CVTRV210                                                 01791000
CVTRV211 EQU   CVTRV210                                                 01792000
CVTLCCAT EQU   CVTS01+420                                               01793000
CVTPCCAT EQU   CVTS01+416                                               01794000
CVTIPCRP EQU   CVTS01+412                                               01795000
CVTIPCRI EQU   CVTS01+408                                               01796000
CVTIPCDS EQU   CVTS01+404                                               01797000
CVTAIDVT EQU   CVTS01+400                                               01798000
CVTSSAP  EQU   CVTS01+396                                               01799000
CVTEHCIR EQU   CVTS01+392                                               01800000
CVTEHDEF EQU   CVTS01+388                                               01801000
CVTDAIR  EQU   CVTS01+384                                               01802000
CVTPERFM EQU   CVTS01+380                                               01803000
CVT044R2 EQU   CVTS01+376                                               01804000
CVTFETCH EQU   CVTS01+372                                               01805000
CVTRSTWD EQU   CVTS01+368                                               01806000
CVTSPOST EQU   CVTS01+364                                               01807000
CVTIOBP  EQU   CVTS01+360                                               01808000
CVTASMVT EQU   CVTS01+356                                               01809000
CVTRECRQ EQU   CVTS01+352                                               01810000
CVTWSAC  EQU   CVTS01+348                                               01811000
CVTRV149 EQU   CVTS01+344                                               01812000
CVTWSAL  EQU   CVTS01+340                                               01813000
CVTSPSA  EQU   CVTS01+336                                               01814000
CVTGLMN  EQU   CVTS01+332                                               01815000
CVTVEAC0 EQU   CVTS01+328                                               01816000
CVT062R1 EQU   CVTS01+324                                               01817000
CVTRPOST EQU   CVTS01+320                                               01818000
CVTDQIQE EQU   CVTS01+316                                               01819000
CVTCSD   EQU   CVTS01+312                                               01820000
CVTLKRMA EQU   CVTS01+308                                               01821000
CVTRSPIE EQU   CVTS01+304                                               01822000
CVTRENQ  EQU   CVTS01+300                                               01823000
CVTLQCB  EQU   CVTS01+296                                               01824000
CVTFQCB  EQU   CVTS01+292                                               01825000
CVTQCS01 EQU   CVTS01+288                                               01826000
CVTAPFT  EQU   CVTS01+284                                               01827000
CVTPARRL EQU   CVTS01+280                                               01828000
CVTVWAIT EQU   CVTS01+276                                               01829000
CVTGSPL  EQU   CVTS01+272                                               01830000
CVTLSMQ  EQU   CVTS01+268                                               01831000
CVTGSMQ  EQU   CVTS01+264                                               01832000
CVTEXPRO EQU   CVTS01+260                                               01833000
CVTOPCTP EQU   CVTS01+256                                               01834000
CVTSIC   EQU   CVTS01+252                                               01835000
CVTTPIOS EQU   CVTS01+248                                               01836000
CVTRTMS  EQU   CVTS01+244                                               01837000
CVTSCBP  EQU   CVTS01+236                                               01838000
CVTSV60  EQU   CVTS01+228                                               01839000
CVTRTMCT EQU   CVTS01+224                                               01840000
CVTASCBL EQU   CVTS01+220                                               01841000
CVTASCBH EQU   CVTS01+216                                               01842000
CVTGDA   EQU   CVTS01+212                                               01843000
CVTASVT  EQU   CVTS01+208                                               01844000
CVTVVMDI EQU   CVTS01+204                                               01845000
CVTAQTOP EQU   CVTS01+200                                               01846000
CVTIOSCS EQU   CVTS01+196                                               01847000
CVTSDRM  EQU   CVTS01+192                                               01848000
CVTOPTE  EQU   CVTS01+188                                               01849000
CVTSTXU  EQU   CVTS01+184                                               01850000
CVTQUIS  EQU   CVTS01+180                                               01851000
CVTPARS  EQU   CVTS01+176                                               01852000
CVTS1EE  EQU   CVTS01+172                                               01853000
CVTFRAS  EQU   CVTS01+168                                               01854000
CVTQSAS  EQU   CVTS01+164                                               01855000
CVTCRAS  EQU   CVTS01+160                                               01856000
CVTCRMN  EQU   CVTS01+156                                               01857000
CVTDELCP EQU   CVTS01+152                                               01858000
CVTFRECL EQU   CVTS01+148                                               01859000
CVTGETCL EQU   CVTS01+144                                               01860000
CVTBLDCP EQU   CVTS01+140                                               01861000
CVTAUTHL EQU   CVTS01+136                                               01862000
CVTSCAN  EQU   CVTS01+132                                               01863000
CVTRV144 EQU   CVTS01+130                                               01864000
CVTMAXMP EQU   CVTS01+128                                               01865000
CVTSTCK  EQU   CVTS01+124                                               01866000
CVTRV139 EQU   CVTS01+123                                               01867000
CVTDSSAC EQU   CVTS01+122                                               01868000
CVTRV513 EQU   CVTS01+121                                               01869000
CVTIOSPL EQU   CVTS01+120                                               01870000
CVTPTGT  EQU   CVTS01+116                                               01871000
CVTCSPIE EQU   CVTS01+112                                               01872000
CVTSMFEX EQU   CVTS01+108                                               01873000
CVTOLT0A EQU   CVTS01+104                                               01874000
CVTSRBRT EQU   CVTS01+100                                               01875000
CVTPUTL  EQU   CVTS01+96                                                01876000
CVTASCRL EQU   CVTS01+92                                                01877000
CVTASCRF EQU   CVTS01+88                                                01878000
CVTRV326 EQU   CVTS01+84                                                01879000
CVTRV325 EQU   CVTS01+80                                                01880000
CVTRV324 EQU   CVTS01+76                                                01881000
CVT0VL01 EQU   CVTS01+72                                                01882000
CVTSHRVM EQU   CVTS01+68                                                01883000
CVTRV332 EQU   CVTS01+64                                                01884000
CVTTAS   EQU   CVTS01+60                                                01885000
CVTRSCN  EQU   CVTS01+56                                                01886000
CVTTRAC2 EQU   CVTS01+54                                                01887000
CVTTRACE EQU   CVTS01+52                                                01888000
CVTAPG   EQU   CVTS01+51                                                01889000
CVTSDTRC EQU   CVTCTLFG                                                 01890000
CVTGTRCE EQU   CVTCTLFG                                                 01891000
CVTNOMP  EQU   CVTCTLFG                                                 01892000
CVTRSV79 EQU   CVTCTLFG                                                 01893000
CVTDSTAT EQU   CVTCTLFG                                                 01894000
CVTRSV78 EQU   CVTCTLFG                                                 01895000
CVTRV333 EQU   CVTCTLFG                                                 01896000
CVTRV323 EQU   CVTCTLFG                                                 01897000
CVTSPVLK EQU   CVTS01+49                                                01898000
CVTRSV77 EQU   CVTS01+48                                                01899000
CVTRV331 EQU   CVTS01+44                                                01900000
CVTRV330 EQU   CVTS01+40                                                01901000
CVTRV329 EQU   CVTS01+36                                                01902000
CVTRV328 EQU   CVTS01+32                                                01903000
CVTRV322 EQU   CVTS01+28                                                01904000
CVTSLID  EQU   CVTSLIDA+1                                               01905000
CVTSYLK  EQU   CVTSLIDA                                                 01906000
CVTRV321 EQU   CVTS01+20                                                01907000
CVTRV320 EQU   CVTS01+16                                                01908000
CVTLPDIR EQU   CVTLPDIA+1                                               01909000
CVTRSV69 EQU   CVTDIRST                                                 01910000
CVTRSV68 EQU   CVTDIRST                                                 01911000
CVTRSV67 EQU   CVTDIRST                                                 01912000
CVTRSV66 EQU   CVTDIRST                                                 01913000
CVTRSV65 EQU   CVTDIRST                                                 01914000
CVTRSV64 EQU   CVTDIRST                                                 01915000
CVTRSV63 EQU   CVTDIRST                                                 01916000
CVTDICOM EQU   CVTDIRST                                                 01917000
CVTPVTP  EQU   CVTS01+8                                                 01918000
CVTLPDSR EQU   CVTS01+4                                                 01919000
CVTGETL  EQU   CVTS01                                                   01920000
PSARSAV  EQU   PSARSVTE+60                                              01921000
PSARSTK  EQU   PSARSVTE+56                                              01922000
PSAESAV3 EQU   PSARSVTE+52                                              01923000
PSAESTK3 EQU   PSARSVTE+48                                              01924000
PSAESAV2 EQU   PSARSVTE+44                                              01925000
PSAESTK2 EQU   PSARSVTE+40                                              01926000
PSAESAV1 EQU   PSARSVTE+36                                              01927000
PSAESTK1 EQU   PSARSVTE+32                                              01928000
PSAPSAV  EQU   PSARSVTE+28                                              01929000
PSAPSTK  EQU   PSARSVTE+24                                              01930000
PSAMSAV  EQU   PSARSVTE+20                                              01931000
PSAMSTK  EQU   PSARSVTE+16                                              01932000
PSASSAV  EQU   PSARSVTE+12                                              01933000
PSASSTK  EQU   PSARSVTE+8                                               01934000
PSANSTK  EQU   PSARSVTE+4                                               01935000
WORD1    EQU   DWORD0+4                                                 01936000
ZSAF19IO EQU   ISTZ19SV+12                                              01937000
ZSAF19RD EQU   ISTZ19SV+8                                               01938000
ZSAF19R1 EQU   ISTZ19SV+4                                               01939000
ZSAF19RV EQU   ISTZ19SV+1                                               01940000
ZSAFRSVS EQU   ZSAF19FG                                                 01941000
ZSAFLOCK EQU   ZSAF19FG                                                 01942000
ZSAFSV19 EQU   ISTZFSAV+40                                              01943000
ZSAFSVR2 EQU   ISTZFSAV+36                                              01944000
ZSAFSVVR EQU   ISTZFSAV+12                                              01945000
ZSAFSVRR EQU   ISTZFSAV+8                                               01946000
ZSAFSVFC EQU   ISTZFSAV+4                                               01947000
ZSAFSVBC EQU   ISTZFSAV                                                 01948000
@NM00199 EQU   ICNSYSUA+232                                             01949000
ICNSRB   EQU   ICNSYSUA+188                                             01950000
ICNIOSB  EQU   ICNDCDEB+64                                              01951000
ICNDEBAD EQU   ICNDIDEB+1                                               01952000
ICNDCBIF EQU   ICNDIDEB                                                 01953000
ICNUCBAD EQU   ICNDCDEB+32                                              01954000
ICNAPPAD EQU   ICNDCDEB+29                                              01955000
ICNEXSCL EQU   ICNDCDEB+28                                              01956000
ICNDCBAD EQU   ICNDCDEB+25                                              01957000
ICNDEBID EQU   ICNDCDEB+24                                              01958000
@NM00198 EQU   ICNDCDEB                                                 01959000
ICNERPWA EQU   ICNSYSUA+8                                               01960000
ICNCNTRL EQU   ICNSYSUA+4                                               01961000
ICNCKPAB EQU   ICNCKFLD+1                                               01962000
@NM00197 EQU   ICNCKFLD                                                 01963000
ICNCKBIT EQU   ICNCKFLD                                                 01964000
ICNLNKMD EQU   ICNDEVCA+100                                             01965000
ICNMSIZE EQU   ICNDEVCA+88                                              01966000
@NM00196 EQU   ICNFLAG2+3                                               01967000
@NM00195 EQU   ICNFLAG2+2                                               01968000
@NM00194 EQU   ICNFLAG2+1                                               01969000
@NM00193 EQU   @NM00192                                                 01970000
ICNLCLUS EQU   @NM00192                                                 01971000
ICNPATHO EQU   ICNDEVCA+76                                              01972000
ICNPATHI EQU   ICNDEVCA+72                                              01973000
ICNBUFNO EQU   ICNBUFFQ+4                                               01974000
ICNBUFQH EQU   ICNBUFFQ                                                 01975000
ICNPNDQT EQU   ICNPENDQ+4                                               01976000
ICNPNDQH EQU   ICNPENDQ                                                 01977000
ICNWBCCW EQU   ICNDEVCA+16                                              01978000
ICNLOCK  EQU   ICNDLCIA+20                                              01979000
ICNSIB   EQU   ICNDLCIA+16                                              01980000
@NM00191 EQU   ICNSTS+1                                                 01981000
@NM00190 EQU   @NM00189                                                 01982000
ICNPOSTF EQU   @NM00189                                                 01983000
ICNERROR EQU   @NM00189                                                 01984000
ICNBUSYF EQU   @NM00189                                                 01985000
ICNREADY EQU   @NM00189                                                 01986000
@NM00188 EQU   @NM00187                                                 01987000
ICNDTREJ EQU   @NM00187                                                 01988000
ICNDLCHK EQU   @NM00187                                                 01989000
ICNABORT EQU   @NM00186                                                 01990000
ICNIPLRQ EQU   @NM00186                                                 01991000
ICNSN02  EQU   ICNOVRUN                                                 01992000
ICNSN01  EQU   ICNDTCHK                                                 01993000
ICNEQCHK EQU   @NM00186                                                 01994000
ICNBOCHK EQU   @NM00186                                                 01995000
ICNINTRQ EQU   @NM00186                                                 01996000
ICNCMDRJ EQU   @NM00186                                                 01997000
ICNCAW   EQU   ICNDLCIA+8                                               01998000
ICNCSW   EQU   ICNDLCIA                                                 01999000
@NM00185 EQU   ISTICNCB+102                                             02000000
ICNPUNA  EQU   ISTICNCB+100                                             02001000
ICNUSECT EQU   ISTICNCB+96                                              02002000
ICNPCPAB EQU   ISTICNCB+64                                              02003000
ICNUFPAB EQU   ISTICNCB+48                                              02004000
ICNCB    EQU   ISTICNCB                                                 02005000
@NM00170 EQU   LDNSYSUA+232                                             02006000
LDNSRB   EQU   LDNSYSUA+188                                             02007000
LDNIOSB  EQU   LDNDCDEB+64                                              02008000
LDNDEBAD EQU   LDNDIDEB+1                                               02009000
LDNDCBIF EQU   LDNDIDEB                                                 02010000
LDNUCBAD EQU   LDNDCDEB+32                                              02011000
LDNAPPAD EQU   LDNDCDEB+29                                              02012000
LDNEXSCL EQU   LDNDCDEB+28                                              02013000
LDNDCBAD EQU   LDNDCDEB+25                                              02014000
LDNDEBID EQU   LDNDCDEB+24                                              02015000
@NM00169 EQU   LDNDCDEB                                                 02016000
LDNERPWA EQU   LDNSYSUA+8                                               02017000
LDNCNTRL EQU   LDNSYSUA+4                                               02018000
LDNTCCW  EQU   LDNSYSUA                                                 02019000
@NM00168 EQU   LDNFLAG2+3                                               02020000
@NM00167 EQU   LDNFLAG2+2                                               02021000
@NM00166 EQU   @NM00165                                                 02022000
LDNMSEL  EQU   @NM00165                                                 02023000
LDNISESS EQU   @NM00165                                                 02024000
LDNZATTP EQU   LDNRDREQ                                                 02025000
@NM00164 EQU   @NM00163                                                 02026000
LDNPURGE EQU   @NM00163                                                 02027000
LDNRESET EQU   @NM00163                                                 02028000
LDNZF006 EQU   LDNTMIND                                                 02029000
LDNLOSTS EQU   @NM00163                                                 02030000
LDNPLOCK EQU   @NM00163                                                 02031000
LDNLLOCK EQU   @NM00163                                                 02032000
LDNAPLNA EQU   LDNDEVCA+46                                              02033000
LDNRBLEN EQU   LDNDEVCA+40                                              02034000
LDNACREQ EQU   LDNDEVCA+32                                              02035000
LDNBUFRQ EQU   LDNBUFFQ+6                                               02036000
LDNBUFNO EQU   LDNBUFFQ+4                                               02037000
LDNBUFQH EQU   LDNBUFFQ                                                 02038000
LDNPNDQT EQU   LDNPENDQ+4                                               02039000
LDNPNDQH EQU   LDNPENDQ                                                 02040000
LDNTICCW EQU   LDNDEVCA+8                                               02041000
LDNSLCCW EQU   LDNDEVCA                                                 02042000
LDNLOCK  EQU   LDNDLCIA+20                                              02043000
LDNSIB   EQU   LDNDLCIA+16                                              02044000
@NM00162 EQU   LDNSTS+1                                                 02045000
@NM00161 EQU   @NM00160                                                 02046000
LDNPOSTF EQU   @NM00160                                                 02047000
LDNERROR EQU   @NM00160                                                 02048000
LDNBUSYF EQU   @NM00160                                                 02049000
LDNREADY EQU   @NM00160                                                 02050000
@NM00159 EQU   LDNSENSE+1                                               02051000
LDNOPCHK EQU   @NM00158                                                 02052000
LDNCTCHK EQU   @NM00158                                                 02053000
LDNUNSPY EQU   @NM00158                                                 02054000
LDNDTCHK EQU   @NM00158                                                 02055000
LDNEQCHK EQU   @NM00158                                                 02056000
LDNBOCHK EQU   @NM00158                                                 02057000
LDNINTRQ EQU   @NM00158                                                 02058000
LDNCMDRJ EQU   @NM00158                                                 02059000
LDNCSW   EQU   LDNDLCIA                                                 02060000
@NM00157 EQU   ISTLDNCB+102                                             02061000
LDNPUNA  EQU   ISTLDNCB+100                                             02062000
LDNUSECT EQU   ISTLDNCB+96                                              02063000
LDNPCPAB EQU   ISTLDNCB+64                                              02064000
LDNUFPAB EQU   ISTLDNCB+48                                              02065000
LDNCB    EQU   ISTLDNCB                                                 02066000
NCBRSV01 EQU   ISTNCB+46                                                02067000
NCBSWDAF EQU   ISTNCB+44                                                02068000
NCBDEVCH EQU   ISTNCB+36                                                02069000
NCBFMCBP EQU   ISTNCB+32                                                02070000
NCBLTRC  EQU   ISTNCB+30                                                02071000
@NM00156 EQU   ISTNCB+29                                                02072000
@NM00155 EQU   NCBEXFLG                                                 02073000
@NM00154 EQU   NCBEXFLG                                                 02074000
@NM00153 EQU   NCBEXFLG                                                 02075000
@NM00152 EQU   NCBEXFLG                                                 02076000
NCBEXSDA EQU   NCBEXFLG                                                 02077000
NCBEXSNO EQU   NCBEXFLG                                                 02078000
NCBEXAIL EQU   NCBEXFLG                                                 02079000
NCBEXAIC EQU   NCBEXFLG                                                 02080000
NCBNMLLN EQU   NCBFLAGS+3                                               02081000
@NM00151 EQU   NCBFLAG1                                                 02082000
NCBUEXIT EQU   NCBFLAG1                                                 02083000
NCBFORCE EQU   NCBFLAG1                                                 02084000
NCBTTF   EQU   NCBFLAG1                                                 02085000
NCBRSYNC EQU   NCBFLAG1                                                 02086000
NCBRSTRT EQU   NCBFLAG1                                                 02087000
NCBCONF  EQU   NCBFLAG1                                                 02088000
NCBSNAI  EQU   NCBFLAG1                                                 02089000
NCBFLTIO EQU   NCBFTRIO                                                 02090000
NCBCSTAT EQU   NCBFLAGS                                                 02091000
NCBNCSL  EQU   ISTNCB+22                                                02092000
NCBNCBA  EQU   ISTNCB+20                                                02093000
NCBFMCBA EQU   ISTNCB+16                                                02094000
NCBNSNA  EQU   ISTNCB+12                                                02095000
NCBTSKID EQU   ISTNCB+8                                                 02096000
NCBRDTE  EQU   ISTNCB+4                                                 02097000
NCBDAF   EQU   ISTNCB+2                                                 02098000
NCBLNGTH EQU   ISTNCB+1                                                 02099000
NCBTYPE  EQU   ISTNCB                                                   02100000
CCWCOUNT EQU   ISTCCW+6                                                 02101000
CCWSPRSV EQU   CCWSPARE                                                 02102000
CCWCFTX  EQU   CCWSPARE                                                 02103000
CCWTRCE  EQU   CCWSPARE                                                 02104000
CCWNULL  EQU   CCWFLAGS                                                 02105000
CCWPCI   EQU   CCWFLAGS                                                 02106000
CCWSKIP  EQU   CCWFLAGS                                                 02107000
CCWSLI   EQU   CCWFLAGS                                                 02108000
CCWCC    EQU   CCWFLAGS                                                 02109000
CCWCD    EQU   CCWFLAGS                                                 02110000
CCWADDR  EQU   CCWVADDR+1                                               02111000
CCWCODE  EQU   CCWVADDR                                                 02112000
DEVRSV01 EQU   ISTDEVCH+7                                               02113000
DEVAUXTP EQU   ISTDEVCH+6                                               02114000
DEVADVFE EQU   DEVMODE                                                  02115000
@NM00150 EQU   DEVMODE                                                  02116000
DEVBASIC EQU   DEVMODE                                                  02117000
DEVREC   EQU   DEVMODE                                                  02118000
DEVPHYSA EQU   ISTDEVCH+4                                               02119000
DEVCSLPN EQU   DEVCHAR3                                                 02120000
DEVCSTCL EQU   DEVCHAR3                                                 02121000
DEVCCHEK EQU   DEVCHAR3                                                 02122000
DEVCATTN EQU   DEVCHAR3                                                 02123000
DEVCSWL  EQU   DEVFCCTL                                                 02124000
DEVCRVB  EQU   DEVFCCTL                                                 02125000
DEVCSSL  EQU   DEVFCCTL                                                 02126000
DEVCBSC  EQU   DEVFCCTL                                                 02127000
DEVMCODE EQU   ISTDEVCH+2                                               02128000
DEVCHAR2 EQU   DEVTCODE                                                 02129000
DEVSPOLL EQU   DEVCHAR                                                  02130000
DEVCCTL  EQU   DEVCHAR                                                  02131000
DEVNNSPT EQU   DEVCHAR                                                  02132000
DEVSPS   EQU   DEVCHAR                                                  02133000
DEVSUBND EQU   DEVCHAR                                                  02134000
DEVCONVR EQU   DEVCHAR                                                  02135000
DEVOTPUT EQU   DEVCHAR                                                  02136000
DEVINPUT EQU   DEVCHAR                                                  02137000
ISTRETR7 EQU   ISTRETRG+4                                               02138000
ISTRETR6 EQU   ISTRETRG                                                 02139000
ISTRSV01 EQU   ISTAVT+42                                                02140000
ISTPDAVP EQU   ISTAVT+38                                                02141000
ISTVTTP  EQU   ISTAVT+36                                                02142000
ISTAGTWT EQU   ISTAVT+34                                                02143000
ISTATRT  EQU   ISTAVT+32                                                02144000
ISTARID  EQU   ISTAVT+30                                                02145000
ISTX1    EQU   ISTAVT+29                                                02146000
ISTPHNM  EQU   ISTAVT+24                                                02147000
ISTAPSEX EQU   ISTAVT+20                                                02148000
ISTVTTIK EQU   ISTAVT+18                                                02149000
AVTASID  EQU   ISTAVT+16                                                02150000
ISTAPSTA EQU   ISTAVT+12                                                02151000
ISTAS53  EQU   ISTAVT+8                                                 02152000
ISTAS49  EQU   ISTAVT+4                                                 02153000
ISTACVT  EQU   ISTAVT                                                   02154000
ATCAOS   EQU   ISTATCVT+1868                                            02155000
@NM00149 EQU   ISTATCVT+1860                                            02156000
@NM00148 EQU   ISTATCVT+1852                                            02157000
@NM00147 EQU   ISTATCVT+1844                                            02158000
@NM00146 EQU   ISTATCVT+1836                                            02159000
@NM00145 EQU   ISTATCVT+1828                                            02160000
@NM00144 EQU   ISTATCVT+1820                                            02161000
@NM00143 EQU   ISTATCVT+1816                                            02162000
ATCCACSA EQU   ISTATCVT+1812                                            02163000
ATCMXCSA EQU   ISTATCVT+1808                                            02164000
ATCTPMPB EQU   ISTATCVT+1776                                            02165000
ATCTRMPB EQU   ISTATCVT+1744                                            02166000
ATCRPLAC EQU   ATCRPLCN+2                                               02167000
ATCRPLRC EQU   ATCRPLCN                                                 02168000
ATCCRPLQ EQU   ATCCRPL                                                  02169000
ATCSRBAC EQU   ATCSRBCN+2                                               02170000
ATCSRBRC EQU   ATCSRBCN                                                 02171000
ATCSRBQ  EQU   ATCSRB                                                   02172000
ATCCRAAC EQU   ATCCRACN+2                                               02173000
ATCCRARC EQU   ATCCRACN                                                 02174000
ATCCRAQ  EQU   ATCCRA                                                   02175000
ATCLUFFD EQU   ISTATCVT+1716                                            02176000
ATCVIOPM EQU   ISTATCVT+1712                                            02177000
ATCTPMMI EQU   ISTATCVT+1708                                            02178000
ATCPXSRB EQU   ISTATCVT+1704                                            02179000
ATCRPLCT EQU   ISTATCVT+1702                                            02180000
ATCCRACT EQU   ISTATCVT+1700                                            02181000
ATCSRBCT EQU   ISTATCVT+1698                                            02182000
ATCSTNSM EQU   ISTATCVT+1697                                            02183000
@NM00142 EQU   ATCZFLAG                                                 02184000
ATCZF001 EQU   ATCZFLAG                                                 02185000
ATCTPCP1 EQU   ISTATCVT+1692                                            02186000
ATCTPCP0 EQU   ISTATCVT+1688                                            02187000
ATCZR01  EQU   ISTATCVT+1684                                            02188000
ATCMPLTA EQU   ISTATCVT+1680                                            02189000
ATCASCB  EQU   ISTATCVT+1676                                            02190000
ATCAP86  EQU   ISTATCVT+1672                                            02191000
ATCAP85  EQU   ISTATCVT+1668                                            02192000
ATCAP84  EQU   ISTATCVT+1664                                            02193000
ATCAP83  EQU   ISTATCVT+1660                                            02194000
ATCAP82  EQU   ISTATCVT+1656                                            02195000
ATCAP66  EQU   ISTATCVT+1648                                            02196000
ATCAP62  EQU   ISTATCVT+1644                                            02197000
ATCAPC59 EQU   ISTATCVT+1640                                            02198000
ATCAP56  EQU   ISTATCVT+1636                                            02199000
ATCAP55  EQU   ISTATCVT+1632                                            02200000
ATCAP41  EQU   ISTATCVT+1628                                            02201000
ATCAPC25 EQU   ISTATCVT+1624                                            02202000
ATCAP23  EQU   ISTATCVT+1620                                            02203000
ATCAPBE  EQU   ISTATCVT+1616                                            02204000
ATCPSTA  EQU   ISTATCVT+1612                                            02205000
ATCSMABF EQU   ISTATCVT+1608                                            02206000
ATCSMAPR EQU   ISTATCVT+1604                                            02207000
ATCTPWQA EQU   ISTATCVT+1600                                            02208000
ATCSMAID EQU   ISTATCVT+1596                                            02209000
ATCSMARA EQU   ISTATCVT+1592                                            02210000
ATCCACXA EQU   ISTATCVT+1588                                            02211000
ATCATA10 EQU   ISTATCVT+1584                                            02212000
ATCHLTCB EQU   ISTATCVT+1580                                            02213000
@NM00141 EQU   ATCVTFLG                                                 02214000
ATCVTACT EQU   ATCVTFLG                                                 02215000
@NM00140 EQU   @NM00139                                                 02216000
ATCVTMAB EQU   @NM00139                                                 02217000
ATCVTBAM EQU   ISTATCVT+1572                                            02218000
@NM00138 EQU   ISTATCVT+1568                                            02219000
@NM00137 EQU   ISTATCVT+1520                                            02220000
ATCCCOOC EQU   ISTATCVT+1516                                            02221000
@NM00136 EQU   ISTATCVT+1513                                            02222000
ATCSNUF  EQU   ATCENFLG                                                 02223000
ATCOPKL  EQU   ATCENFLG                                                 02224000
ATCABEN  EQU   ATCENFLG                                                 02225000
ATCSRDN  EQU   ATCENFLG                                                 02226000
ATCDLDN  EQU   ATCENFLG                                                 02227000
ATCTIMER EQU   ISTATCVT+1508                                            02228000
ATCAIWT  EQU   ISTATCVT+1504                                            02229000
ATCOROBT EQU   ISTATCVT+1500                                            02230000
ATCDMAPP EQU   ISTATCVT+1496                                            02231000
ATCZDVTX EQU   ISTATCVT+1492                                            02232000
ATCPXCRA EQU   ISTATCVT+1488                                            02233000
ATCICNCB EQU   ISTATCVT+1484                                            02234000
ATCCMTCB EQU   ISTATCVT+1480                                            02235000
ATCPRPH  EQU   ISTATCVT+1476                                            02236000
ATCGSRBF EQU   ATCGSRBG                                                 02237000
ATCSRBRT EQU   ISTATCVT+1468                                            02238000
ATCTSCPC EQU   ISTATCVT+1464                                            02239000
@NM00135 EQU   ISTATCVT+1460                                            02240000
ATCCDTCB EQU   ISTATCVT+1456                                            02241000
ATCORFRL EQU   ISTATCVT+1452                                            02242000
ATCORFPX EQU   ISTATCVT+1448                                            02243000
ATCORFMG EQU   ISTATCVT+1444                                            02244000
ATCSMBQ  EQU   ISTATCVT+1440                                            02245000
ATCINFDD EQU   ISTATCVT+1436                                            02246000
ATCAP67  EQU   ISTATCVT+1432                                            02247000
ATCAP65  EQU   ISTATCVT+1428                                            02248000
ATCAP64  EQU   ISTATCVT+1424                                            02249000
ATCAP63  EQU   ISTATCVT+1420                                            02250000
ATCAP61  EQU   ISTATCVT+1416                                            02251000
ATCAP58  EQU   ISTATCVT+1412                                            02252000
ATCAP57  EQU   ISTATCVT+1408                                            02253000
ATCAP54  EQU   ISTATCVT+1404                                            02254000
ATCAP53  EQU   ISTATCVT+1400                                            02255000
ATCAP52  EQU   ISTATCVT+1396                                            02256000
ATCAP51  EQU   ISTATCVT+1392                                            02257000
ATCAP38  EQU   ISTATCVT+1388                                            02258000
ATCAP37  EQU   ISTATCVT+1384                                            02259000
ATCAP34  EQU   ISTATCVT+1380                                            02260000
ATCAP32  EQU   ISTATCVT+1376                                            02261000
ATCAP31  EQU   ISTATCVT+1372                                            02262000
ATCAP12  EQU   ISTATCVT+1368                                            02263000
ATCAP11  EQU   ISTATCVT+1364                                            02264000
ATCDAPDG EQU   ATCDAPVT+20                                              02265000
ATCDXCEA EQU   ATCDAPVT+16                                              02266000
ATCDCEA  EQU   ATCDAPVT+12                                              02267000
ATCDPCIA EQU   ATCDAPVT+8                                               02268000
ATCDSIOA EQU   ATCDAPVT+4                                               02269000
ATCDEOEA EQU   ATCDAPVT                                                 02270000
ATCZAEA  EQU   ATCICAPP+16                                              02271000
ATCZCEA  EQU   ATCICAPP+12                                              02272000
ATCZCPCI EQU   ATCICAPP+8                                               02273000
ATCZSIOA EQU   ATCICAPP+4                                               02274000
ATCCDRPH EQU   ATCICAPP                                                 02275000
ATCORQG  EQU   ATCORSRB                                                 02276000
ATCORTBF EQU   ATCSQAFR                                                 02277000
@NM00134 EQU   ISTATCVT+1308                                            02278000
ATCZLAEA EQU   ATCLDAPP+16                                              02279000
ATCZLCEA EQU   ATCLDAPP+12                                              02280000
ATCZLPCI EQU   ATCLDAPP+8                                               02281000
ATCSMFRR EQU   ATCLDAPP+4                                               02282000
ATCCDTID EQU   ATCLDAPP                                                 02283000
@NM00133 EQU   ISTATCVT+1256                                            02284000
ATCZPAB2 EQU   ISTATCVT+1224                                            02285000
@NM00132 EQU   ISTATCVT+1224                                            02286000
@NM00131 EQU   ISTATCVT+1164                                            02287000
ATCCPCFE EQU   ISTATCVT+1160                                            02288000
@NM00130 EQU   ATCRID+2                                                 02289000
ATCCDRMA EQU   ATCRID                                                   02290000
@NM00129 EQU   ATCSMSDQ+8                                               02291000
@NM00128 EQU   ATCSMSDQ+4                                               02292000
@NM00127 EQU   ATCSMSDQ                                                 02293000
ATCSEQNO EQU   ISTATCVT+1136                                            02294000
ATCSMPMD EQU   ISTATCVT+1132                                            02295000
ATCPAREA EQU   ISTATCVT+1128                                            02296000
ATCCPCSM EQU   ISTATCVT+1124                                            02297000
ATCQLOCK EQU   ISTATCVT+1120                                            02298000
ATCITQLE EQU   ISTATCVT+1116                                            02299000
ATCSQCDS EQU   ISTATCVT+1112                                            02300000
ATCUSSVT EQU   ISTATCVT+1108                                            02301000
ATCNOSQ  EQU   ISTATCVT+1104                                            02302000
ATCINCIP EQU   ATCCPDVT+4                                               02303000
ATCTSCNI EQU   ATCCPDVT                                                 02304000
ATCMGCRT EQU   ISTATCVT+1092                                            02305000
ATCMACRT EQU   ISTATCVT+1088                                            02306000
ATCCSMT  EQU   ISTATCVT+1084                                            02307000
ATCDRUSL EQU   ISTATCVT+1080                                            02308000
ATCDRULL EQU   ISTATCVT+1076                                            02309000
ATCCFCDR EQU   ISTATCVT+1072                                            02310000
@NM00126 EQU   ISTATCVT+1069                                            02311000
ATCMROUT EQU   ISTATCVT+1060                                            02312000
ATCONFIG EQU   ISTATCVT+1052                                            02313000
ATCNODEL EQU   ISTATCVT+1044                                            02314000
@NM00125 EQU   @NM00124+9                                               02315000
ATCLAST  EQU   ATCSHRFG                                                 02316000
ATCSHRTN EQU   @NM00124                                                 02317000
@NM00123 EQU   ISTATCVT+1026                                            02318000
ATCNMCTR EQU   ISTATCVT+1024                                            02319000
ATCPOIA  EQU   ATCRNO+1                                                 02320000
@NM00122 EQU   ATCRNO                                                   02321000
ATCLCLCT EQU   ATCVLCNT+2                                               02322000
ATCRNCNT EQU   ATCVLCNT                                                 02323000
ATCHBSIZ EQU   ATCHPGM+2                                                02324000
ATCHBFNO EQU   ATCHPGM                                                  02325000
@NM00121 EQU   ISTATCVT+1011                                            02326000
ATCXRANG EQU   ISTATCVT+1010                                            02327000
ATCMAXID EQU   ISTATCVT+1009                                            02328000
ATCMSGSP EQU   ISTATCVT+1008                                            02329000
ATCCIDM  EQU   ISTATCVT+1006                                            02330000
ATCACTRM EQU   ISTATCVT+1004                                            02331000
ATCECTLP EQU   ISTATCVT+1000                                            02332000
ATCECNET EQU   ISTATCVT+996                                             02333000
ATCECOPC EQU   ISTATCVT+992                                             02334000
ATCECSES EQU   ISTATCVT+988                                             02335000
ATCECDSP EQU   ISTATCVT+984                                             02336000
ATCECVRY EQU   ISTATCVT+980                                             02337000
ATCECHLT EQU   ISTATCVT+976                                             02338000
ATCECMOD EQU   ISTATCVT+972                                             02339000
ATCVDLOK EQU   ISTATCVT+968                                             02340000
ATCRDTLK EQU   ISTATCVT+964                                             02341000
ATCVOCLK EQU   ISTATCVT+960                                             02342000
ATCITLIM EQU   ISTATCVT+958                                             02343000
ATCTMINV EQU   ISTATCVT+956                                             02344000
ATCHOSTA EQU   ISTATCVT+954                                             02345000
ATCPUNSA EQU   ISTATCVT+952                                             02346000
ATCSAF   EQU   ISTATCVT+950                                             02347000
ATCVTMID EQU   ATCSSCPA                                                 02348000
ATCHCNID EQU   ATCONID+2                                                02349000
ATCSCNID EQU   ATCONID                                                  02350000
@NM00120 EQU   ATCBITAN+3                                               02351000
@NM00119 EQU   ATCBITAN+2                                               02352000
@NM00118 EQU   ATCFLAG2                                                 02353000
@NM00117 EQU   ATCFLAG2                                                 02354000
@NM00116 EQU   ATCFLAG2                                                 02355000
ATCCRYPF EQU   ATCFLAG2                                                 02356000
ATCTUNCL EQU   ATCFLAG2                                                 02357000
ATCTUNRQ EQU   ATCFLAG2                                                 02358000
ATCTUNAC EQU   ATCFLAG2                                                 02359000
ATCCDLRA EQU   ATCFLAG2                                                 02360000
@NM00115 EQU   ATCBITAN                                                 02361000
@NM00114 EQU   ATCSTAT4                                                 02362000
@NM00113 EQU   ATCSTAT4                                                 02363000
@NM00112 EQU   ATCSTAT4                                                 02364000
@NM00111 EQU   ATCSTAT4                                                 02365000
@NM00110 EQU   ATCSTAT4                                                 02366000
ATCPRTAT EQU   ATCSTAT4                                                 02367000
ATCNCSD  EQU   ATCSTAT4                                                 02368000
ATCMTST  EQU   ATCSTAT4                                                 02369000
@NM00109 EQU   ATCPOFLG                                                 02370000
@NM00108 EQU   ATCPOFLG                                                 02371000
@NM00107 EQU   ATCPOFLG                                                 02372000
@NM00106 EQU   ATCPOFLG                                                 02373000
@NM00105 EQU   ATCPOFLG                                                 02374000
@NM00104 EQU   ATCPOFLG                                                 02375000
@NM00103 EQU   ATCPOFLG                                                 02376000
ATCPOUNS EQU   ATCPOFLG                                                 02377000
@NM00102 EQU   ATCSTAT+1                                                02378000
ATCHIP   EQU   ATCSTAT1                                                 02379000
ATCMDHLT EQU   ATCSTAT1                                                 02380000
ATCINHLT EQU   ATCSTAT1                                                 02381000
ATCNETSL EQU   ATCSTAT1                                                 02382000
ATCQKHLT EQU   ATCSTAT1                                                 02383000
ATCSNHLT EQU   ATCSTAT1                                                 02384000
ATCACTIV EQU   ATCSTAT1                                                 02385000
ATCSTART EQU   ATCSTAT1                                                 02386000
ATCNOP00 EQU   ISTATCVT+932                                             02387000
ATCTSBUF EQU   ISTATCVT+928                                             02388000
ATCFEPT  EQU   ISTATCVT+924                                             02389000
ATCFDVT  EQU   ISTATCVT+920                                             02390000
ATCCONFT EQU   ISTATCVT+916                                             02391000
ATCRDTH  EQU   ISTATCVT+912                                             02392000
ATCSIBQ  EQU   ISTATCVT+908                                             02393000
ATCHLTMS EQU   ISTATCVT+904                                             02394000
ATCECPRM EQU   ISTATCVT+900                                             02395000
ATCVPARM EQU   ISTATCVT+896                                             02396000
ATCOCHA  EQU   ISTATCVT+892                                             02397000
ATCDSPLQ EQU   ISTATCVT+888                                             02398000
ATCVARYQ EQU   ISTATCVT+884                                             02399000
ATCHALTQ EQU   ISTATCVT+880                                             02400000
ATCMODQ  EQU   ISTATCVT+876                                             02401000
ATCSRT   EQU   ISTATCVT+872                                             02402000
ATCRDT   EQU   ISTATCVT+868                                             02403000
ATCSDVT  EQU   ISTATCVT+864                                             02404000
ATCDLRPT EQU   ISTATCVT+860                                             02405000
ATCBPDA  EQU   ISTATCVT+856                                             02406000
ATCACDA  EQU   ISTATCVT+852                                             02407000
ATCMNT   EQU   ISTATCVT+848                                             02408000
ATCUEP   EQU   ISTATCVT+844                                             02409000
ATCNODDS EQU   ISTATCVT+840                                             02410000
ATCITRT  EQU   ISTATCVT+836                                             02411000
ATCTODVT EQU   ISTATCVT+832                                             02412000
ATCTRCPT EQU   ISTATCVT+828                                             02413000
ATCMODTB EQU   ISTATCVT+824                                             02414000
ATCUSSPT EQU   ISTATCVT+820                                             02415000
ATCTUBUF EQU   ISTATCVT+816                                             02416000
ATCTACB  EQU   ISTATCVT+812                                             02417000
ATCDWA   EQU   ISTATCVT+808                                             02418000
ATCCFCR2 EQU   ATCPODVT                                                 02419000
ATCEPA   EQU   ISTATCVT+800                                             02420000
ATCPULQB EQU   @NM00101+16                                              02421000
ATCMCQAB EQU   @NM00101+12                                              02422000
ATCLUSMQ EQU   @NM00101+8                                               02423000
ATCLUIOQ EQU   @NM00101+4                                               02424000
ATCIOLQB EQU   @NM00101                                                 02425000
ATCTSCAP EQU   ATCANYDT                                                 02426000
ATCTSCCO EQU   ATCLUDVT+4                                               02427000
ATCTSCSR EQU   ATCLUDVT                                                 02428000
ATCVTLOD EQU   ISTATCVT+764                                             02429000
ATCTSCLF EQU   ISTATCVT+760                                             02430000
ATCTSCLE EQU   ISTATCVT+756                                             02431000
ATCTSCLB EQU   ISTATCVT+752                                             02432000
ATCTSCLS EQU   ISTATCVT+748                                             02433000
ATCTSCCF EQU   ISTATCVT+744                                             02434000
ATCTSCFV EQU   ISTATCVT+740                                             02435000
ATCTSCCE EQU   ISTATCVT+736                                             02436000
ATCTSCCB EQU   ISTATCVT+732                                             02437000
ATCTSCWS EQU   ISTATCVT+728                                             02438000
ATCTSCEM EQU   ISTATCVT+724                                             02439000
ATCTSCNS EQU   ISTATCVT+720                                             02440000
ATCTSCER EQU   ISTATCVT+716                                             02441000
ATCTSCPR EQU   ISTATCVT+712                                             02442000
ATCTSCGR EQU   ISTATCVT+708                                             02443000
ATCTSCCI EQU   ISTATCVT+704                                             02444000
ATCTSVT  EQU   ISTATCVT+700                                             02445000
ATCDVLOD EQU   ISTATCVT+696                                             02446000
ATCCDCNR EQU   ISTATCVT+692                                             02447000
ATCCDCNF EQU   ISTATCVT+688                                             02448000
ATCCDCND EQU   ISTATCVT+684                                             02449000
ATCCDCNA EQU   ISTATCVT+680                                             02450000
ATCCDCCP EQU   ISTATCVT+676                                             02451000
ATCCDFDN EQU   ISTATCVT+672                                             02452000
ATCCDFIN EQU   ISTATCVT+668                                             02453000
ATCCDFND EQU   ISTATCVT+664                                             02454000
ATCCDDEL EQU   ISTATCVT+660                                             02455000
ATCCDADD EQU   ISTATCVT+656                                             02456000
ATCTCLIM EQU   ISTATCVT+652                                             02457000
ATCRACTR EQU   ISTATCVT+648                                             02458000
ATCRACTI EQU   ISTATCVT+644                                             02459000
ATCREMOV EQU   ISTATCVT+640                                             02460000
ATCRACIO EQU   ISTATCVT+636                                             02461000
ATCADD   EQU   ISTATCVT+632                                             02462000
ATCPUCRT EQU   ISTATCVT+628                                             02463000
ATCSMRS  EQU   ISTATCVT+624                                             02464000
ATCSMRQ  EQU   ISTATCVT+620                                             02465000
ATCORCPX EQU   ISTATCVT+616                                             02466000
ATCORCAF EQU   ISTATCVT+612                                             02467000
ATCFRSTR EQU   ATCGTSTR                                                 02468000
ATCSTMA  EQU   ISTATCVT+604                                             02469000
ATCSRTAD EQU   ISTATCVT+600                                             02470000
ATCOCRT  EQU   ISTATCVT+596                                             02471000
ATCOCCFS EQU   ISTATCVT+592                                             02472000
ATCOCCFP EQU   ISTATCVT+588                                             02473000
ATCSRTDF EQU   ISTATCVT+584                                             02474000
ATCLUCRT EQU   ISTATCVT+580                                             02475000
ATCINCY5 EQU   ISTATCVT+576                                             02476000
ATCINCW3 EQU   ISTATCVT+572                                             02477000
ATCINCU6 EQU   ISTATCVT+568                                             02478000
ATCINCTQ EQU   ISTATCVT+564                                             02479000
ATCINCS1 EQU   ISTATCVT+560                                             02480000
ATCSRTAB EQU   ISTATCVT+556                                             02481000
ATCINCRD EQU   ISTATCVT+552                                             02482000
ATCINCPH EQU   ISTATCVT+548                                             02483000
ATCINCLQ EQU   ISTATCVT+544                                             02484000
ATCNOCRT EQU   ISTATCVT+540                                             02485000
ATCINCF1 EQU   ISTATCVT+536                                             02486000
ATCINCCI EQU   ISTATCVT+532                                             02487000
ATCINCCO EQU   ISTATCVT+528                                             02488000
ATCBLDLA EQU   ISTATCVT+524                                             02489000
ATCALOAD EQU   ISTATCVT+520                                             02490000
ATCADEL  EQU   ISTATCVT+516                                             02491000
ATCESC02 EQU   ISTATCVT+512                                             02492000
ATCESC01 EQU   ISTATCVT+508                                             02493000
ATCDEC01 EQU   ISTATCVT+504                                             02494000
ATCDEC00 EQU   ISTATCVT+500                                             02495000
ATCCPCRT EQU   ISTATCVT+496                                             02496000
ATCMSGM  EQU   ISTATCVT+492                                             02497000
ATCCPCFR EQU   ISTATCVT+488                                             02498000
ATCCPCGR EQU   ISTATCVT+484                                             02499000
ATCCPCPP EQU   ISTATCVT+480                                             02500000
ATCMSGP  EQU   ISTATCVT+476                                             02501000
ATCCPCNT EQU   ISTATCVT+472                                             02502000
ATCAUTHA EQU   ISTATCVT+468                                             02503000
ATCACCTA EQU   ISTATCVT+464                                             02504000
ATCAP39  EQU   ISTATCVT+460                                             02505000
ATCAP36  EQU   ISTATCVT+456                                             02506000
ATCAP35  EQU   ISTATCVT+452                                             02507000
ATCAP33  EQU   ISTATCVT+448                                             02508000
ATCAPCR5 EQU   ISTATCVT+444                                             02509000
ATCAICPT EQU   ISTATCVT+440                                             02510000
ATCAPI   EQU   ISTATCVT+436                                             02511000
ATCAICTN EQU   ISTATCVT+432                                             02512000
ATCACC01 EQU   ISTATCVT+428                                             02513000
ATCACC00 EQU   ISTATCVT+424                                             02514000
ATCLDECB EQU   ATCLDTIL+12                                              02515000
ATCLDLCK EQU   ATCLDTIL+8                                               02516000
ATCLDLST EQU   ATCLDTIL+4                                               02517000
ATCLDNCS EQU   ATCLDTIL                                                 02518000
ATCNOSPB EQU   ISTATCVT+376                                             02519000
ATCNSPAB EQU   ISTATCVT+344                                             02520000
ATCLUSRT EQU   ISTATCVT+312                                             02521000
ATCPUIOP EQU   ISTATCVT+280                                             02522000
ATCPUPAB EQU   ISTATCVT+248                                             02523000
ATCPXPAB EQU   ISTATCVT+216                                             02524000
ATCPOPAB EQU   ISTATCVT+184                                             02525000
@NM00100 EQU   ATCVDPAB+16                                              02526000
ATCFEPAB EQU   ATCVDPAB                                                 02527000
ATCTCIPB EQU   ISTATCVT+120                                             02528000
ATCCSPAB EQU   ATCSMPAB+16                                              02529000
@NM00099 EQU   ATCSMPAB                                                 02530000
ATCTMRPB EQU   ISTATCVT+56                                              02531000
ATCITPAB EQU   ISTATCVT+24                                              02532000
@NM00098 EQU   ATCITRA1                                                 02533000
ATCITSCP EQU   ATCITRA1                                                 02534000
ATCITMSG EQU   ATCITRA1                                                 02535000
ATCITPIU EQU   ATCITRA1                                                 02536000
ATCITSMS EQU   ATCITRA1                                                 02537000
ATCITPSS EQU   ATCITRA1                                                 02538000
ATCITLCK EQU   ATCITRA1                                                 02539000
ATCITAPI EQU   ATCITRA1                                                 02540000
ATCITCNT EQU   ATCITFLG                                                 02541000
ATCITRPH EQU   ATCITCDS                                                 02542000
ATCITTBL EQU   ATCITFLD+4                                               02543000
ATCITPRM EQU   ATCITFLD                                                 02544000
ATCPTCHA EQU   ATCRPTCH+4                                               02545000
ATCVTLVL EQU   ATCRPTCH                                                 02546000
RPHUPSTA EQU   ISTRPH+104                                               02547000
RPHSAV16 EQU   RPHWORK+60                                               02548000
RPHSAV15 EQU   RPHWORK+56                                               02549000
RPHSAV14 EQU   RPHWORK+52                                               02550000
RPHSAV13 EQU   RPHWORK+48                                               02551000
RPHSAV12 EQU   RPHWORK+44                                               02552000
RPHSAV11 EQU   RPHWORK+40                                               02553000
RPHSAV10 EQU   RPHWORK+36                                               02554000
RPHSAVE9 EQU   RPHWORK+32                                               02555000
RPHSAVE8 EQU   RPHWORK+28                                               02556000
RPHSAVE7 EQU   RPHWORK+24                                               02557000
RPHSAVE6 EQU   RPHWORK+20                                               02558000
RPHSAVE5 EQU   RPHWORK+16                                               02559000
RPHSAVE4 EQU   RPHWORK+12                                               02560000
RPHSAVE3 EQU   RPHWORK+8                                                02561000
RPHSAVE2 EQU   RPHWORK+4                                                02562000
RPHSHALF EQU   RPHSAVE1+2                                               02563000
RPHSBIT8 EQU   RPHSBITS                                                 02564000
RPHSBIT7 EQU   RPHSBITS                                                 02565000
RPHSBIT6 EQU   RPHSBITS                                                 02566000
RPHSBIT5 EQU   RPHSBITS                                                 02567000
RPHSBIT4 EQU   RPHSBITS                                                 02568000
RPHSBIT3 EQU   RPHSBITS                                                 02569000
RPHSBIT2 EQU   RPHSBITS                                                 02570000
RPHSBIT1 EQU   RPHSBITS                                                 02571000
RPHSBYTE EQU   RPHSAVE1                                                 02572000
RPHPABQP EQU   RPHPABQA+1                                               02573000
RPHPABFG EQU   RPHPABQA                                                 02574000
RPHCRR   EQU   ISTRPH+32                                                02575000
RPHSRP34 EQU   RPHSRPRM+2                                               02576000
RPHSRP12 EQU   RPHSRPRM                                                 02577000
RPHWEGT  EQU   RPHCSPA                                                  02578000
RPHMAJCB EQU   ISTRPH+21                                                02579000
RPHPABOF EQU   ISTRPH+20                                                02580000
RPHRESUM EQU   RPHRESMA+1                                               02581000
@NM00097 EQU   RPHWPFLG                                                 02582000
RPHPURGE EQU   RPHWPFLG                                                 02583000
RPHPT    EQU   RPHWPFLG                                                 02584000
RPHWT    EQU   RPHWPFLG                                                 02585000
RPHRSKEY EQU   RPHWPFLG                                                 02586000
RPHDVTA  EQU   ISTRPH+12                                                02587000
RPHTIK   EQU   RPHTSKID+3                                               02588000
@NM00096 EQU   RPHTSKID                                                 02589000
RPHRPHAP EQU   RPHRPHA+1                                                02590000
@NM00095 EQU   RPHRPHA                                                  02591000
RPHGATE  EQU   RPHRPHA                                                  02592000
RPHABEND EQU   RPHFLGB                                                  02593000
RPHUWAIT EQU   RPHFLGB                                                  02594000
RPHRLCRA EQU   RPHFLGB                                                  02595000
@NM00094 EQU   RPHFLGB                                                  02596000
RPHPGCMP EQU   RPHFLGB                                                  02597000
RPHFBAPS EQU   RPHFLGB                                                  02598000
RPHBSSP  EQU   RPHFLGB                                                  02599000
RPHLOCK  EQU   RPHFLGB                                                  02600000
RPHFNFLG EQU   RPHFSTLC                                                 02601000
RPHMLTCP EQU   RPHFLAGS                                                 02602000
RPHSMCLR EQU   RPHFLAGS                                                 02603000
RPHSMTYP EQU   RPHFLAGS                                                 02604000
RPHSMQ   EQU   RPHFLAGS                                                 02605000
RPHAPTYP EQU   RPHFLAGS                                                 02606000
RPHSPGIN EQU   RPHFLAGS                                                 02607000
RPHOGIND EQU   RPHFLAGS                                                 02608000
RPHLNGTH EQU   RPHCNTL+1                                                02609000
RPHTYPE  EQU   RPHCNTL                                                  02610000
DYPPAB   EQU   ISTDYPAB+16                                              02611000
DYPOCRPH EQU   DYPPACMD                                                 02612000
DYPTSKID EQU   ISTDYPAB+8                                               02613000
DYPPACTB EQU   DYPCHAIN                                                 02614000
DYPFLGS  EQU   ISTDYPAB+2                                               02615000
DYPLNGTH EQU   ISTDYPAB+1                                               02616000
DYPTYPE  EQU   ISTDYPAB                                                 02617000
PABRPHA  EQU   PABRPHFG+1                                               02618000
PABNODQ  EQU   PABFLAGS                                                 02619000
PABINHBT EQU   PABFLAGS                                                 02620000
PABERLOK EQU   PABERRLK                                                 02621000
PABSSN   EQU   PABFLAGS                                                 02622000
PABDYNAM EQU   PABFLAGS                                                 02623000
PABXTND  EQU   PABFLAGS                                                 02624000
PABPRIOR EQU   PABFLAGS                                                 02625000
PABAPYP  EQU   PABFLAGS                                                 02626000
PABDVTA  EQU   ISTPAB+9                                                 02627000
PABOFFST EQU   ISTPAB+8                                                 02628000
PABCHNGP EQU   PABCHAIN+1                                               02629000
PABRSV02 EQU   PABCHAIN                                                 02630000
PABDELAY EQU   PABCHAIN                                                 02631000
PABQUED  EQU   PABRUNNG                                                 02632000
PABRESET EQU   PABCHAIN                                                 02633000
PABUNCON EQU   PABCHAIN                                                 02634000
PABCDP   EQU   PABCHAIN                                                 02635000
PABRESCH EQU   PABCHAIN                                                 02636000
PABCHNG  EQU   PABCHAIN                                                 02637000
PABWEQP  EQU   PABWEQA+1                                                02638000
PABRSV01 EQU   PABWEQA                                                  02639000
PABWEQG  EQU   PABWEQA                                                  02640000
LOKXCL   EQU   @NM00091                                                 02641000
LOKPRY   EQU   @NM00091                                                 02642000
@NM00092 EQU   @NM00091                                                 02643000
@NM00090 EQU   LOKCHNG                                                  02644000
LOKCT    EQU   ISTLOK                                                   02645000
IOSEND   EQU   IOSB+108                                                 02646000
IOSSKR   EQU   IOSEEKA+7                                                02647000
IOSSKH2  EQU   IOSSKHH+1                                                02648000
IOSSKH1  EQU   IOSSKHH                                                  02649000
IOSSKCC  EQU   IOSCCHH                                                  02650000
IOSSKBB  EQU   IOSEEKA+1                                                02651000
IOSSKM   EQU   IOSEEKA                                                  02652000
IOSEEK   EQU   IOSB+92                                                  02653000
IOSMDM   EQU   IOSB+91                                                  02654000
IOSMDB   EQU   IOSB+90                                                  02655000
IOSCKEY7 EQU   IOSCKEY                                                  02656000
IOSCKEY6 EQU   IOSCKEY                                                  02657000
IOSCKEY5 EQU   IOSCKEY                                                  02658000
IOSCKEY4 EQU   IOSCKEY                                                  02659000
@NM00086 EQU   IOSCKEY                                                  02660000
IOSFMSK  EQU   IOSB+88                                                  02661000
IOSCUDEV EQU   IOSPATH+1                                                02662000
@NM00085 EQU   IOSCHN                                                   02663000
IOSPATH3 EQU   IOSCHN                                                   02664000
IOSPATH2 EQU   IOSCHN                                                   02665000
IOSEXP   EQU   IOSCHN                                                   02666000
IOSGDP   EQU   IOSCHN                                                   02667000
IOSAFF   EQU   IOSB+85                                                  02668000
IOSRSS1B EQU   IOSB+84                                                  02669000
IOSDSID  EQU   IOSB+80                                                  02670000
IOSVST   EQU   IOSB+76                                                  02671000
IOSRST   EQU   IOSB+72                                                  02672000
IOSDIE   EQU   IOSB+68                                                  02673000
IOSABN   EQU   IOSB+64                                                  02674000
IOSNRM   EQU   IOSB+60                                                  02675000
IOSPCI   EQU   IOSB+56                                                  02676000
IOSERP   EQU   IOSB+52                                                  02677000
IOSPCHN  EQU   IOSB+48                                                  02678000
IOSSNS   EQU   IOSB+42                                                  02679000
IOSAPMSK EQU   IOSB+40                                                  02680000
IOSRES4A EQU   IOSB+36                                                  02681000
IOSUSE   EQU   IOSB+32                                                  02682000
IOSSRB   EQU   IOSB+28                                                  02683000
IOSCSWRC EQU   IOSCSW+5                                                 02684000
IOSTSB   EQU   IOSTATUS+1                                               02685000
IOSTSA   EQU   IOSTATUS                                                 02686000
IOSCSWCA EQU   IOSCSW                                                   02687000
IOSCC    EQU   @NM00084                                                 02688000
IOSUCB   EQU   IOSB+16                                                  02689000
IOSOPT2X EQU   IOSOPT2                                                  02690000
IOSHTP   EQU   IOSOPT2                                                  02691000
IOSRELSE EQU   IOSOPT                                                   02692000
IOSAPR   EQU   IOSOPT                                                   02693000
IOSTSLL  EQU   IOSOPT                                                   02694000
IOSNERP  EQU   IOSOPT                                                   02695000
IOSPSLL  EQU   IOSOPT                                                   02696000
IOSQISCE EQU   IOSOPT                                                   02697000
IOSDEP   EQU   IOSOPT                                                   02698000
IOSBYP   EQU   IOSOPT                                                   02699000
IOSCOD   EQU   IOSB+13                                                  02700000
IOSPKY7  EQU   IOSPKEY                                                  02701000
IOSPGDPX EQU   IOSPKEY                                                  02702000
IOSIDR   EQU   IOSPKEY                                                  02703000
IOSLCL   EQU   IOSPKEY                                                  02704000
@NM00083 EQU   IOSPKEY                                                  02705000
IOSPGAD  EQU   IOSB+8                                                   02706000
IOSASID  EQU   IOSB+6                                                   02707000
IOSPRLVL EQU   IOSB+5                                                   02708000
IOSDVRID EQU   IOSB+4                                                   02709000
IOSPROC  EQU   IOSB+3                                                   02710000
IOSFLC7  EQU   IOSFLC                                                   02711000
IOSFLC6  EQU   IOSFLC                                                   02712000
IOSRWAIT EQU   IOSFLC                                                   02713000
IOSTP    EQU   IOSFLC                                                   02714000
IOSCC3WE EQU   IOSFLC                                                   02715000
IOSVERIF EQU   IOSDVALT                                                 02716000
IOSDVMNT EQU   IOSFLC                                                   02717000
IOSLOG   EQU   IOSFLB                                                   02718000
IOSBDCST EQU   IOSFLB                                                   02719000
IOSMSG   EQU   IOSFLB                                                   02720000
IOSFLB4  EQU   IOSFLB                                                   02721000
IOSFLB3  EQU   IOSFLB                                                   02722000
IOSFLB2  EQU   IOSFLB                                                   02723000
IOSSDR   EQU   IOSFLB                                                   02724000
IOSDIESE EQU   IOSFLB                                                   02725000
IOSIOSB  EQU   IOSFLA                                                   02726000
IOSDOM   EQU   IOSFLA                                                   02727000
IOSEX    EQU   IOSFLA                                                   02728000
IOSSMDB  EQU   IOSFLA                                                   02729000
IOSSMDA  EQU   IOSFLA                                                   02730000
IOSERR   EQU   IOSFLA                                                   02731000
IOSCCHN  EQU   IOSACHN                                                  02732000
IOSDCHN  EQU   IOSACHN                                                  02733000
@NM00082 EQU   SRBSECT+40                                               02734000
@NM00081 EQU   SRBSECT+38                                               02735000
SRBPRIOR EQU   SRBSECT+37                                               02736000
SRBPKF   EQU   SRBSECT+36                                               02737000
SRBSAVE  EQU   SRBSECT+32                                               02738000
SRBPARM  EQU   SRBSECT+28                                               02739000
SRBRMTR  EQU   SRBSECT+24                                               02740000
SRBEP    EQU   SRBSECT+20                                               02741000
SRBPTCB  EQU   SRBFLC+4                                                 02742000
SRBPASID EQU   SRBFLC+2                                                 02743000
SRBCPAFF EQU   SRBFLC                                                   02744000
SRBASCB  EQU   SRBSECT+8                                                02745000
SRBFLNK  EQU   SRBSECT+4                                                02746000
SRBID    EQU   SRBSECT                                                  02747000
IOBERRCT EQU   IOBSTDRD+30                                              02748000
IOBRSV19 EQU   IOBINCAM+1                                               02749000
IOBOLTST EQU   IOBBTAMF                                                 02750000
IOBRFTMG EQU   IOBBTAMF                                                 02751000
IOBRSV17 EQU   IOBBTAMF                                                 02752000
IOBRSV16 EQU   IOBBTAMF                                                 02753000
IOBRSV15 EQU   IOBBTAMF                                                 02754000
IOBRSV14 EQU   IOBBTAMF                                                 02755000
IOBINUSE EQU   IOBBTAMF                                                 02756000
IOBPRMER EQU   IOBBTAMF                                                 02757000
IOBRSTRB EQU   IOBRESTR+1                                               02758000
IOBREPOS EQU   IOBRESTR                                                 02759000
IOBDCBPB EQU   IOBDCBPT+1                                               02760000
IOBRSV44 EQU   IOBFLAG4                                                 02761000
IOBJES3I EQU   IOBFLAG4                                                 02762000
IOBRSV42 EQU   IOBFLAG4                                                 02763000
IOBRSV41 EQU   IOBFLAG4                                                 02764000
IOBRSV40 EQU   IOBFLAG4                                                 02765000
IOBPMERR EQU   IOBFLAG4                                                 02766000
IOBCC3WE EQU   IOBFLAG4                                                 02767000
IOBGDPOL EQU   IOBFLAG4                                                 02768000
IOBSTRTB EQU   IOBSTART+1                                               02769000
IOBSIOCC EQU   IOBSTART                                                 02770000
IOBCSB7  EQU   IOBCSTAT                                                 02771000
IOBCSB6  EQU   IOBCSTAT                                                 02772000
IOBCSB5  EQU   IOBCSTAT                                                 02773000
IOBCSB4  EQU   IOBCSTAT                                                 02774000
IOBCSB3  EQU   IOBCSTAT                                                 02775000
IOBCSB2  EQU   IOBCSTAT                                                 02776000
IOBCSB1  EQU   IOBCSTAT                                                 02777000
IOBCSB0  EQU   IOBCSTAT                                                 02778000
IOBUSB7  EQU   IOBUSTAT                                                 02779000
IOBUSB6  EQU   IOBUSTAT                                                 02780000
IOBUSB5  EQU   IOBUSTAT                                                 02781000
IOBUSB4  EQU   IOBUSTAT                                                 02782000
IOBUSB3  EQU   IOBUSTAT                                                 02783000
IOBUSB2  EQU   IOBUSTAT                                                 02784000
IOBUSB1  EQU   IOBUSTAT                                                 02785000
IOBUSB0  EQU   IOBUSTAT                                                 02786000
IOBCMDA  EQU   IOBIOCSW                                                 02787000
IOBLOG   EQU   IOBFL3                                                   02788000
IOBJAM   EQU   IOBICL                                                   02789000
IOBMSG   EQU   IOBFL3                                                   02790000
IOBSDR   EQU   IOBCNC                                                   02791000
IOBACU   EQU   IOBFL3                                                   02792000
IOBCDC   EQU   IOBFL3                                                   02793000
IOBICC   EQU   IOBFL3                                                   02794000
IOBCCC   EQU   IOBFL3                                                   02795000
IOBECBPB EQU   IOBECBPT+1                                               02796000
IOBECBCC EQU   IOBECBPT                                                 02797000
IOBS1B7  EQU   IOBSENS1                                                 02798000
IOBS1B6  EQU   IOBSENS1                                                 02799000
IOBS1B5  EQU   IOBSENS1                                                 02800000
IOBS1B4  EQU   IOBSENS1                                                 02801000
IOBS1B3  EQU   IOBSENS1                                                 02802000
IOBS1B2  EQU   IOBSENS1                                                 02803000
IOBS1B1  EQU   IOBSENS1                                                 02804000
IOBS1B0  EQU   IOBSENS1                                                 02805000
IOBSNSC9 EQU   IOBS0B7                                                  02806000
IOBS0B6  EQU   IOBSENS0                                                 02807000
IOBS0B5  EQU   IOBSENS0                                                 02808000
IOBS0B4  EQU   IOBSENS0                                                 02809000
IOBS0B3  EQU   IOBSENS0                                                 02810000
IOBS0B2  EQU   IOBSENS0                                                 02811000
IOBS0B1  EQU   IOBSENS0                                                 02812000
IOBS0B0  EQU   IOBSENS0                                                 02813000
IOBPNCH  EQU   IOBFLAG2                                                 02814000
IOBSTATO EQU   IOBFLAG2                                                 02815000
IOBSKUPD EQU   IOBFLAG2                                                 02816000
IOBALTTR EQU   IOBFLAG2                                                 02817000
IOBRRT2  EQU   IOBRDHA0                                                 02818000
IOBRRT3  EQU   IOBPURGE                                                 02819000
IOBSENSE EQU   IOBFLAG2                                                 02820000
IOBHALT  EQU   IOBFLAG2                                                 02821000
IOBSPSVC EQU   IOBRSTRT                                                 02822000
IOBUNREL EQU   IOBFLAG1                                                 02823000
IOBIOERR EQU   IOBFLAG1                                                 02824000
IOBFCREX EQU   IOBCYCCK                                                 02825000
IOBRPSTN EQU   IOBFLAG1                                                 02826000
IOBERRTN EQU   IOBFLAG1                                                 02827000
IOBCMDCH EQU   IOBFLAG1                                                 02828000
IOBDATCH EQU   IOBFLAG1                                                 02829000
IOBCNOPA EQU   IOBPREFX+12                                              02830000
IOBCICB  EQU   IOBPREFX+8                                               02831000
IOBCECB  EQU   IOBPREFX+4                                               02832000
IOBCONOP EQU   IOBPREFX+3                                               02833000
IOBCINOP EQU   IOBPREFX+2                                               02834000
IOBRSV05 EQU   IOBPREFX+1                                               02835000
IOBPCI   EQU   IOBCFLG1                                                 02836000
IOBRSTCH EQU   IOBCFLG1                                                 02837000
IOBABAPP EQU   IOBCFLG1                                                 02838000
IOBPTST  EQU   IOBCFLG1                                                 02839000
IOBRSV04 EQU   IOBCFLG1                                                 02840000
IOBRSV03 EQU   IOBCFLG1                                                 02841000
IOBRSV02 EQU   IOBCFLG1                                                 02842000
IOBRSV01 EQU   IOBCFLG1                                                 02843000
UCBERADR EQU   UCBUCS+12                                                02844000
UCBFCBID EQU   UCBUCS+8                                                 02845000
UCBERCNT EQU   UCBUCS+7                                                 02846000
UCBRSV51 EQU   UCBUCS+6                                                 02847000
UCBRSV50 EQU   UCBFCBOP                                                 02848000
UCBRSV49 EQU   UCBFCBOP                                                 02849000
UCBRSV48 EQU   UCBFCBOP                                                 02850000
UCBRSV47 EQU   UCBFCBOP                                                 02851000
UCBRSV46 EQU   UCBFCBOP                                                 02852000
UCBRSV45 EQU   UCBFCBOP                                                 02853000
UCBRSV44 EQU   UCBFCBOP                                                 02854000
UCBFCBO1 EQU   UCBFCBOP                                                 02855000
UCBUCSPE EQU   UCBUCSOP                                                 02856000
UCBRSV43 EQU   UCBUCSOP                                                 02857000
UCBRSV42 EQU   UCBUCSOP                                                 02858000
UCBRSV41 EQU   UCBUCSOP                                                 02859000
UCBRSV40 EQU   UCBUCSOP                                                 02860000
UCBRSV39 EQU   UCBUCSOP                                                 02861000
UCBUCSO2 EQU   UCBUCSOP                                                 02862000
UCBUCSO1 EQU   UCBUCSOP                                                 02863000
UCBUCSID EQU   UCBUCS                                                   02864000
UCBMDRBA EQU   UCBMDRBF+1                                               02865000
UCBRV075 EQU   UCBMDRBF                                                 02866000
UCBRV074 EQU   UCB3800X+32                                              02867000
UCBIMAGE EQU   UCB3800X+28                                              02868000
UCBFCBNM EQU   UCB3800X+24                                              02869000
UCBCHAR4 EQU   UCB3800X+20                                              02870000
UCBCHAR3 EQU   UCB3800X+16                                              02871000
UCBCHAR2 EQU   UCB3800X+12                                              02872000
UCBCHAR1 EQU   UCB3800X+8                                               02873000
UCBCGMID EQU   UCB3800X+4                                               02874000
UCBBRSTA EQU   UCBACTIV                                                 02875000
UCBRV063 EQU   UCBACTIV                                                 02876000
UCBRV062 EQU   UCBACTIV                                                 02877000
UCBRV061 EQU   UCBACTIV                                                 02878000
UCBRV060 EQU   UCBACTIV                                                 02879000
UCBRV059 EQU   UCBACTIV                                                 02880000
UCBRV058 EQU   UCBACTIV                                                 02881000
UCBRV057 EQU   UCBACTIV                                                 02882000
UCBRV050 EQU   UCB3800X+2                                               02883000
UCBCGMNO EQU   UCB3800X+1                                               02884000
UCBRV083 EQU   UCBOPTNS                                                 02885000
UCBBRSTR EQU   UCBOPTNS                                                 02886000
UCBRV056 EQU   UCBOPTNS                                                 02887000
UCBRV055 EQU   UCBOPTNS                                                 02888000
UCBRV054 EQU   UCBOPTNS                                                 02889000
UCBRV053 EQU   UCBOPTNS                                                 02890000
UCBRV052 EQU   UCBOPTNS                                                 02891000
UCBRV051 EQU   UCBOPTNS                                                 02892000
UCBRV073 EQU   UCB3540X+7                                               02893000
UCBRV072 EQU   UCBDKBYT                                                 02894000
UCBRV071 EQU   UCBDKBYT                                                 02895000
UCBRV070 EQU   UCBDKBYT                                                 02896000
UCBRV069 EQU   UCBDKBYT                                                 02897000
UCBRV068 EQU   UCBDKBYT                                                 02898000
UCBRV067 EQU   UCBDKBYT                                                 02899000
UCBVLVER EQU   UCBDKBYT                                                 02900000
UCBDKAMX EQU   UCBDKBYT                                                 02901000
UCBVLSER EQU   UCB3540X                                                 02902000
UCBRDATA EQU   UCBOCR+4                                                 02903000
UCBFRID  EQU   UCBOCR                                                   02904000
UCBCLN   EQU   UCBMT+14                                                 02905000
UCBERG   EQU   UCBMT+12                                                 02906000
UCBMS    EQU   UCBMT+11                                                 02907000
UCBNB    EQU   UCBMT+10                                                 02908000
UCBPW    EQU   UCBMT+9                                                  02909000
UCBPR    EQU   UCBMT+8                                                  02910000
UCBSIO   EQU   UCBMT+6                                                  02911000
UCBTW    EQU   UCBMT+5                                                  02912000
UCBTR    EQU   UCBMT+4                                                  02913000
UCBTWT   EQU   UCBMT+3                                                  02914000
UCBTRT   EQU   UCBMT+2                                                  02915000
UCBCTD   EQU   UCBMT                                                    02916000
UCBWTOID EQU   UCBCMEXT+17                                              02917000
UCBRV043 EQU   UCBCMEXT+16                                              02918000
UCBASID  EQU   UCBCMEXT+14                                              02919000
UCBMFCNT EQU   UCBCMEXT+12                                              02920000
UCBPMSK  EQU   UCBCMEXT+10                                              02921000
UCBCCWOF EQU   UCBCMEXT+8                                               02922000
UCBRV041 EQU   UCBCMEXT+6                                               02923000
UCBRV036 EQU   UCBFLP1                                                  02924000
UCBRV035 EQU   UCBFLP1                                                  02925000
UCBERLOG EQU   UCBFLP1                                                  02926000
UCBRV033 EQU   UCBFLP1                                                  02927000
UCBRV032 EQU   UCBFLP1                                                  02928000
UCBRV031 EQU   UCBFLP1                                                  02929000
UCBSHRUP EQU   UCBFLP1                                                  02930000
UCBNSRCH EQU   UCBFLP1                                                  02931000
UCBSNSCT EQU   UCBCMEXT+4                                               02932000
UCBHPDV  EQU   @NM00080                                                 02933000
UCBHALI  EQU   @NM00080                                                 02934000
UCBRSV09 EQU   @NM00080                                                 02935000
UCBRSV08 EQU   @NM00080                                                 02936000
UCBRSV07 EQU   @NM00080                                                 02937000
UCBRSV06 EQU   @NM00080                                                 02938000
UCBRSV05 EQU   @NM00080                                                 02939000
UCBRSV04 EQU   @NM00080                                                 02940000
UCBDTI   EQU   UCBCMEXT+2                                               02941000
UCBSTI   EQU   UCBCMEXT+1                                               02942000
UCBETI   EQU   UCBCMEXT                                                 02943000
UCBEXTP  EQU   UCBEXTPT+1                                               02944000
UCBDDRSW EQU   UCBFLC                                                   02945000
UCBTICBT EQU   UCBFLC                                                   02946000
UCBIVRR  EQU   UCBFLC                                                   02947000
UCBIVRS  EQU   UCBFLC                                                   02948000
UCBITF   EQU   UCBFLC                                                   02949000
UCBUDE   EQU   UCBFLC                                                   02950000
UCBWAA   EQU   UCBFLC                                                   02951000
UCBATTP  EQU   UCBFLC                                                   02952000
UCBUNTYP EQU   UCBTBYT4                                                 02953000
UCBRSV11 EQU   UCBDVCLS                                                 02954000
UCBRSV10 EQU   UCBDVCLS                                                 02955000
UCB3CHAR EQU   UCBDVCLS                                                 02956000
UCB3UREC EQU   UCBDVCLS                                                 02957000
UCB3DISP EQU   UCBDVCLS                                                 02958000
UCB3DACC EQU   UCBDVCLS                                                 02959000
UCB3TAPE EQU   UCBDVCLS                                                 02960000
UCBDVPWR EQU   UCB2OPT7                                                 02961000
UCBVLPWR EQU   UCB2OPT6                                                 02962000
UCB2OPT5 EQU   UCBTBYT2                                                 02963000
UCBRVDEV EQU   UCBRWTAU                                                 02964000
UCBRPS   EQU   UCBDUDN2                                                 02965000
UCBRR    EQU   UCBDUDN1                                                 02966000
UCB2OPT1 EQU   UCBTBYT2                                                 02967000
UCB2OPT0 EQU   UCBTBYT2                                                 02968000
UCB1FEA7 EQU   UCBTBYT1                                                 02969000
UCBD6250 EQU   UCB1FEA6                                                 02970000
UCBD1600 EQU   UCB1FEA5                                                 02971000
UCB1FEA4 EQU   UCBTBYT1                                                 02972000
UCB1FEA3 EQU   UCBTBYT1                                                 02973000
UCB1FEA2 EQU   UCBTBYT1                                                 02974000
UCB1FEA1 EQU   UCBTBYT1                                                 02975000
UCB1FEA0 EQU   UCBTBYT1                                                 02976000
UCBNAME  EQU   UCBOB+13                                                 02977000
UCBRV029 EQU   UCBWGT                                                   02978000
UCBVHRSN EQU   UCBWGT                                                   02979000
UCBVORSN EQU   UCBWGT                                                   02980000
UCBMTPXP EQU   UCBWGT                                                   02981000
UCBREW   EQU   UCBWGT                                                   02982000
UCBPUB   EQU   UCBWGT                                                   02983000
UCBOUT   EQU   UCBWGT                                                   02984000
UCBIN    EQU   UCBWGT                                                   02985000
UCBCPU   EQU   UCBOB+11                                                 02986000
UCBLCI   EQU   UCBOB+10                                                 02987000
UCBCNT   EQU   UCBOB+9                                                  02988000
UCBRV017 EQU   UCBCHM1                                                  02989000
UCBRV016 EQU   UCBCHM1                                                  02990000
UCBRV015 EQU   UCBCHM1                                                  02991000
UCBRV014 EQU   UCBCHM1                                                  02992000
UCBSPB   EQU   UCBPTH1                                                  02993000
UCBPPB   EQU   UCBPTH1                                                  02994000
UCBSPA   EQU   UCBPTH0                                                  02995000
UCBPPA   EQU   UCBPTH0                                                  02996000
UCBSIGP  EQU   UCBFLB                                                   02997000
UCBVALPH EQU   UCBFLB                                                   02998000
UCBCRHSN EQU   UCBFLB                                                   02999000
UCBCRHRV EQU   UCBFLB                                                   03000000
UCBRESVH EQU   UCBFLB                                                   03001000
UCBSPST  EQU   UCBFLB                                                   03002000
UCBASNS  EQU   UCBFLB                                                   03003000
UCBIORST EQU   UCBFLB                                                   03004000
UCBQISCE EQU   UCBFL1                                                   03005000
UCBACTV  EQU   UCBFL1                                                   03006000
UCBSAP   EQU   UCBFL1                                                   03007000
UCBNOTRC EQU   UCBCUB                                                   03008000
UCBPSNS  EQU   UCBFL1                                                   03009000
UCBUSING EQU   UCBPST                                                   03010000
UCBNOTRD EQU   UCBNRY                                                   03011000
UCBBUSYD EQU   UCBBSY                                                   03012000
UCBUA    EQU   UCBCHAN+1                                                03013000
UCBCHA   EQU   UCBCHAN                                                  03014000
UCBDADI  EQU   UCBSTAT                                                  03015000
UCBSYSR  EQU   UCBSTAT                                                  03016000
UCBPRES  EQU   UCBSTAT                                                  03017000
UCBALOC  EQU   UCBSTAT                                                  03018000
UCBUNLD  EQU   UCBSTAT                                                  03019000
UCBRESV  EQU   UCBSTAT                                                  03020000
UCBCHGS  EQU   UCBSTAT                                                  03021000
UCBONLI  EQU   UCBSTAT                                                  03022000
UCBID    EQU   UCBOB+2                                                  03023000
UCBALTPH EQU   UCBFL5                                                   03024000
UCBALTCU EQU   UCBFL5                                                   03025000
UCBNALOC EQU   UCBFL5                                                   03026000
UCBENVRD EQU   UCBFL5                                                   03027000
UCBVSDR  EQU   UCBFL5                                                   03028000
UCBSASK  EQU   UCBFL5                                                   03029000
UCBAMV   EQU   UCBAF                                                    03030000
UCBDCC   EQU   UCBFL5                                                   03031000
UCBMONT  EQU   UCBJBNR                                                  03032000
UCBRV011 EQU   UCBJBNR                                                  03033000
UCBRSV02 EQU   UCBJBNR                                                  03034000
UCBOLDSM EQU   UCBJBNR                                                  03035000
UCBRV003 EQU   UCBJBNR                                                  03036000
UCBDUC   EQU   UCBJBNR                                                  03037000
UCBJES3  EQU   UCBJBNR                                                  03038000
UCBVRDEV EQU   UCBJBNR                                                  03039000
UCBCMSEG EQU   UCBOB                                                    03040000
UCBPFXND EQU   UCB+512                                                  03041000
UCBIOQ   EQU   UCB+508                                                  03042000
UCBPXST  EQU   UCB+504                                                  03043000
@NM00077 EQU   UCB                                                      03044000
@NM00076 EQU   SDWA+512                                                 03045000
@NM00075 EQU   SDWADPVA                                                 03046000
SDWAEBC  EQU   SDWADPVA                                                 03047000
SDWAVRAL EQU   SDWARA                                                   03048000
@NM00074 EQU   SDWA+396                                                 03049000
SDWACOMP EQU   SDWA+392                                                 03050000
SDWARCPL EQU   SDWA+364                                                 03051000
@NM00073 EQU   SDWADPSA+32                                              03052000
SDWATO4  EQU   SDWADPSL+28                                              03053000
SDWAFRM4 EQU   SDWADPSL+24                                              03054000
SDWATO3  EQU   SDWADPSL+20                                              03055000
SDWAFRM3 EQU   SDWADPSL+16                                              03056000
SDWATO2  EQU   SDWADPSL+12                                              03057000
SDWAFRM2 EQU   SDWADPSL+8                                               03058000
SDWATO1  EQU   SDWADPSL+4                                               03059000
SDWAFRM1 EQU   SDWADPSL                                                 03060000
@NM00072 EQU   SDWADDAT+3                                               03061000
@NM00071 EQU   SDWAPDAT                                                 03062000
SDWAUSPL EQU   SDWAPDAT                                                 03063000
SDWADPSW EQU   SDWAPDAT                                                 03064000
SDWATJPA EQU   SDWAPDAT                                                 03065000
SDWATLPA EQU   SDWAPDAT                                                 03066000
SDWADREG EQU   SDWAPDAT                                                 03067000
SDWADSAH EQU   SDWAPDAT                                                 03068000
SDWADSAS EQU   SDWAPDAT                                                 03069000
@NM00070 EQU   SDWADDAT+1                                               03070000
@NM00069 EQU   SDWASDAT                                                 03071000
SDWAQQS  EQU   SDWASDAT                                                 03072000
SDWACBS  EQU   SDWASDAT                                                 03073000
SDWAGTF  EQU   SDWASDAT                                                 03074000
SDWASWA  EQU   SDWASDAT                                                 03075000
SDWALSQA EQU   SDWASDAT                                                 03076000
SDWASQA  EQU   SDWASDAT                                                 03077000
SDWANUC  EQU   SDWASDAT                                                 03078000
@NM00068 EQU   SDWADUMP+2                                               03079000
@NM00067 EQU   SDWADPFS                                                 03080000
SDWASLST EQU   SDWADPFS                                                 03081000
@NM00066 EQU   SDWADPFS                                                 03082000
SDWADLST EQU   SDWADPFS                                                 03083000
SDWADPT  EQU   SDWADPFS                                                 03084000
SDWADPID EQU   SDWADUMP                                                 03085000
SDWADPLA EQU   SDWA+316                                                 03086000
SDWACSCT EQU   SDWARECP+8                                               03087000
SDWAMODN EQU   SDWARECP                                                 03088000
@NM00065 EQU   SDWALKWA+32                                              03089000
SDWATALW EQU   SDWALKWS+28                                              03090000
SDWATDLW EQU   SDWALKWS+24                                              03091000
SDWATNLW EQU   SDWALKWS+20                                              03092000
SDWAAPLW EQU   SDWALKWS+16                                              03093000
SDWAIPLW EQU   SDWALKWS+12                                              03094000
SDWAILLW EQU   SDWALKWS+8                                               03095000
SDWAIULW EQU   SDWALKWS+4                                               03096000
SDWAICLW EQU   SDWALKWS                                                 03097000
SDWAFLLK EQU   SDWAACF4                                                 03098000
SDWACMS  EQU   SDWAACF4                                                 03099000
SDWAOPTM EQU   SDWAACF4                                                 03100000
SDWATADB EQU   SDWAACF4                                                 03101000
SDWATDNB EQU   SDWAACF4                                                 03102000
SDWATNCB EQU   SDWAACF4                                                 03103000
SDWAILCH EQU   SDWAACF4                                                 03104000
SDWAIUCB EQU   SDWAACF4                                                 03105000
SDWAICAT EQU   SDWAACF3                                                 03106000
SDWAIPRG EQU   SDWAACF3                                                 03107000
SDWASALL EQU   SDWAACF3                                                 03108000
SDWAASMP EQU   SDWAACF3                                                 03109000
SDWADISP EQU   SDWAACF3                                                 03110000
@NM00064 EQU   SDWAACF3                                                 03111000
@NM00063 EQU   SDWAACF2                                                 03112000
SDWAFREE EQU   SDWAACF2                                                 03113000
SDWAUPRG EQU   SDWAACF2                                                 03114000
@NM00062 EQU   SDWAACF2                                                 03115000
SDWASPIN EQU   SDWAACF2                                                 03116000
@NM00061 EQU   SDWAACF2                                                 03117000
SDWALCPU EQU   SDWACPUA+2                                               03118000
@NM00060 EQU   SDWACPUA                                                 03119000
SDWARECA EQU   SDWA+244                                                 03120000
SDWARTYA EQU   SDWA+240                                                 03121000
@NM00059 EQU   SDWA+239                                                 03122000
@NM00058 EQU   SDWAIOFS                                                 03123000
SDWANIOP EQU   SDWAIOFS                                                 03124000
SDWANOIO EQU   SDWAIOFS                                                 03125000
SDWAIOHT EQU   SDWAIOFS                                                 03126000
SDWAIOQR EQU   SDWAIOFS                                                 03127000
@NM00057 EQU   SDWAERRD                                                 03128000
SDWAMCIV EQU   SDWAERRD                                                 03129000
SDWARPIV EQU   SDWAERRD                                                 03130000
SDWAMABD EQU   SDWAERRD                                                 03131000
SDWACTS  EQU   SDWAERRD                                                 03132000
SDWASTAE EQU   SDWAERRD                                                 03133000
SDWANRBE EQU   SDWAERRD                                                 03134000
SDWACLUP EQU   SDWAERRD                                                 03135000
@NM00056 EQU   SDWAERRC                                                 03136000
SDWAEAS  EQU   SDWAERRC                                                 03137000
SDWAPERC EQU   SDWAERRC                                                 03138000
SDWAIRB  EQU   SDWAERRC                                                 03139000
SDWASTAI EQU   SDWAERRC                                                 03140000
SDWASTAF EQU   SDWAERRC                                                 03141000
SDWASRBM EQU   SDWAERRB                                                 03142000
SDWALDIS EQU   SDWAERRB                                                 03143000
SDWAENRB EQU   SDWAERRB                                                 03144000
SDWATYP1 EQU   SDWAERRB                                                 03145000
@NM00055 EQU   SDWAERRB                                                 03146000
SDWAPGIO EQU   SDWAERRA                                                 03147000
SDWATEXC EQU   SDWAERRA                                                 03148000
SDWASVCE EQU   SDWAERRA                                                 03149000
SDWAABTM EQU   SDWAERRA                                                 03150000
SDWASVCD EQU   SDWAERRA                                                 03151000
SDWARKEY EQU   SDWAERRA                                                 03152000
SDWAPCHK EQU   SDWAERRA                                                 03153000
SDWAMCHK EQU   SDWAERRA                                                 03154000
SDWATIME EQU   SDWAMCH+20                                               03155000
SDWARFSA EQU   SDWAMCH+16                                               03156000
@NM00054 EQU   SDWAMCH+14                                               03157000
SDWAVEQR EQU   SDWARSR2                                                 03158000
SDWAPGFX EQU   SDWARSR2                                                 03159000
SDWAFLSQ EQU   SDWARSR2                                                 03160000
SDWAFSQA EQU   SDWARSR2                                                 03161000
SDWANUCL EQU   SDWARSR2                                                 03162000
SDWASPER EQU   SDWARSR2                                                 03163000
SDWAINTC EQU   SDWARSR2                                                 03164000
SDWAOFLN EQU   SDWARSR2                                                 03165000
SDWACHNG EQU   SDWARSR1                                                 03166000
SDWAMSER EQU   SDWARSR1                                                 03167000
@NM00053 EQU   SDWARSR1                                                 03168000
SDWACPID EQU   SDWAMCH+10                                               03169000
SDWATERR EQU   SDWAMCHD                                                 03170000
SDWAFPRX EQU   SDWAMCHD                                                 03171000
SDWAINSF EQU   SDWAMCHD                                                 03172000
SDWAACR  EQU   SDWAMCHD                                                 03173000
SDWASCK  EQU   SDWAMCHD                                                 03174000
SDWAPSWU EQU   SDWAMCHD                                                 03175000
SDWAREGU EQU   SDWAMCHD                                                 03176000
SDWASKYF EQU   SDWAMCHD                                                 03177000
@NM00052 EQU   SDWAMCHS                                                 03178000
SDWARSRF EQU   SDWAMCHS                                                 03179000
SDWARSRC EQU   SDWAMCHS                                                 03180000
SDWAINVP EQU   SDWAMCHS                                                 03181000
SDWATSVL EQU   SDWAMCHS                                                 03182000
SDWARCDF EQU   SDWAMCHS                                                 03183000
SDWASRVL EQU   SDWAMCHS                                                 03184000
SDWASCKE EQU   SDWASTCK+4                                               03185000
SDWASCKB EQU   SDWASTCK                                                 03186000
SDWALNTH EQU   SDWAIDNT+1                                               03187000
SDWASPID EQU   SDWAIDNT                                                 03188000
SDWASR15 EQU   SDWASRSV+60                                              03189000
SDWASR14 EQU   SDWASRSV+56                                              03190000
SDWASR13 EQU   SDWASRSV+52                                              03191000
SDWASR12 EQU   SDWASRSV+48                                              03192000
SDWASR11 EQU   SDWASRSV+44                                              03193000
SDWASR10 EQU   SDWASRSV+40                                              03194000
SDWASR09 EQU   SDWASRSV+36                                              03195000
SDWASR08 EQU   SDWASRSV+32                                              03196000
SDWASR07 EQU   SDWASRSV+28                                              03197000
SDWASR06 EQU   SDWASRSV+24                                              03198000
SDWASR05 EQU   SDWASRSV+20                                              03199000
SDWASR04 EQU   SDWASRSV+16                                              03200000
SDWASR03 EQU   SDWASRSV+12                                              03201000
SDWASR02 EQU   SDWASRSV+8                                               03202000
SDWASR01 EQU   SDWASRSV+4                                               03203000
SDWASR00 EQU   SDWASRSV                                                 03204000
SDWATRN2 EQU   SDWAAEC2+4                                               03205000
SDWAIPC2 EQU   SDWAICD2                                                 03206000
SDWAIMC2 EQU   SDWAICD2                                                 03207000
SDWAIPR2 EQU   SDWAICD2                                                 03208000
@NM00051 EQU   SDWAINC2                                                 03209000
@NM00050 EQU   SDWAILC2                                                 03210000
SDWAIL2  EQU   SDWAILC2                                                 03211000
@NM00049 EQU   SDWAILC2                                                 03212000
@NM00048 EQU   SDWAAEC2                                                 03213000
SDWAADD2 EQU   SDWANXT2+1                                               03214000
@NM00047 EQU   SDWANXT2                                                 03215000
@NM00046 EQU   SDWAEC2+3                                                03216000
SDWASGN2 EQU   SDWAINT2                                                 03217000
SDWAEXP2 EQU   SDWAINT2                                                 03218000
SDWADEC2 EQU   SDWAINT2                                                 03219000
SDWAFPO2 EQU   SDWAINT2                                                 03220000
SDWACC2  EQU   SDWAINT2                                                 03221000
@NM00045 EQU   SDWAINT2                                                 03222000
SDWAPGM2 EQU   SDWAMWP2                                                 03223000
SDWAWAT2 EQU   SDWAMWP2                                                 03224000
SDWAMCK2 EQU   SDWAMWP2                                                 03225000
SDWAECT2 EQU   SDWAMWP2                                                 03226000
SDWAKEY2 EQU   SDWAMWP2                                                 03227000
SDWAEXT2 EQU   SDWAEMK2                                                 03228000
SDWAIO2  EQU   SDWAEMK2                                                 03229000
SDWATRM2 EQU   SDWAEMK2                                                 03230000
@NM00044 EQU   SDWAEMK2                                                 03231000
SDWAPER2 EQU   SDWAEMK2                                                 03232000
@NM00043 EQU   SDWAEMK2                                                 03233000
SDWATRAN EQU   SDWAAEC1+4                                               03234000
SDWAIPC1 EQU   SDWAICD1                                                 03235000
SDWAIMC1 EQU   SDWAICD1                                                 03236000
SDWAIPR1 EQU   SDWAICD1                                                 03237000
@NM00042 EQU   SDWAINC1                                                 03238000
@NM00041 EQU   SDWAILC1                                                 03239000
SDWAIL1  EQU   SDWAILC1                                                 03240000
@NM00040 EQU   SDWAILC1                                                 03241000
@NM00039 EQU   SDWAAEC1                                                 03242000
SDWAADD1 EQU   SDWANXT1+1                                               03243000
@NM00038 EQU   SDWANXT1                                                 03244000
@NM00037 EQU   SDWAEC1+3                                                03245000
SDWASGN1 EQU   SDWAINT1                                                 03246000
SDWAEXP1 EQU   SDWAINT1                                                 03247000
SDWADEC1 EQU   SDWAINT1                                                 03248000
SDWAFPO1 EQU   SDWAINT1                                                 03249000
SDWACC1  EQU   SDWAINT1                                                 03250000
@NM00036 EQU   SDWAINT1                                                 03251000
SDWAPGM1 EQU   SDWAMWP1                                                 03252000
SDWAWAT1 EQU   SDWAMWP1                                                 03253000
SDWAMCK1 EQU   SDWAMWP1                                                 03254000
SDWAECT1 EQU   SDWAMWP1                                                 03255000
SDWAKEY1 EQU   SDWAMWP1                                                 03256000
SDWAEXT1 EQU   SDWAEMK1                                                 03257000
SDWAIO1  EQU   SDWAEMK1                                                 03258000
SDWATRM1 EQU   SDWAEMK1                                                 03259000
@NM00035 EQU   SDWAEMK1                                                 03260000
SDWAPER1 EQU   SDWAEMK1                                                 03261000
@NM00034 EQU   SDWAEMK1                                                 03262000
SDWAIOBR EQU   SDWA+100                                                 03263000
SDWAEPA  EQU   SDWA+96                                                  03264000
@NM00033 EQU   SDWANAME+4                                               03265000
SDWARBAD EQU   SDWANAME                                                 03266000
SDWAGR15 EQU   SDWAGRSV+60                                              03267000
SDWAGR14 EQU   SDWAGRSV+56                                              03268000
SDWAGR13 EQU   SDWAGRSV+52                                              03269000
SDWAGR12 EQU   SDWAGRSV+48                                              03270000
SDWAGR11 EQU   SDWAGRSV+44                                              03271000
SDWAGR10 EQU   SDWAGRSV+40                                              03272000
SDWAGR09 EQU   SDWAGRSV+36                                              03273000
SDWAGR08 EQU   SDWAGRSV+32                                              03274000
SDWAGR07 EQU   SDWAGRSV+28                                              03275000
SDWAGR06 EQU   SDWAGRSV+24                                              03276000
SDWAGR05 EQU   SDWAGRSV+20                                              03277000
SDWAGR04 EQU   SDWAGRSV+16                                              03278000
SDWAGR03 EQU   SDWAGRSV+12                                              03279000
SDWAGR02 EQU   SDWAGRSV+8                                               03280000
SDWAGR01 EQU   SDWAGRSV+4                                               03281000
SDWAGR00 EQU   SDWAGRSV                                                 03282000
SDWANXTP EQU   SDWACTL2+5                                               03283000
SDWASGP  EQU   SDWAPMKP                                                 03284000
SDWAEUP  EQU   SDWAPMKP                                                 03285000
SDWADOP  EQU   SDWAPMKP                                                 03286000
SDWAFPP  EQU   SDWAPMKP                                                 03287000
SDWACCP  EQU   SDWAPMKP                                                 03288000
SDWAILP  EQU   SDWAPMKP                                                 03289000
SDWAINTP EQU   SDWACTL2+2                                               03290000
SDWASPVP EQU   SDWAMWPP                                                 03291000
SDWAWATP EQU   SDWAMWPP                                                 03292000
SDWAMCKP EQU   SDWAMWPP                                                 03293000
@NM00032 EQU   SDWAMWPP                                                 03294000
SDWAKEYP EQU   SDWAMWPP                                                 03295000
SDWAEXTP EQU   SDWACMKP                                                 03296000
SDWAIOP  EQU   SDWACMKP                                                 03297000
SDWANXTA EQU   SDWACTL1+5                                               03298000
SDWASGA  EQU   SDWAPMKA                                                 03299000
SDWAEUA  EQU   SDWAPMKA                                                 03300000
SDWADOA  EQU   SDWAPMKA                                                 03301000
SDWAFPA  EQU   SDWAPMKA                                                 03302000
SDWACCA  EQU   SDWAPMKA                                                 03303000
SDWAILA  EQU   SDWAPMKA                                                 03304000
SDWAINTA EQU   SDWACTL1+2                                               03305000
SDWASPVA EQU   SDWAMWPA                                                 03306000
SDWAWATA EQU   SDWAMWPA                                                 03307000
SDWAMCKA EQU   SDWAMWPA                                                 03308000
@NM00031 EQU   SDWAMWPA                                                 03309000
SDWAKEYA EQU   SDWAMWPA                                                 03310000
SDWAEXTA EQU   SDWACMKA                                                 03311000
SDWAIOA  EQU   SDWACMKA                                                 03312000
SDWACMPC EQU   SDWAABCC+1                                               03313000
@NM00030 EQU   SDWACMPF                                                 03314000
SDWASTCC EQU   SDWACMPF                                                 03315000
@NM00029 EQU   SDWACMPF                                                 03316000
SDWASTEP EQU   SDWACMPF                                                 03317000
SDWAREQ  EQU   SDWACMPF                                                 03318000
CVTLEVL  EQU   CVTRELNO+2                                               03319000
CVTNUMB  EQU   CVTRELNO                                                 03320000
CVTMDL   EQU   CVTFIX+250                                               03321000
@NM00028 EQU   CVTFIX+248                                               03322000
@NM00027 EQU   CVTFIX                                                   03323000
CVTRV482 EQU   CVTXTNT2+128                                             03324000
CVTRV481 EQU   CVTXTNT2+124                                             03325000
CVTRV480 EQU   CVTXTNT2+120                                             03326000
CVTRV479 EQU   CVTXTNT2+118                                             03327000
CVTRV478 EQU   CVTXTNT2+117                                             03328000
CVTRV477 EQU   CVTXTNT2+116                                             03329000
CVTRV476 EQU   CVTXTNT2+115                                             03330000
CVTRV475 EQU   CVTXTNT2+114                                             03331000
CVTRV474 EQU   CVTRV466                                                 03332000
CVTRV473 EQU   CVTRV466                                                 03333000
CVTRV472 EQU   CVTRV466                                                 03334000
CVTRV471 EQU   CVTRV466                                                 03335000
CVTRV470 EQU   CVTRV466                                                 03336000
CVTRV469 EQU   CVTRV466                                                 03337000
CVTRV468 EQU   CVTRV466                                                 03338000
CVTRV467 EQU   CVTRV466                                                 03339000
CVTRV465 EQU   CVTRV457                                                 03340000
CVTRV464 EQU   CVTRV457                                                 03341000
CVTRV463 EQU   CVTRV457                                                 03342000
CVTRV462 EQU   CVTRV457                                                 03343000
CVTRV461 EQU   CVTRV457                                                 03344000
CVTRV460 EQU   CVTRV457                                                 03345000
CVTRV459 EQU   CVTRV457                                                 03346000
CVTRV458 EQU   CVTRV457                                                 03347000
CVTRV456 EQU   CVTXTNT2+108                                             03348000
CVTRV455 EQU   CVTXTNT2+104                                             03349000
CVTRV454 EQU   CVTXTNT2+100                                             03350000
CVTRV453 EQU   CVTXTNT2+96                                              03351000
CVTRV452 EQU   CVTXTNT2+94                                              03352000
CVTRV451 EQU   CVTXTNT2+92                                              03353000
CVTRV450 EQU   CVTXTNT2+90                                              03354000
CVTRV449 EQU   CVTXTNT2+88                                              03355000
CVTRV448 EQU   CVTXTNT2+87                                              03356000
CVTRV447 EQU   CVTXTNT2+86                                              03357000
CVTRV446 EQU   CVTRV438                                                 03358000
CVTRV445 EQU   CVTRV438                                                 03359000
CVTRV444 EQU   CVTRV438                                                 03360000
CVTRV443 EQU   CVTRV438                                                 03361000
CVTRV442 EQU   CVTRV438                                                 03362000
CVTRV441 EQU   CVTRV438                                                 03363000
CVTRV440 EQU   CVTRV438                                                 03364000
CVTRV439 EQU   CVTRV438                                                 03365000
CVTRV437 EQU   CVTRV429                                                 03366000
CVTRV436 EQU   CVTRV429                                                 03367000
CVTRV435 EQU   CVTRV429                                                 03368000
CVTRV434 EQU   CVTRV429                                                 03369000
CVTRV433 EQU   CVTRV429                                                 03370000
CVTRV432 EQU   CVTRV429                                                 03371000
CVTRV431 EQU   CVTRV429                                                 03372000
CVTRV430 EQU   CVTRV429                                                 03373000
CVTRV428 EQU   CVTXTNT2+80                                              03374000
CVTRV427 EQU   CVTXTNT2+76                                              03375000
CVTRV426 EQU   CVTXTNT2+72                                              03376000
CVTRV425 EQU   CVTXTNT2+68                                              03377000
CVTATACT EQU   CVTATCVT                                                 03378000
CVTRV423 EQU   CVTXTNT2+62                                              03379000
CVTRV422 EQU   CVTXTNT2+60                                              03380000
CVTRV421 EQU   CVTXTNT2+58                                              03381000
CVTRV420 EQU   CVTXTNT2+56                                              03382000
CVTRV419 EQU   CVTXTNT2+55                                              03383000
CVTRV418 EQU   CVTXTNT2+54                                              03384000
CVTRV417 EQU   CVTRV409                                                 03385000
CVTRV416 EQU   CVTRV409                                                 03386000
CVTRV415 EQU   CVTRV409                                                 03387000
CVTRV414 EQU   CVTRV409                                                 03388000
CVTRV413 EQU   CVTRV409                                                 03389000
CVTRV412 EQU   CVTRV409                                                 03390000
CVTRV411 EQU   CVTRV409                                                 03391000
CVTRV410 EQU   CVTRV409                                                 03392000
CVTRV408 EQU   CVTRV400                                                 03393000
CVTRV407 EQU   CVTRV400                                                 03394000
CVTRV406 EQU   CVTRV400                                                 03395000
CVTRV405 EQU   CVTRV400                                                 03396000
CVTRV404 EQU   CVTRV400                                                 03397000
CVTRV403 EQU   CVTRV400                                                 03398000
CVTRV402 EQU   CVTRV400                                                 03399000
CVTRV401 EQU   CVTRV400                                                 03400000
CVTICB   EQU   CVTXTNT2+48                                              03401000
CVTSKTA  EQU   CVTXTNT2+44                                              03402000
CVTCCVT  EQU   CVTXTNT2+40                                              03403000
CVTRSV98 EQU   CVTXTNT2+36                                              03404000
CVTRSV97 EQU   CVTXTNT2+34                                              03405000
CVTRSV96 EQU   CVTXTNT2+32                                              03406000
CVTOLTEP EQU   CVTXTNT2+28                                              03407000
CVTQIDA  EQU   CVTQID+1                                                 03408000
CVTRSV95 EQU   CVTQID                                                   03409000
CVTRSV94 EQU   CVTXTNT2+20                                              03410000
CVTRSV93 EQU   CVTXTNT2+16                                              03411000
CVTRSV92 EQU   CVTXTNT2+12                                              03412000
CVTDEBVR EQU   CVTXTNT2+8                                               03413000
CVTRSV91 EQU   CVTXTNT2+6                                               03414000
CVTRSV9H EQU   CVTFLGBT                                                 03415000
CVTRSV9G EQU   CVTFLGBT                                                 03416000
CVTRSV9F EQU   CVTFLGBT                                                 03417000
CVTRSV9E EQU   CVTFLGBT                                                 03418000
CVTRSV9D EQU   CVTFLGBT                                                 03419000
CVTBAH   EQU   CVTFLGBT                                                 03420000
CVTVME   EQU   CVTFLGBT                                                 03421000
CVTNPE   EQU   CVTFLGBT                                                 03422000
CVTNUCLS EQU   CVTXTNT2+4                                               03423000
CVTDSSVA EQU   CVTDSSV+1                                                03424000
CVTRSV89 EQU   CVTDSSV                                                  03425000
CVTRSV88 EQU   CVTXTNT1+8                                               03426000
CVTRSV87 EQU   CVTXTNT1+4                                               03427000
CVTFACHN EQU   CVTXTNT1                                                 03428000
CVTRV488 EQU   CVTMAP+412                                               03429000
CVTRV487 EQU   CVTMAP+408                                               03430000
CVTRV486 EQU   CVTMAP+404                                               03431000
CVTRV485 EQU   CVTMAP+400                                               03432000
CVTACTAP EQU   CVTMAP+396                                               03433000
CVTAUTH  EQU   CVTMAP+392                                               03434000
CVTRV490 EQU   CVTMAP+388                                               03435000
CVTSU    EQU   CVTMAP+384                                               03436000
CVTVOLT1 EQU   CVTVOLM1+1                                               03437000
CVTVOLI1 EQU   CVTVOLF1                                                 03438000
CVTSTOA  EQU   CVTMAP+376                                               03439000
CVTRSV58 EQU   CVTMAP+374                                               03440000
CVTRSV57 EQU   CVTMAP+372                                               03441000
CVTDDCE  EQU   CVTMAP+368                                               03442000
CVTPNWFR EQU   CVTMAP+364                                               03443000
CVTSMF   EQU   CVTMAP+360                                               03444000
CVTSULK  EQU   CVTMAP+358                                               03445000
CVTSLKO  EQU   CVTSYSK                                                  03446000
CVTSLKP  EQU   CVTSYSK                                                  03447000
CVTSLKQ  EQU   CVTSYSK                                                  03448000
CVTSLKR  EQU   CVTSYSK                                                  03449000
CVTRSV56 EQU   CVTSYSK                                                  03450000
CVTRSV55 EQU   CVTSYSK                                                  03451000
CVTRSV54 EQU   CVTSYSK                                                  03452000
CVTRSV53 EQU   CVTSYSK                                                  03453000
CVTRSV52 EQU   CVTA1F1                                                  03454000
CVTRSV51 EQU   CVTA1F1                                                  03455000
CVTRSV50 EQU   CVTA1F1                                                  03456000
CVTRSV49 EQU   CVTA1F1                                                  03457000
CVTRSV48 EQU   CVTA1F1                                                  03458000
CVTRSV47 EQU   CVTA1F1                                                  03459000
CVTSRSW  EQU   CVTA1F1                                                  03460000
CVTPFSW  EQU   CVTA1F1                                                  03461000
CVTPCVT  EQU   CVTMAP+352                                               03462000
CVTRSV46 EQU   CVTMAP+344                                               03463000
CVTRSV45 EQU   CVTMAP+340                                               03464000
CVTRSV44 EQU   CVTMAP+338                                               03465000
CVTRSV43 EQU   CVTMAP+336                                               03466000
CVTHJESA EQU   CVTHJES+1                                                03467000
CVTRSV42 EQU   CVTHJES                                                  03468000
CVTEXT2A EQU   CVTEXT2+1                                                03469000
CVTRSV41 EQU   CVTEXT2                                                  03470000
CVTAPFA  EQU   CVTAPF+1                                                 03471000
CVTRSV40 EQU   CVTAPF                                                   03472000
CVTRV518 EQU   CVTINTLA                                                 03473000
CVTRV517 EQU   CVTERPV                                                  03474000
CVTEORM  EQU   CVTMAP+312                                               03475000
CVTMCHPR EQU   CVTMAP+308                                               03476000
CVTTZ    EQU   CVTMAP+304                                               03477000
CVTJEPS  EQU   CVTMAP+300                                               03478000
CVTJESCT EQU   CVTMAP+296                                               03479000
CVTMODE  EQU   CVTMAP+292                                               03480000
CVTPTRV  EQU   CVTMAP+288                                               03481000
CVTREAL  EQU   CVTMAP+284                                               03482000
CVTRSV39 EQU   CVTMAP+280                                               03483000
CVTRSV38 EQU   CVTMAP+276                                               03484000
CVTDMSRA EQU   CVTDMSR+1                                                03485000
CVTRV634 EQU   CVTDMSRF                                                 03486000
CVTRV633 EQU   CVTDMSRF                                                 03487000
CVTRV632 EQU   CVTDMSRF                                                 03488000
CVTRV631 EQU   CVTDMSRF                                                 03489000
CVTRV630 EQU   CVTDMSRF                                                 03490000
CVTRV629 EQU   CVTDMSRF                                                 03491000
CVTUDUMP EQU   CVTDMSRF                                                 03492000
CVTSDUMP EQU   CVTDMSRF                                                 03493000
CVTQMSGA EQU   CVTQMSG+1                                                03494000
CVTRSV36 EQU   CVTQMSG                                                  03495000
CVTAMFF  EQU   CVTMAP+264                                               03496000
CVTPURGA EQU   CVTPURG+1                                                03497000
CVTRSV35 EQU   CVTPURG                                                  03498000
CVTCBSP  EQU   CVTMAP+256                                               03499000
CVTATERA EQU   CVTATER+1                                                03500000
CVTSYST  EQU   CVTATER                                                  03501000
CVTVOLT2 EQU   CVTTAT                                                   03502000
CVTVOLI2 EQU   CVTVOLF2                                                 03503000
CVTAQAVB EQU   CVTAQAVT+1                                               03504000
CVTRSV34 EQU   CVTTCMFG                                                 03505000
CVTRSV33 EQU   CVTTCMFG                                                 03506000
CVTRSV32 EQU   CVTTCMFG                                                 03507000
CVTRSV31 EQU   CVTTCMFG                                                 03508000
CVTRSV30 EQU   CVTTCMFG                                                 03509000
CVTRSV29 EQU   CVTTCMFG                                                 03510000
CVTLDEV  EQU   CVTTCMFG                                                 03511000
CVTTCRDY EQU   CVTTCMFG                                                 03512000
CVTGTFA  EQU   CVTGTF+1                                                 03513000
CVTRSV27 EQU   CVTGTFST                                                 03514000
CVTRNIO  EQU   CVTGTFST                                                 03515000
CVTUSR   EQU   CVTGTFST                                                 03516000
CVTRV318 EQU   CVTFORM                                                  03517000
CVTRV317 EQU   CVTTMODE                                                 03518000
CVTRV316 EQU   CVTSTATE                                                 03519000
CVTRV315 EQU   CVTGTFS                                                  03520000
CVTGTFAV EQU   CVTGTFS                                                  03521000
CVT0SCR1 EQU   CVTMAP+232                                               03522000
CVTRV515 EQU   CVTMAP+228                                               03523000
CVTRMS   EQU   CVTMAP+224                                               03524000
CVTPATCH EQU   CVTMAP+220                                               03525000
CVTTSCE  EQU   CVTMAP+216                                               03526000
CVTLNKSC EQU   CVTMAP+214                                               03527000
CVTQABST EQU   CVTMAP+212                                               03528000
CVTMDLDS EQU   CVTMAP+208                                               03529000
CVTUSER  EQU   CVTMAP+204                                               03530000
CVTABEND EQU   CVTMAP+200                                               03531000
CVTSMCA  EQU   CVTMAP+196                                               03532000
CVTRSV18 EQU   CVTMAP+192                                               03533000
CVTQLPAQ EQU   CVTMAP+188                                               03534000
CVTQCDSR EQU   CVTMAP+184                                               03535000
CVTVS1B  EQU   CVTOPTB                                                  03536000
CVTVS1A  EQU   CVTOPTB                                                  03537000
CVTFP    EQU   CVTOPTB                                                  03538000
CVTAPTHR EQU   CVTOPTB                                                  03539000
CVTNLOG  EQU   CVTOPTB                                                  03540000
CVTTOD   EQU   CVTOPTB                                                  03541000
CVTCTIMS EQU   CVTOPTB                                                  03542000
CVTPROT  EQU   CVTOPTB                                                  03543000
CVTXPFP  EQU   CVTOPTA                                                  03544000
CVTASCII EQU   CVTOPTA                                                  03545000
CVTRSV13 EQU   CVTOPTA                                                  03546000
CVTRSV12 EQU   CVTOPTA                                                  03547000
CVTNIP   EQU   CVTOPTA                                                  03548000
CVTDDR   EQU   CVTOPTA                                                  03549000
CVTAPR   EQU   CVTOPTA                                                  03550000
CVTCCH   EQU   CVTOPTA                                                  03551000
CVTSNCTR EQU   CVTMAP+180                                               03552000
CVTQMWR  EQU   CVTMAP+176                                               03553000
CVTQOCR  EQU   CVTMAP+172                                               03554000
CVT1EF00 EQU   CVTMAP+168                                               03555000
CVTMZ00  EQU   CVTMAP+164                                               03556000
CVTHEAD  EQU   CVTMAP+160                                               03557000
CVTRSV11 EQU   CVTMAP+156                                               03558000
CVT0PT01 EQU   CVTMAP+152                                               03559000
CVTMSER  EQU   CVTMAP+148                                               03560000
CVTRV516 EQU   CVTIERLC                                                 03561000
CVTILCH  EQU   CVTMAP+140                                               03562000
CVT0DS   EQU   CVTMAP+136                                               03563000
CVTFBOSV EQU   CVTMAP+132                                               03564000
CVTNUCB  EQU   CVTMAP+128                                               03565000
CVTIXAVL EQU   CVTMAP+124                                               03566000
CVTIOQET EQU   CVTMAP+120                                               03567000
CVTDCBA  EQU   CVTMAP+117                                               03568000
CVTMVS2  EQU   CVTDCB                                                   03569000
CVT6DAT  EQU   CVTDCB                                                   03570000
CVT4MPS  EQU   CVTDCB                                                   03571000
CVTRSV09 EQU   CVTDCB                                                   03572000
CVT4MS1  EQU   CVTDCB                                                   03573000
CVT2SPS  EQU   CVTDCB                                                   03574000
CVT1SSS  EQU   CVTDCB                                                   03575000
CVTRSV08 EQU   CVTDCB                                                   03576000
CVTSTB   EQU   CVTMAP+112                                               03577000
CVTQTD00 EQU   CVTMAP+108                                               03578000
CVTQTE00 EQU   CVTMAP+104                                               03579000
CVTCUCB  EQU   CVTMAP+100                                               03580000
CVTSJQ   EQU   CVTMAP+96                                                03581000
CVTPBLDL EQU   CVTMAP+92                                                03582000
CVTTPC   EQU   CVTMAP+88                                                03583000
CVTSVDCB EQU   CVTMAP+84                                                03584000
CVTBRET  EQU   CVTMAP+82                                                03585000
CVTEXIT  EQU   CVTMAP+80                                                03586000
CVT0FN00 EQU   CVTMAP+76                                                03587000
CVTDARA  EQU   CVTDAR+1                                                 03588000
CVTRSV07 EQU   CVTFLGS1                                                 03589000
CVTRSV06 EQU   CVTFLGS1                                                 03590000
CVTRSV05 EQU   CVTFLGS1                                                 03591000
CVTRSV04 EQU   CVTFLGS1                                                 03592000
CVTRSV03 EQU   CVTFLGS1                                                 03593000
CVTRSV02 EQU   CVTFLGS1                                                 03594000
CVTRSV01 EQU   CVTFLGS1                                                 03595000
CVTDMPLK EQU   CVTFLGS1                                                 03596000
CVTXITP  EQU   CVTMAP+68                                                03597000
CVTZDTAB EQU   CVTMAP+64                                                03598000
CVTMSLT  EQU   CVTMAP+60                                                03599000
CVTDATE  EQU   CVTMAP+56                                                03600000
CVTBTERM EQU   CVTMAP+52                                                03601000
CVTSYSAD EQU   CVTMAP+48                                                03602000
CVTXTLER EQU   CVTMAP+44                                                03603000
CVTILK2  EQU   CVTMAP+40                                                03604000
CVTILK1  EQU   CVTMAP+36                                                03605000
CVTPRLTV EQU   CVTMAP+32                                                03606000
CVTPCNVT EQU   CVTMAP+28                                                03607000
CVT0VL00 EQU   CVTMAP+24                                                03608000
CVTXAPG  EQU   CVTMAP+20                                                03609000
CVTBUF   EQU   CVTMAP+16                                                03610000
CVTJOB   EQU   CVTMAP+12                                                03611000
CVTLINK  EQU   CVTMAP+8                                                 03612000
CVT0EF00 EQU   CVTMAP+4                                                 03613000
CVTTCBP  EQU   CVTMAP                                                   03614000
CVT      EQU   CVTMAP                                                   03615000
@NM00002 EQU   FRRSFLGS+1                                               03616000
@NM00001 EQU   FRRSFLG1                                                 03617000
FRRSRCUR EQU   FRRSFLG1                                                 03618000
FRRSENTS EQU   FRRS+84                                                  03619000
FRRSRTMW EQU   FRRS+16                                                  03620000
@NM00026 EQU   PSA+3668                                                 03621000
PSASTAK  EQU   PSA+3072                                                 03622000
@NM00025 EQU   PSA+1048                                                 03623000
PSAUSEND EQU   PSA+1048                                                 03624000
PSARV062 EQU   PSA+1044                                                 03625000
PSACDAL  EQU   PSA+1040                                                 03626000
PSAWTCOD EQU   PSA+1036                                                 03627000
PSAATCVT EQU   PSA+1032                                                 03628000
PSAPCPSW EQU   PSA+1024                                                 03629000
PSAPIR2  EQU   PSA+1020                                                 03630000
PSARV059 EQU   PSA+1018                                                 03631000
PSASVC13 EQU   PSA+1016                                                 03632000
PSASFACC EQU   PSA+1008                                                 03633000
PSASTOP  EQU   PSA+992                                                  03634000
PSASTART EQU   PSA+976                                                  03635000
PSARSPSW EQU   PSA+968                                                  03636000
PSASRPSW EQU   PSA+960                                                  03637000
PSARV045 EQU   PSA+892                                                  03638000
PSARV044 EQU   PSA+888                                                  03639000
PSARV043 EQU   PSA+884                                                  03640000
PSARV042 EQU   PSA+880                                                  03641000
PSARV041 EQU   PSA+876                                                  03642000
PSARV040 EQU   PSA+872                                                  03643000
PSARV025 EQU   PSA+868                                                  03644000
PSADSSED EQU   PSA+868                                                  03645000
PSADSSPR EQU   PSA+864                                                  03646000
PSADSSFW EQU   PSA+860                                                  03647000
PSADSS14 EQU   PSA+856                                                  03648000
PSADSSPP EQU   PSA+848                                                  03649000
PSADSSRP EQU   PSA+840                                                  03650000
PSADSS05 EQU   PSADSSF4                                                 03651000
PSADSS10 EQU   PSADSSF4                                                 03652000
PSADSSVE EQU   PSADSSF4                                                 03653000
PSADSSDE EQU   PSADSSF4                                                 03654000
PSADSSC0 EQU   PSADSSF4                                                 03655000
PSADSSIE EQU   PSADSSF4                                                 03656000
PSADSS12 EQU   PSADSSF4                                                 03657000
PSADSSRC EQU   PSADSSF4                                                 03658000
PSARV057 EQU   PSADSSF3                                                 03659000
PSARV056 EQU   PSADSSF3                                                 03660000
PSARV055 EQU   PSADSSF3                                                 03661000
PSADSSMC EQU   PSADSSF3                                                 03662000
PSADSSRW EQU   PSADSSF3                                                 03663000
PSADSSNM EQU   PSADSSF3                                                 03664000
PSADSSES EQU   PSADSSF3                                                 03665000
PSADSSGP EQU   PSADSSF3                                                 03666000
PSADSSF2 EQU   PSADSSFL+1                                               03667000
PSADSSPI EQU   PSADSSF1                                                 03668000
PSADSSOI EQU   PSADSSF1                                                 03669000
PSADSSSP EQU   PSADSSF1                                                 03670000
PSADSSTP EQU   PSADSSF1                                                 03671000
PSADSSDW EQU   PSADSSF1                                                 03672000
PSADSSDD EQU   PSADSSF1                                                 03673000
PSADSSDM EQU   PSADSSF1                                                 03674000
PSADSSMV EQU   PSADSSF1                                                 03675000
PSADSSTS EQU   PSA+816                                                  03676000
PSADSSWK EQU   PSA+812                                                  03677000
PSADSSR3 EQU   PSA+808                                                  03678000
PSADSSR2 EQU   PSA+804                                                  03679000
PSADSSRS EQU   PSA+800                                                  03680000
PSASTOR  EQU   PSA+796                                                  03681000
PSACPUSA EQU   PSA+794                                                  03682000
PSAVSTAP EQU   PSA+792                                                  03683000
PSAWKVAP EQU   PSA+788                                                  03684000
PSAWKRAP EQU   PSA+784                                                  03685000
PSAMCHIC EQU   PSA+783                                                  03686000
PSARV061 EQU   PSA+782                                                  03687000
PSASYMSK EQU   PSA+781                                                  03688000
PSAMCHFL EQU   PSA+780                                                  03689000
PSACR0   EQU   PSA+776                                                  03690000
PSAPSWSV EQU   PSA+768                                                  03691000
PSACLHS  EQU   PSAHLHI                                                  03692000
PSALKR15 EQU   PSALKSA+60                                               03693000
PSALKR14 EQU   PSALKSA+56                                               03694000
PSALKR13 EQU   PSALKSA+52                                               03695000
PSALKR12 EQU   PSALKSA+48                                               03696000
PSALKR11 EQU   PSALKSA+44                                               03697000
PSALKR10 EQU   PSALKSA+40                                               03698000
PSALKR9  EQU   PSALKSA+36                                               03699000
PSALKR8  EQU   PSALKSA+32                                               03700000
PSALKR7  EQU   PSALKSA+28                                               03701000
PSALKR6  EQU   PSALKSA+24                                               03702000
PSALKR5  EQU   PSALKSA+20                                               03703000
PSALKR4  EQU   PSALKSA+16                                               03704000
PSALKR3  EQU   PSALKSA+12                                               03705000
PSALKR2  EQU   PSALKSA+8                                                03706000
PSALKR1  EQU   PSALKSA+4                                                03707000
PSALKR0  EQU   PSALKSA                                                  03708000
PSARV023 EQU   PSACLHT+52                                               03709000
PSALOCAL EQU   PSACLHT+48                                               03710000
PSACMSL  EQU   PSACLHT+44                                               03711000
PSAOPTL  EQU   PSACLHT+40                                               03712000
PSATPACL EQU   PSACLHT+36                                               03713000
PSATPDNL EQU   PSACLHT+32                                               03714000
PSATPNCL EQU   PSACLHT+28                                               03715000
PSAIOSLL EQU   PSACLHT+24                                               03716000
PSAIOSUL EQU   PSACLHT+20                                               03717000
PSAIOSCL EQU   PSACLHT+16                                               03718000
PSAIOSSL EQU   PSACLHT+12                                               03719000
PSASALCL EQU   PSACLHT+8                                                03720000
PSAASML  EQU   PSACLHT+4                                                03721000
PSADISPL EQU   PSACLHT                                                  03722000
PSASRSA  EQU   PSA+636                                                  03723000
PSARV050 EQU   PSA+634                                                  03724000
PSADSSGO EQU   PSA+633                                                  03725000
PSARECUR EQU   PSA+632                                                  03726000
PSAHLHIS EQU   PSA+628                                                  03727000
PSAIPCSA EQU   PSA+624                                                  03728000
@NM00024 EQU   PSA+621                                                  03729000
PSAIPCDM EQU   PSA+620                                                  03730000
PSAIPCD  EQU   PSA+616                                                  03731000
@NM00023 EQU   PSA+613                                                  03732000
PSAIPCRM EQU   PSA+612                                                  03733000
PSAIPCR  EQU   PSA+608                                                  03734000
PSAMCHEX EQU   PSA+600                                                  03735000
PSAMPSW  EQU   PSA+592                                                  03736000
PSAEXPS2 EQU   PSA+584                                                  03737000
PSAEXPS1 EQU   PSA+576                                                  03738000
PSAPIREG EQU   PSA+572                                                  03739000
PSARSREG EQU   PSA+568                                                  03740000
PSAGPREG EQU   PSA+556                                                  03741000
PSARV022 EQU   PSASUP4                                                  03742000
PSARV021 EQU   PSASUP4                                                  03743000
PSARV020 EQU   PSASUP4                                                  03744000
PSARV019 EQU   PSASUP4                                                  03745000
PSARV018 EQU   PSASUP4                                                  03746000
PSARV017 EQU   PSASUP4                                                  03747000
PSARV016 EQU   PSASUP4                                                  03748000
PSARV015 EQU   PSASUP4                                                  03749000
PSARV014 EQU   PSASUP3                                                  03750000
PSARV013 EQU   PSASUP3                                                  03751000
PSARV012 EQU   PSASUP3                                                  03752000
PSARV011 EQU   PSASUP3                                                  03753000
PSASPR   EQU   PSASUP3                                                  03754000
PSAPSREG EQU   PSASUP3                                                  03755000
PSAPI2   EQU   PSASUP3                                                  03756000
PSAIOSUP EQU   PSASUP3                                                  03757000
PSALCR   EQU   PSASUP2                                                  03758000
PSARTM   EQU   PSASUP2                                                  03759000
PSAACR   EQU   PSASUP2                                                  03760000
PSAIPCE2 EQU   PSASUP2                                                  03761000
PSAIPCES EQU   PSASUP2                                                  03762000
PSAIPCEC EQU   PSASUP2                                                  03763000
PSAGTF   EQU   PSASUP2                                                  03764000
PSAIPCRI EQU   PSASUP2                                                  03765000
PSARV063 EQU   PSASUP1                                                  03766000
PSATCTL  EQU   PSASUP1                                                  03767000
PSADISP  EQU   PSASUP1                                                  03768000
PSALOCK  EQU   PSASUP1                                                  03769000
PSAPI    EQU   PSASUP1                                                  03770000
PSAEXT   EQU   PSASUP1                                                  03771000
PSASVC   EQU   PSASUP1                                                  03772000
PSAIO    EQU   PSASUP1                                                  03773000
PSAAOLD  EQU   PSA+548                                                  03774000
PSAANEW  EQU   PSA+544                                                  03775000
PSATOLD  EQU   PSA+540                                                  03776000
PSATNEW  EQU   PSA+536                                                  03777000
PSALCCAR EQU   PSA+532                                                  03778000
PSALCCAV EQU   PSA+528                                                  03779000
PSAPCCAR EQU   PSA+524                                                  03780000
PSAPCCAV EQU   PSA+520                                                  03781000
PSACPULA EQU   PSA+518                                                  03782000
PSACPUPA EQU   PSA+516                                                  03783000
PSAPSA   EQU   PSA+512                                                  03784000
FLCHDEND EQU   PSA+512                                                  03785000
FLCCRSAV EQU   FLCMCLA+280                                              03786000
FLCGRSAV EQU   FLCMCLA+216                                              03787000
FLCFPSAV EQU   FLCMCLA+184                                              03788000
FLCFLA   EQU   FLCMCLA+88                                               03789000
FLCRGNCD EQU   FLCMCLA+84                                               03790000
FLCFSAA  EQU   FLCFSA+1                                                 03791000
@NM00022 EQU   FLCFSA                                                   03792000
@NM00021 EQU   FLCMCLA+72                                               03793000
FLCMCIC  EQU   FLCMCLA+64                                               03794000
@NM00020 EQU   FLCMCLA+20                                               03795000
FLCIOAA  EQU   FLCIOA+1                                                 03796000
@NM00019 EQU   FLCIOA                                                   03797000
@NM00018 EQU   FLCMCLA+15                                               03798000
@NM00017 EQU   FLCMCLA+14                                               03799000
@NM00016 EQU   FLCMCLA+12                                               03800000
FLCLCL   EQU   FLCMCLA+8                                                03801000
FLCIOELA EQU   FLCIOEL+1                                                03802000
@NM00015 EQU   FLCIOEL                                                  03803000
FLCCHNID EQU   FLCMCLA                                                  03804000
@NM00014 EQU   PSA+160                                                  03805000
FLCMTRCD EQU   PSA+157                                                  03806000
@NM00013 EQU   PSA+156                                                  03807000
FLCPERA  EQU   FLCPER+1                                                 03808000
@NM00012 EQU   FLCPER                                                   03809000
@NM00011 EQU   PSA+151                                                  03810000
FLCPERCD EQU   PSA+150                                                  03811000
FLCMCNUM EQU   PSA+149                                                  03812000
@NM00010 EQU   PSA+148                                                  03813000
FLCTEAA  EQU   FLCTEA+1                                                 03814000
@NM00009 EQU   FLCTEA                                                   03815000
PSAPIPC  EQU   PSAPICOD                                                 03816000
PSAPIMC  EQU   PSAPICOD                                                 03817000
PSAPIPER EQU   PSAPICOD                                                 03818000
PSARV049 EQU   FLCPICOD                                                 03819000
FLCPILCB EQU   FLCPIILC                                                 03820000
@NM00008 EQU   FLCPIILC                                                 03821000
@NM00007 EQU   PSAEPPSW                                                 03822000
FLCSVCN  EQU   PSAESPSW+2                                               03823000
FLCSILCB EQU   FLCSVILC                                                 03824000
@NM00006 EQU   FLCSVILC                                                 03825000
@NM00005 EQU   PSAESPSW                                                 03826000
FLCEICOD EQU   PSAEEPSW+2                                               03827000
PSASPAD  EQU   PSAEEPSW                                                 03828000
@NM00004 EQU   PSA+128                                                  03829000
FLCINPSW EQU   PSA+120                                                  03830000
FLCMNPSW EQU   PSA+112                                                  03831000
FLCPNPSW EQU   PSA+104                                                  03832000
FLCSNPSW EQU   PSA+96                                                   03833000
FLCENPSW EQU   PSA+88                                                   03834000
FLCTRACE EQU   PSA+84                                                   03835000
FLCTIMER EQU   PSA+80                                                   03836000
FLCCVT2  EQU   PSA+76                                                   03837000
FLCCAW   EQU   PSA+72                                                   03838000
FLCCSW   EQU   PSA+64                                                   03839000
FLCIOPSW EQU   PSA+56                                                   03840000
FLCMOPSW EQU   PSA+48                                                   03841000
FLCPOPSW EQU   PSA+40                                                   03842000
FLCSOPSW EQU   PSA+32                                                   03843000
FLCEOPSW EQU   PSA+24                                                   03844000
@NM00003 EQU   FLCICCW2+4                                               03845000
FLCCVT   EQU   FLCICCW2                                                 03846000
FLCICCW1 EQU   FLCROPSW                                                 03847000
FLCIPPSW EQU   FLCRNPSW                                                 03848000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03849000
@RT00342 EQU   ZR010200                                                 03850000
@ENDDATA EQU   *                                                        03851000
         END   ISTZRM01,(C'PLS1053',0702,78336)                         03852000
