         TITLE 'IFCDEVIC - DEVICE LOOKUP TABLE                         *00001000
                        '                                               00002000
IFCDEVIC CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCDEVIC  78.086'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  LA    @11,4095(,@12)                                      0001 00013000
         USING @PSTART,@12                                         0001 00014000
         USING @PSTART+4095,@11                                    0001 00015000
         ST    @13,@SA00001+4                                      0001 00016000
         LA    @14,@SA00001                                        0001 00017000
         ST    @14,8(,@13)                                         0001 00018000
         LR    @13,@14                                             0001 00019000
         MVC   @PC00001(12),0(@01)                                 0001 00020000
         B     @PB00002                                            0027 00021000
GENERIC  STM   @14,@02,12(@13)                                     0027 00022000
         STM   @04,@12,36(@13)                                     0027 00023000
*   FOUND = OFF;                                           /*@G51DGVS*/ 00024000
         NI    FOUND,B'01111111'                                   0028 00025000
*   USED = OFF;                                            /*@G51DGVS*/ 00026000
         NI    USED,B'01111111'                                    0029 00027000
*   IF REQCODE = 1 THEN                                            0030 00028000
         LA    @10,1                                               0030 00029000
         L     @02,@PC00001                                        0030 00030000
         C     @10,REQCODE(,@02)                                   0030 00031000
         BNE   @RF00030                                            0030 00032000
*     DO I = 1 TO DIM(DEVTABLE) BY 1 WHILE (FOUND = OFF);  /*@G51DGVS*/ 00033000
         LR    I,@10                                               0031 00034000
@DL00031 TM    FOUND,B'10000000'                                   0031 00035000
         BNZ   @DC00031                                            0031 00036000
*       IF IPDEVICE = DEVGENIC(I) THEN     /* FOUND AN ENTRY?        */ 00037000
         L     @10,@PC00001+4                                      0032 00038000
         LR    @15,I                                               0032 00039000
         MH    @15,@CH00553                                        0032 00040000
         LA    @14,DEVGENIC-13(@15)                                0032 00041000
         CLC   IPDEVICE(4,@10),0(@14)                              0032 00042000
         BNE   @RF00032                                            0032 00043000
*         IF DEVIUSED(I) = ON THEN         /* IF ALREADY USED        */ 00044000
         LA    @10,DEVIUSED-13(@15)                                0033 00045000
         TM    0(@10),B'10000000'                                  0033 00046000
         BNO   @RF00033                                            0033 00047000
*           USED = ON;                     /* NOTE           @G51DGVS*/ 00048000
         OI    USED,B'10000000'                                    0034 00049000
*         ELSE                                                     0035 00050000
*           DO;                                            /*@G51DGVS*/ 00051000
         B     @RC00033                                            0035 00052000
@RF00033 DS    0H                                                  0036 00053000
*             USED = OFF;                  /* VALID NON-USED ENTRY   */ 00054000
         NI    USED,B'01111111'                                    0036 00055000
*             FOUND = ON;                                  /*@G51DGVS*/ 00056000
         OI    FOUND,B'10000000'                                   0037 00057000
*             DEVIUSED(I) = ON;            /* MARK USED      @G51DGVS*/ 00058000
         LR    @10,I                                               0038 00059000
         MH    @10,@CH00553                                        0038 00060000
         LA    @01,DEVIUSED-13(@10)                                0038 00061000
         OI    0(@01),B'10000000'                                  0038 00062000
*             OPDEVICE = OPDEVICE && OPDEVICE;             /*@G51DGVS*/ 00063000
         L     @15,@PC00001+8                                      0039 00064000
         XC    OPDEVICE(4,@15),OPDEVICE(@15)                       0039 00065000
*             OPDEVICE(1:2) = DEVHEX(I);   /* OUTPUT VALUE   @G51DGVS*/ 00066000
         LA    @14,DEVHEX-13(@10)                                  0040 00067000
         MVC   OPDEVICE(2,@15),0(@14)                              0040 00068000
*           END;                                           /*@G51DGVS*/ 00069000
*     END;                                                 /*@G51DGVS*/ 00070000
@RC00033 DS    0H                                                  0042 00071000
@RF00032 AL    I,@CF00045                                          0042 00072000
         C     I,@CF00076                                          0042 00073000
         BNH   @DL00031                                            0042 00074000
@DC00031 DS    0H                                                  0043 00075000
*   ELSE                                                           0043 00076000
*     IF REQCODE = 11 THEN                                         0043 00077000
         B     @RC00030                                            0043 00078000
@RF00030 L     @10,@PC00001                                        0043 00079000
         CLC   REQCODE(4,@10),@CF00037                             0043 00080000
         BNE   @RF00043                                            0043 00081000
*       DO I = 1 TO DIM(MDRTABLE) BY 1 WHILE(FOUND = OFF); /*@G51DGVS*/ 00082000
         LA    I,1                                                 0044 00083000
@DL00044 TM    FOUND,B'10000000'                                   0044 00084000
         BNZ   @DC00044                                            0044 00085000
*         IF IPDEVICE = MDRGENIC(I) THEN   /* FOUND AND ENTRY?       */ 00086000
         L     @10,@PC00001+4                                      0045 00087000
         LR    @15,I                                               0045 00088000
         MH    @15,@CH00036                                        0045 00089000
         LA    @14,MDRGENIC-12(@15)                                0045 00090000
         CLC   IPDEVICE(4,@10),0(@14)                              0045 00091000
         BNE   @RF00045                                            0045 00092000
*           IF MDRIUSED(I) = ON THEN       /* IF ALREADY USED        */ 00093000
         LA    @10,MDRIUSED-12(@15)                                0046 00094000
         TM    0(@10),B'10000000'                                  0046 00095000
         BNO   @RF00046                                            0046 00096000
*             USED = ON;                   /* NOTE           @G51DGVS*/ 00097000
         OI    USED,B'10000000'                                    0047 00098000
*           ELSE                                                   0048 00099000
*             DO;                                          /*@G51DGVS*/ 00100000
         B     @RC00046                                            0048 00101000
@RF00046 DS    0H                                                  0049 00102000
*               USED = OFF;                /* VALID NON-USED @G51DGVS*/ 00103000
         NI    USED,B'01111111'                                    0049 00104000
*               FOUND = ON;                                /*@G51DGVS*/ 00105000
         OI    FOUND,B'10000000'                                   0050 00106000
*               MDRIUSED(I) = ON;          /* MARK USED      @G51DGVS*/ 00107000
         LR    @10,I                                               0051 00108000
         MH    @10,@CH00036                                        0051 00109000
         LA    @01,MDRIUSED-12(@10)                                0051 00110000
         OI    0(@01),B'10000000'                                  0051 00111000
*               OPDEVICE = OPDEVICE && OPDEVICE;           /*@G51DGVS*/ 00112000
         L     @15,@PC00001+8                                      0052 00113000
         XC    OPDEVICE(4,@15),OPDEVICE(@15)                       0052 00114000
*               OPDEVICE(1) = MDRHEX(I);   /* OUTPUT VALUE   @G51DGVS*/ 00115000
         LA    @14,MDRHEX-12(@10)                                  0053 00116000
         MVC   OPDEVICE(1,@15),0(@14)                              0053 00117000
*             END;                                         /*@G51DGVS*/ 00118000
*       END;                                               /*@G51DGVS*/ 00119000
@RC00046 DS    0H                                                  0055 00120000
@RF00045 AL    I,@CF00045                                          0055 00121000
         C     I,@CF00493                                          0055 00122000
         BNH   @DL00044                                            0055 00123000
@DC00044 DS    0H                                                  0056 00124000
*     ELSE                                                         0056 00125000
*       DO;                                                /*@G51DGVS*/ 00126000
         B     @RC00043                                            0056 00127000
@RF00043 DS    0H                                                  0057 00128000
*         RETCODE = TWELVE;            /* ERROR              @G51DGVS*/ 00129000
         LA    RETCODE,12                                          0057 00130000
*         FOUND = ON;                                      /*@G51DGVS*/ 00131000
         OI    FOUND,B'10000000'                                   0058 00132000
*         USED = ON;                                       /*@G51DGVS*/ 00133000
         OI    USED,B'10000000'                                    0059 00134000
*       END;                                               /*@G51DGVS*/ 00135000
*   IF FOUND = OFF THEN                                            0061 00136000
@RC00043 DS    0H                                                  0061 00137000
@RC00030 TM    FOUND,B'10000000'                                   0061 00138000
         BNZ   @RF00061                                            0061 00139000
*     RETCODE = EIGHT;                     /* NO ENTRIES     @G51DGVS*/ 00140000
         LA    RETCODE,8                                           0062 00141000
*   IF USED = ON THEN                                              0063 00142000
@RF00061 TM    USED,B'10000000'                                    0063 00143000
         BNO   @RF00063                                            0063 00144000
*     RETCODE = FOUR;                      /* ALL ENTRIES MARKED USED*/ 00145000
         LA    RETCODE,4                                           0064 00146000
* END;                                                     /*@G51DGVS*/ 00147000
@EL00002 DS    0H                                                  0065 00148000
@EF00002 DS    0H                                                  0065 00149000
@ER00002 LM    @14,@02,12(@13)                                     0065 00150000
         LM    @04,@12,36(@13)                                     0065 00151000
         BR    @14                                                 0065 00152000
*/********************************************************************/ 00153000
*/*                                                          @G51DGVS*/ 00154000
*/* LOOK UP THE DEVICE CLASS/TYPE.  IF FOUND, RETURN THE GENERIC OF  */ 00155000
*/* THE DEVICE.  IF REQCODE = 2 OR 12, MARK THE ENTRY USED.  @G51DGVS*/ 00156000
*/*                                                          @G51DGVS*/ 00157000
*/********************************************************************/ 00158000
*GENOUT: PROC;                                             /*@G51DGVS*/ 00159000
GENOUT   STM   @14,@02,12(@13)                                     0066 00160000
         STM   @04,@12,36(@13)                                     0066 00161000
*  FOUND = OFF;                                            /*@G51DGVS*/ 00162000
         NI    FOUND,B'01111111'                                   0067 00163000
*  IF REQCODE = 2 THEN                                             0068 00164000
         L     @10,@PC00001                                        0068 00165000
         CLC   REQCODE(4,@10),@CF00053                             0068 00166000
         BNE   @RF00068                                            0068 00167000
*    DO I = 1 TO DIM(DEVTABLE) BY 1 WHILE(FOUND = OFF);    /*@G51DGVS*/ 00168000
         LA    I,1                                                 0069 00169000
@DL00069 TM    FOUND,B'10000000'                                   0069 00170000
         BNZ   @DC00069                                            0069 00171000
*      IF IPDEVICE(1:2) = DEVHEX(I) &  DEVOUSED(I) = OFF THEN      0070 00172000
         L     @10,@PC00001+4                                      0070 00173000
         LR    @15,I                                               0070 00174000
         MH    @15,@CH00553                                        0070 00175000
         LA    @14,DEVHEX-13(@15)                                  0070 00176000
         CLC   IPDEVICE(2,@10),0(@14)                              0070 00177000
         BNE   @RF00070                                            0070 00178000
         LA    @10,DEVOUSED-13(@15)                                0070 00179000
         TM    0(@10),B'01000000'                                  0070 00180000
         BNZ   @RF00070                                            0070 00181000
*        DO;                       /* FOUND A NOT USED ENTRY @G51DGVS*/ 00182000
*          DEVOUSED(I) = ON;       /* MARK USED              @G51DGVS*/ 00183000
         LA    @10,DEVOUSED-13(@15)                                0072 00184000
         OI    0(@10),B'01000000'                                  0072 00185000
*          FOUND = ON;                                     /*@G51DGVS*/ 00186000
         OI    FOUND,B'10000000'                                   0073 00187000
*          OPDEVICE = DEVGENIC(I);  /* OUTPUT VALUE          @G51DGVS*/ 00188000
         L     @10,@PC00001+8                                      0074 00189000
         LA    @14,DEVGENIC-13(@15)                                0074 00190000
         MVC   OPDEVICE(4,@10),0(@14)                              0074 00191000
*        END;                                              /*@G51DGVS*/ 00192000
*    END;                                                  /*@G51DGVS*/ 00193000
@RF00070 AL    I,@CF00045                                          0076 00194000
         C     I,@CF00076                                          0076 00195000
         BNH   @DL00069                                            0076 00196000
@DC00069 DS    0H                                                  0077 00197000
*  ELSE                                                            0077 00198000
*    IF REQCODE = 12 THEN                                          0077 00199000
         B     @RC00068                                            0077 00200000
@RF00068 L     @10,@PC00001                                        0077 00201000
         CLC   REQCODE(4,@10),@CF00036                             0077 00202000
         BNE   @RF00077                                            0077 00203000
*      DO I = 1 TO DIM(MDRTABLE) BY 1 WHILE(FOUND = OFF);  /*@G51DGVS*/ 00204000
         LA    I,1                                                 0078 00205000
@DL00078 TM    FOUND,B'10000000'                                   0078 00206000
         BNZ   @DC00078                                            0078 00207000
*        IF IPDEVICE(1) = MDRHEX(I) & MDROUSED(I) = OFF THEN       0079 00208000
         L     @10,@PC00001+4                                      0079 00209000
         LR    @15,I                                               0079 00210000
         MH    @15,@CH00036                                        0079 00211000
         LA    @14,MDRHEX-12(@15)                                  0079 00212000
         CLC   IPDEVICE(1,@10),0(@14)                              0079 00213000
         BNE   @RF00079                                            0079 00214000
         LA    @10,MDROUSED-12(@15)                                0079 00215000
         TM    0(@10),B'01000000'                                  0079 00216000
         BNZ   @RF00079                                            0079 00217000
*          DO;                     /* FOUND A NOT USED ENTRY @G51DGVS*/ 00218000
*            MDROUSED(I) = ON;     /* MARK USED              @G51DGVS*/ 00219000
         LA    @10,MDROUSED-12(@15)                                0081 00220000
         OI    0(@10),B'01000000'                                  0081 00221000
*            FOUND = ON;                                   /*@G51DGVS*/ 00222000
         OI    FOUND,B'10000000'                                   0082 00223000
*            OPDEVICE = MDRGENIC(I);  /* OUTPUT VALUE        @G51DGVS*/ 00224000
         L     @10,@PC00001+8                                      0083 00225000
         LA    @14,MDRGENIC-12(@15)                                0083 00226000
         MVC   OPDEVICE(4,@10),0(@14)                              0083 00227000
*          END;                                            /*@G51DGVS*/ 00228000
*      END;                                                /*@G51DGVS*/ 00229000
@RF00079 AL    I,@CF00045                                          0085 00230000
         C     I,@CF00493                                          0085 00231000
         BNH   @DL00078                                            0085 00232000
@DC00078 DS    0H                                                  0086 00233000
*    ELSE                                                          0086 00234000
*      IF REQCODE = 22 THEN                                        0086 00235000
         B     @RC00077                                            0086 00236000
@RF00077 L     @10,@PC00001                                        0086 00237000
         CLC   REQCODE(4,@10),@CF00547                             0086 00238000
         BNE   @RF00086                                            0086 00239000
*        DO I = 1 TO DIM(DEVTABLE) BY 1 WHILE (FOUND = OFF);       0087 00240000
         LA    I,1                                                 0087 00241000
@DL00087 TM    FOUND,B'10000000'                                   0087 00242000
         BNZ   @DC00087                                            0087 00243000
*          IF IPDEVICE(1:2) = DEVHEX(I) THEN                       0088 00244000
         L     @10,@PC00001+4                                      0088 00245000
         LR    @15,I                                               0088 00246000
         MH    @15,@CH00553                                        0088 00247000
         LA    @14,DEVHEX-13(@15)                                  0088 00248000
         CLC   IPDEVICE(2,@10),0(@14)                              0088 00249000
         BNE   @RF00088                                            0088 00250000
*            DO;                   /* FOUND A NOT USED ENTRY @G51DGVS*/ 00251000
*              FOUND = ON;                                 /*@G51DGVS*/ 00252000
         OI    FOUND,B'10000000'                                   0090 00253000
*              OPDEVICE = DEVGENIC(I);  /* OUTPUT VALUE      @G51DGVS*/ 00254000
         L     @10,@PC00001+8                                      0091 00255000
         LA    @14,DEVGENIC-13(@15)                                0091 00256000
         MVC   OPDEVICE(4,@10),0(@14)                              0091 00257000
*            END;                                          /*@G51DGVS*/ 00258000
*        END;                                              /*@G51DGVS*/ 00259000
@RF00088 AL    I,@CF00045                                          0093 00260000
         C     I,@CF00076                                          0093 00261000
         BNH   @DL00087                                            0093 00262000
@DC00087 DS    0H                                                  0094 00263000
*      ELSE                                                        0094 00264000
*        IF REQCODE = 32 THEN                                      0094 00265000
         B     @RC00086                                            0094 00266000
@RF00086 L     @10,@PC00001                                        0094 00267000
         CLC   REQCODE(4,@10),@CF00548                             0094 00268000
         BNE   @RF00094                                            0094 00269000
*          DO I = 1 TO DIM(MDRTABLE) BY 1 WHILE (FOUND = OFF);     0095 00270000
         LA    I,1                                                 0095 00271000
@DL00095 TM    FOUND,B'10000000'                                   0095 00272000
         BNZ   @DC00095                                            0095 00273000
*            IF IPDEVICE(1) = MDRHEX(I) THEN                       0096 00274000
         L     @10,@PC00001+4                                      0096 00275000
         LR    @15,I                                               0096 00276000
         MH    @15,@CH00036                                        0096 00277000
         LA    @14,MDRHEX-12(@15)                                  0096 00278000
         CLC   IPDEVICE(1,@10),0(@14)                              0096 00279000
         BNE   @RF00096                                            0096 00280000
*              DO;                 /* FOUND A NOT USED ENTRY @G51DGVS*/ 00281000
*                FOUND = ON;                               /*@G51DGVS*/ 00282000
         OI    FOUND,B'10000000'                                   0098 00283000
*                OPDEVICE = MDRGENIC(I);  /* OUTPUT VALUE    @G51DGVS*/ 00284000
         L     @10,@PC00001+8                                      0099 00285000
         LA    @14,MDRGENIC-12(@15)                                0099 00286000
         MVC   OPDEVICE(4,@10),0(@14)                              0099 00287000
*              END;                                        /*@G51DGVS*/ 00288000
*          END;                                            /*@G51DGVS*/ 00289000
@RF00096 AL    I,@CF00045                                          0101 00290000
         C     I,@CF00493                                          0101 00291000
         BNH   @DL00095                                            0101 00292000
@DC00095 DS    0H                                                  0102 00293000
*        ELSE                                                      0102 00294000
*          DO;                                             /*@G51DGVS*/ 00295000
         B     @RC00094                                            0102 00296000
@RF00094 DS    0H                                                  0103 00297000
*            RETCODE = TWELVE;            /* ERROR           @G51DGVS*/ 00298000
         LA    RETCODE,12                                          0103 00299000
*            FOUND = ON;                                   /*@G51DGVS*/ 00300000
         OI    FOUND,B'10000000'                                   0104 00301000
*          END;                                            /*@G51DGVS*/ 00302000
*  IF FOUND = OFF THEN                                             0106 00303000
@RC00094 DS    0H                                                  0106 00304000
@RC00086 DS    0H                                                  0106 00305000
@RC00077 DS    0H                                                  0106 00306000
@RC00068 TM    FOUND,B'10000000'                                   0106 00307000
         BNZ   @RF00106                                            0106 00308000
*    RETCODE = EIGHT;              /* NO VALID ENTRY         @G51DGVS*/ 00309000
         LA    RETCODE,8                                           0107 00310000
* END;                                                     /*@G51DGVS*/ 00311000
@EL00003 DS    0H                                                  0108 00312000
@EF00003 DS    0H                                                  0108 00313000
@ER00003 LM    @14,@02,12(@13)                                     0108 00314000
         LM    @04,@12,36(@13)                                     0108 00315000
         BR    @14                                                 0108 00316000
*/********************************************************************/ 00317000
*/*                                                          @G51DGVS*/ 00318000
*/* LOOK UP THE DEVICE CLASS/TYPE.  IF FOUND, RETURN THE CONTROL     */ 00319000
*/* UNIT OF THE DEVICE.                                      @G51DGVS*/ 00320000
*/*                                                          @G51DGVS*/ 00321000
*/********************************************************************/ 00322000
*CONTUNIT:  PROC;                                          /*@G51DGVS*/ 00323000
CONTUNIT STM   @14,@02,12(@13)                                     0109 00324000
         STM   @04,@12,36(@13)                                     0109 00325000
*   FOUND = OFF;                                           /*@G51DGVS*/ 00326000
         NI    FOUND,B'01111111'                                   0110 00327000
*   IF REQCODE = 3 THEN                                            0111 00328000
         L     @10,@PC00001                                        0111 00329000
         CLC   REQCODE(4,@10),@CF00055                             0111 00330000
         BNE   @RF00111                                            0111 00331000
*     DO I = 1 TO DIM(DEVTABLE) BY 1 WHILE (FOUND = OFF);  /*@G51DGVS*/ 00332000
         LA    I,1                                                 0112 00333000
@DL00112 TM    FOUND,B'10000000'                                   0112 00334000
         BNZ   @DC00112                                            0112 00335000
*       IF IPDEVICE(1:2) = DEVHEX(I) THEN                          0113 00336000
         L     @10,@PC00001+4                                      0113 00337000
         LR    @15,I                                               0113 00338000
         MH    @15,@CH00553                                        0113 00339000
         LA    @14,DEVHEX-13(@15)                                  0113 00340000
         CLC   IPDEVICE(2,@10),0(@14)                              0113 00341000
         BNE   @RF00113                                            0113 00342000
*         DO;                              /* FOUND A VALID ENTRY    */ 00343000
*           FOUND = ON;                                    /*@G51DGVS*/ 00344000
         OI    FOUND,B'10000000'                                   0115 00345000
*           OPDEVICE = OPDEVICE && OPDEVICE;               /*@G51DGVS*/ 00346000
         L     @10,@PC00001+8                                      0116 00347000
         XC    OPDEVICE(4,@10),OPDEVICE(@10)                       0116 00348000
*           OPDEVICE(1:2) = DEVCUNIT(I);   /* OUTPUT VALUE   @G51DGVS*/ 00349000
         LA    @14,DEVCUNIT-13(@15)                                0117 00350000
         MVC   OPDEVICE(2,@10),0(@14)                              0117 00351000
*         END;                                             /*@G51DGVS*/ 00352000
*     END;                                                 /*@G51DGVS*/ 00353000
@RF00113 AL    I,@CF00045                                          0119 00354000
         C     I,@CF00076                                          0119 00355000
         BNH   @DL00112                                            0119 00356000
@DC00112 DS    0H                                                  0120 00357000
*   ELSE                                                           0120 00358000
*     IF REQCODE = 13 THEN                                         0120 00359000
         B     @RC00111                                            0120 00360000
@RF00111 L     @10,@PC00001                                        0120 00361000
         CLC   REQCODE(4,@10),@CF00553                             0120 00362000
         BNE   @RF00120                                            0120 00363000
*       DO I = 1 TO DIM(MDRTABLE) BY 1 WHILE ( FOUND = OFF);       0121 00364000
         LA    I,1                                                 0121 00365000
@DL00121 TM    FOUND,B'10000000'                                   0121 00366000
         BNZ   @DC00121                                            0121 00367000
*         IF IPDEVICE(1) = MDRHEX(I) THEN                          0122 00368000
         L     @10,@PC00001+4                                      0122 00369000
         LR    @15,I                                               0122 00370000
         MH    @15,@CH00036                                        0122 00371000
         LA    @14,MDRHEX-12(@15)                                  0122 00372000
         CLC   IPDEVICE(1,@10),0(@14)                              0122 00373000
         BNE   @RF00122                                            0122 00374000
*           DO;                            /* FOUND A VALID ENTRY    */ 00375000
*             FOUND = ON;                                  /*@G51DGVS*/ 00376000
         OI    FOUND,B'10000000'                                   0124 00377000
*             OPDEVICE = OPDEVICE && OPDEVICE;             /*@G51DGVS*/ 00378000
         L     @10,@PC00001+8                                      0125 00379000
         XC    OPDEVICE(4,@10),OPDEVICE(@10)                       0125 00380000
*             OPDEVICE(1:2) = MDRCUNIT(I);  /* OUTPUT VALUE  @G51DGVS*/ 00381000
         LA    @14,MDRCUNIT-12(@15)                                0126 00382000
         MVC   OPDEVICE(2,@10),0(@14)                              0126 00383000
*           END;                                           /*@G51DGVS*/ 00384000
*       END;                                               /*@G51DGVS*/ 00385000
@RF00122 AL    I,@CF00045                                          0128 00386000
         C     I,@CF00493                                          0128 00387000
         BNH   @DL00121                                            0128 00388000
@DC00121 DS    0H                                                  0129 00389000
*     ELSE                                                         0129 00390000
*       DO;                                                /*@G51DGVS*/ 00391000
         B     @RC00120                                            0129 00392000
@RF00120 DS    0H                                                  0130 00393000
*         RETCODE = TWELVE;               /* ERROR           @G51DGVS*/ 00394000
         LA    RETCODE,12                                          0130 00395000
*         FOUND = ON;                                      /*@G51DGVS*/ 00396000
         OI    FOUND,B'10000000'                                   0131 00397000
*       END;                                               /*@G51DGVS*/ 00398000
*   IF FOUND = OFF THEN                                            0133 00399000
@RC00120 DS    0H                                                  0133 00400000
@RC00111 TM    FOUND,B'10000000'                                   0133 00401000
         BNZ   @RF00133                                            0133 00402000
*     RETCODE = EIGHT;                   /* NO ENTRY         @G51DGVS*/ 00403000
         LA    RETCODE,8                                           0134 00404000
* END;                                                     /*@G51DGVS*/ 00405000
@EL00004 DS    0H                                                  0135 00406000
@EF00004 DS    0H                                                  0135 00407000
@ER00004 LM    @14,@02,12(@13)                                     0135 00408000
         LM    @04,@12,36(@13)                                     0135 00409000
         BR    @14                                                 0135 00410000
*/********************************************************************/ 00411000
*/*                                                          @G51DGVS*/ 00412000
*/* LOOK UP THE DEVICE CLASS/TYPE.  IF FOUND, RETURN THE GENERIC     */ 00413000
*/* NAME OF THE DEVICE IN HEX.                               @G51DGVS*/ 00414000
*/*                                                          @G51DGVS*/ 00415000
*/********************************************************************/ 00416000
*HEXOUT: PROC;                                             /*@G51DGVS*/ 00417000
HEXOUT   STM   @14,@02,12(@13)                                     0136 00418000
         STM   @04,@12,36(@13)                                     0136 00419000
*   FOUND = OFF;                                           /*@G51DGVS*/ 00420000
         NI    FOUND,B'01111111'                                   0137 00421000
*   IF REQCODE = 4 THEN                                            0138 00422000
         L     @10,@PC00001                                        0138 00423000
         CLC   REQCODE(4,@10),@CF00042                             0138 00424000
         BNE   @RF00138                                            0138 00425000
*     DO I = 1 TO DIM(DEVTABLE) BY 1 WHILE (FOUND = OFF);  /*@G51DGVS*/ 00426000
         LA    I,1                                                 0139 00427000
@DL00139 TM    FOUND,B'10000000'                                   0139 00428000
         BNZ   @DC00139                                            0139 00429000
*       IF IPDEVICE(1:2) = DEVHEX(I) THEN                          0140 00430000
         L     @10,@PC00001+4                                      0140 00431000
         LR    @15,I                                               0140 00432000
         MH    @15,@CH00553                                        0140 00433000
         LA    @14,DEVHEX-13(@15)                                  0140 00434000
         CLC   IPDEVICE(2,@10),0(@14)                              0140 00435000
         BNE   @RF00140                                            0140 00436000
*         DO;                              /* FOUND A VALID ENTRY    */ 00437000
*           FOUND = ON;                                    /*@G51DGVS*/ 00438000
         OI    FOUND,B'10000000'                                   0142 00439000
*           OPDEVICE = OPDEVICE && OPDEVICE;               /*@G51DGVS*/ 00440000
         L     @10,@PC00001+8                                      0143 00441000
         XC    OPDEVICE(4,@10),OPDEVICE(@10)                       0143 00442000
*           OPDEVICE(1:2) = DEVGHEX(I);    /* OUTPUT VALUE   @G51DGVS*/ 00443000
         LA    @14,DEVGHEX-13(@15)                                 0144 00444000
         MVC   OPDEVICE(2,@10),0(@14)                              0144 00445000
*         END;                                             /*@G51DGVS*/ 00446000
*     END;                                                 /*@G51DGVS*/ 00447000
@RF00140 AL    I,@CF00045                                          0146 00448000
         C     I,@CF00076                                          0146 00449000
         BNH   @DL00139                                            0146 00450000
@DC00139 DS    0H                                                  0147 00451000
*   ELSE                                                           0147 00452000
*     IF REQCODE = 14 THEN                                         0147 00453000
         B     @RC00138                                            0147 00454000
@RF00138 L     @10,@PC00001                                        0147 00455000
         CLC   REQCODE(4,@10),@CF00558                             0147 00456000
         BNE   @RF00147                                            0147 00457000
*       DO I = 1 TO DIM(MDRTABLE) BY 1 WHILE ( FOUND = OFF);       0148 00458000
         LA    I,1                                                 0148 00459000
@DL00148 TM    FOUND,B'10000000'                                   0148 00460000
         BNZ   @DC00148                                            0148 00461000
*         IF IPDEVICE(1) = MDRHEX(I) THEN                          0149 00462000
         L     @10,@PC00001+4                                      0149 00463000
         LR    @15,I                                               0149 00464000
         MH    @15,@CH00036                                        0149 00465000
         LA    @14,MDRHEX-12(@15)                                  0149 00466000
         CLC   IPDEVICE(1,@10),0(@14)                              0149 00467000
         BNE   @RF00149                                            0149 00468000
*           DO;                            /* FOUND A VALID ENTRY    */ 00469000
*             FOUND = ON;                                  /*@G51DGVS*/ 00470000
         OI    FOUND,B'10000000'                                   0151 00471000
*             OPDEVICE = OPDEVICE && OPDEVICE;             /*@G51DGVS*/ 00472000
         L     @10,@PC00001+8                                      0152 00473000
         XC    OPDEVICE(4,@10),OPDEVICE(@10)                       0152 00474000
*             OPDEVICE(1:2) = MDRGHEX(I);   /* OUTPUT VALUE  @G51DGVS*/ 00475000
         LA    @14,MDRGHEX-12(@15)                                 0153 00476000
         MVC   OPDEVICE(2,@10),0(@14)                              0153 00477000
*           END;                                           /*@G51DGVS*/ 00478000
*       END;                                               /*@G51DGVS*/ 00479000
@RF00149 AL    I,@CF00045                                          0155 00480000
         C     I,@CF00493                                          0155 00481000
         BNH   @DL00148                                            0155 00482000
@DC00148 DS    0H                                                  0156 00483000
*     ELSE                                                         0156 00484000
*       DO;                                                /*@G51DGVS*/ 00485000
         B     @RC00147                                            0156 00486000
@RF00147 DS    0H                                                  0157 00487000
*         RETCODE = TWELVE;               /* ERROR           @G51DGVS*/ 00488000
         LA    RETCODE,12                                          0157 00489000
*         FOUND = ON;                                      /*@G51DGVS*/ 00490000
         OI    FOUND,B'10000000'                                   0158 00491000
*       END;                                               /*@G51DGVS*/ 00492000
*   IF FOUND = OFF THEN                                            0160 00493000
@RC00147 DS    0H                                                  0160 00494000
@RC00138 TM    FOUND,B'10000000'                                   0160 00495000
         BNZ   @RF00160                                            0160 00496000
*     RETCODE = EIGHT;                   /* NO ENTRY         @G51DGVS*/ 00497000
         LA    RETCODE,8                                           0161 00498000
* END;                                                     /*@G51DGVS*/ 00499000
@EL00005 DS    0H                                                  0162 00500000
@EF00005 DS    0H                                                  0162 00501000
@ER00005 LM    @14,@02,12(@13)                                     0162 00502000
         LM    @04,@12,36(@13)                                     0162 00503000
         BR    @14                                                 0162 00504000
*/********************************************************************/ 00505000
*/*                                                          @G51DGVS*/ 00506000
*/* LOOK UP THE GENERIC OF THE DEVICE, IF IT IS GIVEN AS NNXX, SUCH  */ 00507000
*/* AS 33XX.  IF FOUND AND ALREADY USED, RETURN WITH A CODE OF 4.    */ 00508000
*/* IF FOUND AND NOT USED, RETURN THE DEVICE CLASS/TYPE OR THE MDR   */ 00509000
*/* DEVICE CODE.  IF NOT FOUND, RETURN A CODE OF 8.  THE CALLING     */ 00510000
*/* ROUTINE IS RESPONSIBLE FOR CHECKING WHETHER THE USED OR NOT      */ 00511000
*/* FOUND RETURN CODE IS VALID OR INVALID.                   @G51DGVS*/ 00512000
*/*                                                          @G51DGVS*/ 00513000
*/********************************************************************/ 00514000
*GENXX:  PROC;                                             /*@G51DGVS*/ 00515000
GENXX    STM   @14,@02,12(@13)                                     0163 00516000
         STM   @04,@12,36(@13)                                     0163 00517000
*   FOUND = OFF;                                           /*@G51DGVS*/ 00518000
         NI    FOUND,B'01111111'                                   0164 00519000
*   USED = OFF;                                            /*@G51DGVS*/ 00520000
         NI    USED,B'01111111'                                    0165 00521000
*   IF REQCODE = 5 THEN                                            0166 00522000
         L     @10,@PC00001                                        0166 00523000
         CLC   REQCODE(4,@10),@CF00058                             0166 00524000
         BNE   @RF00166                                            0166 00525000
*     DO I = 1 TO DIM(DEVTABLE) BY 1 WHILE (FOUND = OFF);  /*@G51DGVS*/ 00526000
         LA    I,1                                                 0167 00527000
@DL00167 TM    FOUND,B'10000000'                                   0167 00528000
         BNZ   @DC00167                                            0167 00529000
*       IF IPDEVICE(1:2) = DEVGENXX(I) THEN                        0168 00530000
         L     @10,@PC00001+4                                      0168 00531000
         LR    @15,I                                               0168 00532000
         MH    @15,@CH00553                                        0168 00533000
         LA    @14,DEVGENXX-13(@15)                                0168 00534000
         CLC   IPDEVICE(2,@10),0(@14)                              0168 00535000
         BNE   @RF00168                                            0168 00536000
*         IF DEVIUSED(I) = ON THEN         /* FOUND A USED ENTRY     */ 00537000
         LA    @10,DEVIUSED-13(@15)                                0169 00538000
         TM    0(@10),B'10000000'                                  0169 00539000
         BNO   @RF00169                                            0169 00540000
*           DO;                                            /*@G51DGVS*/ 00541000
*             FOUND = ON;                                  /*@G51DGVS*/ 00542000
         OI    FOUND,B'10000000'                                   0171 00543000
*             USED = ON;                                   /*@G51DGVS*/ 00544000
         OI    USED,B'10000000'                                    0172 00545000
*           END;                                           /*@G51DGVS*/ 00546000
*         ELSE                                                     0174 00547000
*           DO;                            /* FOUND A VALID ENTRY    */ 00548000
         B     @RC00169                                            0174 00549000
@RF00169 DS    0H                                                  0175 00550000
*             FOUND = ON;                                  /*@G51DGVS*/ 00551000
         OI    FOUND,B'10000000'                                   0175 00552000
*             USED = OFF;                                  /*@G51DGVS*/ 00553000
         NI    USED,B'01111111'                                    0176 00554000
*             OPDEVICE = OPDEVICE && OPDEVICE;             /*@G51DGVS*/ 00555000
         L     @10,@PC00001+8                                      0177 00556000
         XC    OPDEVICE(4,@10),OPDEVICE(@10)                       0177 00557000
*             OPDEVICE (1:2) = DEVHEX(I);                  /*@G51DGVS*/ 00558000
         LR    @15,I                                               0178 00559000
         MH    @15,@CH00553                                        0178 00560000
         LA    @14,DEVHEX-13(@15)                                  0178 00561000
         MVC   OPDEVICE(2,@10),0(@14)                              0178 00562000
*             DEVIUSED(I) = ON;                            /*@G51DGVS*/ 00563000
         LA    @10,DEVIUSED-13(@15)                                0179 00564000
         OI    0(@10),B'10000000'                                  0179 00565000
*             DEVGENXX(I) = HEXZERO;                       /*@G51DGVS*/ 00566000
         LA    @10,DEVGENXX-13(@15)                                0180 00567000
         MVC   0(2,@10),@CB00066                                   0180 00568000
*           END;                                           /*@G51DGVS*/ 00569000
*     END;                                                 /*@G51DGVS*/ 00570000
@RC00169 DS    0H                                                  0182 00571000
@RF00168 AL    I,@CF00045                                          0182 00572000
         C     I,@CF00076                                          0182 00573000
         BNH   @DL00167                                            0182 00574000
@DC00167 DS    0H                                                  0183 00575000
*   ELSE                                                           0183 00576000
*     IF REQCODE = 15 THEN                                         0183 00577000
         B     @RC00166                                            0183 00578000
@RF00166 L     @10,@PC00001                                        0183 00579000
         CLC   REQCODE(4,@10),@CF00035                             0183 00580000
         BNE   @RF00183                                            0183 00581000
*       DO I = 1 TO DIM(MDRTABLE) BY 1 WHILE(FOUND = OFF); /*@G51DGVS*/ 00582000
         LA    I,1                                                 0184 00583000
@DL00184 TM    FOUND,B'10000000'                                   0184 00584000
         BNZ   @DC00184                                            0184 00585000
*         IF IPDEVICE(1:2) = MDRGENXX(I) THEN                      0185 00586000
         L     @10,@PC00001+4                                      0185 00587000
         LR    @15,I                                               0185 00588000
         MH    @15,@CH00036                                        0185 00589000
         LA    @14,MDRGENXX-12(@15)                                0185 00590000
         CLC   IPDEVICE(2,@10),0(@14)                              0185 00591000
         BNE   @RF00185                                            0185 00592000
*           IF MDRIUSED(I) = ON THEN                               0186 00593000
         LA    @10,MDRIUSED-12(@15)                                0186 00594000
         TM    0(@10),B'10000000'                                  0186 00595000
         BNO   @RF00186                                            0186 00596000
*             DO;                                          /*@G51DGVS*/ 00597000
*               USED = ON;                 /* FOUND A USED ENTRY     */ 00598000
         OI    USED,B'10000000'                                    0188 00599000
*               FOUND = ON;                                /*@G51DGVS*/ 00600000
         OI    FOUND,B'10000000'                                   0189 00601000
*             END;                                         /*@G51DGVS*/ 00602000
*           ELSE                                                   0191 00603000
*             DO;                                          /*@G51DGVS*/ 00604000
         B     @RC00186                                            0191 00605000
@RF00186 DS    0H                                                  0192 00606000
*               USED = OFF;                /* FOUND A VALID ENTRY    */ 00607000
         NI    USED,B'01111111'                                    0192 00608000
*               FOUND = ON;                                /*@G51DGVS*/ 00609000
         OI    FOUND,B'10000000'                                   0193 00610000
*               OPDEVICE = OPDEVICE && OPDEVICE;           /*@G51DGVS*/ 00611000
         L     @10,@PC00001+8                                      0194 00612000
         XC    OPDEVICE(4,@10),OPDEVICE(@10)                       0194 00613000
*               OPDEVICE (1) = MDRHEX(I);                  /*@G51DGVS*/ 00614000
         LR    @15,I                                               0195 00615000
         MH    @15,@CH00036                                        0195 00616000
         LA    @14,MDRHEX-12(@15)                                  0195 00617000
         MVC   OPDEVICE(1,@10),0(@14)                              0195 00618000
*               MDRIUSED(I) = ON;                          /*@G51DGVS*/ 00619000
         LA    @10,MDRIUSED-12(@15)                                0196 00620000
         OI    0(@10),B'10000000'                                  0196 00621000
*               MDRGENXX(I) = HEXZERO;                     /*@G51DGVS*/ 00622000
         LA    @10,MDRGENXX-12(@15)                                0197 00623000
         MVC   0(2,@10),@CB00066                                   0197 00624000
*             END;                                         /*@G51DGVS*/ 00625000
*       END;                                               /*@G51DGVS*/ 00626000
@RC00186 DS    0H                                                  0199 00627000
@RF00185 AL    I,@CF00045                                          0199 00628000
         C     I,@CF00493                                          0199 00629000
         BNH   @DL00184                                            0199 00630000
@DC00184 DS    0H                                                  0200 00631000
*     ELSE                                                         0200 00632000
*       DO;                                                /*@G51DGVS*/ 00633000
         B     @RC00183                                            0200 00634000
@RF00183 DS    0H                                                  0201 00635000
*         RETCODE = TWELVE;                                /*@G51DGVS*/ 00636000
         LA    RETCODE,12                                          0201 00637000
*         FOUND = ON;                                      /*@G51DGVS*/ 00638000
         OI    FOUND,B'10000000'                                   0202 00639000
*       END;                                               /*@G51DGVS*/ 00640000
*   IF FOUND = OFF THEN                                            0204 00641000
@RC00183 DS    0H                                                  0204 00642000
@RC00166 TM    FOUND,B'10000000'                                   0204 00643000
         BNZ   @RF00204                                            0204 00644000
*     RETCODE = EIGHT;                                     /*@G51DGVS*/ 00645000
         LA    RETCODE,8                                           0205 00646000
*   IF USED = ON THEN                                              0206 00647000
@RF00204 TM    USED,B'10000000'                                    0206 00648000
         BNO   @RF00206                                            0206 00649000
*     RETCODE = FOUR;                                      /*@G51DGVS*/ 00650000
         LA    RETCODE,4                                           0207 00651000
* END;                                                     /*@G51DGVS*/ 00652000
@EL00006 DS    0H                                                  0208 00653000
@EF00006 DS    0H                                                  0208 00654000
@ER00006 LM    @14,@02,12(@13)                                     0208 00655000
         LM    @04,@12,36(@13)                                     0208 00656000
         BR    @14                                                 0208 00657000
@PB00006 DS    0H                                                  0209 00658000
*/********************************************************************/ 00659000
*/*                                                          @G51DGVS*/ 00660000
*/* DETERMINE THE TYPE OF INPUT REQUEST AND GO TO THE PROPER LOOKUP. */ 00661000
*/* INPUT:   REQCODE       IPDEVICE          OPDEVICE        @G51DGVS*/ 00662000
*/*                                                          @G51DGVS*/ 00663000
*/*             1          GENERIC         OBR DEVICE CLASS/TYPE     */ 00664000
*/*            11          GENERIC         MDR DEVICE CODE   @G51DGVS*/ 00665000
*/*             2        OBR DEVICE CLASS  GENERIC           @G51DGVS*/ 00666000
*/*            12        MDR DEVICE CODE   GENERIC           @G51DGVS*/ 00667000
*/*            22        OBR DEVICE CLASS  GENERIC           @G51DGVS*/ 00668000
*/*            32        MDR DEVICE CODE   GENERIC           @G51DGVS*/ 00669000
*/*             3        OBR DEVICE CLASS  CONTROL UNIT      @G51DGVS*/ 00670000
*/*            13        MDR DEVICE CODE   CONTROL UNIT      @G51DGVS*/ 00671000
*/*             4        OBR DEVICE CLASS  GENERIC IN HEX    @G51DGVS*/ 00672000
*/*            14        MDR DEVICE CODE   GENERIC IN HEX    @G51DGVS*/ 00673000
*/*             5        GENERIC(NNXX)     OBR DEVICE CLASS/TYPE     */ 00674000
*/*            15        GENERIC(NNXX)     MDR DEVICE CODE   @G51DGVS*/ 00675000
*/*                                                          @G51DGVS*/ 00676000
*/********************************************************************/ 00677000
* RETCODE = ZERO;                   /* CLEAR RETURN CODE     @G51DGVS*/ 00678000
         SLR   RETCODE,RETCODE                                     0209 00679000
* REQUEST = REQCODE - (REQCODE/TEN)*TEN;                   /*@G51DGVS*/ 00680000
         L     @10,@PC00001                                        0210 00681000
         L     @10,REQCODE(,@10)                                   0210 00682000
         LA    @15,10                                              0210 00683000
         LR    @00,@10                                             0210 00684000
         SRDA  @00,32                                              0210 00685000
         DR    @00,@15                                             0210 00686000
         MR    @00,@15                                             0210 00687000
         SLR   @10,@01                                             0210 00688000
         LR    REQUEST,@10                                         0210 00689000
* IF REQUEST = ONE THEN                                            0211 00690000
         C     REQUEST,@CF00045                                    0211 00691000
         BNE   @RF00211                                            0211 00692000
*   CALL GENERIC;                   /* INPUT IS GENERIC      @G51DGVS*/ 00693000
         BAL   @14,GENERIC                                         0212 00694000
* ELSE                                                             0213 00695000
*   IF REQUEST = TWO THEN                                          0213 00696000
         B     @RC00211                                            0213 00697000
@RF00211 C     REQUEST,@CF00053                                    0213 00698000
         BNE   @RF00213                                            0213 00699000
*     CALL GENOUT;                  /* OUTPUT IS TO BE A GENERIC     */ 00700000
         BAL   @14,GENOUT                                          0214 00701000
*   ELSE                                                           0215 00702000
*     IF REQUEST = THREE THEN                                      0215 00703000
         B     @RC00213                                            0215 00704000
@RF00213 C     REQUEST,@CF00055                                    0215 00705000
         BNE   @RF00215                                            0215 00706000
*       CALL CONTUNIT;              /* OUTPUT IS TO BE CONTROL UNIT  */ 00707000
         BAL   @14,CONTUNIT                                        0216 00708000
*     ELSE                                                         0217 00709000
*       IF REQUEST = FOUR THEN                                     0217 00710000
         B     @RC00215                                            0217 00711000
@RF00215 C     REQUEST,@CF00042                                    0217 00712000
         BNE   @RF00217                                            0217 00713000
*         CALL HEXOUT;              /* OUTPUT IS GENERIC IN HEX      */ 00714000
         BAL   @14,HEXOUT                                          0218 00715000
*       ELSE                                                       0219 00716000
*         IF REQUEST = FIVE THEN                                   0219 00717000
         B     @RC00217                                            0219 00718000
@RF00217 C     REQUEST,@CF00058                                    0219 00719000
         BNE   @RF00219                                            0219 00720000
*           CALL GENXX;             /* INPUT IS GENERIC AS NNXX      */ 00721000
         BAL   @14,GENXX                                           0220 00722000
*         ELSE                                                     0221 00723000
*           RETCODE = TWELVE;                              /*@G51DGVS*/ 00724000
         B     @RC00219                                            0221 00725000
@RF00219 LA    RETCODE,12                                          0221 00726000
* RESPECIFY (R15) RESTRICTED;                              /*@G51DGVS*/ 00727000
@RC00219 DS    0H                                                  0222 00728000
@RC00217 DS    0H                                                  0222 00729000
@RC00215 DS    0H                                                  0222 00730000
@RC00213 DS    0H                                                  0222 00731000
@RC00211 DS    0H                                                  0223 00732000
* R15 = RETCODE;                                           /*@G51DGVS*/ 00733000
         LR    R15,RETCODE                                         0223 00734000
* RETURN;                                                  /*@G51DGVS*/ 00735000
@EL00001 L     @13,4(,@13)                                         0224 00736000
@EF00001 DS    0H                                                  0224 00737000
@ER00001 L     @14,12(,@13)                                        0224 00738000
         LM    @00,@12,20(@13)                                     0224 00739000
         BR    @14                                                 0224 00740000
* RESPECIFY (R15) UNRESTRICTED;                            /*@G51DGVS*/ 00741000
* END;                                                     /*@G51DGVS*/ 00742000
@DATA    DS    0H                                                       00743000
         DS    0F                                                       00744000
@SA00001 DS    18F                                                      00745000
@PC00001 DS    3F                                                       00746000
         DS    0F                                                       00747000
@CF00045 DC    F'1'                                                     00748000
@CF00053 DC    F'2'                                                     00749000
@CF00055 DC    F'3'                                                     00750000
@CF00042 DC    F'4'                                                     00751000
@CF00058 DC    F'5'                                                     00752000
@CF00037 DC    F'11'                                                    00753000
@CF00036 DC    F'12'                                                    00754000
@CH00036 EQU   @CF00036+2                                               00755000
@CF00553 DC    F'13'                                                    00756000
@CH00553 EQU   @CF00553+2                                               00757000
@CF00558 DC    F'14'                                                    00758000
@CF00035 DC    F'15'                                                    00759000
@CF00547 DC    F'22'                                                    00760000
@CF00493 DC    F'27'                                                    00761000
@CF00548 DC    F'32'                                                    00762000
@CF00076 DC    F'167'                                                   00763000
         DS    0D                                                       00764000
@CB00066 DC    X'0000'                                                  00765000
FOUND    DC    B'00000000'                                              00766000
USED     DC    B'00000000'                                              00767000
PATCH    DC    40X'00'                                                  00768000
DEVTABLE DS    CL13                                                     00769000
         ORG   DEVTABLE+0                                               00770000
DEVGENIC DC    CL4'2540'                                                00771000
DEVGHEX  DC    X'2540'                                                  00772000
DEVCUNIT DC    X'2540'                                                  00773000
DEVHEX   DC    X'0801'                                                  00774000
DEVGENXX DC    CL2'25'                                                  00775000
@NM00001 DC    X'00'                                                    00776000
         ORG   @NM00001+0                                               00777000
DEVIUSED DS    BL1                                                      00778000
DEVOUSED EQU   @NM00001+0                                               00779000
         ORG   DEVTABLE+13                                              00780000
         ORG   DEVTABLE+13                                              00781000
         DC    CL4'2540'                                                00782000
         DC    X'2540'                                                  00783000
         DC    X'2540'                                                  00784000
         DC    X'0802'                                                  00785000
         DC    CL2'25'                                                  00786000
         DC    X'00'                                                    00787000
         ORG   DEVTABLE+26                                              00788000
         ORG   DEVTABLE+26                                              00789000
         DC    CL4'1442'                                                00790000
         DC    X'1442'                                                  00791000
         DC    X'1442'                                                  00792000
         DC    X'0803'                                                  00793000
         DC    CL2'14'                                                  00794000
         DC    X'00'                                                    00795000
         ORG   DEVTABLE+39                                              00796000
         ORG   DEVTABLE+39                                              00797000
         DC    CL4'2501'                                                00798000
         DC    X'2501'                                                  00799000
         DC    X'2501'                                                  00800000
         DC    X'0804'                                                  00801000
         DC    CL2'25'                                                  00802000
         DC    X'00'                                                    00803000
         ORG   DEVTABLE+52                                              00804000
         ORG   DEVTABLE+52                                              00805000
         DC    CL4'2520'                                                00806000
         DC    X'2520'                                                  00807000
         DC    X'2520'                                                  00808000
         DC    X'0805'                                                  00809000
         DC    CL2'25'                                                  00810000
         DC    X'00'                                                    00811000
         ORG   DEVTABLE+65                                              00812000
         ORG   DEVTABLE+65                                              00813000
         DC    CL4'3505'                                                00814000
         DC    X'3505'                                                  00815000
         DC    X'3505'                                                  00816000
         DC    X'0806'                                                  00817000
         DC    CL2'35'                                                  00818000
         DC    X'00'                                                    00819000
         ORG   DEVTABLE+78                                              00820000
         ORG   DEVTABLE+78                                              00821000
         DC    CL4'3525'                                                00822000
         DC    X'3525'                                                  00823000
         DC    X'3525'                                                  00824000
         DC    X'0807'                                                  00825000
         DC    CL2'35'                                                  00826000
         DC    X'00'                                                    00827000
         ORG   DEVTABLE+91                                              00828000
         ORG   DEVTABLE+91                                              00829000
         DC    CL4'1403'                                                00830000
         DC    X'1403'                                                  00831000
         DC    X'1403'                                                  00832000
         DC    X'0808'                                                  00833000
         DC    CL2'14'                                                  00834000
         DC    X'00'                                                    00835000
         ORG   DEVTABLE+104                                             00836000
         ORG   DEVTABLE+104                                             00837000
         DC    CL4'3211'                                                00838000
         DC    X'3211'                                                  00839000
         DC    X'3211'                                                  00840000
         DC    X'0809'                                                  00841000
         DC    CL2'32'                                                  00842000
         DC    X'00'                                                    00843000
         ORG   DEVTABLE+117                                             00844000
         ORG   DEVTABLE+117                                             00845000
         DC    CL4'1443'                                                00846000
         DC    X'1443'                                                  00847000
         DC    X'1443'                                                  00848000
         DC    X'080A'                                                  00849000
         DC    CL2'14'                                                  00850000
         DC    X'00'                                                    00851000
         ORG   DEVTABLE+130                                             00852000
         ORG   DEVTABLE+130                                             00853000
         DC    CL4'3203'                                                00854000
         DC    X'3203'                                                  00855000
         DC    X'3203'                                                  00856000
         DC    X'080B'                                                  00857000
         DC    CL2'32'                                                  00858000
         DC    X'00'                                                    00859000
         ORG   DEVTABLE+143                                             00860000
         ORG   DEVTABLE+143                                             00861000
         DC    CL4'3525'                                                00862000
         DC    X'3525'                                                  00863000
         DC    X'3525'                                                  00864000
         DC    X'080C'                                                  00865000
         DC    CL2'35'                                                  00866000
         DC    X'00'                                                    00867000
         ORG   DEVTABLE+156                                             00868000
         ORG   DEVTABLE+156                                             00869000
         DC    CL4'2245'                                                00870000
         DC    X'2245'                                                  00871000
         DC    X'2245'                                                  00872000
         DC    X'080D'                                                  00873000
         DC    CL2'22'                                                  00874000
         DC    X'00'                                                    00875000
         ORG   DEVTABLE+169                                             00876000
         ORG   DEVTABLE+169                                             00877000
         DC    CL4'3800'                                                00878000
         DC    X'3800'                                                  00879000
         DC    X'3800'                                                  00880000
         DC    X'080E'                                                  00881000
         DC    CL2'38'                                                  00882000
         DC    X'00'                                                    00883000
         ORG   DEVTABLE+182                                             00884000
         ORG   DEVTABLE+182                                             00885000
         DC    CL4'2671'                                                00886000
         DC    X'2671'                                                  00887000
         DC    X'2671'                                                  00888000
         DC    X'0810'                                                  00889000
         DC    CL2'26'                                                  00890000
         DC    X'00'                                                    00891000
         ORG   DEVTABLE+195                                             00892000
         ORG   DEVTABLE+195                                             00893000
         DC    CL4'1012'                                                00894000
         DC    X'1012'                                                  00895000
         DC    X'1012'                                                  00896000
         DC    X'0812'                                                  00897000
         DC    CL2'10'                                                  00898000
         DC    X'00'                                                    00899000
         ORG   DEVTABLE+208                                             00900000
         ORG   DEVTABLE+208                                             00901000
         DC    CL4'2947'                                                00902000
         DC    X'2947'                                                  00903000
         DC    X'2947'                                                  00904000
         DC    X'0814'                                                  00905000
         DC    CL2'29'                                                  00906000
         DC    X'00'                                                    00907000
         ORG   DEVTABLE+221                                             00908000
         ORG   DEVTABLE+221                                             00909000
         DC    CL4'3890'                                                00910000
         DC    X'3890'                                                  00911000
         DC    X'3890'                                                  00912000
         DC    X'0816'                                                  00913000
         DC    CL2'38'                                                  00914000
         DC    X'00'                                                    00915000
         ORG   DEVTABLE+234                                             00916000
         ORG   DEVTABLE+234                                             00917000
         DC    CL4'3886'                                                00918000
         DC    X'3886'                                                  00919000
         DC    X'3886'                                                  00920000
         DC    X'0817'                                                  00921000
         DC    CL2'38'                                                  00922000
         DC    X'00'                                                    00923000
         ORG   DEVTABLE+247                                             00924000
         ORG   DEVTABLE+247                                             00925000
         DC    CL4'2495'                                                00926000
         DC    X'2495'                                                  00927000
         DC    X'3881'                                                  00928000
         DC    X'0818'                                                  00929000
         DC    CL2'24'                                                  00930000
         DC    X'00'                                                    00931000
         ORG   DEVTABLE+260                                             00932000
         ORG   DEVTABLE+260                                             00933000
         DC    CL4'3895'                                                00934000
         DC    X'3895'                                                  00935000
         DC    X'3895'                                                  00936000
         DC    X'0819'                                                  00937000
         DC    CL2'38'                                                  00938000
         DC    X'00'                                                    00939000
         ORG   DEVTABLE+273                                             00940000
         ORG   DEVTABLE+273                                             00941000
         DC    CL4'1285'                                                00942000
         DC    X'1285'                                                  00943000
         DC    X'1285'                                                  00944000
         DC    X'081A'                                                  00945000
         DC    CL2'12'                                                  00946000
         DC    X'00'                                                    00947000
         ORG   DEVTABLE+286                                             00948000
         ORG   DEVTABLE+286                                             00949000
         DC    CL4'1287'                                                00950000
         DC    X'1287'                                                  00951000
         DC    X'1287'                                                  00952000
         DC    X'081B'                                                  00953000
         DC    CL2'12'                                                  00954000
         DC    X'00'                                                    00955000
         ORG   DEVTABLE+299                                             00956000
         ORG   DEVTABLE+299                                             00957000
         DC    CL4'1288'                                                00958000
         DC    X'1288'                                                  00959000
         DC    X'1288'                                                  00960000
         DC    X'081C'                                                  00961000
         DC    CL2'12'                                                  00962000
         DC    X'00'                                                    00963000
         ORG   DEVTABLE+312                                             00964000
         ORG   DEVTABLE+312                                             00965000
         DC    CL4'1419'                                                00966000
         DC    X'1419'                                                  00967000
         DC    X'1419'                                                  00968000
         DC    X'081D'                                                  00969000
         DC    CL2'14'                                                  00970000
         DC    X'00'                                                    00971000
         ORG   DEVTABLE+325                                             00972000
         ORG   DEVTABLE+325                                             00973000
         DC    CL4'1419'                                                00974000
         DC    X'1419'                                                  00975000
         DC    X'1419'                                                  00976000
         DC    X'081E'                                                  00977000
         DC    CL2'14'                                                  00978000
         DC    X'00'                                                    00979000
         ORG   DEVTABLE+338                                             00980000
         ORG   DEVTABLE+338                                             00981000
         DC    CL4'1275'                                                00982000
         DC    X'1275'                                                  00983000
         DC    X'1275'                                                  00984000
         DC    X'081E'                                                  00985000
         DC    CL2'12'                                                  00986000
         DC    X'00'                                                    00987000
         ORG   DEVTABLE+351                                             00988000
         ORG   DEVTABLE+351                                             00989000
         DC    CL4'1275'                                                00990000
         DC    X'1275'                                                  00991000
         DC    X'1275'                                                  00992000
         DC    X'081F'                                                  00993000
         DC    CL2'12'                                                  00994000
         DC    X'00'                                                    00995000
         ORG   DEVTABLE+364                                             00996000
         ORG   DEVTABLE+364                                             00997000
         DC    CL4'1052'                                                00998000
         DC    X'1052'                                                  00999000
         DC    X'1052'                                                  01000000
         DC    X'0820'                                                  01001000
         DC    CL2'10'                                                  01002000
         DC    X'00'                                                    01003000
         ORG   DEVTABLE+377                                             01004000
         ORG   DEVTABLE+377                                             01005000
         DC    CL4'2150'                                                01006000
         DC    X'2150'                                                  01007000
         DC    X'2150'                                                  01008000
         DC    X'0821'                                                  01009000
         DC    CL2'21'                                                  01010000
         DC    X'00'                                                    01011000
         ORG   DEVTABLE+390                                             01012000
         ORG   DEVTABLE+390                                             01013000
         DC    CL4'3210'                                                01014000
         DC    X'3210'                                                  01015000
         DC    X'3210'                                                  01016000
         DC    X'0822'                                                  01017000
         DC    CL2'32'                                                  01018000
         DC    X'00'                                                    01019000
         ORG   DEVTABLE+403                                             01020000
         ORG   DEVTABLE+403                                             01021000
         DC    CL4'1255'                                                01022000
         DC    X'1255'                                                  01023000
         DC    X'1255'                                                  01024000
         DC    X'0822'                                                  01025000
         DC    CL2'12'                                                  01026000
         DC    X'00'                                                    01027000
         ORG   DEVTABLE+416                                             01028000
         ORG   DEVTABLE+416                                             01029000
         DC    CL4'3215'                                                01030000
         DC    X'3215'                                                  01031000
         DC    X'3215'                                                  01032000
         DC    X'0823'                                                  01033000
         DC    CL2'32'                                                  01034000
         DC    X'00'                                                    01035000
         ORG   DEVTABLE+429                                             01036000
         ORG   DEVTABLE+429                                             01037000
         DC    CL4'2956'                                                01038000
         DC    X'2956'                                                  01039000
         DC    X'2956'                                                  01040000
         DC    X'0824'                                                  01041000
         DC    CL2'29'                                                  01042000
         DC    X'00'                                                    01043000
         ORG   DEVTABLE+442                                             01044000
         ORG   DEVTABLE+442                                             01045000
         DC    CL4'2956'                                                01046000
         DC    X'2956'                                                  01047000
         DC    X'2956'                                                  01048000
         DC    X'0825'                                                  01049000
         DC    CL2'29'                                                  01050000
         DC    X'00'                                                    01051000
         ORG   DEVTABLE+455                                             01052000
         ORG   DEVTABLE+455                                             01053000
         DC    CL4'2956'                                                01054000
         DC    X'2956'                                                  01055000
         DC    X'2956'                                                  01056000
         DC    X'0826'                                                  01057000
         DC    CL2'29'                                                  01058000
         DC    X'00'                                                    01059000
         ORG   DEVTABLE+468                                             01060000
         ORG   DEVTABLE+468                                             01061000
         DC    CL4'2956'                                                01062000
         DC    X'2956'                                                  01063000
         DC    X'2956'                                                  01064000
         DC    X'0827'                                                  01065000
         DC    CL2'29'                                                  01066000
         DC    X'00'                                                    01067000
         ORG   DEVTABLE+481                                             01068000
         ORG   DEVTABLE+481                                             01069000
         DC    CL4'2956'                                                01070000
         DC    X'2956'                                                  01071000
         DC    X'2956'                                                  01072000
         DC    X'0828'                                                  01073000
         DC    CL2'29'                                                  01074000
         DC    X'00'                                                    01075000
         ORG   DEVTABLE+494                                             01076000
         ORG   DEVTABLE+494                                             01077000
         DC    CL4'1419'                                                01078000
         DC    X'1419'                                                  01079000
         DC    X'1419'                                                  01080000
         DC    X'0829'                                                  01081000
         DC    CL2'14'                                                  01082000
         DC    X'00'                                                    01083000
         ORG   DEVTABLE+507                                             01084000
         ORG   DEVTABLE+507                                             01085000
         DC    CL4'1275'                                                01086000
         DC    X'1275'                                                  01087000
         DC    X'1275'                                                  01088000
         DC    X'082A'                                                  01089000
         DC    CL2'12'                                                  01090000
         DC    X'00'                                                    01091000
         ORG   DEVTABLE+520                                             01092000
         ORG   DEVTABLE+520                                             01093000
         DC    CL4'1275'                                                01094000
         DC    X'1275'                                                  01095000
         DC    X'1275'                                                  01096000
         DC    X'082B'                                                  01097000
         DC    CL2'12'                                                  01098000
         DC    X'00'                                                    01099000
         ORG   DEVTABLE+533                                             01100000
         ORG   DEVTABLE+533                                             01101000
         DC    CL4'1275'                                                01102000
         DC    X'1275'                                                  01103000
         DC    X'1275'                                                  01104000
         DC    X'082C'                                                  01105000
         DC    CL2'12'                                                  01106000
         DC    X'00'                                                    01107000
         ORG   DEVTABLE+546                                             01108000
         ORG   DEVTABLE+546                                             01109000
         DC    CL4'1419'                                                01110000
         DC    X'1419'                                                  01111000
         DC    X'1419'                                                  01112000
         DC    X'082D'                                                  01113000
         DC    CL2'14'                                                  01114000
         DC    X'00'                                                    01115000
         ORG   DEVTABLE+559                                             01116000
         ORG   DEVTABLE+559                                             01117000
         DC    CL4'1419'                                                01118000
         DC    X'1419'                                                  01119000
         DC    X'1419'                                                  01120000
         DC    X'082E'                                                  01121000
         DC    CL2'14'                                                  01122000
         DC    X'00'                                                    01123000
         ORG   DEVTABLE+572                                             01124000
         ORG   DEVTABLE+572                                             01125000
         DC    CL4'2495'                                                01126000
         DC    X'2495'                                                  01127000
         DC    X'2495'                                                  01128000
         DC    X'082F'                                                  01129000
         DC    CL2'24'                                                  01130000
         DC    X'00'                                                    01131000
         ORG   DEVTABLE+585                                             01132000
         ORG   DEVTABLE+585                                             01133000
         DC    CL4'3213'                                                01134000
         DC    X'3213'                                                  01135000
         DC    X'1270'                                                  01136000
         DC    X'0830'                                                  01137000
         DC    CL2'32'                                                  01138000
         DC    X'00'                                                    01139000
         ORG   DEVTABLE+598                                             01140000
         ORG   DEVTABLE+598                                             01141000
         DC    CL4'1017'                                                01142000
         DC    X'1017'                                                  01143000
         DC    X'1017'                                                  01144000
         DC    X'0831'                                                  01145000
         DC    CL2'10'                                                  01146000
         DC    X'00'                                                    01147000
         ORG   DEVTABLE+611                                             01148000
         ORG   DEVTABLE+611                                             01149000
         DC    CL4'1018'                                                01150000
         DC    X'1018'                                                  01151000
         DC    X'1018'                                                  01152000
         DC    X'0832'                                                  01153000
         DC    CL2'10'                                                  01154000
         DC    X'00'                                                    01155000
         ORG   DEVTABLE+624                                             01156000
         ORG   DEVTABLE+624                                             01157000
         DC    CL4'3210'                                                01158000
         DC    X'3210'                                                  01159000
         DC    X'3210'                                                  01160000
         DC    X'0833'                                                  01161000
         DC    CL2'32'                                                  01162000
         DC    X'00'                                                    01163000
         ORG   DEVTABLE+637                                             01164000
         ORG   DEVTABLE+637                                             01165000
         DC    CL4'3215'                                                01166000
         DC    X'3215'                                                  01167000
         DC    X'3215'                                                  01168000
         DC    X'0834'                                                  01169000
         DC    CL2'32'                                                  01170000
         DC    X'00'                                                    01171000
         ORG   DEVTABLE+650                                             01172000
         ORG   DEVTABLE+650                                             01173000
         DC    CL4'1255'                                                01174000
         DC    X'1255'                                                  01175000
         DC    X'1255'                                                  01176000
         DC    X'0835'                                                  01177000
         DC    CL2'12'                                                  01178000
         DC    X'00'                                                    01179000
         ORG   DEVTABLE+663                                             01180000
         ORG   DEVTABLE+663                                             01181000
         DC    CL4'1255'                                                01182000
         DC    X'1255'                                                  01183000
         DC    X'1255'                                                  01184000
         DC    X'0836'                                                  01185000
         DC    CL2'12'                                                  01186000
         DC    X'00'                                                    01187000
         ORG   DEVTABLE+676                                             01188000
         ORG   DEVTABLE+676                                             01189000
         DC    CL4'1270'                                                01190000
         DC    X'1270'                                                  01191000
         DC    X'1270'                                                  01192000
         DC    X'0837'                                                  01193000
         DC    CL2'12'                                                  01194000
         DC    X'00'                                                    01195000
         ORG   DEVTABLE+689                                             01196000
         ORG   DEVTABLE+689                                             01197000
         DC    CL4'1270'                                                01198000
         DC    X'1270'                                                  01199000
         DC    X'1270'                                                  01200000
         DC    X'0838'                                                  01201000
         DC    CL2'12'                                                  01202000
         DC    X'00'                                                    01203000
         ORG   DEVTABLE+702                                             01204000
         ORG   DEVTABLE+702                                             01205000
         DC    CL4'2596'                                                01206000
         DC    X'2596'                                                  01207000
         DC    X'2596'                                                  01208000
         DC    X'0839'                                                  01209000
         DC    CL2'25'                                                  01210000
         DC    X'00'                                                    01211000
         ORG   DEVTABLE+715                                             01212000
         ORG   DEVTABLE+715                                             01213000
         DC    CL4'7443'                                                01214000
         DC    X'7443'                                                  01215000
         DC    X'7443'                                                  01216000
         DC    X'083D'                                                  01217000
         DC    CL2'74'                                                  01218000
         DC    X'00'                                                    01219000
         ORG   DEVTABLE+728                                             01220000
         ORG   DEVTABLE+728                                             01221000
         DC    CL4'3890'                                                01222000
         DC    X'3890'                                                  01223000
         DC    X'3890'                                                  01224000
         DC    X'0840'                                                  01225000
         DC    CL2'38'                                                  01226000
         DC    X'00'                                                    01227000
         ORG   DEVTABLE+741                                             01228000
         ORG   DEVTABLE+741                                             01229000
         DC    CL4'3886'                                                01230000
         DC    X'3886'                                                  01231000
         DC    X'3886'                                                  01232000
         DC    X'0841'                                                  01233000
         DC    CL2'38'                                                  01234000
         DC    X'00'                                                    01235000
         ORG   DEVTABLE+754                                             01236000
         ORG   DEVTABLE+754                                             01237000
         DC    CL4'3850'                                                01238000
         DC    X'3850'                                                  01239000
         DC    X'3851'                                                  01240000
         DC    X'0842'                                                  01241000
         DC    CL2'38'                                                  01242000
         DC    X'00'                                                    01243000
         ORG   DEVTABLE+767                                             01244000
         ORG   DEVTABLE+767                                             01245000
         DC    CL4'3851'                                                01246000
         DC    X'3851'                                                  01247000
         DC    X'3851'                                                  01248000
         DC    X'0842'                                                  01249000
         DC    CL2'38'                                                  01250000
         DC    X'00'                                                    01251000
         ORG   DEVTABLE+780                                             01252000
         ORG   DEVTABLE+780                                             01253000
         DC    CL4'3540'                                                01254000
         DC    X'3540'                                                  01255000
         DC    X'3540'                                                  01256000
         DC    X'0844'                                                  01257000
         DC    CL2'35'                                                  01258000
         DC    X'00'                                                    01259000
         ORG   DEVTABLE+793                                             01260000
         ORG   DEVTABLE+793                                             01261000
         DC    CL4'2560'                                                01262000
         DC    X'2560'                                                  01263000
         DC    X'2560'                                                  01264000
         DC    X'0846'                                                  01265000
         DC    CL2'25'                                                  01266000
         DC    X'00'                                                    01267000
         ORG   DEVTABLE+806                                             01268000
         ORG   DEVTABLE+806                                             01269000
         DC    CL4'3504'                                                01270000
         DC    X'3504'                                                  01271000
         DC    X'3504'                                                  01272000
         DC    X'0847'                                                  01273000
         DC    CL2'35'                                                  01274000
         DC    X'00'                                                    01275000
         ORG   DEVTABLE+819                                             01276000
         ORG   DEVTABLE+819                                             01277000
         DC    CL4'5425'                                                01278000
         DC    X'5425'                                                  01279000
         DC    X'5425'                                                  01280000
         DC    X'0848'                                                  01281000
         DC    CL2'54'                                                  01282000
         DC    X'00'                                                    01283000
         ORG   DEVTABLE+832                                             01284000
         ORG   DEVTABLE+832                                             01285000
         DC    CL4'3203'                                                01286000
         DC    X'3203'                                                  01287000
         DC    X'3203'                                                  01288000
         DC    X'0849'                                                  01289000
         DC    CL2'32'                                                  01290000
         DC    X'00'                                                    01291000
         ORG   DEVTABLE+845                                             01292000
         ORG   DEVTABLE+845                                             01293000
         DC    CL4'3838'                                                01294000
         DC    X'3838'                                                  01295000
         DC    X'3838'                                                  01296000
         DC    X'084C'                                                  01297000
         DC    CL2'38'                                                  01298000
         DC    X'00'                                                    01299000
         ORG   DEVTABLE+858                                             01300000
         ORG   DEVTABLE+858                                             01301000
         DC    CL4'1015'                                                01302000
         DC    X'1015'                                                  01303000
         DC    X'1015'                                                  01304000
         DC    X'1001'                                                  01305000
         DC    CL2'10'                                                  01306000
         DC    X'00'                                                    01307000
         ORG   DEVTABLE+871                                             01308000
         ORG   DEVTABLE+871                                             01309000
         DC    CL4'2250'                                                01310000
         DC    X'2250'                                                  01311000
         DC    X'2250'                                                  01312000
         DC    X'1002'                                                  01313000
         DC    CL2'22'                                                  01314000
         DC    X'00'                                                    01315000
         ORG   DEVTABLE+884                                             01316000
         ORG   DEVTABLE+884                                             01317000
         DC    CL4'2260'                                                01318000
         DC    X'2260'                                                  01319000
         DC    X'2260'                                                  01320000
         DC    X'1003'                                                  01321000
         DC    CL2'22'                                                  01322000
         DC    X'00'                                                    01323000
         ORG   DEVTABLE+897                                             01324000
         ORG   DEVTABLE+897                                             01325000
         DC    CL4'1053'                                                01326000
         DC    X'1053'                                                  01327000
         DC    X'1053'                                                  01328000
         DC    X'1004'                                                  01329000
         DC    CL2'10'                                                  01330000
         DC    X'00'                                                    01331000
         ORG   DEVTABLE+910                                             01332000
         ORG   DEVTABLE+910                                             01333000
         DC    CL4'2280'                                                01334000
         DC    X'2280'                                                  01335000
         DC    X'2280'                                                  01336000
         DC    X'1005'                                                  01337000
         DC    CL2'22'                                                  01338000
         DC    X'00'                                                    01339000
         ORG   DEVTABLE+923                                             01340000
         ORG   DEVTABLE+923                                             01341000
         DC    CL4'2282'                                                01342000
         DC    X'2282'                                                  01343000
         DC    X'2282'                                                  01344000
         DC    X'1006'                                                  01345000
         DC    CL2'22'                                                  01346000
         DC    X'00'                                                    01347000
         ORG   DEVTABLE+936                                             01348000
         ORG   DEVTABLE+936                                             01349000
         DC    CL4'5450'                                                01350000
         DC    X'5450'                                                  01351000
         DC    X'5450'                                                  01352000
         DC    X'1007'                                                  01353000
         DC    CL2'54'                                                  01354000
         DC    X'00'                                                    01355000
         ORG   DEVTABLE+949                                             01356000
         ORG   DEVTABLE+949                                             01357000
         DC    CL4'3066'                                                01358000
         DC    X'3066'                                                  01359000
         DC    X'3270'                                                  01360000
         DC    X'1008'                                                  01361000
         DC    CL2'30'                                                  01362000
         DC    X'00'                                                    01363000
         ORG   DEVTABLE+962                                             01364000
         ORG   DEVTABLE+962                                             01365000
         DC    CL4'3277'                                                01366000
         DC    X'3277'                                                  01367000
         DC    X'3277'                                                  01368000
         DC    X'1009'                                                  01369000
         DC    CL2'32'                                                  01370000
         DC    X'00'                                                    01371000
         ORG   DEVTABLE+975                                             01372000
         ORG   DEVTABLE+975                                             01373000
         DC    CL4'3284'                                                01374000
         DC    X'3284'                                                  01375000
         DC    X'3284'                                                  01376000
         DC    X'100A'                                                  01377000
         DC    CL2'32'                                                  01378000
         DC    X'00'                                                    01379000
         ORG   DEVTABLE+988                                             01380000
         ORG   DEVTABLE+988                                             01381000
         DC    CL4'3286'                                                01382000
         DC    X'3286'                                                  01383000
         DC    X'3286'                                                  01384000
         DC    X'100B'                                                  01385000
         DC    CL2'32'                                                  01386000
         DC    X'00'                                                    01387000
         ORG   DEVTABLE+1001                                            01388000
         ORG   DEVTABLE+1001                                            01389000
         DC    CL4'3158'                                                01390000
         DC    X'3158'                                                  01391000
         DC    X'3158'                                                  01392000
         DC    X'100C'                                                  01393000
         DC    CL2'31'                                                  01394000
         DC    X'00'                                                    01395000
         ORG   DEVTABLE+1014                                            01396000
         ORG   DEVTABLE+1014                                            01397000
         DC    CL4'3036'                                                01398000
         DC    X'3036'                                                  01399000
         DC    X'3036'                                                  01400000
         DC    X'100D'                                                  01401000
         DC    CL2'30'                                                  01402000
         DC    X'00'                                                    01403000
         ORG   DEVTABLE+1027                                            01404000
         ORG   DEVTABLE+1027                                            01405000
         DC    CL4'3138'                                                01406000
         DC    X'3138'                                                  01407000
         DC    X'3138'                                                  01408000
         DC    X'100E'                                                  01409000
         DC    CL2'31'                                                  01410000
         DC    X'00'                                                    01411000
         ORG   DEVTABLE+1040                                            01412000
         ORG   DEVTABLE+1040                                            01413000
         DC    CL4'3148'                                                01414000
         DC    X'3148'                                                  01415000
         DC    X'3148'                                                  01416000
         DC    X'100F'                                                  01417000
         DC    CL2'31'                                                  01418000
         DC    X'00'                                                    01419000
         ORG   DEVTABLE+1053                                            01420000
         ORG   DEVTABLE+1053                                            01421000
         DC    CL4'2311'                                                01422000
         DC    X'2311'                                                  01423000
         DC    X'2311'                                                  01424000
         DC    X'2001'                                                  01425000
         DC    CL2'23'                                                  01426000
         DC    X'00'                                                    01427000
         ORG   DEVTABLE+1066                                            01428000
         ORG   DEVTABLE+1066                                            01429000
         DC    CL4'2301'                                                01430000
         DC    X'2301'                                                  01431000
         DC    X'2301'                                                  01432000
         DC    X'2002'                                                  01433000
         DC    CL2'23'                                                  01434000
         DC    X'00'                                                    01435000
         ORG   DEVTABLE+1079                                            01436000
         ORG   DEVTABLE+1079                                            01437000
         DC    CL4'2303'                                                01438000
         DC    X'2303'                                                  01439000
         DC    X'2303'                                                  01440000
         DC    X'2003'                                                  01441000
         DC    CL2'23'                                                  01442000
         DC    X'00'                                                    01443000
         ORG   DEVTABLE+1092                                            01444000
         ORG   DEVTABLE+1092                                            01445000
         DC    CL4'2302'                                                01446000
         DC    X'2302'                                                  01447000
         DC    X'2302'                                                  01448000
         DC    X'2004'                                                  01449000
         DC    CL2'23'                                                  01450000
         DC    X'00'                                                    01451000
         ORG   DEVTABLE+1105                                            01452000
         ORG   DEVTABLE+1105                                            01453000
         DC    CL4'2321'                                                01454000
         DC    X'2321'                                                  01455000
         DC    X'2321'                                                  01456000
         DC    X'2005'                                                  01457000
         DC    CL2'23'                                                  01458000
         DC    X'00'                                                    01459000
         ORG   DEVTABLE+1118                                            01460000
         ORG   DEVTABLE+1118                                            01461000
         DC    CL4'2305'                                                01462000
         DC    X'2305'                                                  01463000
         DC    X'2305'                                                  01464000
         DC    X'2006'                                                  01465000
         DC    CL2'23'                                                  01466000
         DC    X'00'                                                    01467000
         ORG   DEVTABLE+1131                                            01468000
         ORG   DEVTABLE+1131                                            01469000
         DC    CL4'2305'                                                01470000
         DC    X'2305'                                                  01471000
         DC    X'2305'                                                  01472000
         DC    X'2007'                                                  01473000
         DC    CL2'23'                                                  01474000
         DC    X'00'                                                    01475000
         ORG   DEVTABLE+1144                                            01476000
         ORG   DEVTABLE+1144                                            01477000
         DC    CL4'2314'                                                01478000
         DC    X'2314'                                                  01479000
         DC    X'2314'                                                  01480000
         DC    X'2008'                                                  01481000
         DC    CL2'23'                                                  01482000
         DC    X'00'                                                    01483000
         ORG   DEVTABLE+1157                                            01484000
         ORG   DEVTABLE+1157                                            01485000
         DC    CL4'3330'                                                01486000
         DC    X'3330'                                                  01487000
         DC    X'3830'                                                  01488000
         DC    X'2009'                                                  01489000
         DC    CL2'33'                                                  01490000
         DC    X'00'                                                    01491000
         ORG   DEVTABLE+1170                                            01492000
         ORG   DEVTABLE+1170                                            01493000
         DC    CL4'3340'                                                01494000
         DC    X'3340'                                                  01495000
         DC    X'3830'                                                  01496000
         DC    X'200A'                                                  01497000
         DC    CL2'33'                                                  01498000
         DC    X'00'                                                    01499000
         ORG   DEVTABLE+1183                                            01500000
         ORG   DEVTABLE+1183                                            01501000
         DC    CL4'3350'                                                01502000
         DC    X'3350'                                                  01503000
         DC    X'3830'                                                  01504000
         DC    X'200B'                                                  01505000
         DC    CL2'33'                                                  01506000
         DC    X'00'                                                    01507000
         ORG   DEVTABLE+1196                                            01508000
         ORG   DEVTABLE+1196                                            01509000
         DC    CL4'3330'                                                01510000
         DC    X'3330'                                                  01511000
         DC    X'3830'                                                  01512000
         DC    X'200D'                                                  01513000
         DC    CL2'33'                                                  01514000
         DC    X'00'                                                    01515000
         ORG   DEVTABLE+1209                                            01516000
         ORG   DEVTABLE+1209                                            01517000
         DC    CL4'7770'                                                01518000
         DC    X'7770'                                                  01519000
         DC    X'7770'                                                  01520000
         DC    X'4000'                                                  01521000
         DC    CL2'77'                                                  01522000
         DC    X'00'                                                    01523000
         ORG   DEVTABLE+1222                                            01524000
         ORG   DEVTABLE+1222                                            01525000
         DC    CL4'2702'                                                01526000
         DC    X'2702'                                                  01527000
         DC    X'2702'                                                  01528000
         DC    X'4001'                                                  01529000
         DC    CL2'27'                                                  01530000
         DC    X'00'                                                    01531000
         ORG   DEVTABLE+1235                                            01532000
         ORG   DEVTABLE+1235                                            01533000
         DC    CL4'2702'                                                01534000
         DC    X'2702'                                                  01535000
         DC    X'2702'                                                  01536000
         DC    X'4011'                                                  01537000
         DC    CL2'27'                                                  01538000
         DC    X'00'                                                    01539000
         ORG   DEVTABLE+1248                                            01540000
         ORG   DEVTABLE+1248                                            01541000
         DC    CL4'2702'                                                01542000
         DC    X'2702'                                                  01543000
         DC    X'2702'                                                  01544000
         DC    X'4021'                                                  01545000
         DC    CL2'27'                                                  01546000
         DC    X'00'                                                    01547000
         ORG   DEVTABLE+1261                                            01548000
         ORG   DEVTABLE+1261                                            01549000
         DC    CL4'2702'                                                01550000
         DC    X'2702'                                                  01551000
         DC    X'2702'                                                  01552000
         DC    X'4031'                                                  01553000
         DC    CL2'27'                                                  01554000
         DC    X'00'                                                    01555000
         ORG   DEVTABLE+1274                                            01556000
         ORG   DEVTABLE+1274                                            01557000
         DC    CL4'2702'                                                01558000
         DC    X'2702'                                                  01559000
         DC    X'2702'                                                  01560000
         DC    X'4041'                                                  01561000
         DC    CL2'27'                                                  01562000
         DC    X'00'                                                    01563000
         ORG   DEVTABLE+1287                                            01564000
         ORG   DEVTABLE+1287                                            01565000
         DC    CL4'2702'                                                01566000
         DC    X'2702'                                                  01567000
         DC    X'2702'                                                  01568000
         DC    X'4051'                                                  01569000
         DC    CL2'27'                                                  01570000
         DC    X'00'                                                    01571000
         ORG   DEVTABLE+1300                                            01572000
         ORG   DEVTABLE+1300                                            01573000
         DC    CL4'2702'                                                01574000
         DC    X'2702'                                                  01575000
         DC    X'2702'                                                  01576000
         DC    X'4061'                                                  01577000
         DC    CL2'27'                                                  01578000
         DC    X'00'                                                    01579000
         ORG   DEVTABLE+1313                                            01580000
         ORG   DEVTABLE+1313                                            01581000
         DC    CL4'2702'                                                01582000
         DC    X'2702'                                                  01583000
         DC    X'2702'                                                  01584000
         DC    X'4071'                                                  01585000
         DC    CL2'27'                                                  01586000
         DC    X'00'                                                    01587000
         ORG   DEVTABLE+1326                                            01588000
         ORG   DEVTABLE+1326                                            01589000
         DC    CL4'2702'                                                01590000
         DC    X'2702'                                                  01591000
         DC    X'2702'                                                  01592000
         DC    X'4081'                                                  01593000
         DC    CL2'27'                                                  01594000
         DC    X'00'                                                    01595000
         ORG   DEVTABLE+1339                                            01596000
         ORG   DEVTABLE+1339                                            01597000
         DC    CL4'2702'                                                01598000
         DC    X'2702'                                                  01599000
         DC    X'2702'                                                  01600000
         DC    X'4091'                                                  01601000
         DC    CL2'27'                                                  01602000
         DC    X'00'                                                    01603000
         ORG   DEVTABLE+1352                                            01604000
         ORG   DEVTABLE+1352                                            01605000
         DC    CL4'2701'                                                01606000
         DC    X'2701'                                                  01607000
         DC    X'2701'                                                  01608000
         DC    X'4012'                                                  01609000
         DC    CL2'27'                                                  01610000
         DC    X'00'                                                    01611000
         ORG   DEVTABLE+1365                                            01612000
         ORG   DEVTABLE+1365                                            01613000
         DC    CL4'2701'                                                01614000
         DC    X'2701'                                                  01615000
         DC    X'2701'                                                  01616000
         DC    X'4022'                                                  01617000
         DC    CL2'27'                                                  01618000
         DC    X'00'                                                    01619000
         ORG   DEVTABLE+1378                                            01620000
         ORG   DEVTABLE+1378                                            01621000
         DC    CL4'2701'                                                01622000
         DC    X'2701'                                                  01623000
         DC    X'2701'                                                  01624000
         DC    X'4032'                                                  01625000
         DC    CL2'27'                                                  01626000
         DC    X'00'                                                    01627000
         ORG   DEVTABLE+1391                                            01628000
         ORG   DEVTABLE+1391                                            01629000
         DC    CL4'2701'                                                01630000
         DC    X'2701'                                                  01631000
         DC    X'2701'                                                  01632000
         DC    X'4042'                                                  01633000
         DC    CL2'27'                                                  01634000
         DC    X'00'                                                    01635000
         ORG   DEVTABLE+1404                                            01636000
         ORG   DEVTABLE+1404                                            01637000
         DC    CL4'2701'                                                01638000
         DC    X'2701'                                                  01639000
         DC    X'2701'                                                  01640000
         DC    X'4052'                                                  01641000
         DC    CL2'27'                                                  01642000
         DC    X'00'                                                    01643000
         ORG   DEVTABLE+1417                                            01644000
         ORG   DEVTABLE+1417                                            01645000
         DC    CL4'2701'                                                01646000
         DC    X'2701'                                                  01647000
         DC    X'2701'                                                  01648000
         DC    X'4062'                                                  01649000
         DC    CL2'27'                                                  01650000
         DC    X'00'                                                    01651000
         ORG   DEVTABLE+1430                                            01652000
         ORG   DEVTABLE+1430                                            01653000
         DC    CL4'2701'                                                01654000
         DC    X'2701'                                                  01655000
         DC    X'2701'                                                  01656000
         DC    X'4072'                                                  01657000
         DC    CL2'27'                                                  01658000
         DC    X'00'                                                    01659000
         ORG   DEVTABLE+1443                                            01660000
         ORG   DEVTABLE+1443                                            01661000
         DC    CL4'2701'                                                01662000
         DC    X'2701'                                                  01663000
         DC    X'2701'                                                  01664000
         DC    X'4082'                                                  01665000
         DC    CL2'27'                                                  01666000
         DC    X'00'                                                    01667000
         ORG   DEVTABLE+1456                                            01668000
         ORG   DEVTABLE+1456                                            01669000
         DC    CL4'2701'                                                01670000
         DC    X'2701'                                                  01671000
         DC    X'2701'                                                  01672000
         DC    X'4092'                                                  01673000
         DC    CL2'27'                                                  01674000
         DC    X'00'                                                    01675000
         ORG   DEVTABLE+1469                                            01676000
         ORG   DEVTABLE+1469                                            01677000
         DC    CL4'2703'                                                01678000
         DC    X'2703'                                                  01679000
         DC    X'2703'                                                  01680000
         DC    X'4013'                                                  01681000
         DC    CL2'27'                                                  01682000
         DC    X'00'                                                    01683000
         ORG   DEVTABLE+1482                                            01684000
         ORG   DEVTABLE+1482                                            01685000
         DC    CL4'2703'                                                01686000
         DC    X'2703'                                                  01687000
         DC    X'2703'                                                  01688000
         DC    X'4023'                                                  01689000
         DC    CL2'27'                                                  01690000
         DC    X'00'                                                    01691000
         ORG   DEVTABLE+1495                                            01692000
         ORG   DEVTABLE+1495                                            01693000
         DC    CL4'2703'                                                01694000
         DC    X'2703'                                                  01695000
         DC    X'2703'                                                  01696000
         DC    X'4033'                                                  01697000
         DC    CL2'27'                                                  01698000
         DC    X'00'                                                    01699000
         ORG   DEVTABLE+1508                                            01700000
         ORG   DEVTABLE+1508                                            01701000
         DC    CL4'2703'                                                01702000
         DC    X'2703'                                                  01703000
         DC    X'2703'                                                  01704000
         DC    X'4043'                                                  01705000
         DC    CL2'27'                                                  01706000
         DC    X'00'                                                    01707000
         ORG   DEVTABLE+1521                                            01708000
         ORG   DEVTABLE+1521                                            01709000
         DC    CL4'2703'                                                01710000
         DC    X'2703'                                                  01711000
         DC    X'2703'                                                  01712000
         DC    X'4053'                                                  01713000
         DC    CL2'27'                                                  01714000
         DC    X'00'                                                    01715000
         ORG   DEVTABLE+1534                                            01716000
         ORG   DEVTABLE+1534                                            01717000
         DC    CL4'2703'                                                01718000
         DC    X'2703'                                                  01719000
         DC    X'2703'                                                  01720000
         DC    X'4063'                                                  01721000
         DC    CL2'27'                                                  01722000
         DC    X'00'                                                    01723000
         ORG   DEVTABLE+1547                                            01724000
         ORG   DEVTABLE+1547                                            01725000
         DC    CL4'2703'                                                01726000
         DC    X'2703'                                                  01727000
         DC    X'2703'                                                  01728000
         DC    X'4073'                                                  01729000
         DC    CL2'27'                                                  01730000
         DC    X'00'                                                    01731000
         ORG   DEVTABLE+1560                                            01732000
         ORG   DEVTABLE+1560                                            01733000
         DC    CL4'2703'                                                01734000
         DC    X'2703'                                                  01735000
         DC    X'2703'                                                  01736000
         DC    X'4083'                                                  01737000
         DC    CL2'27'                                                  01738000
         DC    X'00'                                                    01739000
         ORG   DEVTABLE+1573                                            01740000
         ORG   DEVTABLE+1573                                            01741000
         DC    CL4'2703'                                                01742000
         DC    X'2703'                                                  01743000
         DC    X'2703'                                                  01744000
         DC    X'4093'                                                  01745000
         DC    CL2'27'                                                  01746000
         DC    X'00'                                                    01747000
         ORG   DEVTABLE+1586                                            01748000
         ORG   DEVTABLE+1586                                            01749000
         DC    CL4'2701'                                                01750000
         DC    X'2701'                                                  01751000
         DC    X'2701'                                                  01752000
         DC    X'4002'                                                  01753000
         DC    CL2'27'                                                  01754000
         DC    X'00'                                                    01755000
         ORG   DEVTABLE+1599                                            01756000
         ORG   DEVTABLE+1599                                            01757000
         DC    CL4'2703'                                                01758000
         DC    X'2703'                                                  01759000
         DC    X'2703'                                                  01760000
         DC    X'4003'                                                  01761000
         DC    CL2'27'                                                  01762000
         DC    X'00'                                                    01763000
         ORG   DEVTABLE+1612                                            01764000
         ORG   DEVTABLE+1612                                            01765000
         DC    CL4'2955'                                                01766000
         DC    X'2955'                                                  01767000
         DC    X'2955'                                                  01768000
         DC    X'4004'                                                  01769000
         DC    CL2'29'                                                  01770000
         DC    X'00'                                                    01771000
         ORG   DEVTABLE+1625                                            01772000
         ORG   DEVTABLE+1625                                            01773000
         DC    CL4'2955'                                                01774000
         DC    X'2955'                                                  01775000
         DC    X'2955'                                                  01776000
         DC    X'4014'                                                  01777000
         DC    CL2'29'                                                  01778000
         DC    X'00'                                                    01779000
         ORG   DEVTABLE+1638                                            01780000
         ORG   DEVTABLE+1638                                            01781000
         DC    CL4'3705'                                                01782000
         DC    X'3705'                                                  01783000
         DC    X'3705'                                                  01784000
         DC    X'4005'                                                  01785000
         DC    CL2'37'                                                  01786000
         DC    X'00'                                                    01787000
         ORG   DEVTABLE+1651                                            01788000
         ORG   DEVTABLE+1651                                            01789000
         DC    CL4'3705'                                                01790000
         DC    X'3705'                                                  01791000
         DC    X'3705'                                                  01792000
         DC    X'4015'                                                  01793000
         DC    CL2'37'                                                  01794000
         DC    X'00'                                                    01795000
         ORG   DEVTABLE+1664                                            01796000
         ORG   DEVTABLE+1664                                            01797000
         DC    CL4'3705'                                                01798000
         DC    X'3705'                                                  01799000
         DC    X'3705'                                                  01800000
         DC    X'4025'                                                  01801000
         DC    CL2'37'                                                  01802000
         DC    X'00'                                                    01803000
         ORG   DEVTABLE+1677                                            01804000
         ORG   DEVTABLE+1677                                            01805000
         DC    CL4'3705'                                                01806000
         DC    X'3705'                                                  01807000
         DC    X'3705'                                                  01808000
         DC    X'4035'                                                  01809000
         DC    CL2'37'                                                  01810000
         DC    X'00'                                                    01811000
         ORG   DEVTABLE+1690                                            01812000
         ORG   DEVTABLE+1690                                            01813000
         DC    CL4'3705'                                                01814000
         DC    X'3705'                                                  01815000
         DC    X'3705'                                                  01816000
         DC    X'4006'                                                  01817000
         DC    CL2'37'                                                  01818000
         DC    X'00'                                                    01819000
         ORG   DEVTABLE+1703                                            01820000
         ORG   DEVTABLE+1703                                            01821000
         DC    CL4'3967'                                                01822000
         DC    X'3967'                                                  01823000
         DC    X'3967'                                                  01824000
         DC    X'4008'                                                  01825000
         DC    CL2'39'                                                  01826000
         DC    X'00'                                                    01827000
         ORG   DEVTABLE+1716                                            01828000
         ORG   DEVTABLE+1716                                            01829000
         DC    CL4'3703'                                                01830000
         DC    X'3703'                                                  01831000
         DC    X'3703'                                                  01832000
         DC    X'4009'                                                  01833000
         DC    CL2'37'                                                  01834000
         DC    X'00'                                                    01835000
         ORG   DEVTABLE+1729                                            01836000
         ORG   DEVTABLE+1729                                            01837000
         DC    CL4'3968'                                                01838000
         DC    X'3968'                                                  01839000
         DC    X'3968'                                                  01840000
         DC    X'400A'                                                  01841000
         DC    CL2'39'                                                  01842000
         DC    X'00'                                                    01843000
         ORG   DEVTABLE+1742                                            01844000
         ORG   DEVTABLE+1742                                            01845000
         DC    CL4'3791'                                                01846000
         DC    X'3791'                                                  01847000
         DC    X'3791'                                                  01848000
         DC    X'40F1'                                                  01849000
         DC    CL2'37'                                                  01850000
         DC    X'00'                                                    01851000
         ORG   DEVTABLE+1755                                            01852000
         ORG   DEVTABLE+1755                                            01853000
         DC    CL4'CACA'                                                01854000
         DC    X'CACA'                                                  01855000
         DC    X'CACA'                                                  01856000
         DC    X'4100'                                                  01857000
         DC    CL2'CA'                                                  01858000
         DC    X'00'                                                    01859000
         ORG   DEVTABLE+1768                                            01860000
         ORG   DEVTABLE+1768                                            01861000
         DC    CL4'1030'                                                01862000
         DC    X'1030'                                                  01863000
         DC    X'1030'                                                  01864000
         DC    X'4201'                                                  01865000
         DC    CL2'10'                                                  01866000
         DC    X'00'                                                    01867000
         ORG   DEVTABLE+1781                                            01868000
         ORG   DEVTABLE+1781                                            01869000
         DC    CL4'1050'                                                01870000
         DC    X'1050'                                                  01871000
         DC    X'1050'                                                  01872000
         DC    X'4202'                                                  01873000
         DC    CL2'10'                                                  01874000
         DC    X'00'                                                    01875000
         ORG   DEVTABLE+1794                                            01876000
         ORG   DEVTABLE+1794                                            01877000
         DC    CL4'1060'                                                01878000
         DC    X'1060'                                                  01879000
         DC    X'1060'                                                  01880000
         DC    X'4203'                                                  01881000
         DC    CL2'10'                                                  01882000
         DC    X'00'                                                    01883000
         ORG   DEVTABLE+1807                                            01884000
         ORG   DEVTABLE+1807                                            01885000
         DC    CL4'2740'                                                01886000
         DC    X'2740'                                                  01887000
         DC    X'2740'                                                  01888000
         DC    X'4204'                                                  01889000
         DC    CL2'27'                                                  01890000
         DC    X'00'                                                    01891000
         ORG   DEVTABLE+1820                                            01892000
         ORG   DEVTABLE+1820                                            01893000
         DC    CL4'2740'                                                01894000
         DC    X'2740'                                                  01895000
         DC    X'2740'                                                  01896000
         DC    X'4205'                                                  01897000
         DC    CL2'27'                                                  01898000
         DC    X'00'                                                    01899000
         ORG   DEVTABLE+1833                                            01900000
         ORG   DEVTABLE+1833                                            01901000
         DC    CL4'2741'                                                01902000
         DC    X'2741'                                                  01903000
         DC    X'2741'                                                  01904000
         DC    X'4206'                                                  01905000
         DC    CL2'27'                                                  01906000
         DC    X'00'                                                    01907000
         ORG   DEVTABLE+1846                                            01908000
         ORG   DEVTABLE+1846                                            01909000
         DC    CL4'2260'                                                01910000
         DC    X'2260'                                                  01911000
         DC    X'2260'                                                  01912000
         DC    X'4207'                                                  01913000
         DC    CL2'22'                                                  01914000
         DC    X'00'                                                    01915000
         ORG   DEVTABLE+1859                                            01916000
         ORG   DEVTABLE+1859                                            01917000
         DC    CL4'1053'                                                01918000
         DC    X'1053'                                                  01919000
         DC    X'1053'                                                  01920000
         DC    X'4208'                                                  01921000
         DC    CL2'10'                                                  01922000
         DC    X'00'                                                    01923000
         ORG   DEVTABLE+1872                                            01924000
         ORG   DEVTABLE+1872                                            01925000
         DC    CL4'2760'                                                01926000
         DC    X'2760'                                                  01927000
         DC    X'2760'                                                  01928000
         DC    X'4209'                                                  01929000
         DC    CL2'27'                                                  01930000
         DC    X'00'                                                    01931000
         ORG   DEVTABLE+1885                                            01932000
         ORG   DEVTABLE+1885                                            01933000
         DC    CL4'83B3'                                                01934000
         DC    X'83B3'                                                  01935000
         DC    X'83B3'                                                  01936000
         DC    X'420A'                                                  01937000
         DC    CL2'83'                                                  01938000
         DC    X'00'                                                    01939000
         ORG   DEVTABLE+1898                                            01940000
         ORG   DEVTABLE+1898                                            01941000
         DC    CL4'115A'                                                01942000
         DC    X'115A'                                                  01943000
         DC    X'115A'                                                  01944000
         DC    X'420B'                                                  01945000
         DC    CL2'11'                                                  01946000
         DC    X'00'                                                    01947000
         ORG   DEVTABLE+1911                                            01948000
         ORG   DEVTABLE+1911                                            01949000
         DC    CL4'1130'                                                01950000
         DC    X'1130'                                                  01951000
         DC    X'1130'                                                  01952000
         DC    X'420F'                                                  01953000
         DC    CL2'11'                                                  01954000
         DC    X'00'                                                    01955000
         ORG   DEVTABLE+1924                                            01956000
         ORG   DEVTABLE+1924                                            01957000
         DC    CL4'2020'                                                01958000
         DC    X'2020'                                                  01959000
         DC    X'2020'                                                  01960000
         DC    X'4210'                                                  01961000
         DC    CL2'20'                                                  01962000
         DC    X'00'                                                    01963000
         ORG   DEVTABLE+1937                                            01964000
         ORG   DEVTABLE+1937                                            01965000
         DC    CL4'2780'                                                01966000
         DC    X'2780'                                                  01967000
         DC    X'2780'                                                  01968000
         DC    X'4211'                                                  01969000
         DC    CL2'27'                                                  01970000
         DC    X'00'                                                    01971000
         ORG   DEVTABLE+1950                                            01972000
         ORG   DEVTABLE+1950                                            01973000
         DC    CL4'2770'                                                01974000
         DC    X'2770'                                                  01975000
         DC    X'2770'                                                  01976000
         DC    X'4212'                                                  01977000
         DC    CL2'27'                                                  01978000
         DC    X'00'                                                    01979000
         ORG   DEVTABLE+1963                                            01980000
         ORG   DEVTABLE+1963                                            01981000
         DC    CL4'2265'                                                01982000
         DC    X'2265'                                                  01983000
         DC    X'2265'                                                  01984000
         DC    X'4213'                                                  01985000
         DC    CL2'22'                                                  01986000
         DC    X'00'                                                    01987000
         ORG   DEVTABLE+1976                                            01988000
         ORG   DEVTABLE+1976                                            01989000
         DC    CL4'2930'                                                01990000
         DC    X'2930'                                                  01991000
         DC    X'2930'                                                  01992000
         DC    X'4214'                                                  01993000
         DC    CL2'29'                                                  01994000
         DC    X'00'                                                    01995000
         ORG   DEVTABLE+1989                                            01996000
         ORG   DEVTABLE+1989                                            01997000
         DC    CL4'2972'                                                01998000
         DC    X'2972'                                                  01999000
         DC    X'2972'                                                  02000000
         DC    X'4215'                                                  02001000
         DC    CL2'29'                                                  02002000
         DC    X'00'                                                    02003000
         ORG   DEVTABLE+2002                                            02004000
         ORG   DEVTABLE+2002                                            02005000
         DC    CL4'3277'                                                02006000
         DC    X'3277'                                                  02007000
         DC    X'3270'                                                  02008000
         DC    X'4216'                                                  02009000
         DC    CL2'32'                                                  02010000
         DC    X'00'                                                    02011000
         ORG   DEVTABLE+2015                                            02012000
         ORG   DEVTABLE+2015                                            02013000
         DC    CL4'2970'                                                02014000
         DC    X'2970'                                                  02015000
         DC    X'2970'                                                  02016000
         DC    X'4217'                                                  02017000
         DC    CL2'29'                                                  02018000
         DC    X'00'                                                    02019000
         ORG   DEVTABLE+2028                                            02020000
         ORG   DEVTABLE+2028                                            02021000
         DC    CL4'3735'                                                02022000
         DC    X'3735'                                                  02023000
         DC    X'3735'                                                  02024000
         DC    X'4218'                                                  02025000
         DC    CL2'37'                                                  02026000
         DC    X'00'                                                    02027000
         ORG   DEVTABLE+2041                                            02028000
         ORG   DEVTABLE+2041                                            02029000
         DC    CL4'3945'                                                02030000
         DC    X'3945'                                                  02031000
         DC    X'3945'                                                  02032000
         DC    X'4219'                                                  02033000
         DC    CL2'39'                                                  02034000
         DC    X'00'                                                    02035000
         ORG   DEVTABLE+2054                                            02036000
         ORG   DEVTABLE+2054                                            02037000
         DC    CL4'2790'                                                02038000
         DC    X'2790'                                                  02039000
         DC    X'2790'                                                  02040000
         DC    X'421A'                                                  02041000
         DC    CL2'27'                                                  02042000
         DC    X'00'                                                    02043000
         ORG   DEVTABLE+2067                                            02044000
         ORG   DEVTABLE+2067                                            02045000
         DC    CL4'3670'                                                02046000
         DC    X'3670'                                                  02047000
         DC    X'3670'                                                  02048000
         DC    X'421B'                                                  02049000
         DC    CL2'36'                                                  02050000
         DC    X'00'                                                    02051000
         ORG   DEVTABLE+2080                                            02052000
         ORG   DEVTABLE+2080                                            02053000
         DC    CL4'3700'                                                02054000
         DC    X'3700'                                                  02055000
         DC    X'3700'                                                  02056000
         DC    X'4420'                                                  02057000
         DC    CL2'37'                                                  02058000
         DC    X'00'                                                    02059000
         ORG   DEVTABLE+2093                                            02060000
         ORG   DEVTABLE+2093                                            02061000
         DC    CL4'2400'                                                02062000
         DC    X'2400'                                                  02063000
         DC    X'2400'                                                  02064000
         DC    X'8001'                                                  02065000
         DC    CL2'24'                                                  02066000
         DC    X'00'                                                    02067000
         ORG   DEVTABLE+2106                                            02068000
         ORG   DEVTABLE+2106                                            02069000
         DC    CL4'3410'                                                02070000
         DC    X'3400'                                                  02071000
         DC    X'3400'                                                  02072000
         DC    X'8003'                                                  02073000
         DC    CL2'34'                                                  02074000
         DC    X'00'                                                    02075000
         ORG   DEVTABLE+2119                                            02076000
         ORG   DEVTABLE+2119                                            02077000
         DC    CL4'3420'                                                02078000
         DC    X'3400'                                                  02079000
         DC    X'3400'                                                  02080000
         DC    X'8003'                                                  02081000
         DC    CL2'34'                                                  02082000
         DC    X'00'                                                    02083000
         ORG   DEVTABLE+2132                                            02084000
         ORG   DEVTABLE+2132                                            02085000
         DC    CL4'3420'                                                02086000
         DC    X'3420'                                                  02087000
         DC    X'3803'                                                  02088000
         DC    X'8004'                                                  02089000
         DC    CL2'34'                                                  02090000
         DC    X'00'                                                    02091000
         ORG   DEVTABLE+2145                                            02092000
         ORG   DEVTABLE+2145                                            02093000
         DC    CL4'3410'                                                02094000
         DC    X'3410'                                                  02095000
         DC    X'3411'                                                  02096000
         DC    X'8005'                                                  02097000
         DC    CL2'34'                                                  02098000
         DC    X'00'                                                    02099000
         ORG   DEVTABLE+2158                                            02100000
         ORG   DEVTABLE+2158                                            02101000
         DC    CL4'7340'                                                02102000
         DC    X'7340'                                                  02103000
         DC    X'7340'                                                  02104000
         DC    X'8008'                                                  02105000
         DC    CL2'73'                                                  02106000
         DC    X'00'                                                    02107000
         ORG   DEVTABLE+2171                                            02108000
MDRTABLE DS    CL12                                                     02109000
         ORG   MDRTABLE+0                                               02110000
MDRGENIC DC    CL4'3330'                                                02111000
MDRGHEX  DC    X'3330'                                                  02112000
MDRCUNIT DC    X'3830'                                                  02113000
MDRHEX   DC    X'01'                                                    02114000
MDRGENXX DC    CL2'33'                                                  02115000
@NM00002 DC    X'00'                                                    02116000
         ORG   @NM00002+0                                               02117000
MDRIUSED DS    BL1                                                      02118000
MDROUSED EQU   @NM00002+0                                               02119000
         ORG   MDRTABLE+12                                              02120000
         ORG   MDRTABLE+12                                              02121000
         DC    CL4'2305'                                                02122000
         DC    X'2305'                                                  02123000
         DC    X'2305'                                                  02124000
         DC    X'02'                                                    02125000
         DC    CL2'23'                                                  02126000
         DC    X'00'                                                    02127000
         ORG   MDRTABLE+24                                              02128000
         ORG   MDRTABLE+24                                              02129000
         DC    CL4'3286'                                                02130000
         DC    X'3286'                                                  02131000
         DC    X'3286'                                                  02132000
         DC    X'03'                                                    02133000
         DC    CL2'32'                                                  02134000
         DC    X'00'                                                    02135000
         ORG   MDRTABLE+36                                              02136000
         ORG   MDRTABLE+36                                              02137000
         DC    CL4'3284'                                                02138000
         DC    X'3284'                                                  02139000
         DC    X'3284'                                                  02140000
         DC    X'03'                                                    02141000
         DC    CL2'32'                                                  02142000
         DC    X'00'                                                    02143000
         ORG   MDRTABLE+48                                              02144000
         ORG   MDRTABLE+48                                              02145000
         DC    CL4'3277'                                                02146000
         DC    X'3277'                                                  02147000
         DC    X'3277'                                                  02148000
         DC    X'03'                                                    02149000
         DC    CL2'32'                                                  02150000
         DC    X'00'                                                    02151000
         ORG   MDRTABLE+60                                              02152000
         ORG   MDRTABLE+60                                              02153000
         DC    CL4'3211'                                                02154000
         DC    X'3211'                                                  02155000
         DC    X'3211'                                                  02156000
         DC    X'04'                                                    02157000
         DC    CL2'32'                                                  02158000
         DC    X'00'                                                    02159000
         ORG   MDRTABLE+72                                              02160000
         ORG   MDRTABLE+72                                              02161000
         DC    CL4'3705'                                                02162000
         DC    X'3705'                                                  02163000
         DC    X'3705'                                                  02164000
         DC    X'05'                                                    02165000
         DC    CL2'37'                                                  02166000
         DC    X'00'                                                    02167000
         ORG   MDRTABLE+84                                              02168000
         ORG   MDRTABLE+84                                              02169000
         DC    CL4'3670'                                                02170000
         DC    X'3670'                                                  02171000
         DC    X'3670'                                                  02172000
         DC    X'06'                                                    02173000
         DC    CL2'36'                                                  02174000
         DC    X'00'                                                    02175000
         ORG   MDRTABLE+96                                              02176000
         ORG   MDRTABLE+96                                              02177000
         DC    CL4'3168'                                                02178000
         DC    X'3168'                                                  02179000
         DC    X'3168'                                                  02180000
         DC    X'07'                                                    02181000
         DC    CL2'31'                                                  02182000
         DC    X'00'                                                    02183000
         ORG   MDRTABLE+108                                             02184000
         ORG   MDRTABLE+108                                             02185000
         DC    CL4'2715'                                                02186000
         DC    X'2715'                                                  02187000
         DC    X'2715'                                                  02188000
         DC    X'08'                                                    02189000
         DC    CL2'27'                                                  02190000
         DC    X'00'                                                    02191000
         ORG   MDRTABLE+120                                             02192000
         ORG   MDRTABLE+120                                             02193000
         DC    CL4'3340'                                                02194000
         DC    X'3340'                                                  02195000
         DC    X'3830'                                                  02196000
         DC    X'09'                                                    02197000
         DC    CL2'33'                                                  02198000
         DC    X'00'                                                    02199000
         ORG   MDRTABLE+132                                             02200000
         ORG   MDRTABLE+132                                             02201000
         DC    CL4'3330'                                                02202000
         DC    X'3330'                                                  02203000
         DC    X'3830'                                                  02204000
         DC    X'0A'                                                    02205000
         DC    CL2'33'                                                  02206000
         DC    X'00'                                                    02207000
         ORG   MDRTABLE+144                                             02208000
         ORG   MDRTABLE+144                                             02209000
         DC    CL4'3277'                                                02210000
         DC    X'3277'                                                  02211000
         DC    X'3277'                                                  02212000
         DC    X'0B'                                                    02213000
         DC    CL2'32'                                                  02214000
         DC    X'00'                                                    02215000
         ORG   MDRTABLE+156                                             02216000
         ORG   MDRTABLE+156                                             02217000
         DC    CL4'3800'                                                02218000
         DC    X'3800'                                                  02219000
         DC    X'3800'                                                  02220000
         DC    X'0C'                                                    02221000
         DC    CL2'38'                                                  02222000
         DC    X'00'                                                    02223000
         ORG   MDRTABLE+168                                             02224000
         ORG   MDRTABLE+168                                             02225000
         DC    CL4'3895'                                                02226000
         DC    X'3895'                                                  02227000
         DC    X'3895'                                                  02228000
         DC    X'0D'                                                    02229000
         DC    CL2'38'                                                  02230000
         DC    X'00'                                                    02231000
         ORG   MDRTABLE+180                                             02232000
         ORG   MDRTABLE+180                                             02233000
         DC    CL4'3850'                                                02234000
         DC    X'3850'                                                  02235000
         DC    X'3851'                                                  02236000
         DC    X'0E'                                                    02237000
         DC    CL2'38'                                                  02238000
         DC    X'00'                                                    02239000
         ORG   MDRTABLE+192                                             02240000
         ORG   MDRTABLE+192                                             02241000
         DC    CL4'3851'                                                02242000
         DC    X'3851'                                                  02243000
         DC    X'3851'                                                  02244000
         DC    X'0E'                                                    02245000
         DC    CL2'38'                                                  02246000
         DC    X'00'                                                    02247000
         ORG   MDRTABLE+204                                             02248000
         ORG   MDRTABLE+204                                             02249000
         DC    CL4'IGAR'                                                02250000
         DC    X'0000'                                                  02251000
         DC    X'0000'                                                  02252000
         DC    X'0F'                                                    02253000
         DC    CL2'IG'                                                  02254000
         DC    X'00'                                                    02255000
         ORG   MDRTABLE+216                                             02256000
         ORG   MDRTABLE+216                                             02257000
         DC    CL4'3350'                                                02258000
         DC    X'3350'                                                  02259000
         DC    X'3830'                                                  02260000
         DC    X'11'                                                    02261000
         DC    CL2'33'                                                  02262000
         DC    X'00'                                                    02263000
         ORG   MDRTABLE+228                                             02264000
         ORG   MDRTABLE+228                                             02265000
         DC    CL4'2305'                                                02266000
         DC    X'2305'                                                  02267000
         DC    X'2305'                                                  02268000
         DC    X'12'                                                    02269000
         DC    CL2'23'                                                  02270000
         DC    X'00'                                                    02271000
         ORG   MDRTABLE+240                                             02272000
         ORG   MDRTABLE+240                                             02273000
         DC    CL4'3277'                                                02274000
         DC    X'3277'                                                  02275000
         DC    X'3277'                                                  02276000
         DC    X'13'                                                    02277000
         DC    CL2'32'                                                  02278000
         DC    X'00'                                                    02279000
         ORG   MDRTABLE+252                                             02280000
         ORG   MDRTABLE+252                                             02281000
         DC    CL4'3705'                                                02282000
         DC    X'3705'                                                  02283000
         DC    X'3705'                                                  02284000
         DC    X'15'                                                    02285000
         DC    CL2'37'                                                  02286000
         DC    X'00'                                                    02287000
         ORG   MDRTABLE+264                                             02288000
         ORG   MDRTABLE+264                                             02289000
         DC    CL4'2946'                                                02290000
         DC    X'2946'                                                  02291000
         DC    X'2946'                                                  02292000
         DC    X'F0'                                                    02293000
         DC    CL2'29'                                                  02294000
         DC    X'00'                                                    02295000
         ORG   MDRTABLE+276                                             02296000
         ORG   MDRTABLE+276                                             02297000
         DC    CL4'2948'                                                02298000
         DC    X'2948'                                                  02299000
         DC    X'2948'                                                  02300000
         DC    X'F1'                                                    02301000
         DC    CL2'29'                                                  02302000
         DC    X'00'                                                    02303000
         ORG   MDRTABLE+288                                             02304000
         ORG   MDRTABLE+288                                             02305000
         DC    CL4'1006'                                                02306000
         DC    X'1006'                                                  02307000
         DC    X'1006'                                                  02308000
         DC    X'F2'                                                    02309000
         DC    CL2'10'                                                  02310000
         DC    X'00'                                                    02311000
         ORG   MDRTABLE+300                                             02312000
         ORG   MDRTABLE+300                                             02313000
         DC    CL4'2703'                                                02314000
         DC    X'2703'                                                  02315000
         DC    X'2703'                                                  02316000
         DC    X'F3'                                                    02317000
         DC    CL2'27'                                                  02318000
         DC    X'00'                                                    02319000
         ORG   MDRTABLE+312                                             02320000
         ORG   MDRTABLE+312                                             02321000
         DC    CL4'2969'                                                02322000
         DC    X'2969'                                                  02323000
         DC    X'2969'                                                  02324000
         DC    X'F4'                                                    02325000
         DC    CL2'29'                                                  02326000
         DC    X'00'                                                    02327000
         ORG   MDRTABLE+324                                             02328000
IFCDEVIC CSECT                                                          02329000
         DC    S(PATCH)                                                 02330000
IFCDEVIC CSECT                                                          02331000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02332000
@01      EQU   01                                                       02333000
@02      EQU   02                                                       02334000
@03      EQU   03                                                       02335000
@04      EQU   04                                                       02336000
@05      EQU   05                                                       02337000
@06      EQU   06                                                       02338000
@07      EQU   07                                                       02339000
@08      EQU   08                                                       02340000
@09      EQU   09                                                       02341000
@10      EQU   10                                                       02342000
@11      EQU   11                                                       02343000
@12      EQU   12                                                       02344000
@13      EQU   13                                                       02345000
@14      EQU   14                                                       02346000
@15      EQU   15                                                       02347000
I        EQU   @02                                                      02348000
REQUEST  EQU   @02                                                      02349000
RETCODE  EQU   @03                                                      02350000
R15      EQU   @15                                                      02351000
REQCODE  EQU   0                                                        02352000
IPDEVICE EQU   0                                                        02353000
OPDEVICE EQU   0                                                        02354000
@RF00063 EQU   @EL00002                                                 02355000
@RF00106 EQU   @EL00003                                                 02356000
@RF00133 EQU   @EL00004                                                 02357000
@RF00160 EQU   @EL00005                                                 02358000
@PB00005 EQU   @PB00006                                                 02359000
@RF00206 EQU   @EL00006                                                 02360000
@PB00004 EQU   @PB00005                                                 02361000
@PB00003 EQU   @PB00004                                                 02362000
@PB00002 EQU   @PB00003                                                 02363000
@ENDDATA EQU   *                                                        02364000
         END   IFCDEVIC                                                 02365000
