         TITLE 'I F C E X X X F --- ARGONAUT OBR RECORD SUPPORT'        00060002
         MACRO                                                          00120002
         BIN   ,                                                        00180002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   00240002
.*                                      RECORD DSECT                    00300002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      00360002
.*                                      TO SKIP ON MULTIPLE             00420002
.*                                      PRINT OR NBR OF SPACES          00480002
.*                                      TO BACK UP FROM COLUMN FOR      00540002
.*                                      START OF PRINTING. THE LETTER   00600002
.*                                      B PRECEEDS THE NUMBER (B5) IF   00660002
.*                                      THE LATTER IS DESIRED. OMISSION 00720002
.*                                      OF THIS OPERAND FORCES OPTION 2 00780002
.*                                      WITH BACKUP SPACING EQUAL TO    00840002
.*                                 THE NUMBER OF BITS IN THE ITEM       00900002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      00960002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     01020002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       01080002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             01140002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  01200002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  01260002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              01320002
         GBLA  &NRENTS,&SHIFT(3000)                                     01380002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           01440002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       01500002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         01560002
         LCLB  &B,&SUB                                                  01620002
         LCLA  &IBITS,&ISHIFT,&K                                        01680002
         LCLA  &TEMP,&T,&OP                                             01740002
         LCLC  &S,&ARG                                                  01800002
          ACTR  500000                                                  01860002
         AIF   (&DIAGTST EQ 0).NOMSG                                    01920002
         AIF   (&INITIAL EQ 0).NOMSG                                    01980002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    02040002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  02100002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     02160002
*        LINE                                                           02220002
         LINE                                                           02280002
.NOMSG   ANOP                                                           02340002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  02400002
&SUB     SETB  1                                                        02460002
.LOOP    ANOP                                                           02520002
&OP      SETA  &OP+1                                                    02580002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        02640002
         ITEMFIND &ARG                                                  02700002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    02760002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         02820002
&IBITS   SETA  &BITS(&ITEMXPT)                                          02880002
         AIF   (&SUB EQ 1).SUB00                                        02940002
         AIF   ('&SYSLIST(3)' EQ '').SETT                               03000002
&IBITS   SETA  &SYSLIST(3)                                              03060002
         AGO   .SETT                                                    03120002
.SUB00   AIF   ('&SYSLIST(&OP,3)' EQ '').SETT                           03180002
&IBITS   SETA  &SYSLIST(&OP,3)                                          03240002
.SETT    ANOP                                                           03300002
&T       SETA  &IBITS-1                                                 03360002
&B       SETB  0                                                        03420002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      03480002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  03540002
.MEXIT   MEXIT                                                          03600002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         03660002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             03720002
&K       SETA  K'&SYSLIST(2)                                            03780002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              03840002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                03900002
         AGO   .SUBB                                                    03960002
.SUBA    ANOP                                                           04020002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         04080002
&K       SETA  K'&SYSLIST(&OP,2)                                        04140002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          04200002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            04260002
.SUBB    ANOP                                                           04320002
&T       SETA  &S                                                       04380002
.BACKUP  ANOP                                                           04440002
&NRENTS  SETA  &NRENTS+1                                                04500002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            04560002
&TEMP    SETA  &ISHIFT                                                  04620002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                04680002
         AGO   .OUT                                                     04740002
         AIF   (&SUB EQ 1).BIN2                                         04800002
         AIF   ('&SYSLIST(2)' NE '').BIN3                               04860002
         AGO   .BIN2A                                                   04920002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           04980002
.BIN2A   ANOP                                                           05040002
&B       SETB  1                                                        05100002
.BIN3    ANOP                                                           05160002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    05220002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             05280002
.OUT     ANOP                                                           05340002
&ITEMXPT     SETA  0                                                    05400002
         AIF   (&SUB EQ 0).OUTA                                         05460002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 05520002
.OUTA    ANOP                                                           05580002
         MEND                                                           05640002
         MACRO                                                          05700002
&NAME    DSGEN ,                                                        05760002
.*                            THIS MACRO GENERATES ONE DSECT WORD       05820002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 05880002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  05940002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    06000002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 06060002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   06120002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 06180002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      06240002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  06300002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    06360002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   06420002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             06480002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  06540002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  06600002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              06660002
         GBLA  &NRENTS,&SHIFT(3000)                                     06720002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           06780002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       06840002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         06900002
         LCLB  &ONLY1,&CTIND                                            06960002
         LCLA  &START1,&START2,&END1,&END2                              07020002
         LCLC  &SYMBOL,&EQUSYM                                          07080002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 07140002
         ACTR  100000                                                   07200002
         AIF   (&ITEMITR EQ 0).START                                    07260002
 MNOTE   20,'DSGEN MACRO OCCURRS AFTER ITEMSORT MACRO HAS BEEN ISSUED.' 07320002
         MEXIT                                                          07380002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            07440002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     07500002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   07560002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        07620002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            07680002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             07740002
         AGO   .SET2A                   BRANCH AROUND                   07800002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        07860002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              07920002
         MEXIT                                                          07980002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X08040002
               ).SET2                   TEST FOR NO SECOND              08100002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   08160002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            08220002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              08280002
         AGO   .LOOP                                                    08340002
.SET2    ANOP                                                           08400002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 08460002
         AGO   .LOOP                                                    08520002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             08580002
         MEXIT                                                          08640002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               08700002
         MEXIT                                                          08760002
.LOOP    ANOP                                                           08820002
&OP      SETA  &OP+1                                                    08880002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           08940002
&ITEMNBR SETA  &ITEMNBR+1                                               09000002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            09060002
         MNOTE '**NULL BIT COUNT FIELD**'                               09120002
         MEXIT                                                          09180002
.OK1     ANOP                                                           09240002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        09300002
         AIF   ('&SYMBOL' NE '').OK                                     09360002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         09420002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         09480002
         AGO   .START                   GET NEXT                        09540002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        09600002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          09660002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        09720002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         09780002
         AGO   .NO3                     BRANCH AROUND                   09840002
.OK2     ANOP                                                           09900002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              09960002
.NO3     ANOP                                                           10020002
&SYMBOL  EQU   *+&BYTE                                                  10080002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             10140002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    10200002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    10260002
.CNT     ANOP                                                           10320002
&CTIND   SETB  1                        SET COUNT INDICATOR             10380002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   10440002
&BYTE    SETA  &COUNT/8                                                 10500002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        10560002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        10620002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             10680002
&END1    SETA  &END1+1                  INCREMENT COUNT                 10740002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             10800002
         AGO   .LOOP                    GENERATE NEXT                   10860002
.TSTST   ANOP                                                           10920002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               10980002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        11040002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      11100002
.NSET1   ANOP                                                           11160002
&OP      SETA  &OP-1                    DECREMENT INDEX                 11220002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           11280002
         AGO   .LOOP                    GO DO NEXT                      11340002
.LPDONE  ANOP                                                           11400002
&ONLY1   SETB  0                        CLEAR INDICATOR                 11460002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      11520002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 11580002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               11640002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             11700002
&NAME    DS    &COUNT.C                                                 11760002
.END     MEXIT                                                          11820002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          11880002
         MEXIT                                                          11940002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   12000002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   12060002
         MEXIT                                                          12120002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         12180002
*****               THE FOLLOWING STATEMENT                *****        12240002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        12300002
.EQU2    ANOP                                                           12360002
&EQUCNT  SETA  0                        CLEAR COUNTER                   12420002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 12480002
.EQULOP  ANOP                                                           12540002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 12600002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     12660002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                12720002
         AGO   .EQULOP                  NO-GET NEXT                     12780002
.EQUOUT  ANOP                                                           12840002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  12900002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              12960002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 13020002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             13080002
         AGO   .START                   RETURN FOR NEXT                 13140002
         MEND                                                           13200002
         MACRO                                                          13260002
         CONVT ,                                                        13320002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             13380002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  13440002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  13500002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              13560002
         GBLA  &NRENTS,&SHIFT(3000)                                     13620002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           13680002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       13740002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         13800002
         LCLB  &SUB                                                     13860002
         LCLA  &OP                                                      13920002
         LCLA  &OFFSET,&OUT,&IN,&IND,&IBITS,&ISHIFT                     13980002
.*                                                                      14040002
.*       CONVERT BINARY TO DECIMAL                                      14100002
.*             &NAME IS THE REFERENCE INTO THE DSECT RECORD             14160002
.*             &OUT    IS THE NUMBER OF CHARS TO BE PUT ONTO PRINT LINE 14220002
.*                                      DEFAULT IS FOUR MAXIMUM IS 8    14280002
.*             &IN       IS THE NUMBER OF BYTES AS INPUT                14340002
.*                                      ERROR DEFAULT IS 2 MAXIMUM IS 4 14400002
.*                                                                      14460002
         AIF   (&DIAGTST EQ 0).NOMSG                                    14520002
         AIF   (&INITIAL EQ 0).NOMSG                                    14580002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    14640002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  14700002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     14760002
*        LINE                                                           14820002
         LINE                                                           14880002
.NOMSG   ANOP                                                           14940002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LLOP                  15000002
&SUB     SETB  1                                                        15060002
.LLOP    ANOP                                                           15120002
&OP      SETA  &OP+1                                                    15180002
&OUT     SETA  4                        .BR NOT NULL ELSE SET TO 4      15240002
         AIF   (&SUB EQ 1).SUBA                                         15300002
         AIF   ('&SYSLIST(3)' EQ '').B  TEST FOR NULL INPUT             15360002
&OUT     SETA  &SYSLIST(3)             SET &OUT FROM INPUT              15420002
         AGO   .A                                                       15480002
.SUBA    AIF   ('&SYSLIST(&OP,3)' EQ '').B                              15540002
&OUT     SETA  &SYSLIST(&OP,3)          SET &OUT FROM INPUT             15600002
.A       AIF   (&OUT GT 0 AND &OUT LT 9).B   TEST RANGE                 15660002
.AERR    MNOTE '*** BYTES OUT INCORRECTLY SPECIFIED DEFAULT USED ***'   15720002
&OUT     SETA  4                                                        15780002
.B       AIF   (&SUB EQ 1).SUBB                                         15840002
         AIF   ('&SYSLIST(2)' EQ '').LOOP    BRANCH IF NULL             15900002
&IN      SETA  &SYSLIST(2)              .SET &IN FROM INPUT             15960002
         AGO   .BB                                                      16020002
.SUBB    AIF   ('&SYSLIST(&OP,2)' EQ '').LOOP                           16080002
&IN      SETA  &SYSLIST(&OP,2)          .SET &IN FROM INPUT             16140002
.BB      AIF   (&IN GT 0 AND &IN LT 5).D     TEST RANGE                 16200002
.BERR    MNOTE '*** BYTES IN INCORRECTLY SPECIFIED DEFAULT USED ***'    16260002
&IN      SETA  2                                                        16320002
         AGO   .D                                                       16380002
.LOOP    ANOP                           .LOOP TO FIND &NAME IN DSECT    16440002
&IND     SETA  &IND+1                   .SET UP LOOP COUNTER            16500002
         AIF   ('&ITEM(&IND)' EQ '&SYSLIST(&OP,1)').FOUND               16560002
         AIF   (&IND LT &ITEMNBR).LOOP  .TEST FOR END OF DSECT          16620002
         MNOTE '*** LOG ITEM NOT DEFINED ***'                           16680002
         MEXIT                                                          16740002
.FOUND   ANOP                                                           16800002
&IBITS   SETA  &BITS(&IND)              .SET UP NUMBER OF BITS SPEC     16860002
         AIF   (&IBITS-((&IBITS/8)*8) EQ 0).C  .TEST FOR MULTIPLE OF 8  16920002
         MNOTE '*** DATA NOT DEFINED A MULTIPLE OF 8 BITS ***'          16980002
         MEXIT                                                          17040002
.C       ANOP                                                           17100002
&IN      SETA  &IBITS/8                 .COMPUTE NUMBER OF BYTES        17160002
         AIF   (&IN LT 1 OR &IN GT 4).BERR  .TEST RANGE B IF IN ERROR   17220002
&ISHIFT  SETA  &SHIFT(&IND)             .SET UP FOR TEST OF BYTE BNDR   17280002
         AIF   (&ISHIFT EQ 0).D         .TEST FOR BYTE BNDRY            17340002
         MNOTE '*** DATA NOT ALIGNED ON A BYTE BOUNDARY ***'            17400002
         MEXIT                                                          17460002
.*                                                                      17520002
.D       ANOP                                                           17580002
&NRENTS  SETA  &NRENTS+1                                                17640002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),AL.4(9)                    17700002
         DC    X'&IN',X'&OUT'                                           17760002
&IND     SETA  0                                                        17820002
         AIF   (&SUB EQ 0).OUTA                                         17880002
         AIF   (&OP LT N'&SYSLIST).LLOP                                 17940002
.OUTA    ANOP                                                           18000002
         MEND                                                           18060002
         MACRO                                                          18120002
         ITEMFIND &ARG,&ITFDIAG=                                        18180002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             18240002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  18300002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  18360002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              18420002
         GBLA  &NRENTS,&SHIFT(3000)                                     18480002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           18540002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       18600002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         18660002
         LCLA  &A,&B,&X,&I                                              18720002
         LCLC  &C1,&C2,&S                                               18780002
         ACTR  100000                                                   18840002
&ITEMXPT SETA  0                  INDICATE ITEM NOT FOUND.              18900002
         AIF   ('&ARG' NE '').NORM                                      18960002
         AIF   ('&ITFDIAG' EQ 'OFF'  OR  '&ITFDIAG' EQ 'ON').DIAGSET    19020002
  MNOTE 0,'ITEMFIND - OPERAND (&ITFDIAG) INVALID FOR ITFDIAG KEYWORD.'  19080002
         MEXIT                                                          19140002
.DIAGSET ANOP                                                           19200002
&DIAGITF SETB  ('&ITFDIAG' EQ 'ON')                                     19260002
         MEXIT                                                          19320002
.NORM    AIF   (&ITEMITR GT 0).SORTED                                   19380002
         ITEMSORT                                                       19440002
.SORTED  ANOP                                                           19500002
&I       SETA  &ITEMITR           COMPUTED ITTERATION COUNT.            19560002
&X       SETA  &ITEMMDX           COMPUTED MAXIMUM INDEX.               19620002
&C1      SETC  '&ARG'             ISOLATE SEARCH ARGUMENT.              19680002
&C1      SETC  '&C1'.'       '(1,8-K'&C1) PAD TO FULL 8 CHARACTERS.     19740002
.SRCHUP  ANOP                                                           19800002
&A       SETA  &A+&X              CURRENT TABLE SUBSCRIPT + INDEX.      19860002
&S       SETC  '+'                                                      19920002
         AIF   (&A  GT &ITEMNBR  AND  NOT &DIAGITF).SRCHDN1             19980002
         AIF   (&A  LE &ITEMNBR).SRCH00                                 20040002
&C2      SETC  '*-OVER-*'                                               20100002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         20160002
&X       SETA  &X/2               HALVE INDEX VALUE.                    20220002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X'                     20280002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      20340002
.NOFIND  MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   20400002
         MEXIT                                                          20460002
.SRCH00  ANOP                                                           20520002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         20580002
         AIF   (&I LT 0).NOFIND   IF COUNT HAS GONE TO ZERO.            20640002
&X       SETA  &X/2               HALVE INDEX VALUE.                    20700002
&B       SETA  &ITEMNDX(&A)       GET SUBSCRIPT FROM INDEX TABLE.       20760002
&C2      SETC  '&ITEM(&B)'.'       '(1,8-K'&ITEM(&B))  PAD COMPARAND.   20820002
         AIF   (NOT &DIAGITF).COMPARE                                   20880002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X   POS = &B'          20940002
.COMPARE AIF   ('&C1' LT '&C2').SRCHDWN   ARGUMENT LOWER, MOVE DOWN.    21000002
         AIF   ('&C1' GT '&C2').SRCHUP    ARGUMENT HIGHER, MOVE UP.     21060002
&ITEMXPT SETA  &B                 FOUND. SET INDEX POINTER FOR RETURN.  21120002
&ITEMFST(&I+1)  SETA  &ITEMFST(&I+1)+1                                  21180002
         MEXIT                                                          21240002
.SRCHDWN ANOP                                                           21300002
&A       SETA  &A-&X              CURRENT POINTER MINUS INDEX VALUE.    21360002
&S       SETC  '-'                                                      21420002
         AIF   (&A LE &ITEMNBR).SRCH00    IF WITHIN BOUNDS OF TABLE.    21480002
.SRCHDN1 ANOP                                                           21540002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         21600002
&X       SETA  &X/2               HALVE INDEX VALUE.                    21660002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      21720002
         MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   21780002
         MEND                                                           21840002
         MACRO                                                          21900002
         ITEMSORT  &DUMMY                                               21960002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             22020002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  22080002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  22140002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              22200002
         GBLA  &NRENTS,&SHIFT(3000)                                     22260002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           22320002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       22380002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         22440002
         LCLA  &R,&ZI,&I,&A1,&A2,&TEMP                                  22500002
         LCLB  &SR,&GOTO,&TB                                            22560002
         LCLB   &SW(4000)                                               22620002
         LCLC  &C1,&C2                                                  22680002
         ACTR   200000                                                  22740002
&A1      SETA  0                                                        22800002
         AIF   (&ITEMITR EQ 0).LOOP0   TEST FOR RE-ENTRY.               22860002
 MNOTE   0,'ITEMSORT MACRO OCCURRS MORE THAN ONCE. TABLE NOT RESORTED.' 22920002
         MEXIT                                                          22980002
.LOOP0   ANOP                                                           23040002
&A1      SETA  &A1+1                                                    23100002
&ITEMNDX(&A1) SETA &A1                                                  23160002
         AIF   (&A1 LT &ITEMNBR).LOOP0                                  23220002
         AIF   (&ITEMNBR LT 2).MEXIT                                    23280002
&A1      SETA  &ITEMNBR/2         HALF OF TOTAL ENTRIES.                23340002
&A2      SETA  0                                                        23400002
.LOOP1   ANOP                                                           23460002
&A2      SETA  &A2+1                                                    23520002
&SW(&A2) SETB  1                  SET FIRST HALF OF SWITCHES TO 1.      23580002
         AIF   (&A2 LT &A1).LOOP1                                       23640002
.LOOP2   ANOP                                                           23700002
&A2      SETA  &A2+1                                                    23760002
&SW(&A2) SETB  0                  SET SECOND HALF TO ZERO.              23820002
         AIF   (&A2 LT &ITEMNBR).LOOP2                                  23880002
&R       SETA  0                  SET R TO FIRST TRIAL ITEM.            23940002
&ZI      SETA  &ITEMNBR-1         SET ZI TO LAST ITEM.                  24000002
&I       SETA  &ZI-1                                                    24060002
.T3      ANOP                                                           24120002
&SR      SETB  (&SW(&R+1))        GET FLAG, WHICH WAY TO GO?            24180002
&R       SETA  (&R*2)+1+&SR       R=2R+(1 OR 2)                         24240002
         AIF   (&R LE &I).T3                                            24300002
.T4      ANOP                                                           24360002
&R       SETA  (&R-1)/2           R=(R-1)/2                             24420002
&SR      SETB  (&SW(&R+1))        GET SUBTREE SELECT FLAG.              24480002
         AIF   (&SR EQ 0).T7                                            24540002
         AIF   (&GOTO EQ 0).T5                                          24600002
.T7      ANOP                                                           24660002
&A1      SETA  &ITEMNDX(&R+1)                                           24720002
&A2      SETA  &ITEMNDX(&ZI+1)                                          24780002
&C1      SETC  '&ITEM(&A1)'.'       '(1,8-K'&ITEM(&A1))                 24840002
&C2      SETC  '&ITEM(&A2)'.'       '(1,8-K'&ITEM(&A2))                 24900002
         AIF   ('&C1' LT '&C2').T8                                      24960002
.T9      ANOP                                                           25020002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         25080002
&TB      SETB  (&SW(&R+1))                                              25140002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     25200002
&SW(&R+1) SETB (&SW(&ZI+1))                                             25260002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          25320002
&SW(&ZI+1) SETB (&TB)                                                   25380002
&SR      SETB  (&SR EQ 0)                                               25440002
&SW(&R+1) SETB (&SR)                                                    25500002
.T8      AIF   (&R GT 0).T4                                             25560002
&GOTO    SETB  1                  SET 'GO TO' T7                        25620002
&ZI      SETA  &ZI-1                                                    25680002
&I       SETA  &I-1                                                     25740002
         AIF   (&I GE 0).T3                                             25800002
.MEXIT   ANOP                                                           25860002
&ITEMITR SETA 1                                                         25920002
&ITEMMDX SETA 1                                                         25980002
.ITRLOOP ANOP                                                           26040002
&ITEMITR SETA &ITEMITR+1                                                26100002
&ITEMMDX SETA &ITEMMDX+&ITEMMDX                                         26160002
         AIF  (&ITEMMDX LT &ITEMNBR).ITRLOOP                            26220002
&ITEMITR SETA &ITEMITR-1                                                26280002
&ITEMMDX SETA &ITEMMDX/2                                                26340002
&A1      SETA &ITEMNBR                                                  26400002
&A2      SETA &ITEMMDX                                                  26460002
&TEMP    SETA &ITEMITR                                                  26520002
 MNOTE *,' ITEMS = &A1, MAX INDEX = &A2, ITTERATION COUNT = &TEMP'      26580002
         MEXIT                                                          26640002
.T5      ANOP                                                           26700002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         26760002
&TB      SETB  (&SW(&R+1))                                              26820002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     26880002
&SW(&R+1) SETB (&SW(&ZI+1))                                             26940002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          27000002
&SW(&ZI+1) SETB (&TB)                                                   27060002
&SR      SETB  (&SR EQ 0)                                               27120002
&SW(&R+1) SETB (&SR)                                                    27180002
         AGO   .T3                                                      27240002
         MEND                                                           27300002
           MACRO                                                        27360002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C27420002
               &LABEL7,&LABEL8                                          27480002
.*                                 THIS MACRO ALLOWS LABELS TO          27540002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   27600002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  27660002
.*                                 TION MARKS. THE COLUMN AND LINE END  27720002
.*                                 CONTROLS WILL BE INSERTED BY THE     27780002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      27840002
.*                                 LABEL REQUIRED FOR RESPECTIVE        27900002
.*                                 COLUMN.                              27960002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             28020002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  28080002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  28140002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              28200002
         GBLA  &NRENTS,&SHIFT(3000)                                     28260002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           28320002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       28380002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         28440002
         LCLC  &MARGIN,&TACK                                            28500002
         LCLC  &TEXT                                                    28560002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            28620002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  28680002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  28740002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  28800002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             28860002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   28920002
*        LINE                                                           28980002
         LINE                                                           29040002
.DIAGCLR ANOP                                                           29100002
&DIAGSET SETB  0                                                        29160002
&DIAGLIN SETB  0                                                        29220002
&MARGIN  SETC  '*'                                                      29280002
         AIF   ('&NAME' EQ '').LOOPOUT                                  29340002
&LPTR    SETA  &LPTR+1                                                  29400002
&LBL(&LPTR) SETC '&NAME'                                                29460002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          29520002
.LOOPOUT ANOP                                                           29580002
&OP      SETA  &OP+1                                                    29640002
&K       SETA  K'&SYSLIST(&OP)                                          29700002
         AIF (&K GE 2).NORM                                             29760002
&K       SETA  2                                                        29820002
.NORM    ANOP                                                           29880002
&START   SETA  2                                                        29940002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                30000002
&MARGIN  SETC  '$'                                                      30060002
.NOTLAST ANOP                                                           30120002
&NRCHAR  SETA  8                                                        30180002
&TACK    SETC  ''                                                       30240002
.LOOPIN  ANOP                                                           30300002
&REMAIN  SETA  &K-&START                                                30360002
         AIF (&REMAIN GE 8).MORE                                        30420002
&TACK    SETC  '&MARGIN'                                                30480002
&NRCHAR  SETA  &REMAIN                                                  30540002
.MORE    ANOP                                                           30600002
&TEXT    SETC  ''                                                       30660002
         AIF (&REMAIN EQ 0).ENDTEXT                                     30720002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          30780002
.ENDTEXT ANOP                                                           30840002
&LABELNR SETA  &LABELNR+1                                               30900002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  30960002
&START   SETA  &START+8                                                 31020002
         AIF ('&TACK' EQ '').LOOPIN                                     31080002
         AIF ('&TACK' EQ '*').LOOPOUT                                   31140002
         MEND                                                           31200002
         MACRO                                                          31260002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      31320002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     31380002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    31440002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 31500002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    31560002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    31620002
.*                                 THE PREVIOUS LINE AND STORES THAT #  31680002
.*                                 INTO THE APPROPRIATE BYTE.           31740002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    31800002
.*                                 DATA.                                31860002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 31920002
.*                                 DATA COLUMN STARTING CHARACTERS.     31980002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   32040002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 32100002
.*                                 STARTING CHARACTERS.                 32160002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   32220002
.*                                 TO BEGIN NEXT PRINTED LINE.          32280002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       32340002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   32400002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 32460002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   32520002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 32580002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    32640002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   32700002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   32760002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  32820002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   32880002
.*                                 THE SUBJECT LINE                     32940002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             33000002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  33060002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  33120002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              33180002
         GBLA  &NRENTS,&SHIFT(3000)                                     33240002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           33300002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       33360002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         33420002
         LCLA  &S                                                       33480002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 33540002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  33600002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  33660002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   33720002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       33780002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 33840002
.DIAGSET ANOP                                                           33900002
&DIAGSET SETB  1                                                        33960002
&DIAGLIN SETB  1                                                        34020002
&NAME    DS    0C                                                       34080002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  34140002
         LINEND                                                         34200002
         AGO   .NTFIRST                                                 34260002
.FIRSTLN ANOP                                                           34320002
&NRENTSX SETC  'N&SYSNDX'                                               34380002
&INITIAL SETA  1                                                        34440002
N&SYSNDX EQU   *                                                        34500002
.NTFIRST ANOP                                                           34560002
         DC    AL1(0)                                                   34620002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               34680002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                34740002
&DB      SETA  &DATA(1)                                                 34800002
         AGO   .AA                                                      34860002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                34920002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 34980002
         AGO   .CC                                                      35040002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    35100002
         AIF   (&DATA(2) EQ &DT).BB                                     35160002
.CC      ANOP                                                           35220002
&DT      SETA  &DATA(2)                                                 35280002
.BB      DC    XL2'FFFE'                                                35340002
         DC    FL1'&DB'                                                 35400002
         DC    FL1'&DT'                                                 35460002
&NRENTS  SETA  &NRENTS+1                                                35520002
.NCDATA  ANOP                                                           35580002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              35640002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               35700002
&LB      SETA  &LABEL(1)                                                35760002
         AGO   .AAA                                                     35820002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              35880002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               35940002
         AGO   .CCC                                                     36000002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  36060002
         AIF   (&LABEL(2) EQ &LT).BBB                                   36120002
.CCC     ANOP                                                           36180002
&LT      SETA  &LABEL(2)                                                36240002
.BBB     DC    XL2'FFFF'                                                36300002
         DC    FL1'&LB'                                                 36360002
         DC    FL1'&LT'                                                 36420002
&NRENTS  SETA  &NRENTS+1                                                36480002
.NCLABEL ANOP                                                           36540002
         AIF   ('&SKIP' NE '').CONT                                     36600002
         AIF   (&TEST EQ 0).NOCHANG                                     36660002
         AGO   .DEFALTA                                                 36720002
.CONT    ANOP                                                           36780002
         AIF   (&TEST EQ 0).AB                                          36840002
         AIF   ('&SKIP' EQ 'E').AB                                      36900002
&S       SETA  &SKIP                                                    36960002
.DEFAULT ANOP                                                           37020002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               37080002
         ORG   &CARRCON+3                                               37140002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 37200002
         ORG                                                            37260002
&LASTCC  SETA  &S                                                       37320002
.DEFALTA ANOP                                                           37380002
&TEST    SETB  0                                                        37440002
         AGO   .DD                                                      37500002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     37560002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           37620002
&LASTCC  SETA  184                                                      37680002
&TEST    SETB  1                                                        37740002
         AGO   .ABC                                                     37800002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               37860002
A&SYSNDX DC    XL2'FFFB'                                                37920002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              37980002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              38040002
&LASTCC  SETA  &SKIP                                                    38100002
&TEST    SETB  1                                                        38160002
.ABC     ANOP                                                           38220002
&CARRCON SETC  'A&SYSNDX'                                               38280002
&NRENTS  SETA  &NRENTS+1                                                38340002
.DD      ANOP                                                           38400002
.NOCHANG ANOP                                                           38460002
         MEND                                                           38520002
         MACRO                                                          38580002
         LINEND ,                                                       38640002
.*                                 THIS MACRO IS USED ONLY BY THE LINE  38700002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   38760002
.*                                 ASSOCIATED WITH EACH LINE.           38820002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             38880002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  38940002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  39000002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              39060002
         GBLA  &NRENTS,&SHIFT(3000)                                     39120002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           39180002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       39240002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         39300002
         ORG   &NRENTSX                                                 39360002
         DC    FL1'&NRENTS'                                             39420002
         ORG                                                            39480002
&NRENTS  SETA  0                                                        39540002
B&SYSNDX EQU   *                                                        39600002
&NRENTSX SETC  'B&SYSNDX'                                               39660002
         MEND                                                           39720002
         MACRO                                                          39780002
         LSTART ,                                                       39840002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  39900002
.*                                 OF THE TABLE IS TO BEGIN.            39960002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             40020002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  40080002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  40140002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              40200002
         GBLA  &NRENTS,&SHIFT(3000)                                     40260002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           40320002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       40380002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         40440002
         LCLA  &NDX,&CTR                                                40500002
         ACTR  500000                                                   40560002
         AIF   (&DIAGTST EQ 0).NODIAG                                   40620002
         AIF   (&DIAGSET EQ 0).NODIAG                                   40680002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  40740002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   40800002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       40860002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 40920002
.NODIAG  ANOP                                                           40980002
         LINEND                                                         41040002
&CTR     SETA  1                                                        41100002
.LOOP    ANOP                                                           41160002
&NDX     SETA  &NDX+1                                                   41220002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            41280002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         41340002
&CTR     SETA  &CTR+1                                                   41400002
         AGO   .LOOPCTL                                                 41460002
.NOLBL   ANOP                                                           41520002
         DC    C'&LABELS(&NDX)'                                         41580002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  41640002
         MEND                                                           41700002
         MACRO                                                          41760002
&NAME    ROUTINE &LOGITEM,&RNAME                                        41820002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             41880002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  41940002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  42000002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              42060002
         GBLA  &NRENTS,&SHIFT(3000)                                     42120002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           42180002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       42240002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         42300002
         AIF   (&DIAGTST EQ 0).NOMSG                                    42360002
         AIF   (&INITIAL EQ 0).NOMSG                                    42420002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    42480002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               42540002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     42600002
*        LINE                                                           42660002
         LINE                                                           42720002
.NOMSG   ANOP                                                           42780002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           42840002
         DC    AL2(&RNAME-&CSECT)                                       42900002
&NRENTS  SETA  &NRENTS+1                                                42960002
         MEND                                                           43020002
         MACRO                                                          43080002
         SPECIAL &ROUTINE,&PARAM,&SPACE=                                43140002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    43200002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 43260002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 43320002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   43380002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 43440002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    43500002
.*                                 SPECIAL ROUTINE.                     43560002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  43620002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    43680002
         GBLC  &CSECT                                                   43740002
         GBLA  &COUNTR                                                  43800002
         LCLA  &ADD                                                     43860002
         DC    AL1(128)                                                 43920002
         DC    BL.8'&PARAM'                                             43980002
         DC    AL2(&ROUTINE-&CSECT)                                     44040002
         DC    AL2(&COUNTR)                                             44100002
&ADD     SETA  1                                                        44160002
         AIF   ('&SPACE' EQ '').NORM                                    44220002
&ADD     SETA  &SPACE                                                   44280002
.NORM    ANOP                                                           44340002
&COUNTR  SETA  &COUNTR+&ADD                                             44400002
         MEND                                                           44460002
         MACRO                                                          44520002
         HEX   ,                                                        44580002
.*                            THIS MACRO FACILITATES GENERATION OF THE  44640002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    44700002
.*                                 CONVERSIONS.                         44760002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 44820002
.*                                 CONVERTED                            44880002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  44940002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   45000002
.*                                 BACK UP FROM COLUMN FOR START OF     45060002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  45120002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  45180002
.*                                 DESIRED. OMISSION OF THIS OPERAND    45240002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  45300002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  45360002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 45420002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    45480002
.*                                 IMPLICITLY B).                       45540002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      45600002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     45660002
.*                                 WITH AN L,R, OR B TO STIPULATE       45720002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     45780002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     45840002
.*                                 RESPECTIVELY. OMISSION OF THIS       45900002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  45960002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 46020002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 46080002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   46140002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     46200002
.*                                 SUBJECT LINE(S).                     46260002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             46320002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  46380002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  46440002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              46500002
         GBLA  &NRENTS,&SHIFT(3000)                                     46560002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           46620002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       46680002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         46740002
         LCLB  &B,&SUB                                                  46800002
         LCLA  &IBITS,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP                   46860002
         LCLC  &S,&LETTER,&ARG                                          46920002
       ACTR  500000                                                     46980002
         AIF   (&DIAGTST EQ 0).NOMSG                                    47040002
         AIF   (&INITIAL EQ 0).NOMSG                                    47100002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    47160002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  47220002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     47280002
*        LINE                                                           47340002
         LINE                                                           47400002
.NOMSG   ANOP                                                           47460002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  47520002
&SUB     SETB  1                                                        47580002
.LOOP    ANOP                                                           47640002
&OP      SETA  &OP+1                                                    47700002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        47760002
         ITEMFIND  &ARG                                                 47820002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    47880002
.FOUND   ANOP                                                           47940002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         48000002
&IBITS   SETA  &BITS(&ITEMXPT)                                          48060002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     48120002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          48180002
.MEXIT   MEXIT                                                          48240002
.ALIGN   ANOP                                                           48300002
&CODE    SETA  1                                                        48360002
         AIF   (&SUB EQ 1).SUBA                                         48420002
&K       SETA  K'&SYSLIST(3)                                            48480002
         AGO   .SUBB                                                    48540002
.SUBA    ANOP                                                           48600002
&K       SETA  K'&SYSLIST(&OP,3)                                        48660002
.SUBB    ANOP                                                           48720002
         AIF   (&K EQ 1).ERR3                                           48780002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            48840002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 48900002
         MEXIT                                                          48960002
.OK      AIF   (&SUB EQ 1).SUBC                                         49020002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            49080002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      49140002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    49200002
         AGO   .SUBD                                                    49260002
.SUBC    ANOP                                                           49320002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        49380002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  49440002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                49500002
.SUBD    ANOP                                                           49560002
&BYTESP  SETA  &S                                                       49620002
         AIF   ('&LETTER' EQ 'B').BOTH                                  49680002
         AIF   ('&LETTER' EQ 'L').LEFT                                  49740002
         AIF   ('&LETTER' EQ 'R').RIGHT                                 49800002
.ERR3    MNOTE '**PARAMETER 3 INCOMPLETE-DSGEN DEFINITION USED**'       49860002
         AGO   .USEDEFN                                                 49920002
.RIGHT   ANOP                                                           49980002
&CODE    SETA  2                                                        50040002
         AGO   .L                                                       50100002
.LEFT    ANOP                                                           50160002
&CODE    SETA  1                                                        50220002
         AGO   .L                                                       50280002
.USEDEFN ANOP                                                           50340002
&BYTESP  SETA  &IBITS/8                                                 50400002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       50460002
&CODE    SETA  3                                                        50520002
&T       SETA  &BYTESP*2-1                                              50580002
&S       SETC  '&T'                                                     50640002
.OK2     AIF   (&ISHIFT EQ 0).L                                         50700002
&CODE    SETA  2                                                        50760002
.L       ANOP                                                           50820002
&B       SETB  1                                                        50880002
         AIF   (&SUB EQ 1).SUBE                                         50940002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             51000002
&K       SETA  K'&SYSLIST(2)                                            51060002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              51120002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                51180002
         AGO   .SUBF                                                    51240002
.SUBE    ANOP                                                           51300002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         51360002
&K       SETA  K'&SYSLIST(&OP,2)                                        51420002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          51480002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            51540002
.SUBF    ANOP                                                           51600002
.BACKUP  ANOP                                                           51660002
&NRENTS  SETA  &NRENTS+1                                                51720002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    51780002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 51840002
         MEXIT                                                          51900002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         51960002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        52020002
         AGO   .SUBH                                                    52080002
.SUBG    ANOP                                                           52140002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    52200002
.SUBH    ANOP                                                           52260002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              52320002
.OUT     ANOP                                                           52380002
&ITEMXPT     SETA  0                                                    52440002
         AIF   (&SUB EQ 0).OUTA                                         52500002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 52560002
.OUTA    ANOP                                                           52620002
         MEND                                                           52680002
         MACRO                                                          52740002
         SUM   &LOGITEM,&MASK                                           52800002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  52860002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 52920002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 52980002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  53040002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   53100002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   53160002
.*                                 MASK WILL BE SET ACCORDING TO THE    53220002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     53280002
.*                                 ITEM AS DEFINED BY THE MACRO 'DSGEN' 53340002
         GBLA  &COUNTR,&ITEMNBR,&BITS(3000),&SHIFT(3000)                53400002
         GBLC  &ITEM(3000),&DSECT                                       53460002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           53520002
.LOOP    ANOP                                                           53580002
&NDX     SETA  &NDX+1                                                   53640002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      53700002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  53760002
         MNOTE *,'LOGITEM NOT FOUND'                                    53820002
         MEXIT                                                          53880002
.FOUND   ANOP                                                           53940002
&ISHIFT  SETA  &SHIFT(&NDX)                                             54000002
&IBITS   SETA  &BITS(&NDX)                                              54060002
         AIF   (&IBITS EQ 1).FORM1      TEST FOR OLD FORM               54120002
         AIF   ('&MASK' NE '').FORM1    TEST FOR MASK                   54180002
         AIF   (&IBITS+&ISHIFT GT 8).MSG     TEST FOR MORE THAN EIGHT   54240002
         DC    AL.1(0),AL.3(&ISHIFT),AL.4(&IBITS)                       54300002
         DC    AL1(0)                                                   54360002
         AGO   .ITEM                                                    54420002
.MSG     MNOTE '**BITS GREATER THAN 8**'                                54480002
         MEXIT                                                          54540002
.FORM1   ANOP                                                           54600002
         DC    AL1(0)                                                   54660002
         AIF   ('&MASK' EQ '').FORM                                     54720002
         DC    B'&MASK'                                                 54780002
         AGO   .ITEM                                                    54840002
.FORM    ANOP                                                           54900002
&BITNBR  SETA  &ISHIFT-7                                                54960002
&BITNBR  SETA  0-&BITNBR                                                55020002
&M       SETA  1                                                        55080002
.LOOP2   ANOP                                                           55140002
         AIF   (&BITNBR EQ 0).GOTIT                                     55200002
&M       SETA  &M*2                                                     55260002
&BITNBR  SETA  &BITNBR-1                                                55320002
         AGO   .LOOP2                                                   55380002
.GOTIT   ANOP                                                           55440002
         DC    AL1(&M)                                                  55500002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     55560002
         DC    AL2(&COUNTR)                                             55620002
&COUNTR  SETA  &COUNTR+1                                                55680002
         MEND                                                           55740002
* THIS MODULE SUPPORTS ARGONAUT DEVICE --- SUPPORT CODE =               55800002
         GBLC  &DSECT,&CSECT                                            55860002
&CSECT   SETC  'IFCEXXXF'                                               55920002
&DSECT   SETC  'RECORD'                                                 55980002
IFCEXXXF CSECT                                                          56040002
*****          D S E C T   G E N E R A T I O N   E N T R I E S    ***** 56100002
RECORD   DSECT                                                          56160002
         DS    0F                                                       56220002
         DSGEN (CLASRC,8),              RECORD TYPE                    X56280002
               (SYSREL,8),              SYSTEM & RELEASE LEVEL         X56340002
               (SWITCH,8,0,3),          SWITCHES(4 OF EM)              X56400002
               (RCDCNT,8),              COUNT & MULTI PART INDICATION  X56460002
               (SPARE1,8),              SPARE                          X56520002
               (DATE,32),               DATE OF RECORD                 X56580002
               (TIME,32),               TIME OF RECORD                 X56640002
               (VERNO,8),               MACHINE VERSION                X56700002
               (CPUSER,24),             CPU SERIAL NO.                 X56760002
               (CPUID,16),              CPU IDENTIFIER                 X56820002
               (SPARE2,16),             SPARE                          X56880002
               (JOBID,64),              JOB IDENTIFICATION             X56940002
               (FAILCCW,64)             FAILING CCW                     57000002
         ORG   FAILCCW                                                  57060002
         DSGEN (CCWCC,8),               COMMAND CODE     0-7           X57120002
               (CCWCA,24),              COMMAND ADDRESS  8-31          X57180002
               (CCWFL,8),               FLAGS            32-36         X57240002
               (CCWXX,8),               NOT USED         37-47         X57300002
               (CCWCT,16)               BYTE COUNT       48-63          57360002
         DSGEN (CSW,64)                 CSW CONTENTS                    57420002
         ORG   CSW                                                      57480002
         DSGEN (CSWKEY,8),              KEY              0-7           X57540002
               (CSWCA,24),              COMMAND ADDRESS  8-31          X57600002
               (CSWATT,1),              ATTENTION        32            X57660002
               (CSWSTM,1),              STATUS MODIFER   33            X57720002
               (CSWCUE,1),              CTL UNIT END     34            X57780002
               (CSWBSY,1),              BUSY             35            X57840002
               (CSWCE,1),               CHANNEL END      36            X57900002
               (CSWDE,1),               DEVICE END       37            X57960002
               (CSWUC,1),               UNIT CHECK       38            X58020002
               (CSWUE,1),               UNIT EXCEPTION   39            X58080002
               (CSWPCI,1),              PROG CTL INTERRUPTION  40      X58140002
               (CSWSILI,1),             INCORRECT LENGTH 41            X58200002
               (CSWPC,1),               PROG CHECK       42            X58260002
               (CSWPCHK,1),             PROTECTION CHECK 43            X58320002
               (CSWCDC,1),              CHANNEL DATA CHECK     44      X58380002
               (CSWCCC,1),              CHANNEL CONTROL CHECK  45      X58440002
               (CSWICC,1),              INTERFACE CONTROL CHECK 46     X58500002
               (CSWCHC,1),              CHAINING CHECK          47     X58560002
               (CSWCNT,16)              COUNT            48-63          58620002
         DSGEN (DEVDEPC,8),             DEV DEPENDENT DATA COUNT       X58680002
               (,8),                                                   X58740002
               (SECUA,16),        SECONDARY CHANNEL & UNIT ADDR        X58770002
               (DEVTYPE,32),            DEVICE TYPE BYTES              X58800002
               (SDRCNT,8),              NUMBER OF SDR BYTES IN RECORD  X58860002
               (,8),                                                   X58920002
               (PCUA,16),         PRIMARY CHANNEL & UNIT ADDR          X58950002
               (IORETRY,16),            NUMBER OF I/O RETRIES ATTEMPTEDX58980002
               (SENSCNT,16),            SENSE BYTE FIELD LENGTH        X59040002
               (SDRCT,4,0,19)         SDR COUNTERS (2)         @ZM40435 59100002
         DSGEN (SNS00,1,0,7),           SENSE BYTE  1                  ?59160002
               (SNS01,1,0,7),           SENSE BYTE  2                  ?59220002
               (SNS02,1,0,7),           SENSE BYTE  3                  ?59280002
               (SNS03,1,0,7),           SENSE BYTE  4                  ?59340002
               (SNS04,1,0,7),           SENSE BYTE  5                  ?59400002
               (SNS05,1,0,7),           SENSE BYTE  6                  ?59460002
               (SNS06,1,0,7),           SENSE BYTE  7                  ?59520002
               (SNS07,1,0,7),           SENSE BYTE  8                  ?59580002
               (SNS08,1,0,7),           SENSE BYTE  9                  ?59640002
               (SNS09,1,0,7),           SENSE BYTE 10                  ?59700002
               (SNS10,1,0,7),           SENSE BYTE 11                  ?59760002
               (SNS11,1,0,7),           SENSE BYTE 12                  ?59820002
               (SNS12,1,0,7),           SENSE BYTE 13                  ?59880002
               (SNS13,1,0,7),           SENSE BYTE 14                  ?59940002
               (SNS14,1,0,7),           SENSE BYTE 15                  X60000002
               (SNS15,1,0,7),           SENSE BYTE 16                  X60060002
               (SNS16,1,0,7),           SENSE BYTE 17                  X60120002
               (SNS17,1,0,7),           SENSE BYTE 18                  X60180002
               (SNS18,1,0,7),           SENSE BYTE 19                  X60240002
               (SNS19,1,0,7),           SENSE BYTE 20                  X60300002
               (SNS20,1,0,7),           SENSE BYTE 21                  X60360002
               (SNS21,1,0,7),           SENSE BYTE 22                  X60420002
               (SNS22,1,0,7),           SENSE BYTE 23                  X60480002
               (SNS23,1,0,7)            SENSE BYTE 24                   60540002
         DSGEN (SNS00,8,EQU,SNS000)                                     60600002
         DSGEN (SNS01,8,EQU,SNS010)                                     60660002
         DSGEN (SNS02,8,EQU,SNS020)                                     60720002
         DSGEN (SNS03,8,EQU,SNS030)                                     60780002
         DSGEN (SERIALNO,16,EQU,SNS180)                                 60840002
         DSGEN (FORMAT,8,EQU,SNS040)                                    60900002
         ORG   JOBID                                                    60960002
         DSGEN (SHORTDT,32),            SHORT DEV TYPE                 X61020002
               (SHORTCNT,8),            SHORT SDR COUNT                X61080002
               (,8),                                                   X61140002
               (SHORTCUA,16),     SHORT CHAN & UNIT ADDR               X61170002
               (SSDRCT,4,0,19)        SHORT SDR COUNTERS (20)  @ZM40435 61200002
IFCEXXXF CSECT                                                          61260002
         USING *,R9                     SET UP BASE REG                 61320002
         USING RECORD,R2                SET UP DSECT PTR                61380002
         DC    A(ENTRY)                 LINE/LABEL SETS ADDR            61440002
         DC    C'IFCEXXXF'                                              61500002
R9PTR    DC    F'0'                                                     61560002
LABELPTR DC    F'0'                                                     61620002
WORK     DC    D'0'                     WORK SPACE                      61680002
REGSAVE  DC    4F'0'                    REGISTER SAVE AREA              61740002
RELTAB   EQU   *                        SYSTEM RELEASE CONVERSION TBL   61800002
         DC    CL4'  OS'                                                61860002
         DC    CL4' DOS'                                                61920002
         DC    CL4' VS1'                                                61980002
         DC    CL4'  VM'                                                62040002
         DC    CL4' VS2'                                                62100002
         DC    3CL4'    '                                               62160002
SUPPORT  EQU   1                        COUNT OF DEVICES SUPPORTED      62220002
XDEVTBL  EQU   *                                                        62280002
         DC    X'080E',C'3800'     ARGONAUT CLASS/TYPE CVT              62340002
R0       EQU   0                                                        62400002
R1       EQU   1                                                        62460002
R2       EQU   2                        DSECT PTR                       62520002
R3       EQU   3                        PRINT BUFFER PTR                62580002
R4       EQU   4                        RECORD PTR                      62640002
R5       EQU   5                                                        62700002
R6       EQU   6                                                        62760002
R7       EQU   7                                                        62820002
R8       EQU   8                                                        62880002
R9       EQU   9                        MODULE BASE REG                 62940002
R10      EQU   10                                                       63000002
R11      EQU   11                                                       63060002
R12      EQU   12                                                       63120002
R13      EQU   13                                                       63180002
R14      EQU   14                                                       63240002
R15      EQU   15                                                       63300002
L0       EQU   0                        ZERO                            63360002
L1       EQU   1                        ONE                             63420002
L2       EQU   2                        TWO                             63480002
L3       EQU   3                        THREE                           63540002
L4       EQU   4                        FOUR                            63600002
L5       EQU   5                        FIVE                            63660002
L6       EQU   6                        SIX                             63720002
L7       EQU   7                        SEVEN                           63780002
L8       EQU   8                                                        63840002
L9       EQU   9                                                        63900002
L16      EQU   16                                                       63960002
L23      EQU   23                       TWENTY THREE                    64020002
L24      EQU   24                                                       64080002
L28      EQU   28                       TWENTY EIGHT                    64140002
X20      EQU   X'20'                                                    64200002
X30      EQU   X'30'                                                    64260002
L46      EQU   46                       FOURTY SIX                      64320002
BOP      EQU   X'20'                    BUS OUT PARITY BIT              64380002
INTV     EQU   X'40'                    INTERVENTION REQD BIT           64440002
EQUIP    EQU   X'10'                    EQUIPMENT CHECK BIT             64500002
UC       EQU   X'02'                    CSW UNIT CHECK BIT              64560002
X00      EQU   X'00'                                                    64620002
X81      EQU   X'81'                                                    64680002
X89      EQU   X'89'                                                    64740002
X4F      EQU   X'4F'                                                    64800002
X8F      EQU   X'8F'                                                    64860002
XF0      EQU   X'F0'                                                    64920002
TEMP     EQU   X'60'              TEMPORARY UNIT CHECK                  64980002
X10      EQU   X'10'                                                    65040002
X9F      EQU   X'9F'                                                    65100002
X8A      EQU   X'8A'                                                    65160002
X8C      EQU   X'8C'                                                    65220002
X8B      EQU   X'8B'                                                    65280002
X8E      EQU   X'8E'                                                    65340002
X7F      EQU   X'7F'                                                    65400002
BLANK    EQU   C' '               CHARACTER BLANK                       65430002
ARG1     EQU   C'1'                                                     65460002
ARG2     EQU   C'2'                                                     65520002
ARG3     EQU   C'3'                                                     65580002
ARG4     EQU   C'4'                                                     65640002
ARG5     EQU   C'5'                                                     65700002
ARG6     EQU   C'6'                                                     65760002
ARG7     EQU   C'7'                                                     65820002
SHRTLINE DC    A(SHORTLN-4)                                             65880002
SHRTLABL DC    A(SHORTLB-1)                                             65940002
DUMPLNA  DC    A(DUMPLN-4)                                              66000002
DUMPLBA  DC    A(DUMPLB-1)                                              66060002
NONE     DC    C'NONE  '                                                66120002
CHARS    DC    C'0123456789ABCDEF'                                      66180002
UNIV     DC    C'UNIVERSAL'                                             66240002
TEMPY    DC    C'TEMPORARY'                                             66300002
PERM     DC    C'PERMANENT'                                             66360002
UNKWN    DC    C'UNKNOWN'                                               66420002
         EJECT                                                          66480002
CONVREL  STM   R5,R8,REGSAVE       SAVE REGS                            66540002
         SR    R6,R6               CLEAR REG                            66600002
         IC    R6,L0(R4)           GET REL & SYS VALUES                 66660002
         SRDL  R6,L5               SAVE REL NO. IN R7                   66720002
         SLL   R6,L2               MULT SYS VALUE BY 2                  66780002
         L     R8,LABELPTR         GET LABEL POINTER                    66840002
         LA    R6,RELTAB(R6)       INDEX INTO TABLE OF SYSTEMS          66900002
         MVC   L0(L4,R8),L0(R6)    MOVE SYS NAME INTO LABEL             66960002
         SR    R6,R6               CLEAR REG                            67020002
         SLDL  R6,L5               RETRIEVE REL NO.                     67080002
         LTR   R6,R6               IS IT ZERO ?                         67140002
         BZ    NOREL               YES, BRANCH                          67200002
         CVD   R6,WORK             NO, CONVERT IT                       67260002
         UNPK  L0(L2,R3),WORK+L6(L2) UNPACK IT INTO PRINT BUFFER        67320002
         MVZ   L1(L1,R3),L0(R3)    MOVE IN PROPER ZONE                  67380002
         B     RETURN              BRANCH                               67440002
NOREL    MVC   L0(L4,R3),NONE      MOVE IN NONE                         67500002
         B     RETURN              BRANCH                               67560002
*                                                                       67620002
TEMPBIT  TM    SWITCH1,TEMP        TEMPORARY ERROR ?                    67680002
         MVC   LABEL1+45(9),PERM   NO,MOVE IN PERMANENT                 67740002
         BZR   R14                RETURN                                67800002
         MVC   LABEL1+45(9),TEMPY  YES,MOVE IN TEMPORARY                67860002
         BR    R14                 RETURN                               67920002
*                                                                       67980002
JOBNAME  MVC   L0(L8,R3),L0(R4)    MOVE JOB NAME TO PRT BUFFER          68040002
         BR    R14                 RETURN                               68100002
*                                                                       68160002
SETDATE  UNPK  WORK(L8),L1(L3,R4)  UNPACK DATE                          68220002
         MVC   L0(L3,R3),WORK+L5   PUT IT IN THE BUFFER                 68280002
         MVC   L5(L2,R3),WORK+L3                                        68340002
         BR    R14                 RETURN                               68400002
*                                                                       68460002
UNITCK   TM    CSWUC,UC            ANY SENSE INFO PRESENT ?             68520002
         BOR   R14                 YES, RETURN                          68580002
         STM   R5,R8,REGSAVE       NO, SAVE REGS                        68640002
DUMP     L     R5,DUMPLNA          SET UP POINTERS                      68700002
         L     R6,DUMPLBA          V                                    68760002
         STM   R5,R6,R9PTR         V                                    68820002
         B     RETURN              AND RETURN                           68880002
*                                                                       68940002
CONVTYPE STM   R5,R8,REGSAVE       SAVE REGS                            69000002
         LA    R5,SUPPORT          BCT COUNT, CONV DEV TYPE TBL         69060002
         LA    R4,L2(R4)           R4 POINTS TO CLASS/TYPE 2 BYTES      69120002
         LA    R6,XDEVTBL          ADDR OF CLASS/TYPE XLATE TABLE       69180002
NEXT     CLC   L0(L2,R4),L0(R6)    IS THIS CLASS/TYPE WE LOOKIN FO      69240002
         BNE   BUMP                NO, BRANCH                           69300002
         MVC   L0(L4,R3),L2(R6)    YES, MOVE CLASS/TYPE TO BUFF         69360002
         B     RETURN              RETURN                               69420002
BUMP     LA    R6,L6(R6)           BUMP CONVERT TBL PTR                 69480002
         BCT   R5,NEXT             AND KEEP LOOKING                     69540002
         MVC   L0(L7,R3),UNKWN     ELSE UNKNOWN RECORD TYPE             69600002
         B     RETURN              RETURN AND KEEP GOING                69660002
*                                                                       69720002
SPACER1  LA    R3,L1(R3)           BUMP PTR                             69780002
         BR    R14                 RETURN                               69840002
SPACER7  LA    R3,L7(R3)           BUMP PTR                             69900002
         BR    R14                 RETURN                               69960002
*                                                                       70020002
*                                  CONVERT S D R COUNTERS               70080002
*                                                                       70140002
CVTLFT   STM   R5,R8,REGSAVE       SAVE REGS                            70200002
         SR    R6,R6               CLEAR R6                             70260002
         IC    R6,L0(R4)           GET COUNTER                          70320002
         SRL   R6,L4               GET RID OF 4 LOW BITS                70380002
         B     SDRCVT              GO CONVERT IT                        70440002
CVTRHT   STM   R5,R8,REGSAVE       SAVE REGS                            70500002
         IC    R6,L0(R4)           GET COUNTER                          70560002
         SLL   R6,L28                                                   70620002
         SRL   R6,L28              DROP OFF 4 HI BITS                   70680002
SDRCVT   CVD   R6,WORK             CONVERT TO DECIMAL                   70740002
         UNPK  L0(L2,R3),WORK+L6(L2) UNPACK IT                          70800002
         MVZ   L1(L1,R3),L0(R3)    PUT ON ZONE BITS                     70860002
         LTR   R6,R6               TEST FOR ZERO VALUE         @Y17CSWT 70870002
         BNZ   RETURN              (NO - RETURN)               @Y17CSWT 70880002
         MVI   L0(R3),BLANK        YES, SUPPRESS 1ST ZERO      @Y17CSWT 70890002
         B     RETURN              RETURN                               70920002
*                                                                       70980002
SHORT    TM    SWITCH1,X20         SHORT OBR RECORD ?                   71040002
         BNOR  R14                 NO, BRANCH                           71100002
         STM   R5,R8,REGSAVE       SAVE REGS                            71160002
         L     R5,SHRTLINE         YES, SET UP POINTERS                 71220002
         L     R6,SHRTLABL         V                                    71280002
         STM   R5,R6,R9PTR         V                                    71340002
SKIPIT   SR    R15,R15             INDICATE NO PRINT REQD.              71400002
RETURN   LM    R5,R8,REGSAVE       RESTORE REGS                         71460002
SKIP     BR    R14                 RETURN                               71520002
*                                                                       71580002
SETCPUNO STM   R5,R8,REGSAVE       SAVE REGS                            71640002
         SR    R5,R5               CLEAR R5                             71700002
         IC    R5,L0(R4)           GET CPU TYPE                         71760002
         SLL   R5,L8                                                    71820002
         IC    R5,L1(R4)                                                71880002
         LTR   R5,R5               IS IT ZERO ?                         71940002
         BNZ   RETURN              NO, RETURN                           72000002
         LA    R6,L46              BACK UP POINTER 46 BYTES             72060002
         SR    R3,R6                                                    72120002
         MVC   L0(L9,R3),UNIV      SAY MODEL=UNIVERSAL                  72180002
         MVC   L23(L6,R3),NONE     SAY SERIAL=NONE                      72240002
         B     RETURN                                                   72300002
*                                                                       72360002
SETHEX   STM   R5,R8,REGSAVE       SAVE REGS                            72420002
         IC    R7,L0(R4)           GET CHAR FROM RECORD                 72480002
SETHEX1  LA    R8,CHARS            PTR TO CHARACTERS HEX                72540002
         SLL   R7,L24              MOVE IT TO HI OF R7                  72600002
         SR    R6,R6               ZERO R6                              72660002
         SLDL  R6,L4               MOVE 4 BITS TO R6                    72720002
         AR    R6,R8               COMPUTE OFFSET                       72780002
         MVC   L0(L1,R3),L0(R6)    MOVE CHAR TO PRT BUFF                72840002
         SR    R6,R6               ZERO R6                              72900002
         SLDL  R6,L4               MOVE NEXT 4 BITS TO R6               72960002
         AR    R6,R8               COMPUTE OFFSET                       73020002
         MVC   L1(L1,R3),L0(R6)    MOVE CHAR TO PRT BUFF+1              73080002
         B     RETURN              EXIT                                 73140002
SETHEX2  IC    R7,WORK             GET UNKNOWN ERR CODE                 73200002
         B     SETHEX1             GO CONVERT HEX TO EBCDIC             73260002
*                                                                       73320002
RECTYPE  CLI   L0(R2),X30          OBR RECORD                           73380002
         BER   R14                 YES, EXIT                            73440002
         STM   R5,R8,REGSAVE       SAVE REGS                            73500002
         LA    R5,T00CLINE-L4      IFCET00C LINE                        73560002
         LA    R6,T00CLABL-L1      IFCET00C LINE                        73620002
         STM   R5,R6,R9PTR         SET TO NEW LINE                      73680002
         B     RETURN              EXIT                                 73740002
*                                                                       73800002
LABELTYP STM   R5,R8,REGSAVE       SAVE REGS                            73860002
         MVI   ARGNO,ARG7          MOVE IN FORMAT 7 NO.                 73920002
         TM    L0(R4),INTV         INTERVENTION REQD                    73980002
         BZ    FORMAT20            NO, GO TEST FOR BUS OUT PARITY       74040002
         CLI   L4(R4),X9F          SENSE BYTE 4 GT X'9F'                74100002
         BH    RETURN              YES, USE FORMAT 7                    74160002
         MVI   ARGNO,ARG3          FORMAT 3                             74220002
         CLI   L4(R4),X4F          SENSE BYTE 4 : X'4F'                 74280002
         BH    RETURN              HIGH, GO OUT FORMAT 3                74340002
         MVI   ARGNO,ARG2          FORMAT 2                             74400002
         TM    L3(R4),EQUIP        BYTE 3/BIT 3 ON?                     74460002
         BO    RETURN              YES, USE FORMAT 2                    74520002
         MVI   ARGNO,ARG1          FORMAT1                              74580002
         B     RETURN              EXIT                                 74640002
*                                                                       74700002
FORMAT20 LA    R5,F20L             ADDRESS OF BUS OUT LABELS            74760002
         ST    R5,LABELPTR         STORE FOR OUTPUT                     74820002
         TM    L0(R4),BOP          BUS OUT PARITY                       74880002
         BO    RETURN              YES, USE FORMAT 7                    74940002
         TM    L0(R4),EQUIP        EQUIPMENT CHECK?                     75000002
         BZ    DUMP                NO, NO VALID CODE--EXIT              75060002
*                                                                       75120002
**       FORMAT 10 RECORDS                                              75180002
*                                                                       75240002
         LA    R5,F10L             ADDRESS OF EQUIP CHK LABELS          75300002
         ST    R5,LABELPTR         STORE FOR OUTPUT                     75360002
         CLI   L4(R4),X'9F'        SENSE BYTE 4 GT X'9F'                75420002
         BH    RETURN              USE FORMAT 7                         75480002
         MVI   ARGNO,ARG6          FORMAT 6                             75540002
         CLI   L4(R4),X8A          '8A' TYPE RECORD                     75600002
         BE    RETURN              YES, EXIT                            75660002
         MVI   ARGNO,ARG5          FORMAT 5                             75720002
         CLI   L4(R4),X89          '89' FORMAT RECORD                   75780002
         BE    RETURN              YES, EXIT                            75840002
         MVI   ARGNO,ARG4          FORMAT 4                             75900002
         CLI   L4(R4),X8C          '8C' FORMAT RECORD?                  75960002
         BE    RETURN                                                   76020002
         MVI   ARGNO,ARG3          FORMAT 3                             76080002
         CLI   L4(R4),X8B          '8B' FORMAT RECORD?                  76140002
         BE    RETURN              YES, EXIT                            76200002
         CLI   L4(R4),X8E          '8E' FORMAT RECORD?                  76260002
         BNL   RETURN              YES, EXIT                            76320002
         MVI   ARGNO,ARG7          FORMAT 7                             76380002
         CLI   L4(R4),X7F          '7F' FORMAT RECORD?                  76440002
         BH    RETURN              YES, EXIT                            76500002
         MVI   ARGNO,ARG3          FORMAT 3                             76560002
         CLI   L4(R4),X4F          '4F' FORMAT RECORD?                  76620002
         BH    RETURN              YES,EXIT                             76680002
         MVI   ARGNO,ARG2          FORMAT 2                             76740002
         TM    L3(R4),EQUIP        BYTE 3/BIT 3 ON?                     76800002
         BO    RETURN              YES, EXIT                            76860002
         MVI   ARGNO,ARG1          FORMAT 1                             76920002
         B     RETURN              EXIT                                 76980002
         EJECT                                                          77040002
         DS    0F                                                       77100002
ENTRY    EQU   *                                                        77160002
         DC    XL4'00'                                                  77220002
         DC    XL4'00'                                                  77280002
         DC    A(LABELS)                                                77340002
         DC    H'0'                                                     77400002
         LINE  (1,1),(1,1),SKIP=1                                       77460002
         ROUTINE SWITCH1,TEMPBIT                                        77520002
         ROUTINE CLASRC,RECTYPE                                         77580002
         LABEL ''                                                       77640002
         LINE  SKIP=E                   EJECT                           77700002
         LABEL ''                                                       77760002
         LINE  (115),(1,88),SKIP=0                                      77820002
         HEX   CPUSER,0,3B                                              77880002
         ROUTINE CPUID,SETCPUNO                                         77940002
LABEL1   LABEL '---RECORD ENTRY TYPE - UNIT OR CHANNEL CHECK XXXXXXXXX X78000002
                     SOURCE OUTBOARD        CPU ','MODEL - '            78060002
         LINE  (96),(104),SKIP=1                                        78120002
         HEX   CPUID,0,2B                                               78180002
         LABEL 'SERIAL NO.'                                             78240002
         LINE  (17,1),(4,1),SKIP=1                                      78300002
         ROUTINE SYSREL,CONVREL                                         78360002
         LABEL 'XXXX RELEASE'                                           78420002
         LINE  (81),(25,23),SKIP=1                                      78480002
         ROUTINE JOBID,JOBNAME                                          78540002
         ROUTINE SPARE1,SHORT                                           78600002
         LABEL 'DAY YEAR','HH MM SS TH      JOB IDENTITY'               78660002
         LINE  (25,23),(18,23),SKIP=2                                   78720002
         ROUTINE DATE,SETDATE                                           78780002
         HEX   TIME,1,4B                                                78840002
         HEX   JOBID,0,8B                                               78900002
         LABEL 'DATE -','TIME -'                                        78960002
         LINE  (33,71),(2,77),SKIP=1                                    79020002
         ROUTINE DEVTYPE,CONVTYPE                                       79080002
         LABEL 'DEVICE TYPE','STATISTICAL DATA COUNTERS'                79140002
         LINE  (33),(2),SKIP=1                                          79200002
         HEX   PCUA,0,2B                                                79260002
         LABEL 'PRIMARY CHANNEL UNIT ADDRESS'                           79320002
         LINE  (33,73),(2,78),SKIP=1                                    79380002
         HEX   SECUA,0,2B                                               79440002
         ROUTINE SDRCT2,CVTLFT     COUNTER NO. 1                        79500002
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS','TEMP CHL DATA CK'      79560002
         LINE  (106),(80),SKIP=1                                        79620002
         ROUTINE SDRCT3,CVTRHT     COUNTER NO. 2                        79680002
         LABEL 'TEMP CHL CTL CK'                                        79740002
         LINE  SKIP=0                                                   79800002
         ROUTINE SDRCT4,CVTLFT     COUNTER NO. 3                        79860002
         LABEL 'TEMP INTF CTL CK'                                       79920002
         LINE  ,(19,29),SKIP=1                                          79980002
         LABEL 'CC   DA   FL     CT','K    CA   US CS  CT'              80040002
         LINE  (19,3),(5,38),SKIP=1                                     80100002
         HEX   CCWCC,0,1B                                               80160002
         HEX   CCWCA,0,3B                                               80220002
         ROUTINE SPARE1,SPACER1                                         80280002
         HEX   CCWFL,0,1B                                               80340002
         HEX   CCWXX,0,1B                                               80400002
         HEX   CCWCT,0,2B                                               80460002
         ROUTINE SPARE1,SPACER7                                         80520002
         HEX   CSWKEY,0,1B                                              80580002
         HEX   CSWCA,0,03B                                              80640002
         ROUTINE SPARE1,SPACER1                                         80700002
         ROUTINE CSWATT,SETHEX                                          80760002
         ROUTINE CSWPCI,SETHEX                                          80820002
         HEX   CSWCNT,0,2B                                              80880002
         LABEL 'FAILING CCW','CSW'                                      80940002
         LINE (106),(80),SKIP=1                                         81000002
         ROUTINE SDRCT5,CVTRHT     COUNTER NO. 4                        81060002
         LABEL 'CFS MISFOLD (32)'                                       81120002
         LINE (106),(80),SKIP=1                                         81180002
         ROUTINE SDRCT6,CVTLFT     COUNTER NO. 5                        81240002
         LABEL 'BUR/TRIM JAM(40)'                                       81300002
         LINE  (106),(80),SKIP=1                                        81360002
         ROUTINE SDRCT7,CVTRHT     COUNTER NO. 6                        81420002
         LABEL 'NO BURST CK (41)'                                       81480002
         LINE  (106),(80),SKIP=0                                        81490002
         ROUTINE SDRCT8,CVTLFT     COUNTER NO. 7                        81500002
         LABEL 'BUR/STKR JAM(42)'                                       81510002
         LINE  ,(1),SKIP=2                                              81540002
         ROUTINE CSWUC,UNITCK                                           81600002
         LABEL 'SYSTEM SENSE BYTE DATA'                                 81660002
         LINE  (11,18),(2,18),SKIP=1                                    81720002
         HEX   SNS00,0,1B                                               81780002
         HEX   SNS01,0,1B                                               81840002
         HEX   SNS02,0,1B                                               81900002
         HEX   SNS03,0,1B                                               81960002
         LABEL 'BYTE 0 -','BYTE 1 -','BYTE 2 -','BYTE 3 -'              82020002
         LINE  ,(1,18),SKIP=1                                           82080002
         LABEL 'UNIT CHECK','REASON 1','REASON 2','DYNAMIC'             82140002
         LINE  SKIP=1                                                   82200002
         LABEL ''                                                       82260002
         LINE  (14,18),(1,18),SKIP=1                                    82320002
         BIN   (SNS000,,1),(SNS010,,1),(SNS020,,1),(SNS030,,1)          82380002
         ROUTINE SNS000,LABELTYP                                        82440002
         LABEL 'CMD REJECT','NOT READY','FO CK','READY'                 82500002
         LINE  SKIP=1                                                   82560002
         BIN   (SNS001,,1),(SNS011,,1),(SNS021,,1),(SNS031,,1)          82620002
         LABEL 'INTVN RQD','OPERATION CK','XFR CK','PG BUFF EMPT'       82680002
         LINE  SKIP=1                                                   82740002
         BIN   (SNS002,,1),(SNS012,,1),(SNS022,,1),(SNS032,,1)          82800002
         LABEL 'BUS OUT PE','TNR COLL FUL','FUSER CK','BLK DATA CK'     82860002
         LINE  SKIP=1                                                   82920002
         BIN   (SNS003,,1),(SNS013,,1),(SNS023,,1),(SNS033,,1)          82980002
         LABEL 'EQUIP CHK','TNR EMPTY','CFS CHK','BTS THREADED'         83040002
         LINE  SKIP=1                                                   83100002
         BIN   (SNS004,,1),(SNS014,,1),(SNS024,,1),(SNS034,,1)          83160002
         LABEL 'DATA CK','DEV REPL RQD','PRCS CK','SYS RSTRT RQ'        83220002
         LINE  SKIP=1                                                   83280002
         BIN   (SNS005,,1),(SNS015,,1),(SNS025,,1),(SNS035,,1)          83340002
         LABEL 'RESERVED','END OF FORMS','BTS CK','PC ADV ENBL'         83400002
         LINE  SKIP=1                                                   83460002
         BIN   (SNS006,,1),(SNS016,,1),(SNS026,,1),(SNS036,,1)          83520002
         LABEL 'LOAD CK','OUTPUT FULL','RESERVED','RESERVED'            83580002
         LINE  SKIP=1                                                   83640002
         BIN   (SNS007,,1),(SNS017,,1),(SNS027,,1),(SNS037,,1)          83700002
         LABEL 'CHANNEL 9','RESERVED','LINE OVERRUN','RESERVED'         83760002
         LINE  SKIP=1                                                   83820002
         LABEL ' '                                                      83880002
         DC    X'FE'                                                    83940002
         DC    C'IFCEARG'                                               84000002
ARGNO    DC    C' '                                                     84060002
*                                                                       84120002
SHORTLN  LINE  (81),(25,23),SKIP=1                                      84180002
SHORTLB  LABEL 'DAY YEAR','HH MM SS TH'                                 84240002
         LINE  (25,23),(18,23),SKIP=2                                   84300002
         ROUTINE DATE,SETDATE                                           84360002
         HEX   TIME,1,4B                                                84420002
         LABEL 'DATE -','TIME -'                                        84480002
         LINE  (33),(2,77),SKIP=1                                       84540002
         ROUTINE SHORTDT,CONVTYPE                                       84600002
         LABEL 'DEVICE TYPE','STATISTICAL DATA COUNTERS'                84660002
         LINE  (33),(2),SKIP=1                                          84720002
         HEX   SHORTCUA,0,2B                                            84780002
         LABEL 'PRIMARY CHANNEL UNIT ADDRESS'                           84840002
         LINE  (106),(80),SKIP=1                                        84900002
         ROUTINE SSDRCT2,CVTLFT    COUNTER NO. 1                        85020002
         LABEL 'TEMP CHL DATA CK'                                       85080002
         LINE  (106),(80),SKIP=1                                        85140002
         ROUTINE SSDRCT3,CVTRHT    COUNTER NO. 2                        85200002
         LABEL 'TEMP CHL CTL CK'                                        85260002
         LINE  SKIP=1                                                   85320002
         ROUTINE SSDRCT4,CVTLFT    COUNTER NO. 3                        85380002
         LABEL 'TEMP INTF CTL CK'                                       85440002
         LINE  SKIP=1                                                   85460002
         LABEL ' '                                                      85480002
         LINE  SKIP=1                                                   85500002
         ROUTINE SSDRCT5,CVTRHT    COUNTER NO. 4                        85560002
         LABEL 'CFS MISFOLD (32)'                                       85620002
         LINE  SKIP=1                                                   85680002
         ROUTINE SSDRCT6,CVTLFT    COUNTER NO. 5                        85740002
         LABEL 'BUR/TRIM JAM(40)'                                       85800002
         LINE  SKIP=1                                                   85860002
         ROUTINE SSDRCT7,CVTRHT    COUNTER NO. 6                        85920002
         LABEL 'NO BURST CK (41)'                                       85980002
         LINE  SKIP=1                                                   85990002
         ROUTINE SSDRCT8,CVTLFT    COUNTER NO. 7                        86000002
         LABEL 'BUR/STKR JAM(42)'                                       86010002
         DC    X'FF'                   BAIL OUT                         86040002
         DC    X'002A'                 LOGOUT SIZE                      86100002
         DC    X'0018'                 OFFSET IH THE RECORD             86160002
         DC    X'0018'            START ADDR OF DUMP                    86220002
DUMPLN   LINE  ,,SKIP=1                                                 86280002
DUMPLB   LABEL ''                                                       86340002
         DC    X'FF'                   BAIL OUT                         86400002
         DC    X'0062'                 LOGOUT SIZE                      86460002
         DC    X'0018'                 OFFSET IN THE RECORD             86520002
         DC    X'0018'            START ADDR OF DUMP                    86580002
T00CLINE LINE  SKIP=1                                                   86640002
T00CLABL LABEL ' '                                                      86700002
         DC    X'FE'                                                    86760002
         DC    C'IFCET00C'                                              86820002
LABELS   DS    0F                                                       86880002
         LSTART                                                         86940002
F10L     DC    C'CMD REJECT*'                                           87000002
         DC    C'HARDWARE ER*'                                          87060002
         DC    C'RESERVED*'                                             87120002
         DC    C'READY$'                                                87180002
         DC    C'INTVN RQD*'                                            87240002
         DC    C'PERMANENT ER*'                                         87300002
         DC    C'RESERVED*'                                             87360002
         DC    C'PG BUFF EMPT$'                                         87420002
         DC    C'BUS OUT PE*'                                           87480002
         DC    C'ER LOG FULL*'                                          87540002
         DC    C'RESERVED*'                                             87600002
         DC    C'BLK DATA CK$'                                          87660002
         DC    C'EQUIP CK*'                                             87720002
         DC    C'CANCEL KEY*'                                           87780002
         DC    C'RESERVED*'                                             87840002
         DC    C'BTS THREADED$'                                         87900002
         DC    C'DATA CK*'                                              87960002
         DC    C'RESERVED*'                                             88020002
         DC    C'RESERVED*'                                             88080002
         DC    C'SYS RSTRT RQ$'                                         88140002
         DC    C'RESERVED*'                                             88200002
         DC    C'RESERVED*'                                             88260002
         DC    C'RESERVED*'                                             88320002
         DC    C'PC ADV ENBL$'                                          88380002
         DC    C'LOAD CK*'                                              88440002
         DC    C'RESERVED*'                                             88500002
         DC    C'RESERVED*'                                             88560002
         DC    C'RESERVED$'                                             88620002
         DC    C'CHANNEL 9*'                                            88680002
         DC    C'RESERVED*'                                             88740002
         DC    C'RESERVED*'                                             88800002
         DC    C'RESERVED$'                                             88860002
         DC    C' $'                                                    88920002
F20L     DC    C'CMD REJECT*'                                           88980002
         DC    C'COMMAND CODE*'                                         89040002
         DC    C'RESERVED*'                                             89100002
         DC    C'READY$'                                                89160002
         DC    C'INTVN RQD*'                                            89220002
         DC    C'DATA BYTE*'                                            89280002
         DC    C'RESERVED*'                                             89340002
         DC    C'PG BUFF EMPT$'                                         89400002
         DC    C'BUS OUT PE*'                                           89460002
         DC    C'RESERVED*'                                             89520002
         DC    C'RESERVED*'                                             89580002
         DC    C'BLK DATA CK$'                                          89640002
         DC    C'EQUIP CK*'                                             89700002
         DC    C'RESERVED*'                                             89760002
         DC    C'RESERVED*'                                             89820002
         DC    C'BTS THREADED$'                                         89880002
         DC    C'DATA CK*'                                              89940002
         DC    C'RESERVED*'                                             90000002
         DC    C'RESERVED*'                                             90060002
         DC    C'SYS RSTRT RQ$'                                         90120002
         DC    C'RESERVED*'                                             90180002
         DC    C'RESERVED*'                                             90240002
         DC    C'RESERVED*'                                             90300002
         DC    C'PC ADV ENBL$'                                          90360002
         DC    C'LOAD CK*'                                              90420002
         DC    C'RESERVED*'                                             90480002
         DC    C'RESERVED*'                                             90540002
         DC    C'RESERVED$'                                             90600002
         DC    C'CHANNEL 9*'                                            90660002
         DC    C'RESERVED*'                                             90720002
         DC    C'RESERVED*'                                             90780002
         DC    C'RESERVED$'                                             90840002
         DC    C' $'                                                    90900002
         END                                                            90960002
