         TITLE 'IFCEXXXX - EDIT TABLE - LINKNAME=IFCEXXXX'              00090002
         EJECT                                                          00180002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 00230002
         SPACE 2                                                        00280002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 00330002
         SPACE 2                                                        00380002
         MACRO                                                          00430002
&NAME    DSGEN                                                          00480002
.*                            THIS MACRO GENERATES ONE DSECT WORD       00530002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00580002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00630002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00680002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00730002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00780002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00830002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00880002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  00930002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    00980002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   01030002
         GBLC &ITEM(1000)                                               01080002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         01130002
         LCLB  &ONLY1,&CTIND                                            01180002
         LCLA  &START1,&START2,&END1,&END2                              01230002
         LCLC  &SYMBOL,&EQUSYM                                          01280002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 01330002
         ACTR  100000                                                   01380002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            01430002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     01480002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   01530002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        01580002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            01630002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             01680002
         AGO   .SET2A                   BRANCH AROUND                   01730002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              01780002
         MEXIT                                                          01830002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X01880002
               ).SET2                   TEST FOR NO SECOND              01930002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   01980002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        02030002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            02080002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              02130002
         AGO   .LOOP                                                    02180002
.SET2    ANOP                                                           02230002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 02280002
         AGO   .LOOP                                                    02330002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             02380002
         MEXIT                                                          02430002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               02480002
         MEXIT                                                          02530002
.LOOP    ANOP                                                           02580002
&OP      SETA  &OP+1                                                    02630002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           02680002
&ITEMNBR SETA  &ITEMNBR+1                                               02730002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            02780002
         MNOTE '**NULL BIT COUNT FIELD**'                               02830002
         MEXIT                                                          02880002
.OK1     ANOP                                                           02930002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        02980002
         AIF   ('&SYMBOL' NE '').OK                                     03030002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         03080002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         03130002
         AGO   .START                   GET NEXT                        03180002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        03230002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          03280002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        03330002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         03380002
         AGO   .NO3                     BRANCH AROUND                   03430002
.OK2     ANOP                                                           03480002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              03530002
.NO3     ANOP                                                           03580002
&SYMBOL  EQU   *+&BYTE                                                  03630002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             03680002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    03730002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    03780002
.CNT     ANOP                                                           03830002
&CTIND   SETB  1                        SET COUNT INDICATOR             03880002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   03930002
&BYTE    SETA  &COUNT/8                                                 03980002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        04030002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        04080002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             04130002
&END1    SETA  &END1+1                  INCREMENT COUNT                 04180002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             04230002
         AGO   .LOOP                    GENERATE NEXT                   04280002
.TSTST   ANOP                                                           04330002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               04380002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        04430002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      04480002
.NSET1   ANOP                                                           04530002
&OP      SETA  &OP-1                    DECREMENT INDEX                 04580002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           04630002
         AGO   .LOOP                    GO DO NEXT                      04680002
.LPDONE  ANOP                                                           04730002
&ONLY1   SETB  0                        CLEAR INDICATOR                 04780002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      04830002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 04880002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               04930002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             04980002
&NAME    DS    &COUNT.C                                                 05030002
.END     MEXIT                                                          05080002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          05130002
         MEXIT                                                          05180002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   05230002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   05280002
         MEXIT                                                          05330002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         05380002
*****               THE FOLLOWING STATEMENT                *****        05430002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        05480002
.EQU2    ANOP                                                           05530002
&EQUCNT  SETA  0                        CLEAR COUNTER                   05580002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 05630002
.EQULOP  ANOP                                                           05680002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 05730002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     05780002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                05830002
         AGO   .EQULOP                  NO-GET NEXT                     05880002
.EQUOUT  ANOP                                                           05930002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  05980002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              06030002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 06080002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             06130002
         AGO   .START                   RETURN FOR NEXT                 06180002
         MEND                                                           06230002
         EJECT                                                          06280002
         MACRO                                                          06330002
         LINEND                                                         06380002
.*                            THIS MACRO IS USED ONLY BY THE LINE       06430002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   06480002
.*                                 ASSOCIATED WITH EACH LINE.           06530002
         GBLA  &NRENTS                                                  06580002
         GBLC &NRENTSX                                                  06630002
         AIF   (&NRENTS EQ 0).NORENTS   TEST FOR NO COUNT               06680002
         ORG   &NRENTSX                                                 06730002
         DC    FL1'&NRENTS'                                             06780002
         ORG                                                            06830002
&NRENTS  SETA  0                                                        06880002
.NORENTS ANOP                                                           06930002
B&SYSNDX EQU   *                                                        06980002
&NRENTSX SETC  'B&SYSNDX'                                               07030002
         MEND                                                           07080002
         EJECT                                                          07130002
         MACRO                                                          07180002
         BIN                                                            07230002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   07280002
.*                                      RECORD DSECT                    07330002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      07380002
.*                                      TO SKIP ON MULTIPLE             07430002
.*                                      PRINT OR NBR OF SPACES          07480002
.*                                      TO BACK UP FROM COLUMN FOR      07530002
.*                                      START OF PRINTING. THE LETTER   07580002
.*                                      B PRECEEDS THE NUMBER (B5) IF   07630002
.*                                      THE LATTER IS DESIRED. OMISSION 07680002
.*                                      OF THIS OPERAND FORCES OPTION 2 07730002
.*                                      WITH BACKUP SPACING EQUAL TO    07780002
.*                                 THE NUMBER OF BITS IN THE ITEM       07830002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      07880002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     07930002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       07980002
         GBLA  &INITIAL                                                 08030002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               08080002
         GBLC &ITEM(1000)                                               08130002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 08180002
         GBLC  &DSECT                                                   08230002
         LCLB  &B,&SUB                                                  08280002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   08330002
         LCLA  &TEMP,&T,&OP                                             08380002
         LCLC  &S                                                       08430002
         AIF   (&DIAGTST EQ 0).NOMSG                                    08480002
         AIF   (&INITIAL EQ 0).NOMSG                                    08530002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    08580002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  08630002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     08680002
*        LINE                                                           08730002
         LINE                                                           08780002
.NOMSG   ANOP                                                           08830002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  08880002
&SUB     SETB  1                                                        08930002
.LOOP    ANOP                                                           08980002
&OP      SETA  &OP+1                                                    09030002
.LOOP1   ANOP                                                           09080002
&NDX     SETA  &NDX+1                                                   09130002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               09180002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 09230002
         MNOTE '**LOG ITEM NOT DEFINED**'                               09280002
         MEXIT                                                          09330002
.FOUND   ANOP                                                           09380002
&ISHIFT  SETA  &SHIFT(&NDX)                                             09430002
&IBITS   SETA  &BITS(&NDX)                                              09480002
&T       SETA  &IBITS-1                                                 09530002
&B       SETB  0                                                        09580002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      09630002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  09680002
         MEXIT                                                          09730002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         09780002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             09830002
&K       SETA  K'&SYSLIST(2)                                            09880002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              09930002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                09980002
         AGO   .SUBB                                                    10030002
.SUBA    ANOP                                                           10080002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         10130002
&K       SETA  K'&SYSLIST(&OP,2)                                        10180002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          10230002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            10280002
.SUBB    ANOP                                                           10330002
&T       SETA  &S                                                       10380002
.BACKUP  ANOP                                                           10430002
&NRENTS  SETA  &NRENTS+1                                                10480002
&TEMP    SETA  &ISHIFT                                                  10530002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            10580002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                10630002
         AGO   .OUT                                                     10680002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           10730002
&B       SETB  1                                                        10780002
.BIN3    ANOP                                                           10830002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    10880002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             10930002
.OUT     ANOP                                                           10980002
&NDX     SETA  0                                                        11030002
         AIF   (&SUB EQ 0).OUTA                                         11080002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 11130002
.OUTA    ANOP                                                           11180002
         MEND                                                           11230002
         EJECT                                                          11280002
         MACRO                                                          11330002
         LSTART                                                         11380002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  11430002
.*                                 OF THE TABLE IS TO BEGIN.            11480002
         GBLA  &LABELNR                                                 11530002
         GBLC  &LBL(100)                                                11580002
         GBLC &LABELS(2000)                                             11630002
         GBLA  &LBLCTR(100)                                             11680002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               11730002
         LCLA  &NDX,&CTR                                                11780002
         AIF   (&DIAGTST EQ 0).NODIAG                                   11830002
         AIF   (&DIAGSET EQ 0).NODIAG                                   11880002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  11930002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   11980002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       12030002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 12080002
.NODIAG  ANOP                                                           12130002
         LINEND                                                         12180002
&CTR     SETA  1                                                        12230002
.LOOP    ANOP                                                           12280002
&NDX     SETA  &NDX+1                                                   12330002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            12380002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         12430002
&CTR     SETA  &CTR+1                                                   12480002
         AGO   .LOOPCTL                                                 12530002
.NOLBL   ANOP                                                           12580002
         DC    C'&LABELS(&NDX)'                                         12630002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  12680002
         MEND                                                           12730002
         EJECT                                                          12780002
         MACRO                                                          12830002
&NAME    ROUTINE &LOGITEM,&RNAME                                        12880002
         GBLA  &NRENTS                                                  12930002
         GBLC  &DSECT,&CSECT                                            12980002
         GBLA  &INITIAL                                                 13030002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               13080002
         AIF   (&DIAGTST EQ 0).NOMSG                                    13130002
         AIF   (&INITIAL EQ 0).NOMSG                                    13180002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    13230002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               13280002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     13330002
*        LINE                                                           13380002
         LINE                                                           13430002
.NOMSG   ANOP                                                           13480002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           13530002
         DC    AL2(&RNAME-&CSECT)                                       13580002
&NRENTS  SETA  &NRENTS+1                                                13630002
         MEND                                                           13680002
         EJECT                                                          13730002
         MACRO                                                          13780002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      13830002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     13880002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    13930002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 13980002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    14030002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    14080002
.*                                 THE PREVIOUS LINE AND STORES THAT #  14130002
.*                                 INTO THE APPROPRIATE BYTE.           14180002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    14230002
.*                                 DATA.                                14280002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 14330002
.*                                 DATA COLUMN STARTING CHARACTERS.     14380002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   14430002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 14480002
.*                                 STARTING CHARACTERS.                 14530002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   14580002
.*                                 TO BEGIN NEXT PRINTED LINE.          14630002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       14680002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   14730002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 14780002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   14830002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 14880002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    14930002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   14980002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   15030002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  15080002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   15130002
.*                                 THE SUBJECT LINE                     15180002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  15230002
         GBLA  &LASTCC,&INITIAL                                         15280002
         GBLC  &NRENTSX                                                 15330002
         GBLC  &CARRCON                                                 15380002
         GBLB  &TEST                                                    15430002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               15480002
         LCLA  &S                                                       15530002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 15580002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  15630002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  15680002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   15730002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       15780002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 15830002
.DIAGSET ANOP                                                           15880002
&DIAGSET SETB  1                                                        15930002
&DIAGLIN SETB  1                                                        15980002
&NAME    DS    0C                                                       16030002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  16080002
         LINEND                                                         16130002
         AGO   .NTFIRST                                                 16180002
.FIRSTLN ANOP                                                           16230002
&NRENTSX SETC  'N&SYSNDX'                                               16280002
&INITIAL SETA  1                                                        16330002
N&SYSNDX EQU   *                                                        16380002
.NTFIRST ANOP                                                           16430002
         DC    AL1(0)                                                   16480002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               16530002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                16580002
&DB      SETA  &DATA(1)                                                 16630002
         AGO   .AA                                                      16680002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                16730002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 16780002
         AGO   .CC                                                      16830002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    16880002
         AIF   (&DATA(2) EQ &DT).BB                                     16930002
.CC      ANOP                                                           16980002
&DT      SETA  &DATA(2)                                                 17030002
.BB      DC    XL2'FFFE'                                                17080002
         DC    FL1'&DB'                                                 17130002
         DC    FL1'&DT'                                                 17180002
&NRENTS  SETA  &NRENTS+1                                                17230002
.NCDATA  ANOP                                                           17280002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              17330002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               17380002
&LB      SETA  &LABEL(1)                                                17430002
         AGO   .AAA                                                     17480002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              17530002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               17580002
         AGO   .CCC                                                     17630002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  17680002
         AIF   (&LABEL(2) EQ &LT).BBB                                   17730002
.CCC     ANOP                                                           17780002
&LT      SETA  &LABEL(2)                                                17830002
.BBB     DC    XL2'FFFF'                                                17880002
         DC    FL1'&LB'                                                 17930002
         DC    FL1'&LT'                                                 17980002
&NRENTS  SETA  &NRENTS+1                                                18030002
.NCLABEL ANOP                                                           18080002
         AIF   ('&SKIP' NE '').CONT                                     18130002
         AIF   (&TEST EQ 0).NOCHANG                                     18180002
         AGO   .DEFALTA                                                 18230002
.CONT    ANOP                                                           18280002
         AIF   (&TEST EQ 0).AB                                          18330002
         AIF   ('&SKIP' EQ 'E').AB                                      18380002
&S       SETA  &SKIP                                                    18430002
.DEFAULT ANOP                                                           18480002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               18530002
         ORG   &CARRCON+3                                               18580002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 18630002
         ORG                                                            18680002
&LASTCC  SETA  &S                                                       18730002
.DEFALTA ANOP                                                           18780002
&TEST    SETB  0                                                        18830002
         AGO   .DD                                                      18880002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     18930002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           18980002
         AGO   .ABC                                                     19030002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               19080002
A&SYSNDX DC    XL2'FFFB'                                                19130002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              19180002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              19230002
&LASTCC  SETA  &SKIP                                                    19280002
&TEST    SETB  1                                                        19330002
.ABC     ANOP                                                           19380002
&CARRCON SETC  'A&SYSNDX'                                               19430002
&NRENTS  SETA  &NRENTS+1                                                19480002
.DD      ANOP                                                           19530002
.NOCHANG ANOP                                                           19580002
         MEND                                                           19630002
         EJECT                                                          19680002
         MACRO                                                          19730002
         HEX                                                            19780002
.*                            THIS MACRO FACILITATES GENERATION OF THE  19830002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    19880002
.*                                 CONVERSIONS.                         19930002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 19980002
.*                                 CONVERTED                            20030002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  20080002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   20130002
.*                                 BACK UP FROM COLUMN FOR START OF     20180002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  20230002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  20280002
.*                                 DESIRED. OMISSION OF THIS OPERAND    20330002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  20380002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  20430002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 20480002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    20530002
.*                                 IMPLICITLY B).                       20580002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      20630002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     20680002
.*                                 WITH AN L,R, OR B TO STIPULATE       20730002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     20780002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     20830002
.*                                 RESPECTIVELY. OMISSION OF THIS       20880002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  20930002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 20980002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 21030002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   21080002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     21130002
.*                                 SUBJECT LINE(S).                     21180002
         GBLC &ITEM(1000),&DSECT                                        21230002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 21280002
         GBLA  &INITIAL                                                 21330002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               21380002
         LCLB  &B,&SUB                                                  21430002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP              21480002
         LCLC  &S,&LETTER                                               21530002
         AIF   (&DIAGTST EQ 0).NOMSG                                    21580002
         AIF   (&INITIAL EQ 0).NOMSG                                    21630002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    21680002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  21730002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     21780002
*        LINE                                                           21830002
         LINE                                                           21880002
.NOMSG   ANOP                                                           21930002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  21980002
&SUB     SETB  1                                                        22030002
.LOOP    ANOP                                                           22080002
&OP      SETA  &OP+1                                                    22130002
.LOOP1   ANOP                                                           22180002
&NDX     SETA  &NDX+1                                                   22230002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               22280002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 22330002
         MNOTE '**LOG ITEM NOT DEFINED**'                               22380002
         MEXIT                                                          22430002
.FOUND   ANOP                                                           22480002
&ISHIFT  SETA  &SHIFT(&NDX)                                             22530002
&IBITS   SETA  &BITS(&NDX)                                              22580002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     22630002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          22680002
         MEXIT                                                          22730002
.ALIGN   ANOP                                                           22780002
&CODE    SETA  1                                                        22830002
         AIF   (&SUB EQ 1).SUBA                                         22880002
&K       SETA  K'&SYSLIST(3)                                            22930002
         AGO   .SUBB                                                    22980002
.SUBA    ANOP                                                           23030002
&K       SETA  K'&SYSLIST(&OP,3)                                        23080002
.SUBB    ANOP                                                           23130002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            23180002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 23230002
         MEXIT                                                          23280002
.OK      AIF   (&SUB EQ 1).SUBC                                         23330002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            23380002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      23430002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    23480002
         AGO   .SUBD                                                    23530002
.SUBC    ANOP                                                           23580002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        23630002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  23680002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                23730002
.SUBD    ANOP                                                           23780002
&BYTESP  SETA  &S                                                       23830002
         AIF   ('&LETTER' EQ 'B').BOTH                                  23880002
         AIF   ('&LETTER' EQ 'L').LEFT                                  23930002
&CODE    SETA  2                                                        23980002
         AGO   .L                                                       24030002
.LEFT    ANOP                                                           24080002
&CODE    SETA  1                                                        24130002
         AGO   .L                                                       24180002
.USEDEFN ANOP                                                           24230002
&BYTESP  SETA  &IBITS/8                                                 24280002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       24330002
&CODE    SETA  3                                                        24380002
&T       SETA  &BYTESP*2-1                                              24430002
&S       SETC  '&T'                                                     24480002
.OK2     AIF   (&ISHIFT EQ 0).L                                         24530002
&CODE    SETA  2                                                        24580002
.L       ANOP                                                           24630002
&B       SETB  1                                                        24680002
         AIF   (&SUB EQ 1).SUBE                                         24730002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             24780002
&K       SETA  K'&SYSLIST(2)                                            24830002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              24880002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                24930002
         AGO   .SUBF                                                    24980002
.SUBE    ANOP                                                           25030002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         25080002
&K       SETA  K'&SYSLIST(&OP,2)                                        25130002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          25180002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            25230002
.SUBF    ANOP                                                           25280002
.BACKUP  ANOP                                                           25330002
&NRENTS  SETA  &NRENTS+1                                                25380002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    25430002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 25480002
         MEXIT                                                          25530002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         25580002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        25630002
         AGO   .SUBH                                                    25680002
.SUBG    ANOP                                                           25730002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    25780002
.SUBH    ANOP                                                           25830002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              25880002
.OUT     ANOP                                                           25930002
&NDX     SETA  0                                                        25980002
         AIF   (&SUB EQ 0).OUTA                                         26030002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 26080002
.OUTA    ANOP                                                           26130002
         MEND                                                           26180002
         EJECT                                                          26230002
         MACRO                                                          26280002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C26330002
               &LABEL7,&LABEL8                                          26380002
.*                                 THIS MACRO ALLOWS LABELS TO          26430002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   26480002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  26530002
.*                                 TION MARKS. THE COLUMN AND LINE END  26580002
.*                                 CONTROLS WILL BE INSERTED BY THE     26630002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      26680002
.*                                 LABEL REQUIRED FOR RESPECTIVE        26730002
.*                                 COLUMN.                              26780002
         GBLC &LABELS(2000)                                             26830002
         GBLC  &LBL(100)                                                26880002
         GBLA  &LBLCTR(100)                                             26930002
         GBLA  &LABELNR                                                 26980002
         GBLA  &NRENTS,&LPTR,&INITIAL                                   27030002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               27080002
         LCLC  &MARGIN,&TACK                                            27130002
         LCLC  &TEXT                                                    27180002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            27230002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  27280002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  27330002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  27380002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             27430002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   27480002
*        LINE                                                           27530002
         LINE                                                           27580002
.DIAGCLR ANOP                                                           27630002
&DIAGSET SETB  0                                                        27680002
&DIAGLIN SETB  0                                                        27730002
&MARGIN  SETC  '*'                                                      27780002
         AIF   ('&NAME' EQ '').LOOPOUT                                  27830002
&LPTR    SETA  &LPTR+1                                                  27880002
&LBL(&LPTR) SETC '&NAME'                                                27930002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          27980002
.LOOPOUT ANOP                                                           28030002
&OP      SETA  &OP+1                                                    28080002
&K       SETA  K'&SYSLIST(&OP)                                          28130002
         AIF (&K GE 2).NORM                                             28180002
&K       SETA  2                                                        28230002
.NORM    ANOP                                                           28280002
&START   SETA  2                                                        28330002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                28380002
&MARGIN  SETC  '$'                                                      28430002
.NOTLAST ANOP                                                           28480002
&NRCHAR  SETA  8                                                        28530002
&TACK    SETC  ''                                                       28580002
.LOOPIN  ANOP                                                           28630002
&REMAIN  SETA  &K-&START                                                28680002
         AIF (&REMAIN GE 8).MORE                                        28730002
&TACK    SETC  '&MARGIN'                                                28780002
&NRCHAR  SETA  &REMAIN                                                  28830002
.MORE    ANOP                                                           28880002
&TEXT    SETC  ''                                                       28930002
         AIF (&REMAIN EQ 0).ENDTEXT                                     28980002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          29030002
.ENDTEXT ANOP                                                           29080002
&LABELNR SETA  &LABELNR+1                                               29130002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  29180002
&START   SETA  &START+8                                                 29230002
         AIF ('&TACK' EQ '').LOOPIN                                     29280002
         AIF ('&TACK' EQ '*').LOOPOUT                                   29330002
         MEND                                                           29380002
         EJECT                                                          29430002
         SPACE 2                                                        35280002
         GBLC  &DSECT,&CSECT                                            35370002
IFCEXXXX CSECT                                                          35460002
&CSECT   SETC  'IFCEXXXX'                                               35550002
&DSECT   SETC  'XXXX'                                                   35640002
*                                                                       35730002
*                   EDIT TABLE FOR  T C A M  OBR RECORDS                35820002
*                                                                       35910002
*        DEVICE CODE= 4000    DEVICE TYPE= 7770      TERMINAL TYPE      36000002
*                     4001                 2702     IBM 1050  IBM 1030  36090002
*                     4002                 2701     ATT 83B3  CC TWX    36180002
*                     4003                 2703     WTTA      IBM 2260  36270002
*                     4005                 3705     S/360     IBM 1060  36360002
*                                                   WU 115A   IBM 1130  36450002
*                                                   IBM 2780  IBM 2740  36540002
*                                                   2741C     2741P     36630002
*                                                                       36720002
*                                                                       36810002
XXXX     DSECT                                                          36900002
         DSGEN (CLASRC,8),(SYSREL,8),(SWITCHES,16)                      36990002
         DSGEN (SPARE1,32)                                              37080002
         DSGEN (DAY,32)                                                 37170002
         DSGEN (HOUR,32)                                                37260002
         DSGEN (SPARE2,8),(CPUSERL,24)                                  37350002
         DSGEN (CPUID,16),(SPARE3,16)                                   37440002
         DSGEN (JOBID1,32)                                              37530002
         DSGEN (JOBID2,32)                                              37620002
         DSGEN (FCCWCC,8),(FCCWDA,24)                                   37710002
         DSGEN (FCCWFL,8),(FCCW,8),(FCCWCT,16)                          37800002
         DSGEN (CSWK,8),(CSWCA,24)                                      37890002
         DSGEN (CSWUS1,1),(CSWUS2,1),(CSWUS3,1),(CSWUS4,1),(CSWUS5,1), C37980002
               (CSWUS6,1),(CSWUS7,1),(CSWUS8,1),(CSWCS1,1),(CSWCS2,1), C38070002
               (CSWCS3,1),(CSWCS4,1),(CSWCS5,1),(CSWCS6,1),(CSWCS7,1), C38160002
               (CSWCS8,1),(CSWCT,16)                                    38250002
         DSGEN (DEVDPD,8),(SECCUA,24)                            S21926 38340002
         DSGEN (DEVTYP1,8),(DEVTYP1A,8),(DEVTYP2,16)             S21926 38430002
         DSGEN (SPARE4,8),(CUA,24)                                      38520002
         DSGEN (IORET,24),(SBCNT,8)                              S21926 38610002
         DSGEN (SIOCNT,16),(TEMPER,8),(MASK,8)                          38700002
         DSGEN (OP1,8),(OP2,8),(TCAMFL,8),(LDGRAPH,8)                   38790002
         DSGEN (TERMNM1,32)                                             38880002
         DSGEN (TERMNM2,32)                                             38970002
         DSGEN (SNB01,1),(SNB02,1),(SNB03,1),(SNB04,1),(SNB05,1),      C39240002
               (SNB06,1),(SNB07,1),(SNB08,1),(SNB11,1),(SNB12,1),      C39330002
               (SNB13,1),(SNB14,1),(SNB15,1),(SNB16,1),(SNB17,1),      C39420002
               (SNB18,1),(SPARE8,16)                             S21926 39510002
IFCEXXXX CSECT                                                          39600002
         USING *,R9                                                     39690002
         USING XXXX,R2                                           S21926 39780002
R0       EQU   0                                                        39870002
R1       EQU   1                                                        39960002
R2       EQU   2                                                        40050002
R3       EQU   3                                                        40140002
R4       EQU   4                                                        40230002
R5       EQU   5                                                        40320002
R6       EQU   6                                                        40410002
R7       EQU   7                                                        40500002
R8       EQU   8                                                        40590002
R9       EQU   9                                                        40680002
R10      EQU   10                                                       40770002
R11      EQU   11                                                       40860002
R12      EQU   12                                                       40950002
R13      EQU   13                                                       41040002
R14      EQU   14                                                       41130002
R15      EQU   15                                                       41220002
*                                                                       41310002
L0       EQU   0                                                        41400002
L1       EQU   1                                                        41490002
L2       EQU   2                                                        41580002
L3       EQU   3                                                        41670002
L4       EQU   4                                                        41760002
L5       EQU   5                                                        41850002
L6       EQU   6                                                        41940002
L7       EQU   7                                                        42030002
L8       EQU   8                                                        42120002
L9       EQU   9                                                        42210002
L10      EQU   10                                                       42300002
L11      EQU   11                                                       42390002
L12      EQU   12                                                       42480002
L13      EQU   13                                                       42570002
L14      EQU   14                                                       42660002
L15      EQU   15                                                       42750002
L16      EQU   16                                                       42840002
L17      EQU   17                                                       42930002
L18      EQU   18                                                       43020002
L19      EQU   19                                                       43110002
L20      EQU   20                                                       43200002
L23      EQU   23                                                       43290002
L24      EQU   24                                                       43380002
L26      EQU   26                                                       43470002
L29      EQU   29                                                S21926 43560002
L36      EQU   36                                                S21926 43650002
L46      EQU   46                                                S21926 43740002
L49      EQU   49                                                       43830002
H0F      EQU   X'0F'                                                    43920002
HE0      EQU   X'E0'                                                    44010002
H80      EQU   X'80'                                                    44100002
H40      EQU   X'40'                                                    44190002
H20      EQU   X'20'                                                    44280002
H10      EQU   X'10'                                                    44370002
H21      EQU   X'21'                                                    44460002
H23      EQU   X'23'                                                    44550002
H25      EQU   X'25'                                                    44640002
H29      EQU   X'29'                                                    44730002
CLRSGN   EQU   X'F0'                                                    44820002
NORCE    EQU   X'60'                                                    44910002
         DC    A(ENTRIES)                                               45000002
         DC    CL8'IFCEXXXX'                                            45090002
XR9PTR   DC    F'0'                                                     45180002
XLABELP  DC    F'0'                                                     45270002
*                                                                       45360002
*        RESTORE REGISTERS USED BY ROUTINES IN THIS MODULE              45450002
*                                                                       45540002
RETURN   LM    R5,R8,XSAVE             RESTORE REGS                     45630002
         BR    R14                     RETURN                           45720002
*                                                                S21926 45810002
*        SET OS RELEASE NUMBER                                   S21926 45900002
*                                                                S21926 45990002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  46080002
         SR    R6,R6                    CLEAR R6                        46170002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        46260002
         SRDL  R6,L5                    SAVE REL NO IN R7               46350002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          46440002
         L     R8,XLABELP               PICK UP LABEL POINTER           46530002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     46620002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     46710002
         SR    R6,R6                    CLEAR R6                        46800002
         SLDL  R6,L5                    RETREIVE REL NO.                46890002
         LTR   R6,R6                    IS IT ZERO                      46980002
         BZ    NOREL                    BR-YES                          47070002
         CVD   R6,WORK                  CONVERT IT                      47160002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       47250002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             47340002
         B     RETURN                   EXIT                            47430002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            47520002
         B     RETURN                                                   47610002
*                                                                       47615002
U3705    STM   R5,R8,XSAVE                                              47620002
         MVC   HSAVE,L1(R4)                                             47625002
         NI    L1(R4),H0F                                               47630002
         CLC   L0(L2,R4),UNIT05                                         47635002
         BNE   CHK3270                                         @YA02789 47640002
         SR    R5,R5                                                    47645002
         LA    R5,LAB05                                                 47650002
         ST    R5,XLABELP                                               47655002
         B     RETURN                                                   47660002
*                                                                       47665002
CHK3270  CLC   L0(L2,R4),T3270L         CHECK FOR A 3270       @YA02789 47665702
         BNE   RETURN                                          @YA02789 47666402
         LA    R5,LAB3270               ADDRESS OF 3270 LABELS @YA02789 47667102
         ST    R5,XLABELP               CHANGE LABEL POINTER   @YA02789 47667802
         B     RETURN                                          @YA02789 47668502
*                                                              @YA02789 47669202
RSET05   STM   R5,R8,XSAVE                                              47670002
         SR    R5,R5                                                    47675002
         LA    R5,LABLIN                                                47680002
         ST    R5,XLABELP                                               47685002
         B     RETURN                                                   47690002
*                                                                       47695002
*                                                                       47700002
*        SET THE DATE READY FOR PRINT                                   47790002
*                                                                       47880002
SETDATE  UNPK  XSAVE(L8),L1(L3,R4)     UNPACK THE DATE                  47970002
         MVC   L0(L3,R3),XSAVE+L5      MOVE DAY                         48060002
         MVC   L6(L2,R3),XSAVE+L3      MOVE YEAR                        48150002
         BR    R14                                                      48240002
*                                                                       48330002
*        SET THE DEVICE TYPE READY FOR PRINT                            48420002
*                                                                       48510002
SETDEVT  STM   R5,R8,XSAVE             SAVE REGS                        48600002
         LA    R5,L8                   8 DEVICES IN TABLE      @XA20610 48690001
         LA    R6,DEVTABLE             POIT TO DEVICE TYPES             48780002
         MVC   HSAVE,L1(R4)                                             48870002
         NI    L1(R4),H0F                                               48960002
SETDEVLP CLC   L0(L2,R4),L0(R6)        COMPARE TYPES                    49050002
         BE    SDEVFND                 FOUND ONE SO BRANCH              49140002
         LA    R6,L6(R6)               MOVE POINTER TO LOOK AT NEXT T   49230002
         BCT   R5,SETDEVLP             BRANCH IF THERE ARE MORE         49320002
         MVC   L0(L4,R3),NONE          NO DEV TYPE MOVE IN NONE         49410002
         MVC   L1(L1,R4),HSAVE                                          49500002
         B     RETURN                                                   49590002
SDEVFND  MVC   L0(L4,R3),L2(R6)        MOVE DEV NAME TO PRINT LINE      49680002
         MVC   L1(L1,R4),HSAVE                                          49770002
         B     RETURN                                                   49860002
************************************************************** @XA20610 49865001
* PRINT THIS LINE IF DEVICE TYPE = X'100B' (3286)              @XA20610 49870001
************************************************************** @XA20610 49875001
P3286    CLC   L0(L2,R4),DEV3286       IS THIS D/T 3286        @XA20610 49880001
         BCR   8,R14                   YES, PRINT THIS LINE    @XA20610 49885001
         SR    R15,R15                 NO, SO DO NOT PRINT     @XA20610 49890001
         BR    R14                     RETURN                  @XA20610 49895001
DEV3286  DC    X'100B'                                         @XA20610 49900001
************************************************************** @XA20610 49905001
* PRINT THIS LINE IF DEVICE TYPE NOT = X'100B' (3286)          @XA20610 49910001
************************************************************** @XA20610 49915001
N3286    CLC   L0(L2,R4),DEV3286       IS THIS D/T 3286        @XA20610 49920001
         BCR   7,R14                   NO, SO PRINT THIS LINE  @XA20610 49925001
         SR    R15,R15                 YES, SO DO NOT PRINT    @XA20610 49930001
         BR    R14                     RETURN                  @XA20610 49935001
*                                                                       49950002
*        CHECK FOR CPU AND SERIAL NUMBER                                50040002
*                                                                       50130002
SETCPUNO STM   R5,R8,XSAVE             SAVE REGS                        50220002
         SR    R5,R5                   CLEAR R5                         50310002
         IC    R5,L0(R4)               PICK UP MODEL NO                 50400002
         SLL   R5,L8                   IN TO                            50490002
         IC    R5,L1(R4)               R5                               50580002
         LTR   R5,R5                   TEST FOR ZERO                    50670002
         LR    R5,R3                   PUT LINE ADDRESS IN R5    S21926 50760002
         BNZ   SETSER                  NON ZERO BRANCH           S21926 50850002
         LA    R6,L46                  OFFSET IN REG SIX         S21926 50940002
         SR    R5,R6                                             S21926 51030002
         MVC   L0(L29,R5),UNIVERS      PUT IN UNIVERSAL NONE     S21926 51120002
         B     RETURN                                            S21926 51210002
*                                                                S21926 51300002
SETSER   LA    R6,L36                  OFFSET IN REG 6           S21926 51390002
         SR    R5,R6                   SUBTRACT OFFSET           S21926 51480002
         MVC   L0(L10,R5),SERNO        MOVE IN SERIAL NO.        S21926 51570002
         B     RETURN                                                   51660002
*                                                                       51750002
*        SET PROGRAM NAME TO PRINT LINE                                 51840002
*                                                                       51930002
SETPGMN  MVC   L0(L8,R3),L0(R4)        MOVE 8 CHARS TO LINE             52020002
         BR    R14                     RETURN                           52110002
*                                                                       52200002
*        SET BINARY WITH R4 POINTING TO THE CHAR                        52290002
*                                                                       52380002
SETBIN   STM   R5,R8,XSAVE             SAVE REGS                        52470002
         IC    R7,L0(R4)               PICK UP CHAR TO PRINT            52560002
         SLL   R7,L24                  MOVE IT TO HI OF R7              52650002
         LR    R8,R3                   PRINT POS POINTER TO REG8        52740002
         LA    R5,L8                   LOOP COUNT                       52830002
SETBINA  SR    R6,R6                   CLEAR REG 6                      52920002
         SLDL  R6,L1                   MOVE BIT TO R6                   53010002
         STC   R6,L0(R8)               PUT IT INTO PRINT LINE           53100002
         MVZ   L0(L1,R8),CHAR0                                          53190002
         LA    R8,L1(R8)               MOVE POINTER TO NEXT POS         53280002
         BCT   R5,SETBINA              LOOP TILL 8 PRINTED              53370002
         B     RETURN                                                   53460002
*                                                                       53550002
*        SET HEX -PRINTS 1 CHAR HEX                                     53640002
*                                                                       53730002
SETHEX   STM   R5,R8,XSAVE             SAVE REGS                        53820002
         LA    R8,CHARS                CHARACTER TABLE POINTER          53910002
         IC    R7,L0(R4)               PICK UP CHARACTER                54000002
         SLL   R7,L24                  MOVE TO HI R7                    54090002
         SR    R6,R6                   CLEAR REGS                       54180002
         SLDL  R6,L4                   MOVE FOUR BITS                   54270002
         AR    R6,R8                   ADD OFFSET AND POINTER           54360002
         MVC   L0(L1,R3),L0(R6)        MOVE CHARACTER TO LINE           54450002
         SR    R6,R6                   CLEAR AGAIN                      54540002
         SLDL  R6,L4                   MOVE LAST 4 BITS                 54630002
         AR    R6,R8                   COMPUTE OFFSET                   54720002
         MVC   L1(L1,R3),L0(R6)        MOVE LAST CHARACTER              54810002
         B     RETURN                                                   54900002
*                                                                       54990002
*        TEST TO SEE IF RECORD IS IN AR-149 FORMAT                      55080002
*                                                                       55170002
SETCONV  STM   R5,R8,XSAVE             SAVE REGS                 S21926 55260002
         TM    L0(R4),HEX02            HAS RECORD BEEN CONVERTED S21926 55350002
         BO    SETCONV1                                          S21926 55440002
         SR    R15,R15                 NO,CLEAR PRINT LINE       S21926 55530002
         B     RETURN                                            S21926 55620002
SETCONV1 IC    R5,SBCNTL               GET SENSE BYTE COUNT      S21926 55710002
         STC   R5,SBCNT                                          S21926 55800002
         MVC   SNB01(L2),SNB01+L17      MOVE SENSE OVER SDR      P4954  55890002
         B     RETURN                                            S21926 55980002
SBCNTL   DC    X'02'                                             S21926 56070002
ON       EQU   1                                                        56160002
HEX02    EQU   X'02'                                                    56250002
*                                                                       56340002
*        NO OP RETURN                                                   56430002
*                                                                       56520002
SKIPPER  BR    R14                                                      56610002
*                                                                       56700002
*        TO ADD SPACES ON LINE                                          56790002
*                                                                       56880002
SPACER1  LA    R3,L1(R3)                                                56970002
         BR    R14                                                      57060002
SPACER2  LA    R3,L2(R3)                                                57150002
         BR    14                                                       57240002
SPACER19 LA    R3,L19(R3)                                               57330002
         BR    R14                                                      57420002
*                                                                       57510002
*        DEFINE THE MODE IN WHICH TCAM RECORD WAS RECORDED              57600002
*                                                                       57690002
RECMODE  TM    L0(R4),HE0              TEST FOR UNRECOVERABLE           57780002
         BNZ   INTEST                  NO                               57870002
         MVC   L0(L15,R3),UNREC        MOVE IN MODE                     57960002
         BR    R14                     RETURN                           58050002
INTEST   TM    L0(R4),H80              TEST FOR UNINTENSIVE             58140002
         BNO   OVERTST                 NO                               58230002
         MVC   L0(L15,R3),INTEN        MOVE IN MODE                     58320002
         BR    R14                     RETURN                           58410002
OVERTST  TM    L0(R4),H40              TEST FOR OVERFLOW                58500002
         BNO   EODTST                  NO                               58590002
         MVC   L0(L15,R3),OVERF        MOVE IN MODE                     58680002
         BR    R14                     RETURN                           58770002
EODTST   MVC   L0(L15,R3),EOD          MOVE IN MODE                     58860002
         BR    R14                                                      58950002
*                                                                       59040002
*        CONVERT COUNTERS FROM HEX TO DECIMAL READY FOR PRINT           59130002
*                                                                       59220002
CONV1    STM   R5,R8,XSAVE             SAVE REGISTERS                   59310002
         XC    READYP(L8),READYP       CLEAR UNPACK BUFFER              59400002
         SR    R6,R6                   ZERO REG                         59490002
         MVC   READYP(L2),L0(R4)        ALIGN DATA             @YA02789 59580002
         LH    R6,READYP                LOAD DATA TO BE CONVERTED       59610002
         XC    READYP(L8),READYP        CLEAR BUCKET           @YA02789 59640002
         CVD   R6,READYP               CONVERT ERROR COUNTER TO DECI    59670002
         UNPK  READYP(L5),READYP+L5(L3)  UNPACK DECI COUNT              59760002
         OI    READYP+L4,CLRSGN        CLEAR SIGN                       59850002
         MVC   L0(L5,R3),READYP         MOVE COUNTER READY TO PRINT     59940002
         SR    R7,R7                                                    60030002
         IC    R7,L2(R4)                                                60120002
         CVD   R7,READYP                                                60210002
         UNPK  READYP(L5),READYP+L5(L3)                                 60300002
         OI      READYP+L4,CLRSGN                                       60390002
         MVC   L49(L4,R3),READYP+L1                                     60480002
         B     RETURN                                                   60570002
*                                                                       60660002
*        TEST FOR INITIAL SELECTION ERROR  ENTER 1 IF YES, 0 IF NO      60750002
*                                                                       60840002
RECMODE1 TM    L0(R4),H10              IS INITIAL SELECTION ON          60930002
         BZ    NOTON                   NO                               61020002
         MVC   L0(L1,R3),ONE           YES MOVE IN ONE                  61110002
         BR    R14                     RETURN                           61200002
NOTON    MVC   L0(L1,R3),ZERO          NO MOVE IN ZERO                  61290002
         BR    R14                     RETURN                           61380002
*                                                                       61470002
*        TEST FOR A GRAPHIC ERROR FROM A TERMINAL, OR AN END OF DAY OR  61560002
*        COUNTER OVER FLOW RECORD. IF YES LINE AND LABEL POINTERS GET   61650002
*        SET PAST THOSE THAT PRINT CCW AND SENSE.                       61740002
*                                                                       61830002
CHECKMOD STM   R5,R8,XSAVE                                              61920002
         TM    L1(R4),H21              IS THIS A GRAPHIC ERROR          62010002
         BO    RIGHTON                 YES                              62100002
         TM    L0(R4),NORCE            NO- IS THE EOD OR CNTR OVERFLOW  62190002
         BNZ   RIGHTON                 YES                              62280002
         B     RETURN                                                   62370002
*                                                                       62460002
RIGHTON  LA    R5,LINES1                                                62550002
         SH    R5,FOUR                 SUBTRACT FOUR FROM ADDRESS TO PR 62640002
         ST    R5,XR9PTR                                                62730002
         LA    R5,LSTLINE                                               62820002
         ST    R5,XLABELP                                               62910002
         B     RETURN                                                   63000002
*                                                                       63090002
*        TEST FOR GRAPHIC ERROR. IF YES FIND THE TYPE AND PRINT.        63180002
*        IF NO SKIP THAT PRINT LINE.                                    63270002
*                                                                       63360002
CHKGRAP  TM    L0(R4),H21              IS THIS A GRAPHIC ERROR          63450002
         BZ    NOTGRAP                 NO-DONT PRINT THIS LINE          63540002
         TM    L0(R4),H23              YES - IS IT THE CHARACTER /      63630002
         BNO   CH1                     NO                               63720002
         MVC   L0(L26,R3),TERM1        YES-MOVE IN ERROR INDICATION     63810002
         BR    R14                                                      63900002
CH1      TM    L0(R4),H25              IS IT THE CHARACTER S            63990002
         BNO   CH2                     NO                               64080002
         MVC   L0(L23,R3),TERM2        YES-MOVE IN ERROR INDICATION     64170002
         BR    R14                     RETURN                           64260002
CH2      TM    L0(R4),H29              IS IT THE CHARACTER U            64350002
         BNO   CH3                     NO                               64440002
         MVC   L0(L23,R3),TERM3        YES-MOVE IN ERROR INDICATION     64530002
         BR    R14                     RETURN                           64620002
CH3      MVC   L0(L24,R3),TERM4                                         64710002
         BR    R14                     RETURN                           64800002
NOTGRAP  SR    R15,R15                 ZERO REG 15 TO INDICATE NO PRINT 64890002
         BR    R14                     RETURN                           64980002
*                                                                       65070002
*                                                                       65160002
*                                                                       65250002
*        GET COMMUNICATION ADAPTER TYPE AND MOVE IN READY FOR PRINT     65340002
*                                                                       65430002
*                                                                       65520002
*                                                                       65610002
SETADPT  STM   R5,R8,XSAVE             SAVE REGISTERS                   65700002
         SR    R6,R6                   ZERO REG                         65790002
         CLI   L0(R4),H40              COMPARE FOR COMUNICATIONS TYPE   65880002
         BNE   NOPRTRET                NO-FIX TO NO PRINT               65970002
         IC    R6,L1(R4)               YES-PICK UP CHARACTER DEVICE TYP 66060002
         SRL   R6,L4                   DROP OFF LOW 4 BITS              66150002
         MH    R6,HALF13               COMPUTE INDEX                    66240002
         LA    R5,ADPTYPE              PICK UP TABLE ADDRESS            66330002
         AR    R5,R6                   SET ADDRESS TO LABEL             66420002
         MVC   L0(L13,R3),L0(R5)       MOVE IN TYPE DEVICE              66510002
         B     RETURN                                                   66600002
NOPRTRET SR    R15,R15                                                  66690002
         B     RETURN                                                   66780002
*                                                                       66870002
*        GET TERMINAL TYPE AND MOVE IN READY FOR PRINT                  66960002
*                                                                       67050002
SETTERM  STM   R5,R8,XSAVE             SAVE REGISTERS                   67140002
         CLI   L2(R4),H40              COMPARE FOR COMUNICATIONS TYPE   67230002
         BNE   NOPRTRET                NO-FIX TO NO PRINT OF TERM TYPE  67320002
         SR    R6,R6                   YES-CLEAR REGS                   67410002
         SR    R7,R7                                                    67500002
         IC    R7,L3(R4)               PICK UP CHARS FROM DEVICE TYPE   67590002
         IC    R6,L0(R4)               TO DETERMINE TERMINAL TYPE       67680002
         SRL   R7,L4                   DROP OFF LOW 4 BITS              67770002
         SLL   R7,L4                                                    67860002
         SLL   R6,L8                   MOVE IT OVER ONE BYTE            67950002
         OR    R6,R7                   SET UP KEY HALF                  68040002
         LA    R7,L15                  SET UP LOOP COUNT                68130002
         LA    R8,COMMTAB              SET PTR TO TERM TYPE TAB         68220002
COMLOOP  CH    R6,L0(R8)               IS IT THIS TYPE                  68310002
         BE    COMFND                  BR-YES                           68400002
         LA    R8,L10(R8)              UP POINTER TO NEXT               68490002
         BCT   R7,COMLOOP              LOOP                             68580002
         MVC   L0(L6,R3),ADPTYPE       MOVE IN NONE                     68670002
         B     RETURN                                                   68760002
COMFND   MVC   L0(L8,R3),L2(R8)        MOVE IN TERM NAME                68850002
         B     RETURN                                                   68940002
         DS    0F                                                       69030002
XSAVE    DC    5F'0'                                                    69120002
NONE     DC    CL8'NONE    '                                            69210002
CHARS    DC    C'0123456789ABCDEF'                                      69300002
CHAR0    DC    C'0'                                                     69390002
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                  S21926 69480002
SERNO    DC    C'SERIAL NO.'                                     S21926 69570002
UNREC    DC    C'*UNRECOVERABLE*'                                       69660002
INTEN    DC    C'*INTENSIFIED*  '                                       69750002
OVERF    DC    C'*OVERFLOW*     '                                       69840002
EOD      DC    C'*END OF DAY*   '                                       69930002
ONE      DC    C'1'                                                     70020002
ZERO     DC    C'0'                                                     70110002
FIVETWO  DC    H'52'                                                    70200002
HSAVE    DC    CL1' '                                                   70290002
LSTLINE  DC    C' $'                                                    70380002
         DC    C'TERMINAL NAME*'                                        70470002
         DC    C'RECORDING MODE$'                                       70560002
         DC    C'SIO CNTR*'                                             70650002
         DC    C'TEMPORARY ERR CNTR$'                                   70740002
         DC    C'MASK*'                                                 70830002
         DC    C'INITIAL SELECTION$'                             S21926 70920002
         DC    C'2740 - II LEADING GRAPHIC$'                            71010002
         DC    C' $'                                                    71100002
LAB05    DC    C'N/A*'                                                  71109002
         DC    C'N/A$'                                                  71118002
         DC    C'N/A*'                                                  71127002
         DC    C'N/A$'                                                  71136002
         DC    C'IPL REQST*'                                            71145002
         DC    C'IPL REQST$'                                            71154002
         DC    C'ABORT*'                                                71163002
         DC    C'ABORT$'                                                71172002
         DC    C' $'                                                    71181002
LAB3270  DC    C'DATA CHK*DATA CHK$'                           @YA02789 71182002
         DC    C'UNIT SPEC*UNIT SPEC$'                         @YA02789 71183002
         DC    C'CNTL CHK*CNTL CHK$'                           @YA02789 71184002
         DC    C'OPRTN*OPRTN$$$'                               @YA02789 71185002
TERM1    DC    C'/  (TERM ELECTRONIC ERROR)'                            71190002
TERM2    DC    C'S  (TERM I/O ERROR)       '                            71280002
TERM3    DC    C'U  (REC. PARITY ERROR)    '                            71370002
TERM4    DC    C'Y  (TRANS. PARITY ERROR)  '                            71460002
HALF13   DC    H'13'                                                    71550002
FOUR     DC    X'0004'                                                  71640002
         DS    0D                                                       71730002
READYP   DC    CL8' '                                                   71820002
*                                                                       71910002
RELTAB   DS    0C                                              @L03976  72000002
         DC    C'OS  '                                         @L03976  72060002
         DC    C'DOS '                                         @L03976  72120002
         DC    C'VS 1'                                         @L03976  72180002
         DC    C'V370'                                         @L03976  72240002
         DC    C'VS 2'                                         @L03976  72300002
         DC    C'    '                                         @L03976  72360002
         DC    C'    '                                         @L03976  72420002
         DC    C'    '                                         @L03976  72480002
WORK     EQU   READYP                                                   72540002
XRELN    EQU   SYSREL                                                   72630002
*        DEVICE TYPES SUPPORTED BY THIS TABLE                           72720002
*                                                                       72810002
DEVTABLE DC    X'4001'                                                  72900002
         DC    C'2702'                                                  72990002
         DC    X'4002'                                                  73080002
         DC    C'2701'                                                  73170002
         DC    X'4003'                                                  73260002
         DC    C'2703'                                                  73350002
         DC    X'4000'                                                  73440002
         DC    C'7770'                                                  73530002
         DC    X'1003'                                                  73620002
         DC    C'2848'                                                  73710002
T3270L   DC    X'1009'                                         @YA02789 73720002
         DC    C'3270'                                         @YA02789 73730002
UNIT05   DC    X'4005'                                                  73740002
         DC    C'3705'                                                  73770002
         DC    X'100B'                                         @XA20610 73780001
         DC    C'3286'                                         @XA20610 73790001
*                                                                       73800002
*        COMMUNICATION ADAPTER TYPES SUPPORTED BY THIS TABLE            73890002
*                                                                       73980002
ADPTYPE  DC    CL13'NONE'                                               74070002
         DC    CL13'IBM TERM I'                                         74160002
         DC    CL13'IBM TERM II'                                        74250002
         DC    CL13'IBM TELEGRAPH'                                      74340002
         DC    CL13'TELEGRAPH I'                                        74430002
         DC    CL13'TELEGRAPH II'                                       74520002
         DC    CL13'WT TELEGRAPH'                                       74610002
         DC    CL13'SYNCH I'                                            74700002
         DC    CL13'IBM TERM III'                                       74790002
         DC    CL13'SYNCH II'                                           74880002
*                                                                       74970002
*        TERMINAL TYPES SUPPORTED BY THIS TABLE                         75060002
*                                                                       75150002
COMMTAB  DS    0F                                                       75240002
         DC    X'0110'                                                  75330002
         DC    C'IBM 1050'                                              75420002
         DC    X'0120'                                                  75510002
         DC    C'IBM 1030'                                              75600002
         DC    X'0130'                                                  75690002
         DC    C'IBM 1050'                                              75780002
         DC    X'0140'                                                  75870002
         DC    C'ATT 83B3'                                              75960002
         DC    X'0150'                                                  76050002
         DC    C'CC TWX  '                                              76140002
         DC    X'0160'                                                  76230002
         DC    C'WTTA    '                                              76320002
         DC    X'0170'                                                  76410002
         DC    C'IBM 2260'                                              76500002
         DC    X'0190'                                                  76590002
         DC    C'S/360   '                                              76680002
         DC    X'0210'                                                  76770002
         DC    C'IBM 1060'                                              76860002
         DC    X'0240'                                                  76950002
         DC    C'WU 115A'                                               77040002
         DC    X'0290'                                                  77130002
         DC    C'IBM 1130'                                              77220002
         DC    X'0390'                                                  77310002
         DC    C'IBM 2780'                                              77400002
         DC    X'0410'                                                  77490002
         DC    C'IBM 2740'                                              77580002
         DC    X'0510'                                                  77670002
         DC    C'2741C   '                                              77760002
         DC    X'0610'                                                  77850002
         DC    C'2741P   '                                              77940002
ENTRIES  DS    0F                                                       78030002
         DC    XL4'00010001'           FORMAT 1                         78120002
         DC    XL4'00010001'           FORMAT 2                         78210002
         DC    A(LABELS)               LABEL POINTER                    78300002
         DC    H'0'                    DISP                             78390002
*                                                                       78480002
*        SKIP TO CHANNEL  1                                             78570002
*                                                                       78660002
         DC    X'01'                                                    78750002
         DC    X'000B8B00'                                              78840002
*                                                                       78930002
STERTM   LINE  (78,23),(1,35),SKIP=1                             S21926 79020002
         HEX   CPUID,0,2B                                        S21926 79110002
         HEX   CPUSERL,0,3B                                      S21926 79200002
         ROUTINE   CPUID,SETCPUNO                                S21926 79290002
         LABEL '---RECORD ENTRY TYPE - UNIT CHECK','   SOURCE - TCAM OUC79380002
               TBOARD','MODEL-'                                         79470002
*                                                                       79560002
         LINE  (16,38),(4,42)                                    S21926 79650002
         ROUTINE    SYSREL,CONVREL                                      79740002
         LABEL      'XXXX REL.'                                         79830002
*                                                                S21926 79920002
         LINE  (98,1),(27,29)                                    S21926 80010002
         ROUTINE   JOBID1,SETPGMN                                S21926 80100002
         LABEL 'DAY YEAR','HH MM SS.TH','JOB IDENTITY'           S21926 80190002
*                                                                S21926 80280002
         LINE  (27,29),(21,30),SKIP=2                            S21926 80370002
         ROUTINE   DAY,SETDATE                                   S21926 80460002
         HEX   HOUR,1,4B                                         S21926 80550002
         ROUTINE   SPARE1,SKIPPER                                S21926 80640002
         HEX   JOBID1,B16,4B                                     S21926 80730002
         HEX   JOBID2,B37,4B                                     S21926 80820002
         LABEL 'DATE-','TIME'                                    S21926 80910002
*                                                                S21926 81000002
         LINE  ,(1,1),SKIP=2                                     S21926 81090002
         ROUTINE   CLASRC,SETCONV                                S21926 81180002
         LABEL 'OBR RECORD CONVERTED TO THE STANDARD FORMAT'     S21926 81270002
*                                                                S21926 81360002
         LINE  (34,1),(2,32),SKIP=1                              S21926 81450002
         ROUTINE   DEVTYP2,SETDEVT                               S21926 81540002
         LABEL 'DEVICE TYPE'                                     S21926 81630002
         LINE                                                           81720002
         HEX   CUA,B0,3B                                         S21926 81810002
         LABEL 'PRIMARY   CHANNEL UNIT ADDRESS'                  S21926 81900002
         LINE                                                           81990002
         HEX   SECCUA,B0,3B                                      S21926 82080002
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS'                  S21926 82170002
         LINE                                                           82260002
         ROUTINE   DEVTYP2,SETADPT                               S21926 82350002
         LABEL 'COMMUNICATION ADAPTER TYPE'                      S21926 82440002
         LINE  ,,SKIP=2                                          S21926 82530002
         ROUTINE   DEVTYP1,SETTERM                               S21926 82620002
         LABEL 'TERMINAL TYPE'                                   S21926 82710002
         LINE  ,,SKIP=1                                                 82800002
         ROUTINE   TCAMFL,CHECKMOD                                      82890002
         LABEL ' '                                                      82980002
         LINE  ,(14,41),SKIP=1                                          83070002
         ROUTINE   SPARE1,SKIPPER                                       83160002
         LABEL 'CC   CA   FL     CT','K    CA    US CS  CT'             83250002
*                                                                       83340002
         LINE  (14,3),(1,49),SKIP=2                                     83430002
         HEX   FCCWCC,0,1B                                              83520002
         HEX   FCCWDA,0,3B                                              83610002
         ROUTINE   SPARE1,SPACER1                                       83700002
         HEX   FCCWFL,0,1B                                              83790002
         HEX   FCCW,0,1B                                                83880002
         HEX   FCCWCT,0,2B                                              83970002
         ROUTINE   SPARE1,SPACER19                                      84060002
         HEX   CSWK,0,1B                                                84150002
         HEX   CSWCA,0,3B                                               84240002
         ROUTINE   SPARE1,SPACER2                                       84330002
         ROUTINE   CSWUS1,SETHEX                                        84420002
         ROUTINE   CSWCS1,SETHEX                                        84510002
         HEX   CSWCT,0,2B                                               84600002
         LABEL 'FAILING CCW','CSW'                                      84690002
*                                                                       84780002
         LINE  ,(1,38),SKIP=1                                           84870002
         ROUTINE   SPARE1,SKIPPER                                       84960002
         LABEL 'UNIT STATUS','CHANNEL STATUS'                           85050002
*                                                                       85140002
*        UNIT STATUS AND CHANNEL STATUS FIELDS IN DETAIL                85230002
*                                                                       85320002
         LINE  (21,38),(2,39)                                           85410002
         BIN   CSWUS1                                                   85500002
         BIN   CSWCS1                                                   85590002
         LABEL 'ATTENTION','PRGM-CTLD JRPT'                             85680002
         LINE                                                           85770002
         BIN   CSWUS2                                                   85860002
         BIN   CSWCS2                                                   85950002
         LABEL 'STATUS MODIFIER','INCORRECT LENGTH'                     86040002
         LINE                                                           86130002
         BIN   CSWUS3                                                   86220002
         BIN   CSWCS3                                                   86310002
         LABEL 'CONTROL UNIT END','PROGRAM CHECK'                       86400002
         LINE                                                           86490002
         BIN   CSWUS4                                                   86580002
         BIN   CSWCS4                                                   86670002
         LABEL 'BUSY','PROTECTION CHECK'                                86760002
         LINE                                                           86850002
         BIN   CSWUS5                                                   86940002
         BIN   CSWCS5                                                   87030002
         LABEL 'CHANNEL END','CHAN DATA CHECK'                          87120002
         LINE                                                           87210002
         BIN   CSWUS6                                                   87300002
         BIN   CSWCS6                                                   87390002
         LABEL 'DEVICE END','CHAN CTL CHECK'                            87480002
         LINE                                                           87570002
         BIN   CSWUS7                                                   87660002
         BIN   CSWCS8                                                   87750002
         LABEL 'UNIT CHECK','I/F CTL CHECK'                             87840002
         LINE  (21,38),(2,39),SKIP=2                                    87930002
         BIN   CSWUS8                                                   88020002
         BIN   CSWCS8                                                   88110002
         LABEL 'UNIT EXCEPTION','CHAINING CHECK'                        88200002
         LINE  ,(1,1),SKIP=1                                            88290002
         ROUTINE   SPARE1,SKIPPER                                       88380002
         LABEL 'SENSE BYTE DATA'                                        88470002
         LINE  ,(2,38),SKIP=2                                           88560002
         ROUTINE   SPARE1,SKIPPER                                       88650002
         LABEL 'INITIAL FAILURE','FINAL RETRY'                          88740002
         LINE  (11,39),(3,37),SKIP=1                                    88830002
         ROUTINE   SNB11,SETBIN                                         88920002
         ROUTINE   SNB01,SETBIN                                         89010002
         LABEL 'BYTE 0','BYTE 0'                                        89100002
*                                                                       89190002
*        SENSE BYTE DATA IN DETAIL                                      89280002
*                                                                       89370002
         LINE  (15,39),(4,37)                                           89460002
         BIN   SNB11                                                    89550002
         BIN   SNB01                                                    89640002
         LABEL 'CMND REJ','CMND REJ'                                    89730002
         LINE                                                           89820002
         BIN   SNB12                                                    89910002
         BIN   SNB02                                                    90000002
         LABEL 'INTV REQD','INTV REQD'                                  90090002
         LINE                                                           90180002
         BIN   SNB13                                                    90270002
         BIN   SNB03                                                    90360002
         LABEL 'BUS O CHK','BUS O CHK'                                  90450002
         LINE                                                           90540002
         BIN   SNB14                                                    90630002
         BIN   SNB04                                                    90720002
         LABEL 'EQUIP CHK','EQUIP CHK'                                  90810002
         LINE                                                           90900002
         BIN   SNB15                                                    90990002
         BIN   SNB05                                                    91080002
         ROUTINE    DEVTYP2,U3705                                       91120002
         LABEL 'DATA CHK','DATA CHK'                                    91170002
         LINE                                                           91260002
         BIN   SNB16                                                    91350002
         BIN   SNB06                                                    91440002
         ROUTINE DEVTYP2,N3286                                 @XA20610 91480001
         LABEL 'OVERRUN','OVERRUN'                                      91530002
         LINE  ,                                               @XA20610 91540001
         BIN   SNB16                                           @XA20610 91550001
         BIN   SNB06                                           @XA20610 91560001
         ROUTINE DEVTYP2,P3286                                 @XA20610 91570001
         LABEL 'UNIT SPCFY','UNIT SPCFY'                       @XA20610 91580001
         LINE                                                           91620002
         BIN   SNB17                                                    91710002
         BIN   SNB07                                                    91800002
         ROUTINE DEVTYP2,N3286                                 @XA20610 91840001
         LABEL 'LOST DATA','LOST DATA'                                  91890002
         LINE  ,                                               @XA20610 91900001
         BIN   SNB17                                           @XA20610 91910001
         BIN   SNB07                                           @XA20610 91920001
         ROUTINE DEVTYP2,P3286                                 @XA20610 91930001
         LABEL 'CNTRL CHK','CNTRL CHK'                         @XA20610 91940001
         LINE                                                           91980002
         BIN   SNB18                                                    92070002
         BIN   SNB08                                                    92160002
         ROUTINE DEVTYP2,N3286                                 @XA20610 92200001
         LABEL 'TIME OUT','TIME OUT'                                    92250002
         LINE  ,                                               @XA20610 92260001
         BIN   SNB18                                           @XA20610 92270001
         BIN   SNB08                                           @XA20610 92280001
         ROUTINE DEVTYP2,P3286                                 @XA20610 92290001
         LABEL 'OPRTN CHK','OPRTN CHK'                         @XA20610 92300001
*                                                                       92340002
         LINE                                                           92430002
         ROUTINE    SPARE1,RSET05                                       92520002
LABLIN   LABEL ' '                                                      92610002
*                                                                S21926 92700002
LINES1   LINE  (15,41),(1,39),SKIP=2                                    92790002
         ROUTINE   TERMNM1,SETPGMN                                      92880002
         ROUTINE   TCAMFL,RECMODE                                       92970002
         LABEL 'TERMINAL NAME','RECORDING MODE'                         93060002
*                                                                       93150002
         LINE  (11,49),(1,39),SKIP=2                                    93240002
         ROUTINE   SIOCNT,CONV1                                         93330002
         LABEL 'SIO CNTR','TEMPORARY ERR CNTR'                          93420002
*                                                                       93510002
         LINE  (7,52),(1,39),SKIP=2                                     93600002
         ROUTINE   MASK,SETBIN                                          93690002
         ROUTINE   TCAMFL,RECMODE1                                      93780002
         LABEL 'MASK','INITIAL SELECTION'                               93870002
*                                                                       93960002
*                                                                       94050002
         LINE  (27,1),(1,1),SKIP=1                                      94140002
         ROUTINE   LDGRAPH,CHKGRAP                                      94230002
         LABEL '2740 -II LEADING GRAPHIC'                               94320002
*                                                                       94410002
         LINE  ,,SKIP=1                                                 94500002
         ROUTINE   SPARE1,SKIPPER                                       94590002
         LABEL ' '                                                      94680002
         DC    X'FF'                                                    94770002
         DC    XL2'0052'                                         P4954  94860002
         DC    X'0018'                                                  94950002
         DC    XL2'0000'                                                95040002
LABELS   DS    0F                                                       95130002
         DC    C'$'                                                     95220002
         LSTART                                                         95310002
       END                                                              95400002
