         TITLE 'IFCEVENT-EVENT HISTORY PROCESSING                      *00001000
                        '                                               00002000
IFCEVENT CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCEVENT  78.251'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @10,0                                               0001 00012000
@PSTART  LA    @11,4095(,@10)                                      0001 00013000
         LA    @12,4095(,@11)                                      0001 00014000
         USING @PSTART,@10                                         0001 00015000
         USING @PSTART+4095,@11                                    0001 00016000
         USING @PSTART+8190,@12                                    0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LA    @14,@SA00001                                        0001 00019000
         ST    @14,8(,@13)                                         0001 00020000
         LR    @13,@14                                             0001 00021000
         B     @PB00002                                            0198 00022000
TEMPLATE STM   @14,@12,@SA00002                                    0198 00023000
*  SPACING = UPSPACE;                                      /*@Z427VLS*/ 00024000
         MVC   SPACING(1),UPSPACE                                  0199 00025000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 00026000
         BAL   @14,PRINTIT                                         0200 00027000
*  SPACING = DOUBLE;                                       /*@Z427VLS*/ 00028000
         MVC   SPACING(1),DOUBLE                                   0201 00029000
*  TOPTEMP = LINE01;             /*MOVE THE TOP LINE OF TEMPLATE IN  */ 00030000
         MVC   TOPTEMP(23),LINE01                                  0202 00031000
*  CALL PRINTIT;                 /*PRINT OUT THE HEADING FOR TEMPLATE*/ 00032000
         BAL   @14,PRINTIT                                         0203 00033000
*  DO N = 1 BY 1 TO 9;           /*PRINT 9 PAIR OF LINES     @Z427VLS*/ 00034000
         LA    @06,1                                               0204 00035000
         ST    @06,N                                               0204 00036000
@DL00204 DS    0H                                                  0205 00037000
*    GEN(MVI  TIME1,X'40');                                /*@Z427VLS*/ 00038000
         MVI  TIME1,X'40'                                               00039000
*    GEN(MVC  TIME1+1(130),TIME1);                         /*@Z427VLS*/ 00040000
         MVC  TIME1+1(130),TIME1                                        00041000
*    SPACING = SINGLE;                                     /*@Z427VLS*/ 00042000
         MVC   SPACING(1),SINGLE                                   0207 00043000
*    CALL PRINTIT;               /*PRINT SEPT LINE           @Z427VLS*/ 00044000
         BAL   @14,PRINTIT                                         0208 00045000
*    LINE002 = LINE02;           /*MOVE COMMON PART OF LINE IN       */ 00046000
         MVC   LINE002(20),LINE02                                  0209 00047000
*    R8 = ADDRTAB1(N);           /*WHERE THE DATA IS AT      @Z427VLS*/ 00048000
         L     @06,N                                               0210 00049000
         SLA   @06,2                                               0210 00050000
         L     R8,ADDRTAB1-4(@06)                                  0210 00051000
*    R9 = NUMCHAR1(N);           /*NUMBER OF BYTES TO MOVE   @Z427VLS*/ 00052000
         L     R9,NUMCHAR1-4(@06)                                  0211 00053000
*    GEN(EX   R9,EXECMVC);       /*EXEC THE MOVE CHAR        @Z427VLS*/ 00054000
         EX   R9,EXECMVC                                                00055000
*    SPACING = DOUBLE;                                     /*@Z427VLS*/ 00056000
         MVC   SPACING(1),DOUBLE                                   0213 00057000
*    CALL PRINTIT;               /*GO PRINT THE DATA         @Z427VLS*/ 00058000
         BAL   @14,PRINTIT                                         0214 00059000
*    DUPLICAT  = LINE04;         /*MOVE IN THE COMMON PART OF MESSAGE*/ 00060000
         MVC   DUPLICAT(33),LINE04                                 0215 00061000
*    R8 = ADDRTAB2(N);           /*SET UP WHERE THE DATA IS  @Z427VLS*/ 00062000
         L     @06,N                                               0216 00063000
         SLA   @06,2                                               0216 00064000
         L     R8,ADDRTAB2-4(@06)                                  0216 00065000
*    R9 = NUMCHAR2(N);           /*NUMBER OF BYTES TO MOVE   @Z427VLS*/ 00066000
         L     R9,NUMCHAR2-4(@06)                                  0217 00067000
*    GEN(EX    R9,EXECMVC2);     /*EXEC THE MVC INSTRUCTION  @Z427VLS*/ 00068000
         EX    R9,EXECMVC2                                              00069000
*    SPACING = DOUBLE;           /*SET TO SINGLE SPACE ON THIS LINE  */ 00070000
         MVC   SPACING(1),DOUBLE                                   0219 00071000
*    CALL PRINTIT;               /*GO RPINT THE BUFFER       @Z427VLS*/ 00072000
         BAL   @14,PRINTIT                                         0220 00073000
*   END;                                                   /*@Z427VLS*/ 00074000
         LA    @06,1                                               0221 00075000
         AL    @06,N                                               0221 00076000
         ST    @06,N                                               0221 00077000
         C     @06,@CF00085                                        0221 00078000
         BNH   @DL00204                                            0221 00079000
*   SPACING = SINGLE;                                      /*@Z427VLS*/ 00080000
         MVC   SPACING(1),SINGLE                                   0222 00081000
*   MDROBRLN = MDRLINE;          /*SET UP SECOND HALF OF OUTPUT      */ 00082000
         MVC   MDROBRLN(35),MDRLINE                                0223 00083000
*   CALL PRINTIT;                /*GO PRINT THE THIRD LINE FOR THIS  */ 00084000
         BAL   @14,PRINTIT                                         0224 00085000
*    GENERATE DATA;                                        /*@Z427VLS*/ 00086000
*  END;                                                    /*@Z427VLS*/ 00087000
@EL00002 DS    0H                                                  0226 00088000
@EF00002 DS    0H                                                  0226 00089000
@ER00002 LM    @14,@12,@SA00002                                    0226 00090000
         BR    @14                                                 0226 00091000
*/********************************************************************/ 00092000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00093000
*/*    THIS PROC WILL CONVERT THE BINARY NUMBER IN ITEM BINWORD TO   */ 00094000
*/*    PRINTABLE IF THE NUMBER (CONVERTED) IS > THAN THE NUMBER OF   */ 00095000
*/*    CHARACTERS REQUESTED (IN ITEM BNDECNUM) A NINE WILL BE PLACED */ 00096000
*/*    IN EACH PRINT POSITION                                @Z427VLS*/ 00097000
*/*                                                          @Z427VLS*/ 00098000
*CONVBIN:  PROC;                                           /*@Z427VLS*/ 00099000
CONVBIN  STM   @14,@12,@SA00003                                    0227 00100000
* R8 = BINWORD;                  /*LOAD THE ITEM TO CONVERT  @Z427VLS*/ 00101000
         L     R8,BINWORD                                          0228 00102000
* GEN(CVD   R8,DBLWORD);         /*CONVERT THE NUMBER        @Z427VLS*/ 00103000
         CVD   R8,DBLWORD                                               00104000
* GEN(UNPK   WORK(8),DBLWORD);   /*UNPACK THE CONVERTED NUMBER       */ 00105000
         UNPK   WORK(8),DBLWORD                                         00106000
* GEN(OI    WORK+7,X'F0');       /*INSURE SIGN IS NO PROBLEM @Z427VLS*/ 00107000
         OI    WORK+7,X'F0'                                             00108000
* SWITCH2 = OFF;                 /*CLEAR THE SWITCH PRIOR TO START   */ 00109000
         NI    SWITCH2,B'10111111'                                 0232 00110000
* DO L = 1 BY 1 TO 7 WHILE (SWITCH2 = OFF);                /*@Z427VLS*/ 00111000
         LA    @06,1                                               0233 00112000
         ST    @06,L                                               0233 00113000
@DL00233 TM    SWITCH2,B'01000000'                                 0233 00114000
         BNZ   @DC00233                                            0233 00115000
*  IF WORKOVER(L)  = 'F0'X       /*IS IT A 0 IF SO MAKE IT A BLANK   */ 00116000
*    THEN                                                          0234 00117000
         LA    @03,WORKOVER-1(@06)                                 0234 00118000
         CLI   0(@03),X'F0'                                        0234 00119000
         BNE   @RF00234                                            0234 00120000
*      WORKOVER(L) = '40'X;      /*SET TO A BLANK            @Z427VLS*/ 00121000
         LA    @03,WORKOVER-1(@06)                                 0235 00122000
         MVI   0(@03),X'40'                                        0235 00123000
*    ELSE                                                          0236 00124000
*      SWITCH2 = ON;             /*SET SWITCH TO TERMINATE DO LOOP   */ 00125000
         B     @RC00234                                            0236 00126000
@RF00234 OI    SWITCH2,B'01000000'                                 0236 00127000
* END;                                                     /*@Z427VLS*/ 00128000
@RC00234 LA    @06,1                                               0237 00129000
         AL    @06,L                                               0237 00130000
         ST    @06,L                                               0237 00131000
         C     @06,@CF00082                                        0237 00132000
         BNH   @DL00233                                            0237 00133000
@DC00233 DS    0H                                                  0238 00134000
* IF (TEN   - L) > BNDECNUM      /*IS THE CONVERTED NUMBER TO LARGE  */ 00135000
*    THEN                                                          0238 00136000
         L     @06,TEN                                             0238 00137000
         SL    @06,L                                               0238 00138000
         C     @06,BNDECNUM                                        0238 00139000
         BNH   @RF00238                                            0238 00140000
*      DO;                                                 /*@Z427VLS*/ 00141000
*        GEN(MVI   WORKOVER,X'F9');  /*SET FIRST NINE IN THE MEASSAGE*/ 00142000
         MVI   WORKOVER,X'F9'                                           00143000
*        GEN(MVC   WORKOVER+1(7),WORKOVER);/*FILL WITH NINES @Z427VLS*/ 00144000
         MVC   WORKOVER+1(7),WORKOVER                                   00145000
*      END;                                                /*@Z427VLS*/ 00146000
* R8 = ADDR(WORKOVER) + (8-BNDECNUM);/*SET WHERE TO MOVE FROM ADDRESS*/ 00147000
@RF00238 LA    R8,WORKOVER                                         0243 00148000
         L     @06,BNDECNUM                                        0243 00149000
         LA    @03,8                                               0243 00150000
         SLR   @03,@06                                             0243 00151000
         ALR   R8,@03                                              0243 00152000
* R9 = BNDECNUM - ONE;           /*NUMBER OF BYTES TO MOVE   @Z427VLS*/ 00153000
         SL    @06,ONE                                             0244 00154000
         LR    R9,@06                                              0244 00155000
* RESPECIFY (R6) RESTRICTED;                               /*@Z427VLS*/ 00156000
* R6 = DECADDR;                  /*ADDRESS TO MOVE TO        @Z427VLS*/ 00157000
         L     R6,DECADDR                                          0246 00158000
* GEN(EX    R9,MVCDATA);         /*MOVE DATA TO REQUESTED LOCATION   */ 00159000
         EX    R9,MVCDATA                                               00160000
* GENERATE DATA;                                           /*@Z427VLS*/ 00161000
* RESPECIFY (R6) UNRESTRICTED;                             /*@Z427VLS*/ 00162000
*END;                                                      /*@Z427VLS*/ 00163000
@EL00003 DS    0H                                                  0250 00164000
@EF00003 DS    0H                                                  0250 00165000
@ER00003 LM    @14,@12,@SA00003                                    0250 00166000
         BR    @14                                                 0250 00167000
*/********************************************************************/ 00168000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00169000
*/*    THIS PROC WILL CONVERT THE HEX DATA INTO PRINTABLE    @Z427VLS*/ 00170000
*/*                                                          @Z427VLS*/ 00171000
*/*    IF IT IS NECESSARY TO CONVERT ONLY 1/2 OF FIRST BYTE(CUA FOR  */ 00172000
*/*    EXP. THEN THE USER SHOULD SET THE SWITCH1 TO THEON CONDITION  */ 00173000
*CONVERT: PROC;                                            /*@Z427VLS*/ 00174000
CONVERT  STM   @14,@12,12(@13)                                     0251 00175000
* DO P = NUMBER BY -1 TO 1;      /*# = # OF BYTES TO CONVERT TO PRINT*/ 00176000
         L     @06,NUMBER                                          0252 00177000
         ST    @06,P                                               0252 00178000
         B     @DE00252                                            0252 00179000
@DL00252 DS    0H                                                  0253 00180000
*   R8 = NEXTBYTE(P);            /*LOAD THE NEXT BYTE TO CONVERT     */ 00181000
         L     @03,NEXTBY                                          0253 00182000
         BCTR  @03,0                                               0253 00183000
         SLR   R8,R8                                               0253 00184000
         IC    R8,NEXTBYTE(@06,@03)                                0253 00185000
*   X =  TWO * P;                /*OUTPUT INDEX MUST BE TWICE INPUT  */ 00186000
         L     @01,TWO                                             0254 00187000
         MR    @00,@06                                             0254 00188000
         ST    @01,X                                               0254 00189000
*   SRDL  (R8,FOUR);             /*MOVE 1/2 IN TO NEXT REG   @Z427VLS*/ 00190000
         SRDL  R8,4                                                0255 00191000
*   SRL   (R9,TWOEIGHT);         /*SHIFT THE REG 28 BITS     @Z427VLS*/ 00192000
         L     @03,TWOEIGHT                                        0256 00193000
         SRL   R9,0(@03)                                           0256 00194000
*   R9  =  R9 + NUMBER1;         /*INSURE INDEX BY 0 DOES NOT AFFECT */ 00195000
         L     @03,NUMBER1                                         0257 00196000
         ALR   R9,@03                                              0257 00197000
*   R8  =  R8 + NUMBER1;         /*SAME                      @Z427VLS*/ 00198000
         ALR   R8,@03                                              0258 00199000
*   IF SWITCH1 = ON & P = ONE    /*DO WE NOT PUT THE HALF BYTE OUT   */ 00200000
*    THEN                                                          0259 00201000
         TM    SWITCH1,B'10000000'                                 0259 00202000
         BNO   @RF00259                                            0259 00203000
         C     @06,ONE                                             0259 00204000
         BNE   @RF00259                                            0259 00205000
*     SWITCH1 = OFF;             /*TURN OFF THE SWITCH       @Z427VLS*/ 00206000
         NI    SWITCH1,B'01111111'                                 0260 00207000
*    ELSE                                                          0261 00208000
*     ADDNUM(X-ONE) = CHARS(R8);/*PUT THE PRINT CHAR INTO THE OUTPUT*/  00209000
         B     @RC00259                                            0261 00210000
@RF00259 L     @06,X                                               0261 00211000
         SL    @06,ONE                                             0261 00212000
         L     @03,ADDNXT                                          0261 00213000
         ALR   @03,@06                                             0261 00214000
         BCTR  @03,0                                               0261 00215000
         LA    @06,CHARS-1(R8)                                     0261 00216000
         MVC   ADDNUM(1,@03),0(@06)                                0261 00217000
*     ADDNUM(X)  = CHARS(R9);   /*FINSH THE BYTE             @Z427VLS*/ 00218000
@RC00259 L     @06,ADDNXT                                          0262 00219000
         AL    @06,X                                               0262 00220000
         BCTR  @06,0                                               0262 00221000
         LA    @03,CHARS-1(R9)                                     0262 00222000
         MVC   ADDNUM(1,@06),0(@03)                                0262 00223000
* END;                                                     /*@Z427VLS*/ 00224000
         SLR   @06,@06                                             0263 00225000
         BCTR  @06,0                                               0263 00226000
         AL    @06,P                                               0263 00227000
         ST    @06,P                                               0263 00228000
@DE00252 LTR   @06,@06                                             0263 00229000
         BP    @DL00252                                            0263 00230000
*END;                                                      /*@Z427VLS*/ 00231000
@EL00004 DS    0H                                                  0264 00232000
@EF00004 DS    0H                                                  0264 00233000
@ER00004 LM    @14,@12,12(@13)                                     0264 00234000
         BR    @14                                                 0264 00235000
*/********************************************************************/ 00236000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00237000
*/*    THIS PROC WILL ADD TOTALS OF EACH TYPE RECORD AND PRINT THE   */ 00238000
*/*    TOTALS                                                @Z427VLS*/ 00239000
*/*    THIS PROC IS BASED ON THERE BEING 23 MINOR TYPES OF RECORDS   */ 00240000
*/*    (UNDER THE 9 MAIN) ANY CHANGE IN THE NUMBER OF TYPES WILL     */ 00241000
*/*    RESULT IN BAD THINGS                                  @Z427VLS*/ 00242000
*/*    ALL 23 LENGHT ITEMS WILL JUST NEED THERE LENGTH ADJUSTED ALSO */ 00243000
*/*    THE TYPES WILL NEED ADJUSTING AND THE TYPE COUNTERS THESE ARE */ 00244000
*/*    NOT IN A TABLE AND START AFTER ITEM NUMCHAR2          @Z427VLS*/ 00245000
*/*                                                          @Z427VLS*/ 00246000
*PRTTOTAL:  PROC;                                          /*@Z427VLS*/ 00247000
PRTTOTAL STM   @14,@12,@SA00005                                    0265 00248000
* SPACING = UPSPACE;             /*START ON A FRESH PAGE     @Z427VLS*/ 00249000
         MVC   SPACING(1),UPSPACE                                  0266 00250000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00251000
         BAL   @14,PRINTIT                                         0267 00252000
*  SWITCH5 = ON;    /*SET TO UP SPACE DURING TOTALS IF REQ   @0001VLS*/ 00253000
         OI    SWITCH5,B'00001000'                                 0268 00254000
* SPACING = DOUBLE;              /*RESET TO SINGLE SPACING   @Z427VLS*/ 00255000
         MVC   SPACING(1),DOUBLE                                   0269 00256000
* Z = ONE;                       /*SET INDEX TO STEP THROUGH @Z427VLS*/ 00257000
         L     @06,ONE                                             0270 00258000
         ST    @06,Z                                               0270 00259000
* TOTALHD2 = TOTALHD1;           /*MOVE IN WORDS RECORD TYPES        */ 00260000
         MVC   TOTALHD2(12),TOTALHD1                               0271 00261000
* RESPECIFY (R6) RESTRICTED;                               /*@Z427VLS*/ 00262000
* R6 = ADDR(TOTALHD3) ;                                    /*@Z427VLS*/ 00263000
         LA    R6,TOTALHD3                                         0273 00264000
* R8 = ADDR(TIME1) + 26;                                   /*@Z427VLS*/ 00265000
         LA    R8,TIME1                                            0274 00266000
         AL    R8,@CF01065                                         0274 00267000
* R9 = 7     + SIX * EVNUM;                                /*@Z427VLS*/ 00268000
         L     @03,EVPTR(,R2)                                      0275 00269000
         L     R9,SIX                                              0275 00270000
         MH    R9,EVNUM(,@03)                                      0275 00271000
         AL    R9,@CF00082                                         0275 00272000
* GEN(EX  R9,MOVECHAR);                                    /*@Z427VLS*/ 00273000
         EX  R9,MOVECHAR                                                00274000
* RESPECIFY (R6) UNRESTRICTED;                             /*@Z427VLS*/ 00275000
* CALL PRINTIT;                  /*PRINT THE HEADING FOR THE TOTALS  */ 00276000
         BAL   @14,PRINTIT                                         0278 00277000
* SPACING = SINGLE;              /*PRINT THE HEADING FOR THE TOTALS  */ 00278000
         MVC   SPACING(1),SINGLE                                   0279 00279000
* DO J = 1 BY 1 TO 9 ;           /*MAIN LOOP FOR 9 TYPES OF RECORDS  */ 00280000
         LA    @06,1                                               0280 00281000
         ST    @06,J                                               0280 00282000
@DL00280 DS    0H                                                  0281 00283000
*  DO  WHILE(LETTER(Z) = LETTER1);                         /*@Z427VLS*/ 00284000
         B     @DE00281                                            0281 00285000
@DL00281 DS    0H                                                  0282 00286000
*   BNDECNUM = SIX;              /*SET FOR SIX CHARACTERS OUT        */ 00287000
         L     @06,SIX                                             0282 00288000
         ST    @06,BNDECNUM                                        0282 00289000
*   TOTALNME = NMETOTAL(Z);      /*WILL MOVE IN 7 CHAR SUBNAME       */ 00290000
         L     @06,Z                                               0283 00291000
         MH    @06,@CH00082                                        0283 00292000
         LA    @03,NMETOTAL-7(@06)                                 0283 00293000
         MVC   TOTALNME(7),0(@03)                                  0283 00294000
*   BINWORD = ZERO;              /*SET TO 0 PRIOR TO START   @Z427VLS*/ 00295000
         SLR   @06,@06                                             0284 00296000
         ST    @06,BINWORD                                         0284 00297000
*   DO K = 1 BY 1 TO EVNUM;   /*EVNUM# OF CPUS FOUND THIS JOB  */  0285 00298000
         LA    @06,1                                               0285 00299000
         ST    @06,K                                               0285 00300000
         B     @DE00285                                            0285 00301000
@DL00285 DS    0H                                                  0286 00302000
*    BINWORD = COUNT(Z,K) + BINWORD;/*ADD UP THE TOTAL THIS SUBTYPE  */ 00303000
         L     @03,Z                                               0286 00304000
         SLA   @03,4                                               0286 00305000
         ALR   @03,@06                                             0286 00306000
         SLA   @03,2                                               0286 00307000
         L     @03,COUNT-68(@03)                                   0286 00308000
         AL    @03,BINWORD                                         0286 00309000
         ST    @03,BINWORD                                         0286 00310000
*   END;                                                   /*@Z427VLS*/ 00311000
         AL    @06,@CF00054                                        0287 00312000
         ST    @06,K                                               0287 00313000
@DE00285 L     @03,EVPTR(,R2)                                      0287 00314000
         CH    @06,EVNUM(,@03)                                     0287 00315000
         BNH   @DL00285                                            0287 00316000
*   TOTAL = TOTAL + BINWORD;     /*SAVE TO HAVE THE TOTAL OF THIS LNE*/ 00317000
         L     @06,BINWORD                                         0288 00318000
         L     @03,TOTAL                                           0288 00319000
         ALR   @03,@06                                             0288 00320000
         ST    @03,TOTAL                                           0288 00321000
*   TOTOFTOT = TOTOFTOT + BINWORD;                         /*@Z427VLS*/ 00322000
         AL    @06,TOTOFTOT                                        0289 00323000
         ST    @06,TOTOFTOT                                        0289 00324000
*   DECADDR = ADDR(TOTALVAL);    /*SET WHERE TO PUT CONVERTED VALUE  */ 00325000
         LA    @06,TOTALVAL                                        0290 00326000
         ST    @06,DECADDR                                         0290 00327000
*   CALL CONVBIN;                /*GO CONVERT THE ITEM TO PRINTABLE  */ 00328000
         BAL   @14,CONVBIN                                         0291 00329000
*   BNDECNUM = FIVE;             /*CHANGE INDIVIDUAL ITEMS TO 5 CHAR */ 00330000
         L     @06,FIVE                                            0292 00331000
         ST    @06,BNDECNUM                                        0292 00332000
*   DECADDR = DECADDR + SEVEN;   /*MOVE DOWN THE PRINT LINE BY 7 CHAR*/ 00333000
         L     @06,DECADDR                                         0293 00334000
         AL    @06,SEVEN                                           0293 00335000
         ST    @06,DECADDR                                         0293 00336000
*   DO K = 1 BY 1 TO EVNUM;   /*SET BY FILTER 4 TO # OF CPUS @Z427VLS*/ 00337000
         LA    @06,1                                               0294 00338000
         ST    @06,K                                               0294 00339000
         B     @DE00294                                            0294 00340000
@DL00294 DS    0H                                                  0295 00341000
*    BINWORD = COUNT(Z,K);       /*PULL UP THE FIRST COUNT   @Z427VLS*/ 00342000
         L     @03,Z                                               0295 00343000
         SLA   @03,4                                               0295 00344000
         ALR   @03,@06                                             0295 00345000
         SLA   @03,2                                               0295 00346000
         L     @03,COUNT-68(@03)                                   0295 00347000
         ST    @03,BINWORD                                         0295 00348000
*    TOTALS(K) = TOTALS(K) + BINWORD;/*CPU TOTALS FOR THIS LINE      */ 00349000
         SLA   @06,2                                               0296 00350000
         L     @15,TOTALS-4(@06)                                   0296 00351000
         ALR   @15,@03                                             0296 00352000
         ST    @15,TOTALS-4(@06)                                   0296 00353000
*   SUBTOT(K) = SUBTOT(K) + BINWORD;/*FOR OVER ALL TOTAL     @Z427VLS*/ 00354000
         AL    @03,SUBTOT-4(@06)                                   0297 00355000
         ST    @03,SUBTOT-4(@06)                                   0297 00356000
*    CALL CONVBIN;               /*GO CONVERT TO PRINTABLE 5 CHARS   */ 00357000
         BAL   @14,CONVBIN                                         0298 00358000
*    DECADDR = DECADDR + SIX;    /*MOVE DOWN PRINT TO NEXT CPU       */ 00359000
         L     @06,DECADDR                                         0299 00360000
         AL    @06,SIX                                             0299 00361000
         ST    @06,DECADDR                                         0299 00362000
*   END;                                                   /*@Z427VLS*/ 00363000
         LA    @06,1                                               0300 00364000
         AL    @06,K                                               0300 00365000
         ST    @06,K                                               0300 00366000
@DE00294 L     @03,EVPTR(,R2)                                      0300 00367000
         CH    @06,EVNUM(,@03)                                     0300 00368000
         BNH   @DL00294                                            0300 00369000
*   CALL PRINTIT;                /*PRINT TOTAL AND INDIVIDULE COUNT  */ 00370000
         BAL   @14,PRINTIT                                         0301 00371000
*   Z = Z + ONE;                 /*MOVE TO THE NEXT SUB CASE @Z427VLS*/ 00372000
         L     @06,Z                                               0302 00373000
         AL    @06,ONE                                             0302 00374000
         ST    @06,Z                                               0302 00375000
*  END;                                                    /*@Z427VLS*/ 00376000
@DE00281 L     @06,Z                                               0303 00377000
         LA    @03,LETTER-1(@06)                                   0303 00378000
         CLC   0(1,@03),LETTER1                                    0303 00379000
         BE    @DL00281                                            0303 00380000
*  CPU12 = EVLETTER(PTR);                                  /*@Z427VLS*/ 00381000
         L     @03,PTR                                             0304 00382000
         MH    @03,@CH00080                                        0304 00383000
         L     @01,EVPTR(,R2)                                      0304 00384000
         ALR   @01,@03                                             0304 00385000
         MVC   CPU12(1),EVLETTER-6(@01)                            0304 00386000
*  LETTER1 = LETTER(Z);          /*CHANGE THE CONTROL CHARACTER      */ 00387000
         LA    @03,LETTER-1(@06)                                   0305 00388000
         MVC   LETTER1(1),0(@03)                                   0305 00389000
*  BINWORD = TOTAL;              /*SET TO CONVERT THE TOTAL FOR LINE */ 00390000
         L     @06,TOTAL                                           0306 00391000
         ST    @06,BINWORD                                         0306 00392000
*  BNDECNUM = SIX;               /*LET TOTAL HAVE SIX PLACES OUT     */ 00393000
         L     @06,SIX                                             0307 00394000
         ST    @06,BNDECNUM                                        0307 00395000
*  TOTALNM1 = TOTHEAD(J);        /*MOVE IN WORDS TO DESCRIBE THE LINE*/ 00396000
         L     @06,J                                               0308 00397000
         MH    @06,@CH00747                                        0308 00398000
         LA    @03,TOTHEAD-22(@06)                                 0308 00399000
         MVC   TOTALNM1(22),0(@03)                                 0308 00400000
*  DECADDR = ADDR(TOTALVAL);     /*WHERE TO PUT THE DATA     @Z427VLS*/ 00401000
         LA    @06,TOTALVAL                                        0309 00402000
         ST    @06,DECADDR                                         0309 00403000
*  CALL CONVBIN;                 /*CONVERT THE NUMBER TO PRINTABLE   */ 00404000
         BAL   @14,CONVBIN                                         0310 00405000
*  BNDECNUM = FIVE;              /*CHANGE BACK TO ONLY 5 CHARS OUT   */ 00406000
         L     @06,FIVE                                            0311 00407000
         ST    @06,BNDECNUM                                        0311 00408000
*  DECADDR = DECADDR + SEVEN;    /*MOVE DOWN THE PRINT LINE  @Z427VLS*/ 00409000
         L     @06,DECADDR                                         0312 00410000
         AL    @06,SEVEN                                           0312 00411000
         ST    @06,DECADDR                                         0312 00412000
*  DO K = 1 BY 1 TO EVNUM;    /*PROCESS THROUGH ALL CPUS     @Z427VLS*/ 00413000
         LA    @06,1                                               0313 00414000
         ST    @06,K                                               0313 00415000
         B     @DE00313                                            0313 00416000
@DL00313 DS    0H                                                  0314 00417000
*   BINWORD = TOTALS(K);         /*GET TOTAL FOR EACH CPU    @Z427VLS*/ 00418000
         SLA   @06,2                                               0314 00419000
         L     @06,TOTALS-4(@06)                                   0314 00420000
         ST    @06,BINWORD                                         0314 00421000
*   CALL CONVBIN;                /*CONVERT THIS TO PRINTABLE @Z427VLS*/ 00422000
         BAL   @14,CONVBIN                                         0315 00423000
*   DECADDR = DECADDR + SIX;     /*MOVE DOWN THE PRINT LINE FOR NEXT */ 00424000
         L     @06,DECADDR                                         0316 00425000
         AL    @06,SIX                                             0316 00426000
         ST    @06,DECADDR                                         0316 00427000
*  END;                                                    /*@Z427VLS*/ 00428000
         LA    @06,1                                               0317 00429000
         AL    @06,K                                               0317 00430000
         ST    @06,K                                               0317 00431000
@DE00313 L     @03,EVPTR(,R2)                                      0317 00432000
         CH    @06,EVNUM(,@03)                                     0317 00433000
         BNH   @DL00313                                            0317 00434000
*  CALL PRINTIT;                 /*GO PRINT THE TOTALS FOR EACH CPU  */ 00435000
         BAL   @14,PRINTIT                                         0318 00436000
*  TOTAL = ZERO;                 /*SET ITEM TO ZERO          @Z427VLS*/ 00437000
         SLR   @06,@06                                             0319 00438000
         ST    @06,TOTAL                                           0319 00439000
*  SPACING = DOUBLE;             /*MAKE THE OUTPTU LOOK BETTER       */ 00440000
         MVC   SPACING(1),DOUBLE                                   0320 00441000
*  CALL PRINTIT;                 /*WITH A GAP BETWEEN SECTIONS       */ 00442000
         BAL   @14,PRINTIT                                         0321 00443000
*  SPACING = SINGLE;             /*RETURN THE SPAVING TO 1 SPACE     */ 00444000
         MVC   SPACING(1),SINGLE                                   0322 00445000
*  GEN(MVI   TOTALS,X'00');      /*SET FIRST BYTE TO ZERO    @Z427VLS*/ 00446000
         MVI   TOTALS,X'00'                                             00447000
*  GEN(MVC   TOTALS+1(63),TOTALS);/*RIPPLE THE 0 THROUGH THE ARRAY   */ 00448000
         MVC   TOTALS+1(63),TOTALS                                      00449000
* END;                                                     /*@Z427VLS*/ 00450000
         LA    @06,1                                               0325 00451000
         AL    @06,J                                               0325 00452000
         ST    @06,J                                               0325 00453000
         C     @06,@CF00085                                        0325 00454000
         BNH   @DL00280                                            0325 00455000
* MVCOVER = OVERTOT;     /*MOVE IN THE WORDS DESCRIBING THIS GRAND   */ 00456000
         MVC   MVCOVER(16),OVERTOT                                 0326 00457000
* BINWORD = TOTOFTOT;    /*PICK UP OVER ALL TOTAL            @Z427VLS*/ 00458000
         L     @06,TOTOFTOT                                        0327 00459000
         ST    @06,BINWORD                                         0327 00460000
* BNDECNUM = SIX;        /*SET UP TO DO SIX BYTES OF PRINTABLE       */ 00461000
         L     @06,SIX                                             0328 00462000
         ST    @06,BNDECNUM                                        0328 00463000
* DECADDR = ADDR(TOTALVAL);/*ADDRESS OF WHERE TO PUT CONVERTED VALUE */ 00464000
         LA    @06,TOTALVAL                                        0329 00465000
         ST    @06,DECADDR                                         0329 00466000
* CALL CONVBIN;          /*GO CONVERT THE DATA TO PRINTABLE  @Z427VLS*/ 00467000
         BAL   @14,CONVBIN                                         0330 00468000
* BNDECNUM = FIVE;       /*RESET TO = LAST GROUP             @Z427VLS*/ 00469000
         L     @06,FIVE                                            0331 00470000
         ST    @06,BNDECNUM                                        0331 00471000
* DECADDR = DECADDR + SEVEN;/*ADJUST DOWN THE PRINT LINE     @Z427VLS*/ 00472000
         L     @06,DECADDR                                         0332 00473000
         AL    @06,SEVEN                                           0332 00474000
         ST    @06,DECADDR                                         0332 00475000
* DO K = 1 BY 1 TO EVNUM;                                  /*@Z427VLS*/ 00476000
         LA    @06,1                                               0333 00477000
         ST    @06,K                                               0333 00478000
         B     @DE00333                                            0333 00479000
@DL00333 DS    0H                                                  0334 00480000
*  BINWORD = SUBTOT(K);  /*PICK UP THE NEXT OVER ALL TOTAL   @Z427VLS*/ 00481000
         SLA   @06,2                                               0334 00482000
         L     @06,SUBTOT-4(@06)                                   0334 00483000
         ST    @06,BINWORD                                         0334 00484000
*  CALL CONVBIN;         /*GO AND CONVERT THE ITEM TO BINARY @Z427VLS*/ 00485000
         BAL   @14,CONVBIN                                         0335 00486000
*  DECADDR = DECADDR + SIX ;/* MOVE DOWN THE LINE FOR THE NEXT TOTAL */ 00487000
         L     @06,DECADDR                                         0336 00488000
         AL    @06,SIX                                             0336 00489000
         ST    @06,DECADDR                                         0336 00490000
* END;                                                     /*@Z427VLS*/ 00491000
         LA    @06,1                                               0337 00492000
         AL    @06,K                                               0337 00493000
         ST    @06,K                                               0337 00494000
@DE00333 L     @03,EVPTR(,R2)                                      0337 00495000
         CH    @06,EVNUM(,@03)                                     0337 00496000
         BNH   @DL00333                                            0337 00497000
* CALL PRINTIT;          /*AT LAST THE LAST TOTAL LINE       @Z427VLS*/ 00498000
         BAL   @14,PRINTIT                                         0338 00499000
* GENERATE DATA;                                           /*@Z427VLS*/ 00500000
*END;                                                      /*@Z427VLS*/ 00501000
@EL00005 DS    0H                                                  0340 00502000
@EF00005 DS    0H                                                  0340 00503000
@ER00005 LM    @14,@12,@SA00005                                    0340 00504000
         BR    @14                                                 0340 00505000
*/********************************************************************/ 00506000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00507000
*/*    THIS PROC WILL BUILD THE MAIN HEADING FOR THE OUTPUT  @Z427VLS*/ 00508000
*/*                                                          @Z427VLS*/ 00509000
*MAINHEAD: PROC;                                           /*@Z427VLS*/ 00510000
MAINHEAD STM   @14,@12,@SA00006                                    0341 00511000
*  SPACING = UPSPACE;         /*TIME FOR A NEW PAGE          @Z427VLS*/ 00512000
         MVC   SPACING(1),UPSPACE                                  0342 00513000
*  CALL PRINTIT;              /*SKIP TO CHANNEL ONE          @Z427VLS*/ 00514000
         BAL   @14,PRINTIT                                         0343 00515000
*  SPACING = SINGLE;          /*RETURN TO PRINT AND SKIP ONE LINE    */ 00516000
         MVC   SPACING(1),SINGLE                                   0344 00517000
*  HEAD01 = LINE01;           /*MOVE IN THE MAIN HEADING EVENT H--   */ 00518000
         MVC   HEAD01(13),LINE01                                   0345 00519000
*  DAYSDATE = DATENOW;        /*PARM PROCESSOR SHOULD HAVE FILLED THS*/ 00520000
         MVC   DAYSDATE(6),DATENOW(R2)                             0346 00521000
*  TODAYDT = REPORTDY;        /*MOVE WORDS 'REPORT DATE TO PRINT LINE*/ 00522000
         MVC   TODAYDT(12),REPORTDY                                0347 00523000
*  CALL PRINTIT;              /*GO PRINT THE FIRST LINE      @Z427VLS*/ 00524000
         BAL   @14,PRINTIT                                         0348 00525000
*  NUMBER = ONE;              /*SET FOR ONE BYTE TO BE CONVERTED     */ 00526000
         L     @06,ONE                                             0349 00527000
         ST    @06,NUMBER                                          0349 00528000
*  NEXTBY = ADDR(EVSYEAR);    /*SET UP THE ADDRESS OF THE DATE       */ 00529000
         LA    @06,EVSYEAR(,R2)                                    0350 00530000
         ST    @06,NEXTBY                                          0350 00531000
*  ADDNXT = ADDR(DATEYR);     /*SET UP WHERE TO PUT THE CONVERTED DAY*/ 00532000
         LA    @06,DATEYR                                          0351 00533000
         ST    @06,ADDNXT                                          0351 00534000
*  CALL CONVERT;              /*GO CONVERT THE DATE          @Z427VLS*/ 00535000
         BAL   @14,CONVERT                                         0352 00536000
*  NUMBER = TWO;              /*SET UP TO CONVERT TWO BYTES OF DATA  */ 00537000
         L     @06,TWO                                             0353 00538000
         ST    @06,NUMBER                                          0353 00539000
*  SWITCH1 = ON;              /*SET TO DROP THE 1/2 BYTE     @Z427VLS*/ 00540000
         OI    SWITCH1,B'10000000'                                 0354 00541000
*  SRL(EVSDAY,FOUR);          /*CHUCK THE F IN LAST 1/2 BYTE @Z427VLS*/ 00542000
         LH    @06,EVSDAY(,R2)                                     0355 00543000
         N     @06,@CF01464                                        0355 00544000
         SRL   @06,4                                               0355 00545000
         STH   @06,EVSDAY(,R2)                                     0355 00546000
*  NEXTBY = ADDR(EVSDAY);     /*SET UP WHERE TO GET THE DAY  @Z427VLS*/ 00547000
         LA    @06,EVSDAY(,R2)                                     0356 00548000
         ST    @06,NEXTBY                                          0356 00549000
*  ADDNXT = ADDR(DATEDAY)-1;  /*SET WHERE TO PUT CONVERTED DAY       */ 00550000
         LA    @06,DATEDAY                                         0357 00551000
         BCTR  @06,0                                               0357 00552000
         ST    @06,ADDNXT                                          0357 00553000
*  CALL CONVERT;              /*GO CONVERT THE DAY TO PRINTABLE      */ 00554000
         BAL   @14,CONVERT                                         0358 00555000
*  HEDDATE = HEADDATE;        /*MOVE IN THE DATA TO THE PRINT LINE   */ 00556000
         MVC   HEDDATE(18),HEADDATE                                0359 00557000
*  CALL PRINTIT;              /*GO PRINT THE FROM DAY YEAR   @Z427VLS*/ 00558000
         BAL   @14,PRINTIT                                         0360 00559000
*  FROMTO = TO;               /*CHANGE THE WORD (FROM) TO (TO)       */ 00560000
         MVC   FROMTO(5),TO                                        0361 00561000
*  SWITCH1 = ON;              /*SET SO ONE HALF OF A BYTE IS DROPPED */ 00562000
         OI    SWITCH1,B'10000000'                                 0362 00563000
*  NEXTBY = ADDR(EVDAY);      /*ADDRESS OF DATA              @Z427VLS*/ 00564000
         L     @06,EVPTR(,R2)                                      0363 00565000
         LA    @03,EVDAY(,@06)                                     0363 00566000
         ST    @03,NEXTBY                                          0363 00567000
*  ADDNXT = ADDR(DATEDAY)-1;  /*SET WHERE TO PUT CONVERTED DAY       */ 00568000
         LA    @03,DATEDAY                                         0364 00569000
         BCTR  @03,0                                               0364 00570000
         ST    @03,ADDNXT                                          0364 00571000
*  SRL(EVDAY,FOUR);           /*MOVE THE F OUT OF THE DAY FIELD      */ 00572000
         SLR   @03,@03                                             0365 00573000
         ICM   @03,3,EVDAY(@06)                                    0365 00574000
         SRL   @03,4                                               0365 00575000
         STCM  @03,3,EVDAY(@06)                                    0365 00576000
*  CALL CONVERT;              /*CHANGE THE LAST DAY TO PRINTABLE     */ 00577000
         BAL   @14,CONVERT                                         0366 00578000
*  NUMBER =  ONE;             /*SET UP TO DO JUST ONE BYTE   @Z427VLS*/ 00579000
         L     @06,ONE                                             0367 00580000
         ST    @06,NUMBER                                          0367 00581000
*  NEXTBY = ADDR(EVYEAR);     /*SET UP THE ADDRESS OF THE LAST YEAR  */ 00582000
         L     @06,EVPTR(,R2)                                      0368 00583000
         ST    @06,NEXTBY                                          0368 00584000
*  ADDNXT = ADDR(DATEYR);     /*SET UP ADDRESS WHERE TO PUT THE YEAR */ 00585000
         LA    @06,DATEYR                                          0369 00586000
         ST    @06,ADDNXT                                          0369 00587000
*  CALL CONVERT;              /*CONVERT THE LAST RECORD DATE TO PRINT*/ 00588000
         BAL   @14,CONVERT                                         0370 00589000
*  HEDDATE = HEADDATE;        /*MOVE THE DATA TO THE PRINT LINE      */ 00590000
         MVC   HEDDATE(18),HEADDATE                                0371 00591000
*  CALL PRINTIT;              /*GO PRINT THE TO DATE INFORMATION     */ 00592000
         BAL   @14,PRINTIT                                         0372 00593000
*END;                                                      /*@Z427VLS*/ 00594000
@EL00006 DS    0H                                                  0373 00595000
@EF00006 DS    0H                                                  0373 00596000
@ER00006 LM    @14,@12,@SA00006                                    0373 00597000
         BR    @14                                                 0373 00598000
*/********************************************************************/ 00599000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00600000
*/*    THIS PROC WILL PRINT THE NEW DATE WHEN CALLED,FROM THE RECORD */ 00601000
*/*                                                          @Z427VLS*/ 00602000
*NEWDATE: PROC;                                            /*@Z427VLS*/ 00603000
NEWDATE  STM   @14,@12,@SA00007                                    0374 00604000
*  IF DEBUG24 ^= ON THEN      /*IF SO DO NOT WANT SPACE      @Z427VLS*/ 00605000
         TM    DEBUG24(R2),B'10000000'                             0375 00606000
         BO    @RF00375                                            0375 00607000
*   CALL PRINTIT;             /*UPSPACE ONE LINE FOR LOOKS   @Z427VLS*/ 00608000
         BAL   @14,PRINTIT                                         0376 00609000
*  LASTDATE = LRTDATE;        /*CHANGE THE BREAKPOINT TO THE NEW DATE*/ 00610000
@RF00375 MVC   LASTDATE(4),LRTDATE(R7)                             0377 00611000
*  NUMBER = ONE;              /*SET UP TO CONVERT 1 BYTE OF HEX      */ 00612000
         L     @06,ONE                                             0378 00613000
         ST    @06,NUMBER                                          0378 00614000
*  NEXTBY = ADDR(LRTYEAR);    /*SET UP ADDRESS OF WHERE TO PUT IT    */ 00615000
         LA    @06,LRTYEAR(,R7)                                    0379 00616000
         ST    @06,NEXTBY                                          0379 00617000
*  ADDNXT = ADDR(YEARJUL);    /*SET UP ADDRESS OF THE YEAR IN RECORD */ 00618000
         LA    @06,YEARJUL                                         0380 00619000
         ST    @06,ADDNXT                                          0380 00620000
*  CALL CONVERT;              /*GO FORMATE THE YEAR FOR PRINTING     */ 00621000
         BAL   @14,CONVERT                                         0381 00622000
*  NUMBER= TWO;               /*SET UP TO CONVERT THE JULIAN DATE    */ 00623000
         L     @06,TWO                                             0382 00624000
         ST    @06,NUMBER                                          0382 00625000
*  SWITCH1 = ON;                                           /*@Z427VLS*/ 00626000
         OI    SWITCH1,B'10000000'                                 0383 00627000
*  TABLECHH = LRTDAY;         /*MOVE SO WE CAN SHIFT OUT THE 'F'X */    00628000
         MVC   TABLECHH(2),LRTDAY(R7)                              0384 00629000
*  SRL(TABLECHH,FOUR);        /*SHIFT OUT THE F IN THE DATE  @0001VLS*/ 00630000
         SLR   @06,@06                                             0385 00631000
         ICM   @06,3,TABLECHH                                      0385 00632000
         SRL   @06,4                                               0385 00633000
         STCM  @06,3,TABLECHH                                      0385 00634000
*  NEXTBY = ADDR(TABLECHH);   /*SET UP WHERE THE INFO TO CONVERT IS*/   00635000
         LA    @06,TABLECHH                                        0386 00636000
         ST    @06,NEXTBY                                          0386 00637000
*  ADDNXT = ADDR(DAYJUL);     /*SET UP ADDRESS OF WHERE TO PUT DATA  */ 00638000
         LA    @06,DAYJUL                                          0387 00639000
         ST    @06,ADDNXT                                          0387 00640000
*  CALL CONVERT;              /*CONVERT THE DATA TO PRINTABLE        */ 00641000
         BAL   @14,CONVERT                                         0388 00642000
*  NEWDATEO = NEWDATEH;       /*MOVE THE LINE TO THE PRINT BUFFER    */ 00643000
         MVC   NEWDATEO(12),NEWDATEH                               0389 00644000
*  IF DEBUG24 ^= ON THEN      /*IF TRUE ONLY ONE LINE OUT    @Z427VLS*/ 00645000
         TM    DEBUG24(R2),B'10000000'                             0390 00646000
         BO    @RF00390                                            0390 00647000
*  DO;                                                     /*@Z427VLS*/ 00648000
*  GEN(MVI  TIME1+13,X'40');                               /*@Z427VLS*/ 00649000
         MVI  TIME1+13,X'40'                                            00650000
*  GEN(MVC  TIME1+14(120),TIME1+13);                       /*@Z427VLS*/ 00651000
         MVC  TIME1+14(120),TIME1+13                                    00652000
*   SPACING = DOUBLE ;        /*SET SPACING TO DOUBLE FOR THIS LINE  */ 00653000
         MVC   SPACING(1),DOUBLE                                   0394 00654000
*  END;                                                    /*@Z427VLS*/ 00655000
*  MYLINECT = MYLINECT + ONE; /*ADJUST FOR THE DOUBLE SPACING        */ 00656000
@RF00390 LH    @06,MYLINECT                                        0396 00657000
         AL    @06,ONE                                             0396 00658000
         STH   @06,MYLINECT                                        0396 00659000
*  CALL PRINTIT;              /*GO PRINT THE NEW DAY YEAR    @Z427VLS*/ 00660000
         BAL   @14,PRINTIT                                         0397 00661000
*  SPACING = SINGLE;          /*RETURN THE SPACING TO NORMAL(ONE)    */ 00662000
         MVC   SPACING(1),SINGLE                                   0398 00663000
*END;                                                      /*@Z427VLS*/ 00664000
@EL00007 DS    0H                                                  0399 00665000
@EF00007 DS    0H                                                  0399 00666000
@ER00007 LM    @14,@12,@SA00007                                    0399 00667000
         BR    @14                                                 0399 00668000
*/********************************************************************/ 00669000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00670000
*/*    THIS PROC WILL SETUP LINKAGE TO ACCESS I/O SERVICE PRINT      */ 00671000
*/*                                                          @Z427VLS*/ 00672000
*PRINTIT: PROC;                                            /*@Z427VLS*/ 00673000
PRINTIT  STM   @14,@12,@SA00008                                    0400 00674000
*  PRINTADR = ADDR(PRTLINE);                               /*@Z427VLS*/ 00675000
         LA    @06,PRTLINE                                         0401 00676000
         ST    @06,PRINTADR(,R2)                                   0401 00677000
*  CALL IOHND(RITEPRTR);      /*PASS CONTROL TO I/O HANDLER  @Z427VLS*/ 00678000
         L     @15,ADIOHND(,R2)                                    0402 00679000
         LA    @01,@AL00402                                        0402 00680000
         BALR  @14,@15                                             0402 00681000
*  IF SPACING = SINGLE        /*SINGLE SPACING REQUESTED     @Z427VLS*/ 00682000
*   THEN                                                           0403 00683000
         CLC   SPACING(1),SINGLE                                   0403 00684000
         BNE   @RF00403                                            0403 00685000
*    MYLINECT = MYLINECT + ONE;                            /*@Z427VLS*/ 00686000
         LH    @06,MYLINECT                                        0404 00687000
         AL    @06,ONE                                             0404 00688000
         STH   @06,MYLINECT                                        0404 00689000
*   ELSE                                                           0405 00690000
*    IF SPACING = DOUBLE      /*DOUBLE SPACING REQUESTED     @Z427VLS*/ 00691000
*     THEN                                                         0405 00692000
         B     @RC00403                                            0405 00693000
@RF00403 CLC   SPACING(1),DOUBLE                                   0405 00694000
         BNE   @RF00405                                            0405 00695000
*      MYLINECT = MYLINECT + TWO;                          /*@Z427VLS*/ 00696000
         LH    @06,MYLINECT                                        0406 00697000
         AL    @06,TWO                                             0406 00698000
         STH   @06,MYLINECT                                        0406 00699000
*     ELSE                                                         0407 00700000
*      IF SPACING = TRIPLE    /*RIGHT U GUESSED TRIPLE SPACING REQUES*/ 00701000
*       THEN                                                       0407 00702000
         B     @RC00405                                            0407 00703000
@RF00405 CLC   SPACING(1),TRIPLE                                   0407 00704000
         BNE   @RF00407                                            0407 00705000
*        MYLINECT = MYLINECT + THREE;/*ELSE IT'S AN UPSPACE  @Z427VLS*/ 00706000
         LH    @06,MYLINECT                                        0408 00707000
         LA    @06,3(,@06)                                         0408 00708000
         STH   @06,MYLINECT                                        0408 00709000
*       ELSE                                                       0409 00710000
*        IF SPACING = UPSPACE     /*IF TRUE LINECT MUST BE RESET     */ 00711000
*           THEN                                                   0409 00712000
         B     @RC00407                                            0409 00713000
@RF00407 CLC   SPACING(1),UPSPACE                                  0409 00714000
         BNE   @RF00409                                            0409 00715000
*             MYLINECT = ZERO;                             /*@Z427VLS*/ 00716000
         SLR   @06,@06                                             0410 00717000
         STH   @06,MYLINECT                                        0410 00718000
* IF SWITCH5 = ON & MYLINECT=> LINECT THEN/*HEADING FOR SUMMARY*/  0411 00719000
@RF00409 DS    0H                                                  0411 00720000
@RC00407 DS    0H                                                  0411 00721000
@RC00405 DS    0H                                                  0411 00722000
@RC00403 TM    SWITCH5,B'00001000'                                 0411 00723000
         BNO   @RF00411                                            0411 00724000
         LH    @06,MYLINECT                                        0411 00725000
         CH    @06,LINECT(,R2)                                     0411 00726000
         BL    @RF00411                                            0411 00727000
*  DO;                                                     /*@Z427VLS*/ 00728000
*   KEEPSP = SPACING;                                      /*@Z427VLS*/ 00729000
         MVC   KEEPSP(1),SPACING                                   0413 00730000
*   SPACING = UPSPACE;                                     /*@Z427VLS*/ 00731000
         MVC   SPACING(1),UPSPACE                                  0414 00732000
*   PRINTADR = ADDR(PRTLINE);                              /*@Z427VLS*/ 00733000
         LA    @06,PRTLINE                                         0415 00734000
         ST    @06,PRINTADR(,R2)                                   0415 00735000
*   CALL IOHND(RITEPRTR);                                  /*@Z427VLS*/ 00736000
         L     @15,ADIOHND(,R2)                                    0416 00737000
         LA    @01,@AL00416                                        0416 00738000
         BALR  @14,@15                                             0416 00739000
*MYLINECT = THREE;                                         /*@0001VLS*/ 00740000
         MVC   MYLINECT(2),@CH00075                                0417 00741000
*RESPECIFY (R6) RESTRICTED;                                /*@0001VLS*/ 00742000
*  SPACING = SINGLE;                                       /*@0001VLS*/ 00743000
         MVC   SPACING(1),SINGLE                                   0419 00744000
*  TOTALHD2 = TOTALHD1;     /*MOVE IN THE FIRST PART OF THE HEADING  */ 00745000
         MVC   TOTALHD2(12),TOTALHD1                               0420 00746000
* R6 = ADDR(TOTALHD3);    /*WHERE THE HEADING IS AT          @0001VLS*/ 00747000
         LA    R6,TOTALHD3                                         0421 00748000
* R8 = ADDR(TIME1) + 26;  /*WHERE TO MOVE THE LINE TO        @0001VLS*/ 00749000
         LA    R8,TIME1                                            0422 00750000
         AL    R8,@CF01065                                         0422 00751000
* R9 = 7 + SIX * EVNUM;   /*HOW MANY BYTES TO MOVE INTO THE HEADING*/   00752000
         L     @03,EVPTR(,R2)                                      0423 00753000
         L     R9,SIX                                              0423 00754000
         MH    R9,EVNUM(,@03)                                      0423 00755000
         AL    R9,@CF00082                                         0423 00756000
* GEN(EX  R9,MOVECHAR);   /*MOVE THE CHARACTERS INTO THE PRINT BUFF*/   00757000
         EX  R9,MOVECHAR                                                00758000
*RESPECIFY (R6) UNRESTRICTED;                              /*@0001VLS*/ 00759000
*PRINTADR = ADDR(PRTLINE);    /*TELL I/O WHERE THE BUFFER IS AT*/  0426 00760000
         LA    @06,PRTLINE                                         0426 00761000
         ST    @06,PRINTADR(,R2)                                   0426 00762000
*CALL IOHND(RITEPRTR);        /*GO WRITE THE HEADING TO THE BUFFER*/    00763000
         L     @15,ADIOHND(,R2)                                    0427 00764000
         LA    @01,@AL00427                                        0427 00765000
         BALR  @14,@15                                             0427 00766000
*   SPACING = KEEPSP;                                      /*@Z427VLS*/ 00767000
         MVC   SPACING(1),KEEPSP                                   0428 00768000
*  END;                                                    /*@Z427VLS*/ 00769000
*END;                                                      /*@Z427VLS*/ 00770000
@EL00008 DS    0H                                                  0430 00771000
@EF00008 DS    0H                                                  0430 00772000
@ER00008 LM    @14,@12,@SA00008                                    0430 00773000
         BR    @14                                                 0430 00774000
*/********************************************************************/ 00775000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00776000
*/*    THIS PROC WILL CONVERT THE TIME IN THE RECORD TO PRINTABLE    */ 00777000
*/*                                                          @Z427VLS*/ 00778000
*TIME:  PROC;                                              /*@Z427VLS*/ 00779000
TIME     STM   @14,@12,@SA00009                                    0431 00780000
*  NEXTBY  =  ADDR(LRTTIME);     /*SET POINTER TO POINT TO TIME FIELD*/ 00781000
         LA    @06,LRTTIME(,R7)                                    0432 00782000
         ST    @06,NEXTBY                                          0432 00783000
*  NUMBER = ONE;                 /*CONVERT 1 TO ALLOW FOR SPACES     */ 00784000
         L     @06,ONE                                             0433 00785000
         ST    @06,NUMBER                                          0433 00786000
*  ADDNXT = ADDR(TIME1);         /*SET POINTER TO START OF OUTPUT    */ 00787000
         LA    @06,TIME1                                           0434 00788000
         ST    @06,ADDNXT                                          0434 00789000
*  DO R = 4 BY -1 TO 1;          /*CONV HR'S MINS SECONDS    @Z427VLS*/ 00790000
         LA    @06,4                                               0435 00791000
         ST    @06,R                                               0435 00792000
@DL00435 DS    0H                                                  0436 00793000
*    CALL CONVERT;               /*CONVERT THE BYTE OF DATA  @Z427VLS*/ 00794000
         BAL   @14,CONVERT                                         0436 00795000
*    NEXTBY = NEXTBY + ONE;      /*MOVE TO THE NEXT FIELD    @Z427VLS*/ 00796000
         L     @06,NEXTBY                                          0437 00797000
         AL    @06,ONE                                             0437 00798000
         ST    @06,NEXTBY                                          0437 00799000
*    ADDNXT = ADDNXT + THREE;    /*ALLOW FOR BLANK BETWEEN EACH FIELD*/ 00800000
         LA    @06,3                                               0438 00801000
         AL    @06,ADDNXT                                          0438 00802000
         ST    @06,ADDNXT                                          0438 00803000
*  END;                                                    /*@Z427VLS*/ 00804000
         SLR   @06,@06                                             0439 00805000
         BCTR  @06,0                                               0439 00806000
         AL    @06,R                                               0439 00807000
         ST    @06,R                                               0439 00808000
         LTR   @06,@06                                             0439 00809000
         BP    @DL00435                                            0439 00810000
*END;                                                      /*@Z427VLS*/ 00811000
@EL00009 DS    0H                                                  0440 00812000
@EF00009 DS    0H                                                  0440 00813000
@ER00009 LM    @14,@12,@SA00009                                    0440 00814000
         BR    @14                                                 0440 00815000
* /*******************************************************************/ 00816000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00817000
* /*    THIS PROC WILL MOVE THE DATA FOR EACH TYPE OF RECORD INTO    */ 00818000
* /*    THE PRINT LINE                                       @Z427VLS*/ 00819000
*MOVEDATA:  PROC;                                          /*@Z427VLS*/ 00820000
MOVEDATA STM   @14,@12,@SA00010                                    0441 00821000
*/*EREPCASE (CURRENT) VALUES(1,2,3,4,5,6,7,8,9,10,11)*/            0442 00822000
* DCL  I0001   FIXED(15);                                          0442 00823000
* I0001 = 0;                                                       0443 00824000
         SLR   I0001,I0001                                         0443 00825000
* IF CURRENT = 1 THEN                                              0444 00826000
         CLC   CURRENT(4),@CF00054                                 0444 00827000
         BNE   @RF00444                                            0444 00828000
*      I0001 = 4 ;                                                 0445 00829000
         LA    I0001,4                                             0445 00830000
* IF CURRENT = 2 THEN                                              0446 00831000
@RF00444 CLC   CURRENT(4),@CF00073                                 0446 00832000
         BNE   @RF00446                                            0446 00833000
*      I0001 = 8 ;                                                 0447 00834000
         LA    I0001,8                                             0447 00835000
* IF CURRENT = 3 THEN                                              0448 00836000
@RF00446 CLC   CURRENT(4),@CF00075                                 0448 00837000
         BNE   @RF00448                                            0448 00838000
*      I0001 = 12 ;                                                0449 00839000
         LA    I0001,12                                            0449 00840000
* IF CURRENT = 4 THEN                                              0450 00841000
@RF00448 CLC   CURRENT(4),@CF00063                                 0450 00842000
         BNE   @RF00450                                            0450 00843000
*      I0001 = 16 ;                                                0451 00844000
         LA    I0001,16                                            0451 00845000
* IF CURRENT = 5 THEN                                              0452 00846000
@RF00450 CLC   CURRENT(4),@CF00078                                 0452 00847000
         BNE   @RF00452                                            0452 00848000
*      I0001 = 20 ;                                                0453 00849000
         LA    I0001,20                                            0453 00850000
* IF CURRENT = 6 THEN                                              0454 00851000
@RF00452 CLC   CURRENT(4),@CF00080                                 0454 00852000
         BNE   @RF00454                                            0454 00853000
*      I0001 = 24 ;                                                0455 00854000
         LA    I0001,24                                            0455 00855000
* IF CURRENT = 7 THEN                                              0456 00856000
@RF00454 CLC   CURRENT(4),@CF00082                                 0456 00857000
         BNE   @RF00456                                            0456 00858000
*      I0001 = 28 ;                                                0457 00859000
         LA    I0001,28                                            0457 00860000
* IF CURRENT = 8 THEN                                              0458 00861000
@RF00456 CLC   CURRENT(4),@CF00065                                 0458 00862000
         BNE   @RF00458                                            0458 00863000
*      I0001 = 32 ;                                                0459 00864000
         LA    I0001,32                                            0459 00865000
* IF CURRENT = 9 THEN                                              0460 00866000
@RF00458 CLC   CURRENT(4),@CF00085                                 0460 00867000
         BNE   @RF00460                                            0460 00868000
*      I0001 = 36 ;                                                0461 00869000
         LA    I0001,36                                            0461 00870000
* IF CURRENT = 10 THEN                                             0462 00871000
@RF00460 CLC   CURRENT(4),@CF00032                                 0462 00872000
         BNE   @RF00462                                            0462 00873000
*      I0001 = 40 ;                                                0463 00874000
         LA    I0001,40                                            0463 00875000
* IF CURRENT = 11 THEN                                             0464 00876000
@RF00462 CLC   CURRENT(4),@CF00033                                 0464 00877000
         BNE   @RF00464                                            0464 00878000
*      I0001 = 44 ;                                                0465 00879000
         LA    I0001,44                                            0465 00880000
* GENERATE;                                                        0466 00881000
@RF00464 DS    0H                                                  0466 00882000
    B    L00010(I0001)                                                  00883000
L00010 B    L000112                                                     00884000
    B    L00011                                                         00885000
    B    L00012                                                         00886000
    B    L00013                                                         00887000
    B    L00014                                                         00888000
    B    L00015                                                         00889000
    B    L00016                                                         00890000
    B    L00017                                                         00891000
    B    L00018                                                         00892000
    B    L00019                                                         00893000
    B    L000110                                                        00894000
    B    L000111                                                        00895000
* /*******************************************************************/ 00896000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00897000
* /*    THIS CASE WILL HANDLE ALL MCH TYPE RECORDS           @Z427VLS*/ 00898000
*                                                                  0467 00899000
*/*EREPSUB  */                                                     0467 00900000
*L00011:                                                           0467 00901000
*     DO;                                               /*@Z427VLS*/    00902000
L00011   DS    0H                                                  0468 00903000
*    CALL TIME;                     /*MOVE THE TIME INTO THE PRINT L */ 00904000
         BAL   @14,TIME                                            0468 00905000
*    JOBNAME1 = MCHJOBID;           /*MOVE THE JOB NAME INTO PRINT L */ 00906000
         MVC   JOBNAME1(8),MCHJOBID(R7)                            0469 00907000
*    CPU12 = EVLETTER(PTR);    /*MOVE IN THE CPU LETTER      @0001VLS*/ 00908000
         L     @06,PTR                                             0470 00909000
         LR    @03,@06                                             0470 00910000
         MH    @03,@CH00080                                        0470 00911000
         L     @01,EVPTR(,R2)                                      0470 00912000
         ALR   @01,@03                                             0470 00913000
         MVC   CPU12(1),EVLETTER-6(@01)                            0470 00914000
*    IF MCHSYSTR = ON               /*DID IT TERMINATE THE SYSTEM    */ 00915000
*      THEN                         /*YES BIT IS ON          @Z427VLS*/ 00916000
         TM    MCHSYSTR(R7),B'10000000'                            0471 00917000
         BNO   @RF00471                                            0471 00918000
*       DO;                                                /*@Z427VLS*/ 00919000
*        RECTYP1 = MCHTRM;          /*SET TYPE = TO  MCH-TRM @Z427VLS*/ 00920000
         MVC   RECTYP1(7),MCHTRM                                   0473 00921000
*        MCHTRMCT(PTR) = MCHTRMCT(PTR) + ONE;              /*@Z427VLS*/ 00922000
         SLA   @06,2                                               0474 00923000
         L     @03,MCHTRMCT-4(@06)                                 0474 00924000
         AL    @03,ONE                                             0474 00925000
         ST    @03,MCHTRMCT-4(@06)                                 0474 00926000
*       END;                                               /*@Z427VLS*/ 00927000
*      ELSE                                                        0476 00928000
*       DO;                                                /*@Z427VLS*/ 00929000
         B     @RC00471                                            0476 00930000
@RF00471 DS    0H                                                  0477 00931000
*        RECTYP1 = MCH;             /*SET TO PLAIN   MCH     @Z427VLS*/ 00932000
         MVC   RECTYP1(7),MCH                                      0477 00933000
*        MCHCT(PTR) = MCHCT(PTR) + ONE;                    /*@Z427VLS*/ 00934000
         L     @06,PTR                                             0478 00935000
         SLA   @06,2                                               0478 00936000
         L     @03,MCHCT-4(@06)                                    0478 00937000
         AL    @03,ONE                                             0478 00938000
         ST    @03,MCHCT-4(@06)                                    0478 00939000
*       END;                                               /*@Z427VLS*/ 00940000
*    NUMBER = ONE;                  /*SET UP # OF BYTES TO CONVERT   */ 00941000
@RC00471 L     @06,ONE                                             0480 00942000
         ST    @06,NUMBER                                          0480 00943000
*    ADDNXT = ADDR(PSWMCH) ;        /*SET UP BASE FOR OUTPUT ADDRESS */ 00944000
         LA    @06,PSWMCH                                          0481 00945000
         ST    @06,ADDNXT                                          0481 00946000
*    NEXTBY = ADDR(MCHMOD);         /*SET BASE TO POINT TO MCH MODLE */ 00947000
         LA    @06,MCHMOD(,R7)                                     0482 00948000
         ST    @06,NEXTBY                                          0482 00949000
*    CALL CONVERT;                  /*GO CONVERT THE MODLE TO PRINT  */ 00950000
         BAL   @14,CONVERT                                         0483 00951000
*    NUMBER = EIGHT;                /*SET UP # OF BYTES TO CONVERT   */ 00952000
         MVC   NUMBER(4),@CF00065                                  0484 00953000
*    ADDNXT  = ADDR(PSWMCH);        /*SET BASE TO POINT TO START ADD */ 00954000
         LA    @06,PSWMCH                                          0485 00955000
         ST    @06,ADDNXT                                          0485 00956000
*    NEXTBY = ADDR(MCHOPSW);        /*SET BASE POINTER TO DATA ADDRES*/ 00957000
         LA    @06,MCHOPSW(,R7)                                    0486 00958000
         ST    @06,NEXTBY                                          0486 00959000
*    CALL CONVERT;                  /*CALL PROGRAM TO CONVERT DATA   */ 00960000
         BAL   @14,CONVERT                                         0487 00961000
*IF  LRTKEY1 = '13'X &                                             0488 00962000
*    (LRTERRID & '10'X) = '10'X THEN                               0488 00963000
         CLI   LRTKEY1(R7),X'13'                                   0488 00964000
         BNE   @RF00488                                            0488 00965000
         MVC   @TS00001(1),LRTERRID(R7)                            0488 00966000
         NI    @TS00001,X'10'                                      0488 00967000
         CLI   @TS00001,X'10'                                      0488 00968000
         BNE   @RF00488                                            0488 00969000
* DO;                                                      /*@0098VLS*/ 00970000
* NUMBER = 10;   /*ERRORID1 HAS 10 BYTES                     @0098VLS*/ 00971000
         LA    @06,10                                              0490 00972000
         ST    @06,NUMBER                                          0490 00973000
* ADDNXT = ADDR(ERRORID1); /*ADDRESS IN THE OUTPUT LINE TO PLACE IT*/   00974000
         LA    @03,ERRORID1                                        0491 00975000
         ST    @03,ADDNXT                                          0491 00976000
* NEXTBY = ADDR(RERR);/*ADDRESS OF ERRORID1(R7 + RECLNGTH  - 10*/  0492 00977000
         LR    @03,R7                                              0492 00978000
         AH    @03,RECLNGTH(,R2)                                   0492 00979000
         SLR   @03,@06                                             0492 00980000
         ST    @03,NEXTBY                                          0492 00981000
* CALL CONVERT; /*GO CONVERT THE ITEM TO PRINTABLE           @0098VLS*/ 00982000
         BAL   @14,CONVERT                                         0493 00983000
* END;                                                     /*@0098VLS*/ 00984000
* ELSE                                                             0495 00985000
* ERRORNA = NOTAPPLY; /*PUT IN THE WORDS NOT AVAIBLE         @0098VLS*/ 00986000
*                                                                  0495 00987000
         B     @RC00488                                            0495 00988000
@RF00488 MVC   ERRORNA(8),NOTAPPLY                                 0495 00989000
*/*EREPSEND  */                                                    0496 00990000
*       GO TO L000113;                                             0496 00991000
         B     L000113                                             0496 00992000
*     END;                                              /*@Z427VLS*/    00993000
* /*******************************************************************/ 00994000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00995000
* /*    THIS CASE WILL HANDLE ALL CCH TYPE RECORDS           @Z427VLS*/ 00996000
*                                                                  0498 00997000
*/*EREPSUB  */                                                     0498 00998000
*L00012:                                                           0498 00999000
*     DO;                                               /*@Z427VLS*/    01000000
L00012   DS    0H                                                  0499 01001000
*      CALL TIME;                    /*GO CONVERT THIS RECORDS TIME  */ 01002000
         BAL   @14,TIME                                            0499 01003000
*      JOBNAME1 = CCHJOBID;          /*MOVE THE JOB NAME INTO PRINT  */ 01004000
         MVC   JOBNAME1(8),CCHJOBID(R7)                            0500 01005000
*      IF CCHRINC = ON                                             0501 01006000
*         THEN                                                     0501 01007000
         TM    CCHRINC(R7),B'01000000'                             0501 01008000
         BNO   @RF00501                                            0501 01009000
*          DO;                                             /*@Z427VLS*/ 01010000
*           RECTYP1 = CCHINC;        /*MAKE PRINT READ CCH-INC       */ 01011000
         MVC   RECTYP1(7),CCHINC                                   0503 01012000
*           CCHINCCT(PTR) = CCHINCCT(PTR) + ONE;           /*@Z427VLS*/ 01013000
         L     @06,PTR                                             0504 01014000
         SLA   @06,2                                               0504 01015000
         L     @03,CCHINCCT-4(@06)                                 0504 01016000
         AL    @03,ONE                                             0504 01017000
         ST    @03,CCHINCCT-4(@06)                                 0504 01018000
*          END;                                            /*@Z427VLS*/ 01019000
*         ELSE                                                     0506 01020000
*          DO;                                             /*@Z427VLS*/ 01021000
         B     @RC00501                                            0506 01022000
@RF00501 DS    0H                                                  0507 01023000
*            IF CCHRCRH = ON         /*IS IT A CCH-CRH TYPE RECORD   */ 01024000
*               THEN                                               0507 01025000
         TM    CCHRCRH(R7),B'00000100'                             0507 01026000
         BNO   @RF00507                                            0507 01027000
*                DO;                                       /*@Z427VLS*/ 01028000
*                  RECTYP1 = CCHCRH; /*MAKE PRINT READ CCH-CHR       */ 01029000
         MVC   RECTYP1(7),CCHCRH                                   0509 01030000
*                  CCHCRHCT(PTR) = CCHCRHCT(PTR) + ONE;    /*@Z427VLS*/ 01031000
         L     @06,PTR                                             0510 01032000
         SLA   @06,2                                               0510 01033000
         L     @03,CCHCRHCT-4(@06)                                 0510 01034000
         AL    @03,ONE                                             0510 01035000
         ST    @03,CCHCRHCT-4(@06)                                 0510 01036000
*                END;                                      /*@Z427VLS*/ 01037000
*               ELSE                                               0512 01038000
*                DO;                                       /*@Z427VLS*/ 01039000
         B     @RC00507                                            0512 01040000
@RF00507 DS    0H                                                  0513 01041000
*                  RECTYP1 = CCH;    /*MAKE IT PLAIN CCH     @Z427VLS*/ 01042000
         MVC   RECTYP1(7),CCH                                      0513 01043000
*                  CCHCT(PTR) = CCHCT(PTR) + ONE;          /*@Z427VLS*/ 01044000
         L     @06,PTR                                             0514 01045000
         SLA   @06,2                                               0514 01046000
         L     @03,CCHCT-4(@06)                                    0514 01047000
         AL    @03,ONE                                             0514 01048000
         ST    @03,CCHCT-4(@06)                                    0514 01049000
*                END;                                      /*@Z427VLS*/ 01050000
*          END;                                            /*@Z427VLS*/ 01051000
@RC00507 DS    0H                                                  0517 01052000
*      NUMBER = TWO;                  /*SET TO CONVERT 2 BYTES       */ 01053000
@RC00501 L     @06,TWO                                             0517 01054000
         ST    @06,NUMBER                                          0517 01055000
*      CPU12 = EVLETTER(PTR);         /*INSERT THE CPU LETTER SET BY */ 01056000
         L     @06,PTR                                             0518 01057000
         MH    @06,@CH00080                                        0518 01058000
         L     @03,EVPTR(,R2)                                      0518 01059000
         ALR   @03,@06                                             0518 01060000
         MVC   CPU12(1),EVLETTER-6(@03)                            0518 01061000
*                                     /*IFCFILT4 FOR THIS SERIAL MOD */ 01062000
*      ADDNXT = ADDR(CUA11);          /*SET UP THE CUA TO PRINT      */ 01063000
         LA    @06,CUA11                                           0519 01064000
         ST    @06,ADDNXT                                          0519 01065000
*      NEXTBY = ADDR(CCHCUA);         /*ADDRESS OF WHERE CUA IS      */ 01066000
         LA    @06,CCHCUA(,R7)                                     0520 01067000
         ST    @06,NEXTBY                                          0520 01068000
*      SWITCH1 = ON;                  /*SET NOT TO USE FIRST 1/2 BYTE*/ 01069000
         OI    SWITCH1,B'10000000'                                 0521 01070000
*      CALL CONVERT;                  /*GO CONVERT CUA TO PRINTABLE  */ 01071000
         BAL   @14,CONVERT                                         0522 01072000
*      DEVCOMP = CCHCODE2;            /*PUT DEVICE IN COMMON AREA    */ 01073000
         MVC   DEVCOMP(2),CCHCODE2(R7)                             0523 01074000
*      CALL DODEVICE;                 /*CALL PROC TO BUILD DEVICE NME*/ 01075000
         BAL   @14,DODEVICE                                        0524 01076000
*     NUMBER = EIGHT;      /*SET UP FOR THE CSW              @ZA19014*/ 01077000
         MVC   NUMBER(4),@CF00065                                  0525 01078000
*     ADDNXT = ADDR(CSW1); /*WHERE TO PLACE THE CONVER CSW   @ZA19014*/ 01079000
         LA    @06,CSW1                                            0526 01080000
         ST    @06,ADDNXT                                          0526 01081000
*     NEXTBY = ADDR(CCHCSW);/*WHERE TO GET THE CSW TO CONVE  @ZA19014*/ 01082000
         LA    @06,CCHCSW(,R7)                                     0527 01083000
         ST    @06,NEXTBY                                          0527 01084000
*     CALL CONVERT;       /*GO CONVERT THE CSW TO PRINTABLE  @ZA19014*/ 01085000
*                                                                  0528 01086000
         BAL   @14,CONVERT                                         0528 01087000
*/*EREPSEND  */                                                    0529 01088000
*       GO TO L000113;                                             0529 01089000
         B     L000113                                             0529 01090000
*     END;                                              /*@Z427VLS*/    01091000
* /*******************************************************************/ 01092000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01093000
* /*    THIS CASE WILL HANDLE ALL OBR TYPE RECORDS           @Z427VLS*/ 01094000
* /*                                                         @Z427VLS*/ 01095000
*                                                                  0531 01096000
*/*EREPSUB  */                                                     0531 01097000
*L00013:                                                           0531 01098000
*     DO;                                               /*@Z427VLS*/    01099000
L00013   DS    0H                                                  0532 01100000
*   CALL TIME;                        /*GO CONVERT THIS RECORDS TIME */ 01101000
         BAL   @14,TIME                                            0532 01102000
*   JOBNAME1 = OBRJOBID;              /*MOVE THE NAME INTO PRINT LINE*/ 01103000
         MVC   JOBNAME1(8),OBRJOBID(R7)                            0533 01104000
*   NUMBER = TWO;                     /*SET # OF BYTES TO CONVERT    */ 01105000
         L     @06,TWO                                             0534 01106000
         ST    @06,NUMBER                                          0534 01107000
*   CPU12 = EVLETTER(PTR) ;           /*INSERT THE CPU LETTER        */ 01108000
         L     @06,PTR                                             0535 01109000
         MH    @06,@CH00080                                        0535 01110000
         L     @03,EVPTR(,R2)                                      0535 01111000
         ALR   @03,@06                                             0535 01112000
         MVC   CPU12(1),EVLETTER-6(@03)                            0535 01113000
*   SWITCH1 = ON;                     /*SET TO NOT DO FIRST 1/2 BYTE */ 01114000
         OI    SWITCH1,B'10000000'                                 0536 01115000
*   ADDNXT = ADDR(CUA11);             /*ADDRESS OF WHERE TO PUT DATA */ 01116000
         LA    @06,CUA11                                           0537 01117000
         ST    @06,ADDNXT                                          0537 01118000
*   IF SHORTSW = ON                   /*IS THIS A SHORT OBR  @Z427VLS*/ 01119000
*     THEN                                                         0538 01120000
         TM    SHORTSW(R7),B'00100000'                             0538 01121000
         BNO   @RF00538                                            0538 01122000
*      DO;                                                 /*@Z427VLS*/ 01123000
*    IF (OBRSDEV2 & 'F000'X) = '8000'X THEN                        0540 01124000
         MVC   @TS00001(2),OBRSDEV2(R7)                            0540 01125000
         NC    @TS00001(2),@CB01306                                0540 01126000
         CLC   @TS00001(2),@CB00193                                0540 01127000
         BNE   @RF00540                                            0540 01128000
*        VOLUME1 = OBRVOL;            /*MOVE IN THE OBR VOLUME ID    */ 01129000
         MVC   VOLUME1(6),OBRVOL(R7)                               0541 01130000
*       DEVICE1 = HH1;                /*WILL SET THE ITEM BACK TO    */ 01131000
@RF00540 MVC   DEVICE1(4),HH1                                      0542 01132000
*                                     /*BLANKS               @Z427VLS*/ 01133000
*       NEXTBY = ADDR(OBRSCUA) + ONE; /*ADDRESS OF CUA IN SHORT OBR  */ 01134000
         LA    @06,OBRSCUA(,R7)                                    0543 01135000
         AL    @06,ONE                                             0543 01136000
         ST    @06,NEXTBY                                          0543 01137000
*       DEVCOMP = OBRSDEV2;           /*SHORT OBR DEVICE     @Z427VLS*/ 01138000
         MVC   DEVCOMP(2),OBRSDEV2(R7)                             0544 01139000
*       JOBNAME1 = NOTAPPLY;                               /*@Z427VLS*/ 01140000
         MVC   JOBNAME1(8),NOTAPPLY                                0545 01141000
*      END;                                                /*@Z427VLS*/ 01142000
*     ELSE                                                         0547 01143000
*      DO;                                                 /*@Z427VLS*/ 01144000
         B     @RC00538                                            0547 01145000
@RF00538 DS    0H                                                  0548 01146000
*       IF OBRCLASS = '80'X THEN                                   0548 01147000
         CLI   OBRCLASS(R7),X'80'                                  0548 01148000
         BNE   @RF00548                                            0548 01149000
*        VOLUME1 = OBRVOL;                                 /*@Z427VLS*/ 01150000
         MVC   VOLUME1(6),OBRVOL(R7)                               0549 01151000
*       IF (OBRDEV = '2009'X) |                                    0550 01152000
*          (OBRDEV = '200D'X) &((OBRCODE2 & '08'X) = '08'X) THEN   0550 01153000
@RF00548 CLC   OBRDEV(2,R7),@CB01308                               0550 01154000
         BE    @RT00550                                            0550 01155000
         CLC   OBRDEV(2,R7),@CB01309                               0550 01156000
         BNE   @RF00550                                            0550 01157000
         MVC   @TS00001(1),OBRCODE2(R7)                            0550 01158000
         NI    @TS00001,X'08'                                      0550 01159000
         CLI   @TS00001,X'08'                                      0550 01160000
         BNE   @RF00550                                            0550 01161000
@RT00550 DS    0H                                                  0551 01162000
*          LETTERV = 'V';                                  /*@Z427VLS*/ 01163000
         MVI   LETTERV,C'V'                                        0551 01164000
*      IF DEBUG29 = ON THEN  /*USE SECONDARY CUA RATHER THAN PRIMARY*/  01165000
@RF00550 TM    DEBUG29(R2),B'00000100'                             0552 01166000
         BNO   @RF00552                                            0552 01167000
*       NEXTBY = ADDR(OBRSECUA) + 1;/*ADDRESS OF THE SECONDARY CUA*/    01168000
         LA    @06,OBRSECUA(,R7)                                   0553 01169000
         AL    @06,@CF00054                                        0553 01170000
         ST    @06,NEXTBY                                          0553 01171000
*      ELSE                                                        0554 01172000
*       NEXTBY = ADDR(OBRPCUA) + ONE; /*ADDRESS OF LONG OBR CUA      */ 01173000
         B     @RC00552                                            0554 01174000
@RF00552 LA    @06,OBRPCUA(,R7)                                    0554 01175000
         AL    @06,ONE                                             0554 01176000
         ST    @06,NEXTBY                                          0554 01177000
*       DEVCOMP = OBRDEV;             /*LONG OBR DEVICE TYPE @Z427VLS*/ 01178000
@RC00552 MVC   DEVCOMP(2),OBRDEV(R7)                               0555 01179000
*   JOBNAME1 = OBRJOBID;              /*MOVE THE NAME INTO PRINT LINE*/ 01180000
         MVC   JOBNAME1(8),OBRJOBID(R7)                            0556 01181000
*    IF LRTKEY1 ='36'X |   /*WILL ALWAYS HAVE A TERMINAL NAME    */     01182000
*     ((LRTKEY1 = '34'X | LRTKEY1 = '32'X) & OBRTCAM = '0F'X) THEN 0557 01183000
         CLI   LRTKEY1(R7),X'36'                                   0557 01184000
         BE    @RT00557                                            0557 01185000
         CLI   LRTKEY1(R7),X'34'                                   0557 01186000
         BE    @GL00007                                            0557 01187000
         CLI   LRTKEY1(R7),X'32'                                   0557 01188000
         BNE   @RF00557                                            0557 01189000
@GL00007 CLI   OBRTCAM(R7),X'0F'                                   0557 01190000
         BNE   @RF00557                                            0557 01191000
@RT00557 DS    0H                                                  0558 01192000
*       TERMNAME = OBRTERMN;    /*MOVE TERMINAL NAME TO PRT BUFFER*/    01193000
         MVC   TERMNAME(8),OBRTERMN(R7)                            0558 01194000
*      END;                                                /*@Z427VLS*/ 01195000
@RF00557 DS    0H                                                  0560 01196000
*   CALL CONVERT;                     /*GO CONVERT 1 & 1/2 BYTES     */ 01197000
@RC00538 BAL   @14,CONVERT                                         0560 01198000
*   CALL DODEVICE;                    /*GO PROCESS THE DEVICE        */ 01199000
         BAL   @14,DODEVICE                                        0561 01200000
* IF(SDRCOUNT = OFF &          /*END OF DAY COUNTER FLAG OFF @0001VLS*/ 01201000
*    OBRTEMP  = OFF &          /*IT IS NOT AN TEMP OBR       @0001VLS*/ 01202000
*    SHORTSW  = OFF &          /*IT IS NOT A SHORT OBR       @0001VLS*/ 01203000
*    DISMOUNT = OFF ) &        /*IT IS NOT A DISMOUNT RECORD @0001VLS*/ 01204000
*    OBRSEN1 ^= '40'X         /*AND NOT A INTERVENTION REQUIRED */ 0562 01205000
*    THEN                      /*IT MUST BE A OBR-PERM  ERROR   */ 0562 01206000
         TM    SDRCOUNT(R7),B'11100100'                            0562 01207000
         BNZ   @RF00562                                            0562 01208000
         LA    @06,64                                              0562 01209000
         ALR   @06,R7                                              0562 01210000
         SLR   @03,@03                                             0562 01211000
         IC    @03,OBRDEVDC(,R7)                                   0562 01212000
         SLA   @03,3                                               0562 01213000
         ALR   @06,@03                                             0562 01214000
         SLR   @03,@03                                             0562 01215000
         IC    @03,OBRLSDRC(,R7)                                   0562 01216000
         ALR   @06,@03                                             0562 01217000
         CLI   OBRSEN1(@06),X'40'                                  0562 01218000
         BE    @RF00562                                            0562 01219000
*    DO;                                                   /*@ZA19014*/ 01220000
*     CALL OBRISPRM; /*CALL THE OBR PERM PROC TO BUILD  LINE @ZA19014*/ 01221000
         BAL   @14,OBRISPRM                                        0564 01222000
*     OBRPRMCT(PTR) = OBRPRMCT(PTR) + ONE;               /*  @ZA19014*/ 01223000
         L     @06,PTR                                             0565 01224000
         SLA   @06,2                                               0565 01225000
         L     @03,OBRPRMCT-4(@06)                                 0565 01226000
         AL    @03,ONE                                             0565 01227000
         ST    @03,OBRPRMCT-4(@06)                                 0565 01228000
*     RECTYP1 = OBRPRM; /*MOVE IN THE OBR IS PERMENT NAME    @ZA19014*/ 01229000
         MVC   RECTYP1(7),OBRPRM                                   0566 01230000
*    END;                                                  /*@ZA19014*/ 01231000
*    ELSE                                                          0568 01232000
*     IF SDRCOUNT = ON                /*IS IT AN OBR END OF DAY      */ 01233000
*      THEN                                                        0568 01234000
         B     @RC00562                                            0568 01235000
@RF00562 TM    SDRCOUNT(R7),B'10000000'                            0568 01236000
         BNO   @RF00568                                            0568 01237000
*       DO;                                                /*@Z427VLS*/ 01238000
*        RECTYP1 = OBREOD;            /*SET UP THE NAME FOR EOD      */ 01239000
         MVC   RECTYP1(7),OBREOD                                   0570 01240000
*        OBREODCT(PTR) = OBREODCT(PTR) + ONE;              /*@Z427VLS*/ 01241000
         L     @06,PTR                                             0571 01242000
         SLA   @06,2                                               0571 01243000
         L     @03,OBREODCT-4(@06)                                 0571 01244000
         AL    @03,ONE                                             0571 01245000
         ST    @03,OBREODCT-4(@06)                                 0571 01246000
*       END;                                               /*@Z427VLS*/ 01247000
*      ELSE                                                        0573 01248000
*      IF SHORTSW = ON THEN                                        0573 01249000
         B     @RC00568                                            0573 01250000
@RF00568 TM    SHORTSW(R7),B'00100000'                             0573 01251000
         BNO   @RF00573                                            0573 01252000
*       DO;                                                /*@ZA19014*/ 01253000
*        RECTYP1 = OBRSHT;     /*SET TYPE TO OBR SHORT       @ZA19014*/ 01254000
         MVC   RECTYP1(7),OBRSHT                                   0575 01255000
*        OBRSHTCT(PTR) = OBRSHTCT(PTR) + ONE;           /*   @ZA19014*/ 01256000
         L     @06,PTR                                             0576 01257000
         SLA   @06,2                                               0576 01258000
         L     @03,OBRSHTCT-4(@06)                                 0576 01259000
         AL    @03,ONE                                             0576 01260000
         ST    @03,OBRSHTCT-4(@06)                                 0576 01261000
*         END;                                             /*@Z427VLS*/ 01262000
*        ELSE                                                      0578 01263000
*         IF OBRTEMP = ON THEN                                     0578 01264000
         B     @RC00573                                            0578 01265000
@RF00573 TM    OBRTEMP(R7),B'01000000'                             0578 01266000
         BNO   @RF00578                                            0578 01267000
*          DO;                                             /*@ZA19014*/ 01268000
*           RECTYP1 = OBRTMP; /*MAKE THE LABLE A OBR TEMP    @ZA19014*/ 01269000
         MVC   RECTYP1(7),OBRTMP                                   0580 01270000
*           OBRTMPCT(PTR) = OBRTMPCT(PTR) + ONE;      /*     @ZA19014*/ 01271000
         L     @06,PTR                                             0581 01272000
         SLA   @06,2                                               0581 01273000
         L     @03,OBRTMPCT-4(@06)                                 0581 01274000
         AL    @03,ONE                                             0581 01275000
         ST    @03,OBRTMPCT-4(@06)                                 0581 01276000
*           END;                                           /*@Z427VLS*/ 01277000
*          ELSE                                                    0583 01278000
*           IF DISMOUNT = ON          /*WAS IT A DISMOUNT OBR        */ 01279000
*            THEN                                                  0583 01280000
         B     @RC00578                                            0583 01281000
@RF00578 TM    DISMOUNT(R7),B'00000100'                            0583 01282000
         BNO   @RF00583                                            0583 01283000
*             DO;                                          /*@Z427VLS*/ 01284000
*              RECTYP1 = OBRDMT ;                          /*@Z427VLS*/ 01285000
         MVC   RECTYP1(7),OBRDMT                                   0585 01286000
*              OBRDMTCT(PTR) = OBRDMTCT(PTR) + ONE;        /*@Z427VLS*/ 01287000
         L     @06,PTR                                             0586 01288000
         SLA   @06,2                                               0586 01289000
         L     @03,OBRDMTCT-4(@06)                                 0586 01290000
         AL    @03,ONE                                             0586 01291000
         ST    @03,OBRDMTCT-4(@06)                                 0586 01292000
*             END;                                         /*@Z427VLS*/ 01293000
*            ELSE                                                  0588 01294000
*             DO;                     /*IS A ODD OBR         @Z427VLS*/ 01295000
         B     @RC00583                                            0588 01296000
@RF00583 DS    0H                                                  0589 01297000
*              RECTYP1 = OBR;         /*SET NAME TO JUST PLAIN OBR   */ 01298000
         MVC   RECTYP1(7),OBR                                      0589 01299000
*              OBRCT(PTR) = OBRCT(PTR) + ONE;              /*@Z427VLS*/ 01300000
         L     @06,PTR                                             0590 01301000
         SLA   @06,2                                               0590 01302000
         L     @03,OBRCT-4(@06)                                    0590 01303000
         AL    @03,ONE                                             0590 01304000
         ST    @03,OBRCT-4(@06)                                    0590 01305000
*              ADDNXT = ADDR(CSW1);   /*SET UP FOR CSW OUTPUT        */ 01306000
         LA    @06,CSW1                                            0591 01307000
         ST    @06,ADDNXT                                          0591 01308000
*              NEXTBY = ADDR(OBRSTAT);/*SET UP WHERE TO GET THE DATA */ 01309000
         LA    @06,OBRSTAT(,R7)                                    0592 01310000
         ST    @06,NEXTBY                                          0592 01311000
*              CALL CONVERT;          /*GO CONVERT THE NUM # STILL 2 */ 01312000
         BAL   @14,CONVERT                                         0593 01313000
*              NUMBER = 1;            /*SET UP TO DO 1 BYTE  @Z427VLS*/ 01314000
         MVC   NUMBER(4),@CF00054                                  0594 01315000
*              ADDNXT = ADDR(CMD1);   /*SET UP FOR CCW FIRST BYTE    */ 01316000
         LA    @06,CMD1                                            0595 01317000
         ST    @06,ADDNXT                                          0595 01318000
*              NEXTBY = ADDR(OBRSRDS);/*ADDRESS OF WHERE THE DATA IS */ 01319000
         LA    @06,OBRSRDS(,R7)                                    0596 01320000
         ST    @06,NEXTBY                                          0596 01321000
*              CALL CONVERT;          /*GO CONVERT THE CCMDTTO PRINT */ 01322000
         BAL   @14,CONVERT                                         0597 01323000
*             END;                                         /*@Z427VLS*/ 01324000
*                                                                  0598 01325000
*/*EREPSEND  */                                                    0599 01326000
*       GO TO L000113;                                             0599 01327000
         B     L000113                                             0599 01328000
*     END;                                              /*@Z427VLS*/    01329000
* /*******************************************************************/ 01330000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01331000
* /*    THIS CASE WILL HANDLE ALL SFT TYPE RECORDS           @Z427VLS*/ 01332000
* /*                                                         @Z427VLS*/ 01333000
*                                                                  0601 01334000
*/*EREPSUB  */                                                     0601 01335000
*L00014:                                                           0601 01336000
*     DO;                                               /*@Z427VLS*/    01337000
L00014   DS    0H                                                  0602 01338000
*   CALL TIME;                     /*GO AND SET UP THE TIME  FROM REC*/ 01339000
         BAL   @14,TIME                                            0602 01340000
*   JOBNAME1 = SFTJOBID;           /*MOVE IN THE JOB NAME    @Z427VLS*/ 01341000
         MVC   JOBNAME1(8),SFTJOBID(R7)                            0603 01342000
*   NUMBER = EIGHT;               /*NUMBER OF BYTES TO CHANGE       */  01343000
         MVC   NUMBER(4),@CF00065                                  0604 01344000
*   ADDNXT = ADDR(PSWMCH);        /*WHERE TO PUT THE CONVERTED DATA */  01345000
         LA    @06,PSWMCH                                          0605 01346000
         ST    @06,ADDNXT                                          0605 01347000
*   NEXTBY = ADDR(SFTPROGC);      /*WHERE IN THE RECORD TO GET DATA */  01348000
         LA    @06,SFTPROGC(,R7)                                   0606 01349000
         ST    @06,NEXTBY                                          0606 01350000
*   CALL CONVERT;                 /*GO AND CONVERT THE DATA  @Z427VLS*/ 01351000
         BAL   @14,CONVERT                                         0607 01352000
*   RCYRYXIT = SFTREXN;                                    /*@Z427VLS*/ 01353000
         MVC   RCYRYXIT(8),SFTREXN(R7)                             0608 01354000
*   COMPMOD = SFTMODN;                                     /*@Z427VLS*/ 01355000
         MVC   COMPMOD(8),SFTMODN(R7)                              0609 01356000
*   CSECTID = SFTCSECT;                                    /*@Z427VLS*/ 01357000
         MVC   CSECTID(8),SFTCSECT(R7)                             0610 01358000
* NUMBER = 4;                /*REASON CODE HAS 4 BYTES OF INFO*/   0611 01359000
         LA    @06,4                                               0611 01360000
         ST    @06,NUMBER                                          0611 01361000
* ADDNXT = ADDR(REASON) -2; /*LOCATION IN THE PRINT LINE     @0098VLS*/ 01362000
         LA    @03,REASON                                          0612 01363000
         BCTR  @03,0                                               0612 01364000
         BCTR  @03,0                                               0612 01365000
         ST    @03,ADDNXT                                          0612 01366000
* NEXTBY = ADDR(SFTABNDC) + 4;/*WHERE INFO IS                @0098VLS*/ 01367000
         LA    @03,SFTABNDC(,R7)                                   0613 01368000
         ALR   @03,@06                                             0613 01369000
         ST    @03,NEXTBY                                          0613 01370000
* CALL CONVERT;                                            /*@0098VLS*/ 01371000
         BAL   @14,CONVERT                                         0614 01372000
* IF (LRTERRID & '20'X) = '20'X THEN                               0615 01373000
         MVC   @TS00001(1),LRTERRID(R7)                            0615 01374000
         NI    @TS00001,X'20'                                      0615 01375000
         CLI   @TS00001,X'20'                                      0615 01376000
         BNE   @RF00615                                            0615 01377000
*  DO;                                                     /*@0098VLS*/ 01378000
*   NUMBER = 10;  /*ERROR ID IS TEN BYTES LONG               @0098VLS*/ 01379000
         LA    @06,10                                              0617 01380000
         ST    @06,NUMBER                                          0617 01381000
*   ADDNXT = ADDR(ERRORID1); /*WHERE IN THE LINE TO PUT IT   @0098VLS*/ 01382000
         LA    @03,ERRORID1                                        0618 01383000
         ST    @03,ADDNXT                                          0618 01384000
*   NEXTBY = ADDR(RERR);/*LOCATION OF THE ERROR ID(R7 + RECLNGTH + 10*/ 01385000
         LR    @03,R7                                              0619 01386000
         AH    @03,RECLNGTH(,R2)                                   0619 01387000
         SLR   @03,@06                                             0619 01388000
         ST    @03,NEXTBY                                          0619 01389000
*   CALL CONVERT;   /*CONVERT TO PRINTABLE                   @0098VLS*/ 01390000
         BAL   @14,CONVERT                                         0620 01391000
*  END;                                                    /*@0098VLS*/ 01392000
* ELSE                                                             0622 01393000
*  ERRORNA = NOTAPPLY;   /*PUT THE WORDS DOES NOT APPLY      @0098VLS*/ 01394000
         B     @RC00615                                            0622 01395000
@RF00615 MVC   ERRORNA(8),NOTAPPLY                                 0622 01396000
*   IF SFTKEY1 = '40'X                                             0623 01397000
*    THEN                                                          0623 01398000
@RC00615 CLI   SFTKEY1(R7),X'40'                                   0623 01399000
         BNE   @RF00623                                            0623 01400000
*     DO;                                                  /*@Z427VLS*/ 01401000
*      RECTYP1  = SFTABN;                                  /*@Z427VLS*/ 01402000
         MVC   RECTYP1(7),SFTABN                                   0625 01403000
*      SFTABNCT(PTR) = SFTABNCT(PTR) + ONE;                /*@Z427VLS*/ 01404000
         L     @06,PTR                                             0626 01405000
         SLA   @06,2                                               0626 01406000
         L     @03,SFTABNCT-4(@06)                                 0626 01407000
         AL    @03,ONE                                             0626 01408000
         ST    @03,SFTABNCT-4(@06)                                 0626 01409000
*     END;                                                 /*@Z427VLS*/ 01410000
*    ELSE                                                          0628 01411000
*     IF SFTKEY1 = '42'X                                           0628 01412000
*      THEN                                                        0628 01413000
         B     @RC00623                                            0628 01414000
@RF00623 CLI   SFTKEY1(R7),X'42'                                   0628 01415000
         BNE   @RF00628                                            0628 01416000
*       DO;                                                /*@Z427VLS*/ 01417000
*        RECTYP1 = SFTPI;                                  /*@Z427VLS*/ 01418000
         MVC   RECTYP1(7),SFTPI                                    0630 01419000
*        SFTPICT(PTR) = SFTPICT(PTR) + ONE;                /*@Z427VLS*/ 01420000
         L     @06,PTR                                             0631 01421000
         SLA   @06,2                                               0631 01422000
         L     @03,SFTPICT-4(@06)                                  0631 01423000
         AL    @03,ONE                                             0631 01424000
         ST    @03,SFTPICT-4(@06)                                  0631 01425000
*       END;                                               /*@Z427VLS*/ 01426000
*      ELSE                                                        0633 01427000
*       IF SFTKEY1 = '44'X                                         0633 01428000
*        THEN                                                      0633 01429000
         B     @RC00628                                            0633 01430000
@RF00628 CLI   SFTKEY1(R7),X'44'                                   0633 01431000
         BNE   @RF00633                                            0633 01432000
*         DO;                                              /*@Z427VLS*/ 01433000
*          RECTYP1 = SFTRST;                               /*@Z427VLS*/ 01434000
         MVC   RECTYP1(7),SFTRST                                   0635 01435000
*          SFTRSTCT(PTR) = SFTRSTCT(PTR) + ONE;            /*@Z427VLS*/ 01436000
         L     @06,PTR                                             0636 01437000
         SLA   @06,2                                               0636 01438000
         L     @03,SFTRSTCT-4(@06)                                 0636 01439000
         AL    @03,ONE                                             0636 01440000
         ST    @03,SFTRSTCT-4(@06)                                 0636 01441000
*         END;                                             /*@Z427VLS*/ 01442000
*        ELSE                                                      0638 01443000
*         IF SFTKEY1 = '48'X                                       0638 01444000
*          THEN                                                    0638 01445000
         B     @RC00633                                            0638 01446000
@RF00633 CLI   SFTKEY1(R7),X'48'                                   0638 01447000
         BNE   @RF00638                                            0638 01448000
*           DO;                                            /*@Z427VLS*/ 01449000
*            RECTYP1 = SFTMCH;                             /*@Z427VLS*/ 01450000
         MVC   RECTYP1(7),SFTMCH                                   0640 01451000
*            SFTMCHCT(PTR) = SFTMCHCT(PTR) + ONE;          /*@Z427VLS*/ 01452000
         L     @06,PTR                                             0641 01453000
         SLA   @06,2                                               0641 01454000
         L     @03,SFTMCHCT-4(@06)                                 0641 01455000
         AL    @03,ONE                                             0641 01456000
         ST    @03,SFTMCHCT-4(@06)                                 0641 01457000
*           END;                                           /*@Z427VLS*/ 01458000
*          ELSE                                                    0643 01459000
*            IF SFTKEY1 = '4F'X      /*SHORT RECORD SOFT     @ZA27247*/ 01460000
*             THEN                                                 0643 01461000
         B     @RC00638                                            0643 01462000
@RF00638 CLI   SFTKEY1(R7),X'4F'                                   0643 01463000
         BNE   @RF00643                                            0643 01464000
*              DO;                                         /*@ZA27247*/ 01465000
*               RECTYP1 = SFT;                             /*@ZA27247*/ 01466000
         MVC   RECTYP1(7),SFT                                      0645 01467000
*               SFTCT(PTR) = SFTCT(PTR) + ONE;             /*@ZA27247*/ 01468000
         L     @06,PTR                                             0646 01469000
         SLA   @06,2                                               0646 01470000
         L     @03,SFTCT-4(@06)                                    0646 01471000
         AL    @03,ONE                                             0646 01472000
         ST    @03,SFTCT-4(@06)                                    0646 01473000
*               GENERATE;                                  /*@ZA27247*/ 01474000
                 MVC JOBNAME1,=CL8' '                                   01475000
                 MVC LOSTSOFT(54),LOSTMSG                               01476000
*              END;                                        /*@ZA27247*/ 01477000
*             ELSE                                                 0649 01478000
*              DO;                                         /*@ZA27247*/ 01479000
         B     @RC00643                                            0649 01480000
@RF00643 DS    0H                                                  0650 01481000
*               RECTYP1 = SFT;                             /*@ZA27247*/ 01482000
         MVC   RECTYP1(7),SFT                                      0650 01483000
*               SFTCT(PTR) = SFTCT(PTR) + ONE;             /*@ZA27247*/ 01484000
         L     @06,PTR                                             0651 01485000
         SLA   @06,2                                               0651 01486000
         L     @03,SFTCT-4(@06)                                    0651 01487000
         AL    @03,ONE                                             0651 01488000
         ST    @03,SFTCT-4(@06)                                    0651 01489000
*              END;                                        /*@ZA27247*/ 01490000
*   CPU12 = EVLETTER(PTR);                                 /*@Z427VLS*/ 01491000
*                                                                  0653 01492000
@RC00643 DS    0H                                                  0653 01493000
@RC00638 DS    0H                                                  0653 01494000
@RC00633 DS    0H                                                  0653 01495000
@RC00628 DS    0H                                                  0653 01496000
@RC00623 L     @06,PTR                                             0653 01497000
         MH    @06,@CH00080                                        0653 01498000
         L     @03,EVPTR(,R2)                                      0653 01499000
         ALR   @03,@06                                             0653 01500000
         MVC   CPU12(1),EVLETTER-6(@03)                            0653 01501000
*/*EREPSEND  */                                                    0654 01502000
*       GO TO L000113;                                             0654 01503000
         B     L000113                                             0654 01504000
*     END;                                              /*@Z427VLS*/    01505000
* /*******************************************************************/ 01506000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01507000
* /*    THIS CASE WILL HANDLE ALL IPL TYPE RECORDS           @Z427VLS*/ 01508000
*                                                                  0656 01509000
*/*EREPSUB  */                                                     0656 01510000
*L00015:                                                           0656 01511000
*     DO;                                               /*@Z427VLS*/    01512000
L00015   DS    0H                                                  0657 01513000
*     CALL TIME;                     /*CONVERT THE TIME FOR THIS REC */ 01514000
         BAL   @14,TIME                                            0657 01515000
*     RECTYP1 = IPL;                 /*PUT IN THE TYPE OF RECORD     */ 01516000
         MVC   RECTYP1(7),IPL                                      0658 01517000
*     IPLCT(PTR) = IPLCT(PTR) + ONE; /*ADD ONE TO THE IPL COUNTER    */ 01518000
         L     @06,PTR                                             0659 01519000
         LR    @03,@06                                             0659 01520000
         SLA   @03,2                                               0659 01521000
         L     @15,ONE                                             0659 01522000
         L     @14,IPLCT-4(@03)                                    0659 01523000
         ALR   @14,@15                                             0659 01524000
         ST    @14,IPLCT-4(@03)                                    0659 01525000
*     CPU12 = EVLETTER(PTR);         /*MOVE IN THE CPU  LETTER       */ 01526000
         MH    @06,@CH00080                                        0660 01527000
         L     @03,EVPTR(,R2)                                      0660 01528000
         ALR   @03,@06                                             0660 01529000
         MVC   CPU12(1),EVLETTER-6(@03)                            0660 01530000
*     REASON = IPLREAS;              /*MOVE IN THE IPL REASON@ZA24916*/ 01531000
         MVI   REASON+2,C' '                                       0661 01532000
         MVC   REASON+3(3),REASON+2                                0661 01533000
         MVC   REASON(2),IPLREAS(R7)                               0661 01534000
*     NUMBER = ONE;                  /*SET UP # OF BYTES TO CONVERT  */ 01535000
         ST    @15,NUMBER                                          0662 01536000
*     ADDNXT = ADDR(SSYS);           /*SET ADDRESS OF REASON CODE    */ 01537000
         LA    @06,SSYS                                            0663 01538000
         ST    @06,ADDNXT                                          0663 01539000
*     NEXTBY = ADDR(IPLSYSID);       /*SET ADD OF WHERE IN RECORD ID */ 01540000
         LA    @06,IPLSYSID(,R7)                                   0664 01541000
         ST    @06,NEXTBY                                          0664 01542000
*     CALL CONVERT;                  /*GO CONVERT TO PRINTABLE       */ 01543000
         BAL   @14,CONVERT                                         0665 01544000
*     JOBNAME1 = NOTAPPLY;                                 /*@Z427VLS*/ 01545000
*                                                                  0666 01546000
         MVC   JOBNAME1(8),NOTAPPLY                                0666 01547000
*/*EREPSEND  */                                                    0667 01548000
*       GO TO L000113;                                             0667 01549000
         B     L000113                                             0667 01550000
*     END;                                              /*@Z427VLS*/    01551000
* /*******************************************************************/ 01552000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01553000
* /*    THIS CASE WILL HANDLE ALL DDR TYPE RECORDS           @Z427VLS*/ 01554000
*                                                                  0669 01555000
*/*EREPSUB  */                                                     0669 01556000
*L00016:                                                           0669 01557000
*     DO;                                               /*@Z427VLS*/    01558000
L00016   DS    0H                                                  0670 01559000
*    CALL TIME;                 /*MOVE THE TIME INTO THE LINE       */  01560000
         BAL   @14,TIME                                            0670 01561000
*     IF DDRDEPSW = '20'X        /*WAS IT AN OPERATOR REQUEST        */ 01562000
*        THEN                    /*YES IT WAS                @Z427VLS*/ 01563000
         CLI   DDRDEPSW(R7),X'20'                                  0671 01564000
         BNE   @RF00671                                            0671 01565000
*         DO;                                              /*@Z427VLS*/ 01566000
*          RECTYP1 = DDROPR;     /*MOVE DDR-OPR INTO THE PRINT LINE  */ 01567000
         MVC   RECTYP1(7),DDROPR                                   0673 01568000
*          DDROPRCT(PTR) = DDROPRCT(PTR) + ONE;            /*@Z427VLS*/ 01569000
         L     @06,PTR                                             0674 01570000
         SLA   @06,2                                               0674 01571000
         L     @03,DDROPRCT-4(@06)                                 0674 01572000
         AL    @03,ONE                                             0674 01573000
         ST    @03,DDROPRCT-4(@06)                                 0674 01574000
*          JOBNAME1 = DDRJOBID;  /*MOVE IN THE JOB NAME      @Z427VLS*/ 01575000
         MVC   JOBNAME1(8),DDRJOBID(R7)                            0675 01576000
*         END;                                             /*@Z427VLS*/ 01577000
*        ELSE                                                      0677 01578000
*         DO;                                              /*@Z427VLS*/ 01579000
         B     @RC00671                                            0677 01580000
@RF00671 DS    0H                                                  0678 01581000
*          IF DDRDEPSW = '10'X   /*WAS IT A SYSTEM REQUESTED IPL     */ 01582000
*            THEN                                                  0678 01583000
         CLI   DDRDEPSW(R7),X'10'                                  0678 01584000
         BNE   @RF00678                                            0678 01585000
*             DO;                                          /*@Z427VLS*/ 01586000
*              RECTYP1 = DDRSYS; /*MOVE DDR-SYS INTO THE PRINT LINE  */ 01587000
         MVC   RECTYP1(7),DDRSYS                                   0680 01588000
*              DDRSYSCT(PTR) = DDRSYSCT(PTR) + ONE;        /*@Z427VLS*/ 01589000
         L     @06,PTR                                             0681 01590000
         SLA   @06,2                                               0681 01591000
         L     @03,DDRSYSCT-4(@06)                                 0681 01592000
         AL    @03,ONE                                             0681 01593000
         ST    @03,DDRSYSCT-4(@06)                                 0681 01594000
*             END;                                         /*@Z427VLS*/ 01595000
*            ELSE                                                  0683 01596000
*             DO;                                          /*@Z427VLS*/ 01597000
         B     @RC00678                                            0683 01598000
@RF00678 DS    0H                                                  0684 01599000
*              RECTYP1 = DDR;    /*MOVE JUST PLAIN DDR IN TO PRINT   */ 01600000
         MVC   RECTYP1(7),DDR                                      0684 01601000
*              DDRCT(PTR) = DDRCT(PTR) + ONE;              /*@Z427VLS*/ 01602000
         L     @06,PTR                                             0685 01603000
         SLA   @06,2                                               0685 01604000
         L     @03,DDRCT-4(@06)                                    0685 01605000
         AL    @03,ONE                                             0685 01606000
         ST    @03,DDRCT-4(@06)                                    0685 01607000
*             END;                                         /*@Z427VLS*/ 01608000
*         END;                                             /*@Z427VLS*/ 01609000
@RC00678 DS    0H                                                  0688 01610000
*     IF(DDRDEPSW & 'F0'X) = '10'X THEN                            0688 01611000
@RC00671 MVC   @TS00001(1),DDRDEPSW(R7)                            0688 01612000
         NI    @TS00001,X'F0'                                      0688 01613000
         CLI   @TS00001,X'10'                                      0688 01614000
         BNE   @RF00688                                            0688 01615000
*      JOBNAME1 = DDRJOBID;      /*THEN MOVE IN THE JOB NAME @Z427VLS*/ 01616000
         MVC   JOBNAME1(8),DDRJOBID(R7)                            0689 01617000
*     CPU12 = EVLETTER(PTR);     /*MOVE IN CPU LETTER        @Z427VLS*/ 01618000
@RF00688 L     @06,PTR                                             0690 01619000
         MH    @06,@CH00080                                        0690 01620000
         L     @03,EVPTR(,R2)                                      0690 01621000
         ALR   @03,@06                                             0690 01622000
         MVC   CPU12(1),EVLETTER-6(@03)                            0690 01623000
*     DEVCOMP = DDRDEV2;         /*SET UP THE DEVICE TYPE    @Z427VLS*/ 01624000
         MVC   DEVCOMP(2),DDRDEV2(R7)                              0691 01625000
*     CALL DODEVICE;             /*PROCESS THE DEVICE NAME   @Z427VLS*/ 01626000
         BAL   @14,DODEVICE                                        0692 01627000
*     DEVSAVE = DEVTYPE1;        /*SAVE THIS TO MOVE INTO THE PRINT  */ 01628000
         MVC   DEVSAVE(4),DEVTYPE1                                 0693 01629000
*     DEVCOMP = DDRCODE2;        /*SET UP THE FROM DEVICE TYPE       */ 01630000
         MVC   DEVCOMP(2),DDRCODE2(R7)                             0694 01631000
*     CALL DODEVICE;             /*CONVERT THE FROM DEVICE   @Z427VLS*/ 01632000
         BAL   @14,DODEVICE                                        0695 01633000
*     SWITCH1 = ON;              /*SET FOR 1 & 1/2 BYTES OUT OF CONV */ 01634000
         OI    SWITCH1,B'10000000'                                 0696 01635000
*     NUMBER = 2;                /*SET UP TO PROCESS TWO BYTES       */ 01636000
         MVC   NUMBER(4),@CF00073                                  0697 01637000
*     NEXTBY = ADDR(DDRFCUA)+1; /*WHERE TO GET THE CUA       @Z427VLS*/ 01638000
         LA    @06,DDRFCUA(,R7)                                    0698 01639000
         AL    @06,@CF00054                                        0698 01640000
         ST    @06,NEXTBY                                          0698 01641000
*     ADDNXT = ADDR(CUA11);      /*WHERE TO PUT THE CUA      @Z427VLS*/ 01642000
         LA    @06,CUA11                                           0699 01643000
         ST    @06,ADDNXT                                          0699 01644000
*     CALL CONVERT;              /*PUT FROM CUA IN TO LINE   @Z427VLS*/ 01645000
         BAL   @14,CONVERT                                         0700 01646000
*     SWITCH1= ON;               /*SAME DO 1 & 1/2 BYTES     @Z427VLS*/ 01647000
         OI    SWITCH1,B'10000000'                                 0701 01648000
*     NEXTBY = ADDR(DDRTOCUA)+1; /*WHERE TO PUT TO CUA       @Z427VLS*/ 01649000
         LA    @06,DDRTOCUA(,R7)                                   0702 01650000
         AL    @06,@CF00054                                        0702 01651000
         ST    @06,NEXTBY                                          0702 01652000
*     ADDNXT = ADDR(TOCUA);                                /*@Z427VLS*/ 01653000
         LA    @06,TOCUA                                           0703 01654000
         ST    @06,ADDNXT                                          0703 01655000
*     CALL CONVERT;                                        /*@Z427VLS*/ 01656000
         BAL   @14,CONVERT                                         0704 01657000
*     GEN(MVC   CMD1(12),DDRSPEC);                         /*@Z427VLS*/ 01658000
         MVC   CMD1(12),DDRSPEC                                         01659000
*     VOLUME1 = DDRVOL1;/*VOLUME FROM ID                     @Z427VLS*/ 01660000
         MVC   VOLUME1(6),DDRVOL1(R7)                              0706 01661000
*     IF DDRVOL2 ^= BLANK1 THEN  /*WILL BE BLANK IF NOT ANY TO VOLUME*/ 01662000
         CLC   DDRVOL2(6,R7),BLANK1                                0707 01663000
         BE    @RF00707                                            0707 01664000
*     DO;                                                  /*@Z427VLS*/ 01665000
*     GEN(MVC   BB1(2),TOO);     /*MOVE WORD TO INTO THE LINE        */ 01666000
         MVC   BB1(2),TOO                                               01667000
*     R9 = ADDR(DDRVOL2);                                  /*@Z427VLS*/ 01668000
         LA    R9,DDRVOL2(,R7)                                     0710 01669000
*     GEN(MVC  BB1+3(6),0(R9));                            /*@Z427VLS*/ 01670000
         MVC  BB1+3(6),0(R9)                                            01671000
*     END;                                                 /*@Z427VLS*/ 01672000
*                                                                  0712 01673000
*/*EREPSEND  */                                                    0713 01674000
*       GO TO L000113;                                             0713 01675000
         B     L000113                                             0713 01676000
*     END;                                              /*@Z427VLS*/    01677000
* /*******************************************************************/ 01678000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01679000
* /*    THIS CASE WILL HANDLE ALL MIH TYPE RECORDS           @Z427VLS*/ 01680000
*                                                                  0715 01681000
*/*EREPSUB  */                                                     0715 01682000
*L00017:                                                           0715 01683000
*     DO;                                               /*@Z427VLS*/    01684000
L00017   DS    0H                                                  0716 01685000
*     CALL TIME;                /*GO FORMAT THE TIME FROM THE RECORD */ 01686000
         BAL   @14,TIME                                            0716 01687000
*     JOBNAME1 = MIHJOBID;      /*SET UP THE TYPE OF RECORD ONLY 1   */ 01688000
         MVC   JOBNAME1(8),MIHJOBID(R7)                            0717 01689000
*     CPU12 = EVLETTER(PTR);    /*MOVE IN THE CPU LETTER FILT4 BUILT */ 01690000
         L     @06,PTR                                             0718 01691000
         LR    @03,@06                                             0718 01692000
         MH    @03,@CH00080                                        0718 01693000
         L     @01,EVPTR(,R2)                                      0718 01694000
         ALR   @01,@03                                             0718 01695000
         MVC   CPU12(1),EVLETTER-6(@01)                            0718 01696000
*     VOLUME1 = MIHVOL;         /*MOVE IN THE VOLUME NAME    @Z427VLS*/ 01697000
         MVC   VOLUME1(6),MIHVOL(R7)                               0719 01698000
*     IF MIHCEBIT = ON          /*WAS RECORD CAUSED BY CONTROL END   */ 01699000
*       THEN                                                       0720 01700000
         TM    MIHCEBIT(R7),B'10000000'                            0720 01701000
         BNO   @RF00720                                            0720 01702000
*         DO;                                              /*@Z427VLS*/ 01703000
*          RECTYP1 = MIHCE;     /*MAKE THE RECORD TYPE MIH-CE        */ 01704000
         MVC   RECTYP1(7),MIHCE                                    0722 01705000
*          MIHCECT(PTR) = MIHCECT(PTR) + ONE;              /*@Z427VLS*/ 01706000
         SLA   @06,2                                               0723 01707000
         L     @03,MIHCECT-4(@06)                                  0723 01708000
         AL    @03,ONE                                             0723 01709000
         ST    @03,MIHCECT-4(@06)                                  0723 01710000
*         END;                                             /*@Z427VLS*/ 01711000
*       ELSE                                                       0725 01712000
*        DO;                                               /*@Z427VLS*/ 01713000
         B     @RC00720                                            0725 01714000
@RF00720 DS    0H                                                  0726 01715000
*         IF MIHDEBIT = ON      /*WAS RECORD FROM DEVICE END @Z427VLS*/ 01716000
*           THEN                                                   0726 01717000
         TM    MIHDEBIT(R7),B'01000000'                            0726 01718000
         BNO   @RF00726                                            0726 01719000
*            DO;                                           /*@Z427VLS*/ 01720000
*             RECTYP1 = MIHDE;  /*SET RECORD NAME TO MIH-DE  @Z427VLS*/ 01721000
         MVC   RECTYP1(7),MIHDE                                    0728 01722000
*             MIHDECT(PTR) = MIHDECT(PTR) + ONE;           /*@Z427VLS*/ 01723000
         L     @06,PTR                                             0729 01724000
         SLA   @06,2                                               0729 01725000
         L     @03,MIHDECT-4(@06)                                  0729 01726000
         AL    @03,ONE                                             0729 01727000
         ST    @03,MIHDECT-4(@06)                                  0729 01728000
*            END;                                          /*@Z427VLS*/ 01729000
*           ELSE                                                   0731 01730000
*            DO;                                           /*@Z427VLS*/ 01731000
         B     @RC00726                                            0731 01732000
@RF00726 DS    0H                                                  0732 01733000
*             RECTYP1 = MIH;    /*SET TO PLAIN MIH TYPE RECORD       */ 01734000
         MVC   RECTYP1(7),MIH                                      0732 01735000
*             MIHCT(PTR) = MIHCT(PTR) + ONE;               /*@Z427VLS*/ 01736000
         L     @06,PTR                                             0733 01737000
         SLA   @06,2                                               0733 01738000
         L     @03,MIHCT-4(@06)                                    0733 01739000
         AL    @03,ONE                                             0733 01740000
         ST    @03,MIHCT-4(@06)                                    0733 01741000
*            END;                                          /*@Z427VLS*/ 01742000
*        END;                                              /*@Z427VLS*/ 01743000
@RC00726 DS    0H                                                  0736 01744000
*     SWITCH1 = ON;             /*SET TO DROP LAST 1/2 BYTE  @Z427VLS*/ 01745000
@RC00720 OI    SWITCH1,B'10000000'                                 0736 01746000
*     NUMBER = 2 ;              /*SET UP TO PROCESS 2 BYTES OF DATA  */ 01747000
         MVC   NUMBER(4),@CF00073                                  0737 01748000
*     NEXTBY = ADDR(MIHCUA)+ONE;/*LOCATION OF CUA IN THE RECORD      */ 01749000
         LA    @06,MIHCUA(,R7)                                     0738 01750000
         AL    @06,ONE                                             0738 01751000
         ST    @06,NEXTBY                                          0738 01752000
*     ADDNXT = ADDR(CUA11);     /*ADDRESS OF WHERE TO PUT CONVERTED  */ 01753000
         LA    @06,CUA11                                           0739 01754000
         ST    @06,ADDNXT                                          0739 01755000
*     CALL CONVERT;             /*GO CHANGE THE FORMAT OF THE CUA    */ 01756000
         BAL   @14,CONVERT                                         0740 01757000
*     DEVCOMP = MIHCODE2;       /*SET UP THE DEVICE TO CHANGE        */ 01758000
         MVC   DEVCOMP(2),MIHCODE2(R7)                             0741 01759000
*     CALL DODEVICE;            /*PROCESS THE DEVICE NAME    @Z427VLS*/ 01760000
*                                                                  0742 01761000
         BAL   @14,DODEVICE                                        0742 01762000
*/*EREPSEND  */                                                    0743 01763000
*       GO TO L000113;                                             0743 01764000
         B     L000113                                             0743 01765000
*     END;                                              /*@Z427VLS*/    01766000
* /*******************************************************************/ 01767000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01768000
* /*    THIS CASE WILL HANDLE ALL EOD TYPE RECORDS           @Z427VLS*/ 01769000
*                                                                  0745 01770000
*/*EREPSUB  */                                                     0745 01771000
*L00018:                                                           0745 01772000
*     DO;                                               /*@Z427VLS*/    01773000
L00018   DS    0H                                                  0746 01774000
*     CALL TIME;                /*GO FORMAT THE TIME FROM THE RECORD */ 01775000
         BAL   @14,TIME                                            0746 01776000
*     CPU12 = EVLETTER(PTR);    /*MOVE IN THE LETTER FILT4 ASSIGNED  */ 01777000
         L     @06,PTR                                             0747 01778000
         LR    @03,@06                                             0747 01779000
         MH    @03,@CH00080                                        0747 01780000
         L     @01,EVPTR(,R2)                                      0747 01781000
         ALR   @01,@03                                             0747 01782000
         MVC   CPU12(1),EVLETTER-6(@01)                            0747 01783000
*     RECTYP1 = EOD;            /*SET THE RECORD TYPE TO PLAIN EOD   */ 01784000
         MVC   RECTYP1(7),EOD                                      0748 01785000
*     EODCT(PTR) = EODCT(PTR) + ONE;                       /*@Z427VLS*/ 01786000
         SLA   @06,2                                               0749 01787000
         L     @03,EODCT-4(@06)                                    0749 01788000
         AL    @03,ONE                                             0749 01789000
         ST    @03,EODCT-4(@06)                                    0749 01790000
*     JOBNAME1 = NOTAPPLY;                                 /*@Z427VLS*/ 01791000
*                                                                  0750 01792000
         MVC   JOBNAME1(8),NOTAPPLY                                0750 01793000
*/*EREPSEND  */                                                    0751 01794000
*       GO TO L000113;                                             0751 01795000
         B     L000113                                             0751 01796000
*     END;                                              /*@Z427VLS*/    01797000
* /*******************************************************************/ 01798000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01799000
* /*    THIS CASE WILL HANDLE ALL MDR TYPE RECORDS           @Z427VLS*/ 01800000
*                                                                  0753 01801000
*/*EREPSUB  */                                                     0753 01802000
*L00019:                                                           0753 01803000
*     DO;                                               /*@Z427VLS*/    01804000
L00019   DS    0H                                                  0754 01805000
*    CALL TIME;                     /*GO FORMAT THE TIME FROM RECORD */ 01806000
         BAL   @14,TIME                                            0754 01807000
*    CPU12 = EVLETTER(PTR);         /*MOVE IN THE LETTER FILT4 BUILT */ 01808000
         L     @06,PTR                                             0755 01809000
         MH    @06,@CH00080                                        0755 01810000
         L     @03,EVPTR(,R2)                                      0755 01811000
         ALR   @03,@06                                             0755 01812000
         MVC   CPU12(1),EVLETTER-6(@03)                            0755 01813000
*    SWITCH1 = ON;                  /*SET SWITCH SO 1/2 BYTE IS DROP */ 01814000
         OI    SWITCH1,B'10000000'                                 0756 01815000
*    NUMBER = TWO;                  /*SET TO PROCESS TWO BYTES       */ 01816000
         L     @06,TWO                                             0757 01817000
         ST    @06,NUMBER                                          0757 01818000
*    ADDNXT = ADDR(CUA11);          /*SET UP THE ADDRESS TO PUT IT   */ 01819000
         LA    @06,CUA11                                           0758 01820000
         ST    @06,ADDNXT                                          0758 01821000
*    NEXTBY = ADDR(TPRCUA);         /*SET UP WHERE TO FIND THE DATA  */ 01822000
         LA    @06,TPRCUA(,R7)                                     0759 01823000
         ST    @06,NEXTBY                                          0759 01824000
*    CALL CONVERT;                  /*GO CONVERT THE DATA TO PRINT   */ 01825000
         BAL   @14,CONVERT                                         0760 01826000
* DEVTYPE1 = UKNO;                                         /*@G51DGGB*/ 01827000
         MVC   DEVTYPE1(4),UKNO                                    0761 01828000
* CALL IFCDEVIC(32,TPRDEV,DEVTYPE1);                       /*@G51DGGB*/ 01829000
         MVC   @AL00001(12),@AL00762                               0762 01830000
         LA    @06,TPRDEV(,R7)                                     0762 01831000
         ST    @06,@AL00001+4                                      0762 01832000
         L     @15,@CV01334                                        0762 01833000
         LA    @01,@AL00001                                        0762 01834000
         BALR  @14,@15                                             0762 01835000
*    JOBNAME1 = NOTAPPLY;           /*DOES NOT APPLY FOR MDR RECORDS */ 01836000
         MVC   JOBNAME1(8),NOTAPPLY                                0763 01837000
*    IF TPRDEV = '01'X |            /*IS THIS A DASD DEVICE  @Z427VLS*/ 01838000
*       TPRDEV = '02'X |                                           0764 01839000
*       TPRDEV = '09'X |                                           0764 01840000
*       TPRDEV = '0A'X |                                           0764 01841000
*       TPRDEV = '0E'X |                                           0764 01842000
*       TPRDEV = '11'X |                                           0764 01843000
*       TPRDEV = '12'X                                             0764 01844000
*         THEN                                                     0764 01845000
         CLI   TPRDEV(R7),X'01'                                    0764 01846000
         BE    @RT00764                                            0764 01847000
         CLI   TPRDEV(R7),X'02'                                    0764 01848000
         BE    @RT00764                                            0764 01849000
         CLI   TPRDEV(R7),X'09'                                    0764 01850000
         BE    @RT00764                                            0764 01851000
         CLI   TPRDEV(R7),X'0A'                                    0764 01852000
         BE    @RT00764                                            0764 01853000
         CLI   TPRDEV(R7),X'0E'                                    0764 01854000
         BE    @RT00764                                            0764 01855000
         CLI   TPRDEV(R7),X'11'                                    0764 01856000
         BE    @RT00764                                            0764 01857000
         CLI   TPRDEV(R7),X'12'                                    0764 01858000
         BNE   @RF00764                                            0764 01859000
@RT00764 DS    0H                                                  0765 01860000
*           DO;                                            /*@Z427VLS*/ 01861000
*    VOLUME1 = TPRVOL;              /*PUT IN THE VOLID       @Z427VLS*/ 01862000
         MVC   VOLUME1(6),TPRVOL(R7)                               0766 01863000
*            RECTYP1 = MDRDAS;                             /*@Z427VLS*/ 01864000
         MVC   RECTYP1(7),MDRDAS                                   0767 01865000
*            MDRDASCT(PTR) = MDRDASCT(PTR) + ONE;          /*@Z427VLS*/ 01866000
         L     @06,PTR                                             0768 01867000
         SLA   @06,2                                               0768 01868000
         L     @03,MDRDASCT-4(@06)                                 0768 01869000
         AL    @03,ONE                                             0768 01870000
         ST    @03,MDRDASCT-4(@06)                                 0768 01871000
*            NUMBER = 16;            /*NUMBER OF BYTES TO DO @Z427VLS*/ 01872000
         MVC   NUMBER(4),@CF00088                                  0769 01873000
*            NEXTBY = ADDR(TPRVOL) + (TPRBUFC &'0F'X) + 14;/*@Z427VLS*/ 01874000
         LA    @06,TPRVOL(,R7)                                     0770 01875000
         LA    @03,15                                              0770 01876000
         SLR   @15,@15                                             0770 01877000
         IC    @15,TPRBUFC(,R7)                                    0770 01878000
         NR    @03,@15                                             0770 01879000
         ALR   @06,@03                                             0770 01880000
         AL    @06,@CF01340                                        0770 01881000
         ST    @06,NEXTBY                                          0770 01882000
*            ADDNXT = ADDR(TEMPSAVE);/*ADDRESS OF WHERE TO PUT IT    */ 01883000
         LA    @06,TEMPSAVE                                        0771 01884000
         ST    @06,ADDNXT                                          0771 01885000
*            CALL CONVERT;           /*GO CONVERT TO PRINTABLE       */ 01886000
         BAL   @14,CONVERT                                         0772 01887000
*            GENERATE;                                     /*@Z427VLS*/ 01888000
              MVC  SENSEA3(8),TEMPSAVE                                  01889000
              MVC  SENSEA4(8),TEMPSAVE+8                                01890000
              MVC  SENSEA5(8),TEMPSAVE+16                               01891000
              MVC  SENSEA6(8),TEMPSAVE+24                               01892000
*           END;                                           /*@Z427VLS*/ 01893000
*          ELSE                                                    0775 01894000
*           DO;                                            /*@Z427VLS*/ 01895000
         B     @RC00764                                            0775 01896000
@RF00764 DS    0H                                                  0776 01897000
*           MDRCT(PTR) = MDRCT(PTR) + ONE;                 /*@Z427VLS*/ 01898000
         L     @06,PTR                                             0776 01899000
         SLA   @06,2                                               0776 01900000
         L     @03,MDRCT-4(@06)                                    0776 01901000
         AL    @03,ONE                                             0776 01902000
         ST    @03,MDRCT-4(@06)                                    0776 01903000
*           RECTYP1 = MDR;                                 /*@Z427VLS*/ 01904000
         MVC   RECTYP1(7),MDR                                      0777 01905000
*           END;                                           /*@Z427VLS*/ 01906000
*                                                                  0778 01907000
*/*EREPSEND  */                                                    0779 01908000
*       GO TO L000113;                                             0779 01909000
         B     L000113                                             0779 01910000
*     END;                                              /*@Z427VLS*/    01911000
*/*EREPSUB  */                                                     0781 01912000
*L000110:                                                          0781 01913000
*   DO;                                                 /*@G51DGGB*/    01914000
L000110  DS    0H                                                  0782 01915000
* CALL FRAME;                                              /*@G51DGGB*/ 01916000
         BAL   @14,FRAME                                           0782 01917000
*/*EREPSEND  */                                                    0783 01918000
*     GO TO L000113;                                               0783 01919000
         B     L000113                                             0783 01920000
*   END;                                                /*@G51DGGB*/    01921000
*/*EREPSUB  */                                                     0785 01922000
*L000111:                                                          0785 01923000
*   DO;                                                 /*@G51DGGB*/    01924000
L000111  DS    0H                                                  0786 01925000
* CALL FRAME;                                              /*@G51DGGB*/ 01926000
         BAL   @14,FRAME                                           0786 01927000
*/*EREPSEND  */                                                    0787 01928000
*     GO TO L000113;                                               0787 01929000
         B     L000113                                             0787 01930000
*   END;                                                /*@G51DGGB*/    01931000
*/*EREPCEND  */                                                    0789 01932000
*L000112:;                                                         0789 01933000
*L000113:;                                                /*@Z427VLS*/  01934000
*END;                                                      /*@Z427VLS*/ 01935000
@EL00010 DS    0H                                                  0791 01936000
@EF00010 DS    0H                                                  0791 01937000
@ER00010 LM    @14,@12,@SA00010                                    0791 01938000
         BR    @14                                                 0791 01939000
*OBRISPRM: PROC;                                           /*@Z427VLS*/ 01940000
OBRISPRM STM   @14,@12,@SA00011                                    0792 01941000
* /*******************************************************************/ 01942000
*/** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 01943000
* /*    THIS PROC WILL PROCESS ALL OBR RECORDS WITH PERM ERROR       */ 01944000
*       GEN(MVI  TEMPSAVE,X'40');                          /*@Z427VLS*/ 01945000
         MVI  TEMPSAVE,X'40'                                            01946000
*       GEN(MVC  TEMPSAVE+1(71),TEMPSAVE);                 /*@Z427VLS*/ 01947000
         MVC  TEMPSAVE+1(71),TEMPSAVE                                   01948000
*              NUMBER = 1;            /*SET UP TO DO 1 BYTE  @Z427VLS*/ 01949000
         MVC   NUMBER(4),@CF00054                                  0795 01950000
*              ADDNXT = ADDR(CMD1);   /*SET UP FOR CCW FIRST BYTE    */ 01951000
         LA    @06,CMD1                                            0796 01952000
         ST    @06,ADDNXT                                          0796 01953000
*              NEXTBY = ADDR(OBRSRDS);/*ADDRESS OF WHERE THE DATA IS */ 01954000
         LA    @06,OBRSRDS(,R7)                                    0797 01955000
         ST    @06,NEXTBY                                          0797 01956000
*              CALL CONVERT;          /*GO CONVERT THE CCMDTTO PRINT */ 01957000
         BAL   @14,CONVERT                                         0798 01958000
*       NUMBER = 2;                                        /*@Z427VLS*/ 01959000
         MVC   NUMBER(4),@CF00073                                  0799 01960000
*       ADDNXT = ADDR(CSW1);          /*SET UP TO CONVERT THE CSW    */ 01961000
         LA    @06,CSW1                                            0800 01962000
         ST    @06,ADDNXT                                          0800 01963000
*       NEXTBY = ADDR(OBRSTAT);       /*ADDRESS OF DATA TO CONVERT   */ 01964000
         LA    @06,OBRSTAT(,R7)                                    0801 01965000
         ST    @06,NEXTBY                                          0801 01966000
*       CALL CONVERT;                 /*CALL TO CONVERT THE DATA     */ 01967000
         BAL   @14,CONVERT                                         0802 01968000
*       NEXTBY = ADDR(OBRVOL) + EIGHT * OBRDEVDC  + OBRLSDRC;      0803 01969000
         LA    @06,OBRVOL(,R7)                                     0803 01970000
         SLR   @03,@03                                             0803 01971000
         IC    @03,OBRDEVDC(,R7)                                   0803 01972000
         SLA   @03,3                                               0803 01973000
         ALR   @06,@03                                             0803 01974000
         SLR   @03,@03                                             0803 01975000
         IC    @03,OBRLSDRC(,R7)                                   0803 01976000
         ALR   @06,@03                                             0803 01977000
         ST    @06,NEXTBY                                          0803 01978000
*       ADDNXT = ADDR(TEMPSAVE) ;     /*SET UP SPECIAL TO CONVERT TO */ 01979000
         LA    @06,TEMPSAVE                                        0804 01980000
         ST    @06,ADDNXT                                          0804 01981000
*       NUMBER = OBRSBCNT;            /*SET UP NUMBER OF SENSE BYTES */ 01982000
         SLR   @06,@06                                             0805 01983000
         ICM   @06,3,OBRSBCNT(R7)                                  0805 01984000
         ST    @06,NUMBER                                          0805 01985000
*       IF NUMBER > 40 THEN                                        0806 01986000
         LA    @03,40                                              0806 01987000
         CR    @06,@03                                             0806 01988000
         BNH   @RF00806                                            0806 01989000
*         NUMBER = 40;                                     /*@Z427VLS*/ 01990000
         ST    @03,NUMBER                                          0807 01991000
*       CALL CONVERT;                 /*GO AND CONVERT THE NUMBERS   */ 01992000
@RF00806 BAL   @14,CONVERT                                         0808 01993000
*       GENERATE;                                          /*@Z427VLS*/ 01994000
          MVC    SENSEA1(8),TEMPSAVE                                    01995000
          MVC    SENSEA2(8),TEMPSAVE+8                                  01996000
          MVC    SENSEA3(8),TEMPSAVE+16                                 01997000
          MVC    SENSEA4(8),TEMPSAVE+24                                 01998000
          MVC    SENSEA5(8),TEMPSAVE+32                                 01999000
          MVC    SENSEA6(8),TEMPSAVE+40                                 02000000
          MVC    SENSEA7(8),TEMPSAVE+48                                 02001000
          MVC    SENSEA8(8),TEMPSAVE+56                                 02002000
*       IF OBRSBCNT ^> 24 THEN       /*HAVE WE MESSED UP REST OF LINE*/ 02003000
         CLC   OBRSBCNT(2,R7),@CH00222                             0810 02004000
         BH    @RF00810                                            0810 02005000
*         DO;                                              /*@Z427VLS*/ 02006000
*          IF OBRDEVDC ^= ZERO THEN  /*IF NO DEV DEP INFO DONT MOVE  */ 02007000
         CLI   OBRDEVDC(R7),0                                      0812 02008000
         BE    @RF00812                                            0812 02009000
*           DO;                                            /*@Z427VLS*/ 02010000
*            IF OBRCLASS = '80'X |                                 0814 02011000
*                    OBRDEV = '0843'X |                            0814 02012000
*               OBRDEV   = '0842'X|                                0814 02013000
*               OBRCLASS = '20'X THEN                              0814 02014000
         CLI   OBRCLASS(R7),X'80'                                  0814 02015000
         BE    @RT00814                                            0814 02016000
         CLC   OBRDEV(2,R7),@CB01352                               0814 02017000
         BE    @RT00814                                            0814 02018000
         CLC   OBRDEV(2,R7),@CB01353                               0814 02019000
         BE    @RT00814                                            0814 02020000
         CLI   OBRCLASS(R7),X'20'                                  0814 02021000
         BNE   @RF00814                                            0814 02022000
@RT00814 DS    0H                                                  0815 02023000
*                 VOLUME1 = OBRVOL;                        /*@Z427VLS*/ 02024000
         MVC   VOLUME1(6),OBRVOL(R7)                               0815 02025000
*           END;                                           /*@Z427VLS*/ 02026000
@RF00814 DS    0H                                                  0817 02027000
*          IF OBRCLASS = '20'X THEN                                0817 02028000
@RF00812 CLI   OBRCLASS(R7),X'20'                                  0817 02029000
         BNE   @RF00817                                            0817 02030000
*           DO;                                            /*@Z427VLS*/ 02031000
*           TEMPSAVE = TEMPSAVE && TEMPSAVE;/*CLEAR AREA     @Z427VLS*/ 02032000
         XC    TEMPSAVE(84),TEMPSAVE                               0819 02033000
*           NUMBER = SEVEN;          /*SET UP TO CONVERT 7 BYTES     */ 02034000
         L     @06,SEVEN                                           0820 02035000
         ST    @06,NUMBER                                          0820 02036000
*           NEXTBY = ADDR(OBRSEEK)+3;/*ADDRESS OF WHERE TO PUT DATA  */ 02037000
         LA    @06,OBRSEEK(,R7)                                    0821 02038000
         AL    @06,@CF00075                                        0821 02039000
         ST    @06,NEXTBY                                          0821 02040000
*           ADDNXT = ADDR(TEMPSAVE); /*WHERE IT'S ALL AT     @Z427VLS*/ 02041000
         LA    @06,TEMPSAVE                                        0822 02042000
         ST    @06,ADDNXT                                          0822 02043000
*           CALL CONVERT;            /*GO CONVERT THE DATA TO PRINT  */ 02044000
         BAL   @14,CONVERT                                         0823 02045000
*           GENERATE;                                      /*@Z427VLS*/ 02046000
              MVC    BB1(4),TEMPSAVE                                    02047000
              MVC    CC1(4),TEMPSAVE+4                                  02048000
              MVC    HH1(4),TEMPSAVE+8                                  02049000
              MVC    R111(2),TEMPSAVE+12                                02050000
*           END;                                           /*@Z427VLS*/ 02051000
*          END;                                            /*@Z427VLS*/ 02052000
*   END;                                                   /*@Z427VLS*/ 02053000
@EL00011 DS    0H                                                  0827 02054000
@EF00011 DS    0H                                                  0827 02055000
@ER00011 LM    @14,@12,@SA00011                                    0827 02056000
         BR    @14                                                 0827 02057000
*DODEVICE: PROC;                                           /*@Z427VLS*/ 02058000
DODEVICE STM   @14,@12,@SA00012                                    0828 02059000
* DEVTYPE1 = UKNO;                  /*IF NO MATCH TELL EVERYONE      */ 02060000
         MVC   DEVTYPE1(4),UKNO                                    0829 02061000
* CALL IFCDEVIC(22,DEVCOMP,DEVTYPE1);                      /*@G51DGGB*/ 02062000
         L     @15,@CV01334                                        0830 02063000
         LA    @01,@AL00830                                        0830 02064000
         BALR  @14,@15                                             0830 02065000
*END;                                                      /*@Z427VLS*/ 02066000
@EL00012 DS    0H                                                  0831 02067000
@EF00012 DS    0H                                                  0831 02068000
@ER00012 LM    @14,@12,@SA00012                                    0831 02069000
         BR    @14                                                 0831 02070000
*FRAME: PROC;                                              /*@G51DGGB*/ 02071000
FRAME    STM   @14,@12,@SA00013                                    0832 02072000
* DCL FRAMEMCH  CHAR(7) INIT('FRM-MCH');                   /*@G51DGGB*/ 02073000
* DCL FRAMECCH  CHAR(7) INIT('FRM-CCH');                   /*@G51DGGB*/ 02074000
* DCL FRMTEMP  CHAR(7) INIT(' ');                          /*@G51DGGB*/ 02075000
* DCL LAST CHAR(1) BASED(R7+6);                            /*@G51DGGB*/ 02076000
* CALL TIME;            /*PUT THE TIME IN THE PRINTLINE      @G51DGGB*/ 02077000
         BAL   @14,TIME                                            0837 02078000
* CPU12  = EVLETTER(PTR);                                  /*@G51DGGB*/ 02079000
         L     @06,PTR                                             0838 02080000
         MH    @06,@CH00080                                        0838 02081000
         L     @03,EVPTR(,R2)                                      0838 02082000
         ALR   @03,@06                                             0838 02083000
         MVC   CPU12(1),EVLETTER-6(@03)                            0838 02084000
* IF CURRENT = 10 THEN                                             0839 02085000
         CLC   CURRENT(4),@CF00032                                 0839 02086000
         BNE   @RF00839                                            0839 02087000
*  RECTYP1 = FRAMEMCH;                                     /*@G51DGGB*/ 02088000
         MVC   RECTYP1(7),FRAMEMCH                                 0840 02089000
* ELSE                                                             0841 02090000
*  RECTYP1 = FRAMECCH;                                     /*@G51DGGB*/ 02091000
         B     @RC00839                                            0841 02092000
@RF00839 MVC   RECTYP1(7),FRAMECCH                                 0841 02093000
* NUMBER = THREE ;          /*SET FOR THREE BYTES TO BE CONVERTED*/     02094000
@RC00839 MVC   NUMBER(4),@CF00075                                  0842 02095000
* ADDNXT = ADDR(FRMTEMP);   /*ADDRESS OF THE TEMPORARY LOCATION  */     02096000
         LA    @06,FRMTEMP                                         0843 02097000
         ST    @06,ADDNXT                                          0843 02098000
* NEXTBY = R7 + 1865;       /*THE INFO IS IN THE LAST LINE OF THE */    02099000
         LA    @06,1865                                            0844 02100000
         ALR   @06,R7                                              0844 02101000
         ST    @06,NEXTBY                                          0844 02102000
* CALL CONVERT;             /*CONVERT THEE FRAME INFO TO PRINTABLE*/    02103000
         BAL   @14,CONVERT                                         0845 02104000
* GEN(MVC CUA12+2(2),FRMTEMP);/*MOVE THE GROUP NUMBER        @G51DGGB*/ 02105000
         MVC CUA12+2(2),FRMTEMP                                         02106000
* GEN(MVC CUA12+10(2),FRMTEMP+2);/*MOVE THE FRAME NUMBER     @G51DGGB*/ 02107000
         MVC CUA12+10(2),FRMTEMP+2                                      02108000
* GEN(MVC CUA12+19(2),FRMTEMP+4);/*MOVE THE EC LEVEL INTO THE PRINT L*/ 02109000
         MVC CUA12+19(2),FRMTEMP+4                                      02110000
* BNDECNUM = 2;                                            /*@G51DGGB*/ 02111000
         MVC   BNDECNUM(4),@CF00073                                0849 02112000
* BINWORD = LAST;                                          /*@G51DGGB*/ 02113000
         SLR   @06,@06                                             0850 02114000
         IC    @06,LAST+6(,R7)                                     0850 02115000
         ST    @06,BINWORD                                         0850 02116000
* DECADDR= ADDR(SENSEA2);                                  /*@G51DGGB*/ 02117000
         LA    @06,SENSEA2                                         0851 02118000
         ST    @06,DECADDR                                         0851 02119000
* CALL CONVBIN;                                            /*@G51DGGB*/ 02120000
         BAL   @14,CONVBIN                                         0852 02121000
* IF (LRTSMS & '80'X) = '00'X THEN                                 0853 02122000
         MVC   @TS00001(1),LRTSMS(R7)                              0853 02123000
         NI    @TS00001,X'80'                                      0853 02124000
         CLI   @TS00001,X'00'                                      0853 02125000
         BNE   @RF00853                                            0853 02126000
*  GEN(MVI  SENSEA3,X'5C');                                /*@G51DGGB*/ 02127000
         MVI  SENSEA3,X'5C'                                             02128000
*END;                                                      /*@G51DGGB*/ 02129000
@EL00013 DS    0H                                                  0855 02130000
@EF00013 DS    0H                                                  0855 02131000
@ER00013 LM    @14,@12,@SA00013                                    0855 02132000
         BR    @14                                                 0855 02133000
* /*******************************************************************/ 02134000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02135000
* /*    THIS PROC WILL DETERMINE WHICH HEADING TO PRINT      @Z427VLS*/ 02136000
*HEADING:  PROC;                                           /*@Z427VLS*/ 02137000
HEADING  STM   @14,@12,@SA00014                                    0856 02138000
*  IF MYLINECT > LINECT - TWO THEN   /*IS IT TIME FOR A NEW HEADING  */ 02139000
         LH    @06,LINECT(,R2)                                     0857 02140000
         SL    @06,TWO                                             0857 02141000
         CH    @06,MYLINECT                                        0857 02142000
         BNL   @RF00857                                            0857 02143000
*      DO;                                                 /*@Z427VLS*/ 02144000
*       MYLINECT = MINUS1;           /*RESET THE COUNT TO -1 @Z427VLS*/ 02145000
         L     @06,MINUS1                                          0859 02146000
         STH   @06,MYLINECT                                        0859 02147000
*       SPACING = UPSPACE;           /*UP TO A NEW PAGE      @Z427VLS*/ 02148000
         MVC   SPACING(1),UPSPACE                                  0860 02149000
*       CALL PRINTIT;                /*SPACE TO A NEW PAGE   @Z427VLS*/ 02150000
         BAL   @14,PRINTIT                                         0861 02151000
*       SPACING = SINGLE;            /*RETURN TO NORMAL CC CONTROL   */ 02152000
         MVC   SPACING(1),SINGLE                                   0862 02153000
*      END;                                                /*@Z427VLS*/ 02154000
* IF DEBUG5 = ON                 /*DO THEY WANT HEADING FOR EACH REC */ 02155000
*   THEN                                                           0864 02156000
@RF00857 TM    DEBUG5(R2),B'00000100'                              0864 02157000
         BNO   @RF00864                                            0864 02158000
*     CALL BUGHEAD;              /*GO DETERMINE THE TYPE OF HEADING  */ 02159000
         BAL   @14,BUGHEAD                                         0865 02160000
*   ELSE                                                           0866 02161000
*     CALL TYPEHEAD;             /*GO OUTPUT THE NORMAL HEADING      */ 02162000
         B     @RC00864                                            0866 02163000
@RF00864 BAL   @14,TYPEHEAD                                        0866 02164000
* DUPLICAT = LINE04;                 /*THIS PART OF HEADING IS STAND */ 02165000
@RC00864 MVC   DUPLICAT(33),LINE04                                 0867 02166000
* CALL PRINTIT;                  /*PRINT OUT HEADING SELECTED        */ 02167000
         BAL   @14,PRINTIT                                         0868 02168000
*IF DEBUG5 = OFF &            /*PUT DATE AT THE TOP OF THE PAGE */ 0869 02169000
*   Y ^= ZERO THEN            /*NOT FIRST TIME THROUGH       @0001VLS*/ 02170000
         TM    DEBUG5(R2),B'00000100'                              0869 02171000
         BNZ   @RF00869                                            0869 02172000
         L     @06,Y                                               0869 02173000
         LTR   @06,@06                                             0869 02174000
         BZ    @RF00869                                            0869 02175000
* CALL NEWDATE;               /*PRINT THE DATE OF CURRENT RECORD*/ 0870 02176000
         BAL   @14,NEWDATE                                         0870 02177000
*END;                                                      /*@Z427VLS*/ 02178000
@EL00014 DS    0H                                                  0871 02179000
@EF00014 DS    0H                                                  0871 02180000
@ER00014 LM    @14,@12,@SA00014                                    0871 02181000
         BR    @14                                                 0871 02182000
* /*******************************************************************/ 02183000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02184000
* /*    THIS PROC WILL HANDLE ALL MCH TYPE HEADERS           @Z427VLS*/ 02185000
*MCHHEDER:  PROC;                                          /*@Z427VLS*/ 02186000
MCHHEDER STM   @14,@12,12(@13)                                     0872 02187000
*DCL PSWMCH1 CHAR(77) DEFINED(PSWMCH);                     /*@0098VLS*/ 02188000
*PSWMCH1 = LINE8;                                          /*@0098VLS*/ 02189000
         MVC   PSWMCH1(77),LINE8                                   0874 02190000
*END;                                                      /*@Z427VLS*/ 02191000
@EL00015 DS    0H                                                  0875 02192000
@EF00015 DS    0H                                                  0875 02193000
@ER00015 LM    @14,@12,12(@13)                                     0875 02194000
         BR    @14                                                 0875 02195000
* /*******************************************************************/ 02196000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02197000
* /*    THIS PROC WILL HANDLE ALL CHH TYPE HEADERS           @Z427VLS*/ 02198000
*CCHHEDER: PROC;                                           /*@Z427VLS*/ 02199000
CCHHEDER STM   @14,@12,12(@13)                                     0876 02200000
*   CCHFINSH = LINE1;             /*SET UP REST OF CCH HEADING       */ 02201000
         MVC   CCHFINSH(18),LINE1                                  0877 02202000
*END;                                                      /*@Z427VLS*/ 02203000
@EL00016 DS    0H                                                  0878 02204000
@EF00016 DS    0H                                                  0878 02205000
@ER00016 LM    @14,@12,12(@13)                                     0878 02206000
         BR    @14                                                 0878 02207000
* /*******************************************************************/ 02208000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02209000
* /*    THIS PROC WILL HANDLE ALL OBR TYPE HEADERS           @Z427VLS*/ 02210000
*OBRHEDER: PROC;                                           /*@Z427VLS*/ 02211000
OBRHEDER STM   @14,@12,12(@13)                                     0879 02212000
*   OBRFINSH = LINE5;             /*SET UP THE REST OF OBR HEADING   */ 02213000
         MVC   OBRFINSH(98),LINE5                                  0880 02214000
*END;                                                      /*@Z427VLS*/ 02215000
@EL00017 DS    0H                                                  0881 02216000
@EF00017 DS    0H                                                  0881 02217000
@ER00017 LM    @14,@12,12(@13)                                     0881 02218000
         BR    @14                                                 0881 02219000
* /*******************************************************************/ 02220000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02221000
* /*    THIS PROC WILL HANDLE ALL SFT TYPE HEADERS           @Z427VLS*/ 02222000
*SFTHEDER: PROC;                                           /*@Z427VLS*/ 02223000
SFTHEDER STM   @14,@12,12(@13)                                     0882 02224000
* SFTFINSH = LINE66;                                       /*@0098VLS*/ 02225000
         MVC   SFTFINSH(78),LINE66                                 0883 02226000
*END;                                                      /*@Z427VLS*/ 02227000
@EL00018 DS    0H                                                  0884 02228000
@EF00018 DS    0H                                                  0884 02229000
@ER00018 LM    @14,@12,12(@13)                                     0884 02230000
         BR    @14                                                 0884 02231000
* /*******************************************************************/ 02232000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02233000
* /*    THIS PROC WILL HANDLE ALL IPL TYPE HEADERS           @Z427VLS*/ 02234000
*IPLHEDER: PROC;                                           /*@Z427VLS*/ 02235000
IPLHEDER STM   @14,@12,12(@13)                                     0885 02236000
*   IPLFINSH = LINE7;             /*SET UP THE REST OF IPL HEADING   */ 02237000
         MVC   IPLFINSH(17),LINE7                                  0886 02238000
*END;                                                      /*@Z427VLS*/ 02239000
@EL00019 DS    0H                                                  0887 02240000
@EF00019 DS    0H                                                  0887 02241000
@ER00019 LM    @14,@12,12(@13)                                     0887 02242000
         BR    @14                                                 0887 02243000
* /*******************************************************************/ 02244000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02245000
* /*    THIS CASE WILL HANDLE ALL DDR TYPE HEADERS           @Z427VLS*/ 02246000
*DDRHEDER: PROC;                                           /*@Z427VLS*/ 02247000
DDRHEDER STM   @14,@12,@SA00020                                    0888 02248000
*   GEN(MVC  CUA12(104),LINE3);   /*SET UP THE REST OF IPL HEADING   */ 02249000
         MVC  CUA12(104),LINE3                                          02250000
*END;                                                      /*@Z427VLS*/ 02251000
@EL00020 DS    0H                                                  0890 02252000
@EF00020 DS    0H                                                  0890 02253000
@ER00020 LM    @14,@12,@SA00020                                    0890 02254000
         BR    @14                                                 0890 02255000
* /*******************************************************************/ 02256000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02257000
* /*    THIS PROC WILL HANDLE ALL MIH TYPE HEADERS           @Z427VLS*/ 02258000
*MIHHEDER: PROC;                                           /*@Z427VLS*/ 02259000
MIHHEDER STM   @14,@12,@SA00021                                    0891 02260000
*   GEN(MVC  CUA12(104),LINE3);   /*SET UP THE REST OF DDR HEADING   */ 02261000
         MVC  CUA12(104),LINE3                                          02262000
*END;                                                      /*@Z427VLS*/ 02263000
@EL00021 DS    0H                                                  0893 02264000
@EF00021 DS    0H                                                  0893 02265000
@ER00021 LM    @14,@12,@SA00021                                    0893 02266000
         BR    @14                                                 0893 02267000
* /*******************************************************************/ 02268000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02269000
* /*    THIS PROC WILL HANDLE ALL EOD TYPE HEADERS           @Z427VLS*/ 02270000
*EODHEDER: PROC;                                           /*@Z427VLS*/ 02271000
EODHEDER STM   @14,@12,12(@13)                                     0894 02272000
*    /*NOTHING IS REQUIRED AT THIS TIME                      @Z427VLS*/ 02273000
*END;                                                      /*@Z427VLS*/ 02274000
@EL00022 DS    0H                                                  0895 02275000
@EF00022 DS    0H                                                  0895 02276000
@ER00022 LM    @14,@12,12(@13)                                     0895 02277000
         BR    @14                                                 0895 02278000
* /*******************************************************************/ 02279000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02280000
* /*    THIS PROC WILL HANDLE ALL MDR TYPE HEADERS           @Z427VLS*/ 02281000
*MDRHEDER: PROC;                                           /*@Z427VLS*/ 02282000
MDRHEDER STM   @14,@12,12(@13)                                     0896 02283000
*   NEWMDR   = LINE3;        /*SAME AS DDR TYPE RECORD       @Z427VLS*/ 02284000
         MVC   NEWMDR(104),LINE3                                   0897 02285000
*END;                                                      /*@Z427VLS*/ 02286000
@EL00023 DS    0H                                                  0898 02287000
@EF00023 DS    0H                                                  0898 02288000
@ER00023 LM    @14,@12,12(@13)                                     0898 02289000
         BR    @14                                                 0898 02290000
* /*******************************************************************/ 02291000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02292000
* /*    THIS CASE WILL HANDLE ALL MDR & OBR TYPE HEADERS     @Z427VLS*/ 02293000
*MDROBRHD: PROC;                                           /*@Z427VLS*/ 02294000
MDROBRHD STM   @14,@12,@SA00024                                    0899 02295000
*   LINE44 = LINE4;                                        /*@Z427VLS*/ 02296000
         MVC   LINE44(82),LINE4                                    0900 02297000
*   CALL PRINTIT;            /*THIS ONE HAS AN EXTRA LINE    @Z427VLS*/ 02298000
         BAL   @14,PRINTIT                                         0901 02299000
*   MDROBRLN = MDRLINE;      /*SET UP THE SECOND LINE OF OUTPUT      */ 02300000
         MVC   MDROBRLN(35),MDRLINE                                0902 02301000
*END;                                                      /*@Z427VLS*/ 02302000
@EL00024 DS    0H                                                  0903 02303000
@EF00024 DS    0H                                                  0903 02304000
@ER00024 LM    @14,@12,@SA00024                                    0903 02305000
         BR    @14                                                 0903 02306000
* /*******************************************************************/ 02307000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02308000
* /*    THIS CASE WILL HANDLE ALL STANDARD HEADERS           @Z427VLS*/ 02309000
*COMMONHD: PROC;                                           /*@Z427VLS*/ 02310000
COMMONHD STM   @14,@12,@SA00025                                    0904 02311000
*   LINE0006 = LINE6;        /*SET UP THE FIRST OF COMMON HEADER     */ 02312000
         MVC   LINE0006(78),LINE6                                  0905 02313000
*   CALL PRINTIT;            /*GO PRINT THE LINE             @Z427VLS*/ 02314000
         BAL   @14,PRINTIT                                         0906 02315000
*   OBRFINSH = LINE5;        /*SET UP THE SECOND LINE        @Z427VLS*/ 02316000
         MVC   OBRFINSH(98),LINE5                                  0907 02317000
*END;                                                      /*@Z427VLS*/ 02318000
@EL00025 DS    0H                                                  0908 02319000
@EF00025 DS    0H                                                  0908 02320000
@ER00025 LM    @14,@12,@SA00025                                    0908 02321000
         BR    @14                                                 0908 02322000
* /***************************************************************/     02323000
* /*    THIS PROC WILL OUTPUT THE FRAME HEADER               @G51DGGB*/ 02324000
*FRMHEDER: PROC;                                           /*@G51DGGB*/ 02325000
FRMHEDER STM   @14,@12,12(@13)                                     0909 02326000
*DCL LINEFRAM CHAR(43)                                             0910 02327000
* INIT('GROUP   FRAME   EC LEVEL    SEQ #  LASTFLAG');     /*@G51DGGB*/ 02328000
*DCL LINEFRM1 CHAR(43) DEFINED(CUA12);                     /*@G51DGGB*/ 02329000
* LINEFRM1 = LINEFRAM;      /*MOVE THE FRAME HEADER IN TO THE LINE*/    02330000
         MVC   LINEFRM1(43),LINEFRAM                               0912 02331000
*END;                                                      /*@G51DGGB*/ 02332000
@EL00026 DS    0H                                                  0913 02333000
@EF00026 DS    0H                                                  0913 02334000
@ER00026 LM    @14,@12,12(@13)                                     0913 02335000
         BR    @14                                                 0913 02336000
* /*******************************************************************/ 02337000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02338000
* /*    THIS PROC WILL DETERMINE WHICH TYPE HEADING TO PRINT @Z427VLS*/ 02339000
* /*                                                         @Z427VLS*/ 02340000
*BUGHEAD: PROC;                                            /*@Z427VLS*/ 02341000
BUGHEAD  STM   @14,@12,@SA00027                                    0914 02342000
*  R8 = CURRENT;                       /*PICK UP THE RECORD TYPE     */ 02343000
         L     R8,CURRENT                                          0915 02344000
*  IF R8 = ONE                         /*IS IT A MCH RECORD  @Z427VLS*/ 02345000
*    THEN                                                          0916 02346000
         C     R8,ONE                                              0916 02347000
         BNE   @RF00916                                            0916 02348000
*      CALL MCHHEDER;                  /*GO SET UP MCH HEADER        */ 02349000
         BAL   @14,MCHHEDER                                        0917 02350000
*    ELSE                                                          0918 02351000
*     IF R8 = TWO                      /*IS IT A CCH TYPE RECORD     */ 02352000
*      THEN                                                        0918 02353000
         B     @RC00916                                            0918 02354000
@RF00916 C     R8,TWO                                              0918 02355000
         BNE   @RF00918                                            0918 02356000
*       CALL CCHHEDER;                 /*GO SET UP CCH HEADER        */ 02357000
         BAL   @14,CCHHEDER                                        0919 02358000
*      ELSE                                                        0920 02359000
*       IF R8 = THREE                  /*IS IT MCH TYPE RECORD       */ 02360000
*        THEN                                                      0920 02361000
         B     @RC00918                                            0920 02362000
@RF00918 C     R8,@CF00075                                         0920 02363000
         BNE   @RF00920                                            0920 02364000
*         CALL OBRHEDER;               /*GO FORMATE THE OBR HEADER   */ 02365000
         BAL   @14,OBRHEDER                                        0921 02366000
*        ELSE                                                      0922 02367000
*         IF R8 = FOUR                 /*IS IT A SOFTWARE RECORD     */ 02368000
*          THEN                                                    0922 02369000
         B     @RC00920                                            0922 02370000
@RF00920 C     R8,@CF00063                                         0922 02371000
         BNE   @RF00922                                            0922 02372000
*           CALL SFTHEDER;             /*FORMATE THE SOFTWARE HEADER */ 02373000
         BAL   @14,SFTHEDER                                        0923 02374000
*          ELSE                                                    0924 02375000
*           IF R8 = FIVE               /*IS THE RECORD AN IPL TYPE   */ 02376000
*            THEN                                                  0924 02377000
         B     @RC00922                                            0924 02378000
@RF00922 C     R8,FIVE                                             0924 02379000
         BNE   @RF00924                                            0924 02380000
*             CALL IPLHEDER;           /*FORMATE IPL HEADER  @Z427VLS*/ 02381000
         BAL   @14,IPLHEDER                                        0925 02382000
*            ELSE                                                  0926 02383000
*             IF R8 = SIX              /*IS THE RECORD AN DDR RECORD */ 02384000
*              THEN                                                0926 02385000
         B     @RC00924                                            0926 02386000
@RF00924 C     R8,SIX                                              0926 02387000
         BNE   @RF00926                                            0926 02388000
*               CALL DDRHEDER;         /*FORMAT HEADER FOR DDR RECORD*/ 02389000
         BAL   @14,DDRHEDER                                        0927 02390000
*              ELSE                                                0928 02391000
*               IF R8 = SEVEN          /*IS THE RECORD AN MIH RECORD */ 02392000
*                THEN                                              0928 02393000
         B     @RC00926                                            0928 02394000
@RF00926 C     R8,SEVEN                                            0928 02395000
         BNE   @RF00928                                            0928 02396000
*                 CALL MIHHEDER;       /*FORMAT TH HEADER FOR MIH REC*/ 02397000
         BAL   @14,MIHHEDER                                        0929 02398000
*                ELSE                                              0930 02399000
*                 IF R8 = EIGHT        /*IS THE RECORD AN EOD RECORD */ 02400000
*                  THEN                                            0930 02401000
         B     @RC00928                                            0930 02402000
@RF00928 C     R8,@CF00065                                         0930 02403000
         BNE   @RF00930                                            0930 02404000
*                   CALL EODHEDER;     /*FORMAT FOR EOD RRECORD      */ 02405000
         BAL   @14,EODHEDER                                        0931 02406000
*                  ELSE                                            0932 02407000
*                   IF R8 = NINE       /*IS RECORD AN MDR TYPE       */ 02408000
*                    THEN                                          0932 02409000
         B     @RC00930                                            0932 02410000
@RF00930 C     R8,@CF00085                                         0932 02411000
         BNE   @RF00932                                            0932 02412000
*                     CALL MDRHEDER;   /*FORMAT FOR AN MDR TYPE      */ 02413000
         BAL   @14,MDRHEDER                                        0933 02414000
*                     ELSE                                         0934 02415000
*                      IF R8 = TEN | /*REC IS A MCF TYPE RECORD*/  0934 02416000
*                         R8 = 11     THEN/*IS A CCF TYPE OF RECORD*/   02417000
         B     @RC00932                                            0934 02418000
@RF00932 C     R8,TEN                                              0934 02419000
         BE    @RT00934                                            0934 02420000
         C     R8,@CF00033                                         0934 02421000
         BNE   @RF00934                                            0934 02422000
@RT00934 DS    0H                                                  0935 02423000
*                          CALL FRMHEDER; /*PRINT THE FRAME HEADER*/    02424000
         BAL   @14,FRMHEDER                                        0935 02425000
*                    ELSE                                          0936 02426000
*                     CALL COMMONHD;   /*SHOULD NOT OCCUR BUT JUST IN*/ 02427000
         B     @RC00934                                            0936 02428000
@RF00934 BAL   @14,COMMONHD                                        0936 02429000
*END;                                                      /*@Z427VLS*/ 02430000
@EL00027 DS    0H                                                  0937 02431000
@EF00027 DS    0H                                                  0937 02432000
@ER00027 LM    @14,@12,@SA00027                                    0937 02433000
         BR    @14                                                 0937 02434000
* /*******************************************************************/ 02435000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02436000
* /*    THIS PROC WILL DETERMINE THE HEADING TO USE IN NORMAL OPERATI*/ 02437000
*TYPEHEAD: PROC;                                           /*@Z427VLS*/ 02438000
TYPEHEAD STM   @14,@12,@SA00028                                    0938 02439000
*  RTYP =(RECTYPE & 'FF80'X);                              /*@G51DGGB*/ 02440000
         L     @06,@CF00089                                        0939 02441000
         LH    @03,RECTYPE(,R2)                                    0939 02442000
         N     @03,@CF01464                                        0939 02443000
         NR    @06,@03                                             0939 02444000
         ST    @06,RTYP                                            0939 02445000
*  IF RTYP = '8000'X                   /*IS IT AN MDR TYPE   @Z427VLS*/ 02446000
*   THEN                                                           0940 02447000
         C     @06,@CF00193                                        0940 02448000
         BNE   @RF00940                                            0940 02449000
*    CALL MCHHEDER;                    /*FORMAT FOR AN MCH RECORD    */ 02450000
         BAL   @14,MCHHEDER                                        0941 02451000
*   ELSE                                                           0942 02452000
*    IF RTYP = '4000'X                 /*IS THE RECORD AN CCH TYPE   */ 02453000
*     THEN                                                         0942 02454000
         B     @RC00940                                            0942 02455000
@RF00940 CLC   RTYP(4),@CF01435                                    0942 02456000
         BNE   @RF00942                                            0942 02457000
*      CALL CCHHEDER;                  /*FORMAT HEADER FOR AN CCH    */ 02458000
         BAL   @14,CCHHEDER                                        0943 02459000
*     ELSE                                                         0944 02460000
*      IF RTYP = '2000'X               /*IS THE RECORD TYPE AN OBR   */ 02461000
*       THEN                                                       0944 02462000
         B     @RC00942                                            0944 02463000
@RF00942 CLC   RTYP(4),@CF01436                                    0944 02464000
         BNE   @RF00944                                            0944 02465000
*        CALL OBRHEDER;                /*FORMAT FOR AN OBR RECORD    */ 02466000
         BAL   @14,OBRHEDER                                        0945 02467000
*       ELSE                                                       0946 02468000
*        IF RTYP = '1000'X                                         0946 02469000
*         THEN                                                     0946 02470000
         B     @RC00944                                            0946 02471000
@RF00944 CLC   RTYP(4),@CF01437                                    0946 02472000
         BNE   @RF00946                                            0946 02473000
*          CALL SFTHEDER;              /*FORMAT FOR SFT TYPE @Z427VLS*/ 02474000
         BAL   @14,SFTHEDER                                        0947 02475000
*         ELSE                                                     0948 02476000
*          IF RTYP = '0800'X                                       0948 02477000
*           THEN                                                   0948 02478000
         B     @RC00946                                            0948 02479000
@RF00946 CLC   RTYP(4),@CF01438                                    0948 02480000
         BNE   @RF00948                                            0948 02481000
*            CALL IPLHEDER;            /*FORMAT FOR IPL RECORD       */ 02482000
         BAL   @14,IPLHEDER                                        0949 02483000
*           ELSE                                                   0950 02484000
*            IF RTYP = '0400'X         /*IS THE RECORD SELECTION DDR */ 02485000
*             THEN                                                 0950 02486000
         B     @RC00948                                            0950 02487000
@RF00948 CLC   RTYP(4),@CF01439                                    0950 02488000
         BNE   @RF00950                                            0950 02489000
*              CALL DDRHEDER;          /*FORMAT FOR AN DDR TYPE      */ 02490000
         BAL   @14,DDRHEDER                                        0951 02491000
*             ELSE                                                 0952 02492000
*              IF RTYP = '0200'X       /*IS THE RECORD SELECTION MIH */ 02493000
*               THEN                                               0952 02494000
         B     @RC00950                                            0952 02495000
@RF00950 CLC   RTYP(4),@CF01440                                    0952 02496000
         BNE   @RF00952                                            0952 02497000
*                CALL MIHHEDER;        /*FORMAT FOR AN MIH TYPE      */ 02498000
         BAL   @14,MIHHEDER                                        0953 02499000
*               ELSE                                               0954 02500000
*                IF RTYP = '0100'X     /*IS THE RECORD SELECTION EOD */ 02501000
*                 THEN                                             0954 02502000
         B     @RC00952                                            0954 02503000
@RF00952 CLC   RTYP(4),@CF00100                                    0954 02504000
         BNE   @RF00954                                            0954 02505000
*                  CALL EODHEDER;      /*FORMAT FOR AN EOD TYPE      */ 02506000
         BAL   @14,EODHEDER                                        0955 02507000
*                 ELSE                                             0956 02508000
*                  IF RTYP = '0080'X                               0956 02509000
*                   THEN                                           0956 02510000
         B     @RC00954                                            0956 02511000
@RF00954 CLC   RTYP(4),@CF01441                                    0956 02512000
         BNE   @RF00956                                            0956 02513000
*                    CALL MDRHEDER;    /*FORMAT FOR AN MDR TYPE      */ 02514000
         BAL   @14,MDRHEDER                                        0957 02515000
*                   ELSE                                           0958 02516000
*                    IF RTYP = '2080'X                             0958 02517000
*                     THEN                                         0958 02518000
         B     @RC00956                                            0958 02519000
@RF00956 CLC   RTYP(4),@CF01442                                    0958 02520000
         BNE   @RF00958                                            0958 02521000
*                      CALL MDROBRHD;  /*FORMAT FOR COMB MDR-OBR TYPE*/ 02522000
         BAL   @14,MDROBRHD                                        0959 02523000
*                     ELSE                                         0960 02524000
*                      IF DEBUG47 = ON |                           0960 02525000
*                         DEBUG46 = ON THEN                        0960 02526000
         B     @RC00958                                            0960 02527000
@RF00958 TM    DEBUG47(R2),B'00000011'                             0960 02528000
         BZ    @RF00960                                            0960 02529000
*                          CALL FRMHEDER;                  /*@G51DGGB*/ 02530000
         BAL   @14,FRMHEDER                                        0961 02531000
*                     ELSE                                         0962 02532000
*                      CALL COMMONHD;  /*JUST COMMON OLD HEADING     */ 02533000
         B     @RC00960                                            0962 02534000
@RF00960 BAL   @14,COMMONHD                                        0962 02535000
*END;                                                      /*@Z427VLS*/ 02536000
*                                                                  0963 02537000
@EL00028 DS    0H                                                  0963 02538000
@EF00028 DS    0H                                                  0963 02539000
@ER00028 LM    @14,@12,@SA00028                                    0963 02540000
         BR    @14                                                 0963 02541000
*/********************************************************************/ 02542000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 02543000
*/*    THIS PROC WILL DEVELOPE THE TABLE OF CPU SERIAL AND MODEL     */ 02544000
*/*    NUMBERS AND PRINT IT. THIS WILL BE THE LAST THING PRINTED     */ 02545000
*/*                                                          @Z427VLS*/ 02546000
*CPUINFO: PROC;                                            /*@Z427VLS*/ 02547000
CPUINFO  STM   @14,@12,@SA00029                                    0964 02548000
*  SPACING = DOUBLE ;                                      /*@Z427VLS*/ 02549000
         MVC   SPACING(1),DOUBLE                                   0965 02550000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 02551000
         BAL   @14,PRINTIT                                         0966 02552000
*  CPULINE1 = CPULINE;           /*SET UP THE HEADING FOR CPU SERIAL */ 02553000
         MVC   CPULINE1(24),CPULINE                                0967 02554000
*  CALL PRINTIT;                 /*GO AND PRINT IT           @Z427VLS*/ 02555000
         BAL   @14,PRINTIT                                         0968 02556000
*  SPACING = SINGLE;                                       /*@Z427VLS*/ 02557000
         MVC   SPACING(1),SINGLE                                   0969 02558000
*  DO I = 1 BY 1 TO EVNUM;    /*SET UP TO PROCESS ALL CPUS   @Z427VLS*/ 02559000
         LA    @06,1                                               0970 02560000
         ST    @06,I                                               0970 02561000
         B     @DE00970                                            0970 02562000
@DL00970 DS    0H                                                  0971 02563000
*   CPUTYPE = EVLETTER(I);       /*SET IN ACTUAL LETTER      @Z427VLS*/ 02564000
         MH    @06,@CH00080                                        0971 02565000
         L     @03,EVPTR(,R2)                                      0971 02566000
         ST    @06,@TF00001                                        0971 02567000
         ALR   @06,@03                                             0971 02568000
         MVC   CPUTYPE(1),EVLETTER-6(@06)                          0971 02569000
*   NUMBER= TWO;                 /*SET FOR TWO BYTES         @Z427VLS*/ 02570000
         L     @06,TWO                                             0972 02571000
         ST    @06,NUMBER                                          0972 02572000
*   ADDNXT = ADDR(CPUMODEL);     /*WHERE THE INFO IS TO BE PLACED    */ 02573000
         LA    @06,CPUMODEL                                        0973 02574000
         ST    @06,ADDNXT                                          0973 02575000
*   NEXTBY = ADDR(EVMODEL(I));   /*ADDRESS WHERE THE DATA IS @Z427VLS*/ 02576000
         L     @06,@TF00001                                        0974 02577000
         LA    @06,EVMODEL-6(@06,@03)                              0974 02578000
         ST    @06,NEXTBY                                          0974 02579000
*   CALL CONVERT;                /*GO AND CONVERT THE DATA   @Z427VLS*/ 02580000
         BAL   @14,CONVERT                                         0975 02581000
*   ADDNXT = ADDR(CPUSERAL);     /*WHERE TO PUT THE SERIAL DATA      */ 02582000
         LA    @06,CPUSERAL                                        0976 02583000
         ST    @06,ADDNXT                                          0976 02584000
*   NEXTBY = ADDR(EVSERIAL(I));  /*WHERE THE SERIAL INFO IS KEPT     */ 02585000
         L     @06,I                                               0977 02586000
         MH    @06,@CH00080                                        0977 02587000
         L     @03,EVPTR(,R2)                                      0977 02588000
         LA    @06,EVSERIAL-6(@06,@03)                             0977 02589000
         ST    @06,NEXTBY                                          0977 02590000
*   NUMBER = THREE;              /*SET UP FOR THREE IN SIX OUT       */ 02591000
         MVC   NUMBER(4),@CF00075                                  0978 02592000
*   CALL CONVERT ;               /*GO CONVERT THE SERIAL TO PRINTABLE*/ 02593000
         BAL   @14,CONVERT                                         0979 02594000
*   PRTLINE1 = CPUDATA;          /*MOVE CPU DATA TO THE PRINT LINE   */ 02595000
         MVI   PRTLINE1+22,C' '                                    0980 02596000
         MVC   PRTLINE1+23(79),PRTLINE1+22                         0980 02597000
         MVC   PRTLINE1(22),CPUDATA                                0980 02598000
*   CALL PRINTIT;                /*GO PRINT WHAT WE FOUND    @Z427VLS*/ 02599000
         BAL   @14,PRINTIT                                         0981 02600000
*  END;                                                    /*@Z427VLS*/ 02601000
         LA    @06,1                                               0982 02602000
         AL    @06,I                                               0982 02603000
         ST    @06,I                                               0982 02604000
@DE00970 L     @03,EVPTR(,R2)                                      0982 02605000
         CH    @06,EVNUM(,@03)                                     0982 02606000
         BNH   @DL00970                                            0982 02607000
*  SPACING = SINGLE;             /*RESTORE SPACING CONTROL TO 1      */ 02608000
         MVC   SPACING(1),SINGLE                                   0983 02609000
* END;                                                     /*@Z427VLS*/ 02610000
@EL00029 DS    0H                                                  0984 02611000
@EF00029 DS    0H                                                  0984 02612000
@ER00029 LM    @14,@12,@SA00029                                    0984 02613000
         BR    @14                                                 0984 02614000
*/********************************************************************/ 02615000
*/*       THIS PROC WILL DETERMINE THE INDEX FOR ALL FOLLOWING WORK  */ 02616000
*/*       IT IS BASED ON MATCHING THE SERIAL AND CPU WITH EV TABLE   */ 02617000
* CPULETER: PROC;                                          /*@Z427VLS*/ 02618000
CPULETER STM   @14,@12,12(@13)                                     0985 02619000
*   SWITCH3 = OFF;               /*TURN THE SWITCH OFF PRIOR TO START*/ 02620000
         NI    SWITCH3,B'11011111'                                 0986 02621000
*   PTR = ZERO;                  /*START AT ZERO             @Z427VLS*/ 02622000
         SLR   @06,@06                                             0987 02623000
         ST    @06,PTR                                             0987 02624000
*   DO S = 1 BY 1 TO 16 WHILE(SWITCH3 = OFF);          /*    @ZA19014*/ 02625000
         LA    @06,1                                               0988 02626000
         ST    @06,S                                               0988 02627000
@DL00988 TM    SWITCH3,B'00100000'                                 0988 02628000
         BNZ   @DC00988                                            0988 02629000
*     IF EVSERIAL(S) = LRTCPUS   /*DO THE SERIALS MATCH      @Z427VLS*/ 02630000
*        &  EVMODEL(S) = LRTMODEL/*AND THE MODEL # MATCHES   @Z427VLS*/ 02631000
*          THEN                                                    0989 02632000
         LR    @03,@06                                             0989 02633000
         MH    @03,@CH00080                                        0989 02634000
         L     @15,EVPTR(,R2)                                      0989 02635000
         ST    @03,@TF00001                                        0989 02636000
         ALR   @03,@15                                             0989 02637000
         CLC   EVSERIAL-6(3,@03),LRTCPUS(R7)                       0989 02638000
         BNE   @RF00989                                            0989 02639000
         AL    @15,@TF00001                                        0989 02640000
         CLC   EVMODEL-6(2,@15),LRTMODEL(R7)                       0989 02641000
         BNE   @RF00989                                            0989 02642000
*           DO;                                            /*@Z427VLS*/ 02643000
*            PTR = S;            /*SET THE INDEX FOR FOLLOWING PROCS */ 02644000
         ST    @06,PTR                                             0991 02645000
*            SWITCH3 = ON;       /* SET TO EXIT THE LOOP     @Z427VLS*/ 02646000
         OI    SWITCH3,B'00100000'                                 0992 02647000
*           END;                                           /*@Z427VLS*/ 02648000
*   END;                                                   /*@Z427VLS*/ 02649000
@RF00989 LA    @06,1                                               0994 02650000
         AL    @06,S                                               0994 02651000
         ST    @06,S                                               0994 02652000
         C     @06,@CF00088                                        0994 02653000
         BNH   @DL00988                                            0994 02654000
@DC00988 DS    0H                                                  0995 02655000
*                                /*FILT4 DROPS THE BALL BUT JUST IN -*/ 02656000
* END;                                                     /*@Z427VLS*/ 02657000
@EL00030 DS    0H                                                  0995 02658000
@EF00030 DS    0H                                                  0995 02659000
@ER00030 LM    @14,@12,12(@13)                                     0995 02660000
         BR    @14                                                 0995 02661000
@PB00030 DS    0H                                                  0996 02662000
*/********************************************************************/ 02663000
*/********************************************************************/ 02664000
*/*******************PRIME LOOP***************************************/ 02665000
*/*                                                          @Z427VLS*/ 02666000
* IF DEBUG4 = ON THEN           /*PRINT NAME AND COMPILE DATE        */ 02667000
         TM    DEBUG4(R2),B'00001000'                              0996 02668000
         BNO   @RF00996                                            0996 02669000
* DO;                                                      /*@Z427VLS*/ 02670000
*  R9 = R10 -27;                                           /*@Z427VLS*/ 02671000
         LR    R9,R10                                              0998 02672000
         SL    R9,@CF01451                                         0998 02673000
*  GEN(MVC  TIME1(16),0(R9));    /*MOVE IN NAME & COMPILE DATE      */  02674000
         MVC  TIME1(16),0(R9)                                           02675000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 02676000
         BAL   @14,PRINTIT                                         1000 02677000
* END;                                                     /*@Z427VLS*/ 02678000
* DDNAME = '0';                 /*DIRECT BACK TO NORMAL DD SET      */  02679000
@RF00996 MVI   DDNAME,C'0'                                         1002 02680000
* IF DEBUG6 ^= ON & DEBUG24 ^= ON THEN                             1003 02681000
         TM    DEBUG6(R2),B'00000010'                              1003 02682000
         BO    @RF01003                                            1003 02683000
         TM    DEBUG24(R2),B'10000000'                             1003 02684000
         BO    @RF01003                                            1003 02685000
* DO;                                                      /*@Z427VLS*/ 02686000
*IF DEBUG47 ^= ON THEN                                             1005 02687000
         TM    DEBUG47(R2),B'00000001'                             1005 02688000
         BO    @RF01005                                            1005 02689000
* CALL TEMPLATE;                /*GO PRINT OUT THE TEMPLATE  @Z427VLS*/ 02690000
         BAL   @14,TEMPLATE                                        1006 02691000
* CALL MAINHEAD;                /*GO PRINT MAIN HEADING      @Z427VLS*/ 02692000
@RF01005 BAL   @14,MAINHEAD                                        1007 02693000
* IF DEBUG5 ^= ON THEN                                             1008 02694000
         TM    DEBUG5(R2),B'00000100'                              1008 02695000
         BO    @RF01008                                            1008 02696000
*  CALL HEADING;                                           /*@Z427VLS*/ 02697000
         BAL   @14,HEADING                                         1009 02698000
* END;                                                     /*@Z427VLS*/ 02699000
@RF01008 DS    0H                                                  1011 02700000
* DO Y = 1 BY 1 TO SORTNUM;     /*SET UP INDEX TO PROCESS ALL ITEMS  */ 02701000
@RF01003 LA    @06,1                                               1011 02702000
         ST    @06,Y                                               1011 02703000
         B     @DE01011                                            1011 02704000
@DL01011 DS    0H                                                  1012 02705000
*  RECCCHHR = SORTCCHR(Y);      /*SET UP FOR THE DIRECT READ @Z427VLS*/ 02706000
         MH    @06,@CH00032                                        1012 02707000
         L     @03,SORTADR(,R2)                                    1012 02708000
         ALR   @03,@06                                             1012 02709000
         AL    @03,@CF01467                                        1012 02710000
         MVC   RECCCHHR(5,R2),SORTCCHR-5(@03)                      1012 02711000
*  CALL IOHND(READIRCT);                                   /*@Z427VLS*/ 02712000
         L     @15,ADIOHND(,R2)                                    1013 02713000
         LA    @01,@AL01013                                        1013 02714000
         BALR  @14,@15                                             1013 02715000
*  IF R15 = ZERO THEN           /*DON'T PROCESS IF READ ERROR        */ 02716000
         LTR   R15,R15                                             1014 02717000
         BNZ   @RF01014                                            1014 02718000
*   DO;                                                    /*@Z427VLS*/ 02719000
*    R8 = LRTKEY1;              /*PICK UP THE RECORD TYPE    @Z427VLS*/ 02720000
         SLR   R8,R8                                               1016 02721000
         IC    R8,LRTKEY1(,R7)                                     1016 02722000
*    SRL (R8,FOUR);             /*DROP THE UNWANTED BITS FROM THE TYP*/ 02723000
         SRL   R8,4                                                1017 02724000
*    CURRENT = R8;              /*SAVE FOR AN INDEX VALUE    @Z427VLS*/ 02725000
         ST    R8,CURRENT                                          1018 02726000
*  IF(DEBUG5 = ON |             /*PRINT HEADING FOR EACH RECORD      */ 02727000
*  MYLINECT > LINECT) &         /*CHECK IF NEW PAGE IS REQUIRED*/  1019 02728000
*     DEBUG24 ^= ON                                                1019 02729000
*     THEN                                                         1019 02730000
         TM    DEBUG5(R2),B'00000100'                              1019 02731000
         BO    @GL00023                                            1019 02732000
         LH    @06,MYLINECT                                        1019 02733000
         CH    @06,LINECT(,R2)                                     1019 02734000
         BNH   @RF01019                                            1019 02735000
@GL00023 TM    DEBUG24(R2),B'10000000'                             1019 02736000
         BO    @RF01019                                            1019 02737000
*       CALL HEADING;           /*GO PRINT THE HEADING       @Z427VLS*/ 02738000
         BAL   @14,HEADING                                         1020 02739000
*  CALL CPULETER;                                          /*@Z427VLS*/ 02740000
@RF01019 BAL   @14,CPULETER                                        1021 02741000
*  IF LASTDATE ^= LRTDATE & DEBUG6 = OFF                           1022 02742000
*     THEN                                                         1022 02743000
         CLC   LASTDATE(4),LRTDATE(R7)                             1022 02744000
         BE    @RF01022                                            1022 02745000
         TM    DEBUG6(R2),B'00000010'                              1022 02746000
         BNZ   @RF01022                                            1022 02747000
*       CALL NEWDATE;           /*GO PRINT THE NEW DATE      @Z427VLS*/ 02748000
         BAL   @14,NEWDATE                                         1023 02749000
*  IF PTR ^= ZERO THEN          /*DON'T LET A ZERO INDEX SLIP BY     */ 02750000
@RF01022 L     @06,PTR                                             1024 02751000
         LTR   @06,@06                                             1024 02752000
         BZ    @RF01024                                            1024 02753000
*   DO;                                                    /*@Z427VLS*/ 02754000
*    CALL MOVEDATA;             /*MOVE THE DATA INTO THE PRINT LINE  */ 02755000
         BAL   @14,MOVEDATA                                        1026 02756000
*    IF DEBUG6 = OFF & DEBUG24 = OFF THEN  /* IF TRUE DON'T PRINT    */ 02757000
         TM    DEBUG6(R2),B'00000010'                              1027 02758000
         BNZ   @RF01027                                            1027 02759000
         TM    DEBUG24(R2),B'10000000'                             1027 02760000
         BNZ   @RF01027                                            1027 02761000
*      CALL PRINTIT;            /*GO PRINT OUT THE DATA LINE @Z427VLS*/ 02762000
         BAL   @14,PRINTIT                                         1028 02763000
*   END;                                                   /*@Z427VLS*/ 02764000
* END;                                                     /*@Z427VLS*/ 02765000
* ELSE                                                             1031 02766000
*  BADRECRD = BADRECRD + ONE;   /*ADD 1 TO NUMBER OF READ FAILURES   */ 02767000
         B     @RC01014                                            1031 02768000
@RF01014 L     @06,BADRECRD                                        1031 02769000
         AL    @06,ONE                                             1031 02770000
         ST    @06,BADRECRD                                        1031 02771000
* IF DEBUG17 = ON &R15 = ZERO THEN/*   WANTS A HEX DUMP OF EACH REC. */ 02772000
@RC01014 TM    DEBUG17(R2),B'01000000'                             1032 02773000
         BNO   @RF01032                                            1032 02774000
         SLR   @14,@14                                             1032 02775000
         CR    R15,@14                                             1032 02776000
         BNE   @RF01032                                            1032 02777000
*  DO;                                                     /*@Z427VLS*/ 02778000
*   MYLINECT = ZERO;            /*DON'T LET UP SPACE GET IN ACTION   */ 02779000
         STH   @14,MYLINECT                                        1034 02780000
*   NUMBER = 66;                                           /*@Z427VLS*/ 02781000
         LA    @06,66                                              1035 02782000
         ST    @06,NUMBER                                          1035 02783000
*   ADDNXT = ADDR(TIME1);                                  /*@Z427VLS*/ 02784000
         LA    @03,TIME1                                           1036 02785000
         ST    @03,ADDNXT                                          1036 02786000
*   NEXTBY = R7;                                           /*@Z427VLS*/ 02787000
         ST    R7,NEXTBY                                           1037 02788000
*   DO T = 66 BY 66 TO RECLNGTH;                           /*@Z427VLS*/ 02789000
         ST    @06,T                                               1038 02790000
         B     @DE01038                                            1038 02791000
@DL01038 DS    0H                                                  1039 02792000
*    CALL CONVERT;                                         /*@Z427VLS*/ 02793000
         BAL   @14,CONVERT                                         1039 02794000
*    NEXTBY = NEXTBY + 66;                                 /*@Z427VLS*/ 02795000
         LA    @06,66                                              1040 02796000
         AL    @06,NEXTBY                                          1040 02797000
         ST    @06,NEXTBY                                          1040 02798000
*    CALL PRINTIT;                                         /*@Z427VLS*/ 02799000
         BAL   @14,PRINTIT                                         1041 02800000
*   END;                                                   /*@Z427VLS*/ 02801000
         LA    @06,66                                              1042 02802000
         AL    @06,T                                               1042 02803000
         ST    @06,T                                               1042 02804000
@DE01038 CH    @06,RECLNGTH(,R2)                                   1042 02805000
         BNH   @DL01038                                            1042 02806000
*   NUMBER = RECLNGTH - (T-66);                            /*@Z427VLS*/ 02807000
         L     @06,T                                               1043 02808000
         SL    @06,@CF01453                                        1043 02809000
         LCR   @06,@06                                             1043 02810000
         AH    @06,RECLNGTH(,R2)                                   1043 02811000
         ST    @06,NUMBER                                          1043 02812000
*   IF NUMBER > ZERO THEN                                          1044 02813000
         LTR   @06,@06                                             1044 02814000
         BNP   @RF01044                                            1044 02815000
*    DO;                                                   /*@Z427VLS*/ 02816000
*     CALL CONVERT;                                        /*@Z427VLS*/ 02817000
         BAL   @14,CONVERT                                         1046 02818000
*     CALL PRINTIT;                                        /*@Z427VLS*/ 02819000
         BAL   @14,PRINTIT                                         1047 02820000
*    END;                                                  /*@Z427VLS*/ 02821000
*   CALL PRINTIT;               /*BLANK LINE TO MAKE MORE READABLE   */ 02822000
@RF01044 BAL   @14,PRINTIT                                         1049 02823000
*  END;                                                    /*@Z427VLS*/ 02824000
* END;                                                     /*@Z427VLS*/ 02825000
@RF01032 LA    @06,1                                               1051 02826000
         AL    @06,Y                                               1051 02827000
         ST    @06,Y                                               1051 02828000
@DE01011 C     @06,SORTNUM(,R2)                                    1051 02829000
         BNH   @DL01011                                            1051 02830000
*IF DEBUG47 ^= ON THEN                                             1052 02831000
         TM    DEBUG47(R2),B'00000001'                             1052 02832000
         BO    @RF01052                                            1052 02833000
* CALL PRTTOTAL;         /*GO  PRINT THE SUMMRY TABLE        @G51DGGB*/ 02834000
         BAL   @14,PRTTOTAL                                        1053 02835000
*CALL CPUINFO;                  /*GO PRINT THE CUP SERIAL LETTER TAB */ 02836000
@RF01052 BAL   @14,CPUINFO                                         1054 02837000
* IF BADRECRD ^= ZERO THEN                                         1055 02838000
         L     @06,BADRECRD                                        1055 02839000
         LTR   @06,@06                                             1055 02840000
         BZ    @RF01055                                            1055 02841000
*  DO;                                                     /*@Z427VLS*/ 02842000
*   CALL IFCMSG(63,ADDR(BADREC));                          /*@Z427VLS*/ 02843000
         LA    @06,BADREC                                          1057 02844000
         ST    @06,@AFTEMPS                                        1057 02845000
         L     @15,ADIFCMSG(,R2)                                   1057 02846000
         LA    @01,@AL01057                                        1057 02847000
         BALR  @14,@15                                             1057 02848000
*   BINWORD = BADRECRD;         /*SET UP THE BINARY COUNT TO CONVERT */ 02849000
         L     @06,BADRECRD                                        1058 02850000
         ST    @06,BINWORD                                         1058 02851000
*   DECADDR = ADDR(NUMFAIL);    /*SET UP ADDRESS OF WHERE TO PUT IT  */ 02852000
         LA    @06,NUMFAIL                                         1059 02853000
         ST    @06,DECADDR                                         1059 02854000
*   BNDECNUM = SIX;             /*NUMBER OF CHARS TO PRINT   @Z427VLS*/ 02855000
         L     @06,SIX                                             1060 02856000
         ST    @06,BNDECNUM                                        1060 02857000
*   CALL CONVBIN;               /*GO CONVERT THE NUMBER TO PRINTABLE */ 02858000
         BAL   @14,CONVBIN                                         1061 02859000
*   CALL PRINTIT;               /*PRINT THE BAD RECORD COUNT MESSAGE */ 02860000
         BAL   @14,PRINTIT                                         1062 02861000
*  END;                                                    /*@Z427VLS*/ 02862000
* IF DEBUG12 = ON THEN          /*USER WANTS TO ABEND        @Z427VLS*/ 02863000
@RF01055 TM    DEBUG12(R2),B'00001000'                             1064 02864000
         BNO   @RF01064                                            1064 02865000
* GEN(ABEND 444,DUMP);                                     /*@Z427VLS*/ 02866000
         ABEND 444,DUMP                                                 02867000
*/********************************************************************/ 02868000
*/********************************************************************/ 02869000
*RETURN;                                                   /*@Z427VLS*/ 02870000
@EL00001 L     @13,4(,@13)                                         1066 02871000
@EF00001 DS    0H                                                  1066 02872000
@ER00001 L     @14,12(,@13)                                        1066 02873000
         LM    @00,@12,20(@13)                                     1066 02874000
         BR    @14                                                 1066 02875000
*END;                                                      /*@Z427VLS*/ 02876000
         B     @EL00001                                            1067 02877000
@DATA    DS    0H                                                       02878000
@CH00222 DC    H'24'                                                    02879000
         DS    0F                                                       02880000
@AL00402 EQU   *                       LIST WITH   1 ARGUMENT(S)        02881000
@AL00416 EQU   *                       LIST WITH   1 ARGUMENT(S)        02882000
@AL00427 DC    A(@CF00073+2)           LIST WITH   1 ARGUMENT(S)        02883000
@AL00762 DC    A(@CF01292)             LIST WITH   3 ARGUMENT(S)        02884000
@AL01013 DC    A(@CF00080+2)           LIST WITH   1 ARGUMENT(S)        02885000
         DC    A(DEVTYPE1)                                              02886000
@AL00830 DC    A(@CF00747)             LIST WITH   3 ARGUMENT(S)        02887000
         DC    A(DEVCOMP)                                               02888000
         DC    A(DEVTYPE1)                                              02889000
@AL01057 DC    A(@CF01454)             LIST WITH   2 ARGUMENT(S)        02890000
         DC    A(@AFTEMPS)                                              02891000
         DS    0F                                                       02892000
@SA00001 DS    18F                                                      02893000
@SA00002 DS    15F                                                      02894000
@SA00008 DS    15F                                                      02895000
@SA00003 DS    15F                                                      02896000
@SA00005 DS    15F                                                      02897000
@SA00006 DS    15F                                                      02898000
@SA00007 DS    15F                                                      02899000
@SA00009 DS    15F                                                      02900000
@SA00010 DS    15F                                                      02901000
@SA00011 DS    15F                                                      02902000
@SA00013 DS    15F                                                      02903000
@SA00014 DS    15F                                                      02904000
@SA00027 DS    15F                                                      02905000
@SA00028 DS    15F                                                      02906000
@SA00020 DS    15F                                                      02907000
@SA00021 DS    15F                                                      02908000
@SA00024 DS    15F                                                      02909000
@SA00025 DS    15F                                                      02910000
@SA00029 DS    15F                                                      02911000
@SA00012 DS    0F                                                       02912000
         DS    15F                                                      02913000
@AL00001 DS    3A                                                       02914000
@TF00001 DS    F                                                        02915000
@AFTEMPS DS    1F                                                       02916000
         DS    0F                                                       02917000
@CF00054 DC    F'1'                                                     02918000
@CF00073 DC    F'2'                                                     02919000
@CH00073 EQU   @CF00073+2                                               02920000
@CF00075 DC    F'3'                                                     02921000
@CH00075 EQU   @CF00075+2                                               02922000
@CF00063 DC    F'4'                                                     02923000
@CF00078 DC    F'5'                                                     02924000
@CF00080 DC    F'6'                                                     02925000
@CH00080 EQU   @CF00080+2                                               02926000
@CF00082 DC    F'7'                                                     02927000
@CH00082 EQU   @CF00082+2                                               02928000
@CF00065 DC    F'8'                                                     02929000
@CF00085 DC    F'9'                                                     02930000
@CF00032 DC    F'10'                                                    02931000
@CH00032 EQU   @CF00032+2                                               02932000
@CF00033 DC    F'11'                                                    02933000
@CF01340 DC    F'14'                                                    02934000
@CF00088 DC    F'16'                                                    02935000
@CF00747 DC    F'22'                                                    02936000
@CH00747 EQU   @CF00747+2                                               02937000
@CF01065 DC    F'26'                                                    02938000
@CF01451 DC    F'27'                                                    02939000
@CF01292 DC    F'32'                                                    02940000
@CF01454 DC    F'63'                                                    02941000
@CF01453 DC    F'66'                                                    02942000
@CF01467 DC    F'-5'                                                    02943000
@CF01464 DC    XL4'0000FFFF'                                            02944000
@CF00089 DC    XL4'FF80'                                                02945000
@CF00100 DC    XL4'0100'                                                02946000
@CF00193 DC    XL4'8000'                                                02947000
@CF01435 DC    XL4'4000'                                                02948000
@CF01436 DC    XL4'2000'                                                02949000
@CF01437 DC    XL4'1000'                                                02950000
@CF01438 DC    XL4'0800'                                                02951000
@CF01439 DC    XL4'0400'                                                02952000
@CF01440 DC    XL4'0200'                                                02953000
@CF01441 DC    XL4'0080'                                                02954000
@CF01442 DC    XL4'2080'                                                02955000
@CV01334 DC    V(IFCDEVIC)                                              02956000
         DS    0D                                                       02957000
PTR      DC    F'0'                                                     02958000
L8       DC    F'8'                                                     02959000
J        DC    F'0'                                                     02960000
TOTOFTOT DC    F'0'                                                     02961000
BADRECRD DC    F'0'                                                     02962000
TEN      DC    F'10'                                                    02963000
FIVE     DC    F'5'                                                     02964000
ONE      DC    F'1'                                                     02965000
TWOEIGHT DC    F'28'                                                    02966000
NEXTBY   DC    F'0'                                                     02967000
ADDNXT   DC    F'0'                                                     02968000
BINWORD  DC    F'0'                                                     02969000
NUMBER1  DC    F'1'                                                     02970000
BNDECNUM DC    F'0'                                                     02971000
DECADDR  DC    F'0'                                                     02972000
I        DC    F'0'                                                     02973000
NUMBER   DC    F'0'                                                     02974000
TWO      DC    F'2'                                                     02975000
CURRENT  DC    F'0'                                                     02976000
MINUS1   DC    F'-1'                                                    02977000
TOTAL    DC    F'0'                                                     02978000
X        DC    F'0'                                                     02979000
K        DC    F'0'                                                     02980000
Z        DC    F'0'                                                     02981000
SIX      DC    F'6'                                                     02982000
M        DC    F'0'                                                     02983000
N        DC    F'0'                                                     02984000
L        DC    F'0'                                                     02985000
P        DC    F'0'                                                     02986000
R        DC    F'0'                                                     02987000
S        DC    F'0'                                                     02988000
T        DC    F'0'                                                     02989000
Y        DC    F'0'                                                     02990000
SEVEN    DC    F'7'                                                     02991000
RTYP     DC    F'0'                                                     02992000
MYLINECT DC    H'1000'                                                  02993000
@TS00001 DS    CL2                                                      02994000
@CB00193 DC    X'8000'                                                  02995000
@CB01306 DC    X'F000'                                                  02996000
@CB01308 DC    X'2009'                                                  02997000
@CB01309 DC    X'200D'                                                  02998000
@CB01352 DC    X'0843'                                                  02999000
@CB01353 DC    X'0842'                                                  03000000
LINE01   DC    CL23'EVENT HISTORY TEMPLATE '                            03001000
LINE02   DC    CL20'FOR RECORD TYPES:  '                                03002000
LINE03   DC    CL12'MCH, MCH-TRM'                                       03003000
LINE04   DC    CL33'   TIME     JOBNAME  RECTYP  CPU '                  03004000
LINE06   DC    CL21'CCH, CCH-INC, CCH-CRH'                              03005000
LINE08   DC    CL3'OBR'                                                 03006000
LINE10   DC    CL74'OBR-DMT, OBR-EOD, DDR, DDR-OPR, DDR-SYS, MIH MIH-CEC03007000
               , MIH-DE, MDR         '                                  03008000
LINE12   DC    CL16'OBR-PRM, OBR-TMP'                                   03009000
LINE14   DC    CL38'SFT, SFT-ABN, SFT-MCH, SFT-PI, SFT-RST'             03010000
LINE16   DC    CL3'IPL'                                                 03011000
LINE18   DC    CL3'EOD'                                                 03012000
DEVCOMP  DC    CL2'  '                                                  03013000
LOSTMSG  DC    CL54'LOST RECORD SUMMARY  TYPE=4F (SHORT SOFT RECORD)   C03014000
                  '                                                     03015000
PRTLINE  DC    CL154' '                                                 03016000
         ORG   PRTLINE                                                  03017000
DDNAME   DC    CL1'1'                                                   03018000
SPACING  DC    X'09'                                                    03019000
TIME1    DS    CL11                                                     03020000
@NM00070 DS    CL1                                                      03021000
JOBNAME1 DS    CL8                                                      03022000
@NM00071 DS    CL1                                                      03023000
RECTYP1  DS    CL7                                                      03024000
@NM00072 DS    CL1                                                      03025000
CPU11    DS    CL1                                                      03026000
CPU12    DS    CL1                                                      03027000
@NM00073 DS    CL1                                                      03028000
CUA11    DS    CL1                                                      03029000
CUA12    DS    CL1                                                      03030000
@NM00074 DS    CL2                                                      03031000
LETTERV  DS    CL1                                                      03032000
@NM00075 DS    CL1                                                      03033000
DEVICE1  DS    CL4                                                      03034000
@NM00076 DS    CL2                                                      03035000
CMD1     DS    CL2                                                      03036000
@NM00077 DS    CL1                                                      03037000
CSW1     DS    CL4                                                      03038000
VLETTER  DS    CL1                                                      03039000
@NM00078 DS    CL1                                                      03040000
SENSEA1  DS    CL8                                                      03041000
@NM00079 DS    CL1                                                      03042000
SENSEA2  DS    CL8                                                      03043000
@NM00080 DS    CL1                                                      03044000
SENSEA3  DS    CL8                                                      03045000
@NM00081 DS    CL1                                                      03046000
SENSEA4  DS    CL8                                                      03047000
@NM00082 DS    CL1                                                      03048000
SENSEA5  DS    CL8                                                      03049000
@NM00083 DS    CL1                                                      03050000
SENSEA6  DS    CL8                                                      03051000
@NM00084 DS    CL1                                                      03052000
VOLUME1  DS    CL6                                                      03053000
         ORG   VOLUME1                                                  03054000
SENSEA7  DS    CL1                                                      03055000
         ORG   PRTLINE+115                                              03056000
@NM00085 DS    CL1                                                      03057000
BB1      DS    CL4                                                      03058000
         ORG   BB1                                                      03059000
@NM00086 DS    CL2                                                      03060000
SENSEA8  DS    CL2                                                      03061000
         ORG   PRTLINE+120                                              03062000
@NM00087 DS    CL1                                                      03063000
CC1      DS    CL4                                                      03064000
@NM00088 DS    CL1                                                      03065000
HH1      DS    CL4                                                      03066000
         ORG   HH1                                                      03067000
@NM00089 DS    CL2                                                      03068000
SENSEA9  DS    CL2                                                      03069000
         ORG   PRTLINE+130                                              03070000
@NM00090 DS    CL1                                                      03071000
R111     DS    CL2                                                      03072000
         ORG   PRTLINE+154                                              03073000
UPSPACE  DC    X'89'                                                    03074000
SINGLE   DC    X'09'                                                    03075000
DOUBLE   DC    X'11'                                                    03076000
TRIPLE   DC    X'19'                                                    03077000
DDRSPEC  DS    CL12                                                     03078000
         ORG   DDRSPEC                                                  03079000
@NM00091 DC    CL3'TO '                                                 03080000
TOCUA    DC    CL3'   '                                                 03081000
@NM00092 DC    CL2'  '                                                  03082000
DEVSAVE  DS    CL4                                                      03083000
         ORG   DDRSPEC+12                                               03084000
TOO      DC    CL2'TO'                                                  03085000
UKNO     DC    CL4'UKNO'                                                03086000
REPORTDY DC    CL12'REPORT DATE '                                       03087000
HEADDATE DS    CL18                                                     03088000
         ORG   HEADDATE                                                 03089000
@NM00094 DC    CL7'PERIOD '                                             03090000
FROMTO   DC    CL5'FROM '                                               03091000
DATE     DS    CL6                                                      03092000
         ORG   DATE                                                     03093000
DATEDAY  DC    CL3'   '                                                 03094000
@NM00095 DC    CL1' '                                                   03095000
DATEYR   DC    CL2'  '                                                  03096000
         ORG   HEADDATE+18                                              03097000
TO       DC    CL5'  TO '                                               03098000
NOTAPPLY DC    CL8'  N/A   '                                            03099000
BLANK    DC    CL6'      '                                              03100000
BLANK1   DC    X'000000000000'                                          03101000
KEEPSP   DC    CL1' '                                                   03102000
LINE8    DC    CL78'                     PSW-MCH /PROG-EC              C03103000
                                 ERROR-ID '                             03104000
LINE1    DC    CL18'CUA DEVICE     CSW'                                 03105000
LINE2    DC    CL18'CUA DEVICE CMD CSW'                                 03106000
LINE3    DC    CL104'CUA DEVICE                                        C03107000
                                       VOLUME/TERMINAL NAME        '    03108000
LINE5    DC    CL98'CUA DEVICE CMD CSW  SENSE    04  06   08  10   12  C03109000
               14   16  18   20  22   VOLUME B B  C C  H H  R'          03110000
LINE66   DC    CL78'          REASON     PSW-MCH /PROG-EC   RCYRYXIT  CC03111000
               OMP/MOD  CSECTID  ERROR-ID '                             03112000
LINE7    DC    CL17'   SSYS ID REASON'                                  03113000
LINE6    DC    CL78'   SSYS ID  REASON   PSW-MCH /PROG-EC   RCYRYXIT  CC03114000
               OMP/MOD  CSECTID  ERROR-ID'                              03115000
LINE4    DC    CL87'CUA DEVICE                             BYTES    DATC03116000
               A CK  SEEKS  OVERRUN   VOLUME'                           03117000
@NM00107 DS    CL182                                                    03118000
         ORG   @NM00107                                                 03119000
MCH      DC    CL7'MCH    '                                             03120000
MCHTRM   DC    CL7'MCH-TRM'                                             03121000
CCH      DC    CL7'CCH    '                                             03122000
CCHINC   DC    CL7'CCH-INC'                                             03123000
CCHCRH   DC    CL7'CCH-CRH'                                             03124000
OBR      DC    CL7'OBR    '                                             03125000
OBRSHT   DC    CL7'OBR-SHT'                                             03126000
OBRDMT   DC    CL7'OBR-DMT'                                             03127000
OBREOD   DC    CL7'OBR-EOD'                                             03128000
OBRTMP   DC    CL7'OBR-TMP'                                             03129000
OBRPRM   DC    CL7'OBR-PRM'                                             03130000
SFT      DC    CL7'SFT    '                                             03131000
SFTABN   DC    CL7'SFT-ABN'                                             03132000
SFTMCH   DC    CL7'SFT-MCH'                                             03133000
SFTPI    DC    CL7'SFT-PI '                                             03134000
SFTRST   DC    CL7'SFT-RST'                                             03135000
IPL      DC    CL7'IPL    '                                             03136000
DDR      DC    CL7'DDR    '                                             03137000
DDROPR   DC    CL7'DDR-OPR'                                             03138000
DDRSYS   DC    CL7'DDR-SYS'                                             03139000
MIH      DC    CL7'MIH    '                                             03140000
MIHCE    DC    CL7'MIH-CE '                                             03141000
MIHDE    DC    CL7'MIH-DE '                                             03142000
EOD      DC    CL7'EOD    '                                             03143000
MDR      DC    CL7'MDR    '                                             03144000
MDRDAS   DC    CL7'MDR-DAS'                                             03145000
         ORG   @NM00107+182                                             03146000
ALLCTS   DS    CL1664                                                   03147000
         ORG   ALLCTS                                                   03148000
MCHCT    DC    16F'0'                                                   03149000
MCHTRMCT DC    16F'0'                                                   03150000
CCHCT    DC    16F'0'                                                   03151000
CCHINCCT DC    16F'0'                                                   03152000
CCHCRHCT DC    16F'0'                                                   03153000
OBRCT    DC    16F'0'                                                   03154000
OBRSHTCT DC    16F'0'                                                   03155000
OBRDMTCT DC    16F'0'                                                   03156000
OBREODCT DC    16F'0'                                                   03157000
OBRTMPCT DC    16F'0'                                                   03158000
OBRPRMCT DC    16F'0'                                                   03159000
SFTCT    DC    16F'0'                                                   03160000
SFTABNCT DC    16F'0'                                                   03161000
SFTMCHCT DC    16F'0'                                                   03162000
SFTPICT  DC    16F'0'                                                   03163000
SFTRSTCT DC    16F'0'                                                   03164000
IPLCT    DC    16F'0'                                                   03165000
DDRCT    DC    16F'0'                                                   03166000
DDROPRCT DC    16F'0'                                                   03167000
DDRSYSCT DC    16F'0'                                                   03168000
MIHCT    DC    16F'0'                                                   03169000
MIHCECT  DC    16F'0'                                                   03170000
MIHDECT  DC    16F'0'                                                   03171000
EODCT    DC    16F'0'                                                   03172000
MDRCT    DC    16F'0'                                                   03173000
MDRDASCT DC    16F'0'                                                   03174000
         ORG   ALLCTS+1664                                              03175000
LASTDATE DC    CL4'    '                                                03176000
TABLECHH DC    CL2'  '                                                  03177000
TOTALHD1 DC    CL12'RECORD TYPES'                                       03178000
TOTALHD3 DC    CL107' TOTAL  CPU-A CPU-B CPU-C CPU-D CPU-E CPU-F CPU-G C03179000
               CPU-H CPU-I CPU-J CPU-K CPU-L CPU-M CPU-N CPU-O CPU-P   C03180000
                '                                                       03181000
CHARS    DC    CL16'0123456789ABCDEF'                                   03182000
         DS    CL3                                                      03183000
WORK     DS    CL8                                                      03184000
TEMPSAVE DC    CL84' '                                                  03185000
SWITCHE  DC    AL1(0)                                                   03186000
         ORG   SWITCHE                                                  03187000
SWITCH1  DS    BL1                                                      03188000
SWITCH2  EQU   SWITCHE+0                                                03189000
SWITCH3  EQU   SWITCHE+0                                                03190000
SWITCH4  EQU   SWITCHE+0                                                03191000
SWITCH5  EQU   SWITCHE+0                                                03192000
         ORG   SWITCHE+1                                                03193000
LETTER1  DC    CL1'M'                                                   03194000
CPULINE  DC    CL24'CPU   MODEL   SERIAL NO.'                           03195000
CPUDATA  DC    CL22' '                                                  03196000
         ORG   CPUDATA                                                  03197000
@NM00111 DS    CL1                                                      03198000
CPUTYPE  DS    CL1                                                      03199000
@NM00112 DS    CL5                                                      03200000
CPUMODEL DS    CL3                                                      03201000
@NM00113 DS    CL6                                                      03202000
CPUSERAL DS    CL6                                                      03203000
         ORG   CPUDATA+22                                               03204000
NEWDATEH DS    CL12                                                     03205000
         ORG   NEWDATEH                                                 03206000
@NM00114 DC    CL5'DATE '                                               03207000
DAYJUL   DC    CL3'   '                                                 03208000
@NM00115 DC    CL2'  '                                                  03209000
YEARJUL  DC    CL2'  '                                                  03210000
         ORG   NEWDATEH+12                                              03211000
OVERTOT  DC    CL16' OVER ALL TOTALS'                                   03212000
MDRLINE  DC    CL35'RD/SRCHD COR/RTRY  CNT/ERR COM/DATA'                03213000
FRAMEMCH DC    CL7'FRM-MCH'                                             03214000
FRAMECCH DC    CL7'FRM-CCH'                                             03215000
FRMTEMP  DC    CL7' '                                                   03216000
LINEFRAM DC    CL43'GROUP   FRAME   EC LEVEL    SEQ #  LASTFLAG'        03217000
         DS    CL5                                                      03218000
DBLWORD  DS    CL8                                                      03219000
TOTHEAD  DC    CL22'MACHINE CHECK         '                             03220000
         DC    CL22'CHANNEL CHECK         '                             03221000
         DC    CL22'OUTBOARD              '                             03222000
         DC    CL22'SOFTWARE              '                             03223000
         DC    CL22'SYSTEM INITIALIZATION '                             03224000
         DC    CL22'SYSTEM RECONFIGURATION'                             03225000
         DC    CL22'MISSING INTERRUPT     '                             03226000
         DC    CL22'SYSTEM TERMINATION    '                             03227000
         DC    CL22'BUFFER OFFLOAD        '                             03228000
         DS    CL2                                                      03229000
ADDRTAB1 DC    AL4(LINE03)                                              03230000
         DC    AL4(LINE06)                                              03231000
         DC    AL4(LINE08)                                              03232000
         DC    AL4(LINE10)                                              03233000
         DC    AL4(LINE12)                                              03234000
         DC    AL4(LINE14)                                              03235000
         DC    AL4(LINE16)                                              03236000
         DC    AL4(LINE18)                                              03237000
         DC    AL4(MDRDAS)                                              03238000
NUMCHAR1 DC    A(11)                                                    03239000
         DC    A(20)                                                    03240000
         DC    A(2)                                                     03241000
         DC    A(73)                                                    03242000
         DC    A(15)                                                    03243000
         DC    A(37)                                                    03244000
         DC    A(2)                                                     03245000
         DC    A(2)                                                     03246000
         DC    A(6)                                                     03247000
ADDRTAB2 DC    AL4(LINE8)                                               03248000
         DC    AL4(LINE1)                                               03249000
         DC    AL4(LINE2)                                               03250000
         DC    AL4(LINE3)                                               03251000
         DC    AL4(LINE5)                                               03252000
         DC    AL4(LINE66)                                              03253000
         DC    AL4(LINE7)                                               03254000
         DC    AL4(LINE6)                                               03255000
         DC    AL4(LINE4)                                               03256000
NUMCHAR2 DC    A(77)                                                    03257000
         DC    A(17)                                                    03258000
         DC    A(17)                                                    03259000
         DC    A(103)                                                   03260000
         DC    A(97)                                                    03261000
         DC    A(77)                                                    03262000
         DC    A(16)                                                    03263000
         DC    A(0)                                                     03264000
         DC    A(79)                                                    03265000
SUBTOT   DC    16F'0'                                                   03266000
PATCH    DC    20F'0'                                                   03267000
TOTALS   DC    16F'0'                                                   03268000
LETTER   DC    CL1'M'                                                   03269000
         DC    CL1'M'                                                   03270000
         DC    CL1'C'                                                   03271000
         DC    CL1'C'                                                   03272000
         DC    CL1'C'                                                   03273000
         DC    CL1'O'                                                   03274000
         DC    CL1'O'                                                   03275000
         DC    CL1'O'                                                   03276000
         DC    CL1'O'                                                   03277000
         DC    CL1'O'                                                   03278000
         DC    CL1'O'                                                   03279000
         DC    CL1'S'                                                   03280000
         DC    CL1'S'                                                   03281000
         DC    CL1'S'                                                   03282000
         DC    CL1'S'                                                   03283000
         DC    CL1'S'                                                   03284000
         DC    CL1'I'                                                   03285000
         DC    CL1'D'                                                   03286000
         DC    CL1'D'                                                   03287000
         DC    CL1'D'                                                   03288000
         DC    CL1'M'                                                   03289000
         DC    CL1'M'                                                   03290000
         DC    CL1'M'                                                   03291000
         DC    CL1'E'                                                   03292000
         DC    CL1'M'                                                   03293000
         DC    CL1'M'                                                   03294000
IFCEVENT CSECT                                                          03295000
     DC  S(PATCH)    SET UP THE ADDRESSABILITY FOR THE PATCH AREA       03296000
IFCEVENT CSECT                                                          03297000
EXECMVC  MVC RECTYP1(0),0(R8)                                           03298000
EXECMVC2 MVC   CUA12(0),0(R8)                                           03299000
IFCEVENT CSECT                                                          03300000
MVCDATA  MVC   R0(R0,R6),0(R8)                                          03301000
IFCEVENT CSECT                                                          03302000
MOVECHAR   MVC  R0(0,R8),0(R6)                                          03303000
IFCEVENT CSECT                                                          03304000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03305000
@01      EQU   01                                                       03306000
@02      EQU   02                                                       03307000
@03      EQU   03                                                       03308000
@04      EQU   04                                                       03309000
@05      EQU   05                                                       03310000
@06      EQU   06                                                       03311000
@07      EQU   07                                                       03312000
@08      EQU   08                                                       03313000
@09      EQU   09                                                       03314000
@10      EQU   10                                                       03315000
@11      EQU   11                                                       03316000
@12      EQU   12                                                       03317000
@13      EQU   13                                                       03318000
@14      EQU   14                                                       03319000
@15      EQU   15                                                       03320000
I0001    EQU   @03                                                      03321000
R2       EQU   @02                                                      03322000
R6       EQU   @06                                                      03323000
R7       EQU   @07                                                      03324000
R8       EQU   @08                                                      03325000
R9       EQU   @09                                                      03326000
R10      EQU   @10                                                      03327000
R11      EQU   @11                                                      03328000
R12      EQU   @12                                                      03329000
R15      EQU   @15                                                      03330000
R0       EQU   @00                                                      03331000
R1       EQU   @01                                                      03332000
R13      EQU   @13                                                      03333000
R14      EQU   @14                                                      03334000
R3       EQU   @03                                                      03335000
R4       EQU   @04                                                      03336000
R5       EQU   @05                                                      03337000
IOHND    EQU   0                                                        03338000
IFCMSG   EQU   0                                                        03339000
PARM     EQU   0                                                        03340000
RECTYPE  EQU   PARM                                                     03341000
SWITCHES EQU   PARM+2                                                   03342000
DEBUG    EQU   PARM+4                                                   03343000
DEBUG4   EQU   DEBUG                                                    03344000
DEBUG5   EQU   DEBUG                                                    03345000
DEBUG6   EQU   DEBUG                                                    03346000
DEBUG12  EQU   DEBUG+1                                                  03347000
DEBUG17  EQU   DEBUG+2                                                  03348000
DEBUG24  EQU   DEBUG+3                                                  03349000
DEBUG29  EQU   DEBUG+3                                                  03350000
DEBUGA   EQU   PARM+8                                                   03351000
DEBUG46  EQU   DEBUGA+1                                                 03352000
DEBUG47  EQU   DEBUGA+1                                                 03353000
MISC     EQU   PARM+12                                                  03354000
PRINTES  EQU   MISC                                                     03355000
OPENCLSE EQU   PARM+13                                                  03356000
OPENIO   EQU   OPENCLSE                                                 03357000
CLOSEIO  EQU   OPENCLSE+2                                               03358000
DATENOW  EQU   PARM+17                                                  03359000
STDT     EQU   PARM+23                                                  03360000
STDATE   EQU   STDT                                                     03361000
PSTD     EQU   STDATE+1                                                 03362000
ENDDT    EQU   PARM+31                                                  03363000
ENDDATE  EQU   ENDDT                                                    03364000
PEND     EQU   ENDDATE+1                                                03365000
STTIME1  EQU   PARM+39                                                  03366000
ENDTIME1 EQU   PARM+43                                                  03367000
STTIME2  EQU   PARM+47                                                  03368000
ENDTIME2 EQU   PARM+51                                                  03369000
STRTDATE EQU   PARM+55                                                  03370000
EVSYEAR  EQU   STRTDATE                                                 03371000
EVSDAY   EQU   STRTDATE+1                                               03372000
SORTNUM  EQU   PARM+84                                                  03373000
ERRID    EQU   PARM+92                                                  03374000
IDTIMEA  EQU   ERRID+6                                                  03375000
IDTIME   EQU   IDTIMEA                                                  03376000
CCHHRLNG EQU   PARM+112                                                 03377000
RECCCHHR EQU   CCHHRLNG                                                 03378000
RECLNGTH EQU   CCHHRLNG+6                                               03379000
LINECT   EQU   PARM+120                                                 03380000
ADIOHND  EQU   PARM+124                                                 03381000
ADIFCMSG EQU   PARM+128                                                 03382000
ADEDITB  EQU   PARM+132                                                 03383000
EVPTR    EQU   PARM+136                                                 03384000
SORTADR  EQU   PARM+140                                                 03385000
PRINTADR EQU   PARM+148                                                 03386000
CUAPTR   EQU   PARM+152                                                 03387000
DEVPTR   EQU   PARM+156                                                 03388000
MODPTR   EQU   PARM+160                                                 03389000
SERPTR   EQU   PARM+164                                                 03390000
VOLPTR   EQU   PARM+168                                                 03391000
CPUPTR   EQU   PARM+172                                                 03392000
CPCUAPTR EQU   PARM+176                                                 03393000
LIBADPTR EQU   PARM+180                                                 03394000
SYMCDPTR EQU   PARM+184                                                 03395000
SYSUMPTR EQU   PARM+188                                                 03396000
TRENPTR  EQU   PARM+192                                                 03397000
SHAREPTR EQU   PARM+196                                                 03398000
DUMPTABL EQU   PARM+200                                                 03399000
DUMPINFO EQU   DUMPTABL+4                                               03400000
TRENDONE EQU   0                                                        03401000
TREGEN   EQU   TRENDONE+8                                               03402000
TREND2   EQU   0                                                        03403000
TRENDKEY EQU   TREND2                                                   03404000
TRENDRT  EQU   TRENDKEY+1                                               03405000
TRENCPUS EQU   TRENDKEY+3                                               03406000
TRENDITM EQU   TRENDKEY+4                                               03407000
TRENDTMP EQU   TREND2+8                                                 03408000
EVTABLE  EQU   0                                                        03409000
EVSTOP   EQU   EVTABLE                                                  03410000
EVYEAR   EQU   EVSTOP                                                   03411000
EVDAY    EQU   EVSTOP+1                                                 03412000
EVNUM    EQU   EVTABLE+4                                                03413000
EVKEY    EQU   EVTABLE+6                                                03414000
EVMODEL  EQU   EVKEY                                                    03415000
EVSERIAL EQU   EVKEY+2                                                  03416000
EVLETTER EQU   EVKEY+5                                                  03417000
SORTABLE EQU   0                                                        03418000
SORTKEY  EQU   SORTABLE                                                 03419000
SORTCCHR EQU   SORTABLE+5                                               03420000
SYSUMONE EQU   0                                                        03421000
SYSUM2   EQU   0                                                        03422000
SYSUMKEY EQU   SYSUM2                                                   03423000
SYSRT    EQU   SYSUMKEY+1                                               03424000
SYSCPUS  EQU   SYSUMKEY+3                                               03425000
SYSITEM  EQU   SYSUMKEY+4                                               03426000
SYSTEMP  EQU   SYSUM2+7                                                 03427000
SHARE    EQU   0                                                        03428000
SHAREIO  EQU   SHARE+2                                                  03429000
SHRCUCPU EQU   SHAREIO                                                  03430000
SHARECUA EQU   SHRCUCPU                                                 03431000
EDITLOAD EQU   0                                                        03432000
EDITABLE EQU   EDITLOAD+4                                               03433000
CUA      EQU   0                                                        03434000
CUAVAL   EQU   CUA+2                                                    03435000
DEVICE   EQU   0                                                        03436000
MODELS   EQU   0                                                        03437000
DEVSERAL EQU   0                                                        03438000
VOLUME   EQU   0                                                        03439000
CPUS     EQU   0                                                        03440000
CPUCUAS  EQU   0                                                        03441000
LIBADR   EQU   0                                                        03442000
SYMCODE  EQU   0                                                        03443000
SYMVAL   EQU   SYMCODE+2                                                03444000
LRTREC   EQU   0                                                        03445000
LRTKEY   EQU   LRTREC                                                   03446000
LRTKEY1  EQU   LRTKEY                                                   03447000
LRTSMS   EQU   LRTREC+2                                                 03448000
LRTERRID EQU   LRTREC+3                                                 03449000
LRTDATE  EQU   LRTREC+8                                                 03450000
LRTYRDAY EQU   LRTDATE+1                                                03451000
LRTYEAR  EQU   LRTYRDAY                                                 03452000
LRTDAY   EQU   LRTYRDAY+1                                               03453000
LRTTIME  EQU   LRTREC+12                                                03454000
LRTCPU   EQU   LRTREC+16                                                03455000
LRTCPMOD EQU   LRTCPU+1                                                 03456000
LRTCPUS  EQU   LRTCPMOD                                                 03457000
LRTMODEL EQU   LRTCPMOD+3                                               03458000
MCHREC   EQU   0                                                        03459000
MCHHEAD  EQU   MCHREC                                                   03460000
MCHKEY   EQU   MCHHEAD                                                  03461000
MCHSMS   EQU   MCHHEAD+2                                                03462000
MCHSYSTR EQU   MCHSMS+1                                                 03463000
MCHCPUID EQU   MCHHEAD+16                                               03464000
MCHMOD   EQU   MCHCPUID+4                                               03465000
MCHJOBID EQU   MCHREC+32                                                03466000
MCHOPSW  EQU   MCHREC+40                                                03467000
CCHREC   EQU   0                                                        03468000
CCHHEAD  EQU   CCHREC                                                   03469000
CCHKEY   EQU   CCHHEAD                                                  03470000
CCHSMS   EQU   CCHHEAD+2                                                03471000
CCHRINC  EQU   CCHSMS                                                   03472000
CCHRCRH  EQU   CCHSMS+2                                                 03473000
CCHCPUID EQU   CCHHEAD+16                                               03474000
CCHJOBID EQU   CCHREC+24                                                03475000
CCHCSW   EQU   CCHREC+56                                                03476000
CCHCODE  EQU   CCHREC+68                                                03477000
CCHCODE2 EQU   CCHCODE+2                                                03478000
CCHCUA   EQU   CCHREC+74                                                03479000
OBRREC   EQU   0                                                        03480000
OBRHEAD  EQU   OBRREC                                                   03481000
OBRKEY   EQU   OBRHEAD                                                  03482000
OBRSMS   EQU   OBRHEAD+2                                                03483000
MISCSW   EQU   OBRSMS                                                   03484000
OBRSUBTP EQU   OBRSMS+1                                                 03485000
SDRCOUNT EQU   OBRSUBTP                                                 03486000
OBRTEMP  EQU   OBRSUBTP                                                 03487000
SHORTSW  EQU   OBRSUBTP                                                 03488000
DISMOUNT EQU   OBRSUBTP                                                 03489000
OBRCPUID EQU   OBRHEAD+16                                               03490000
OBRJOBID EQU   OBRREC+24                                                03491000
OBRSDEV2 EQU   OBRJOBID+2                                               03492000
OBRSCUA  EQU   OBRJOBID+5                                               03493000
OBRFCCW  EQU   OBRREC+32                                                03494000
OBRSRDS  EQU   OBRFCCW                                                  03495000
OBRCSW   EQU   OBRREC+40                                                03496000
OBRSTAT  EQU   OBRCSW+4                                                 03497000
OBRDEVDC EQU   OBRREC+48                                                03498000
OBRSECUA EQU   OBRREC+49                                                03499000
OBRCODE  EQU   OBRREC+52                                                03500000
OBRCODE1 EQU   OBRCODE                                                  03501000
OBRCODE2 EQU   OBRCODE1+1                                               03502000
OBRDEV   EQU   OBRCODE+2                                                03503000
OBRCLASS EQU   OBRDEV                                                   03504000
OBRLSDRC EQU   OBRREC+56                                                03505000
OBRPCUA  EQU   OBRREC+57                                                03506000
OBRSBCNT EQU   OBRREC+62                                                03507000
OBRVOL   EQU   OBRREC+64                                                03508000
OBRSEEK  EQU   OBRREC+70                                                03509000
OBRTCAM  EQU   OBRSEEK                                                  03510000
OBRTERMN EQU   OBRSEEK+2                                                03511000
SFTREC   EQU   0                                                        03512000
SFTHEAD  EQU   SFTREC                                                   03513000
SFTKEY   EQU   SFTHEAD                                                  03514000
SFTKEY1  EQU   SFTKEY                                                   03515000
SFTCPUID EQU   SFTHEAD+16                                               03516000
SFTJOBID EQU   SFTREC+24                                                03517000
SFTSDWA  EQU   SFTREC+32                                                03518000
SFTABNDC EQU   SFTSDWA                                                  03519000
SFTAEC1  EQU   SFTSDWA+96                                               03520000
SFTPROGC EQU   SFTAEC1+8                                                03521000
SFTFLGS  EQU   SFTSDWA+232                                              03522000
SFTRECP  EQU   SFTSDWA+292                                              03523000
SFTMODN  EQU   SFTRECP                                                  03524000
SFTCSECT EQU   SFTRECP+8                                                03525000
SFTREXN  EQU   SFTRECP+16                                               03526000
IPLREC   EQU   0                                                        03527000
IPLHEAD  EQU   IPLREC                                                   03528000
IPLKEY   EQU   IPLHEAD                                                  03529000
IPLCPUID EQU   IPLHEAD+16                                               03530000
IPLSYSID EQU   IPLREC+24                                                03531000
IPLREAS  EQU   IPLREC+28                                                03532000
IPLSTIME EQU   IPLREC+52                                                03533000
DDRREC   EQU   0                                                        03534000
DDRHEAD  EQU   DDRREC                                                   03535000
DDRKEY   EQU   DDRHEAD                                                  03536000
DDRSMS   EQU   DDRHEAD+2                                                03537000
DDRDEPSW EQU   DDRSMS+1                                                 03538000
DDRCPUID EQU   DDRHEAD+16                                               03539000
@NM00053 EQU   DDRREC+24                                                03540000
DDRJOBID EQU   @NM00053                                                 03541000
DDRVOL1  EQU   @NM00053+8                                               03542000
DDRVOL2  EQU   @NM00053+14                                              03543000
DDRFCUA  EQU   DDRREC+45                                                03544000
DDRFDEV  EQU   DDRREC+48                                                03545000
DDRCODE2 EQU   DDRFDEV+2                                                03546000
DDRTOCUA EQU   DDRREC+53                                                03547000
DDRTODEV EQU   DDRREC+56                                                03548000
DDRDEV2  EQU   DDRTODEV+2                                               03549000
MIHREC   EQU   0                                                        03550000
MIHHEAD  EQU   MIHREC                                                   03551000
MIHKEY   EQU   MIHHEAD                                                  03552000
@NM00055 EQU   MIHHEAD+4                                                03553000
MIHCEBIT EQU   @NM00055                                                 03554000
MIHDEBIT EQU   @NM00055                                                 03555000
MIHCPUID EQU   MIHHEAD+16                                               03556000
@NM00059 EQU   MIHREC+24                                                03557000
MIHJOBID EQU   @NM00059                                                 03558000
MIHCUA   EQU   MIHREC+35                                                03559000
MIHVOL   EQU   MIHREC+38                                                03560000
MIHDEV   EQU   MIHREC+44                                                03561000
MIHCODE2 EQU   MIHDEV+2                                                 03562000
EODREC   EQU   0                                                        03563000
EODHEAD  EQU   EODREC                                                   03564000
EODKEY   EQU   EODHEAD                                                  03565000
EODCPUID EQU   EODHEAD+16                                               03566000
TPRREC   EQU   0                                                        03567000
TPRHEAD  EQU   TPRREC                                                   03568000
TPRKEY   EQU   TPRHEAD                                                  03569000
TPRDEV   EQU   TPRHEAD+4                                                03570000
TPRBUFC  EQU   TPRHEAD+5                                                03571000
TPRCPUID EQU   TPRHEAD+16                                               03572000
TPRCUA   EQU   TPRREC+24                                                03573000
@NM00067 EQU   TPRREC+26                                                03574000
TPRVOL   EQU   @NM00067                                                 03575000
RERR     EQU   0                                                        03576000
OBRSENSE EQU   0                                                        03577000
OBRSEN1  EQU   OBRSENSE+1                                               03578000
NEXTBYTE EQU   0                                                        03579000
ADDNUM   EQU   0                                                        03580000
LAST     EQU   0                                                        03581000
NEWMDR   EQU   TIME1                                                    03582000
LINE002  EQU   TIME1                                                    03583000
TOPTEMP  EQU   TIME1+53                                                 03584000
DUPLICAT EQU   TIME1                                                    03585000
CCHFINSH EQU   CUA12                                                    03586000
OBRFINSH EQU   CUA12                                                    03587000
SFTFINSH EQU   CUA12                                                    03588000
IPLFINSH EQU   CUA12                                                    03589000
HEAD01   EQU   TIME1                                                    03590000
TODAYDT  EQU   CUA11                                                    03591000
TERMNAME EQU   VOLUME1                                                  03592000
DEVTYPE1 EQU   DEVICE1                                                  03593000
DAYSDATE EQU   TIME1+44                                                 03594000
HEDDATE  EQU   CUA11                                                    03595000
TOTALNM1 EQU   TIME1                                                    03596000
PRTLINE1 EQU   TIME1                                                    03597000
SSYS     EQU   PRTLINE1+37                                              03598000
REASON   EQU   PRTLINE1+46                                              03599000
PSWMCH   EQU   PRTLINE1+53                                              03600000
RCYRYXIT EQU   PRTLINE1+72                                              03601000
COMPMOD  EQU   PRTLINE1+82                                              03602000
CSECTID  EQU   PRTLINE1+92                                              03603000
ERRORID1 EQU   PRTLINE1+102                                             03604000
LINE0006 EQU   TIME1+32                                                 03605000
BADREC   EQU   TIME1                                                    03606000
NUMFAIL  EQU   TIME1+8                                                  03607000
LINE44   EQU   CUA12                                                    03608000
ERRORNA  EQU   ERRORID1                                                 03609000
TOTALHD2 EQU   TIME1                                                    03610000
WORKOVER EQU   WORK                                                     03611000
HEADTOTL EQU   TIME1                                                    03612000
RECNAME  EQU   HEADTOTL                                                 03613000
TOTALVAL EQU   HEADTOTL+26                                              03614000
NMETOTAL EQU   MCH                                                      03615000
TOTALNME EQU   RECNAME+4                                                03616000
COUNT    EQU   MCHCT                                                    03617000
CPULINE1 EQU   TIME1                                                    03618000
MVCOVER  EQU   TIME1                                                    03619000
NEWDATEO EQU   TIME1                                                    03620000
MDROBRLN EQU   TIME1+71                                                 03621000
PSWMCH1  EQU   PSWMCH                                                   03622000
LINEFRM1 EQU   CUA12                                                    03623000
BADCOUNT EQU   TIME1                                                    03624000
DDRFINSH EQU   CUA12                                                    03625000
HEAD1    EQU   LINE01                                                   03626000
LINE004  EQU   CUA12                                                    03627000
LINE006  EQU   TIME1+54                                                 03628000
LOSTSOFT EQU   SENSEA1                                                  03629000
ODDMOVE  EQU   TIME1                                                    03630000
RECCOUNT EQU   MCHCT                                                    03631000
TOTALHD4 EQU   TOTALVAL                                                 03632000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03633000
@NM00110 EQU   HEADTOTL+36                                              03634000
CPUA1    EQU   HEADTOTL+32                                              03635000
FORTOTAL EQU   TOTALVAL+1                                               03636000
@NM00109 EQU   TOTALVAL                                                 03637000
@NM00108 EQU   HEADTOTL+22                                              03638000
RTYPE    EQU   RECNAME                                                  03639000
@NM00106 EQU   PRTLINE1+100                                             03640000
@NM00105 EQU   PRTLINE1+90                                              03641000
@NM00104 EQU   PRTLINE1+80                                              03642000
@NM00103 EQU   PRTLINE1+70                                              03643000
PROGEC   EQU   PRTLINE1+62                                              03644000
@NM00102 EQU   PRTLINE1+61                                              03645000
@NM00101 EQU   PRTLINE1+52                                              03646000
@NM00100 EQU   PRTLINE1+41                                              03647000
@NM00099 EQU   PRTLINE1+30                                              03648000
RECTYP2  EQU   PRTLINE1+23                                              03649000
@NM00098 EQU   PRTLINE1+22                                              03650000
JOBNAME2 EQU   PRTLINE1+14                                              03651000
@NM00097 EQU   PRTLINE1+13                                              03652000
TIME2    EQU   PRTLINE1+2                                               03653000
@NM00096 EQU   PRTLINE1                                                 03654000
YR       EQU   DAYSDATE+4                                               03655000
@NM00093 EQU   DAYSDATE+3                                               03656000
DAY      EQU   DAYSDATE                                                 03657000
OBRSEN0  EQU   OBRSENSE                                                 03658000
DVBSDRE  EQU   TPRREC+56                                                03659000
@NM00069 EQU   TPRREC+39                                                03660000
TPRMODE  EQU   TPRREC+38                                                03661000
TPRLINAD EQU   TPRREC+36                                                03662000
@NM00068 EQU   TPRREC+34                                                03663000
TPRCEL   EQU   TPRCPUID+6                                               03664000
TPRMODEL EQU   TPRCPUID+4                                               03665000
TPRSER   EQU   TPRCPUID+1                                               03666000
@NM00066 EQU   TPRCPUID                                                 03667000
TPRTIME  EQU   TPRHEAD+12                                               03668000
TPRDATE  EQU   TPRHEAD+8                                                03669000
@NM00065 EQU   TPRHEAD+6                                                03670000
TPRLENGT EQU   TPRBUFC                                                  03671000
@NM00064 EQU   TPRBUFC                                                  03672000
TPRSMS   EQU   TPRHEAD+2                                                03673000
TPRKEY2  EQU   TPRKEY+1                                                 03674000
TPRKEY1  EQU   TPRKEY                                                   03675000
EODCEL   EQU   EODCPUID+6                                               03676000
EODMODEL EQU   EODCPUID+4                                               03677000
EODSER   EQU   EODCPUID+1                                               03678000
@NM00063 EQU   EODCPUID                                                 03679000
EODTIME  EQU   EODHEAD+12                                               03680000
EODDATE  EQU   EODHEAD+8                                                03681000
@NM00062 EQU   EODHEAD+5                                                03682000
EODDEV   EQU   EODHEAD+4                                                03683000
EODSMS   EQU   EODHEAD+2                                                03684000
EODKEY2  EQU   EODKEY+1                                                 03685000
EODKEY1  EQU   EODKEY                                                   03686000
MIHTYPE  EQU   MIHCODE2+1                                               03687000
MIHCLASS EQU   MIHCODE2                                                 03688000
@NM00061 EQU   MIHDEV                                                   03689000
@NM00060 EQU   @NM00059+8                                               03690000
MIHCEL   EQU   MIHCPUID+6                                               03691000
MIHMOD   EQU   MIHCPUID+4                                               03692000
MIHSER   EQU   MIHCPUID+1                                               03693000
@NM00058 EQU   MIHCPUID                                                 03694000
MIHTIME  EQU   MIHHEAD+12                                               03695000
MIHDATE  EQU   MIHHEAD+8                                                03696000
@NM00057 EQU   MIHHEAD+5                                                03697000
@NM00056 EQU   @NM00055                                                 03698000
MIHSMS   EQU   MIHHEAD+2                                                03699000
MIHKEY2  EQU   MIHKEY+1                                                 03700000
MIHKEY1  EQU   MIHKEY                                                   03701000
DDRDEV1  EQU   DDRTODEV                                                 03702000
@NM00054 EQU   DDRREC+52                                                03703000
DDRTYPE  EQU   DDRCODE2+1                                               03704000
DDRCLASS EQU   DDRCODE2                                                 03705000
DDRCODE1 EQU   DDRFDEV                                                  03706000
DDRPHD   EQU   @NM00053+20                                              03707000
DDRCEL   EQU   DDRCPUID+6                                               03708000
DDRMOD   EQU   DDRCPUID+4                                               03709000
DDRSER   EQU   DDRCPUID+1                                               03710000
@NM00052 EQU   DDRCPUID                                                 03711000
DDRTIME  EQU   DDRHEAD+12                                               03712000
DDRDATE  EQU   DDRHEAD+8                                                03713000
@NM00051 EQU   DDRHEAD+4                                                03714000
@NM00050 EQU   DDRSMS                                                   03715000
DDRKEY2  EQU   DDRKEY+1                                                 03716000
DDRKEY1  EQU   DDRKEY                                                   03717000
IPLSHSEC EQU   IPLSTIME+3                                               03718000
IPLSSEC  EQU   IPLSTIME+2                                               03719000
IPLSMIN  EQU   IPLSTIME+1                                               03720000
IPLSHOUR EQU   IPLSTIME                                                 03721000
IPLSDATE EQU   IPLREC+48                                                03722000
IPLTEMP  EQU   IPLREC+46                                                03723000
IPLHIGH  EQU   IPLREC+42                                                03724000
IPLCHAN  EQU   IPLREC+32                                                03725000
@NM00049 EQU   IPLREC+30                                                03726000
@NM00048 EQU   IPLREC+25                                                03727000
IPLCEL   EQU   IPLCPUID+6                                               03728000
IPLMOD   EQU   IPLCPUID+4                                               03729000
IPLSER   EQU   IPLCPUID+1                                               03730000
@NM00047 EQU   IPLCPUID                                                 03731000
IPLTIME  EQU   IPLHEAD+12                                               03732000
IPLDATE  EQU   IPLHEAD+8                                                03733000
@NM00046 EQU   IPLHEAD+4                                                03734000
IPLSMS   EQU   IPLHEAD+2                                                03735000
IPLKEY2  EQU   IPLKEY+1                                                 03736000
IPLKEY1  EQU   IPLKEY                                                   03737000
SFTXDATA EQU   SFTREC+434                                               03738000
SFTLVARA EQU   SFTREC+432                                               03739000
@NM00045 EQU   SFTSDWA+238                                              03740000
SFTLCPUA EQU   SFTSDWA+236                                              03741000
SFTERRD  EQU   SFTFLGS+3                                                03742000
SFTERRC  EQU   SFTFLGS+2                                                03743000
SFTERRB  EQU   SFTFLGS+1                                                03744000
SFTERRA  EQU   SFTFLGS                                                  03745000
@NM00044 EQU   SFTSDWA+136                                              03746000
SFTAAEC1 EQU   SFTSDWA+120                                              03747000
@NM00043 EQU   SFTSDWA+112                                              03748000
@NM00042 EQU   SFTAEC1                                                  03749000
@NM00041 EQU   SFTSDWA+88                                               03750000
SFTGRSV  EQU   SFTSDWA+24                                               03751000
SFTCEL   EQU   SFTCPUID+6                                               03752000
SFTMOD   EQU   SFTCPUID+4                                               03753000
SFTSER   EQU   SFTCPUID+1                                               03754000
@NM00040 EQU   SFTCPUID                                                 03755000
SFTTIME  EQU   SFTHEAD+12                                               03756000
SFTDATE  EQU   SFTHEAD+8                                                03757000
@NM00039 EQU   SFTHEAD+4                                                03758000
SFTSMS   EQU   SFTHEAD+2                                                03759000
SFTKEY2  EQU   SFTKEY+1                                                 03760000
OBR34CT2 EQU   OBRTERMN+5                                               03761000
OBR34CT1 EQU   OBRTERMN+4                                               03762000
@NM00038 EQU   OBRTERMN                                                 03763000
@NM00037 EQU   OBRSEEK+1                                                03764000
OBRRETRY EQU   OBRREC+60                                                03765000
OBRTYPE  EQU   OBRDEV+1                                                 03766000
@NM00036 EQU   OBRCODE1                                                 03767000
@NM00035 EQU   OBRCSW                                                   03768000
OBRSDRS2 EQU   OBRSRDS                                                  03769000
OBRSDRS1 EQU   OBRSRDS                                                  03770000
OBRSSDRC EQU   OBRJOBID+4                                               03771000
OBRSDEV1 EQU   OBRJOBID                                                 03772000
OBRCEL   EQU   OBRCPUID+6                                               03773000
OBRMOD   EQU   OBRCPUID+4                                               03774000
OBRSER   EQU   OBRCPUID+1                                               03775000
@NM00034 EQU   OBRCPUID                                                 03776000
OBRTIME  EQU   OBRHEAD+12                                               03777000
OBRDATE  EQU   OBRHEAD+8                                                03778000
@NM00033 EQU   OBRHEAD+4                                                03779000
@NM00032 EQU   OBRSUBTP                                                 03780000
@NM00031 EQU   OBRSUBTP                                                 03781000
@NM00030 EQU   MISCSW                                                   03782000
TRUNC    EQU   MISCSW                                                   03783000
@NM00029 EQU   MISCSW                                                   03784000
OBRKEY2  EQU   OBRKEY+1                                                 03785000
OBRKEY1  EQU   OBRKEY                                                   03786000
CCHLOG   EQU   CCHREC+80                                                03787000
CCHMP    EQU   CCHREC+76                                                03788000
@NM00028 EQU   CCHREC+73                                                03789000
CCHID    EQU   CCHREC+72                                                03790000
CCHTYPE  EQU   CCHCODE2+1                                               03791000
CCHCLASS EQU   CCHCODE2                                                 03792000
CCHCODE1 EQU   CCHCODE                                                  03793000
CCHECSW  EQU   CCHREC+64                                                03794000
CCHFCCW  EQU   CCHREC+48                                                03795000
CCHATIO  EQU   CCHREC+32                                                03796000
CCHCEL   EQU   CCHCPUID+6                                               03797000
CCHMOD   EQU   CCHCPUID+4                                               03798000
CCHSER   EQU   CCHCPUID+1                                               03799000
@NM00027 EQU   CCHCPUID                                                 03800000
CCHTIME  EQU   CCHHEAD+12                                               03801000
CCHDATE  EQU   CCHHEAD+8                                                03802000
@NM00026 EQU   CCHHEAD+5                                                03803000
@NM00025 EQU   CCHSMS+2                                                 03804000
@NM00024 EQU   CCHSMS+1                                                 03805000
@NM00023 EQU   CCHSMS                                                   03806000
@NM00022 EQU   CCHSMS                                                   03807000
CCHKEY2  EQU   CCHKEY+1                                                 03808000
CCHKEY1  EQU   CCHKEY                                                   03809000
MCHLOG   EQU   MCHREC+48                                                03810000
MCHPGMID EQU   MCHREC+24                                                03811000
MCHCEL   EQU   MCHCPUID+6                                               03812000
MCHSER   EQU   MCHCPUID+1                                               03813000
@NM00021 EQU   MCHCPUID                                                 03814000
MCHTIME  EQU   MCHHEAD+12                                               03815000
MCHDATE  EQU   MCHHEAD+8                                                03816000
@NM00020 EQU   MCHHEAD+4                                                03817000
@NM00019 EQU   MCHSMS                                                   03818000
MCHKEY2  EQU   MCHKEY+1                                                 03819000
MCHKEY1  EQU   MCHKEY                                                   03820000
LRTMCEL  EQU   LRTCPU+6                                                 03821000
@NM00018 EQU   LRTCPU                                                   03822000
LRTHSECS EQU   LRTTIME+3                                                03823000
LRTSEC   EQU   LRTTIME+2                                                03824000
LRTMIN   EQU   LRTTIME+1                                                03825000
LRTHOUR  EQU   LRTTIME                                                  03826000
LRTDATE0 EQU   LRTDATE                                                  03827000
@NM00017 EQU   LRTREC+4                                                 03828000
LRTDSMNT EQU   LRTERRID                                                 03829000
@NM00016 EQU   LRTERRID                                                 03830000
LRTSHRT  EQU   LRTERRID                                                 03831000
@NM00015 EQU   LRTERRID                                                 03832000
@NM00014 EQU   LRTSMS                                                   03833000
LRTIMCNV EQU   LRTSMS                                                   03834000
@NM00013 EQU   LRTSMS                                                   03835000
LRTRUNC  EQU   LRTSMS                                                   03836000
LRNS     EQU   LRTSMS                                                   03837000
@NM00012 EQU   LRTSMS                                                   03838000
LRTKEY2  EQU   LRTKEY+1                                                 03839000
SYMVAL2  EQU   SYMVAL+2                                                 03840000
SYMVAL1  EQU   SYMVAL                                                   03841000
SYMCDNUM EQU   SYMCODE                                                  03842000
LIBVAL   EQU   LIBADR+2                                                 03843000
LIBADNUM EQU   LIBADR                                                   03844000
CPUCUAV  EQU   CPUCUAS+2                                                03845000
CPCUANUM EQU   CPUCUAS                                                  03846000
CPUVAL   EQU   CPUS+2                                                   03847000
CPUNUM   EQU   CPUS                                                     03848000
VOLVAL   EQU   VOLUME+2                                                 03849000
VOLNUM   EQU   VOLUME                                                   03850000
SERVAL   EQU   DEVSERAL+2                                               03851000
SERNUM   EQU   DEVSERAL                                                 03852000
MODVAL   EQU   MODELS+2                                                 03853000
MODNUM   EQU   MODELS                                                   03854000
MDRVAL   EQU   DEVICE+36                                                03855000
MDRNUM   EQU   DEVICE+34                                                03856000
DEVVAL   EQU   DEVICE+2                                                 03857000
DEVNUM   EQU   DEVICE                                                   03858000
CUA2     EQU   CUAVAL+2                                                 03859000
CUA1     EQU   CUAVAL                                                   03860000
CUANUM   EQU   CUA                                                      03861000
LOADPTR  EQU   EDITABLE+8                                               03862000
LOADNAME EQU   EDITABLE                                                 03863000
EDITNUM  EQU   EDITLOAD                                                 03864000
SHARLET  EQU   SHAREIO+10                                               03865000
SHARSERB EQU   SHAREIO+7                                                03866000
SHARECUB EQU   SHAREIO+5                                                03867000
SHARSERA EQU   SHRCUCPU+2                                               03868000
SHAREDX  EQU   SHARECUA                                                 03869000
SHARENUM EQU   SHARE                                                    03870000
@NM00011 EQU   SYSTEMP                                                  03871000
SYSPERM  EQU   SYSTEMP                                                  03872000
SYSDEV   EQU   SYSUM2+5                                                 03873000
SYSOLDA  EQU   SYSITEM                                                  03874000
SYS3705  EQU   SYSITEM                                                  03875000
SYSOLD   EQU   SYSCPUS                                                  03876000
SYSCPU   EQU   SYSCPUS                                                  03877000
SYSCUA   EQU   SYSRT                                                    03878000
SYSGROUP EQU   SYSUMKEY                                                 03879000
SYSUMEOD EQU   SYSUMONE+96                                              03880000
SYSUMPER EQU   SYSUMONE+92                                              03881000
SYSUMPEA EQU   SYSUMONE+88                                              03882000
SYSUMPEI EQU   SYSUMONE+84                                              03883000
SYSUMCH  EQU   SYSUMONE+20                                              03884000
SYSUMMCN EQU   SYSUMONE+16                                              03885000
SYSUMMCR EQU   SYSUMONE+12                                              03886000
SYSUMNXT EQU   SYSUMONE+8                                               03887000
SYSUMIPL EQU   SYSUMONE+4                                               03888000
SYSUMNUM EQU   SYSUMONE                                                 03889000
SORTCORE EQU   SORTCCHR                                                 03890000
SORTTIME EQU   SORTKEY+1                                                03891000
SORTYEAR EQU   SORTKEY                                                  03892000
TRENDPRM EQU   TRENDTMP                                                 03893000
TRENDDEV EQU   TREND2+6                                                 03894000
TRENDDAT EQU   TRENDKEY+5                                               03895000
TRENDOD  EQU   TRENDITM                                                 03896000
TREND037 EQU   TRENDITM                                                 03897000
TRENDOLD EQU   TRENCPUS                                                 03898000
TRENDCPU EQU   TRENCPUS                                                 03899000
@NM00010 EQU   TRENDRT+1                                                03900000
TRENDCUA EQU   TRENDRT                                                  03901000
TRENDGRP EQU   TRENDKEY                                                 03902000
TREPRE   EQU   TREGEN+12                                                03903000
TRECCH   EQU   TREGEN+8                                                 03904000
TREMCH   EQU   TREGEN+4                                                 03905000
TREIPL   EQU   TREGEN                                                   03906000
TRENUM   EQU   TRENDONE+4                                               03907000
TRENEXT  EQU   TRENDONE                                                 03908000
DUMPSIZE EQU   DUMPINFO+4                                               03909000
DUMPADR  EQU   DUMPINFO                                                 03910000
DUMPNUM  EQU   DUMPTABL                                                 03911000
ADCPUT   EQU   PARM+144                                                 03912000
@NM00009 EQU   CCHHRLNG+5                                               03913000
USERPGM  EQU   PARM+102                                                 03914000
IDTSEC   EQU   IDTIME+3                                                 03915000
IDSEC    EQU   IDTIME+2                                                 03916000
IDMIN    EQU   IDTIME+1                                                 03917000
IDHOUR   EQU   IDTIME                                                   03918000
IDASID   EQU   ERRID+4                                                  03919000
IDCPU    EQU   ERRID+3                                                  03920000
@NM00008 EQU   ERRID+2                                                  03921000
IDVALUE  EQU   ERRID                                                    03922000
NUMDAYS  EQU   PARM+88                                                  03923000
TABSIZE  EQU   PARM+80                                                  03924000
@NM00007 EQU   PARM+75                                                  03925000
@NM00006 EQU   PARM+72                                                  03926000
WRTHRSH  EQU   PARM+69                                                  03927000
RDTHRSH  EQU   PARM+66                                                  03928000
TERM     EQU   PARM+58                                                  03929000
PENSEC2  EQU   ENDTIME2+2                                               03930000
PENMIN2  EQU   ENDTIME2+1                                               03931000
PENHOUR2 EQU   ENDTIME2                                                 03932000
PSTSEC2  EQU   STTIME2+2                                                03933000
PSTMIN2  EQU   STTIME2+1                                                03934000
PSTHOUR2 EQU   STTIME2                                                  03935000
PENSEC1  EQU   ENDTIME1+2                                               03936000
PENMIN1  EQU   ENDTIME1+1                                               03937000
PENHOUR1 EQU   ENDTIME1                                                 03938000
PSTSEC1  EQU   STTIME1+2                                                03939000
PSTMIN1  EQU   STTIME1+1                                                03940000
PSTHOUR1 EQU   STTIME1                                                  03941000
@NM00005 EQU   ENDDT+4                                                  03942000
PENDY    EQU   PEND+1                                                   03943000
PENYR    EQU   PEND                                                     03944000
@NM00004 EQU   ENDDATE                                                  03945000
@NM00003 EQU   STDT+4                                                   03946000
PSTDY    EQU   PSTD+1                                                   03947000
PSTYR    EQU   PSTD                                                     03948000
@NM00002 EQU   STDATE                                                   03949000
YEARNOW  EQU   DATENOW+4                                                03950000
@NM00001 EQU   DATENOW+3                                                03951000
DAYNOW   EQU   DATENOW                                                  03952000
CSNAP    EQU   CLOSEIO                                                  03953000
CDRCTWRK EQU   CLOSEIO                                                  03954000
CSYSIN   EQU   CLOSEIO                                                  03955000
CACCDEV  EQU   CLOSEIO                                                  03956000
CACCIN   EQU   CLOSEIO                                                  03957000
CSERLOG  EQU   CLOSEIO                                                  03958000
CEREPPT  EQU   CLOSEIO                                                  03959000
CTOURIST EQU   CLOSEIO                                                  03960000
OSNAP    EQU   OPENIO                                                   03961000
ODRCTWRK EQU   OPENIO                                                   03962000
OSYSIN   EQU   OPENIO                                                   03963000
OACCDEV  EQU   OPENIO                                                   03964000
OACCIN   EQU   OPENIO                                                   03965000
OSERLOG  EQU   OPENIO                                                   03966000
OEREPPT  EQU   OPENIO                                                   03967000
OTOURIST EQU   OPENIO                                                   03968000
PASSFLAG EQU   MISC                                                     03969000
PLOGREC  EQU   MISC                                                     03970000
ERRORID  EQU   MISC                                                     03971000
PSUM     EQU   PRINTES                                                  03972000
PEDIT    EQU   PRINTES                                                  03973000
PHIST    EQU   MISC                                                     03974000
PACC     EQU   MISC                                                     03975000
PZERO    EQU   MISC                                                     03976000
DEBUG63  EQU   DEBUGA+3                                                 03977000
DEBUG62  EQU   DEBUGA+3                                                 03978000
DEBUG61  EQU   DEBUGA+3                                                 03979000
DEBUG60  EQU   DEBUGA+3                                                 03980000
DEBUG59  EQU   DEBUGA+3                                                 03981000
DEBUG58  EQU   DEBUGA+3                                                 03982000
DEBUG57  EQU   DEBUGA+3                                                 03983000
DEBUG56  EQU   DEBUGA+3                                                 03984000
DEBUG55  EQU   DEBUGA+2                                                 03985000
DEBUG54  EQU   DEBUGA+2                                                 03986000
DEBUG53  EQU   DEBUGA+2                                                 03987000
DEBUG52  EQU   DEBUGA+2                                                 03988000
DEBUG51  EQU   DEBUGA+2                                                 03989000
DEBUG50  EQU   DEBUGA+2                                                 03990000
DEBUG49  EQU   DEBUGA+2                                                 03991000
DEBUG48  EQU   DEBUGA+2                                                 03992000
DEBUG45  EQU   DEBUGA+1                                                 03993000
DEBUG44  EQU   DEBUGA+1                                                 03994000
DEBUG43  EQU   DEBUGA+1                                                 03995000
DEBUG42  EQU   DEBUGA+1                                                 03996000
DEBUG41  EQU   DEBUGA+1                                                 03997000
DEBUG40  EQU   DEBUGA+1                                                 03998000
DEBUG39  EQU   DEBUGA                                                   03999000
DEBUG38  EQU   DEBUGA                                                   04000000
DEBUG37  EQU   DEBUGA                                                   04001000
DEBUG36  EQU   DEBUGA                                                   04002000
DEBUG35  EQU   DEBUGA                                                   04003000
DEBUG34  EQU   DEBUGA                                                   04004000
DEBUG33  EQU   DEBUGA                                                   04005000
DEBUG32  EQU   DEBUGA                                                   04006000
DEBUG31  EQU   DEBUG+3                                                  04007000
DEBUG30  EQU   DEBUG+3                                                  04008000
DEBUG28  EQU   DEBUG+3                                                  04009000
DEBUG27  EQU   DEBUG+3                                                  04010000
DEBUG26  EQU   DEBUG+3                                                  04011000
DEBUG25  EQU   DEBUG+3                                                  04012000
DEBUG23  EQU   DEBUG+2                                                  04013000
DEBUG22  EQU   DEBUG+2                                                  04014000
DEBUG21  EQU   DEBUG+2                                                  04015000
DEBUG20  EQU   DEBUG+2                                                  04016000
DEBUG19  EQU   DEBUG+2                                                  04017000
DEBUG18  EQU   DEBUG+2                                                  04018000
DEBUG16  EQU   DEBUG+2                                                  04019000
DEBUG15  EQU   DEBUG+1                                                  04020000
DEBUG14  EQU   DEBUG+1                                                  04021000
DEBUG13  EQU   DEBUG+1                                                  04022000
DEBUG11  EQU   DEBUG+1                                                  04023000
DEBUG10  EQU   DEBUG+1                                                  04024000
DEBUG9   EQU   DEBUG+1                                                  04025000
DEBUG8   EQU   DEBUG+1                                                  04026000
DEBUG7   EQU   DEBUG                                                    04027000
DEBUG3   EQU   DEBUG                                                    04028000
DEBUG2   EQU   DEBUG                                                    04029000
DEBUG1   EQU   DEBUG                                                    04030000
DEBUG0   EQU   DEBUG                                                    04031000
SHIFT3RD EQU   SWITCHES+1                                               04032000
DEVEXCL  EQU   SWITCHES+1                                               04033000
ZEROALL  EQU   SWITCHES+1                                               04034000
NOTALL   EQU   SWITCHES+1                                               04035000
NOSDR    EQU   SWITCHES                                                 04036000
TIMESEQ  EQU   SWITCHES                                                 04037000
SYSUM    EQU   SWITCHES                                                 04038000
PARMTHR  EQU   SWITCHES                                                 04039000
TREND    EQU   SWITCHES                                                 04040000
SHORTOBR EQU   SWITCHES                                                 04041000
PARMMES  EQU   SWITCHES                                                 04042000
RDESUM   EQU   SWITCHES                                                 04043000
PTTYP    EQU   RECTYPE+1                                                04044000
PEOD     EQU   RECTYPE                                                  04045000
PMIH     EQU   RECTYPE                                                  04046000
PDDR     EQU   RECTYPE                                                  04047000
PIPL     EQU   RECTYPE                                                  04048000
PSOFT    EQU   RECTYPE                                                  04049000
POBR     EQU   RECTYPE                                                  04050000
PCHAN    EQU   RECTYPE                                                  04051000
PMCH     EQU   RECTYPE                                                  04052000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04053000
@RF00411 EQU   @EL00008                                                 04054000
L000113  EQU   @EL00010                                                 04055000
L000112  EQU   @EL00010                                                 04056000
@RF00810 EQU   @EL00011                                                 04057000
@RF00817 EQU   @EL00011                                                 04058000
@RF00853 EQU   @EL00013                                                 04059000
@RF00869 EQU   @EL00014                                                 04060000
@RC00934 EQU   @EL00027                                                 04061000
@RC00932 EQU   @EL00027                                                 04062000
@RC00930 EQU   @EL00027                                                 04063000
@RC00928 EQU   @EL00027                                                 04064000
@RC00926 EQU   @EL00027                                                 04065000
@RC00924 EQU   @EL00027                                                 04066000
@RC00922 EQU   @EL00027                                                 04067000
@RC00920 EQU   @EL00027                                                 04068000
@RC00918 EQU   @EL00027                                                 04069000
@RC00916 EQU   @EL00027                                                 04070000
@RC00960 EQU   @EL00028                                                 04071000
@RC00958 EQU   @EL00028                                                 04072000
@RC00956 EQU   @EL00028                                                 04073000
@RC00954 EQU   @EL00028                                                 04074000
@RC00952 EQU   @EL00028                                                 04075000
@RC00950 EQU   @EL00028                                                 04076000
@RC00948 EQU   @EL00028                                                 04077000
@RC00946 EQU   @EL00028                                                 04078000
@RC00944 EQU   @EL00028                                                 04079000
@RC00942 EQU   @EL00028                                                 04080000
@RC00940 EQU   @EL00028                                                 04081000
@PB00029 EQU   @PB00030                                                 04082000
@RF01024 EQU   @RC01014                                                 04083000
@RF01027 EQU   @RC01014                                                 04084000
@RF01064 EQU   @EL00001                                                 04085000
@RC00488 EQU   L000113                                                  04086000
@RC00583 EQU   L000113                                                  04087000
@RC00578 EQU   L000113                                                  04088000
@RC00573 EQU   L000113                                                  04089000
@RC00568 EQU   L000113                                                  04090000
@RC00562 EQU   L000113                                                  04091000
@RF00707 EQU   L000113                                                  04092000
@RC00764 EQU   L000113                                                  04093000
@PB00028 EQU   @PB00029                                                 04094000
@PB00027 EQU   @PB00028                                                 04095000
@PB00026 EQU   @PB00027                                                 04096000
@PB00025 EQU   @PB00026                                                 04097000
@PB00024 EQU   @PB00025                                                 04098000
@PB00023 EQU   @PB00024                                                 04099000
@PB00022 EQU   @PB00023                                                 04100000
@PB00021 EQU   @PB00022                                                 04101000
@PB00020 EQU   @PB00021                                                 04102000
@PB00019 EQU   @PB00020                                                 04103000
@PB00018 EQU   @PB00019                                                 04104000
@PB00017 EQU   @PB00018                                                 04105000
@PB00016 EQU   @PB00017                                                 04106000
@PB00015 EQU   @PB00016                                                 04107000
@PB00014 EQU   @PB00015                                                 04108000
@PB00013 EQU   @PB00014                                                 04109000
@PB00012 EQU   @PB00013                                                 04110000
@PB00011 EQU   @PB00012                                                 04111000
@PB00010 EQU   @PB00011                                                 04112000
@PB00009 EQU   @PB00010                                                 04113000
@PB00008 EQU   @PB00009                                                 04114000
@PB00007 EQU   @PB00008                                                 04115000
@PB00006 EQU   @PB00007                                                 04116000
@PB00005 EQU   @PB00006                                                 04117000
@PB00004 EQU   @PB00005                                                 04118000
@PB00003 EQU   @PB00004                                                 04119000
@PB00002 EQU   @PB00003                                                 04120000
@ENDDATA EQU   *                                                        04121000
         END   IFCEVENT                                                 04122000
